[
  {
    "video_id": "ipm1LSctaHA",
    "title": "Stock Market Recap | Options Trading for Beginners",
    "url": "https://www.youtube.com/watch?v=ipm1LSctaHA",
    "upload_date": "20250330",
    "view_count": "0",
    "duration": "P0D",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Learn About Erik. https://www.outliertrading.io\n\n▬ AFFILIATES  \n► 50% off Options Omega Backtesting. https://optionomega.com/register/esinvests\n►50% off the ORATS Platform and Tool Suite! \nhttps://orats.com/esinvests\n► Barchart Premium - Try for Free. https://www.barchart.com/get-barchart-premier?fpr=xaiek\n► 5% off Unusual Whales Options Flow Platform. http://unusualwhales.com/referral#esinvests\n\n▬ VIDEO\n#optionstrading \n\nTimestamps.\n\n\nDISCLAIMER:\nThe content presented is for informational purposes only and should not be considered as financial advice. esInvests, its affiliates, and employees are not responsible for any investment decisions made based on the information presented in these videos. All investment and trading activities involve risk, and viewers should carefully consider their financial situation, investment goals, and risk tolerance before making any investment decisions.\n\nAny opinions, news, research, analyses, or other information contained in these videos are provided as general market commentary and do not constitute investment advice. esInvests does not guarantee the accuracy, completeness, or reliability of any information presented in these videos and is not liable for any losses or damages arising from the use of or reliance on this information. Viewers are encouraged to seek professional financial advice from a licensed investment advisor before making any investment decisions.\n\nBy accessing and watching these videos, viewers acknowledge and agree to these disclosures and terms of use.",
    "published_at": "2025-03-30T22:03:13Z",
    "channel_id": "UCBv-ZXHocgw97AfDG5yz9xw",
    "channel_title": "Outlier Trading",
    "tags": [
      "outlier trading",
      "options trading"
    ],
    "category_id": "24",
    "live_broadcast_content": "upcoming",
    "default_language": "en",
    "dimension": "2d",
    "definition": "sd",
    "caption": "false",
    "licensed_content": true,
    "projection": "rectangular",
    "like_count": "0",
    "comment_count": "0",
    "favorite_count": "0",
    "thumbnail_url": "https://i.ytimg.com/vi/ipm1LSctaHA/hqdefault_live.jpg",
    "content_summary": "Join the Outlier Pro Patreon Community for weekly livestreams, private community, market   trade analysis, direct Q A,   more. Free Guide for Beginner Options Traders. Subscribe to the Outlier Insi...",
    "privacy_status": "public",
    "license": "youtube",
    "embeddable": true
  }
]