[
  {
    "text": "What is up, outliers. Happy Friday and today we have options trading for beginners. On the agenda is going to be kind of a quick conversational quiz. And then after our conversational quiz, I want to take a look at some case studies. But the conversation today is very open-ended. This is kind of our first departure from a regimented series of topics. So this is part of 11, episode 11, whatever we want to call it, number 11. So I'm using this as a bit of a gauge to see where we're at, how people are feeling about options to kind of see where we're sitting. Because then I'm going to make another piece of curriculum for us that will go on essentially for another nine episodes beyond this. So the way I'm looking at it is like the first 10 episodes we've done have been really designed to lay the foundation for the rest of this. And then my intention is going forward. I want us to continue building off of what we've learned so far. And then for newer traders that are just joining us in the series, you can essentially go back into what we've covered so far. And then get kind of caught up with where we're at now and then go from there. So that's what I'm thinking today. And then for everybody's awareness tomorrow is going to be a GME live stream at 5pm Pacific time. So we'll cover that kind of in",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 60,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=0"
    }
  },
  {
    "text": "so far. And then get kind of caught up with where we're at now and then go from there. So that's what I'm thinking today. And then for everybody's awareness tomorrow is going to be a GME live stream at 5pm Pacific time. So we'll cover that kind of in detail tomorrow. So that's the upcoming agenda. Now in the meantime, while we're waiting for a couple folks to trickle their way in, I have a couple more pictures from Alaska. I thought I would show you guys because I recently went on a trip there, flew the drone, had a bunch of fun. And so I'll kind of flip through some of these. I don't know which ones I showed you already and which ones I didn't. But I'll kind of like I said, I'll just blast through some of these so that you can kind of check out some of what we saw because we were kind of stunned by what we saw. This is all this big giant glacier area that we were hanging around. And this is kind of like this trail that takes you up to this glacier. So there's a giant big ice field essentially on the other side of this, which is really cool. And then if you guys haven't seen before, that's a close-up of what it looks like kind of top down on a glacier, which I find the texture is absolutely fascinating, which is why obviously I share this picture.",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 60,
      "start_timestamp": "00:01:19",
      "start_timestamp_seconds": 79.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=79"
    }
  },
  {
    "text": "essentially on the other side of this, which is really cool. And then if you guys haven't seen before, that's a close-up of what it looks like kind of top down on a glacier, which I find the texture is absolutely fascinating, which is why obviously I share this picture. I also like this one a lot. I don't know why I think it's because of the mix of like live trees and dead trees, life and death. I don't know, maybe I'm just super artistic and I don't know it. But I like that one a lot. And then I will show you guys this last one. I don't know if you've seen it, but that one I just thought was super cool. We just have this bald eagle, let it rip. And what is just super cool backdrop. So yeah, couple photos for you guys. The trip was overall sick. I do have a video of some of the helicopter ride that we went on if you are ever interested in checking that out. But that's what I got for us so far. All right, gang. So let's get into the option side of the house. First we got to say hello to everybody. We got Liz, Paulo, Spascar, that's kind of a fun name, Bean, Doku Doki. That's another fun one. I like that. Reese and Bean says, I remember you saying you sold your SEP GME calls. Do you ever buy back in? Nope. So right",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 60,
      "start_timestamp": "00:02:25",
      "start_timestamp_seconds": 145.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=145"
    }
  },
  {
    "text": "got to say hello to everybody. We got Liz, Paulo, Spascar, that's kind of a fun name, Bean, Doku Doki. That's another fun one. I like that. Reese and Bean says, I remember you saying you sold your SEP GME calls. Do you ever buy back in? Nope. So right now in GME for the option side of things, I'm actually quite limited. And I have some short calls against my long shares, but that's it. I don't have any directional GME options on right now. The way that I think about trading options is I need movement. And GameStop is just not moving right now. So while it's not moving, I don't put on like directional options trades, you know, like buying long calls or kind of my standard go to suite of strategies. And it's because they won't make money. I need the stock to move and it's not moving right now. So the way that I think about that is as I see volume starting to come in a little bit more meaningfully, then I'll happily start to trade it more speculatively. But I also wouldn't trade it before earnings at this point unless I wanted to trade it through earnings, which I don't have a good fingerprint for GME through earnings. It looks okay. Actually, I don't hate this through earnings. And then the times that it be big drop down. Yeah, like I don't hate this for earnings. So there might be an earnings play",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 60,
      "start_timestamp": "00:03:26",
      "start_timestamp_seconds": 206.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=206"
    }
  },
  {
    "text": "trade it through earnings, which I don't have a good fingerprint for GME through earnings. It looks okay. Actually, I don't hate this through earnings. And then the times that it be big drop down. Yeah, like I don't hate this for earnings. So there might be an earnings play on the docket for GME TBD. We'll see. There we go. I think I think I've rhymed that all the way out. Go me. We also have Graveteris, John, Tom and Colonel. Great. We got we got everybody here. We have the whole gang in town ready to talk about options trading, which I love. So the way the session will work is I'm going to run through a couple really basic options questions. And I'm going to start with some simpler stuff. And then it's designed to be conversational though. So I'm going to give you guys something that you can look at. And then actually, let me grab this so it'll be a little bit easier. I can pull some of the questions. These are all random questions that I've generated over time and different things. I'm going to grab a couple from here. But then I really want to spend time going through the platform and asking specific questions in here. It's not going to be super long. We might do like five or 10. But the main thing I want to work on in this with you is trying to continue to hone both the practical",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 60,
      "start_timestamp": "00:04:45",
      "start_timestamp_seconds": 285.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=285"
    }
  },
  {
    "text": "want to spend time going through the platform and asking specific questions in here. It's not going to be super long. We might do like five or 10. But the main thing I want to work on in this with you is trying to continue to hone both the practical and the theoretical understanding of options. So that's the idea. This takes a minute because this workbook is becoming like really, really, large. It's actually taking even longer than I would expect. There we go. All right. So let's get this zoomed in. And then close that out. Pull that up. What's this one? Those are just old questions. All right, here we go. So I will highlight the question part. It's going to be multiple choice. So you have the option. Check me out to literally just put in a letter. So it'll be a little easier for you to answer. Here is your first question. So when you know the answer, you could just drop it in the chat and you can just use a letter, which would make it kind of easy. And then we'll talk a little bit about the question itself. So the question here says an investor buys 10 XYZ. That's the stock. May 70 calls at 3.10 when the stock is trading at 68. At expiration, the stock is now at 77. And the trader closes the position at intrinsic value. What is there? P and L. Alfonso says is the image cropped.",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 60,
      "start_timestamp": "00:05:59",
      "start_timestamp_seconds": 359.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=359"
    }
  },
  {
    "text": "says an investor buys 10 XYZ. That's the stock. May 70 calls at 3.10 when the stock is trading at 68. At expiration, the stock is now at 77. And the trader closes the position at intrinsic value. What is there? P and L. Alfonso says is the image cropped. Yes, it is cropped. Oh, my bad. I see. I got to move it over a little further. That's where you're telling me. Hold on. One second. Stand by. So let me see. That's too far. We need it to be right there. There you go. Rease says 3.9. Tom says D. Rease changes to D, which is again, the same is just making it easier for me because he knows that I am an idiot. So that's I appreciate that. Rease keeping it, keeping it all super linear for my brain to handle it looks like Evan flow portfolio just showed up, which is great. CSY says what program do you use? It's thinkorswim. That's what you see in the background there. All right. Any other answers? We got to so far. Any well, I guess I can phrase it this way. Are there any other answers, meaning anything different than these? Liz also says D. Cool. So for anybody that didn't answer, so anybody that is not Reese Tom Liz or Paulo for anybody that is not them. Ah, perfect. Alfonso. There we go. We always have to find one of them. So Alfonso, it's a brave answer",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 60,
      "start_timestamp": "00:07:28",
      "start_timestamp_seconds": 448.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=448"
    }
  },
  {
    "text": "different than these? Liz also says D. Cool. So for anybody that didn't answer, so anybody that is not Reese Tom Liz or Paulo for anybody that is not them. Ah, perfect. Alfonso. There we go. We always have to find one of them. So Alfonso, it's a brave answer going against the crowd. I respect that. In this case, it was a terrible time to go against the crowd because you're 100 wrong. So let's focus on you. Obviously. So Alfonso walk me through why you think it's A. And then simultaneously, John, the question is on the screen. If you're driving or something, I'll read it out again. The question is an investor buys 10 of the XYZ may 70 calls for 3.10, 3.1 when XYZ is at 68. At expiration, the stock is at 77 and the trader closes the position at intrinsic value. What's the PNO? So in case those were wondering, this isn't a question even that I made up on my own. A lot of the questions that I like to grab are from like a series seven licensing exam. Actual like legitimate exams so that you can see the kind of stuff that goes into that, which is hilarious, right? Because if you think from an options trading perspective, that this is what we're obviously have to know this. So maybe it's like comical because it's super basic, but this is from a series seven exam. So Alfonso walk me through why you",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 60,
      "start_timestamp": "00:08:57",
      "start_timestamp_seconds": 537.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=537"
    }
  },
  {
    "text": "goes into that, which is hilarious, right? Because if you think from an options trading perspective, that this is what we're obviously have to know this. So maybe it's like comical because it's super basic, but this is from a series seven exam. So Alfonso walk me through why you think it's A. And then what I would love is simultaneously. Okay, here we go. Alfonso says purchase was 3100. Intrinsic was guessing seven. And then I guessed, okay, that's cool. That's totally cool. So let's grab our handy dandy white board. And let me make sure I'm set up here to get my scribalon because that's what we are about to do. We're about to get our, this is my favorite part, a chance to draw live because I'm known for my artistry. A gravitaris says so the 68 is irrelevant. It could have been any number in PNO is the same. Potentially, Carlos says need more info. Question makes no sense. The question makes total sense. So Carlos, talk to me, what info do you need to answer this? So what we need to know is intrinsic and that's a C versus extrinsic. So then, I see Carlos, it tells you, closes the position at its intrinsic value. So that's what he closed the position at. Ramalamas here live and well. Ramas says been trading spies zero DT for two weeks ended up today over a grand. I have to thank you. The content is invaluable so much",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 60,
      "start_timestamp": "00:10:19",
      "start_timestamp_seconds": 619.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=619"
    }
  },
  {
    "text": "it tells you, closes the position at its intrinsic value. So that's what he closed the position at. Ramalamas here live and well. Ramas says been trading spies zero DT for two weeks ended up today over a grand. I have to thank you. The content is invaluable so much more to learn but starting to believe the possible to win consistently. That's awesome. First of all, congratulations. The second thing is I would highly encourage you to not worry so much about winning consistently but winning long term. But yeah, that's awesome. I'm really, really stoked that your question is huge. Ramalamas says answer is D that is also correct. So Alfonso is now doing the math. So if the stock is at 77, here, I guess I need another color to make that easier to see. One sec standby. So the stock is at 77. We have a strike at 70. We're essentially saying we're only looking at intrinsic value. It's giving you exactly what we care about intrinsic value. So we don't care about extrinsic value. So intrinsic value is Spanish for how far in the money. These are the same. So if we have our strike at 70, strike is 70. Stock is 77. How far in the money is the call? 7. So exactly as Alfonso highlighted, this is how far in the money we are. Except we need to, we're trying to figure out what's the PL profit and loss. So it's not just",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 60,
      "start_timestamp": "00:12:02",
      "start_timestamp_seconds": 722.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=722"
    }
  },
  {
    "text": "at 70, strike is 70. Stock is 77. How far in the money is the call? 7. So exactly as Alfonso highlighted, this is how far in the money we are. Except we need to, we're trying to figure out what's the PL profit and loss. So it's not just what's the intrinsic value. It's telling you that's where we're getting out at. But we need to take into account what the cost is. So you guys walked right on target. So that's exactly correct. We need to take the cost out of this, which results in letter D, which is the correct answer here. Bingo. Nice job. All right. Next question. I'm going to add a group here. So that'll be a little easier. Does that one make sense? Is everybody good on how we arrive at that? Okay. Good. So fuck it. Delete it. Hold on. One second. One second. Here we go. Alfonso says intrinsic isn't a Spanish word. Oh, yes, it is. Intrinsic is the direct translation in Espanol is how far in the money? Word for word verbatim. Take that to the bank. That's just sign sealed and delivered. Obviously kidding. Toku Toku says from where do you get the 7,000? It's a great question. So the way we get the 7,000 is worth 7 in the money. So we have 10 contracts from over here. Right. So our bought to open price is 10 contracts times the 100 multiplier times 3.1. So this is",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 60,
      "start_timestamp": "00:13:26",
      "start_timestamp_seconds": 806.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=806"
    }
  },
  {
    "text": "where do you get the 7,000? It's a great question. So the way we get the 7,000 is worth 7 in the money. So we have 10 contracts from over here. Right. So our bought to open price is 10 contracts times the 100 multiplier times 3.1. So this is where we're getting 3,100. Then we have to do that same math over here. 10 contracts times our multiplier of 100 times 7. This is where we're getting 7 bands for your boy. So this is what we ended up selling it for right here. This is what we bought it for. So our PNL is the net between these, which gives you this one. Okay, cool. It looks like Toku Doki is on board. That's what we're looking for. We're looking for everybody being on board the train. Yeah, of course, that's perfect. That's exactly what we're looking to accomplish here. So I'm glad it was helpful. I will clean this one up, get it up out our way, add another layer, group this, minus commissions. Yep, John is exactly right. So this is looking at it in a frictionless environment. So in a frictionless environment, we're kind of just talking from a theoretical standpoint, but John, you are literally 100 correct that we would in a real sense need to take commissions into the equation as well as spread if we wanted to be even kind of more precise to figure out what the total cost is. That's",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 60,
      "start_timestamp": "00:15:30",
      "start_timestamp_seconds": 930.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=930"
    }
  },
  {
    "text": "just talking from a theoretical standpoint, but John, you are literally 100 correct that we would in a real sense need to take commissions into the equation as well as spread if we wanted to be even kind of more precise to figure out what the total cost is. That's exactly correct, John. And then Carlos says, but don't you have to factor in the Greeks like Delta and Theta. So Carlos, for you specifically, why do you think we need to integrate the Greeks like Delta and Theta when we're calculating the P and L of an option? Walk me through why you think that's the case. And then in the meantime, I'll grab something that I think might be helpful for us to look at together, which is Eric's handy dandy. I mean, this is really a bit of an abomination if we're being honest with ourselves. Like this deck is so it's like, it's pretty terrible. It's all over the place. I have just a random smattering of junk, but I hope at least it's marginally useful. That's the goal. Also, I need this to be like super precise. Okay, so let's grab this. Let's grab this. Carlos says, I don't know, never mind. Is that I don't know, never mind? Because you don't know why or do you still think that those should be integrated, but you're just not sure why they're not. Because if you're if you understand why they're not integrated, then I'll move",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 60,
      "start_timestamp": "00:17:14",
      "start_timestamp_seconds": 1034.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=1034"
    }
  },
  {
    "text": "Carlos says, I don't know, never mind. Is that I don't know, never mind? Because you don't know why or do you still think that those should be integrated, but you're just not sure why they're not. Because if you're if you understand why they're not integrated, then I'll move on. But if you're not sure why they're not integrated, then I'd like to continue the point to make sure you get it. No, it was a bad question. No, it's literally, I'll tell you if it's a bad question. I because there are bad questions, but bad questions are relative to kind of the person who's asking them. So if you're new to options and that's a question you have, that's literally not a bad question at all. Like that's a completely fair question to ask. Yeah, so I'm in a similar boat as Sposcar. Like there, well, I disagree. I think there's tons of bad questions, but I think that the bad question, again, like a question is relative to the person who's asking. So if there's somebody that's new to something like a beginner, you really have is about a wide leeway gap, as you can imagine for asking questions. Now, if you guys saw there was a person that introduced themselves earlier in the chat named Tom A, if Tom A asked a dumb question, I'm going to let him know. I'm going to let him know big time. One, because I know him personally, but",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 60,
      "start_timestamp": "00:18:27",
      "start_timestamp_seconds": 1107.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=1107"
    }
  },
  {
    "text": "for asking questions. Now, if you guys saw there was a person that introduced themselves earlier in the chat named Tom A, if Tom A asked a dumb question, I'm going to let him know. I'm going to let him know big time. One, because I know him personally, but two, because he is more or less been around markets for a while. So if he asked a question about something that I don't think he's reasonable for him to know about, meaning like what's the disparity between stock XYZ and when we're plotting its log normal distribution, explain why kurtosis is actually a bad indicator for us to assimilate into a pricing model. Like I actually wouldn't expect Tom A to know that. So that's a fair question for his level. But if he asked me some stupid shit, I'm going to tell him it's some stupid shit. So it's I view questions at the level of the person asking. So if you're new to trading literally ask away, you have the utmost grace that you can be working with. Reset Eric with the Spanish again. Yeah, that's what I'm trying to tell you guys. I'm like super fluent in Spanish. I'm about to order Mexican food for dinner again. Like if that doesn't tell you how Spanish I am, I actually don't know what does. I am essentially Spanish, I think. I think there's this. So for those that don't have it, I recommend grabbing a screenshot of",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 60,
      "start_timestamp": "00:19:42",
      "start_timestamp_seconds": 1182.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=1182"
    }
  },
  {
    "text": "in Spanish. I'm about to order Mexican food for dinner again. Like if that doesn't tell you how Spanish I am, I actually don't know what does. I am essentially Spanish, I think. I think there's this. So for those that don't have it, I recommend grabbing a screenshot of this. So this is just a really quick reference for you to work off of. And then actually let me write this out. So it's clear. VAL utility. You can grab a screenshot of this. So the reason for Carlos that was wondering about the Greeks, the Greeks just measure things. That's it. So Greeks are slaved to options, not the other way around. So that's why the simple answer to that, why don't we consider the Greeks in that PL calculation is because they literally don't matter. We're at expiration and something calculating what essentially we paid versus what it's worth. These don't have a say in that. And then the other one you guys can grab a screenshot of is this one, which is kind of like the more comprehensive I have a YouTube video all about the Greeks. So I'll also grab that super fast for you in case you're looking to get into detail on the Greeks. There you go. And yeah, that should get you a little more familiar. But yeah, that was a completely fine question. I next question. This one I'm actually really curious because this essentially has nothing to do with options.",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 60,
      "start_timestamp": "00:20:52",
      "start_timestamp_seconds": 1252.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=1252"
    }
  },
  {
    "text": "in case you're looking to get into detail on the Greeks. There you go. And yeah, that should get you a little more familiar. But yeah, that was a completely fine question. I next question. This one I'm actually really curious because this essentially has nothing to do with options. But it's again from a series seven exam. So I think it's a good question nonetheless. So this is more of a general market understanding. The reason why I think this one is still relevant to us is because we need to understand these relationships. Again, like if you're going to be a trader, this is a still an important relationship that you have to know. So here we go. CSY says anyway, I can get that PowerPoint. So great question. It's a fair question, but no, there is no way because it's not done. That's going to be one of those PowerPoints that I'm going to work on. That's literally never going to be done because I'm going to keep building it. So I don't feel comfortable filling some like sharing something that's super, super not done. And that's not even close. So yeah, there's that. All right, here's our next question. A US importer is buying 10,000 worth of goods from a Japanese manufacturer. It's very American of us. The payment will be made six months from now in the Japanese yen to hedge what would the US importer do with they buy puts on the dollar by",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 60,
      "start_timestamp": "00:22:10",
      "start_timestamp_seconds": 1330.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=1330"
    }
  },
  {
    "text": "our next question. A US importer is buying 10,000 worth of goods from a Japanese manufacturer. It's very American of us. The payment will be made six months from now in the Japanese yen to hedge what would the US importer do with they buy puts on the dollar by calls on the dollar by puts on the yen by calls on the yen. Paulo, it is not cut off. Don't try to gaslight me. I already told you Mel recently explained to me what gaslighting is. So I am now gaslight impervious. You can't you can't gaslight me at this point because I know what the word means and I won't be fooled again. A lot of seas. So, Cravitarist is running with D. Evan flows D. Willie Sposcar Tom Carlos C. Big Ace opted to not tell me which one. So I have to look it up. That's annoying. Puts yen. Okay. C. Liz says C. Willie says C. Rises C. Jason says C. We are near unanimous C. Working investor comes in at C. Silent sleeper says D. Good to see somebody bucking the majority. I always love that. All right. So I would love for Gravitarist, Ebb and Flow or Silent Sleeper to explain their answer because they are the minority. Paul says D. John says B. The first B I think I've seen. That's brave. Gravitarist says if Yen goes down, we get a discount. And if Yen goes up, we get money on calls.",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 60,
      "start_timestamp": "00:23:26",
      "start_timestamp_seconds": 1406.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=1406"
    }
  },
  {
    "text": "Ebb and Flow or Silent Sleeper to explain their answer because they are the minority. Paul says D. John says B. The first B I think I've seen. That's brave. Gravitarist says if Yen goes down, we get a discount. And if Yen goes up, we get money on calls. I like the logic. Can I get somebody from the C cohort to explain why they think it's C. So we have future whale, kernel, ape of trades, working investor, Jason Reese, Willie, Liz. Future whale, there is no C or B. This is a single choice only exam. Big A says you asked how to hedge it, not make money. Okay. Well, that that attempts to discount Gravitarist's answer, but that doesn't explain your answer of C. Rises hedge our payment in case Yen goes tits up. So think of that. Buy puts on Japanese yen to hedge the risk of a decrease in Yen's value. Another fair guess. So let's work through this logically. Again, this is more for you to understand how markets work than anything else. The very first thing to know. Nian says if Yen goes tits up, we win in the payment. So we would put on USD. Negative. Gravitarist says I suppose I don't know the definition of hedging. Hedging is simply to reduce risk. Payment, Tom says payment is being made in Yen. So if the value of the Yen goes down, then puts will hedge that risk. This is fascinating. Evan",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 60,
      "start_timestamp": "00:25:14",
      "start_timestamp_seconds": 1514.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=1514"
    }
  },
  {
    "text": "would put on USD. Negative. Gravitarist says I suppose I don't know the definition of hedging. Hedging is simply to reduce risk. Payment, Tom says payment is being made in Yen. So if the value of the Yen goes down, then puts will hedge that risk. This is fascinating. Evan flow says if Japan is receiving the money of 10 million, I want to make money when they receive that. So I choose call. That's interesting. So we have a couple instances of they're correct, but for the wrong answer. So let's do that. Let's get through what's correct, what's not correct. The very first thing is anything related to the US dollar we don't care about. We don't care about A, we don't care about B. This is not what we're looking to hedge. This is essentially going to be a controlled based on whatever the US economy is. We don't care about this. Our value risk comes from the Yen. So now let's go a little bit further. If I am agreeing to buy 10 million US dollars worth of goods, I'm going to give you 10 million dollars. That's US dollars is my side of the equation that's going to turn into Yen. So I'm going to pay you in your your currency. What's more dangerous to my position? If I go to give you one dollar and my one US dollar is only worth 50 Yen or 50 cents. Yen, I don't know what 50 cents",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 60,
      "start_timestamp": "00:27:04",
      "start_timestamp_seconds": 1624.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=1624"
    }
  },
  {
    "text": "that's going to turn into Yen. So I'm going to pay you in your your currency. What's more dangerous to my position? If I go to give you one dollar and my one US dollar is only worth 50 Yen or 50 cents. Yen, I don't know what 50 cents Yen is. Whatever that is, 50 cents of Yen. Or if I go to give you my US dollar and it's worth 151.50 Yen, which scenario is better for me as you manufacturer? Ape of trade says Yen went up. That becomes the problem. So if the Yen increases in value, which means my one US dollar buys me less Yen because the Yen went up in value, that's my risk. That's what's dangerous to me. So then out of C or D, which of those benefits me if the Yen value goes up, which is the scenario that causes me damage. Ape of trade says calls on Yen would hedge. Then we're rolling in with the D's. That's exactly correct. John is good. Tom is good. Paula says Yen has no sense. That's actually really good to know. Thank you. Dr. Zayah says D. Yeah, that's good. So again, the reason why this stuff matters is because you're starting to get an idea of how market participants engage in markets and what they're doing and why they're doing it, what their incentive structures are. So that's why I thought this is a good question to work through. So I",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 60,
      "start_timestamp": "00:28:52",
      "start_timestamp_seconds": 1732.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=1732"
    }
  },
  {
    "text": "the reason why this stuff matters is because you're starting to get an idea of how market participants engage in markets and what they're doing and why they're doing it, what their incentive structures are. So that's why I thought this is a good question to work through. So I love this. All right. Any other residual questions on this one are we generally good? Really good. Willie says don't understand. Totally cool. So let's try and let me see if I can help elucidate the point. Gravitary says was the reasoning I had correct. I don't remember what your reasoning was. To be honest, if you repaced it, let me know. Evan Flow also is unsure and same as Reese. That's cool. Yeah. So let's get it. Let's get this down. So pretend it's not 10 million. One of the easiest things you can do to help yourself kind of answer questions like this is just reduce all of the stuff down to its simplest terms. So let's just say we're going to buy a dollar. Oh, shit, that got stuck. Let's say we're going to buy a dollar you at Jesus. Oh, I think my bracelet is hitting it. So we're going to buy one US dollar of something. And instead of it being six months from now, again, don't even worry about how long it is. Think just future in the future. Future in yen. Now, let's start with kind of a baseline. Let's say today, one",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 60,
      "start_timestamp": "00:30:27",
      "start_timestamp_seconds": 1827.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=1827"
    }
  },
  {
    "text": "it. So we're going to buy one US dollar of something. And instead of it being six months from now, again, don't even worry about how long it is. Think just future in the future. Future in yen. Now, let's start with kind of a baseline. Let's say today, one dollar US equals, I don't know the yen symbol. I think it's like a Y with two lines through it, but I don't know where the lines are. Well, on Japanese yen symbol. Okay. So like the bottom of the stem. Okay. So today in this hypothetical example, one dollar equals one yen with just a Y with two lines through it. So we'll take a pause here for who was it, Willie? Because you were the brave one to say that you were uncertain. So I'll work with you specifically. So Willie, does this first scenario make sense to you? Right now, we're looking at a scenario where they're both equal to each other. Okay, we'll with us. Perfect. So now we have two potential scenarios in the future. The yen goes up in value, meaning it becomes more expensive relative to the dollar, or the yen declines in value, and it becomes cheaper to the dollar. So if the yen goes up, in this case, our one US dollar is equivalent. You guys told me there's no sense in yen, but there's going to be sense in this example to make it simple. Is going to buy you",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 60,
      "start_timestamp": "00:31:59",
      "start_timestamp_seconds": 1919.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=1919"
    }
  },
  {
    "text": "value, and it becomes cheaper to the dollar. So if the yen goes up, in this case, our one US dollar is equivalent. You guys told me there's no sense in yen, but there's going to be sense in this example to make it simple. Is going to buy you half of one yen. This is where the yen goes up. In this example, yen goes down. So then your one US dollar now can buy you two yen. Do these two scenarios make sense so far for you, Willie? So what I'm highlighting is there is a scenario where the yen, the value of the yen relative to the dollar goes up. Okay, cool. So now, if originally, my original guess was I wanted to pay one dollar for something. In this scenario, this one dollar doesn't go as far. So if I was going to buy one dollar, and that gives me 10 widgets, let's say, just to add another number, 10 widgets, 10 things. That's what I was originally expecting to get. I was going to give them one dollar in this scenario from the starting point. I was going to give them one dollar and I was going to get 10 widgets. If the value of the yen goes up, and now my one dollar is only worth half of a single yen, that means when I give them my dollar, I'm only going to get five widgets. Because the yen has become more expensive relative",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 60,
      "start_timestamp": "00:33:44",
      "start_timestamp_seconds": 2024.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=2024"
    }
  },
  {
    "text": "was going to get 10 widgets. If the value of the yen goes up, and now my one dollar is only worth half of a single yen, that means when I give them my dollar, I'm only going to get five widgets. Because the yen has become more expensive relative to the dollar. So every time I give somebody my one US dollar, I get less stuff back. Willie, does that scenario so far make sense? So what I'm highlighting to you, okay, cool. So now, bring it home. We're looking at how can we save ourselves from this risk? If the value of the yen goes up, we can't get the same amount of shit, or if we want to get the same amount of shit. So in this case, we want to get our 10 widgets. We're going to have to give them two dollars now. So how can we protect our business deal and essentially make money if the yen goes up? That's why we would want to buy calls. Because the theory behind the, again, it's a theoretical position. So in the theoretical position, if this scenario happens, and I still want my 10 widgets, I have to pay instead of my one dollar, two dollars for my 10 widgets. So I have to come out of pocket more money. However, if I made money as the yen goes up, so instead of this doesn't change, this is going to be what I have to pay",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 60,
      "start_timestamp": "00:35:17",
      "start_timestamp_seconds": 2117.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=2117"
    }
  },
  {
    "text": "have to pay instead of my one dollar, two dollars for my 10 widgets. So I have to come out of pocket more money. However, if I made money as the yen goes up, so instead of this doesn't change, this is going to be what I have to pay if the yen goes up. But the addition with these long calls means I might make a dollar as the yen goes up. So then that gives me the two dollars I need without having to put more money out of pocket to cover this variance. Now for everybody else that's following along, this is a highly simplified example of how this actually works, just to be abundantly clear. However, the part that I'm trying to express to you, uh, Sposcar says, wouldn't you want to see if the calls cost more than the potential of USD to pay? That starts to get into the theoretical positioning of things. Because again, the purpose of the calls is to offset risk. It's not because we're trying to bank if the yen goes up. We simply want to make sure that we're going to be able to get our 10 widgets without having to add more than 10 million US dollars from our initial outlay. So the purpose of the calls in this case, you to structure the trade again, they probably would use futures like it would be completely different than this. But in the theoretical scenario, the idea is if",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 60,
      "start_timestamp": "00:36:47",
      "start_timestamp_seconds": 2207.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=2207"
    }
  },
  {
    "text": "having to add more than 10 million US dollars from our initial outlay. So the purpose of the calls in this case, you to structure the trade again, they probably would use futures like it would be completely different than this. But in the theoretical scenario, the idea is if you buy calls on the yen, you make money on the calls that then offset the additional rise in price in the devaluation of the dollar. Well, he says, I see your point. Appreciate taking the time to explain. Yeah, definitely. Alfonso says borrow 10 million yen when you make the deal and pay it back in yen when you pay the supplier. Yep. So there's obviously other ways to hedge the position again. You just take the question for what for what it is. It's just teaching about the concept of using options to hedge. You can change this from currencies to something else. You can change it to a forward. It's it's just the concept that you should pay attention to here. More importantly, the other takeaway that you should have from this is when we're using options around other things. That's the main point. Evan flow says I seen that now because we're protecting our deal in the future, but we don't want to pay more than the agreed upon price. Yep. The calls are insurance to protect our future price fluctuations. That's exactly right. Yep. That's exactly correct. And the broader idea here is some people",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 60,
      "start_timestamp": "00:38:16",
      "start_timestamp_seconds": 2296.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=2296"
    }
  },
  {
    "text": "I seen that now because we're protecting our deal in the future, but we don't want to pay more than the agreed upon price. Yep. The calls are insurance to protect our future price fluctuations. That's exactly right. Yep. That's exactly correct. And the broader idea here is some people when I've given this question before, they're like, well, why don't you just pay them today? Well, why would I pay them today? If I don't have to pay them for six months, why would I give up six months of interest and pay them today? This makes no sense. So while if I paid them today, it would absolutely lock in the value. If I can put this 10 million into some sort of interest bearing account that I can then use to subsidize the cost of, in this example, long calls, now essentially I have a hedge that subsidized via my original principle. So again, it's just a general example designed to help connect a couple dots. It's not a practical example of how this actually would work. This is not how it would go, but this is how it goes. Ape of spades says I wish you would use more bananas. That's fair. So instead of 10 widgets, we're buying 10 bananas. I'm not sure why we would want to go to Japan to buy bananas. Maybe they have really good bananas or something, but maybe we just like exotic bananas. That could be what it is.",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 60,
      "start_timestamp": "00:39:35",
      "start_timestamp_seconds": 2375.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=2375"
    }
  },
  {
    "text": "would use more bananas. That's fair. So instead of 10 widgets, we're buying 10 bananas. I'm not sure why we would want to go to Japan to buy bananas. Maybe they have really good bananas or something, but maybe we just like exotic bananas. That could be what it is. Cool. That's that question. We'll do one more of these and then we'll take a look at something else. Alfonso says there was almost zero interest on the yen for years. That's why people would borrow yen to finance other currencies. Yeah, absolutely. And that's also why the carry trade was a thing for a long time, definitely. From again, actual real life example, the yen was really interesting for that for quite a while. And even now, I mean, it's still at an astronomically low rate. So yeah, for sure. All right. Let's do. Do we want an easy question or a hard question? And then depending on the level of difficulty we want, I'll structure something for you. All right. We want a hard question. We can do this. Let me find something a little more interesting. Here we go. Now again, this is going to be hard relative to a new trader. Like, if you're an experienced trader, this question still is not hard at all. Audiencing, my goal is not to stump people. My goal is to try to teach. So oh, that'll stump you. Explain to me what volatility term structure is. This is different",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 60,
      "start_timestamp": "00:40:49",
      "start_timestamp_seconds": 2449.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=2449"
    }
  },
  {
    "text": "relative to a new trader. Like, if you're an experienced trader, this question still is not hard at all. Audiencing, my goal is not to stump people. My goal is to try to teach. So oh, that'll stump you. Explain to me what volatility term structure is. This is different than a volatility surface. So walk me through what a volatility term structure is. And it's okay to take your time because I'm about to order some Mexican food. Which is funny because I'm not really one of those Californians that really likes Mexican food. I typically Mexican food is good, but I'm not like freaking out about it. I much prefer Italian and stuff like that. Reese says no multiple choice. No. If you guys ask for a hard question, hard questions are not multiple choice. Able space says too hard. This is you guys are tripping. Suppose cars says no. Yo, you guys fucking cracked me up, man. I love this. This is so fun. IV over time. There we go. We're getting there. That's so awesome. Let me find. That's not good enough. Oh, see, that's some see. I have to add this to my unfinished crappy deck. We'll look at some GME. Epe of trades has expected vol during option period. That's incorrect. Gravitaris says different volatility for different dates. There we go. That's exactly correct. So, Reese says GME has always the answer. Whatever you need an answer, it's in GME. It's awesome. So a",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 60,
      "start_timestamp": "00:42:29",
      "start_timestamp_seconds": 2549.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=2549"
    }
  },
  {
    "text": "deck. We'll look at some GME. Epe of trades has expected vol during option period. That's incorrect. Gravitaris says different volatility for different dates. There we go. That's exactly correct. So, Reese says GME has always the answer. Whatever you need an answer, it's in GME. It's awesome. So a volatility term structure, it simply tells us what volatility looks like over different timeframes. That's all. So in this case, you can derive a volatility term structure directly from these numbers. This right here. So for example, if I drew a line, let's just pick three of them. There's 163, 90, and 85. 163, 90, and 85. I gotta grab my notepad again. I just slid it out of the way. All right. So we have vol here, which is 0.1. So this is like, let's just do like T0 or T1. Let's do T2. And then let's do T3. And then here's the starting point. These are just like ticks. These are out in time. So then we had 169, whatever it was, this axis will be vol. We had 169, then we had like 90, and then we had like 80, 5 or whatever the fuck. So in this case, this is your term structure. So in this case, it's showing you what I just realized how terribly misaligned these are. Just pretend that they're aligned. This one is so bad. It's not even close. Just pretend that they're aligned. This should be over here. I directly aligned",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 60,
      "start_timestamp": "00:44:22",
      "start_timestamp_seconds": 2662.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=2662"
    }
  },
  {
    "text": "this case, this is your term structure. So in this case, it's showing you what I just realized how terribly misaligned these are. Just pretend that they're aligned. This one is so bad. It's not even close. Just pretend that they're aligned. This should be over here. I directly aligned like this. But what I'm showing you is volatility over different time frames. That's what term structure is. And the reason why we care about term structure is that it gives us ideas on how much movement we expect a stock to have in the future. That's all implied volatility tells us. It is expected movement. So for example, if we come in here and I go to implied vault, and then let's take a look at the average, and then let's get rid of a lot of these. And let's just look at like the primary explorations. So if we use, these are super confusing because it's game stop. Normally, it's, let's just use another product for now. Bear with me because it'll just be a lot easier to see in something that's not as crazy. Okay. Apparently Apple is no better right now. Let's pick maybe GE. Yeah, this looks boring. This is also, it's because the market's closed. Anyways, if we use spot price, which is right here, this is another way to visualize what I was literally just showing you. So in this case, instead of looking at the monthly explorations in the access I was",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 60,
      "start_timestamp": "00:46:12",
      "start_timestamp_seconds": 2772.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=2772"
    }
  },
  {
    "text": "this looks boring. This is also, it's because the market's closed. Anyways, if we use spot price, which is right here, this is another way to visualize what I was literally just showing you. So in this case, instead of looking at the monthly explorations in the access I was showing you like this, it's simply plotting different strikes, not the just the monthly expiration. But it's showing you the same exact thing. So we can see by the placement of these lines relative to one another for the at the money, what explorations we expect to be more volatile than the others. So for this case, we actually have 15 know on top of the 18 oct on top of the 20 step. So this also would have a downward sloping volatility term structure just like what I was just showing you. So that's what term structure is in this case. Now there's other things that you can add to this. So this is more of a volatility surface, which there are different versions of that. I don't know if I have one of those in here. Do I? Don't think so. Yeah, I don't. So let me add that to my to-do list actually. So I'll add like a volatility term structure and surface. I'll add that into the deck for us. But without that, this is just a way to visualize volatility over different time periods. It's why we care about it because our ability to understand",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 60,
      "start_timestamp": "00:47:46",
      "start_timestamp_seconds": 2866.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=2866"
    }
  },
  {
    "text": "that to my to-do list actually. So I'll add like a volatility term structure and surface. I'll add that into the deck for us. But without that, this is just a way to visualize volatility over different time periods. It's why we care about it because our ability to understand volatility over different time periods can tell us where it's expensive on a relative basis, where it's cheap on a relative basis. So recess overall smile is the term structure. Smile in and of itself is a description for a term structure because it's not always a smile. So in this case, this front expiration is a smile. So this is looking just at the front expiration, the 23-og. And you can see just like when you smile, right? Your cheeks go up. That's what this is showing you. So this is a smile, but it's not always a smile. So sometimes it'll be a different shape like you see here. This is like a fucked up smile. This is a silly smile. So smile is a descriptor for term structure. Gravataris says does a smile imply bullish bear sentiment if they're skew? So if you'll remember from some of the OG GME videos I was doing and even this right here, this is a representation of skew. Now you have to be really, this starts getting into the weeds and I don't want to start going over people's heads here. So I'm going to gloss over this. I'm happy",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 60,
      "start_timestamp": "00:49:19",
      "start_timestamp_seconds": 2959.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=2959"
    }
  },
  {
    "text": "the OG GME videos I was doing and even this right here, this is a representation of skew. Now you have to be really, this starts getting into the weeds and I don't want to start going over people's heads here. So I'm going to gloss over this. I'm happy to go further into detail on this if anybody would like in the future. I just don't want to overwhelm people because this starts to get a little convoluted because what you'll almost always notice is the far out of the money options are going to have really high vols priced in. And they tend to be really expensive for what they are. That's a function of pricing models and the way market makers perceive their risk. I'll kind of leave that at that. So when we see skew, we can't immediately assume like right across the bat that if we see the call side higher than the put side that that automatically thinks we think it's going up because that can just mean we expect larger price movement or we can expect more risk to the upside. Some of it is going to be relative to the product you're looking for or looking at more often than not if you see and this is an important point. If you see the implied vols skewed for the same delta or the same distance, you can do either or so in this case spot prices about 20. So if I go",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 60,
      "start_timestamp": "00:50:58",
      "start_timestamp_seconds": 3058.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=3058"
    }
  },
  {
    "text": "looking for or looking at more often than not if you see and this is an important point. If you see the implied vols skewed for the same delta or the same distance, you can do either or so in this case spot prices about 20. So if I go to well, it's 22 technically. So I have to be a little more precise than that. So if it's 22 and I want to go plus or minus 10 points, I can look at what the vol is at 32 and then I can take a look at what the vol is at 12. So if I go to 32, my vol is like 113 for this front expiration. If I go to 12, my vol in this case is like 95. So I can tell you that the calls are being priced with more vols than the puts, which is actually kind of backwards than what you typically would see. You generally see the put side priced heavier. So in this case, the market is pricing in more volatility, expected movement to the upside. It's exactly what it's telling me. It's why again, if you go through the GME videos, it's why I always look at this because the market makers as much as people like to make fun of them, they're fucking smart. They're smarter than I'll ever be. And they're the ones that are pricing the vols. So you kind of have to take the vols that",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 60,
      "start_timestamp": "00:52:05",
      "start_timestamp_seconds": 3125.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=3125"
    }
  },
  {
    "text": "videos, it's why I always look at this because the market makers as much as people like to make fun of them, they're fucking smart. They're smarter than I'll ever be. And they're the ones that are pricing the vols. So you kind of have to take the vols that they show you with a grain of salt sometimes and I do still price my own, but they're going to have a much more informed opinion over what they should be. And I would go with market vols over Eric's vols any day of the week, most of the time. I can sometimes tell if it's kind of just of a floating order of I wouldn't call it a spoof. That's more of a high frequency trading. But market makers to go a little further down the rabbit hole, they don't always show the current actual expected volatility for something because then it shows their cards. So a lot of times they'll rest vols that are an accurate. And then if somebody starts entering the market, they'll then adjust their vols to be more accurate. They don't want to show all the other market makers or other people that are making markets in that market. What they think it is. So Willie says they hire top talent math majors. Yeah, they literally have armies of PhDs. That's exactly why I say that they're super smart. Anybody that thinks that they're not smart. Again, I get it. It's sometimes fun to",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 60,
      "start_timestamp": "00:53:06",
      "start_timestamp_seconds": 3186.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=3186"
    }
  },
  {
    "text": "making markets in that market. What they think it is. So Willie says they hire top talent math majors. Yeah, they literally have armies of PhDs. That's exactly why I say that they're super smart. Anybody that thinks that they're not smart. Again, I get it. It's sometimes fun to poke fun and stuff. And nobody's omnipotent. They also make mistakes too. But in general, they're really smart people. And that's just I think it's an important understanding to have when we look at the markets. The working investor says Tom Saznaf from Tasty mentioned that meme stocks tend to have calls you. They do because people fear the squeeze. They fear the upside. It's exactly why they have calls you. Whereas if I look at something again, let's take a look at GE. It has putt skew. The puts go literally has higher vols on the putts side. This is way more normal than what you see. This is an apple. This is the putt skew. Most options, most products are priced more so to fear the downside. But for things like Game Stop, where you can see these hyperbolic upside moves, there will be periods where we see these calls trade more expensively than the puts like this. That's exactly what that's pricing. Great discussion. And I'm always happy to talk about vol. I think it's super important. Reese says that calls skew is from the market makers hedging and not from retail buying excessive calls or one",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 60,
      "start_timestamp": "00:54:05",
      "start_timestamp_seconds": 3245.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=3245"
    }
  },
  {
    "text": "these calls trade more expensively than the puts like this. That's exactly what that's pricing. Great discussion. And I'm always happy to talk about vol. I think it's super important. Reese says that calls skew is from the market makers hedging and not from retail buying excessive calls or one in the same. It's where they're pricing markets. So it's not from market makers hedging and it's not necessarily from retail buying excessive calls. Market makers decide they literally have a quote machine. So think of it this way. If I'm a market maker for Game Stop, I need to determine what I want to price these at. So these 40 calls. What do I want to price these at? How do I determine that? The way that they determine that is that they're just looking at volatility. That's the game. So they're figuring out what their best guess, what they think, what volatility makes sense for the product. And that's one of the cool parts about efficient markets. Because if I'm a market maker, the way I make money is by making markets is by gaining transactions. Cool. Now, if I make a market and the question might be, well, then why wouldn't they just always overestimate their volatility? That would definitely pad them better. It would make options more expensive and it would give them a better pad. However, markets are competitive. So if I'm padding my order too much and I'm pricing this right now, it's running",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 60,
      "start_timestamp": "00:55:20",
      "start_timestamp_seconds": 3320.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=3320"
    }
  },
  {
    "text": "well, then why wouldn't they just always overestimate their volatility? That would definitely pad them better. It would make options more expensive and it would give them a better pad. However, markets are competitive. So if I'm padding my order too much and I'm pricing this right now, it's running at 139.39 and I want to be super conservative. So I want to pad the balls, make them higher so that I have more room to work with if my ball estimate is wrong. But there's other people. And if there's other balls that are more accurate, they're going to undercut you and then you're not going to get the volume. So that's one of the cool things about efficient markets is that market makers are really pushed to be more accurate in their calculations. The other thing that people don't fully appreciate is that individual market makers, their first job is to make markets. Their second job is to control their risk. So there's nothing that says, I as the market maker must price these options at the best possible theoretical value. If I already have a portfolio and based on market price action and something like GameStop and I really don't want to buy more calls. I don't want to buy more. Well, I can skew where I put my bid and offer. I can skew the market by putting in different balls or by literally changing where I rest my market. And it's not because they're trying",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 60,
      "start_timestamp": "00:56:40",
      "start_timestamp_seconds": 3400.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=3400"
    }
  },
  {
    "text": "I really don't want to buy more calls. I don't want to buy more. Well, I can skew where I put my bid and offer. I can skew the market by putting in different balls or by literally changing where I rest my market. And it's not because they're trying to the fuck the retail trader, although it's not not because of that. But what they're trying to do is control their risk. So if because market makers are slaved to order flow, if order flows in one direction, they have to keep making markets. So if it's one direction, they're not having an opportunity to offload any of their book. I'm people are buying calls. So all the way up, I'm selling calls, I'm selling calls, I'm selling calls, I'm selling calls, which puts me short the stock. I don't want to be short the stock. But market market flow is still one direction, one direction for whatever reason. It's going super hard, one direction, gotta keep selling calls, selling calls, selling calls. I don't want to sell anymore calls. My risk is getting out of hand. In order to hedge all of these short calls now, I need to buy the shares. The shares are hard to borrow, hard to locate, whatever the case is there. Or I need to use other options. But now volatility is starting to change and it's becoming more expensive for me to hold the position. What market makers try to do is",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 60,
      "start_timestamp": "00:58:06",
      "start_timestamp_seconds": 3486.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=3486"
    }
  },
  {
    "text": "to buy the shares. The shares are hard to borrow, hard to locate, whatever the case is there. Or I need to use other options. But now volatility is starting to change and it's becoming more expensive for me to hold the position. What market makers try to do is I'll sell the calls here and then the market moves a little bit than somebody else wants to sell there. So then I'll buy them back somewhere else at a fair valve value. And then I'll make a little bit of money on that exchange. That's what they prefer. But if you get one side persistent order, that's really, really difficult in order for them to manage. So that's why you'll see one skewed orders, right? You'll see skewed resting orders. Well, in this case, just resting markets that they're offering you because part of it is going to be based on their book. If they don't want to sell anymore calls, they might offer a better other side of that trade. So in this case, they're going to look to buy calls from somebody. So they might offer a better offer, a cheaper offer in a worse bid or whatever the case is, depending on their position, so that they can try to manage their risk. So the other thing that they'll do is they'll change the vault to widen the markets out to slow down movement. Because what is catastrophic is if a market maker who's a counterparty",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 60,
      "start_timestamp": "00:59:13",
      "start_timestamp_seconds": 3553.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=3553"
    }
  },
  {
    "text": "whatever the case is, depending on their position, so that they can try to manage their risk. So the other thing that they'll do is they'll change the vault to widen the markets out to slow down movement. Because what is catastrophic is if a market maker who's a counterparty goes under water and they still have to be cleared by OCC, that creates a giant problem. So yeah, market makers have a really interesting place in the market. And I think they do have some power. They're not innocent people. They're money hungry like everybody else that's on Wall Street. But they also don't have like these superpowers that I think a lot of people, especially in like the ape and GME community think that they have. Because there's a lot of regulation that they have to maintain their quote machines for certain durations of time in order to maintain certain statuses in order to be granted order flow. So for example, somebody has asked me before, well, if they don't want to sell anymore calls, why don't they just turn off their quote machine? Well, they can, but then they can lose their status and their preferential treatment as a consistent market maker. Because what we don't want is directional market makers. We don't want to give them the ability to turn their shit on when they want to make money and then turn it off and they're like, okay, I'm good, I've made my money. That creates",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 60,
      "start_timestamp": "01:00:18",
      "start_timestamp_seconds": 3618.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=3618"
    }
  },
  {
    "text": "as a consistent market maker. Because what we don't want is directional market makers. We don't want to give them the ability to turn their shit on when they want to make money and then turn it off and they're like, okay, I'm good, I've made my money. That creates an incentive essentially for them to start trading directionally. We don't want that. So yeah, a little bit of a rabbit hole, but I think it's an important one for people to understand because I genuinely believe market makers are probably one of the more misunderstood entities that play in this whole ecosystem with us. At least that's my opinion. Any thoughts or questions on that? Riz says, how do you put in different balls? They decide. So they again, like they literally have a quote machine. So they'll have a volatility surface that, you know, estimates whatever they think volatility should be. And then they literally input the metrics that they think apply to it. What the risk-free rate is all that stuff. And then when they turn on their quote machine, that's what you see here. This is a market maker right here. Resting orders. This is in this can be to be clear. This can be retail traders. And I've seen it happen before. So for example, if I'm resting in order, let's say that this 30 option is bid 57 offered 60. If I wanted to offer a bid at 58 and there wasn't a counter",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 60,
      "start_timestamp": "01:01:30",
      "start_timestamp_seconds": 3690.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=3690"
    }
  },
  {
    "text": "this can be to be clear. This can be retail traders. And I've seen it happen before. So for example, if I'm resting in order, let's say that this 30 option is bid 57 offered 60. If I wanted to offer a bid at 58 and there wasn't a counter party at the time, this will move to 58. The size offered will change. In this case, you can see somebody's doing that. It's one by three 14. That means on the bid side, they're offering one at that price, 57. And they're offering 314 at the 60 on the offer side. So this is a prime example of another way that market makers can skew what they're giving you. They can say, I'm tired of selling calls. I don't want to sell any more calls. So in this case, I'm going to give you one call at 57. But if you want to buy them, I got a shits on for you boss. Come on in. I have 314 locked and loaded to go at the 60. So if you as a retail trader input and order that doesn't get filled right away and it's better than what's currently offered that would narrow the market down, your order will sit there. You'll see it. You'll literally see it move. And it's obviously easier to see on wider markets. But a lot of times we get filled really fast. So you don't actually have to deal with that too much.",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 60,
      "start_timestamp": "01:02:34",
      "start_timestamp_seconds": 3754.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=3754"
    }
  },
  {
    "text": "offered that would narrow the market down, your order will sit there. You'll see it. You'll literally see it move. And it's obviously easier to see on wider markets. But a lot of times we get filled really fast. So you don't actually have to deal with that too much. But yeah, this is that's exactly what the size is showing you is what's being offered at those prices. Cool. Yeah, I'm glad that that was useful for you guys. I think a Reese says we're too for an easy question. All right, fine. We can do an easy question. What's the difference between implied and historic volatility? That's pretty easy, I think. Future versus past. Yep. That's exactly right. Gravitaris has it spot off. That's exactly what it is. So implied volatility is forward looking expected volatility. And then historic volatility is what has happened in the past. It's exactly correct. Now to confound things a little bit, there's kind of a world called realized volatility. And realize volatility is really interesting. I'm not going to go super far into detail in this because I think there's a pretty solid chance that it's going to freak a lot of people out. So what I will do though is share a link with you on a video that goes into volatility so that it's a little more clear because you can have forecast volatility. You can have realized volatility. You can have future realized volatility. It can get a little",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 60,
      "start_timestamp": "01:03:49",
      "start_timestamp_seconds": 3829.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=3829"
    }
  },
  {
    "text": "people out. So what I will do though is share a link with you on a video that goes into volatility so that it's a little more clear because you can have forecast volatility. You can have realized volatility. You can have future realized volatility. It can get a little confusing to that end. So we'll save that joy and wonderous experience for another time. So that's good. You guys got that down. Cool. So now I thought what we could do is pivot and take a look at a couple case studies. But this is also a perfect time. Whatever questions you have, start throwing them in because I probably have maybe another 15 minutes or so. And I would love to hit as much stuff as I can with you guys. Gravitarius says you have videos on how to find incorrectly bargain priced options. There's not really a way to do that. I mean, realistically speaking, like the probability of you as a retail trader finding a mispriced option is almost null. It's not zero. But the way you have to do that then is you have to find something where you think your volatility is priced better than the market volatility, which is real tricky because again, I told you when we look at market participants, especially institutions, they're really smart. And most of the larger institutions have derivatives desks and market makers and proffers. There's a lot of very serious committed traders to the markets where",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 60,
      "start_timestamp": "01:05:34",
      "start_timestamp_seconds": 3934.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=3934"
    }
  },
  {
    "text": "than the market volatility, which is real tricky because again, I told you when we look at market participants, especially institutions, they're really smart. And most of the larger institutions have derivatives desks and market makers and proffers. There's a lot of very serious committed traders to the markets where if you're trading options markets, a big part of your job is pricing volatility. So the concept of finding incorrectly priced options is predicated on somebody mispricing volatility. So unless you think you can price volatility better than market consensus, there's not really a way. Gravitarius says I got you. So we just have to try and ride the waves while the whales are making sort of to a degree like there's other things you can do though. So like, for example, this kink right here in GameStop, where I can see that this option here, which is what the 17 and a half or whatever, is much higher than the 17s. So I could come up with a relative value play. I could say I think the 17 vols are going to go up and I think the 17 half vols are going to go down and I can trade that relationship normalizing and there can be reasons why there's these kinks that emerge. But again, that's not so much attempting to trade what we would perceive as a mispricing but a relative pricing difference. And there's typically reasons why it exists. It's not risk-free. If you put on",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 60,
      "start_timestamp": "01:06:52",
      "start_timestamp_seconds": 4012.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=4012"
    }
  },
  {
    "text": "trade that relationship normalizing and there can be reasons why there's these kinks that emerge. But again, that's not so much attempting to trade what we would perceive as a mispricing but a relative pricing difference. And there's typically reasons why it exists. It's not risk-free. If you put on that trade that does not mean that the 17 vols are going to go up and that the 17 and a half vols are going to go down. But it just means that, I think these are out of line and maybe I can run a play on it. And you can do that within the same expiration cycle. You can do that across expiration cycles. So in this case, if I throw on the 18 oct, I can see periods where they're inverted. So like here, I can see these 22s are actually more, they have more vol in 18 oct and less in 20 set. So in this case, I can buy the 20s in the cheaper and sell the 20 22s in the more expensive and I can trade a calendar in that sense to trade the relative vols between one another. Paul says, could you talk about order types? How to get the best possible fills? Yeah. The way you get the best possible fill is definitely through a market order, kidding. In case you guys just realize how serious that sounded. And I didn't smile, but definitely not through a market order. So the reason",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 60,
      "start_timestamp": "01:08:06",
      "start_timestamp_seconds": 4086.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=4086"
    }
  },
  {
    "text": "about order types? How to get the best possible fills? Yeah. The way you get the best possible fill is definitely through a market order, kidding. In case you guys just realize how serious that sounded. And I didn't smile, but definitely not through a market order. So the reason why market orders are really terrible is because it really focuses on speed of transaction as compared to getting best price. So market order is essentially, I want to get executed for whatever it is right now. So if I look at this 23 and it's bid 148 offered 160 and I just want to get a fill right now, right this second rather than using a limit order, I would use a market order. And that's just going to do it at the very next available transaction. That's a dangerous order. I have a great example of how it's dangerous. Today, I was trading zero DTE SPX options. They were in profit. So I had a stop market order. So in this case, if you do just a regular stop, you'll see that essentially once an option gets to a certain price, it turns into a market order. So I had a stop set, it hit my stop, and then I got the next fill. That was two times what the stop was, which is terrible. It's a terrible fill. But you have to understand and prioritize what your objective is because some people will say, oh, I want",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 60,
      "start_timestamp": "01:09:23",
      "start_timestamp_seconds": 4163.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=4163"
    }
  },
  {
    "text": "I had a stop set, it hit my stop, and then I got the next fill. That was two times what the stop was, which is terrible. It's a terrible fill. But you have to understand and prioritize what your objective is because some people will say, oh, I want to do a stop limit. So if I look at a stop limit, that means once my trigger is hit, in this case, 160, I can say, well, I want to get filled at no worse than 170. Well, what if it goes past 170? Then what? Then you have a problem. You didn't get a fill. So this stop that is supposed to protect your risk from blowing out, you didn't get a fill. So now you wanted to get out at 160, it gapped past 160. It already went past 170, which is where your limit was. And now it's at 190, then two, then two, 10, 260. It's at three, that three and a half. It's at four. This can happen in zero DTEs. This isn't even dramatic pricing. You literally can have an option that goes from 0.50 to 10. That's not insane. So if you're trading stuff like that, you have to be very thoughtful and you have to accept what you're doing. So in that case, I wasn't like, oh, what a unbelievable. I can't believe that this would ever happen. No exactly what happened. And it sucks. It happens sometimes. But I would",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 60,
      "start_timestamp": "01:10:37",
      "start_timestamp_seconds": 4237.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=4237"
    }
  },
  {
    "text": "trading stuff like that, you have to be very thoughtful and you have to accept what you're doing. So in that case, I wasn't like, oh, what a unbelievable. I can't believe that this would ever happen. No exactly what happened. And it sucks. It happens sometimes. But I would rather control the risk. And more often than not with zero DTEs, it'll come right back in the range. The times that you'll get knocked out at those points is when they're typically is some sort of, you know, short-term extreme that then reverses. But it doesn't always. So then if you're trying to be, frugal, you don't want to waste a bunch of money. So then you're like, well, I'm going to use a stop limit because I think it's going to come back in anyways. There's a case where it doesn't come back in. And your stop limit stopped you from getting a fill on something that was supposed to manage your risk. And then that takes you out. So you have to just understand the order type into implications thereof. Alfonso says, the trade type that I wish was available on Schwab is a trailing stop. Oh, wait, what? I don't understand. It's literally right here. What are you talking about? You mean on the Schwab platform? Because Schwab owns think or swim. Think or swim is Schwab. This is for options. Exactly what I'm showing you. This is a trailing stop limit where if this wherever",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 60,
      "start_timestamp": "01:11:55",
      "start_timestamp_seconds": 4315.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=4315"
    }
  },
  {
    "text": "wait, what? I don't understand. It's literally right here. What are you talking about? You mean on the Schwab platform? Because Schwab owns think or swim. Think or swim is Schwab. This is for options. Exactly what I'm showing you. This is a trailing stop limit where if this wherever you choose to start it, well, let's do just a trailing stop standard. Yeah, the platform. Yeah. So because think or swim is owned by Schwab and you literally can do it right here. This is exactly what it shows you. So based on wherever you're at now, you can tell it plus or minus. You can give it only one direction. You can do it off of a percentage. You can do it off of like the plus or minus is a raw value. But yeah, you can absolutely use a trailing stop, a trailing stop limit. For sure. There's all different kinds of order types. There's M.O.C., which is if you're in the discord, you know, I use that most days when the market closes. That stands for market on close. Then there's TIF time and force. When do we want the order to go through? So day means the trading day. So that means that if your order doesn't get filled by the end of the trading day, then it gets canceled. Then down here, GTC stands for good to good till canceled, meaning it'll hang to the next day, to the next day, until it eventually",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 60,
      "start_timestamp": "01:13:11",
      "start_timestamp_seconds": 4391.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=4391"
    }
  },
  {
    "text": "means the trading day. So that means that if your order doesn't get filled by the end of the trading day, then it gets canceled. Then down here, GTC stands for good to good till canceled, meaning it'll hang to the next day, to the next day, until it eventually is filled. They tend to have an expiration. I don't know how long it is, but it'll actually give you a heads-up when it comes up on the expiration of arresting order. If it's been waiting forever. And this is still just like a single order. You can do multiple orders. You can submit multiple orders at once. You can have one order that triggers a sequence of other orders. You can have one order that triggers a bunch of them. You can have order cancels other. You can have a bunch of different kinds of advanced order types. So yeah, there's a ton you can do with placing trades. The one thing I would say with that stuff is there's really value in keeping it as simple as possible, genuinely speaking. You're not really compensated super well for taking on increasing amounts of risk. And I'm sorry, increasing amounts of complexity, which does increase your risk. Because then your orders typically are not going to go through as well, stuff like that. So yeah, I think it's kind of smart to limit a little bit how complex you let things get so that your orders don't get hung up",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 60,
      "start_timestamp": "01:14:34",
      "start_timestamp_seconds": 4474.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=4474"
    }
  },
  {
    "text": "of complexity, which does increase your risk. Because then your orders typically are not going to go through as well, stuff like that. So yeah, I think it's kind of smart to limit a little bit how complex you let things get so that your orders don't get hung up trying to run through. Alfonso says I use the web platform to trade because I use iPad from ability. Doc, just download toss for your iPad. I trade on toss on my phone. Like one of the places I place most of my trades because I'm moving around a lot. For me, like I don't really sit at the computer like hunting for trades. I mostly know what I'm going to do in a trading day the day before because I plan. So yeah, a lot of my trades are done on the phone because I know exactly what I'm looking for. But you can have you can have think or swim for your iPad, which I guess you can't see here. Maybe if yeah, there you go, iPad, or for your iPhone or whatever device. Policies. What do you do if a limit order takes too long to be filled? Change it. Stop being so cheap. So if in this case, I wanted to trade these 23s, they're 148 by 160. Maybe I'll start it to buy them. Maybe I'll start at the mid or maybe even better. I might start a little, a little south of the mid",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 60,
      "start_timestamp": "01:15:51",
      "start_timestamp_seconds": 4551.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=4551"
    }
  },
  {
    "text": "filled? Change it. Stop being so cheap. So if in this case, I wanted to trade these 23s, they're 148 by 160. Maybe I'll start it to buy them. Maybe I'll start at the mid or maybe even better. I might start a little, a little south of the mid and I might offer them 152. See if I get filled. And then if I don't get filled, I'll literally come right back in right click, cancel replace, come back up, give it to them for 154. That doesn't get filled. Come back, cancel replace, give it to them for 155, 156. Just walk the order up until you're at a price where you're like, yeah, okay, I don't like these actually at 160. So I'm not going to get them at 160. But I find very, very infrequently is the bit asks so wide, where by the time I'm done walking the order through, I'm now like, oh, I don't even want to do this. The only time that that really happens with any significant frequencies when I'm trying to fill box spreads. Box spreads can be tricky for that scenario for sure. But it's infrequent where it'll be like that bad. I just typically have to narrow down how much of a premium I'm getting over the relatively rate. Ape of trade says I use limit orders on zero DCS PX. I did better on my fills after I learned to quickly cancel replace also putting limits on",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 60,
      "start_timestamp": "01:16:52",
      "start_timestamp_seconds": 4612.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=4612"
    }
  },
  {
    "text": "like that bad. I just typically have to narrow down how much of a premium I'm getting over the relatively rate. Ape of trade says I use limit orders on zero DCS PX. I did better on my fills after I learned to quickly cancel replace also putting limits on for targeted entries. Yeah, that's it's a smart idea. And again, the only dangerous part is like I would be very careful with how you choose to do that on the profit taking side of things. But to put them on, especially something like SPX, I essentially have zero, zero problem with liquidity. Suppose Carson, how long do you wait to see if it fills before replacing it? That's really relative to how urgent it is for me to get in the trade. If I want to get in the trade right now, I literally just walk it all the way in. Submit it doesn't go cancel replace, submit it, cancel replace, submit it, cancel replace. I literally just walk it all the way up. If it's something that like a box spread, I'll let it sit for a little bit because there are complex orders that are typically in slightly less liquid periods of time. So I will let those take a little bit more time for sure. Evan flow says I use let me just grab the chat over here so that you guys can also see the chat. Well, I think you guys obviously you guys can",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 60,
      "start_timestamp": "01:17:48",
      "start_timestamp_seconds": 4668.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=4668"
    }
  },
  {
    "text": "slightly less liquid periods of time. So I will let those take a little bit more time for sure. Evan flow says I use let me just grab the chat over here so that you guys can also see the chat. Well, I think you guys obviously you guys can see the chat. Maybe I don't know. Evan flow says I use a sell stop order for my take profits. Could you explain how a trailing stop of .15 would work if I've hit my profit target at one and want to trail it? Yeah. So then if assuming that you bought, if you bought your option, essentially it's going to take 0.15 off of the one. So it'll take you if the option hits 0.85, that's what it would let you sell it for. And then if the option goes from a dollar to a dollar five, then it's going to take 0.15 off the dollar five. So that means now your option if it doesn't change in value to the upside again, if it trails down to 90 cents is where you would get where it would be triggered. Now if it's a market order, that means that it's going to be filled at the next spot, which we don't know what it is. So in that case, it doesn't mean that you get filled at 85 or 90 cents in those two examples respectively. It just means that's when it's going to get triggered. And then it",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 60,
      "start_timestamp": "01:19:01",
      "start_timestamp_seconds": 4741.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=4741"
    }
  },
  {
    "text": "it's going to be filled at the next spot, which we don't know what it is. So in that case, it doesn't mean that you get filled at 85 or 90 cents in those two examples respectively. It just means that's when it's going to get triggered. And then it will run to, if it's a market order, if it's a limit order, it's going to bound it by whatever the limit is. So that's exactly how it works. It's nothing, nothing too complex. If you guys give me one second, I can let the pop out the pop out really fast. And then I can still hang out because I'm waiting for my food. Otherwise, if you guys are wrapping up, that's cool too. I was going to throw up a couple examples that's completely up to you guys. But let me let him out real fast. I'll be right back. I, we move quick around here. Cool. So let me grab. Oh, I already got rid of it. Never mind. That's my bust. I had a couple reddit posts that I was going to pull up for you guys that I think are good examples. Maybe we'll do that on the next one, because I was going to run you through like a couple just I think one of the really good things about stuff, like looking at Reddit and whatnot is to help you learn where other people are and to learn from other people. That's the",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 60,
      "start_timestamp": "01:20:17",
      "start_timestamp_seconds": 4817.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=4817"
    }
  },
  {
    "text": "that on the next one, because I was going to run you through like a couple just I think one of the really good things about stuff, like looking at Reddit and whatnot is to help you learn where other people are and to learn from other people. That's the way I think about it. But I killed all of them by accident. I have to add back my bad. Cool. All right, gang. Then that wraps me up. I will see the GME folks tomorrow for the GME live stream. If you have any friends that like to come to those or are interested in learning along me with GME, come on out. It'll be at 5 p.m. Pacific time. And then for the outlier pro members, we have our live stream standard Sunday 5 p.m. Pacific time. So I'll see you guys all then. Thanks for hanging out. Love talking about options with you all. It's super, super fun. And we will catch you all on the next live stream. Be an outlier. We'll see you guys later.",
    "metadata": {
      "video_id": "-jJkuhl2wyY",
      "title": "Quiz & Case Studies | Options Trading for Beginners Pt11",
      "url": "https://www.youtube.com/watch?v=-jJkuhl2wyY",
      "upload_date": null,
      "duration": 4960.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 60,
      "start_timestamp": "01:21:34",
      "start_timestamp_seconds": 4894.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-jJkuhl2wyY&t=4894"
    }
  }
]