[
  {
    "text": "29.8. So close. So today's video is a quick update on GameStop because we are coming into earning soon and we are literally consolidating. Like this is a normal consolidation. The ADR is a little bit wide with some of these candles being so broad, but look at the volume and look at the price level. This is about as exciting as I think it gets for GameStop is a company in general. Now I specify as a company in general because this doesn't necessarily strike me as parabolic short squeeze, gamma squeeze up. Again, it can always happen. We don't know when the conditions are set for that to occur. But what I'm highlighting is from an underlying company perspective. This is a company that's actually gaining a little bit of attention. And that's a good thing because if we look at the volume here, it's been sustained from the 8th of November and the volume is high. So it was 15 million here, 26 million here, 18 million here, 18 and a half million here, 16 and a half here, 16 and a half here, 8 and a half, 8.7, 22 as of today. The reason why that matters is because a lot of people are curious, you know, if roaring kiddies involved in literally who knows that dude is like fucking Batman, he just kind of shoves up when it's time for him to show up could be. But the cool part about this is that even",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=0"
    }
  },
  {
    "text": "matters is because a lot of people are curious, you know, if roaring kiddies involved in literally who knows that dude is like fucking Batman, he just kind of shoves up when it's time for him to show up could be. But the cool part about this is that even if roaring kiddie is part of this, he's not all of it. And that is even more powerful in my opinion for GameStop as a company to start garnering some attention and capital. If we zoom this out to a six month timeframe, we've been basing above this 25 handle since November 11. We haven't seen this level since essentially we were around the squeeze period from the spring slash early summer. So the fact that we're rallying up to this point and then remaining above this point is really cool for me to see. Look at all the moving averages. They're starting to organize as I would prefer them to. So we have short terms that are upward sloping. We have midterm moving averages that are upward sloping crossing above slightly longer term moving averages. So there's a really great configuration that's going on here. The other thing from an RSI perspective, it still has momentum. Right. So the RSI indicator line itself is hovering above the what is what I have here a seven day moving average for the RSI and they're upward sloping. They're not overextended. Right. So we can see that there's still hover and below",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 14,
      "start_timestamp": "00:01:34",
      "start_timestamp_seconds": 94.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=94"
    }
  },
  {
    "text": "an RSI perspective, it still has momentum. Right. So the RSI indicator line itself is hovering above the what is what I have here a seven day moving average for the RSI and they're upward sloping. They're not overextended. Right. So we can see that there's still hover and below 70. So all in all, this looks really strong to me. Now just because it looks strong doesn't mean that it's not going to consolidate. Come back down and consolidate. Shoot back up. The main thing I'm trying to highlight as I look at this is the price action. The fact that we're getting several days consecutively above the 25 handle generally organized in a consolidation zone slightly bigger candle slightly bigger volume is good. That's all good in my opinion. So when we take a look at implied volatility, we do have still really high IV, right. This is showing one 31.8. If we take a peek at the options chain, you can see that it's obviously looking at the next primary expiration. That's 30 days away out here. We can see that there is elevated volatility on the near term explorations. We still see pretty strong call skew as it pertains to OI relative to the puts with 680 3000 calls against 259,000 puts. Now one of the things we noted is on the live stream last night as we were looking at this is a big change in the structure of the OI breakdown. What I mean",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 14,
      "start_timestamp": "00:03:08",
      "start_timestamp_seconds": 188.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=188"
    }
  },
  {
    "text": "as it pertains to OI relative to the puts with 680 3000 calls against 259,000 puts. Now one of the things we noted is on the live stream last night as we were looking at this is a big change in the structure of the OI breakdown. What I mean by that is if we take a look at a lot of these green boxes that's actually 17 and 25. These are 60 day options and there's a lot of them. The cool part about that is that a lot of the activity that we're seeing here is funneled in near term explorations that used to be the case. Now we're spread across explorations, which leads to a slightly more robust options picture for it. It means that people aren't just trying to play super short term pops. These are people that are actually positioning for the upside of the company. This also is bolstered by what we were just talking about in terms of the chart and how that looks now. These are people that are starting to play the company itself more so to the upside as compared to just the violent moves up and down, which still can occur and still can be played. But again, my perspective on GameStop is I want to see it do well as a company. I want to see GameStop be one of those stories where people were essentially trying to short it into the dirt, try to make it go",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 14,
      "start_timestamp": "00:04:43",
      "start_timestamp_seconds": 283.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=283"
    }
  },
  {
    "text": "can occur and still can be played. But again, my perspective on GameStop is I want to see it do well as a company. I want to see GameStop be one of those stories where people were essentially trying to short it into the dirt, try to make it go bankrupt so that rich people could get a couple tax breaks on their gains. And this entire story has been propped up first by the retail trading community that essentially didn't let it happen. And if the company itself can then turn around and be something that's really profitable, really effective as a company is a business to me. That's a Cinderella story. Like that is really, really cool. That is a really interesting scenario where like the little guy stood up against the big guy outmaneuvered them and then through good leadership, the company is starting to turn itself around. So that's why I'm excited to look at it from that perspective. And I understand that a lot of people really prefer to look at it from Moas trying to see this big giant squeeze, which I still would love to see that myself. But I really love the fact that it looks like the company itself is being respected and it's growing and it looks like it's doing well. So we'll take a look at what the earnings expectations are coming up. But take a look at the call volume today. 348,000 calls against only 52,000 puts. And",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 14,
      "start_timestamp": "00:06:17",
      "start_timestamp_seconds": 377.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=377"
    }
  },
  {
    "text": "fact that it looks like the company itself is being respected and it's growing and it looks like it's doing well. So we'll take a look at what the earnings expectations are coming up. But take a look at the call volume today. 348,000 calls against only 52,000 puts. And if you take a look at the breakdown, most of them were buys. So these are people that are buying calls playing this probably to the upside. We'll take a look at unusual whales in just a moment. I want to take a look at the vol picture now as you know, I like to do to get a sense of the surface. And as per usual, I'm going to look at the primary expectations just because it helps get rid of some of the noise. Let's do June and take a look. We now have call skew on all of them, all of them. That's also very interesting. So the call IV for the out of the money calls is priced high relative to the put IV. And again, this is typically we price we being the market, but market makers and the rest of the market will typically price IV more rich in the direction that we expect to see movement, right? That's kind of the notion behind it. So it definitely has IV calls ski right now, which is very interesting. And it shows that standard, I don't want to call it fear to the upside, although",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 14,
      "start_timestamp": "00:07:52",
      "start_timestamp_seconds": 472.00000000000006,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=472"
    }
  },
  {
    "text": "price IV more rich in the direction that we expect to see movement, right? That's kind of the notion behind it. So it definitely has IV calls ski right now, which is very interesting. And it shows that standard, I don't want to call it fear to the upside, although it is partially fear. You want to get compensated. For example, if you're selling calls to the upside, you don't want to get ran over. And that's why these will be priced up a little bit, but it's also just expectation of movement. So that's very interesting for me to see. So now let's take a look at unusual whales. And there's a couple of things that stuck out to me. So this is looking at GME. And we're looking at GME for this week. So essentially from the 18th to the 22nd, we have pretty strong call buying activity as far as it looks. Again, there's nothing huge popping off of me here. There's a 350,000, 27, which that is a big trade. I want to be clear. And this is also a very, very short term. So that absolutely is interesting, but it's still not quite massive enough where, you know, I'm reading super far into it. We do see more build out at these longer explorations, though. The 2025s are getting hit here for the 20s. So the 2026s are being traded. So there's people trading these deeper explorations, which is generally cool to see. But there",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 14,
      "start_timestamp": "00:09:26",
      "start_timestamp_seconds": 566.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=566"
    }
  },
  {
    "text": "where, you know, I'm reading super far into it. We do see more build out at these longer explorations, though. The 2025s are getting hit here for the 20s. So the 2026s are being traded. So there's people trading these deeper explorations, which is generally cool to see. But there wasn't a whole lot from the option chain that's jumping out at me thinking like, oh, this is crazy. I can't believe this is happening. It looks active. It looks moderately active as the way that I would think about it. Now, if we take a look at the dark pool really quick, just to see if there's anything special going on this week as well. And oh, oh, that's because it's I was going to say that's like really interesting that it would be that light relatively quiet. So there's definitely a handful of million dollar transactions over the last few days, but it's a little more quiet than it's been the last few weeks. So again, nothing jumping out at me here as super indicative one where the other just looks like interesting movement. But this isn't like skyrocketing up and out. I'm not seeing anything like that. So the last thing I want to look at really quick, though, is well, first, ball and like bill shout out to my buddy Benjamin from the Benjamin YouTube channel. Let me grab that real quick. If you guys haven't seen this video, it's a must. Yeah, Ben is fucking",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 14,
      "start_timestamp": "00:11:00",
      "start_timestamp_seconds": 660.8000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=660"
    }
  },
  {
    "text": "So the last thing I want to look at really quick, though, is well, first, ball and like bill shout out to my buddy Benjamin from the Benjamin YouTube channel. Let me grab that real quick. If you guys haven't seen this video, it's a must. Yeah, Ben is fucking hilarious, dude, that can tell fantastic stories. And this is all about Bill Wang. And you should absolutely go watch this video. Make sure you subscribe to his channel too, because his stuff is just communicative relief. Benjamin's also kind of like Batman. I talk to him pretty regularly, but you never know when you're going to get a video from him. You guys should know, though, that I'm I'm like your biggest advocate. I constantly am bothering him to make more videos for you all, because from a selfish perspective, I like what he makes. So it's not just for you guys. It's also for me. But you know, I try to keep him keep him pushing on on making funny videos for us because he's good at it. But looks like he's going to prison for good old 18 years and a rough round the edges in it. So let's let's read a former billionaire soon, Cooke Wang, Bill Wang, sentence to eight. It's nice that they really simplify that for us Americans. You know, they really tend to do that with some of these names to really just make it about his basically. It's not even a",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 14,
      "start_timestamp": "00:12:35",
      "start_timestamp_seconds": 755.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=755"
    }
  },
  {
    "text": "So let's let's read a former billionaire soon, Cooke Wang, Bill Wang, sentence to eight. It's nice that they really simplify that for us Americans. You know, they really tend to do that with some of these names to really just make it about his basically. It's not even a hard American name. 18 years in prison Wednesday, which cost Wall Street more than 10 billion. He was sentenced. We're jury convicted him on 10 criminal charges, including wire fraud, securities fraud and market manipulation. The amount of losses that were caused by your conduct are larger than any other losses I've dealt with. That's nice. So he's set a new personal best. I'm a big fan of that in the gym and whatnot. My personal best in the gym these days look really sad because I'm still dealing with the fucking herniated disc. So it's a lot of like how many pushups can I do before my leg goes to sleep or something. But you know, it's still nice to get some PPEs out here. And it says the US Attorney Office man had and sought to a 21 year prison term for who I'm unusually long for a white collar case and for him to forfeit 12.35 billion in make restitution for victims. I'm actually curious what he's going to have to pay. Let's see. Net worth has fallen at most 55.3 million. So it looks like he's doing okay. A little too okay. We'll have to see",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 14,
      "start_timestamp": "00:14:09",
      "start_timestamp_seconds": 849.6000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=849"
    }
  },
  {
    "text": "white collar case and for him to forfeit 12.35 billion in make restitution for victims. I'm actually curious what he's going to have to pay. Let's see. Net worth has fallen at most 55.3 million. So it looks like he's doing okay. A little too okay. We'll have to see I'll have to dig a little deeper into this and see like what he's actually going to have to pay because that's you know, that doesn't seem like a bad margin if that's all you're losing on something like that. But back to this and GameStop, I do want to talk really quick about where we're seeing these options come through simply because trying to understand the broader build out for these trades. So there's a healthy mix. I'm not going to worry too much about the bids right now. I'm actually going to pull those down. Again, sometimes we can have purchases that happen at a bid. It's just rare. So I want to remove the noise so that we can focus on the the call side and see if there's anything sticking out to us. And in terms of overall premium buildouts, there's a mix, but there's quite a few out in 25. So these are people building slightly longer term positions. So I see the tens. I see the 20s. I see the 30s. I see the 29. So it's kind of like across the chain. I see the 20s like we talked about before. And again,",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 14,
      "start_timestamp": "00:15:44",
      "start_timestamp_seconds": 944.0000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=944"
    }
  },
  {
    "text": "a few out in 25. So these are people building slightly longer term positions. So I see the tens. I see the 20s. I see the 30s. I see the 29. So it's kind of like across the chain. I see the 20s like we talked about before. And again, I like to see that. The fact that I see this happening at a bunch of different strikes and whatnot tells us that there's multiple participants. So it becomes a bigger movement if there's more actors involved as compared to one person that may or may not be a cat who can have a massive impact. And hopefully we'll see more of a footprint from him at some point. I'm excited. I look literally every day to see if I can pick anything up because it's kind of fun. It's like playing detective. It's, you know, the sad life is a trader. It's pretty fucking boring if you think about it, especially when you figure out how to trade. It's kind of like a repetitive process. You know what you're doing every day. It's not like a bunch of surprises or excitement. So this is where I get to find my excitement, trying to see what kind of nonsense or crazy trades are going on. But the from a broader perspective, the fact that it's is flat across different explorations, different strikes is good. That means that there's a lot of participants building out and trading to the upside, which",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 14,
      "start_timestamp": "00:17:18",
      "start_timestamp_seconds": 1038.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=1038"
    }
  },
  {
    "text": "my excitement, trying to see what kind of nonsense or crazy trades are going on. But the from a broader perspective, the fact that it's is flat across different explorations, different strikes is good. That means that there's a lot of participants building out and trading to the upside, which is honestly exactly what I think we would want to see. Let's take a look at one more thing. And you can see on GameStop net premium is heavy to the buy side. We can see obviously there's a really, really large call premium coming through. So yeah, I mean, the the overall trend that we see here is is really positive in my opinion. There's just so many more calls coming through and so many more calls being bought, which is, again, I think generally, generally strong. And it's yeah, being being traded and built out to the upside. So that's what it's looking like. Stoke to see the life, stoked to see 30 within site. And the biggest thing I'm stoked about with respect to 30 is not it's not like a blow through 30 because of again, a squeeze is happening, which is always fun. But this is like literally the company is being valued higher. And we'll take a closer look as it gets nearer to earnings so that we can run through that together. But overall strong movement. As always, anything you want me to take a look at, let me know being outlier. I'll",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 14,
      "start_timestamp": "00:18:52",
      "start_timestamp_seconds": 1132.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=1132"
    }
  },
  {
    "text": "is like literally the company is being valued higher. And we'll take a closer look as it gets nearer to earnings so that we can run through that together. But overall strong movement. As always, anything you want me to take a look at, let me know being outlier. I'll see you all later.",
    "metadata": {
      "video_id": "-mD-g1Io3II",
      "title": "GME Surges Towards $30: Options Breakdown",
      "url": "https://www.youtube.com/watch?v=-mD-g1Io3II",
      "upload_date": "",
      "duration": 875.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 14,
      "start_timestamp": "00:20:27",
      "start_timestamp_seconds": 1227.2000000000003,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-mD-g1Io3II&t=1227"
    }
  }
]