[
  {
    "text": "What's up outliers? Quick market update. I want to talk about two things. The first thing is just some general broad market updates and flow as we're getting into this next interesting period next week of the fed rate cuts expected on 18 September. And then I want to talk a little bit about game stop just because we came up on another expiration. So I'm going to get us prepped up for our game stop live stream tomorrow at 5 p.m. Pacific time. So let's get right in. What's going on in the market? A pretty big turnaround. That's what I noticed this week writ large. So if we take a look across the different sectors, we can see that the SP 500 is now kind of hovering right near all time highs again. It's rallied right back up. It's had a fairly one sided move starting from the ninth. We can see tech is still rallying. It's lagging behind the SP 500 still. And it is still a bit away from all time. Well near term highs. I should say here as compared to spy. And then the Russell caught a really big bid today. Except it still is not even getting near its near term. It's near term lower highs, let alone near term highs. So the Russell is also lagging quite a bit. VIX is down 16 and a half bonds are up. So what's going on here? Well, in my opinion, it looks like the",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "is not even getting near its near term. It's near term lower highs, let alone near term highs. So the Russell is also lagging quite a bit. VIX is down 16 and a half bonds are up. So what's going on here? Well, in my opinion, it looks like the market is starting to price in a little bit more. This whole probability of a cut and we're trying to see how things are going to settle. You can see for the New York Stock Exchange net highs lows. The net lows essentially evaporated. There's on a gross low basis. There's 10. So the New York Stock Exchange is really starting to take off pretty meaningfully here. And if we take a look at the NASDAQ, it's still, you know, gaining momentum, but nothing near like what you're seeing in the New York Stock Exchange. So from a broader perspective here, the market, I find to be at still a very interesting point. I don't read into this move too much. I'm playing it. I'm both long right now. Futures and options in all of the indices. I have positions in E-minis, cues and Russell. And that's mostly just following the movement at this point. It's not that I'm fully sold and baked in on what this movement looks like. Because a big thing that's going to start getting factored into pricing soon is what we think about recession. It's a little too early to worry too much about it",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "the movement at this point. It's not that I'm fully sold and baked in on what this movement looks like. Because a big thing that's going to start getting factored into pricing soon is what we think about recession. It's a little too early to worry too much about it yet, but that is going to become increasingly topical. Last I saw from Goldman Sachs, they had an article out that talked about like a 20 chance of recession, which I argue still seems a little low to me. Not that I know better than them. I just can't help it. Think that after everything that's gone on to think that it would be that low just seems not highly probable. But again, that's just based on essentially intuition. So I wouldn't wait my opinion there too heavily. So that's that now, as I already mentioned, we do have a big rate cut coming soon. And when I say rate cut, it's been priced in for some time now. We've been looking at essentially 100 probability of a cut since this new. This expiration became the front expiration. So on 18 sap is what we're looking at now. You can see what bonds were pricing off of. And here's the interesting point. It used to be really high probability of 25 basis points. Now it's like 50 50 between 25 and 50 basis points. This turned a relatively not exciting event in my opinion into quite an exciting event. The",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "see what bonds were pricing off of. And here's the interesting point. It used to be really high probability of 25 basis points. Now it's like 50 50 between 25 and 50 basis points. This turned a relatively not exciting event in my opinion into quite an exciting event. The reason is because I felt the probability of a 25 basis point had been priced in for some time. And we can see that because across the futures, if we look at the bond futures, you can see that, you know, they've rallied, but their volume has already started dying down. It's not like the volume is pouring into bonds at this point. It's really not. So there's this really interesting phenomenon that we're seeing because I think most of this probability of a 25 basis point cut probably started getting priced in pretty heavily back here. And we've been, you know, meandering sideways here, but the revival of a 50 basis point cut, I actually think starts to make this look a little more interesting. And the ability for that to have a little bit more of a market effect, I think, is pronounced. But if we look across again, 30 year bonds here. For the last week, essentially, it's been running below both five day and 20 day average volume. If we take a look at something a little near term, and we use 10 years, you'll see the same exact thing. It's been below volume most of",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "again, 30 year bonds here. For the last week, essentially, it's been running below both five day and 20 day average volume. If we take a look at something a little near term, and we use 10 years, you'll see the same exact thing. It's been below volume most of the week. And then if we go even closer still. Look at the two year, it's about the same still. So bonds are being bought no doubt. And I think most people have already captured most of this move. This is again, of reflection of the market as a discounting mechanism for those that are thinking like, oh, I want to get in a bonds today because I think the fed rate cuts going to move prices. Literally, like not even days late over a month or two late, that already has happened. Again, you can see that back here. Clear as day. That's exactly what this is. Now it continues to drift up. I'm not saying that this is the maximum of the move or at all that it can't continue it sure can. But what I'm saying is that if you're arriving to that conclusion now, you are late to the party. So that doesn't mean you can't play it. But it just means you now have a higher risk trade. Because if for whatever reason, the economy starts faltering, it starts looking a little bit ugly to the downside. Then we don't really know exactly how bonds",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "late to the party. So that doesn't mean you can't play it. But it just means you now have a higher risk trade. Because if for whatever reason, the economy starts faltering, it starts looking a little bit ugly to the downside. Then we don't really know exactly how bonds are going to behave there because the bond equity relationship had broke down pretty meaningfully throughout 2020 until almost present. It's just now just starting to normalize. So I don't even think it's fair to say like, oh, yeah, if you know, it starts looking like recession bonds are going to look really good. Maybe I mean, we might think that. But we also have to understand the rest of the conditions that are around us because again, correlations change over time and they did pretty massively. So for people that used to run risk on risk off portfolios using equities bonds, they were getting massacred over the last few years because the relationship broke. So yeah, that's kind of what I see going on with the bond market. Now the other thing I want to take a look at is the movement of capital between the sectors. I find interesting. So if you go to institutions and this is looking more like value institutions, I'll open this up a little bit. So that you can see over here. And there's a few things that jump out at me when I'm looking at this down here is when we look",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "interesting. So if you go to institutions and this is looking more like value institutions, I'll open this up a little bit. So that you can see over here. And there's a few things that jump out at me when I'm looking at this down here is when we look at where most of the exposure is again, we can see technology is contracting it continues to contract quarter over quarter. So it hit its peak concentration like back in here, which is around Q three of 21, Q 22, somewhere in that range. And it's been contracting ever since that's a lie did take up here. My bad. I lied to you. Where is this? This is like, yeah, 2023, Q two ish. Then it's been contracting from there for real this time. So this idea that like we're heavy tech concentration. I actually think is a little misguided at this point. Now it's important to also understand this is looking at when we're looking at sector exposure. And people if we look at individual products, we can absolutely see that we're still very, very, very heavy into tech. Right. So if we sort this by ads, you can see Berkshire is coming up really big Google a on MSC, MSCI, ACN, Bob. So it's like a healthy mix of things. And if we take a look at offloads. Or kind of the smallest ads, it's been an energy, which again, that's no big surprise because if you take",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "see Berkshire is coming up really big Google a on MSC, MSCI, ACN, Bob. So it's like a healthy mix of things. And if we take a look at offloads. Or kind of the smallest ads, it's been an energy, which again, that's no big surprise because if you take a look at energy's composition in these portfolios, it's been super, super low for some time. So what I'm noticing from an expanding standpoint is if you look at industrials, they're starting to open up a little bit. You're seeing consumer defensive. It opened up kind of started closing back down. I don't think there's a lot there that interests me at the moment just from a flow perspective. And then we absolutely see financial services opening up. So when I say opening up, I mean consuming more of transactions and the percentages of portfolios. So to recap all of that from what I see now, I think the market has already largely priced into 25 basis point cut. If not a 50 basis point cut probability at this point, I think if it is a 50 basis point cut, the market will probably move pretty heavy off of that because it will still be relatively new news. That's not fully priced in yet, because it's even still less than a 50 probability. But if it keeps trending that way, I think it becomes more probable. So interesting market behavior this week. And this is where again, until the market",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "because it will still be relatively new news. That's not fully priced in yet, because it's even still less than a 50 probability. But if it keeps trending that way, I think it becomes more probable. So interesting market behavior this week. And this is where again, until the market decides if it's going to go left or go right, this is exactly where I like to trade these markets, but you got to be really careful. And I use really tight stops, even the stuff that I'm running in the NASDAQ, I just follow it all the way up. And for things that I typically would handle a previous retracement without batting an eyelash, I would rather just get out, watch and then go back in. I haven't been knocked out yet. But I have literally orders resting right now to start dropping me out if need be. So let's switch over to GameStopQuick. Then for those that don't know later today at 5 p.m. Pacific time, we have the outlier options trading for beginners series. That's at 5 p.m. Pacific time. And we dive into the world of options for beginners. So it's a chance to get your feet wet. We've been doing, I think this is going to be our 14th episode. So we're going to have a quiz. And it's really just designed to help people sharpen the sword, get more familiar with options, more comfortable with how they fit in the portfolio, understanding the difference",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "feet wet. We've been doing, I think this is going to be our 14th episode. So we're going to have a quiz. And it's really just designed to help people sharpen the sword, get more familiar with options, more comfortable with how they fit in the portfolio, understanding the difference between things like profit mechanisms and how to capitalize on them with options. Because options get a bad rap, but it's because people jump into them too fast is what it boils down to. So going over to GameStop, little bit of an update today, that was absolutely awesome to see inside day. 1.23 up, but it's still hovering right above 20. So the fact that it's continuing to hold this is good to see. And if we take a look at volume, we can see that there was spike of volume leading into earnings post earnings, another spike of volume. And then if we take a look, even at these last two days, although these last two days seem insignificant compared to the prior four, these last two days are still much larger than a lot of what you saw in here. And so today we had 8 million volume 9 and a half million volume yesterday if we go back to a random sample during this period, it's 4 and a half, 3 and a half, so much, much, much less volume in here. So there's still elevated volume. And I think that that's an important note because",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "volume 9 and a half million volume yesterday if we go back to a random sample during this period, it's 4 and a half, 3 and a half, so much, much, much less volume in here. So there's still elevated volume. And I think that that's an important note because it tells me that we're still supported here now, whether it breaks down below this TBD don't know yet. But I like the fact that it hasn't yet and I'm keeping a pretty close eye on that now let's jump over to the options chain. And we have a few things to go over in here. So today we had 172,000 calls against 49,000 puts so way more calls traded. And again, this looks like mostly moving out into the next expiration. So we can see a bunch of these 13 September's, these are almost assurantly trades that are coming down and these 20 steps are going to almost all the opening trades for people moving out into the next primary expiration. Open interest still hovering right around 730,000 calls against 361 on the put side. And it's still a healthy mix of call open interest across different explorations. I'm not seeing any sort of massive concentration here that leads me to believe that you know the market is pricing something in or the market thinks something in particular is going on. I just don't get that sense at least as of right now. As of right now. So let's",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "not seeing any sort of massive concentration here that leads me to believe that you know the market is pricing something in or the market thinks something in particular is going on. I just don't get that sense at least as of right now. As of right now. So let's take a quick look now. At any interesting trade volume that we've had come through. I'm going to get rid of the puts for now. I'm going to get rid of the bids for now. And I'm going to limit it to just today to kind of clear out some of that noise. We had a couple trades that looked interesting to me. But so we have the 18th of next month, the 15 calls. I thought those looked a little off place, but not much. It is a bigger trade 287,000 again. It's not big by typical GameStop standards when things are like really busy, but it's something I'm just looking at. And then we have another 174,000 trade, but this is an out until 2025. So yeah, you know future dated positioning totally fine, but beyond that, just pretty quiet here, not much to highlight that looks really interesting to me or anything like that. So let's take a look at the dark pool really fast and see what kind of transactions we had today. And if we take a look, there's a bunch of those 5,000s again. So I'm going to do a sort this by size,",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "interesting to me or anything like that. So let's take a look at the dark pool really fast and see what kind of transactions we had today. And if we take a look, there's a bunch of those 5,000s again. So I'm going to do a sort this by size, see if the 5,000s are in here, typically they're not because there's a bunch of much bigger transactions like these. These are actually interesting. Well, for I'm going to look at just today, though. And let's see. So we have, yep, look at all these vibes again. This is like, this has been nonstop the last few days. So let's count. So, and there's a couple over here that are like different sizes, right, 5500, but these, what is this? It's like over 30, maybe like 35 or so. And then I see a couple high fours. So interesting. Really interesting. I don't know what to make of the fives. The activity has been ebbing and flowing. So if we look at this over the last week, for example, I'm going to filter by just those 5,000. And again, these are not options. These are shares. And now I'm going to sort it by date so that we can kind of see how it ebbs and flows. So you can see on the 12th was massive, right, absolutely massive number of transactions. Then on the 13th, there's still again over 30, I would bet, but not like an insane amount",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "to sort it by date so that we can kind of see how it ebbs and flows. So you can see on the 12th was massive, right, absolutely massive number of transactions. Then on the 13th, there's still again over 30, I would bet, but not like an insane amount like the 12th. Then if we go to the 11th, it's more than the 13th less than a 12th, we go to the 10th, it's less than both of those, the 9th, less still, the 6th. And we run out of space at the bottom, we run out of returns. So I just can't help but find it interesting. I don't think that again, I'm not suggesting that this is the same person trading here. Nobody has them a knobly on the size, but I just can't help but find it so interesting. So right now my main goal here is to just continue following these shares through the dark pool. And I just want to see if there's a change in the number of 5,000 returns. That's what I'm looking at right now is obviously that's what I see over the 12th to today. And that's what I'm keeping an eye by on because the options change right now is quiet. It is what it is as exciting as I would prefer to be right now. It's quiet. The stock price itself is quiet, which again, as we know with game stop, it's quiet until it's not. So that's",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  },
  {
    "text": "an eye by on because the options change right now is quiet. It is what it is as exciting as I would prefer to be right now. It's quiet. The stock price itself is quiet, which again, as we know with game stop, it's quiet until it's not. So that's all we got for today is always let me know if there's anything I should take a look at be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "-NzEb1zc1bw",
      "title": "Rate Cuts & GME | Stock Market News",
      "url": "https://www.youtube.com/watch?v=-NzEb1zc1bw",
      "upload_date": "",
      "duration": 968.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-NzEb1zc1bw&t=0"
    }
  }
]