[
  {
    "text": "Everybody, Eric here, got another really good question. There's a bunch of them today, so this is actually really engaging. It's awesome. Cloud folks are trying to learn and I'm happy to help. The question is, wrapped around what is short interest flow in how can we use it to help us inform our investing decisions? Great question. So first and foremost, short interest flow, short shares, short interest, short flow, all of it is synonymous. So when we're having this conversation, I likely will flow in between all of them, but it's essentially, it all means the same thing. And what it means is, how many shares have been sold short? So as most folks know, in familiar, you can buy stock, normally when you buy stock, you want it to appreciate and value so that you can sell higher. So buy low, sell high. There's an entire other side of stock transactions where people can sell short, where they typically do that in a bearish sentiment, where they think it's going to go down. So in that instance, what they do is they don't own any shares to start. They borrow shares from a broker and they tell the broker, I owe you X number of shares, however many they borrowed. And then what that investor do is immediately sell those shares. So technically, they would have negative X number of shares after they sell the shares, because they need to recoup those shares at some point to",
    "metadata": {
      "video_id": "-yvQLv-q9uk",
      "title": "Short Interest Float Explained",
      "url": "https://www.youtube.com/watch?v=-yvQLv-q9uk",
      "upload_date": "",
      "duration": 482.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-yvQLv-q9uk&t=0"
    }
  },
  {
    "text": "the broker, I owe you X number of shares, however many they borrowed. And then what that investor do is immediately sell those shares. So technically, they would have negative X number of shares after they sell the shares, because they need to recoup those shares at some point to give back to the broker. So what they want is to sell them at a high price and then buy them back at a low price. And then as soon as they get those shares back, they just give them to the broker, say, here you go, thanks for letting me borrow these. And then that's the trade. So inverse to traditional stock investing, they sell high and then buy low. So the reason why we like to take a look at short interest flow is because it helps us identify sentiment in the market. And the reason being is if you see a certain stock that has a ton of shares, short shares, there's a good chance that a lot of institutional investors who do a lot of research on this stuff, it's their jobs. So what we're going to do is to identify this is something that they feel is going to decrease. I never promulgate the herd mentality just follow, kind of mindset, but we can use it as an indicator to add to the rest of our toolkit. So if we're looking at something, we're like, eh, this one looks a little weird. It might come",
    "metadata": {
      "video_id": "-yvQLv-q9uk",
      "title": "Short Interest Float Explained",
      "url": "https://www.youtube.com/watch?v=-yvQLv-q9uk",
      "upload_date": "",
      "duration": 482.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 7,
      "start_timestamp": "00:01:16",
      "start_timestamp_seconds": 76.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-yvQLv-q9uk&t=76"
    }
  },
  {
    "text": "feel is going to decrease. I never promulgate the herd mentality just follow, kind of mindset, but we can use it as an indicator to add to the rest of our toolkit. So if we're looking at something, we're like, eh, this one looks a little weird. It might come down. And then all of the things you see that there's a really, really large number of short shares, that can be a tool that you use, including with your thought process. So there's a couple ways it can be expressed first just a general number of shares. More often than not with more helpful is when you see it expressed as a percentage and to get that percentage, you know, pretty simply just take the number of short shares and then divide it by the shares outstanding. And that'll give you, you know, 20 of outstanding shares are short. You know, something like that, just to give you an idea of, you know, the size. A couple of things that I think are worth discussing. The short interest ratio is, it's a good one to follow. And the reason being, it's also known as the date to cover ratio and the calculation is short interest divided by the average daily volume. So as you could probably infer from the calculation, what this is telling you is how many days it would take on a, how many average days it would take for short to cover their position. So for",
    "metadata": {
      "video_id": "-yvQLv-q9uk",
      "title": "Short Interest Float Explained",
      "url": "https://www.youtube.com/watch?v=-yvQLv-q9uk",
      "upload_date": "",
      "duration": 482.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 7,
      "start_timestamp": "00:02:32",
      "start_timestamp_seconds": 152.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-yvQLv-q9uk&t=152"
    }
  },
  {
    "text": "and the calculation is short interest divided by the average daily volume. So as you could probably infer from the calculation, what this is telling you is how many days it would take on a, how many average days it would take for short to cover their position. So for example, if there's a product that has, you know, an average daily volume of 10 million shares and then there's five million shares that are sold short over that over an average day, you can close all those shorts. All those shorts would have enough volume to close. However, in that same scenario, if we have 10 million average daily shares and then there's 40 million in short interest, that means that it would take at least four days for them to cover all of their short positions. That can be a problem if the market is running up and people are trying to get out of these positions from the short side. You can see a lot of flight to quality. People just, you know, just trying to get the heck out of these positions and it can create volatility. So that's an interesting one to follow. If you see a, you know, a big disparity in that ratio, it's something I like to watch. The last piece, I'm sure you've heard of it in some capacity at some point is the good old squeeze, also known as the short squeeze. What this is is when you have a",
    "metadata": {
      "video_id": "-yvQLv-q9uk",
      "title": "Short Interest Float Explained",
      "url": "https://www.youtube.com/watch?v=-yvQLv-q9uk",
      "upload_date": "",
      "duration": 482.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 7,
      "start_timestamp": "00:03:34",
      "start_timestamp_seconds": 214.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-yvQLv-q9uk&t=214"
    }
  },
  {
    "text": "see a, you know, a big disparity in that ratio, it's something I like to watch. The last piece, I'm sure you've heard of it in some capacity at some point is the good old squeeze, also known as the short squeeze. What this is is when you have a bunch of people that's short at a position, remember, when you short, you want it to go down. However, if you short and it continues up and continues up and continues up and continues up at some point, you once you hit your risk profile, a lot of people are like, you know, hit my risk time to sell in this case, time to buy, time to close the position is what it means. So if they, you know, sold at 50 and it keeps going up, keeps going up, now it's at 70. I'm like, okay, I got to buy this back. I know it's going to be at 20 a loss of share, but I got to get out of this thing. And then all of a sudden, a couple days later, once all those shorts get out, then the market normalizes, it comes back down. It's a short squeeze. So it's a temporary increase or decrease depending on if it's a short squeeze or both squeeze. But it's a temporary move in the price that normalizes shortly thereafter. Now on the short side, it can absolutely be a good opportunity for, for bullish investors, if there's a",
    "metadata": {
      "video_id": "-yvQLv-q9uk",
      "title": "Short Interest Float Explained",
      "url": "https://www.youtube.com/watch?v=-yvQLv-q9uk",
      "upload_date": "",
      "duration": 482.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 7,
      "start_timestamp": "00:04:47",
      "start_timestamp_seconds": 287.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-yvQLv-q9uk&t=287"
    }
  },
  {
    "text": "short squeeze. So it's a temporary increase or decrease depending on if it's a short squeeze or both squeeze. But it's a temporary move in the price that normalizes shortly thereafter. Now on the short side, it can absolutely be a good opportunity for, for bullish investors, if there's a large short interest flow. Most people are like, how can that be if, you know, you're just telling me that it could mean that there's a lot of bearish sentiment and professionals think it's going to go down. Goes back to what I say all the time. Nobody knows what the hell's going to happen. Nobody knows. We have people who would say they're explicit job to try to, you know, analyze different underlying and, you know, come out with an hypothesis on direction and they're wrong all the time. So it comes to 50-50 chance. So the reason why it can be an opportunity risky, but can be is because, again, that similar squeeze scenario, if all of a sudden there's no pull back in all these shorts are trying to cover their positions. Remember, how do you cover short position? You have to buy stock. So whenever we buy stock, we're increasing demand. And increases pricing. So it's just, if a bunch of shorts start trying to cover their positions, they're buying a bunch of stock, which is going to drive price up. So if you're bullish and you see a trend continue to the upside, it could",
    "metadata": {
      "video_id": "-yvQLv-q9uk",
      "title": "Short Interest Float Explained",
      "url": "https://www.youtube.com/watch?v=-yvQLv-q9uk",
      "upload_date": "",
      "duration": 482.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 7,
      "start_timestamp": "00:05:47",
      "start_timestamp_seconds": 347.14,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-yvQLv-q9uk&t=347"
    }
  },
  {
    "text": "buy stock, we're increasing demand. And increases pricing. So it's just, if a bunch of shorts start trying to cover their positions, they're buying a bunch of stock, which is going to drive price up. So if you're bullish and you see a trend continue to the upside, it could be a good investment because there's a chance that the shorts will end up wanting to get out and then driving the price up if enough of them start to do so. So that's what short interest float is, a couple actionable items from an investing perspective on how we can, you know, use this to inform some of our decision-making. I would never use any of this as the basis for a trade, but I do use a lot of this information to assist in, you know, my trade generation ideas. It's a tool in the toolkit. It's not, you know, the end all be all. So I hope this is helpful. I'll catch you guys later.",
    "metadata": {
      "video_id": "-yvQLv-q9uk",
      "title": "Short Interest Float Explained",
      "url": "https://www.youtube.com/watch?v=-yvQLv-q9uk",
      "upload_date": "",
      "duration": 482.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 7,
      "start_timestamp": "00:07:03",
      "start_timestamp_seconds": 423.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=-yvQLv-q9uk&t=423"
    }
  }
]