[
  {
    "text": "Everybody Eric here and I am really stoked for today's guest. So we have Natalie here and I came across her like quite a few people on Twitter except she has a lot of really awesome Bitcoin and cryptocurrency kind of content. So I'm really excited to have you here. Thanks for joining. Yeah. Thanks so much for having me looking forward to it. Awesome. So first off, I think it's always really helpful just to level set. Obviously it's your first time with us on the channel. So I thought it would be really cool just to explore your background very quickly. So people understand your perspective, your paradigm. So really two main questions. The first question is obviously you are very focused on Bitcoin cryptocurrency space. So the first question is what got you interested in that space? Sure. So a little bit about my background. I'm a first generation immigrant. My family came to the US when I was very little from Poland and my family wanted to get another poll. Sorry. Are you Polish? Yeah, it's key is my last name. So awesome. Yeah. So I was born there and came when I was very little we immigrated to Chicago where pretty much every Polish person moves when they come to the US. And my parents came in search of the American dream. They grew up under communism. So they are really passionate about a sense of freedom, especially economic freedom and the ability to move",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "we immigrated to Chicago where pretty much every Polish person moves when they come to the US. And my parents came in search of the American dream. They grew up under communism. So they are really passionate about a sense of freedom, especially economic freedom and the ability to move upwards for social mobility. And so they thought that America would have a lot more opportunity and provide myself and my brother with a better education system and just more chances to kind of improve our lot in life and be able to accomplish what we want to accomplish and become financially secure. So that was always drilled in my head, right? Like it was just this idea that you should work hard, you should get an education and you can make it like America is the place where you have the chance to become whatever you want to become and you can earn money and take care of your family. And they didn't want something extreme. They didn't want to become Jeff Bezos for the yacht. They just wanted like that middle class life of a nice house and a safe suburb, a vacation every year and their kids to go to good school. So I saw them work really, really hard when we came here and they worked so hard that we were able to finally afford a house. And then the financial crisis happened in 2008, 2009 and they lost everything. And I had I watched them",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "to go to good school. So I saw them work really, really hard when we came here and they worked so hard that we were able to finally afford a house. And then the financial crisis happened in 2008, 2009 and they lost everything. And I had I watched them start over again. And so I think back then there was like something instilled in my head of like, how did this happen? You know, they were too good working good, good, hard working people who paid their taxes played by the rules and they got completely screwed by a system that they didn't even fully understand. And I always wondered like, why, you know, why didn't we see that coming? Why did this even happen? How could the greatest, you know, the economy in the greatest country in the world suddenly have, you know, it's economy on the brink of collapse. It's banking system on the brink of collapse and needing bail out from the taxpayers. And that was just sort of, you know, ruminating in the back of my mind. And I decided to pursue a career in journalism because I've always loved storytelling and learning and interviewing people. I love conversations. And so I set off right around that same time around the financial crisis. I got my first job and I started working in this news industry, which was changing in real time because of technology and allowing people to, you know, become their own personalities",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "people. I love conversations. And so I set off right around that same time around the financial crisis. I got my first job and I started working in this news industry, which was changing in real time because of technology and allowing people to, you know, become their own personalities from home and have YouTube channels and all the things that didn't exist when I was growing up sort of dreaming of becoming a journalist. And so what that taught me is, you know, I spent 10 years as a reporter looking at the crises that are facing this country at a really, really deep micro level of human experience, you know, interviewing people that are facing poverty, homelessness, the politicians who claim to have the answer, elections, public corruption, all of it. And what I ended up realizing is that our system is really broken. And we're spending more and more money and the problems are only getting bigger and everyone blame someone else. And really for the average person, life is getting more and more expensive to afford everything from housing to education. And it made me kind of frustrated because I didn't understand what the solution was. And I started to feel as I progressed in my career that really nothing changes it. And then I learned about Bitcoin. And it was 2017. I was in one of the news markets that I worked in and I had friends of friends who worked at Coinbase and they",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "And I started to feel as I progressed in my career that really nothing changes it. And then I learned about Bitcoin. And it was 2017. I was in one of the news markets that I worked in and I had friends of friends who worked at Coinbase and they were kind of investing in crypto. And I was like, what is Bitcoin? And just like most people, I was super skeptical. I thought it was a scam. I thought it was, you know, some internet funny money. I didn't believe in it. I didn't understand it. But I was curious. And I ultimately knew that there was a problem. And supposedly this was a technology that might fix some of the problems we have. So I started to dig into it. Candidly, I did not do most of my research until the pandemic and our market crashed. And they initiated like the bazookas of money printing. And I knew that life was not going back to the same sort of financial world order that we had before. I felt like everything changed with the pandemic. And so I started to consume everything I possibly could, not just about Bitcoin, but about our economy in general, like the history of the Federal Reserve. And you know, I started following gold bugs, Bitcoin people, people who were talking about macroeconomics and what happened in the financial crisis and what happened in 1971 with the gold standard. And I started to realize",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "but about our economy in general, like the history of the Federal Reserve. And you know, I started following gold bugs, Bitcoin people, people who were talking about macroeconomics and what happened in the financial crisis and what happened in 1971 with the gold standard. And I started to realize that all of the problems that both I experienced with my family coming here and losing everything as well as all the problems that I was really reporting on as a journalist, they were all connected to our money and how broken our money system was. And that Bitcoin is the one thing to me that I think could fix it and could usher us into a new financial order that's more inclusive, that's more based on value and is more equal because it's based on actual supply and demand economics, which we haven't had for a very long time with the manipulated interest rates and quantitative easing that the Fed takes part in. And this is a very long winded answer, but basically I came to Bitcoin because I knew there was a problem. And when I learned about Bitcoin, I realized that was the solution and I want to empower people to understand it so that they can opt out of the broken system into one that potentially could help them accumulate wealth and take care of their families in the future. Wow. That's kind of incredible. One, obviously, I just think it's freaking awesome that your parents",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "to empower people to understand it so that they can opt out of the broken system into one that potentially could help them accumulate wealth and take care of their families in the future. Wow. That's kind of incredible. One, obviously, I just think it's freaking awesome that your parents are fellow Polox. Like I said, I get giddy when I find others. But the story that you share is kind of fascinating to me for a few reasons. One, obviously, their timing in just the US market was a little rough because 2008 was just brutal. And obviously, you know, no more about it than I do. You know, just the way that our fiscal policy was set up at that point, obviously it just gives so much leeway to these banks. And you started, you know, the aftermath of your viewing, what kind of monetary decisions they're making. You're like, who thought this is a good idea? You know what I mean? So it's interesting how that moved you towards Bitcoin. So the very first kind of follow on question I have for you is when we're thinking about the current, you know, just monetary policy, the way that the Fed is so involved in our current fiscal policy, what do you think Bitcoin does in order to kind of fix that problem? Obviously, understanding a little bit of the construction, but I'm curious, you know, just at a high level overview of what your thoughts are there.",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "that the Fed is so involved in our current fiscal policy, what do you think Bitcoin does in order to kind of fix that problem? Obviously, understanding a little bit of the construction, but I'm curious, you know, just at a high level overview of what your thoughts are there. Yeah, so put very simply, it takes the power of money out of the hands of government and central authority. And that's what I think we need right now. I didn't really understand the history of money. I never learned it in school. I think this is, you know, it puts a highlight on how little financial literacy we have in this country. I went to good schools. I graduated with a master's at one of the top universities and I really never understood the history of money or how the Federal Reserve came to be. And these are fundamental things that affect all of our lives, right? We use money every single day. It is, you know, our most important information system, I would say. It allows us to measure value and society for everything that we produce and all the services that we provide. And our money is broken and our money doesn't have actual value. It's collapsing and purchasing power. And we don't even know what the true price of things are when you have a Federal Reserve that manipulates interest rates and pumps liquidity into markets by basically creating money out of thin air. And then",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "broken and our money doesn't have actual value. It's collapsing and purchasing power. And we don't even know what the true price of things are when you have a Federal Reserve that manipulates interest rates and pumps liquidity into markets by basically creating money out of thin air. And then that money goes, it gets disproportionately allocated to, you know, the big corporations and they do stock buybacks and they buy up all this real estate and make everyone into renters. It's ballooning the wealth inequality in our country. And so it's just what's sad to me is that I didn't realize that the policies that I was learning in school were really backwards. They were basically addressing solutions as opposed to the problems and the symptoms, excuse me, they were addressing the symptoms as opposed to the actual problem. And the problem is they're debasing our currency. They're debasing our money. They have the prerogative to print as much money as they want. And it affects the average person, the middle class, the low income earners, the savers, it affects them so much. And that's what my family represented. And it's frustrating to me. It makes me angry. And so I want people to be empowered with that education of like, look, we used to have a money that they could not inflate. It was gold. And then gold got centralized and vaults and they issued more paper notes than the gold that they had. And eventually they let",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "so I want people to be empowered with that education of like, look, we used to have a money that they could not inflate. It was gold. And then gold got centralized and vaults and they issued more paper notes than the gold that they had. And eventually they let that get away so far that we basically defaulted and had to go off the gold standard. And now we're in this fiat world where they can make as much money as they possibly want. It goes into the hands of the wealthy before anybody else. And we are getting poorer and more polarized as a nation. We used to be the world's biggest creditor nation. Now we're the world's largest debtor nation. We don't make anything. We don't make anything of value here. And that's sad. And so I now see why everyone is, you know, there's so much angst. And it's like red versus blue. Everyone has a team because everyone's just feeling frustrated by a system that isn't inclusive and isn't fair. And no matter how hard you work, it's like you're always on this, in the rat race or on this gerbil, gerbil wheel. And you can't make enough and you can't retire and you have to start gambling your money and mean stocks, right? And alt coins. So this is the system that Bitcoiners want to fix. Like Satoshi Nakamoto put into the first, you know, block, the Genesis block, the headline Chancellor on Brink",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "can't make enough and you can't retire and you have to start gambling your money and mean stocks, right? And alt coins. So this is the system that Bitcoiners want to fix. Like Satoshi Nakamoto put into the first, you know, block, the Genesis block, the headline Chancellor on Brink of Second bailouts. Like this is the exact problem he wanted to fix or she wanted to fix is the idea that central authority has way too much power and control over the supply of money. And as soon as they start printing too much money and debasing our currency, everybody suffers in the end. So yeah, Bitcoin fixes that. It's interesting. So one of the questions I have with regards to that, I agree with you really on the vast majority of those issues that you noted. Now one thing I am curious your perspective on though is so are you of the opinion that really in general, the government should not manipulate its financial policy, its currencies at all or do you think they should limit their involvement? And the reason why I asked that is I do think in certain circumstances, government intervention has actually worked for us and has made some circumstances a little less, I guess impactful overall, I guess, you know, depending on how you perceive the impactful comment. But I'm just curious, like do you think that going from something where the government is so heavily involved, because right now I think it's",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "us and has made some circumstances a little less, I guess impactful overall, I guess, you know, depending on how you perceive the impactful comment. But I'm just curious, like do you think that going from something where the government is so heavily involved, because right now I think it's way too much, so something where essentially there's no government involvement, what do you think about that jump? So that's a great question. I believe in the rule of law, but I believe in that the government should not be intervening in the free markets and in the economy. And so this is where, again, Bitcoin is the reason why I learned about these different economic theories before Bitcoin, I never understood what Keynesian economics versus Austrian economics were. And I feel like over even just the last like five to 10 years, when I think about the stories I've covered or just like just the climate in general when it comes to the word capitalism has really changed. Like capitalism has turned into a very negative work. It's associated with greed and with wealth inequality. But the truth is, if you really study capitalism, capital, capitalism is about capital accumulation. It's about saving and investing. And it is the complete polar opposite of what everyone is told to do in this country, which is spend that the that the health of an economy in this country is based on the level of spending. And so Keynesians believe that the",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "accumulation. It's about saving and investing. And it is the complete polar opposite of what everyone is told to do in this country, which is spend that the that the health of an economy in this country is based on the level of spending. And so Keynesians believe that the government should intervene and that the government is responsible for stepping in and basically managing demand. They can manage actions of human beings. They can manage unemployment. They can stimulate the economy. They can prevent these booms and bus cycles. But arguably we've had decades of Keynesian economics and all we've had is booms and bus because the economy can't regulate itself. And so that's what really frustrates me is there, there's a school of thought out there that's being completely ignored and not being taught in schools, which is Austrian economics which really focuses on free markets and capitalism and encourages people to save and then invest in something productive and create value for the economy. And we push all that aside in favor of taking on debt and consumerism and spending. And so I truly believe like the Austrians believe that if we had an economy that was based on free markets and an interest rate that basically set itself based on supply and demand as opposed to a central bank, that we would actually have more equilibrium in the economy. We would have fewer booms and buss that weren't as extreme because the market would come in",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "based on free markets and an interest rate that basically set itself based on supply and demand as opposed to a central bank, that we would actually have more equilibrium in the economy. We would have fewer booms and buss that weren't as extreme because the market would come in and fill those gaps and holes. Whereas the government I think encourages malinvestments and misallocation of capital because they ultimately can't decide human action. They can't, you can't just like spend your way into a healthy economy. And we've gotten so into debt using Keynesian economics. I mean, we're basically pushing, putting the tab on future generations and look what's happening. Now a millennial doesn't feel like they can even afford a house that their parents could. That is not the way America should function. Like we're supposed to be, you know, the paradigm of capitalism and free markets and enterprise and entrepreneurship. And now we're leading into what I believe is almost a system of authoritarianism because we have politicians coming in and saying, hey, this is based on corporate greed. I'm going to have universal basic income. This is the bad guy. I'm the fix. We're going to spend more money. We're going to hand out money. That's not the solution. The solution is allowing free markets to function in my opinion. And I think with hard sound money that can't be manipulated at the base layer of our economy, something like Bitcoin using technology to harness sound",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "spend more money. We're going to hand out money. That's not the solution. The solution is allowing free markets to function in my opinion. And I think with hard sound money that can't be manipulated at the base layer of our economy, something like Bitcoin using technology to harness sound money, that is what I think will allow us to have a more equal economy. It's interesting. So one of the things you noted, and I'm just curious to dive in just a little bit further, is you mentioned something to the odor of the market being able to kind of fill some of just the holes that we're experiencing in the current marketplace. When you're referring to the market, I'm curious who that is to you because one of the, I guess, as I'm listening and synthesizing what you're saying, one of the concerns that I have in that kind of world is institutions really drive most of the marketplace right now. The retail investor has pennies to the dollar. So I'm curious how you view the markets in terms of who then starts to assume kind of pricing power and controlling supply and demand. Yeah. And so this is where I believe that we don't have capitalism. We have crony capitalism where we're allowing sort of these big mass production, mass mass corporation entities to rise up and control our economy and our government and sit in the pockets of politicians because that's what essentially Fiat does. When",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "is where I believe that we don't have capitalism. We have crony capitalism where we're allowing sort of these big mass production, mass mass corporation entities to rise up and control our economy and our government and sit in the pockets of politicians because that's what essentially Fiat does. When the Federal Reserve buys treasury bonds or they make up dollars through in their electronic system, that money goes first to the most credit worthy entities. It doesn't go to small businesses. It doesn't go to the average person. It goes to massive corporations. What have they been doing over the last two decades? They buy back their stock and their stock prices go up, but it's not based on value or revenue or the company actually making great new products. It's based on the fact that they're buying back their shares and the CEOs are getting richer and richer. Again, this is not an economy of value. It's based on ballooning asset prices. Everything looks like it's great, but asset prices were in a very expensive stock market right now. SP 500 went up what 30 last year. I would argue that's closer to the rate of inflation that we actually have. House prices went up 30 if not more in certain cities. How can the average person afford a new house? Great that you get to sell your place for 30 more. But now you have to buy a place that's 30 more expensive. There's no winner in",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "we actually have. House prices went up 30 if not more in certain cities. How can the average person afford a new house? Great that you get to sell your place for 30 more. But now you have to buy a place that's 30 more expensive. There's no winner in this unless you just have a bunch of homes you're selling. Again, I just think that this leads to this wealth gap, just increasing, increasing, increasing because in a system of money printing and in a system of fiat, the people who have assets, the people who have the big corporations and can get easy money loans, they're the people that win in this. Then the average saver, the average middle class person is getting robbed through inflation. Getting around them is more expensive. They can't save. Schools more expensive housing is more expensive and they don't have access to this easy money. I just think the system is just getting more and more broken and because people don't understand the system and how money printing works, they don't really understand it. Prior to, I don't know, maybe the pandemic, how many people actually thought about the Fed interest rates, pendant, unless you were in the finance market, we're in the hyper financialized world now. Not many average people thought about it, but today, inflation is one of the main headlines because they've printed the majority of the money that's in circulation in just the last two years. I hope",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "pendant, unless you were in the finance market, we're in the hyper financialized world now. Not many average people thought about it, but today, inflation is one of the main headlines because they've printed the majority of the money that's in circulation in just the last two years. I hope people are waking up to it, but you can't have a system like that because it really disadvantages the average person, the saver, the worker, the families that make up, I believe the backbone of our country, small business owners, all of that. It's an interesting perspective. I would almost call it the bastardization about fiat currency at this point, the way that it's being deployed, I completely agree with you there. I think about the integration of Bitcoin and the ability for a place like the United States. We're starting to see some integration here there, but I'm curious what your thoughts are on that in terms of what needs to happen for widespread Bitcoin integration into the U.S. economy? So I just think it's about education and I think that the market movers in terms of Bitcoin price are going to be when the institutions come in. And again, all of this I think is about education. Michael Sayler, obviously, was a big name over the last two years. He learned about Bitcoin because of the pandemic and the devaluing currency that he had in his reserves and in his treasury. He couldn't figure out where to put",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "again, all of this I think is about education. Michael Sayler, obviously, was a big name over the last two years. He learned about Bitcoin because of the pandemic and the devaluing currency that he had in his reserves and in his treasury. He couldn't figure out where to put his money because bonds with inflation are yielding negative rates at this point. So basically, what are you going to do where you're going to put your money? He makes these great analogies of the fact that it's like the oxygen is getting sucked out of the room and your breathing lasts in less every single year. Your money is a melting ice cube. And until Bitcoin, there really was no solution. And then Bitcoin drops out of the air like this oxygen mask and it's like, aren't you going to put it on? I mean, this is the best performing monetary asset of the last 10 years. But more than that, it is the most powerful computer network in the world. I mean, this is essentially the internet of money. It's completely decentralized. There's no point of failure. There's no CEO you have to worry about. There's no politics. It's literally just a system that has created a mutually beneficial incentive program that almost harnesses greed for good and is decentralized so that no person can control it. Everyone sort of benefits if they adopt it. And through network effect, it's grown to be the most powerful cryptocurrency in",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "It's literally just a system that has created a mutually beneficial incentive program that almost harnesses greed for good and is decentralized so that no person can control it. Everyone sort of benefits if they adopt it. And through network effect, it's grown to be the most powerful cryptocurrency in the world. And I think when you look at inflation rates, not just in this country, but obviously far worse than others, it's like, where do you put your money today that it's going to be safe? Can you afford to buy a house? I mean, you can, I can put 5 into Bitcoin. Can you buy 5 of real estate in New York? No. Right. This is securing your property rights in a way that is not, it's censorship resistant. It is not able to be confiscated. It is open software that anyone can see every transaction validated and recorded all the way to the beginning of the blockchain. I mean, it's truly incredible technology. And so I believe that if people sort of opt out of the system, start putting their money into Bitcoin, they'll see it go up in value. It's a baby monetary network. So yes, there's short-term volatility, but over the long run, it's literally running upwards as opposed to the purchasing power of your dollar, which is collapsing every single year and melting at a rate of between 7 is what they tell you, but I believe it's closer to 20 to 30 every",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "there's short-term volatility, but over the long run, it's literally running upwards as opposed to the purchasing power of your dollar, which is collapsing every single year and melting at a rate of between 7 is what they tell you, but I believe it's closer to 20 to 30 every year. Are you getting a 20 to 30 raise? Where are you going to put your money? What kind of savings account that has a .01 interest yield? Are you going to gamble it on stocks? Well, which stocks? Do you want to put it all in Apple? What are you going to buy? Where do you put your money today? It's not safe. And so I believe that Bitcoin offers us this great savings technology and store of value and a macular digital property that scares that no one can take from you. And I think it's incredible. So an interesting phrase that you use that I'm curious about is you say that it's safer. And I'd love to dive into that a little bit more. And the reason for that is when I think about safety, one of the things I would consider is obviously reduction in variance, reduction in return volatility. And like you said, right now we are in a world where the only way to get a positive real rate of return is via equity markets or something else, like an alternative like Bitcoin. And when I think about some of the conversation around Bitcoin,",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "reduction in return volatility. And like you said, right now we are in a world where the only way to get a positive real rate of return is via equity markets or something else, like an alternative like Bitcoin. And when I think about some of the conversation around Bitcoin, I can see the long term safety depending on how adoption goes. But I also look at an asset that in the last six months went from 69,000 and right now it's hanging at 41.480, something like that. So to me, I think about safety and I'm like, well, wait a minute, that's cut by a third and change. So how is that safer to you? Yeah, so I think safety and volatility are two different things. Safety to me with Bitcoin kind of refers to the fact that I now have a form of property that no one can take away from me, that I can take anywhere in the world and I can transfer value from any from myself to any part of the world in a matter of minutes. And no one can take that power away from me. You can't you can't take them the seed phrase out of my head, right? As opposed to this didn't happen with my family, but I've heard so many stories of people who fled Eastern European countries during communism and they could only take with them to the US or wherever they were fleeing a hundred US dollars worth",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "phrase out of my head, right? As opposed to this didn't happen with my family, but I've heard so many stories of people who fled Eastern European countries during communism and they could only take with them to the US or wherever they were fleeing a hundred US dollars worth of whatever they had. That's all they could take. Well, what if they had Bitcoin? Recently, when the Taliban took over in Afghanistan, I heard amazing, incredible stories of the people who had Bitcoin were able to pay for evacuations or escape the country while the banks were closed or there was a run on banks and the traditional finance system collapsed when the Taliban took over. And Bitcoin was a way that they could still transact and and basically pay for their families to have an escape. I mean, it's literally in real time empowering people with both financial freedom as well as human rights. And so I think that that's incredible. Is it a volatile asset? Absolutely, because as I mentioned earlier, it's in the baby stages of monetization. It is a brand new monetary network. And you know, in different countries, it's also it has different tax implications and you could trade it in and out of the highs and lows in places like Dubai or UAE and you get no tax penalty. And here in the US, like we're if you hold, you want to hold because you don't want to face capital gains tax, right?",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "implications and you could trade it in and out of the highs and lows in places like Dubai or UAE and you get no tax penalty. And here in the US, like we're if you hold, you want to hold because you don't want to face capital gains tax, right? It's taxes, right? So we're in the baby stages of monetization, but I would prefer to have an extremely volatile appreciating asset that year over years just going up in value as opposed to an extremely stable, not volatile at all asset like cash, which is collapsing in value over the last several years, right? So I can stomach the volatility and I get that people need to you know, use their fiat money for everyday expenses and a lot, you know, not a lot of places even accept Bitcoin. And I would argue you want to hold something that's increasing in value. But ultimately, I see it as a safer place because I don't have to worry about a CEO. I don't have to worry about some, you know, some product having good or bad performance, supply chain issues. I don't have to worry about a certain politician getting elected. It's just is what it is. It's a computer network that allows us to store our monetary energy in a place that has outperformed everything else that exists and that is controlled by no one and that no one can manipulate because there's a finite amount secured by this",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "elected. It's just is what it is. It's a computer network that allows us to store our monetary energy in a place that has outperformed everything else that exists and that is controlled by no one and that no one can manipulate because there's a finite amount secured by this decentralized network. So I don't know if that answers your question, but like for me, safety is like not about its volatility. Yeah, no, it does. And that really, I'm actually really stoked that you took the conversation in that direction, just because I've talked to some different people with varying concept of, you know, again, safety. And I always feel like that's an important different sheet to make. And I think the way that you phrase that, I totally agree with that, that makes total sense to me. And especially because sometimes what frustrates me with some of the Bitcoin conversations is some people don't like to admit that it's super volatile short term. And then it, markets is closed. But then it makes, you know, it almost makes the rest of the conversation kind of hard to like really conceptualize. So I think that that's a really, really great way to highlight, you know, the safety concept for something like Bitcoin. I agree with you there. I think that's a great, a great way to phrase it. So being mindful of your time, I do have two more questions. The first one is looking into 2022. What, what",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "great way to highlight, you know, the safety concept for something like Bitcoin. I agree with you there. I think that's a great, a great way to phrase it. So being mindful of your time, I do have two more questions. The first one is looking into 2022. What, what is it, what is, you know, what happens to Bitcoin? Do you see more adoption coming, especially with the Fed coming out with this interest rate manipulation, you know, or expecting three to four rises, starting as soon as March? Like I'm just curious at a very high level, what do you think is going to happen to Bitcoin throughout the rest of this year? Yeah, so I have really high hopes for Bitcoin hitting new all-time highs because ultimately I do think that it's still correlated in some way to the traditional markets and liquidity. And what I hope everyone is learning over the last, at least year or two, is that our economy is basically addicted to quantitative easing and stimulus. It's addicted to the money printer. And as soon as they try to let off the gas pedal, everything tanks, right, and goes into the red. And so unfortunately, our Fed is now between Iraq and a hard place because we have so much debt, and we can't service that debt if they raise interest rates meaningfully to a place where they probably should raise interest rates. They would cause a complete credit collapse and, you know,",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "so unfortunately, our Fed is now between Iraq and a hard place because we have so much debt, and we can't service that debt if they raise interest rates meaningfully to a place where they probably should raise interest rates. They would cause a complete credit collapse and, you know, bankruptcies and the unwinding of this massive leverage that we have that's historic, that's a much bigger bubble than we had in 2008. But if we go the other way and we keep printing, then it's just devaluing our currency more, but it obviously makes it cheaper to service our debt. So pretty much, I believe that they're going to go by way of inflation. They're going to give us the headlines of inflation's good. And this is why it's good. Oh, now we're going to have price controls and they're going to try to fix things. We're just going to have inflation, right? Exactly. Yeah, now we're seeing we're seeing the narrative that, you know, now we're going to potentially have price fixing and wage controls, which it's like it's sad because it's clear that most people who are leading this country politically don't understand basic economics and the times in history when people tried that and it really didn't work. Right. So, um, so what I believe will happen is I believe they will talk about tapering. They might try to raise, you know, a couple basis points. They won't be able to. We have an election coming",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "times in history when people tried that and it really didn't work. Right. So, um, so what I believe will happen is I believe they will talk about tapering. They might try to raise, you know, a couple basis points. They won't be able to. We have an election coming up. We are going to have to have green markets for that. What's that going to mean? More money printing, more devaluing of our currency. I think that that's going to help Bitcoin, anything with liquidity is going to help Bitcoin in any time that people realize that this system is just too far gone at this point. We're insolvent and we're addicted to the money printer and we're just going to keep debasing our currency. Bitcoin is a fantastic technology that ups us out and I think more and more people will adopt that both institutions and retailers. I'm so happy and grateful that we have this technology. And so I think Bitcoin, you know, once the markets are are given the green light from the Fed that no more tapering is going to happen. I think they're going to run and I think Bitcoin is going to run with it. Interesting. Yeah. I think when I think about Bitcoin, though, it's kind of boring, right? Because Big Daddy Jay Powell can't just turn on the printer and then just print Bitcoin. So where's the entertainment now? No, I just can't. They should print money to buy Bitcoin. That's",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "with it. Interesting. Yeah. I think when I think about Bitcoin, though, it's kind of boring, right? Because Big Daddy Jay Powell can't just turn on the printer and then just print Bitcoin. So where's the entertainment now? No, I just can't. They should print money to buy Bitcoin. That's an interesting, it's an interesting outlook and it highlights really my last question. And it's something that I'm just personally curious about. I find that we always at least as traders, we're always looking for relationships and correlations and how things interact with other things. And Bitcoin is a tricky one because for a while, a lot of people saw it as an inflation hedge. And then some people are saying, well, is it really an inflation hedge? So that's really the last nuance question I have for you is how do you think Bitcoin interacts with directly with interest rates? Do you think that it's something people can slowly add to the portfolio as a style of hedge? Do you think that there are two just disjointed for that to really be an observable relationship at this point? What does that look like to you? For me, and I said this recently in a news show that I was a part of, I believe that Bitcoin is a fantastic inflation hedge. And I think that a non-zero position is the right one for everyone at this point. And everyone has different amounts of risk and volatility they can stomach.",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "said this recently in a news show that I was a part of, I believe that Bitcoin is a fantastic inflation hedge. And I think that a non-zero position is the right one for everyone at this point. And everyone has different amounts of risk and volatility they can stomach. But I believe at least a one to five percent is smart for everyone. And I really try to educate as many people about it as possible because at this point, it is literally the best performing monetary asset of the last decade. It's appreciated about a million percent. The second best performer was Tesla at 15,000 percent. Amazon and Apple stocks were about 12, 12 and 1400 respectively. SP 500 did about 300 percent over the last decade. Gold went down about 6 percent. So it's not the inflation hedge that I suppose it once was. But let's look at the last couple of years. 2019 was around 90 percent that Bitcoin went up. 2020 300 percent. Last year 60 percent. Inflation, yes, they're telling us it's 7 percent. But let's look at how much assets have gone up. Let's look at the SP. Let's look at how much housing has gone up by. That's what I believe tells the real story of inflation. Tell 7 percent to the person going to to gas and paying 40 percent more at the pump or paying 25 percent more for their meat at the supermarket. Inflation is a massive problem. We're",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "housing has gone up by. That's what I believe tells the real story of inflation. Tell 7 percent to the person going to to gas and paying 40 percent more at the pump or paying 25 percent more for their meat at the supermarket. Inflation is a massive problem. We're being misguided and misinformed about it by the media, which is really sad. I come from a journalism background. We should be watch dogs for the government. We shouldn't be lap dogs and propagandists for the government and their policies. We should be really holding their feet to the fire. So I think that the inflation narratives, we need to actually inform people about how this is really hurting them in their bottom lines. The stimulus checks are just like a little crumb in all of the. I think it's a distraction. Yeah, I think it's a distraction. I think that's just to see a few people. I mean, look at those percentages. You beat inflation all those years of your Bitcoin. Right. Yeah. Yeah. I mean, it's a great way to think about it, especially like a longer term asset. I think that's a good story. And I typically lie with the last question because I always think of one more. And I just lie to you because I've one very last one promise. So for people that are interested in getting involved, do you have any recommendations for them? And the reason why I ask that is I",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "lie with the last question because I always think of one more. And I just lie to you because I've one very last one promise. So for people that are interested in getting involved, do you have any recommendations for them? And the reason why I ask that is I talk to some different people. And for me personally, I've always been kind of an advocate of a platform that gives you like actual direct exposure to holding the currency as compared to indirect exposure things like that. But I'm curious from your perspective, if somebody is like, I'm curious, and Bitcoin want to get started, what should they do? Yeah. So just a couple of things on that. I think education again is number one. And until you understand the problem, you don't appreciate why Bitcoin is a solution. Right. So I think first, people should look at, you know, their, their financial lives. Are they making enough to be able to comfortably plan retirement or plan a future for their family, for their kids? Are they, are they stressed out financially? Well, if you are, and I would argue that a lot of people feel that way in this country, what are, what's the rate of return you're getting on your investments if you're investing? What's the rate that you got on your stocks? What's the rate you're getting in your savings account or in your 401k? What's that percentage? Now, let's compare that to Bitcoin. There are",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "this country, what are, what's the rate of return you're getting on your investments if you're investing? What's the rate that you got on your stocks? What's the rate you're getting in your savings account or in your 401k? What's that percentage? Now, let's compare that to Bitcoin. There are so many avenues that you can invest in Bitcoin now, but I agree with you. I think holding Bitcoin directly, becoming your own bank and becoming financially sovereign is the number one. And it is a little bit technology and technologically intimidating for some people, because it's the idea of, you know, taking ownership and having something that's completely digital in your custody and you have to protect it. There are also other avenues where there are trusted third parties and multi-sig wallets and all of that that will help you protect your Bitcoin. But number one is just education. Look at your financial life and tell me if it's performing the way you want it to. And then let's look at Bitcoin's performance. If you want to read a book about Bitcoin, the best one out there, I've read it countless times now, Bitcoin standard. Number one, best book. It's hardly even really about Bitcoin. It's about the history of money and how our system got to be where it is and why we're struggling with some of these issues and why Bitcoin was invented. It is a phenomenal book. It helped get me down the rabbit hole. And",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "It's hardly even really about Bitcoin. It's about the history of money and how our system got to be where it is and why we're struggling with some of these issues and why Bitcoin was invented. It is a phenomenal book. It helped get me down the rabbit hole. And then, you know, start investing. That's the best way. Buy Bitcoin. Buy two dollars worth of Bitcoin. Buy five dollars worth of Bitcoin. You know, spare the coffee that you would have had and put that money into Bitcoin and watch its performance over the next five, six, ten, 12 months. I really just believe, you know, having a little bit of exposure gets you interested and engaged doing the homework. But, you know, it's just simple things. Are you doing well financially? If not, you know, one to five percent is pretty conservative. If it goes, if it goes down, you lost one to five percent. If it does what I believe it will do, you could potentially change your life with it. So, um, yeah, I, I have two websites that I recommend personally. I love swan Bitcoin. Um, they're a Bitcoin only exchange. They're fantastic. And okay, coin. Okay, coin is available in the most amount of countries in the world. It has very low dollar cost averaging fees. So basically, you can like set up a recurring buy and you don't have to pay fees on it. Like you do with some other exchanges that are,",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  },
  {
    "text": "coin. Okay, coin is available in the most amount of countries in the world. It has very low dollar cost averaging fees. So basically, you can like set up a recurring buy and you don't have to pay fees on it. Like you do with some other exchanges that are, are big names out there. Um, and so it's really easy. Again, you can buy a dollar worth of Bitcoin. Awesome. That's so awesome. Thanks for going through that too. Because I know a lot of people are, you know, really curious on how to get started. So, um, I know you got to run. Thank you so much for sharing some of this information with me. And really more importantly, I, I literally love the fight that you're fighting. It really is kind of a good fight. And I think your focus on just the typical American is, it's truly refreshing. So thank you for doing what you do. Well, thank you. I appreciate it. Thanks for having me. Awesome. Take care, Natalie. Thanks.",
    "metadata": {
      "video_id": "0BI8bymKOIE",
      "title": "Bitcoin & Monetary Policy | Natalie Brunell",
      "url": "https://www.youtube.com/watch?v=0BI8bymKOIE",
      "upload_date": "",
      "duration": 2202.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0BI8bymKOIE&t=0"
    }
  }
]