[
  {
    "text": "I just made a quarter million dollars tax-free selling a house that I haven't lived in for two years. This is exactly why I talk about investing in multiple mediums. For me, it's the stock market real estate in angel investing. By doing this, it allows me to identify opportunity, rotate capital to where I can take advantage of the opportunity, and do it all over again. So if you're interested in learning more about my approach to developing wealth, subscribe to the account, share with some friends, and I'll catch you all later, be an outlier.",
    "metadata": {
      "video_id": "0I32lVyhZuU",
      "title": "Made $250,000+ TAX FREE Selling a Rental Property #shorts",
      "url": "https://www.youtube.com/watch?v=0I32lVyhZuU",
      "upload_date": "2022-08-04T23:54:03Z",
      "duration": "PT28S",
      "channel_name": "",
      "description": "Follow on Twitter for Trades, Ideas, and Live Stock Market News.  @esInvests \nJoin the Weekly Launch Newsletter.  https://www.esinvests.com/contact\nReach out with any Questions or Topic.  erik@esinvests.com\nJoin the esInvests Outlier Dojo on Discord.  https://discord.gg/hYGZUEJpve\nWebsite.  https://www.esinvests.com\n\n#Investing #RealEstate #BeAnOutlier\n\nMy name is Erik. I'm a Marine Veteran, information activist, and trader for 15+ years. \nI don't come from money and am nothing special - yet I still made my first million before I was 30. The stock market played a critical role in my ability to develop wealth. \n\nWhat is esInvests? \nA community dedicated to becoming financial Outliers without the BS. Here, I share my first hand experience developing wealth via trading, real estate, and angel investing. \n\nWhat can you expect?\nInvesting basics, options trading, portfolio management, trading psychology, trading strategy, money management, live trading, live market reviews, trader workshops, real estate and angel investing, all coupled with some fun along the way. \n\nWelcome to the Outliers!\n\nI am not a financial advisor. All content is shared for educational and entertainment purposes only.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 1,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0I32lVyhZuU&t=0"
    }
  }
]