[
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "you you you you you you you you you you you you you you you you you you you you you you you will itself you you you you you you you you you you you you you will have a lawyer who who you observations in itself I have at least a pretty good understanding of what I'm looking to accomplish more broadly and what I want to do. But before we get into any of that, we do need to say hello to everybody that's here because you all are what make that a thing. And I want to explain to you why that's important in a minute. To that end, what's up, Lauren Kirk Schrey, Schreisen OG and same thing with IR2 Bad, another OG that's effectively been here from the start. I actually don't know for IR2 Bad. I'm not positive when you found your way into the channel. I know it's early. I just don't know exactly when. I'd love to know. Reggie says congrats, 40k will come soon. It'll come when it comes. One of the coolest things about the channel is that it consistently grows. So I fully agree for those that don't know the longer term objective is 100,000. And the reason why I want to get to 100,000, I've explained this before. But I think that that is main stream enough penetration for the YouTube channel. That it proves two things. One of them it proves that what I'm sharing is",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 397.88,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "know the longer term objective is 100,000. And the reason why I want to get to 100,000, I've explained this before. But I think that that is main stream enough penetration for the YouTube channel. That it proves two things. One of them it proves that what I'm sharing is being shared in a way that at least is usable to a large number of people, which is important. But it also proves that I've done a good enough job striking that balance because, as you all know by now, I literally refuse to compromise on what I consider to be quite literally a moral obligation of a content creator, especially in this kind of space. Which is to not sell out, go down the route of here's how I made $62,000 over the weekend in three minutes, which is actually a real story. But I won't make that video. And the reason why I won't make that video is because that video will completely destroy a new trader's expectation of how this thing is going to go. And I think that sucks. It's effectively completely corrupting them and it's overall setting them up for failure or success, which is the antithesis of why I started this whole thing. Lawrence says we're going to have to get you to use clickbait titles and you could talk about paper trading. Yeah, now that is the old. What is it the rug pull fun fact for those that don't know the channel",
    "start_timestamp_seconds": 380.44,
    "end_timestamp_seconds": 478.52,
    "start_timestamp": "06:20",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=380",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "the antithesis of why I started this whole thing. Lawrence says we're going to have to get you to use clickbait titles and you could talk about paper trading. Yeah, now that is the old. What is it the rug pull fun fact for those that don't know the channel Benjamin, which is again, I hope you guys know I keep in touch with him pretty regularly actually I like Benjamin a lot. He's a really good dude. He's been getting more into trading, which is absolutely awesome to see. And this is this is his channel in case you don't know you should check it out and He's evolved a lot, but anyways, that idea of like a rug pull is definitely something he suggested. He was like, you have to just package them in a way that people will click and then you could talk about whatever you want. Which there's something to that, but I still have reservations about it a lot of it is I'm just a contrarian. I do like to do things differently than other people and my hope is that over time it'll do what it's supposed to do, which is find the people it's supposed to find. That is probably one of the absolute coolest things about our community genuinely is we literally have awesome people awesome people. If you think of online communities that talk about trading and talk about investing, it is very, very, very difficult to find places that",
    "start_timestamp_seconds": 456.44,
    "end_timestamp_seconds": 555.48,
    "start_timestamp": "07:36",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=456",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "people it's supposed to find. That is probably one of the absolute coolest things about our community genuinely is we literally have awesome people awesome people. If you think of online communities that talk about trading and talk about investing, it is very, very, very difficult to find places that people are willingly. Abel to help you have a conversation about something they're willing to structure it in an academically rigorous manner, which is asking questions probing looking for weakness, looking for strength. But then also just being a genuinely good person on the back end of it not being malicious, not just wanting to fight to bigger. That's the kind of stuff you're going to find on most online communities you'll find that on places like Reddit very frequently. I didn't find a lot of that we were on Facebook for those that don't know originally we moved from Facebook to discord and that's no small part due to another community mentor member Pita. And he's the entire reason why we migrated from Facebook to discord because I knew nothing about discord before him he's the one that built the shell that what we have is now completely predicated on now. I want to do two things. The phase says evening morning for me, we have a European in the group what's up good to see you from the other side of the pond. And then I are too bad says I think there was five on the discord.",
    "start_timestamp_seconds": 531.48,
    "end_timestamp_seconds": 638.28,
    "start_timestamp": "08:51",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=531",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "on now. I want to do two things. The phase says evening morning for me, we have a European in the group what's up good to see you from the other side of the pond. And then I are too bad says I think there was five on the discord. Okay so it was post migration can were you there when we were in Facebook still remind me. I remember it was early and I don't remember when we made the jump from Facebook to discord but it was early on the timeline there's well I don't remember most of the timeline. Okay no Facebook got it so it was still within the first year I think we made that migration if I'm not mistaken. Here's here's effectively how it went and I remember the date that I started the YouTube just because it's a funny day not because it's a meaningful day to me. I started the YouTube on 4 May and the reason why I think the reason why I remember the 4th of May which is that that's like Star Wars day right like me the 4th be with whatever the fuck. There's some Star Wars shit about this day if I'm not mistaken. So this I remember because of whatever that is and then over time we've made a couple big changes. The first one this was just YouTube then at some point it was a Facebook group then after the Facebook group we moved to",
    "start_timestamp_seconds": 609.72,
    "end_timestamp_seconds": 704.68,
    "start_timestamp": "10:09",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=609",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "about this day if I'm not mistaken. So this I remember because of whatever that is and then over time we've made a couple big changes. The first one this was just YouTube then at some point it was a Facebook group then after the Facebook group we moved to discord. Then like literally a couple years later the Patreon hasn't been around that long Patreon came like maybe two years ago that's it thank you Reggie may the 4th be with you that's it. That's why I remember that date. And for those that don't know the origin story for the channel I want to tell you it because it's actually hilarious it's actually absolutely hilarious. We moved into this house right before COVID it's kind of during COVID it was in 2020 and we found that this house is on top of a hill. Why would like it but what I didn't know is bees honey bees when they have a nest at some point typically around the spring half of that nest leaves They break off and then they go create a new nest and then the old nest stays or doesn't that's a I don't know that part But I know that they break off in a bunch of them leave they literally fly around in In baskets of bees like it's huge I actually can probably find the video and see if I can't figure out how to show it to you guys because it's",
    "start_timestamp_seconds": 692.44,
    "end_timestamp_seconds": 780.76,
    "start_timestamp": "11:32",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=692",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "that part But I know that they break off in a bunch of them leave they literally fly around in In baskets of bees like it's huge I actually can probably find the video and see if I can't figure out how to show it to you guys because it's incredible I've never seen anything like this I'm from New York so seeing an absolute swarm of bees is Completely foreign to me This would have been back in like Definitely early on in 2020 before May of 2020 we know that and I'll explain why we know that in a second But it wasn't that far from there and So we I find out that my house has this really really fun quirk in order to address here it is Yeah, I'll figure out how to show it figure out how to show this to you guys maybe I'll fuck do I show this to you guys Can Does this come through it kind of does Kind of does well you'll be able to see as it moves give me a sec Oh wait I could just literally just put it on my fucking computer That was a boomer moment. I apologize for the boomer moment because I literally was about to just try to Fucking show I don't know why I was gonna do that was very silly I'm uploading it to Google Drive and then from Google Drive I will simply play the video on the computer",
    "start_timestamp_seconds": 768.44,
    "end_timestamp_seconds": 863.4,
    "start_timestamp": "12:48",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=768",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "moment. I apologize for the boomer moment because I literally was about to just try to Fucking show I don't know why I was gonna do that was very silly I'm uploading it to Google Drive and then from Google Drive I will simply play the video on the computer and share the screen therefore you all can see beautifully This is actually the start by the way of the YouTube channel so the story about the bees is Comically important and I'm actually gonna see when that happened that was on the 20th of April That's actually even funnier than I thought All right, let me grab the video of the bees now that I've told you about them and I wouldn't want to leave you hanging I think it's cool literally because I I've never mine tire life seen anything like it Other people oh who knows other people it's probably like fucking part for the course not for your boy All right You This screen Beautiful beautiful beautiful All right, here we go So let me get rid of this this is outside my window And you can literally see outside my window this mess of Stuff these are all Bees and I'm gonna play it and you're gonna see them Flying around like that that was outside my window They were bouncing off the window and they were going inside this rain gutter right here They really liked that little rain gutter Thousands and thousands of",
    "start_timestamp_seconds": 849.0,
    "end_timestamp_seconds": 965.64,
    "start_timestamp": "14:09",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=849",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "these are all Bees and I'm gonna play it and you're gonna see them Flying around like that that was outside my window They were bouncing off the window and they were going inside this rain gutter right here They really liked that little rain gutter Thousands and thousands of them I had never seen anything like it So we I'm sitting in my office and then I realized that we're like in the apocalypse or the end of days In case anybody's allergic to bees that would not be the right place to be Get it and we call a like beekeeper to come get rid of the bees I don't have like a fucking bee suit and I'm not scared of bees, but I am also not fucking with And the way that I used to get rid of bees as a kid was using some sort of aerosol can and a fire source Probably not sick on the house so the only real approved way that I know that like break cleaner Wasn't gonna do it especially in that volume in case you didn't know bees When they set up a hive they fucking somehow know where it is and they come back to it years later Literally years later they've come back a couple times the way that we've kept them out is this really fine mesh That we put in where they like to go the other hilarious part is that outside my window that",
    "start_timestamp_seconds": 947.72,
    "end_timestamp_seconds": 1024.6,
    "start_timestamp": "15:47",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=947",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "it is and they come back to it years later Literally years later they've come back a couple times the way that we've kept them out is this really fine mesh That we put in where they like to go the other hilarious part is that outside my window that you're just looking at There's one corner right there that they were at there's another one over here same exact setup They don't go to that one we don't have any mesh in that one they they never go on that one it's only that one Nature's awesome beekeeper comes and We're just talking anybody that comes and works on the house or helps me at the house. I always Express appreciation and I like learning so I was asking them all about the bees and just learning and Right before he left he was heading out of the house He literally goes to me and remember this is the 20th of April. He's like Are you some sort of youtuber or something? This is before I started the channel. I didn't even have social media I thought that was the craziest fucking thing anybody ever could have said to me you guys see my face I don't look pretty I don't belong in a camera I thought it was the most absurd thing I literally was cackling laughing at that idea it was insane to me and What that was the 20th of April on the fourth of May",
    "start_timestamp_seconds": 1013.16,
    "end_timestamp_seconds": 1095.48,
    "start_timestamp": "16:53",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=1013",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "me you guys see my face I don't look pretty I don't belong in a camera I thought it was the most absurd thing I literally was cackling laughing at that idea it was insane to me and What that was the 20th of April on the fourth of May I started the youtube channel something I never thought of in any capacity in my entire life Yet this fucking beekeeper was prescient He somehow knew that that was gonna be a thing. I don't know how but clearly there was something there because He planted the seed it's because of him were here. I think at least subconsciously What prompted me to start the youtube channel was really really simple? I had a conversation actually today with one of my military friends I didn't serve with him but I met him actually he helped me work on this house a little bit And he reached out asking about game stop funny enough and he was asking about some position and management and stuff like that I used to have a lot of those conversations During COVID a lot of the bases said to their people unless there were some sort of very specific purpose for them to be there They said like don't come in right we're trying to trampe tamped down the spread of this thing So bunch of friends are at home. I do what I do which is I Got into investing because of the grace",
    "start_timestamp_seconds": 1077.72,
    "end_timestamp_seconds": 1164.36,
    "start_timestamp": "17:57",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=1077",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "sort of very specific purpose for them to be there They said like don't come in right we're trying to trampe tamped down the spread of this thing So bunch of friends are at home. I do what I do which is I Got into investing because of the grace of a high school teacher a high school teacher took it upon himself To introduce me to the concept of investing. I didn't ask him because I didn't know to ask Yet He still knew it was important and he shared it with me I imagine this has got to be something like what religious people feel that go to like different people's houses trying to spread the religion Generally, I feel like it's probably pretty close to that Because I try to spread awareness about investing During COVID friends are at home. I'm just calling my friends and I'm having very basic financial conversations I know most people are not built for options. I know most people are not built for trading. It's not good for most people I also know that I am on the spectrum and the stuff that I lock onto I have an obsessive personality that cannot let it go If it's something I find interesting. I also know a lot of people are not like that In these calls, I found myself repeating myself a lot Basic concepts like do you have six months of an emergency expense If you work in government or",
    "start_timestamp_seconds": 1142.92,
    "end_timestamp_seconds": 1236.04,
    "start_timestamp": "19:02",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=1142",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "that cannot let it go If it's something I find interesting. I also know a lot of people are not like that In these calls, I found myself repeating myself a lot Basic concepts like do you have six months of an emergency expense If you work in government or if you work in the military specifically six months is more than enough If you work in a civilian job or something like a startup you want a little bit more than that because you never know when the ends to your income is gone And for those that don't know one of the biggest mistakes you can make is by thinking that your safe with your income if you think of you And hopefully your eyes are a little more Normally spread out than that if not you know chat out to you no disrespect But if you have a W2 That is your income That's literally your fucking lifeline that is the only source of capital you have to somebody like me This is terrifying Because you literally become a slave to this They tell you to do something that you don't really want to do you got to do it A lot of my friends were being told that they had to get the vaccine and a lot of them have different opinions Again, not gonna go into whether you should get it not get it. I don't care at all But in this context a lot",
    "start_timestamp_seconds": 1211.96,
    "end_timestamp_seconds": 1307.72,
    "start_timestamp": "20:11",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=1211",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "to do it A lot of my friends were being told that they had to get the vaccine and a lot of them have different opinions Again, not gonna go into whether you should get it not get it. I don't care at all But in this context a lot of them were forced to either get in line and do it keep your job or if you don't do it You lose your job That is a big decision and when you only have one source of income It forces your hand in a lot of cases because in case you don't know a lot of military families The spouse doesn't work and it's because it's really fucking hard for them to work They move every two to three years. That's hard to shit to get a job a lot of them Thug it out and figure out how to get a job which is insanely impressive But it's difficult for the spouse wherever that is This is dangerous during COVID Understanding this structure. I I was over here on my phone Calling my friends and saying like hey, are you investing and Some of them say yes, some of them say I don't know how I was having the same conversations I was saying do you have six months of Savings expenses This is your emergency fund. Do you have this and something liquid? No, okay, let's talk about a budget on how to do that Once that's",
    "start_timestamp_seconds": 1292.92,
    "end_timestamp_seconds": 1379.72,
    "start_timestamp": "21:32",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=1292",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "of them say I don't know how I was having the same conversations I was saying do you have six months of Savings expenses This is your emergency fund. Do you have this and something liquid? No, okay, let's talk about a budget on how to do that Once that's done, do you have some sort of investment portfolio set up outside of the TSP Thrift savings plan. That's the OG retirement plan that is Frankly awful They've revamped it massively which I'm stoked for current military members on but when I was around it was awful With that most of the time it's no they don't even know what a broker is So then it's walking them through finding a broker then after finding a broker It's how to build a buy and hold portfolio that outperforms the market Walking them through that these are Basic topics that I was repeating that I literally could easily make a video Hey say hey watch these four videos and then let's hop on the phone and let's talk about your individual scenario on like what makes sense out of all of this This is how it all started that's why I started the YouTube in May Happened to be the fourth which is funny happened to be after the 20th of April where that beekeeper mentioned the idea of a YouTube Which I thought was ridiculous and I Obviously to subconscious plant in my mind and I started it and I",
    "start_timestamp_seconds": 1361.88,
    "end_timestamp_seconds": 1450.6,
    "start_timestamp": "22:41",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=1361",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "started the YouTube in May Happened to be the fourth which is funny happened to be after the 20th of April where that beekeeper mentioned the idea of a YouTube Which I thought was ridiculous and I Obviously to subconscious plant in my mind and I started it and I did not start it with any Context or any idea of Growing it or becoming a content creator or a financial influencer like none of that bullshit I still don't identify with literally any of that This is how it started and then I found some of my early videos Started gaining traction and I actually found the oldest video that I could find on the channel to share with you guys because it's actually kind of funny I thought we could look at it together One thing to note this is not the first video on the channel. I went through a phase Where I actually deleted a ton of videos hundreds of videos off the channel I had no idea that that hurt the channel in case you don't know it does and here's how it hurts the channel and it's why I don't do it anymore Is if you have a bunch of different videos and Let's say you got 10 views 10 views 10 views 10 views 10 views you have 50 views and then let's say that you delete these three You lose 30 views now you have 20 views So it actually hurts the",
    "start_timestamp_seconds": 1436.84,
    "end_timestamp_seconds": 1523.32,
    "start_timestamp": "23:56",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=1436",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "if you have a bunch of different videos and Let's say you got 10 views 10 views 10 views 10 views 10 views you have 50 views and then let's say that you delete these three You lose 30 views now you have 20 views So it actually hurts the channel stats overall the views aren't attached to the channel They're attached to the video. I didn't know that so I literally deleted hundreds of videos The reason why I deleted hundreds of videos is I'm actually really really big into organization I like things to be streamlined. I don't like a bunch of fluff access I like stuff to be extremely streamlined and Having like the mess of a bunch of videos that are just unlisted was annoying to me So I just deleted a bunch again don't do that anymore So this is the oldest that I could find this is from the 20th of May which Yeah, okay that makes sense because I was gonna say the data the video is the 22nd which that doesn't make sense to me Let me There like some fucking inception thing that I thought that it was oh is the 22nd of me, okay. Yeah, I just had the date wrong So this video was uploaded on the 22nd of May which is when this is up here This video was about the VIX V compared to Vxx The funny thing about the video as I look at it is",
    "start_timestamp_seconds": 1505.56,
    "end_timestamp_seconds": 1596.36,
    "start_timestamp": "25:05",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=1505",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "22nd of me, okay. Yeah, I just had the date wrong So this video was uploaded on the 22nd of May which is when this is up here This video was about the VIX V compared to Vxx The funny thing about the video as I look at it is I can see how unbelievably awful this is to watch and I look at it now and I literally am like This is terrible I've learned so much From this starting point to where we are now and All of it is completely self-taught. It's like the trading skill set. This is me Going through a learning phase and learning something completely new Even though still at this point I had no real aspirations of like growing the channel Actually, I could tell you right now. I think I can tell you right now how many subs I had at the time at a sheer curiosity Let's see let's see if I can figure that out I'm almost positive I'll be able to Identify is that would actually be kind of fucking hilarious But the fuck this is views I'm not used Monthly audience yeah, this is fine So this is not subscribers is just like the month the number of monthly people that view The channel and for context right now. It's like 70,000 to a hundred thousand Over the course of a month still by no means any sort of like significant footprint at all So what I'm",
    "start_timestamp_seconds": 1573.56,
    "end_timestamp_seconds": 1692.68,
    "start_timestamp": "26:13",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=1573",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "is not subscribers is just like the month the number of monthly people that view The channel and for context right now. It's like 70,000 to a hundred thousand Over the course of a month still by no means any sort of like significant footprint at all So what I'm doing is now I'm moving the chart out. It's actually hilarious. Let's find May 20th May 20th was 452 Or hundred and 52 monthly viewers Right on and then the average for like 2020 into 21 was like 4,000 over the course of a month so Pretty good pretty good growth there overall Let's listen to a little bit of Vxx Vx just because it's awful it really is so bad and I think it's funny to laugh at me. I listen to everything two times I'll slow it down to normal which is gonna be even more painful for me And Let's just listen to a few seconds of this before I get completely over it you can also see my hair Was wild I hadn't had a haircut in a while and it's again because COVID right all the barber shops are closed so You boy was just growing out growing out the hair The view here is very different the view here is so different because this was all done on a laptop I didn't even have a desktop I didn't have a webcam all of it like the laptop used to be over on that side",
    "start_timestamp_seconds": 1675.08,
    "end_timestamp_seconds": 1770.92,
    "start_timestamp": "27:55",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=1675",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "growing out growing out the hair The view here is very different the view here is so different because this was all done on a laptop I didn't even have a desktop I didn't have a webcam all of it like the laptop used to be over on that side And I also didn't have a mic somebody bought me my first mic Which was hilarious I did not have a mic and I had absolutely no real game plan for the videos kind of similar to now for being honest about it But because you I like I did the same thing which is just kind of Outline stuff But let's listen Hey everybody As promised I have another video Comparing the VIX to the VXX V also these awesome their products that I really enjoy their video. It's awful. That's fucking awful Like now Knowing what I know now the first 10 seconds of a video are so important and What I've said so far in the first 10 seconds of this video is Abs of fucking literally nothing I've said nothing in the first 10 seconds just nothing It's what it just words Let's see when I actually say something of substance Very nuanced I'm actually there new wants that's what you get your 12 seconds in And your biggest takeaway is that volatility ETS ETPs are nuanced Sick right what a fucking revelation Talking with one of my friends right now who's been a lot of",
    "start_timestamp_seconds": 1759.4,
    "end_timestamp_seconds": 1869.24,
    "start_timestamp": "29:19",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=1759",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "actually say something of substance Very nuanced I'm actually there new wants that's what you get your 12 seconds in And your biggest takeaway is that volatility ETS ETPs are nuanced Sick right what a fucking revelation Talking with one of my friends right now who's been a lot of time Learning about volatility so I'm hoping to have him come on and talk to us a little bit About what he's learned bring some of his experience to the table as well because I absolutely respect his opinion on Now I'm talking to you in a video Where 27 seconds in and I haven't said shit about the difference between these I'm talking about a fucking friend and their experience with VX I was actually trying to figure out who this friend might have been I don't remember who it was But That's what you get so far from a well this used to be E.S. Invests So fuck that guy fuck E is invests the E is invests Starting point is you sit in a video for 30 seconds and you have fucking nothing to show for it other than these things are weird I'm messed up but to kind of prep us for that conversation and settle up on a couple you know basic I don't know Simulate some no shortage of um's I think that's what like four Or ohms already 37 seconds in Nailed that we're averaging in um every 10 seconds love that for",
    "start_timestamp_seconds": 1846.36,
    "end_timestamp_seconds": 1942.36,
    "start_timestamp": "30:46",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=1846",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "to kind of prep us for that conversation and settle up on a couple you know basic I don't know Simulate some no shortage of um's I think that's what like four Or ohms already 37 seconds in Nailed that we're averaging in um every 10 seconds love that for me Malarity is in difference between the two I figured this would get places start so first we have the VX 44 seconds in We now start the video That's what this is 44 seconds in we now start the fucking video and then the VX They are different they are similar but they are different let's start Case you didn't know they're different I've I've really felt the need to elaborate that they're different in case the entire different ticker structure didn't allude to the fact that they're different Now you know they're different art with the similarities and then I'll branch into the differences So both of them have options available to trade on them Not gonna lie the rest of it is reasonable I think because from here I effectively just go through this and as usual I'm extremely confident in the knowledge I had at this point even though it's five years ago I've learned a lot over the last five years in insane amount but I still know like the general information that I was sharing was fine But take a look at that delivery now again. I'm not saying that I got it figured",
    "start_timestamp_seconds": 1924.52,
    "end_timestamp_seconds": 2025.0,
    "start_timestamp": "32:04",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=1924",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "point even though it's five years ago I've learned a lot over the last five years in insane amount but I still know like the general information that I was sharing was fine But take a look at that delivery now again. I'm not saying that I got it figured out I just released a video today on Vega It's kind of an off-cycle release because I'm trying to get the the Greek simplified out in case you guys haven't seen it This one this video here is about Vega actually let's I'm literally gonna pull it up really quick So that we could do a side by side and see what this how this one goes let's go up Genuinely curious All right, let's see let's see how this one goes so we're We're just starting outliers today. We're gonna talk about how this can destroy your options trades continuing with the option Greeks simplified series today. We're looking at Vega at the 13 seconds in you know what the video is about you know that there's this quirky little thing that can fuck up your returns In the video you will have an understanding a reminder of what Vega is but more importantly how to practically apply it to your trading and you know what you get at the end of the video Oh my god, it's so bad It's hilarious as you could tell I can laugh at it because I totally understand the context of war",
    "start_timestamp_seconds": 2008.92,
    "end_timestamp_seconds": 2100.92,
    "start_timestamp": "33:28",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=2008",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "Vega is but more importantly how to practically apply it to your trading and you know what you get at the end of the video Oh my god, it's so bad It's hilarious as you could tell I can laugh at it because I totally understand the context of war I was at here and what I was doing so I'm not embarrassed by it at all this is still live on the channel I haven't even taken it down because the information's fine I do have a note to redo this video though after I looked at it because I was like it's about time for an update But not embarrassed by it at all. It's in context I understand it entirely lot has changed and That's really fun for me. I haven't had the opportunity to learn something new in a long time like a genuinely new skill set This is the first Completely foreign skill set that I've learned in a very long time and it's entirely foreign It's social media. It's brand management. It's content creation. It's presentation style. It's everything And I really enjoy not just the process of sharing information but learning a new skill That's why when I look at where we're at so far year to date even though Where you know 15% off of where I wanted to be at the end of the year This is completely fine This is completely fine progress and it's because more than the top",
    "start_timestamp_seconds": 2081.72,
    "end_timestamp_seconds": 2180.6,
    "start_timestamp": "34:41",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=2081",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "skill That's why when I look at where we're at so far year to date even though Where you know 15% off of where I wanted to be at the end of the year This is completely fine This is completely fine progress and it's because more than the top line number here What I care about just like in trading is the process. Am I learning how to do this better? Am I learning how to convey information about something as boring as Vega? Am I able to convey that at least in a marginally reasonable way that people will find useful at the very least? The next evolution realistically is to figure out how to make those things like genuinely interesting to people that's kind of hard and that's a not I haven't really been able to crack that successfully yet and it's because Once you start getting into any of the no-manclature of options you immediately remove 95% of traders have no fucking idea what any of it means that's even more at the surface level of talking about delta That's why when I look at my long-term goal of 100,000 I think that's aggressive as is But there's also a very small number of YouTube channels that hit that and that's Outlier performance. It doesn't matter what I do my mind is geared to try and hit outlier performance. So if I ask how many channels How many YouTube channels hit 100,000 Subscribers And let's see",
    "start_timestamp_seconds": 2157.72,
    "end_timestamp_seconds": 2283.0,
    "start_timestamp": "35:57",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=2157",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "But there's also a very small number of YouTube channels that hit that and that's Outlier performance. It doesn't matter what I do my mind is geared to try and hit outlier performance. So if I ask how many channels How many YouTube channels hit 100,000 Subscribers And let's see as a percentage and we need to As a percentage of Content creation channels because it's not just of all accounts that doesn't matter All right, so it looks like There's a So it looks like there's an average of 34 million YouTube channels and that there's 24,000 with over a hundred thousand So it's about a zero point zero seven percent chance but again Just like this stats in trading I don't really take that as zero point zero seven percent because I know for a fact a good number of YouTubers that start just like a good number of traders that start are gonna wash out immediately Either lazy they're not gonna do the fucking work and I don't identify with that at all I identify with the group that What's the refered in and then they still fail that's the group that I would want to compare myself against and I don't really believe that's in store for me or The account my genuine My genuine expectation is that it will continue to slowly and steadily grow If I share with you and by the way if you have any questions about the YouTube channel literally anything",
    "start_timestamp_seconds": 2253.96,
    "end_timestamp_seconds": 2375.08,
    "start_timestamp": "37:33",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=2253",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "myself against and I don't really believe that's in store for me or The account my genuine My genuine expectation is that it will continue to slowly and steadily grow If I share with you and by the way if you have any questions about the YouTube channel literally anything Ask me if you're curious how much it makes if you're curious about watch hours watch time anything ask me It's all completely on the docket all of it is open source. I am not I don't hide anything about it But if I look at quickly subscribers and I look at specific years so in 2024 I Let's go to let's go back and let's do 2020 and Let's see what I grew in 2020 I Have to start it at may force it's yelling at me so may force 20 The channel grew by 28,000 subs That was funny enough a company by a time a ton of accounts that latched on to small parts of what I did but not like the options trading stuff So that's why that year oh no that's to 2024. I was wondering I was like that seems a little off Let's see in 2020. There we go So in 2020 like it was 4,000 4.4,000 That's how much the channel grew in 2020 in 2021 We grew by 20,000 Very quirky this Cool 2021 Was It this tool is Fucking killing me It just did uh January there we go All",
    "start_timestamp_seconds": 2353.56,
    "end_timestamp_seconds": 2522.04,
    "start_timestamp": "39:13",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=2353",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "see in 2020. There we go So in 2020 like it was 4,000 4.4,000 That's how much the channel grew in 2020 in 2021 We grew by 20,000 Very quirky this Cool 2021 Was It this tool is Fucking killing me It just did uh January there we go All right, I got it now There we go Okay in 2021 was 1.8,000 so Jackitively very very slow in 2022 It was Let's see 3,000 2023 It was So 4,000 1,000 3,000 that one 6,000 Next was 12.6,000 And 2025 so far is 7,000 So a little bit slow compared to last year But I think one of the biggest things that I felt really comfortable with is Who is finding their way into the community? It's the same thing in like the discord what I care more about than anything Without a doubt is the quality of the community and not the quantity All right, let's see Lauren says you taught someone who didn't understand a bit as spread a ton in just over a year The first six months I didn't understand 90% of what was happening Lauren honestly I'm very very glad that you found the community just because not only you're super engaged and I value you being part of it But you are the kind of person that I am trying to reach at this point What you're the people that are trying to learn willing to put in the work in effort but are",
    "start_timestamp_seconds": 2468.12,
    "end_timestamp_seconds": 2657.48,
    "start_timestamp": "41:08",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=2468",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "just because not only you're super engaged and I value you being part of it But you are the kind of person that I am trying to reach at this point What you're the people that are trying to learn willing to put in the work in effort but are susceptible to going down the wrong path and my overall goal is to try to divert people from the wrong path I'm super stoked Trade questions also fair game absolutely any trading questions feel free to throw them out without a doubt Kirk says what is the most profitable single video let's find out I have absolutely no idea Give me second I'll try to figure out honestly don't really know how to fucking find that but I Think I could figure it out okay here we go here we go here we go here we go so these are videos The uh let me go to lifetime the single best performing video Or the most profitable single video is master zero dt options that video Oh grab it really quick in case you guys haven't seen it Is this video and that video has 55,900 views and the revenue for that video is 787 dollars So 55 it's really 56,000 this is 55,911 views So and this one brought in 787 lifetime revenue This video I don't know It was posted in 2023 may of 2023 so it's been about two years That is what that one's been Jordan",
    "start_timestamp_seconds": 2637.72,
    "end_timestamp_seconds": 2762.76,
    "start_timestamp": "43:57",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=2637",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "for that video is 787 dollars So 55 it's really 56,000 this is 55,911 views So and this one brought in 787 lifetime revenue This video I don't know It was posted in 2023 may of 2023 so it's been about two years That is what that one's been Jordan says top three countries that watched the channel the top three countries are probably what you would expect The top three for sure are US Canada and then I don't know the third I'll tell you right now I'll take a guess because I think it's kind of fun Where would I guess I'm between like South America and Europe is a cheat because there's a lot of countries in Europe So I'd have to be specific I would guess Germany I would guess well South America is in a fucking country either It's a continent where in South America Brazil because just norm like larger population And then for Europe I'm guessing Spain or Germany I'm gonna guess Germany Germany All right, let's see let's see what you guys are from Fuck Germany's number five so not that far off So the top geographies top five United States is 58 percent Canada is 7 percent Australia Bit of a curve ball 3.3 percent I guess I should have stuck with English speaking countries that was a bit of a rookie mistake Australia 3.3 percent United Kingdom 3 percent and then Germany 2.2 percent Per capita Germany being there is",
    "start_timestamp_seconds": 2729.08,
    "end_timestamp_seconds": 2850.6,
    "start_timestamp": "45:29",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=2729",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "58 percent Canada is 7 percent Australia Bit of a curve ball 3.3 percent I guess I should have stuck with English speaking countries that was a bit of a rookie mistake Australia 3.3 percent United Kingdom 3 percent and then Germany 2.2 percent Per capita Germany being there is actually quite high Then it's India Japan Singapore Netherlands Spain Sweden Switzerland Italy Polent Island France Norway is real UAE Brazil Brazil was way off Malaysia Belgium Hong Kong New Zealand South Korea Ireland Romania South Africa Austria Denmark Portugal Mexico Greece Taiwan Checcia that's fascinating Turkey Bulgaria Philippine Finland Vietnam Argentina Cyprus Saudi Arabia Columbia Indonesia Hungary Croatia Slovenia Puerto Rico and Pakistan That is the rundown The next is what is the average age average age Doesn't give me average age it gives me a breakdown in terms of buckets And it looks like the average age is something between 35 and 54 both of those are 25 percent of the channel respectively that's for the last 28 days There's 0 percent 13 to 17 and then one and a half percent 18 to 24 25 to 34 is 12.6 percent 55 to 64 is 20.2 percent 65 plus is 15.3 percent It's about what I would expect honestly the 25 to 34 is a little bit light that makes me a little bit sad I would like to penetrate that age group more deeply just because That's the group that really can stand to learn a lot",
    "start_timestamp_seconds": 2825.96,
    "end_timestamp_seconds": 2941.16,
    "start_timestamp": "47:05",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=2825",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "plus is 15.3 percent It's about what I would expect honestly the 25 to 34 is a little bit light that makes me a little bit sad I would like to penetrate that age group more deeply just because That's the group that really can stand to learn a lot here the 18 to 24 that would be ideal But I also am realistic and I know that the majority of like 18 to 24 is not happening So yeah, male the female ratio male the female ratio. Funny. What would you guys guess? What is What's the guess? Or Male the female ratio. What do you guys think? 90 percent males with Jordan says Kirk 90 10 Any others? Lawrence is 5 percent female. Buck in a learn you're exactly correct. It's 5.4 percent female and 94.6 male I Honestly don't know why that is Because I feel like trading is accessible to anybody so I don't know why maybe it's like the channel Just the way that I am and maybe other channels are way more female dance that absolutely could be But I wonder if it's more of a I wonder if it's more of a niche thing Ken says I've heard the ladies turn out to be better traders. I could see that I also think that's one of those things that's like said and I don't know if it's actually true But I could absolutely see that I've worked with quite a few women especially",
    "start_timestamp_seconds": 2925.32,
    "end_timestamp_seconds": 3036.84,
    "start_timestamp": "48:45",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=2925",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "thing Ken says I've heard the ladies turn out to be better traders. I could see that I also think that's one of those things that's like said and I don't know if it's actually true But I could absolutely see that I've worked with quite a few women especially in like the coaching program and They're really good at the like they're super coachable again to Generalize broadly, but they're they're super coachable which is great You can make a lot of progress there and I think that that's a good general trait But I also think One of the common themes I see is a little bit gun shy So that's probably just because they're thinking through stuff a little more pragmatically and Like accepting of risk and thinking of risk. I'm just guessing in broad generalizations I think that that typically would hold up though between like general male disposition versus female But yeah, I could definitely see the the potential for them to be insanely good traders Zubers says found this channel when I saw roaring kiddies meme options 101 I'm actually really really stoked that that's how you found the channel is because when I let me find my first GME video When was that I've been doing GME videos for a while, but let's find the first one here the first one looks like June of 24 So this looks like this looks like the video And this was in June so this is",
    "start_timestamp_seconds": 3021.48,
    "end_timestamp_seconds": 3125.0,
    "start_timestamp": "50:21",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=3021",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "let me find my first GME video When was that I've been doing GME videos for a while, but let's find the first one here the first one looks like June of 24 So this looks like this looks like the video And this was in June so this is talking about roaring roaring kiddies position and It's explaining the difference between Value noional value in terms of how much the options were Ah, this was a big thing I remember because I remember somebody was asking me about the idea of like what what's you gonna do with his positions? What are the choices and a lot of people a lot of people thought that he was gonna exercise and I think the reality is my argument is that he wouldn't have done that and I don't know if I included the math here somewhere I don't see it There he is I don't think I included the the math here but the he would have given up an insane amount of intrinsic value which wouldn't have made sense So yeah, I'm actually really really stoked that you came across the channel in this way Brain says Eric what is that short handed crescent wrench looking plaque thingy hanging on your wall? What I don't I don't see it what thing are you referring to? I think this was brain I don't see the I don't see the thing I See the mammoth tusk that's actually super cool in",
    "start_timestamp_seconds": 3094.04,
    "end_timestamp_seconds": 3227.4,
    "start_timestamp": "51:34",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=3094",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "is that short handed crescent wrench looking plaque thingy hanging on your wall? What I don't I don't see it what thing are you referring to? I think this was brain I don't see the I don't see the thing I See the mammoth tusk that's actually super cool in case you didn't know that's a real mammoth tusk from Russia that's a megalodon tooth this is a piece of a meteor This is a walrus tusk from Alaska That's an arrowhead that I found from New York and then that's a dinosaur tooth the real dinosaur tooth I forgot the name of the dinosaur but that one is also sick and then over here I have a laquis ashi Katana it's like a short katana that was actually sent to me from a viewer I cherish that that is of Old Viking so knife S E A X kind of like their basic knife and then there's like some neclices like Viking neclices that are on that Then this little clear thing Which is hard to see is actually a piece of bar wire from D day. I'll show it to you That thing is really really cool Oh you mean nothing That thing So is a piece of bar wire from Omaha Beach on D day that they put in like these acrylic containers It's like super cool This is a knife that my grandpa made out of a file so if you see the bottom here It's",
    "start_timestamp_seconds": 3193.88,
    "end_timestamp_seconds": 3331.88,
    "start_timestamp": "53:13",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=3193",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "you mean nothing That thing So is a piece of bar wire from Omaha Beach on D day that they put in like these acrylic containers It's like super cool This is a knife that my grandpa made out of a file so if you see the bottom here It's not focusing if you see the bottom here. This is actually the bottom of a file and Yeah, he made this out of a file so obviously I love that And That's a hop light helmet as you might guess That's a saver tooth cat skull from the braia tar pits And then these are plaques that I've gotten those two are plaques that I've gotten from Prior prior gigs that I had I got that one when I was a platoon commander and then I got this one when I was a platoon commander is well And then I have a couple others over there from when I was like an opso and then those two are my like rank Rank paperwork so when you when you get promoted in the Marine Corps you go through like a Commissioning process you have to recommission and renew your command But definitely the coolest thing there is that fucking mammoth test that things like 40 thousand years old From an actual mammoth which is I think absolutely sick Then it's mostly was in the background. Oh, yeah my mother and law painted that she painted that by hand That's of my",
    "start_timestamp_seconds": 3295.56,
    "end_timestamp_seconds": 3411.8,
    "start_timestamp": "54:55",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=3295",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "definitely the coolest thing there is that fucking mammoth test that things like 40 thousand years old From an actual mammoth which is I think absolutely sick Then it's mostly was in the background. Oh, yeah my mother and law painted that she painted that by hand That's of my actual Corvette and it's like it's exactly It's exactly how it looks well how it used to look it has a slightly different paint scheme now similar But different I have a driver stripe oh and One of the coolest details that she captured in here is I have what's called an engage Actually in like this part so like the driver side corner That's where I get all data for the car because it's all tuned and stuff and she literally got like even got that in there Which is cool and then This one is just a painting a really famous painting I remember it from TBS of the Marines at Bello Wood The reason why I like that painting a lot is that it reminds me about like the nature of humans and that of war The reality is humans have like this veneer of civilized behavior We use forks to eat and we talk a certain way But these motherfuckers were fighting and mustard gas Staving each other with bayonets and trying to rip each other's masks off to kill them that I Think carries a lot of weight and it's also a reminder to me",
    "start_timestamp_seconds": 3394.68,
    "end_timestamp_seconds": 3484.84,
    "start_timestamp": "56:34",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=3394",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "We use forks to eat and we talk a certain way But these motherfuckers were fighting and mustard gas Staving each other with bayonets and trying to rip each other's masks off to kill them that I Think carries a lot of weight and it's also a reminder to me of how obnoxiously good I have it and that we stand on the shoulders of giants of people that have done extremely hard things and That is a constant reminder to me that I am unbelievably fortunate that I Never had a fight in fucking mustard gas where dudes are using bayonets to kill each other like that's intense Never had anything like that Goofy says I enjoy watching your channel your smart and have some good perspectives I appreciate that the main thing I try to bring with at least the perspectives is I try to very clearly Delineate what's in opinion of mine versus like just a factual piece of information I think people should be provided data and then I think you guys Should be empowered to come to your own conclusions or to ask your own clarifying questions Sometimes obviously I'll share my opinion if I think it's warranted But more often than not I really try to focus on the objective sharing of data And then either helping you guys learn how to make your own decisions or frame decisions stuff like that so that's I'm stoked on that Glent area and says how are",
    "start_timestamp_seconds": 3467.72,
    "end_timestamp_seconds": 3583.0,
    "start_timestamp": "57:47",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=3467",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "think it's warranted But more often than not I really try to focus on the objective sharing of data And then either helping you guys learn how to make your own decisions or frame decisions stuff like that so that's I'm stoked on that Glent area and says how are your accounts featured marked to market just ignore PDT yet? That's exactly right So I have a bunch of different accounts right so I have retirement accounts. I have different entity accounts and Most of like the more professional trading accounts those are built marked to market They get rid of like wash sale rules and stuff like that and The other accounts are just standard so like the retirement account I have a Roth IRA for that so that kind of thing I still trade it but I trade it within the bounds That you have to treat Roth IRAs with which is not as bad as people think by the way and it's also Not is difficult to put money in there is people think that's another thing I think that's really broadly misunderstood about Roth IRAs You get priced out of being able to directly contribute to them fast So I don't know what the income limit is I'll take you guys right now What are the current single and married income limits to contribute Do a Roth IRA in the US? I think it's only in the you but there's Roth IRAs I think that was",
    "start_timestamp_seconds": 3562.04,
    "end_timestamp_seconds": 3666.68,
    "start_timestamp": "59:22",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=3562",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "them fast So I don't know what the income limit is I'll take you guys right now What are the current single and married income limits to contribute Do a Roth IRA in the US? I think it's only in the you but there's Roth IRAs I think that was An unnecessary dot of point Let's see So single you have to make less than 150k if you're married it's 236 then there's a reduced contribution which is 150 to 165 for single and 236 to 246 for married And then there's no contribution which is 165 or more or 246 or more which That still is absolutely confounding to me because if they're trying to incentivize saving like why is that even penalized in that way it's super annoying but in case you don't know You can still contribute it's just not in a tax Advantage way so what you can do is you can contribute to a traditional IRA not tax not not tax deductible and then you can convert that Traditional into a Roth and As long as you do it quickly enough so that there's no gains then there's no There's no penalty there there's no nothing but That's the easiest way to Still fund a Roth IRA and the reason why funding a Roth IRA is important at least for or like outliers for people like me is Compared to the normal person the normal person They're going to their income should look like this",
    "start_timestamp_seconds": 3636.2,
    "end_timestamp_seconds": 3768.44,
    "start_timestamp": "01:00:36",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=3636",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "nothing but That's the easiest way to Still fund a Roth IRA and the reason why funding a Roth IRA is important at least for or like outliers for people like me is Compared to the normal person the normal person They're going to their income should look like this If you start off you really have no income Let's say that this is like 18 let's say that this is like 40 and then let's say that this is like 60 Most people it looks like this Where you're in like the meat of your earnings potential in here And then at the end for most people they don't have a W2 once they retire So then their income is typically just like social security But for somebody like Me and hopefully other folks the way it works is the way that I've built stuff is my income goes like this And I by the time I'm 60 which is what like 25 years from now 26 years from now My income will be parabolic up from where it is now like parabolic up So a Roth is useful to me because it's tax deferred on withdrawals once you're at 59 and a half plus That's why if you do not think that you're going to be Experiencing higher income later than a traditional IRA is completely reasonable because it's tax deferred up front And then you pay taxes when you take it out but if you're building good",
    "start_timestamp_seconds": 3744.84,
    "end_timestamp_seconds": 3853.0,
    "start_timestamp": "01:02:24",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=3744",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "at 59 and a half plus That's why if you do not think that you're going to be Experiencing higher income later than a traditional IRA is completely reasonable because it's tax deferred up front And then you pay taxes when you take it out but if you're building good robust income sources So that you're not the normal person and the normal person has one income source That one income is typically a W2 if you're enterprising you'll have a W2 you'll have a couple side hustles you'll have trading You'll have real estate Probably hopefully a few of those And maybe you start a side business This is the idea of Really diversifying your income sources and trying to increase your robustness Because what this means is like if this doesn't work that's okay you still have these other things if this doesn't work you still have all these other things And it creates a much more Robust profile for yourself It's not gonna happen immediately. It's unrealistic to expect that kind of thing immediately But it is absolutely something that's attainable Any other Questions that you guys have it can be about the channel it can be about the community can be about the future It can be about trading whatever you guys want And Kirk says do you mega back door your Roth? Yeah, that's exactly right so right now It's still completely fine to do that. It's not illegal. It sounds more nefarious than it",
    "start_timestamp_seconds": 3831.24,
    "end_timestamp_seconds": 3935.72,
    "start_timestamp": "01:03:51",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=3831",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "about the community can be about the future It can be about trading whatever you guys want And Kirk says do you mega back door your Roth? Yeah, that's exactly right so right now It's still completely fine to do that. It's not illegal. It sounds more nefarious than it actually is But you absolutely can continue to fund your Roth in a couple different ways Yeah It's again if you're if you're expecting to have more robust income Then it definitely is worth it In the meantime, I do want to talk a little bit about the future Because I spent a lot of time thinking about the community and trying to figure out like What I think would be good for us where I want to go and I think The most important thing to me is To continue adding value that's very very important to me I find what I do here somebody somebody asked a while ago like Well, it's not asked it's more of accused me somebody accused me of making like tons of money on on YouTube and like the lifetime revenue for the channel is not that much If I look at how much I've made over the lifetime of The channel Against the amount of time that I put in just to build content not even the amount of time to generate the experience In order to build the content I literally am making like $4 an hour if that So There's",
    "start_timestamp_seconds": 3922.76,
    "end_timestamp_seconds": 4031.4,
    "start_timestamp": "01:05:22",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=3922",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "much I've made over the lifetime of The channel Against the amount of time that I put in just to build content not even the amount of time to generate the experience In order to build the content I literally am making like $4 an hour if that So There's a big massive myth that if you have some sort of YouTube channel you immediately have like tons and tons of money Objectively not true. I Spend on a weekly basis. Let's say that I do one video which is like my Sunday video that one video Normally recorded let's say on average is 15 minutes and Let's say to build it is like 60 minutes That the reason for the duration to build it is because I do need to typically create some materials for it And then I try to think of like a talk track for it. So there's 75 minutes Then from a live stream lens We have the Sunday stream which is typically 60 minutes We have the Tuesday stream which is typically 60 minutes Then we have the Wednesday stream which is 60 minutes then we have the Thursday stream Which is 60 minutes Friday which is generally longer More like 90 minutes on average maybe Then we have the Saturday stream which is typically a little more than 60 minutes maybe 70 minutes ish If I add this all up on a weekly basis we're at 475 minutes This is of just content",
    "start_timestamp_seconds": 4007.16,
    "end_timestamp_seconds": 4128.28,
    "start_timestamp": "01:06:47",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=4007",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "Friday which is generally longer More like 90 minutes on average maybe Then we have the Saturday stream which is typically a little more than 60 minutes maybe 70 minutes ish If I add this all up on a weekly basis we're at 475 minutes This is of just content of just content creation which is seven hours well eight hours The amount of time to build the material for these is also not insignificant So for the Sunday video it's typically not a ton of prep maybe like 30 minutes 40 minutes The Tuesday is not a lot of prep maybe same 30 40 minutes The Wednesday video typically more prep Thursday video definitely more prep Friday video Definitely more prep and then the Saturday video less prep The prep for these for all of these especially like the Wednesday Thursday Friday is way more than what it takes to actually do the video The funny thing here is that as I do the math On the total number of videos I have and the total video hours that are produced and the time that it takes to put the videos in and together It's literally like $5 an hour which is I couldn't care less. I really am not doing this for that So that that's the beautiful part about being financially free is that I can spend the time To do something that has an absolutely tremendously negative ROI, but I believe in it The reason for",
    "start_timestamp_seconds": 4096.04,
    "end_timestamp_seconds": 4208.68,
    "start_timestamp": "01:08:16",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=4096",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "hour which is I couldn't care less. I really am not doing this for that So that that's the beautiful part about being financially free is that I can spend the time To do something that has an absolutely tremendously negative ROI, but I believe in it The reason for the patreon is Literally to help subsidize the cost for me doing things So it costs money for me to host a website it costs money for me to hire people Which is a big thing that's one of my big projects for 2026 is I want to hire more headcount for the community and it's not like hiring for the sake of hiring or even Hiring necessarily to grow the channel per se. I do want to grow the channel, but It's actually hiring to just fucking provide jobs and to allow people some sort of part-time side hustle On a topic that they like right now the people that help make YouTube shorts I just kicked those back off there a community member heard somebody that's helping me come up with like background materials FAQs there's a Greeks base Like word game that's gonna be in the newsletter like a community member is doing those and Those kind of tasks are things before that like there is no budget at all to pay any of these people Which I wanted to try to find a way to pay them because like these are younger dudes They're in there",
    "start_timestamp_seconds": 4189.88,
    "end_timestamp_seconds": 4281.24,
    "start_timestamp": "01:09:49",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=4189",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "like a community member is doing those and Those kind of tasks are things before that like there is no budget at all to pay any of these people Which I wanted to try to find a way to pay them because like these are younger dudes They're in there early 20s. I think one of the person that works for me is still in their teens and it's like I want to try to give them some money and to make it make sense so The thing I do with the patreon is reinvest the overwhelming majority of it The other thing that I try to do is price the patreon so that it's reasonable But that the value so far exceeds the cost that I think it's like 5 to 6 times value per cost at least and that's the only way that I can structure something like that and feel good about it Is if I think that the value is like just so Egregiously over what the cost is Because then I can look at it and say like yeah like this absolutely will provide that because even the Pro Tour at 50 bucks a month it's not cheap right like if you think 50 bucks a month that's like a gym membership Or something like that but if you think of it in the context of trading how easy it is to lose 50 bucks And if you learn something In the pro community that",
    "start_timestamp_seconds": 4263.32,
    "end_timestamp_seconds": 4348.12,
    "start_timestamp": "01:11:03",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=4263",
    "chunk_index": 46,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "it's not cheap right like if you think 50 bucks a month that's like a gym membership Or something like that but if you think of it in the context of trading how easy it is to lose 50 bucks And if you learn something In the pro community that keeps you from Losing that 50 bucks that month it's paid for itself and then compounds right like that kind of thing so the the big thing I'm trying to do for the future is I don't know what the goal is going to be for next year I'll have to take a look at the last like three years because it was what like 6,000 then this year was only like 1600 So I think like a fair like a reasonable growth trajectory would be like maybe 7500 so try to get to like 42 five I think will be reasonable Still a stretch still more than I typically grow by but So I want to do that and the other big pillar is actually to continue to develop the community That's the part that I love the most to be honest. I absolutely love the community All right Reggie says do you have a medium to long-term outlook on the market chance of a crash? I look at the market right now and I think if there was in my mind like the potential for a correction or bear market I think it's more now and then longer",
    "start_timestamp_seconds": 4333.8,
    "end_timestamp_seconds": 4417.8,
    "start_timestamp": "01:12:13",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=4333",
    "chunk_index": 47,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "Reggie says do you have a medium to long-term outlook on the market chance of a crash? I look at the market right now and I think if there was in my mind like the potential for a correction or bear market I think it's more now and then longer term on bullish. I don't think the inverse I think that there's a little bit of jitteriness as per usual and in video just reported they reported really really well And we had a good earnings season so S&P companies they're growing their year over year earnings by 13% so they're doing well The economy is doing fine I think this rhetoric about like a crash or a collapse I think it's normal when we're hovering near all-time highs But I think it's just so overused and abused This pullback itself still was in a overall healthy configuration It was a 4% pullback Within the S&P 500 within spy and for those that don't know in spy It spends the overwhelming majority of its time within 5% of all-time highs So getting a sub 5% pullback is fine now a little bit different than that though is I do think the breadth is not good And I think that the way that the market is situated at this moment is still very weak in terms of what's driving returns That's unhealthy and That will need to either normalize or roll over and at least in the short term I do",
    "start_timestamp_seconds": 4402.84,
    "end_timestamp_seconds": 4502.04,
    "start_timestamp": "01:13:22",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=4402",
    "chunk_index": 48,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "the breadth is not good And I think that the way that the market is situated at this moment is still very weak in terms of what's driving returns That's unhealthy and That will need to either normalize or roll over and at least in the short term I do favor more Roll over-ish But we can see futures are up or decent right now as decks up 1.7% E-minis are up one Russell's about flat. I'm getting whacked on my bit composition, but even that's up a little bit There's a lot of stuff that's still doing well Even though when I look at breadth it's not looking good so if I were to summarize that into like a succinct market view for Reggie I would Summerize it as I actually favor near-term weakness and downside potential and then longer-term upside potential And that's just because with AI growing as fast as it is It's gonna continue to generate value at such an insane clip that it will Overwhelm a lot of downside especially if stuff hits More reasonable prices Because right now The S&P like average PE is still like really high What's the average PE ratio or the S&P 500 and I just heard a scratch at the door so Let me let me get the dude That here he is I've been letting him grow out He's so poofy right now it's incredible He's very stoic so he can be very talkative But I think he's",
    "start_timestamp_seconds": 4484.6,
    "end_timestamp_seconds": 4616.28,
    "start_timestamp": "01:14:44",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=4484",
    "chunk_index": 49,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "the S&P 500 and I just heard a scratch at the door so Let me let me get the dude That here he is I've been letting him grow out He's so poofy right now it's incredible He's very stoic so he can be very talkative But I think he's a little nervous when he's in front of you guys He does like to be here. He was celebrating with us Wanna go on your bed There's the homie All right So yeah, that would be the synopsis near-term weakness Long-reterm strength potential but near-term weakness I think at least is it right now Goofy says true YouTube is built on the backs of hopes and dreams so many creators make less than minimum wage definitely And the other thing is a lot of creators completely misunderstand like what it is the The thing is either you have to provide a significant amount of utility or you have to be really entertaining and People favor entertainment if you can be entertaining you can make a ton of money on YouTube especially if You have like some sort of brand deal on top of what you make from your ads You can make a lot of money but again that's the very small percentage those are the top performers that hit that The Return potential from entertainment is very high and it's literally because people like to be entertained In something like options There's not even that many fucking option traders",
    "start_timestamp_seconds": 4576.68,
    "end_timestamp_seconds": 4694.68,
    "start_timestamp": "01:16:16",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=4576",
    "chunk_index": 50,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "can make a lot of money but again that's the very small percentage those are the top performers that hit that The Return potential from entertainment is very high and it's literally because people like to be entertained In something like options There's not even that many fucking option traders in the US actually let's see if there's any metrics on that And for those wondering right now the trailing PE for S&P is like 2829% The forward PE is like 23% it's high like things are definitely high How many options traders retail? Are there in the US Consumer research firm estimates between six and seven million are Trading on marginal or using options so it's likely a few million that's probably the the best guess So there just really isn't a ton Glenary and says thoughts on brokers I use multiple I like how fidelity lets use specs as collateral for sewing puts tasty for more complex trades bit of leverage I Honestly have used Thinkerswem since it was TD Ameritrade so Started with TD Ameritrade now Schwab and I've stayed with them the whole time I think as long as you're using a reputable broker That's ultimately what matters if somebody was like hey could you outline the top two or three brokers? I would Schwab and then probably I be KR those would be the two that I would at least put on people's radar And it's for a lot of different reasons but a lot",
    "start_timestamp_seconds": 4675.48,
    "end_timestamp_seconds": 4789.64,
    "start_timestamp": "01:17:55",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=4675",
    "chunk_index": 51,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "what matters if somebody was like hey could you outline the top two or three brokers? I would Schwab and then probably I be KR those would be the two that I would at least put on people's radar And it's for a lot of different reasons but a lot of it has to do with the capability the platforms in the fill quality It's difficult to assess fill quality but there are reports that come out periodically about brokers fill quality and Places like Robinhood we bowl places like that have awful fill quality and typically places like IVKR and Schwab Prior TD Ameritrade typically a very good fill quality relative so that's where I would go is one of those nuts that's why I'm still Using thinkerswem I'm not an affiliate with them at all. I make absolutely nothing in any capacity I get no benefits from using their platform and using the platform you know on the channel with you guys But they definitely have probably one of the most robust free Trading platforms that exist it's it really is good there's a lot of things as I've used it over the years that are left to be Desired that I would like but those things aside it's insanely capable for what it is so Yeah, that's that's where I would go But that says thoughts on back testing which platform allows you to test earnings driven strategies input of Prezice dates entries exit rules I don't",
    "start_timestamp_seconds": 4772.52,
    "end_timestamp_seconds": 4871.96,
    "start_timestamp": "01:19:32",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=4772",
    "chunk_index": 52,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "be Desired that I would like but those things aside it's insanely capable for what it is so Yeah, that's that's where I would go But that says thoughts on back testing which platform allows you to test earnings driven strategies input of Prezice dates entries exit rules I don't know any platform that does that the the trick with back testing is there really are not They're really are not great platforms for that exist. I looked at building one because I'm so passionate Specifically about back testing and paper trading and it's something that I want to do eventually But I have to drastically increase the revenue that I make in order to even make it remotely worthwhile Because the like to build a tool I have a buddy that would help me so I'd be able to do that cheaply But the data is expensive and then the back end to it and the maintenance of the back end is also expensive Eventually I would like to get there because I think it's extremely valuable But yeah the the way that Most professionals back test is through their own building so building something in Python or are And then using some sort of met lab or other ingest to get data and Literally testing that way. That's the only way I actually know how to do it in a way that I trust what I'm seeing I don't know of any good back testing Website at all",
    "start_timestamp_seconds": 4844.28,
    "end_timestamp_seconds": 4948.28,
    "start_timestamp": "01:20:44",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=4844",
    "chunk_index": 53,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "And then using some sort of met lab or other ingest to get data and Literally testing that way. That's the only way I actually know how to do it in a way that I trust what I'm seeing I don't know of any good back testing Website at all if you guys know when I would love to know Because I would be more than happy to reach out to them and ask if I can you know look through their tools and stuff The other ones that are decent are things like options omega is actually the most decent one I know But it's very specialized and their platform capability is very very very wrapped around Like zero DTE's short term trading strategies and just a handful of underlines So I don't really consider that like a back testing platform. It's really more a tool for almost a very specific strategy suite Very different I use it. I like it. It's it's good to help like quickly fact check stuff But it's super super specialized So I don't actually know of a good one unfortunately That is probably one of the the largest sources of work that That go along with Trading is that side of stuff I'm in the process of trying to build like a end to end organized List of things that a trader needs to be able to do that's detailed and a big part of that Is learning stats in probabilities which is",
    "start_timestamp_seconds": 4930.92,
    "end_timestamp_seconds": 5040.12,
    "start_timestamp": "01:22:10",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=4930",
    "chunk_index": 54,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "go along with Trading is that side of stuff I'm in the process of trying to build like a end to end organized List of things that a trader needs to be able to do that's detailed and a big part of that Is learning stats in probabilities which is pure luck that My background largely overlaps with that I can't say that name says could you open more charts? I think we're I think we're kind of at capacity Maybe I could squeeze a few more on here This is one of my favorite views to like very quickly see how the entire market is behaving So in here we have all of the S&P sectors We have all bonds all of the indices and we have a couple breadth indicators and then typically some sort of commodity So I keep crude in there worth a dollar or Bitcoin like any of those kind of things Yeah, this is like a really good Visual snapshot of How everything is doing and how everything is trending all of these are on six-month daily time frames So you can actually see quite a lot in a fairly compressed space This is where you can identify a lot of fun opportunities of strengthen weakness One of those that have been Following at least the live streams for a while is the relative strength that we've seen in health care compared to the other sectors There's a lot of money to be made",
    "start_timestamp_seconds": 5012.68,
    "end_timestamp_seconds": 5124.2,
    "start_timestamp": "01:23:32",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=5012",
    "chunk_index": 55,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "where you can identify a lot of fun opportunities of strengthen weakness One of those that have been Following at least the live streams for a while is the relative strength that we've seen in health care compared to the other sectors There's a lot of money to be made in health care if you take a look at the move that health care is had over the last How long is this 40 bars so Like two trading months this is like 10% almost in the ETF itself So then if we take a look within this sector You'll actually find that the the breadth is still highly centralized in a few names and these are names that we literally have talked about together Specifically cardinal health e-Li-Lili those have been Absolutely leading the pack over the courts of this move. I had long positions straight up in both of them and it's because the moves that you see here are way more profound starting in October and it's an earnings catalyst So they did really really well and Ely Lili also did really really well these are both simple post earnings announcement drift trades This one has generated 30% return over three trading weeks This is like the easy side of trading and it exists a lot of people don't know To look here or how to find it and that is normal it takes time to build the experience to do this But it is really really",
    "start_timestamp_seconds": 5107.64,
    "end_timestamp_seconds": 5214.04,
    "start_timestamp": "01:25:07",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=5107",
    "chunk_index": 56,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "30% return over three trading weeks This is like the easy side of trading and it exists a lot of people don't know To look here or how to find it and that is normal it takes time to build the experience to do this But it is really really easy once you learn how to look for stuff to find things like this And this is realistically what I spend Most of like the discretionary time for what I'm looking for is fine and stuff like this that are just kind of easy money So it looks like JJ or JIs point all of this starts by typically looking at one of those really crowded looking charts Naden says I always have a hard time getting in good entries because I think if someone went up 30% I'm scared that it would not go up anymore Yeah, that is because there's not a defined profit mechanism If you don't have a defined profit mechanism in what you're doing and you don't have an understanding of what that profit mechanism Typically looks like your sensation that you're describing is very normal But if you go through the effort and You actually define the profit mechanism you learn how it behaves Then you actually develop a really really good intuitive sense of like where stuff is where it may or may not go All of those kind of decisions actually become much much easier to Identify and the other thing that",
    "start_timestamp_seconds": 5195.4,
    "end_timestamp_seconds": 5290.52,
    "start_timestamp": "01:26:35",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=5195",
    "chunk_index": 57,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "actually define the profit mechanism you learn how it behaves Then you actually develop a really really good intuitive sense of like where stuff is where it may or may not go All of those kind of decisions actually become much much easier to Identify and the other thing that becomes really easy is like the risk mitigation side of the equation So for stuff like this it's it's pure it literally is pure asymmetric opportunity let's take a look I'll grab the trade details for Lily and We'll look at it just because we're in here and they reported before the market on the 30th So let's go back to the 30th really fast just so that you can get a sense of What this kind of thing can do And I have a set for 0 830 and then let me find the trade details All right so first things first The entry was after a break out a above this so the entry didn't happen here and It's because the move on the day was weak and there was nothing there that was interesting enough to me The entry for me actually happens when there is a clean decisive break over this which happened in here So I'm finding the specific time where that breaks bingo where that breaks started to meaningfully accelerate here and I had two pieces to this trade I had a midterm ratio called diagonal And then I had a near term long",
    "start_timestamp_seconds": 5274.04,
    "end_timestamp_seconds": 5387.16,
    "start_timestamp": "01:27:54",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=5274",
    "chunk_index": 58,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "clean decisive break over this which happened in here So I'm finding the specific time where that breaks bingo where that breaks started to meaningfully accelerate here and I had two pieces to this trade I had a midterm ratio called diagonal And then I had a near term long call really gamma based play was the purpose of it So what I'm doing right now is I'm scaling it to a hundred thousand dollar portfolio that's what we typically use in these so that you have a sense of what the returns look like with fuck Trying to find some sort of trade logs somewhere There we go I'm going to move this off to the side so that we could take a look the near term play lies well realize we don't kind of needle Madness this is a little too much Oh this one's good This one has what we need So the date for this is 31 oct and there were two positions that I put on first Bob Price was 863 so as we started breaking above that handle and again I have to nail the the trades really quick so the first one was here and it was a 30 delta so these were uh they were like 12.25 is what I thought but this was the 900's 125 Delta was .30 Gamma just because I want you to see how those change date it was negative .523 and then Vega was .738 and",
    "start_timestamp_seconds": 5359.96,
    "end_timestamp_seconds": 5525.32,
    "start_timestamp": "01:29:19",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=5359",
    "chunk_index": 59,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "here and it was a 30 delta so these were uh they were like 12.25 is what I thought but this was the 900's 125 Delta was .30 Gamma just because I want you to see how those change date it was negative .523 and then Vega was .738 and if we look at where the trade is wrong it's essentially at it's a close below 828 so if we take a look and put that with E then I can size it 821 so that's 12 49 a $100,000 account you get a one lot so it's about a percent that's good and then for the base position which was a 90 day diagonal and it was the 850 just because they were a little bit more and that one 850 picked up want to say it was like 6-1-ish .58 is our delta Gamma's .003 data is negative .35 and then Vega is 1.55 okay and let's fast forward and I'll walk you through a couple decision points first let's go like what was it the 31st let's go half a week ish so here there's a key decision point for me this is normally when stuff like this especially smaller names have big moves like this they're very frequently can be a reversal somewhere in this point especially when the moving averages are this spread apart and more importantly than that the reversal can often be like a pretty aggressive gap down now in bigger names like",
    "start_timestamp_seconds": 5487.88,
    "end_timestamp_seconds": 5653.64,
    "start_timestamp": "01:31:27",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=5487",
    "chunk_index": 60,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "this especially smaller names have big moves like this they're very frequently can be a reversal somewhere in this point especially when the moving averages are this spread apart and more importantly than that the reversal can often be like a pretty aggressive gap down now in bigger names like this that's a little less common but still can happen so on 21-0 this position won't have enough room just because it's built for a smaller account right I'm scaling this to $100,000 but I took off the front which was the five-nove spot price was 948 and the premium was 6225 and then the other position no change I let that one alone and then I'll explain why so what this option did was generally speaking what it was supposed to do and what this option was supposed to do was rapidly compound and it's because of the the gamma element to it which I'll explain to you guys in this I'm just getting to rest of the math that up this times then I need a I don't invest in capital relic and that equals by did by value so times this times one as a person so this had a really really aggressive start off and I'll show you what it looks like so far so the position originally was put on at 863 and again scaled for a $100,000 portfolio based on where I would take a loss it was about like a 1.2% risk to",
    "start_timestamp_seconds": 5630.2,
    "end_timestamp_seconds": 5794.76,
    "start_timestamp": "01:33:50",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=5630",
    "chunk_index": 61,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "this had a really really aggressive start off and I'll show you what it looks like so far so the position originally was put on at 863 and again scaled for a $100,000 portfolio based on where I would take a loss it was about like a 1.2% risk to the portfolio it was bought for 1225 and then again like 3,4 trading days later the underlying moved 9.9% and the premium moved actually really significantly and this needs to be fixed because it needs an absolute value for these I have it like I just kind of cobbled this thing together but the premium itself scaled actually a lot oops I'm so value this divide by absolute value of this so the option compounded massively and this this here is the first part of the base position and it's really designed to compound like I said very quickly it's a little bit different when we look at the longer term position now so this one's completely off and then we had the 16 Jan the 9 or the 850s we were slightly in the money so those now are going for like 127 for context and these have compounded but less so notice the change in terms of return on a vested capital the reason for the gap here is because these don't compound as much the underlying the premium itself still appreciated handsomely but it's significantly less than what you saw here and that's because these have less",
    "start_timestamp_seconds": 5772.28,
    "end_timestamp_seconds": 5924.76,
    "start_timestamp": "01:36:12",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=5772",
    "chunk_index": 62,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "but less so notice the change in terms of return on a vested capital the reason for the gap here is because these don't compound as much the underlying the premium itself still appreciated handsomely but it's significantly less than what you saw here and that's because these have less gamma but the purpose for this position is really to give me more time to ride more of the trend with the momentum following approach so I will walk you through that in a sec AJ says with my Patreon question removed no I don't see anything in there what was the what was your question yeah I didn't see anything but let me know and it says been on the fence joining wanted some convincing honestly I'm not the guy for that like I really wouldn't try to convince anybody one way or the other if you have questions about it happy to answer but I really really think it's a decision like somebody should make for themselves and whatever is right for you now but yeah let me know whatever your question wasn't I'll take a look it's just I don't see it on the chat let's take a look at the rest of this move and I'll walk you through a little bit of the decision making which by the way this is actually something I would do on the Patreon typically just because it's kind of like a play by play of the whole thing this",
    "start_timestamp_seconds": 5898.6,
    "end_timestamp_seconds": 5995.88,
    "start_timestamp": "01:38:18",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=5898",
    "chunk_index": 63,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "a look at the rest of this move and I'll walk you through a little bit of the decision making which by the way this is actually something I would do on the Patreon typically just because it's kind of like a play by play of the whole thing this here actually doesn't denote in exit yet the reason why it doesn't denote in exit yet for this specific strategy is it hasn't gotten anywhere near the short-term moving average that I'm using to follow the broader trend but I do want you to notice how it behaved on this reversal day it's important to note how it behaved on this reversal day and this is because you can give up several days of gains on these reversal days right so take a look at open here rallied all the way up here close here gapped up again open here rallied up here close here and then on this reversal day it's just done done the last two days by itself and this is only a few hours into the trading day these reversal days especially in stuff like this can be kind of nasty so you have to have a game plan in place but that one wasn't in exit criteria for me and it's literally because of this factor it didn't actually violate any of my like trend following rules so if we go to the end of the week you'll see now it's a different it's a",
    "start_timestamp_seconds": 5981.24,
    "end_timestamp_seconds": 6068.76,
    "start_timestamp": "01:39:41",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=5981",
    "chunk_index": 64,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "a game plan in place but that one wasn't in exit criteria for me and it's literally because of this factor it didn't actually violate any of my like trend following rules so if we go to the end of the week you'll see now it's a different it's a different perspective it's a different perspective because at this point it's starting to consolidate a little bit still too early to take an exit in my world this would be viable for some sort of partial exit but when something consolidates like this I typically don't expect to see some sort of massive gap drop down like I would this being able to turn into so if we go to the last day that's available at least in here and show you the spot price it's still continuing to trend sideways this is where I would scale out part of the position again these are one launch because it's scaled to a hundred thousand dollar account but I'll give you a sense of what those are running for now just so that you can get an idea of what they're trading at which is like 195 and now the underlying is at 1029 so on a trade that we that's not correct you should be this so on a trade that we put up a total of like 7325 that again this is scaled to a hundred thousand dollar account even though it's 7325 in terms of the overall debit",
    "start_timestamp_seconds": 6052.12,
    "end_timestamp_seconds": 6150.92,
    "start_timestamp": "01:40:52",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=6052",
    "chunk_index": 65,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "is at 1029 so on a trade that we that's not correct you should be this so on a trade that we put up a total of like 7325 that again this is scaled to a hundred thousand dollar account even though it's 7325 in terms of the overall debit there that's not how much would actually be at risk in the trade and then here is where it's sitting at right now which would give us a total p and l of 18,400 so it's a little over doubling your money at least in terms of the allocation it's easier to do that with kind of these allocations because it's not all of your money a lot of times when people see returns like this they think like oh man like if I do that with my whole account then I'll be you know making a bunch of money really quick and it will be great the problem is like maximizing a position like this with your entire account is really really fucking hard and the reason why it's super super hard is because then there's a lot of emotion that goes into it you're like damn I really want this to work and so on and so forth so these are again it's just one example of an individual trade it's actually just a very simple poster and announcement drift that's actually still on and it's because we had three consolidating days definitely good strength but I didn't",
    "start_timestamp_seconds": 6124.84,
    "end_timestamp_seconds": 6229.32,
    "start_timestamp": "01:42:04",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=6124",
    "chunk_index": 66,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "want this to work and so on and so forth so these are again it's just one example of an individual trade it's actually just a very simple poster and announcement drift that's actually still on and it's because we had three consolidating days definitely good strength but I didn't like that they were slightly descending and that's okay take some profit I took two thirds and now there's a third left on that leg now I see and we take a look at how it eventually resolves but that's just Eli Lilly and the thing that I want you to pay attention to is let's scale this really quick from $100,000 to a million dollar account the reason why I want to show you this scale is because the percentages are one thing but the gross is different this is the gross for an appropriately scaled version of this position in a million dollar account this is $184,000 that matters because even though the percent returns are good and stuff like that the more important part here is like this is real money right like that's a okay salary for people this is when you can actually begin to live a decent life off of stuff like this now again this is just one trade there's plenty of versions of this where it's a loser instead of a winner and if you remember this was risking about two grants a little more than two grand between these two positions",
    "start_timestamp_seconds": 6208.76,
    "end_timestamp_seconds": 6312.28,
    "start_timestamp": "01:43:28",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=6208",
    "chunk_index": 67,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "live a decent life off of stuff like this now again this is just one trade there's plenty of versions of this where it's a loser instead of a winner and if you remember this was risking about two grants a little more than two grand between these two positions so in the context here you're risking like 20 grand but in the million dollar account scaled the 20 grand here is granting you the potential in this case so far for 184 which it's still not quite done yet so this is when it was marked at 1029 so the way that this would actually work is like this two thirds come out ish and then the remainder is here and let's just take a look at what it's worth today that same same option as it sits now the eight fifty those are now two who's 13 so the position is total at 195 something like that so that's an example of using this really busy chart grid to find where strength is as far as a sector and then stacking strength finding more strength within that sector and then finding a couple things to play straights and make some money AJ was just wanted to see an intro and an example to get a sense of what they get oh yeah if you're curious about that you should also just go to the patreon because on the membership page for the patreon there's a pretty in-depth description",
    "start_timestamp_seconds": 6300.44,
    "end_timestamp_seconds": 6416.28,
    "start_timestamp": "01:45:00",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=6300",
    "chunk_index": 68,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "make some money AJ was just wanted to see an intro and an example to get a sense of what they get oh yeah if you're curious about that you should also just go to the patreon because on the membership page for the patreon there's a pretty in-depth description about like what you actually get I don't even think I can paste it in here because it's there's a lot I can paste the link to the membership page and if you go to like pro which is like the the base tier for folks the description literally lists out like everything so you'll see like what the three different weekly streams are what the community opportunities are stuff like that and then it'll all be in there for you that's a completely fair question right like I would want to know what I'm getting if I'm buying something to for sure all right gang it is time for me to grab dinner I want to extend another very gracious thank you all for being a part of what this thing is it's really really fun in general I know it's me sharing like a lifetime of experience so the the value proposition is skewed from that lens but I really enjoy interacting with you all I love the people that we kind of bring into the community what kind of folks this thing attracts and I'm super super stoked to continue growing with you all and like getting",
    "start_timestamp_seconds": 6398.68,
    "end_timestamp_seconds": 6487.16,
    "start_timestamp": "01:46:38",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=6398",
    "chunk_index": 69,
    "word_count": 250,
    "upload_date": null,
    "duration": 6520.0
  },
  {
    "video_id": "0iZJfIu3Nac",
    "title": "35K Subscriber Celebration Q&A Stream!",
    "text": "the the value proposition is skewed from that lens but I really enjoy interacting with you all I love the people that we kind of bring into the community what kind of folks this thing attracts and I'm super super stoked to continue growing with you all and like getting to know you all better I literally have people now in the community that I like no should have known for five fucking years it's like not a trivial amount of time to know somebody so that's the other really cool thing is like actually building relationships which I enjoy so here's to 35 for next year we're gunning for 42 five we'll see how well I deliver be in outlier do you guys better",
    "start_timestamp_seconds": 6461.72,
    "end_timestamp_seconds": 6512.04,
    "start_timestamp": "01:47:41",
    "video_url": "https://www.youtube.com/watch?v=0iZJfIu3Nac",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=0iZJfIu3Nac&t=6461",
    "chunk_index": 70,
    "word_count": 125,
    "upload_date": null,
    "duration": 6520.0
  }
]