[
  {
    "text": "All of us traders are degenerates at heart. However, the goal of this video is to help some of my game stop people think about buying call options or really any option a little bit differently so that rather than putting on positions that magically vanish in a couple of days and all your money is gone, we might actually stand a chance at making some money out here because what we don't want is to be in the scenario of our friend antique marketing who's down 99.68 with 32 left to go. Super unfortunate, but who knows they have some Apple options expiring this week their pay off might be there. My guess is they're probably making a bunch of the mistakes I'm about to walk through with you guys. We're going to talk about kind of looking at options a little bit differently through the lens of these three things. These expiration how long the contract lasts the delta of the option delta simply measures the rate of change of an options premium for every one dollar move in the underlying and then gamma which is simply the rate of change of delta. So I am not going to get super theoretical here. My goal is to keep this as practical as possible. So with that let's get straight over into the platform and we're going to grab GameStop and dig right in. Okay. So the first thing to know is you notice the first thing on our",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  },
  {
    "text": "to get super theoretical here. My goal is to keep this as practical as possible. So with that let's get straight over into the platform and we're going to grab GameStop and dig right in. Okay. So the first thing to know is you notice the first thing on our list is picking DTE days to expiration what expiration makes the most sense here's the way to think about it the further out in time you go the more expensive extrinsic value gets for options also the slower gamma will move which matters specifically for out of the money options and I'll explain how. So that's the first thing the further out in time you go the more expensive the options get because there's more extrinsic value gamma has a dampened effect. What's the benefit your trade now has a longer time to work although your theta decay will be higher in a gross dollar amount your daily theta decay as a percent of the resulting premium will be less. So let's take a look at exactly what that means. If we go out here to 120 days to expiration and we look at really anything let's find this 60 delta call right now in GameStop. So we can see this is gamma this is theta and I'm specifically focusing on the call options because I imagine that's probably what most of you guys are playing but the same stuff generally applies to the put options as well. So if",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  },
  {
    "text": "delta call right now in GameStop. So we can see this is gamma this is theta and I'm specifically focusing on the call options because I imagine that's probably what most of you guys are playing but the same stuff generally applies to the put options as well. So if we look at these 60 delta calls right now they have a 0.02 gamma so that means for every one point move in the underlying delta is going to move by 0.02 everything else remaining the same good old latin saying center is parabess now theta notice what theta is negative 0.03 this means as each day that passes these options are going to lose a recent again everything else remaining the same. A couple notes that are really important here options that are out of the money are all extrinsic value extrinsic value kind of is two components first component is how much time the second component is volatility how much volatility are we pricing in those options. So as you go further out in time the more extrinsic value you will have as you go deeper in the money your options will have more in transit value and less x transit value it will be a higher delta. So what does all this mean the very first juncture we need to cross is what expiration to pick for me I typically try to go at least greater than 60 days to expiration the reason for that is option",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  },
  {
    "text": "less x transit value it will be a higher delta. So what does all this mean the very first juncture we need to cross is what expiration to pick for me I typically try to go at least greater than 60 days to expiration the reason for that is option theta decay starts to really accelerate once we go within 60 days so let's take a look at what this looks like again 60 delta these have a 0.03 theta let's now go into 29 find a 60 delta this is a 62 that's pretty close theta now is negative 0.07 what do you notice the daily theta decay just skyrocketed going from 120 which was three cents into 29 days expiration it's double in change seven cents massive way higher and also what's most important is if you think about your theta decay the seven cents on a percentage of the premium these are trading for 460 465 something like that they're losing seven cents every single day that's a much larger percentage of the total premium that's eroding on a daily basis if we go again out here to the 120's not only is the theta much lower for the 60's it's again three three cents but look at the price of the options they're much more expensive so as a percentage you're also losing way less of your total premium so that's the expiration decision to me in general it's kind of just easy if you go",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  },
  {
    "text": "for the 60's it's again three three cents but look at the price of the options they're much more expensive so as a percentage you're also losing way less of your total premium so that's the expiration decision to me in general it's kind of just easy if you go at the very least the very least greater than 30 days out ideally 60 plus for me most of my trades are 90 plus but again I trade these a little bit differently than most people so it might not be a direct corollary I'm just giving you some ballpark to go off of because we need to now talk about gamma when we're buying options a lot of times people will be lured into these really cheap really far out of the money options like these 21 June's that expire in one day and the 125's where there's 113,000 open interest that's not saying all those people enter today they didn't but a lot of people entered these these are very far out of the money so the reason why we care about gamma is because gamma tells us how fast we're going to see profit if we start getting a big move in our favor because if you remember delta tells us the rate of change of an options premium so in this case if game stop moves one dollar in our favor this literally is going to move less than a penny there's the delta is so",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  },
  {
    "text": "getting a big move in our favor because if you remember delta tells us the rate of change of an options premium so in this case if game stop moves one dollar in our favor this literally is going to move less than a penny there's the delta is so low in these options that it's going to be a third digit you're not even going to see it the other the other problem here is that as you get that first dollar move in your favor gamma doesn't even start turning on and what does that mean well if we take a look here something at like a 15 delta notice what the gamma is 0.06 so that means that if you get a one dollar move in your these options are going to give you 15 cents or 15 dollars because the multiplier for options is 100 so you get 15 bucks but something else happened along that this 15 delta just gain six more delta so now if you get another dollar move in your favor instead of just seeing 15 cents you now see 21 cents and what do you notice options that are closer to at the money have much higher gamma the other thing you'll notice is options that are closer in time have a much higher gamma so this is 1 DTE the at the money here is a 16 gamma we go all the way out here to the 120's we go",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  },
  {
    "text": "at the money have much higher gamma the other thing you'll notice is options that are closer in time have a much higher gamma so this is 1 DTE the at the money here is a 16 gamma we go all the way out here to the 120's we go to the at the money the gamma is 0.02 why is that simple options have to make a choice as we get closer to expiration it's either going to be in the money and have a delta of 1 or it's going to be out of the money and have a delta of 0 gamma tells us the rate of change of delta so that's why it gets so jacked up as we get closer to expiration all of these options are in the process of making a big choice either in the money delta of 1 out of the money delta of 0 that's also why gamma is highest for at the money options because they're going to swing a ton this is going to go from a 46 delta either to a 1 delta or to a 0 delta that means it needs to be able to change a lot that's what gamma is measuring if you go to the super far out of the money options they're not going to change much at all because there are a 0 delta they're probably going to be a 0 delta meaning they're going to expire worthless that's what this",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  },
  {
    "text": "a lot that's what gamma is measuring if you go to the super far out of the money options they're not going to change much at all because there are a 0 delta they're probably going to be a 0 delta meaning they're going to expire worthless that's what this is so taking this back to what we care about delta is the next big selection and I just gave you kind of a preamble on the way to think about delta to a degree delta makes our options more expensive the higher the delta is but you get a better dollar for dollar move with the underlying what that means is in this case if game stop goes up a dollar in these 25s for example you would have paid a dollar or six something like that so you pay your dollar here you get a dollar move in the underlying you get to see 54 cents of profit added to these your premiums going to move by 54 cents whereas if you go super far out of the money you get that same one dollar move you're only going to see a nickel as compared to 54 cents what's the trade off here good question as your delta's are higher the options are more expensive notice this one you have to buy for a dollar this one you can buy for 11 cents now you might be thinking well what if I just buy a dollar's worth of",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  },
  {
    "text": "what's the trade off here good question as your delta's are higher the options are more expensive notice this one you have to buy for a dollar this one you can buy for 11 cents now you might be thinking well what if I just buy a dollar's worth of these it's a great question however unfortunately it doesn't work out that well let's take a look at an example so these are a 64 delta expiring in 28 June these are a 49 delta expiring 28 June sorry let's take a look at creating the same size trade these are trading for 53 cents so to get them closer to that three dollar mark we'll do six of them so now they're about the same let's take a look at some scenarios if we look at the 60 delta's the 24 calls that we paid three dollars for and let's say we get a plus two standard deviation move you're going to make 326 bucks if we compare that to the six of the 49's and we get that same move you're going to get 335 bucks so what do you notice right out of the gate at the same size you put on the same size position overall these make just a little bit more on a two standard deviation move which the vast majority of the time you're not going to see that that's a low probability move remember standard bell curve 68.7 of data falls within",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  },
  {
    "text": "same size you put on the same size position overall these make just a little bit more on a two standard deviation move which the vast majority of the time you're not going to see that that's a low probability move remember standard bell curve 68.7 of data falls within one standard deviation 95 of data within two so that's both sides by the way so it's essentially a two and a half percent chance of getting that move in your favor give or take so it's just important to know that even if you think about putting the same size total cost position on in a much lower delta option you still need a really big move in order to even catch up to getting a higher delta option right out of the gate so what does this mean well we know then that if we go further out of the money our options are going to move less due to both delta and gamma if they're further in the money your gamma will slow down because you're already near one delta and once you're at a one delta you get a one dollar move for every one dollar move in the underlying it's essentially just leveraged stock so you have to figure out the correct balance for you and I'll tell you what I typically look for when I'm going out again at least at least 30 days preferably 60 plus maybe these 57s are fine something like",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  },
  {
    "text": "move in the underlying it's essentially just leveraged stock so you have to figure out the correct balance for you and I'll tell you what I typically look for when I'm going out again at least at least 30 days preferably 60 plus maybe these 57s are fine something like that I will look starting at the money the downside they're more expensive they're more expensive by going further out in time they're more expensive because they're a higher delta so I will structure a position that has a base position using these kinds of options that are at least 60 delta plus and have a little bit of time to work even if I'm not expecting to hold them for 57 days I'm typically not I just don't want to pay that much in daily faded decay by coming in super close in time and having the majority of my position decay away so if we go all the way out here again to these 120s I'm losing three cents a day by going slightly in the money here I'm going to pay more upfront for that but I'm not expecting to lose all of it I'm actually expecting to recapture most of it so that's the way I think about it I'm going to go again a little further out in time slightly higher delta now the last thing to add is you can add what I call kicker options to amplify the position so what that could",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  },
  {
    "text": "to recapture most of it so that's the way I think about it I'm going to go again a little further out in time slightly higher delta now the last thing to add is you can add what I call kicker options to amplify the position so what that could look like is let's say in this scenario I pick that further out in time option that's deeper in the money this is the base position and I say okay well I'm really bullish for some reason I think the stock I'm looking at is going to fly off the handle so let me add some closer in time further out of the money options that have the ability to appreciate a lot this is why gamma is so important because by going closer in time let's say two weeks out I can find things that have really high gamma on a relative basis so that means if I start getting in a accommodating move in my favor the position can start to compound massively because when we compare low delta to high delta's high delta trades they don't have the same percent returns meaning they don't compound as much but you can make more money on a gross dollar amount than the further out of the money options so again we're at another tradeoff so to summarize all of that these are the three things you have to keep in mind when you're buying options delta how far out",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  },
  {
    "text": "but you can make more money on a gross dollar amount than the further out of the money options so again we're at another tradeoff so to summarize all of that these are the three things you have to keep in mind when you're buying options delta how far out in time are you willing to go how much time do you want the trade to have the more time you give it the more expensive it becomes delta the higher the delta the better dollar for dollar move you're going to get the more expensive the options are going to be the slower your theta decay is going to be the less your money will compound gamma the closer in time you are and the closer to the money the higher your gamma is going to be you want to have some exposure to gamma but if you're super close in time and you're out of the money you are fighting so much theta decay as a percentage of your position that it's going to erode away to nothing and to drive that final point home if we look at this one not even this one let's look at the ATTE and we look at something like this the 37s these are these are still at 20 delta almost 17 delta like pretty high but if you look at the theta it's 14 cents these options cost 70 cents something like that so of that 70 cent position you",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  },
  {
    "text": "the ATTE and we look at something like this the 37s these are these are still at 20 delta almost 17 delta like pretty high but if you look at the theta it's 14 cents these options cost 70 cents something like that so of that 70 cent position you put on you're losing 14 cents every single day that you don't get a move in your favor until they essentially run out of money until they decay into nothing so you have to be really cognizant of theta decay you can decrease that by going further out in time by gaining a little bit more delta it's a little more expensive up front but something worth trying if you have any questions let me know be an outlier see you guys later",
    "metadata": {
      "video_id": "0kXY1hY--Ww",
      "title": "How to Buy Call Options Smarter: Step by Step",
      "url": "https://www.youtube.com/watch?v=0kXY1hY--Ww",
      "upload_date": "",
      "duration": 961.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0kXY1hY--Ww&t=0"
    }
  }
]