[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you history what what do you what do you what do you what do you Uh we Why do I break these apart? The very important reason why I break these apart, why I would consider the system or strategy, whether it's good or bad, different than whether it's a good or bad trade. Also, in case you guys didn't know, one of my buddies who's in the real estate business, he's out here in San Diego visiting some of his friends. He actually invited me out. He rented a yacht for his community to go float around in the bay. And I told him, I was like, I can't bail on my people because I found out kind of late and I don't like dropping last second. So I thought you guys would like to know that the 23 of you that are here genuinely are more important at this point in time than going to that, not bailing on you guys. But Lauren says, I'm actually good at getting into a decent trade but have trouble with the dismount every time. Yeah, Lauren, I actually think we have, let's see, I'm actually curious. Let's see. So far. Another high today. Ain't that some shit, huh? So yeah, Lauren speaking of completely messing up the dismount, I couldn't agree with you more on that. Man, just running away and",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 62,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=0"
    }
  },
  {
    "text": "dismount every time. Yeah, Lauren, I actually think we have, let's see, I'm actually curious. Let's see. So far. Another high today. Ain't that some shit, huh? So yeah, Lauren speaking of completely messing up the dismount, I couldn't agree with you more on that. Man, just running away and even on a down day still hit highs and it's still closed higher on the red day than it did on the day before. This is after it gapped up previously. So yeah, yeah, same page with you there, Lauren, we are completely in a grince. Joey says for me, it would be the entry and exits were with intolerance would be part of the system. I would assume our good or bad trade is more of the thesis was correct or not. It's actually not. That's actually another great point, Joey. But I have a hold on. This was wedged underneath my chair. So I gave Thor an elk antler that's actually quartered. So it still has some bone marrow in it. And he has been cracked out all afternoon, I think getting into his like inner predator. So now this has been getting whipped around. And now he's laying in his bed staring at me wondering what I'm going to do with his elephant, which I'm just going to hand it to him for now. Not looking to start any shit with Thor at the moment. He's literally cracked out. Zachary says in, in do just jump dumped",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 62,
      "start_timestamp": "00:09:56",
      "start_timestamp_seconds": 596.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=596"
    }
  },
  {
    "text": "laying in his bed staring at me wondering what I'm going to do with his elephant, which I'm just going to hand it to him for now. Not looking to start any shit with Thor at the moment. He's literally cracked out. Zachary says in, in do just jump dumped me lots of casts Israel just bombed Iran. Well, we'll take a look at that. But anyways, for Joey's specific comment on good or bad trade if the thesis was correct or not, that's actually not it. So let's use an example to start here. So first, let's differentiate between these. This focuses on application of system. That's what a good trade is. A good strategy or system positively expectant return within risk tolerance. That's a good system. So notice how when we look at the idea of trade versus system or strategy, trade is built on the individual occurrence of something. A trade is an event of one. A system is an event, hopefully, of very many, being something that we apply over a time frame. So trade individual occurrence strategy, multiple occurrence. Good trade is the application of a good strategy. A good strategy is something that's positively expectant that falls within your risk tolerance. So those feed into one another. Because another thing that a lot of people actually sometimes would say to something like that is a good trade follows is where you follow the rules. Maybe. I don't follow my rules all the time. I",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 62,
      "start_timestamp": "00:11:30",
      "start_timestamp_seconds": 690.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=690"
    }
  },
  {
    "text": "expectant that falls within your risk tolerance. So those feed into one another. Because another thing that a lot of people actually sometimes would say to something like that is a good trade follows is where you follow the rules. Maybe. I don't follow my rules all the time. I break them sometimes. A lot of times when I break them, it's actually for a very specific reason because there's some sort of circumstance. A lot of times it's actually better for me. That's the case for me. Most traders have not built a healthy enough relationship with rules. And a lot of times new traders will break the rules just because they don't like how something's going. They're uncomfortable. Those are terrible reasons to break a rule. But when we think about individual trades, one of the worst possible thing that you can do, whether it's a good or bad trade is overemphasize the outcome of that individual trade. That's bad. And tell you what's bad, as long as you're managing risk effectively, if you do not overemphasize the outcome of the individual trade, you're off to the right start. Okay, so we should now have an idea of what a good and bad trade are or what a good and a bad system or strategy is. Good bad trade. Again, not based on the outcome. It's based on the application of something. That Lauren says, what do you mean by overemphasize? That's a great question. So what I",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 62,
      "start_timestamp": "00:13:25",
      "start_timestamp_seconds": 805.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=805"
    }
  },
  {
    "text": "what a good and bad trade are or what a good and a bad system or strategy is. Good bad trade. Again, not based on the outcome. It's based on the application of something. That Lauren says, what do you mean by overemphasize? That's a great question. So what I mean by that is let's say I am trading actually this beautiful segue. But Lauren, I don't know if you meant to do this, but you served as literally the perfect segue into a practical example, not in so far. That's more just for you to look at and cry. What was the trade? I have to grab the ticker I forgot. Give me one sec. I want to look at CORZ. CORZ. So this is a trade that I took down today for a loss and I had entered this trade on the breakout was it yesterday that day before. I entered here on this breakout. So it's actually a better entry than I thought I'm not even going to lie. So I ended up entering here on a breakout following a specific strategy of mine. And then we had a little bit of a week rally the next day. I don't love that. And then we had a weaker move the following day and then we had a bit of a red day today closed it today and actually took it down for a loss. What happened here? This is still a good trade. This is still a",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 62,
      "start_timestamp": "00:14:46",
      "start_timestamp_seconds": 886.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=886"
    }
  },
  {
    "text": "day. I don't love that. And then we had a weaker move the following day and then we had a bit of a red day today closed it today and actually took it down for a loss. What happened here? This is still a good trade. This is still a good trade based on what I was doing. I was taking on really good risk reward relationships on something that followed a proven system that I've built and maintained over years now. Now there's a scenario that can happen where this didn't hit my risk control point technically speaking. The soft stop was actually down here at 1262 to start. It didn't get near the soft stop. So I still had plenty of room here in terms of where this thing may or may not have gone. However, normally with the strategy within this timeframe, the breakout would be realized, meaning that there would be continuation and a good alternate example of this is a P P. We've looked at this trade a bunch of times now because guess what? I'm still in this trade blow in my mind. But now we had another leg up here after another smaller leg up here after this March leg up here after this leg up over here. Okay. All of that aside, when I entered a P P here, significant breakout, continuation, rolling all the way up. Even when it starts to consolidate, it's hanging on the 10 day moving average. And",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 62,
      "start_timestamp": "00:16:16",
      "start_timestamp_seconds": 976.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=976"
    }
  },
  {
    "text": "leg up here after this March leg up here after this leg up over here. Okay. All of that aside, when I entered a P P here, significant breakout, continuation, rolling all the way up. Even when it starts to consolidate, it's hanging on the 10 day moving average. And the next breakout, significant breakout that then it's semi confirmed. It's rolling sideways, right? But if I look at pores, it's different because on this breakout, it wasn't unilateral and volume. So I already knew that this was a little more speculative in nature. It had a shorter consolidation period, which I prefer to see a longer consolidation period. Then it had these two days that were supposedly meaning they're green. Well, this one updates, but it didn't go anywhere. So long story short, this was still within my risk parameters and I took it down. The reason why I did it is because it wasn't behaving correctly against the profit mechanism and sub mechanism that I was looking to capture. If I was overemphasizing an individual trade, there's a million things I can do to this trade to fix it or to make it better for the circumstance. And that's gone on a truth. There's I could have made this trade profitable. I'm literally 100 certain of it, but it's not about whether or not I make an individual trade profitable. It's about what happens with the system over the long run. So when we overemphasize individual trades, we",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 62,
      "start_timestamp": "00:17:36",
      "start_timestamp_seconds": 1056.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=1056"
    }
  },
  {
    "text": "that's gone on a truth. There's I could have made this trade profitable. I'm literally 100 certain of it, but it's not about whether or not I make an individual trade profitable. It's about what happens with the system over the long run. So when we overemphasize individual trades, we forget that even if we can make this one individual circumstance better, how does that lend when we go into the next 100, 200, 500, 1000, 1000 plus iterations of this same fucking thing? You set yourself up literally for failure, literally for failure. So that's the idea of overemphasizing an individual trade. This trade fits in with a broader approach and it needs to be managed as that. We have to devalue the outcome of individual trades provided that we're trading a profitable system. One of the primary reasons why traders will really struggle to devalue the outcome of an individual trade is because each time that it happens, it feels like you're catching a bird out of the air and you're so happy to have gotten that bird out of the air and you're not sure if you're going to get another one. But if you're a profitable trader, I know there's other birds. I know I'm going to grab those motherfuckers out of the air. I know they're going to be there. So I'm less concerned about doing what I can try to do with this one individual trade to make it a positive outcome for me",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 62,
      "start_timestamp": "00:19:07",
      "start_timestamp_seconds": 1147.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=1147"
    }
  },
  {
    "text": "trader, I know there's other birds. I know I'm going to grab those motherfuckers out of the air. I know they're going to be there. So I'm less concerned about doing what I can try to do with this one individual trade to make it a positive outcome for me because it doesn't matter. It doesn't matter in the broad context if I'm trading a profitable strategy. So Lauren, let me know if that answers your question with respect to the concept of not overemphasizing the outcome of an individual trade. It's something we all do. It's literally natural. It's very, very difficult to like fully put out of your mind and put away. Very difficult, but it happens over time and it happens when you have a system that you're very happy with. Again, for example, the loss that I took in course today was a few thousand dollars. And I've already told you guys, we talked about this trade a while ago. This trade, when we talked about it over here, it was a six figure trade and then some. So I don't care. I don't care that course lost me a few thousand dollars. Literally doesn't matter because as long as I find my way into a handful of these, they will more than cover the cost of the course trade. And the funny thing is is that if I look through my trade log, it's funny enough, the topic for today. When I look at through",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 62,
      "start_timestamp": "00:20:33",
      "start_timestamp_seconds": 1233.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=1233"
    }
  },
  {
    "text": "because as long as I find my way into a handful of these, they will more than cover the cost of the course trade. And the funny thing is is that if I look through my trade log, it's funny enough, the topic for today. When I look at through my trade log for breakout trades, I tend to take the losing trades down very fast, very, very fast, which is actually pretty interesting to me. The reason why that's pretty interesting to me is because it tells me that I have no problem, absolutely no problem, trying to take down and get rid of positions that are not working in line with the portfolio. I don't even have to wait until I get to stops. Cores is a good example of not waiting until I got to a stop. I didn't even get to my soft stop before I got out of it. So that's an example where I broke the rule of the trade. Now, the fun part about this, and this is the other thing that is so simple, but it blows people's mind. Why do you think I have an alert set right here? This is one of those things that is so simple, but yet it is so overlooked. It's fascinating to me. Absolutely fascinating to me. Well, I'm not in it. I got out. I'm out for a loss. No, no, it's not that. There you go, Joey, get back in. So traders have",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 62,
      "start_timestamp": "00:21:54",
      "start_timestamp_seconds": 1314.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=1314"
    }
  },
  {
    "text": "one of those things that is so simple, but yet it is so overlooked. It's fascinating to me. Absolutely fascinating to me. Well, I'm not in it. I got out. I'm out for a loss. No, no, it's not that. There you go, Joey, get back in. So traders have this really weird thing where it feels like if you get out of a trade, if you get out of a ticker, then you're just out of the ticker, right? And then you can't go back in because you can't change your mind. You can't look at new information that disagrees with the original idea and then revert back to the original idea of things start panning out again. You can't do that because then you look stupid or because it doesn't make sense to do something undo it and then do it again. Well, guess what? In trading, the things that don't make sense tend to make perfect fucking sense. This is one of those things. It is completely cool to get out of something because it's not behaving right and you would better believe if this continues to behave as I think it might. And I see a breakout here again, depending on the quality of the breakout, how it behaves, but it looks like all those details, I'll get right back in. I will get right back into the thing that just lost me money. It's okay. So the idea is to be a thinking trader that",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 62,
      "start_timestamp": "00:23:10",
      "start_timestamp_seconds": 1390.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=1390"
    }
  },
  {
    "text": "breakout here again, depending on the quality of the breakout, how it behaves, but it looks like all those details, I'll get right back in. I will get right back into the thing that just lost me money. It's okay. So the idea is to be a thinking trader that can synthesize information. For me, it made way more sense to get out, wasn't behaving correctly. And then I can get back in if it starts behaving correctly again. There's no reason for me to wait until it got to my soft stop. It didn't matter. It didn't have to get down there. I don't like what it's doing now. It's not doing what I wanted to do after three days in the trade. It's all yours to it. Karim Al Oh shit. Hold on. Karim Al Mo Tar Mo Tar Karim Al Mo Tar. Let me know if I got that right. That's my best guess. Can you explain how to find an edge in the market is using different time frames than approach for an example? That's a big question. So this video is for you, Karim. And let me see. This is another video for you, Karim. Those two videos are for you. And the process of finding an edge, it's a really big question. That's why I'm sending you those videos. It's probably a little easier to tap into those. But your analysis here of, for example, using different time frames, that's more of just an",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 62,
      "start_timestamp": "00:24:21",
      "start_timestamp_seconds": 1461.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=1461"
    }
  },
  {
    "text": "Those two videos are for you. And the process of finding an edge, it's a really big question. That's why I'm sending you those videos. It's probably a little easier to tap into those. But your analysis here of, for example, using different time frames, that's more of just an analysis. And edge has a lot of different definitions, depending on who you ask and the context. A lot of people would define edge as returns above beta. So not using just standard 1.0 beta. And that just means the SP 500. So for example, if you buy a stock and you get a positive return, and that stock essentially has the same return and risk profile as the SP 500, most people wouldn't consider that alpha. They would just consider that a beta return. And when we actually talk about, I actually have to update the timestamp because I need to talk about the leveraged ETF covered stranglebook. Give me one second. So we'll talk about 25 or zero edge. And then 27 will be leveraged covered wrangle review. And so for example, if we take a look at this, I just copied this over from my portal portfolio. This is what the covered strangle right now looks like in TEE Triple Cues. And there's essentially no change from the last time we saw TEE Triple Cues and SSO are the same. Now one of the things to note here, however, is that these, if I had no options",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 62,
      "start_timestamp": "00:25:32",
      "start_timestamp_seconds": 1532.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=1532"
    }
  },
  {
    "text": "This is what the covered strangle right now looks like in TEE Triple Cues. And there's essentially no change from the last time we saw TEE Triple Cues and SSO are the same. Now one of the things to note here, however, is that these, if I had no options component to this, if there's no options at all, the way that these outperform the market is not necessarily through alpha, it's through more beta. So I'm taking additional risk to get the better return. So alpha is kind of this nebulous financial term that a lot of people have their own definitions for what it is. I'm actually curious like what the investor, PDA definition is. I'm going to look up investor, PDA specifically because I want to know theirs. I'm going to look up the plan V, E, PDA definition of alpha. Let's see what they say. Yeah, okay. I would agree with that. So they say access return of an investment compared to its expected return given a level of risk as the term of ice beta. Yeah, okay, cool. That makes it so in a sense. I think this is a great definition. I agree with this. So you can have a better return, but if you're taking a lot more risk to get that return, meaning you have larger standard deviation in your portfolio returns, then it's not alpha. It's just beta, just more beta. It's all you've taken. Wigglyworm says, I've literally never heard",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 62,
      "start_timestamp": "00:27:13",
      "start_timestamp_seconds": 1633.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=1633"
    }
  },
  {
    "text": "this. So you can have a better return, but if you're taking a lot more risk to get that return, meaning you have larger standard deviation in your portfolio returns, then it's not alpha. It's just beta, just more beta. It's all you've taken. Wigglyworm says, I've literally never heard of anyone discuss alpha or beta in depth. Welcome to the fucking nerd corner of YouTube trading because yeah, we talk about all sorts of nerdy shit and this is one of them for sure. Now I think there's kind of an easier way to define alpha, but I like this. So yeah, anyways, the idea of using multiple time frames, and that's not really, it's not really alpha, that's just an analysis approach. So when you're talking about alpha in this concept or in this context, you're talking about the ability to outperform a benchmark of sorts, whatever that benchmark is. That's what you're trying to unearthly adjusted basis. So the reason why I say if I trade T triple cues with nothing else, that's just taking more beta. However, if I trade the covered strangle as I've defined in T triple cues, now there's a strategy behind it. So let's say for example, it's not going to be the case in this scenario, the way that I have this case study setup. But when I would trade three times leveraged ETFs and I really cared about trying to minimize draw downs and capitalize on the leverage to the",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 62,
      "start_timestamp": "00:28:35",
      "start_timestamp_seconds": 1715.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=1715"
    }
  },
  {
    "text": "So let's say for example, it's not going to be the case in this scenario, the way that I have this case study setup. But when I would trade three times leveraged ETFs and I really cared about trying to minimize draw downs and capitalize on the leverage to the upside, then I integrate momentum following components to it where you can actually pace the stock market standard deviation to the downside, the draw downs, where you can grossly outperform to the upside. That is a perfect example of alpha. So it's using something that is higher beta as the basis for the strategy. It's building a strategy around this specific product and then you can create alpha. So the cool part is you as the trader have an ability to generate alpha. Again, if you're a good trader, if you're not, then most people just take excess risk. And again, you can outperform the market that way. It's just not something I would technically classify as alpha. Michael says, I'm not set up to trade options and I just buy invest in common shares. Yeah, that's cool. So for example, if an investing in common shares, you're able to identify tickers. Let's say for example, that you trade the, let me take a step back. Options and equities are just different securities. Most of the stuff that I'm talking about here, like this in APP, I'm trading options in this. It doesn't matter if I'm trading options or not.",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 62,
      "start_timestamp": "00:30:09",
      "start_timestamp_seconds": 1809.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=1809"
    }
  },
  {
    "text": "identify tickers. Let's say for example, that you trade the, let me take a step back. Options and equities are just different securities. Most of the stuff that I'm talking about here, like this in APP, I'm trading options in this. It doesn't matter if I'm trading options or not. What's happening? The profit mechanism is the exact same, the exact same. I'm just using a different security to capitalize on the profit mechanism. So the idea of alpha generation or if you want to reduce downside, standard deviation movements, those you can absolutely manufacture regardless of the security suite that you choose to use. So Wigglyworm says options are just leverage. Yeah, they're not just leverage, but they're largely leverage. It's one of the main reasons why people will trade options. The other thing that options offer us are exposure to different things that you cannot get directly with equities. So for example, let's say, let's say APP, this is a perfect example. APP, the open closed move today was 161.46 to 161.63. So essentially very little of a move didn't do a whole lot. Now, let's just say in this example, let me grab my handy dandy notepad. So let's say here Vladimir says leverage with a timer attached. That's sort of it. I mean, technically leverage would have a timer attached to it by its nature. That's what creates leverage. It's just like an infinite thing. But more importantly than the timer, it's that it has other",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 62,
      "start_timestamp": "00:31:23",
      "start_timestamp_seconds": 1883.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=1883"
    }
  },
  {
    "text": "So let's say here Vladimir says leverage with a timer attached. That's sort of it. I mean, technically leverage would have a timer attached to it by its nature. That's what creates leverage. It's just like an infinite thing. But more importantly than the timer, it's that it has other components to it. That it gives you exposure to things that you do not have in equities. So say, for example, that in here, you wanted to make money in APP. Well, let's just say that you cut the highs and lows off just for this example. And I just want to highlight that it's kind of muted movement, right? It's not doing a whole lot. So unless you're literally able to perfectly time movements, buy it down here, sell it up here. You can't really make money from this with equities. Now with options, it's different. With options in this scenario up here, let's say for example, I sold a strangle. And I sold it whereas long as it stays inside this price range, I make money. I would make money as this does nothing. And let's say for example, another example, I'm trading this with long calls. So in this same example, those long calls are suffering time decay because time is passing except now they're in a practical sense. They're so far in the money, there's very little extrinsic value. But that part aside, let's say for example, this is, let me pull this up here because",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 62,
      "start_timestamp": "00:33:03",
      "start_timestamp_seconds": 1983.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=1983"
    }
  },
  {
    "text": "in this same example, those long calls are suffering time decay because time is passing except now they're in a practical sense. They're so far in the money, there's very little extrinsic value. But that part aside, let's say for example, this is, let me pull this up here because it will be a little more clear now. Do you notice how this yellow line here is upward sloping? That's volatility. Both of these. This is seven day, vol. And this is 30 day, vol. As these are upward sloping, the value of my long calls goes up. So even though price in this specific section that I'm talking about is not really going anywhere, the long calls will still appreciate slightly. Again, this is in a vacuum. There's other factors that play into this. The long calls would appreciate slightly from the changes in volatility. So all of this goes back to the original kind of point of options are way more than just leverage. That's a big component of options. It's why most of us trade options is for leverage. But there's a lot more to options than just leverage. It's what makes them such a strategic investment tool. It's from this book over here. So this book, I love the way that he uses the term strategic. And it's because they are very strategic. If you trade anything, most things can be made slightly better with options if you know how to trade options. So if somebody",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 62,
      "start_timestamp": "00:34:46",
      "start_timestamp_seconds": 2086.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=2086"
    }
  },
  {
    "text": "tool. It's from this book over here. So this book, I love the way that he uses the term strategic. And it's because they are very strategic. If you trade anything, most things can be made slightly better with options if you know how to trade options. So if somebody says that they're an equity trader, that's okay. You don't have to be an equity trader. You have a specific style and you choose to use equities and that's okay, but you can use other stuff. So that's the idea. All right. So now let's talk about. We already talked about this part. You guys already know the latest here. There's really very little change. And that's again, by design, what the way that I'm setting this up is purposely to keep it very, very light. So now we can move on to the focus topic, I think. So we'll talk about building a trade log. All right. Let's start. I don't think anybody specifically asked from the Patreon side about building a trade log. I think I kind of forced that one in there. But let's let's talk about it. First things first. Let's get a bit of an introduction. So the whole idea of building a trade log is based on the left hand side here. And I'm grabbing a video right now about the process of building trade logs, trading plans, those kinds of things. So you'll have that for a reference. So why do we build",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 62,
      "start_timestamp": "00:36:16",
      "start_timestamp_seconds": 2176.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=2176"
    }
  },
  {
    "text": "introduction. So the whole idea of building a trade log is based on the left hand side here. And I'm grabbing a video right now about the process of building trade logs, trading plans, those kinds of things. So you'll have that for a reference. So why do we build a trade log? Well, first, a trade log is exactly what it sounds like. It's a place to log your trades. Okay. Now we know what it is. Why do we do this? It's pretty simple. So the first thing is your memory is not that good. My memory is not that good, especially after seven concussions at least documented concussions. Yeah, your boy's memory is bad as you would expect something like that would be. That aside, we also have a litany of parable, parable biases. And again, this part's on the website. And I put this on the website because I think people should fucking know this stuff. So we have a, and this isn't even all of them. This is just a list of 24 and there's more than this different cognitive biases that you have right now today. And there's actually, I think, a really cool, let me see if I can find it real quick. I'm trying to see. I think it was from, I don't know if it was from SAG. Yeah, man. I'll see if I can find it later. Anyways, they have like a series. Oh, maybe a, damn it. Really want",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 62,
      "start_timestamp": "00:38:19",
      "start_timestamp_seconds": 2299.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=2299"
    }
  },
  {
    "text": "let me see if I can find it real quick. I'm trying to see. I think it was from, I don't know if it was from SAG. Yeah, man. I'll see if I can find it later. Anyways, they have like a series. Oh, maybe a, damn it. Really want to find it. Okay, here we go. Here we go. I knew it. You just had to give me a second. Okay. So here's the question. And this is from, this is from SAG. So just to give them credit. But let's, let's read this together. What do you guys think? The, the table here says review the following table of data and answer this question. What is the relationship between pain and rainy days? Rain? No rain. That's your X axis on top. Why axis is pain? No pain. What do you guys think? That Lauren says Eric has the bad news bears of trading. Maybe I hope I also have the good news bears, but yeah. What do you guys think? I'll throw it in as a poll. Positive relation. All right, there's your poll. We just want to know based on what you see here, what is the relationship? And it doesn't tell you, but the context is going to be in terms of correlation. That's why you would look at these kinds of things from a statistical perspective. So let's see. Let's see how accurate we are. We're 40 60 split 50 50 split with eight",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 62,
      "start_timestamp": "00:39:44",
      "start_timestamp_seconds": 2384.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=2384"
    }
  },
  {
    "text": "the relationship? And it doesn't tell you, but the context is going to be in terms of correlation. That's why you would look at these kinds of things from a statistical perspective. So let's see. Let's see how accurate we are. We're 40 60 split 50 50 split with eight votes. How many people are in here? There's 20 there's 30 people. So as per usual, I would love to get 15 votes. So if you're driving, feel free to break the law and swerve around. I mean, California, it's all the same, but in order to throw the old, throw the old poll answer in, you know, it's good, good to do that. Obviously, don't do that. But we have 11 votes were four away. Feel free to double vote double votes. Okay, you can't double vote. That's a joke. But we just love to get 15 words still were just four away from 15. That would be fantastic if we're at 15. Give it another couple seconds. I might have to settle with 12 breaks my heart because this is now a statistically insignificant. 13. We're so close. Two more. We are we're right on the cusp here. I'll give another couple seconds and then we'll move on. Very close though. Okay, I'm going to end the poll 13. So what I would love is somebody that says positive correlation to explain why and then somebody that says non correlation to explain why. I would love to know",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 62,
      "start_timestamp": "00:42:17",
      "start_timestamp_seconds": 2537.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=2537"
    }
  },
  {
    "text": "I'll give another couple seconds and then we'll move on. Very close though. Okay, I'm going to end the poll 13. So what I would love is somebody that says positive correlation to explain why and then somebody that says non correlation to explain why. I would love to know from both perspectives here. Now for those that say there's not enough information that's inaccurate. So I saw somebody mentioned that above and that's not correct. So somebody that says positive why somebody that said negative why. Tommy says your thoughts on tuna melt tuna melts can hit the spot. You have to be like in a really specific set up for it. But that's yeah, tuna melts can be banger. That car eye changes from that's not enough to the sample sizes, not enough. No, that you can still you can still answer this question given this information. You absolutely can again, I already told you and equals 15. I actually use it for the poll. We can't use our sample technically, but this is a completely fine sample size. Vladimir says I'm biased when it rains, I have no pain. That Lawrence says pain in rain would be the same. Nope. So nobody has any ideas. There's not anybody that can explain either why they believe it's positively correlated or non. Gib says non correlation, my logic is that there doesn't seem to be an algorithm to it. An okay assumption, but that's still not really an explanation.",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 62,
      "start_timestamp": "00:43:58",
      "start_timestamp_seconds": 2638.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=2638"
    }
  },
  {
    "text": "the same. Nope. So nobody has any ideas. There's not anybody that can explain either why they believe it's positively correlated or non. Gib says non correlation, my logic is that there doesn't seem to be an algorithm to it. An okay assumption, but that's still not really an explanation. Reese says no, I just felt bullied into voting. That's probably the most reasonable answer so far. I'm glad. Cedric says more people have pain on no rain. Okay. I think we're getting there. I think we're getting there. Tommy says pain slash rain is positively expected, not so much. So let's see how to answer this. I don't know. I'll see in a second if they have an answer on their website. I'm going to do it with you then because I actually don't know if they have an answer. But let's take a look at scenario together. That yellow is hard to see, I think. So let me grab. It doesn't feel like the number of people reporting on rainy days is significant. Well, rainy days, or do you mean non rainy days? Because rainy days is enough. So let's take a look. Now, a lot of people and you guys actually believe, oh, there is an answer here. This is perfect. I just realized that there's a community. Rather than me, they literally have an answer drop down. So let me copy this in. Here's your answer. So the answer says many people will answer that a",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 62,
      "start_timestamp": "00:45:39",
      "start_timestamp_seconds": 2739.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=2739"
    }
  },
  {
    "text": "and you guys actually believe, oh, there is an answer here. This is perfect. I just realized that there's a community. Rather than me, they literally have an answer drop down. So let me copy this in. Here's your answer. So the answer says many people will answer that a positive correlation exists between pain and rainy days, which our sample actually confirms that. The majority of you felt that. And the rationale they explain why people do this is in judging the relationship, many people mistakenly overweight the positive cases relative to all other cases. As a result, they mistakenly conclude that the two events are positively correlated. In fact, in this example, it a slight negative correlation exists. Two-third of people feel pain on rainy days, whereas three-quarters of people feel pain on days with no rain. So what's happening here is where just and just for you guys that don't know, in both my undergrad and grad, I spent a lot of time doing different kinds of studies like this because there's a lot of statistical analysis that goes into this. Vladimir says, two to one pain with rain, three to one pain without rain, non-correlated. It's actually not correlated either. As this points out, it's slightly inverse correlated. And the reason for that is, again, it's not just based on the raw numbers. It's based on the relative numbers that you see here. So you can see the total number of instances where there's rain. Then",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 62,
      "start_timestamp": "00:47:27",
      "start_timestamp_seconds": 2847.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=2847"
    }
  },
  {
    "text": "actually not correlated either. As this points out, it's slightly inverse correlated. And the reason for that is, again, it's not just based on the raw numbers. It's based on the relative numbers that you see here. So you can see the total number of instances where there's rain. Then you can see the total number of instances where there's no rain. Then you can see the total number of instances where there's pain and versus no pain. And you can then put it into a percentage term to then make a actual analysis of things. So I'm actually curious what this talks about more though. I haven't read this before. This says this thinking is an example of a lusinary correlation atop of confirmation bias and decision making. Searching for information or interpreting information in a way that supports our perceptions can lead to a biased outcome. Experiments designed to prove not to prove a theory can result in erroneous conclusions about the accuracy of the theory. In the example above, considering the situations where the relationship between pain and rain does not exist is equally relevant to determining the correlation between the events. In pricing securities, it's important to find information that supports our estimates of the fair price. But it is also important to search for information that dis confirms our estimates. Guess what? Anybody that is followed the outlier channel and way of thinking for a while, when we're searching and scanning for a trade, what's",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 62,
      "start_timestamp": "00:49:10",
      "start_timestamp_seconds": 2950.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=2950"
    }
  },
  {
    "text": "to find information that supports our estimates of the fair price. But it is also important to search for information that dis confirms our estimates. Guess what? Anybody that is followed the outlier channel and way of thinking for a while, when we're searching and scanning for a trade, what's one of the main processes that I talk about? There's a very specific process that I talk about. And it's funny because it's this exact thing. I'm going to open the door for Thoroughquay. I'm going to open the door. Looking for nose. That's what I call it. The process of looking for nose is literally this here. Considering the situation here, important to search for information that dis confirms our estimates. That's the idea of looking for nose. So that's one of the examples of decision making. And all this goes back to the trade log because again, over 50 of us up here, we can see falsely analyze the data that's provided here. Extrapolate that out and think of our ability to accurately recollect the details of a trade and a strategy, the details that are important. How good do you think your memory is? And then once you layer on your biases on top of that, it makes no sense for somebody to think that they can remember these things. And hopefully just piece them together when they need it. It just doesn't make sense. Let's do another one. Oh, this one's cool. All right. Next question.",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 62,
      "start_timestamp": "00:50:20",
      "start_timestamp_seconds": 3020.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=3020"
    }
  },
  {
    "text": "you layer on your biases on top of that, it makes no sense for somebody to think that they can remember these things. And hopefully just piece them together when they need it. It just doesn't make sense. Let's do another one. Oh, this one's cool. All right. Next question. Let's play a game. I sound like the dude. What is it? The little, the, the, the, the saw guy. That's right. Let's play. I want to play a game. Right down the last two digits of your social security number. You don't share it in the chat. Just keep it to yourself. Do you think that the average temperature in chug water, Wyoming is higher or lower than this number in degrees Fahrenheit? Now explain why you believe the average, what you believe, the average annual temperature is in chug water, Wyoming. So this is going to be one that you have to do on your own. But think about it for a second. And then I'll give you the answer. Okay. Let me grab the screenshot for the answer. And be honest. Reece says, is this to make options seem easier by comparison? It's not actually. This is to elucidate the point on why you need a trade log because you and everybody else myself included are riddled with so many different kind of mental biases when it comes to analyzing information that you need to have a system to objectively and quantifiably track and assess ideas because",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 62,
      "start_timestamp": "00:52:15",
      "start_timestamp_seconds": 3135.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=3135"
    }
  },
  {
    "text": "to elucidate the point on why you need a trade log because you and everybody else myself included are riddled with so many different kind of mental biases when it comes to analyzing information that you need to have a system to objectively and quantifiably track and assess ideas because you cannot do it as an individual person nor can I nor can anybody else. It literally is not a thing. So this says, how does your answer to the second question relate to the first one? The two numbers are completely unrelated and the last two digits of your social security number should have no influence on your answer to the temperature in chug water. In tests, well, all right. Well, you guys already know what's next. In case you know, it's really cheap to get there. That's kind of cool. But we need to see what's going on in chug. Wow. Holy shit. All right. So there is seven streets in chug water. Let's go check out chug. Oh, damn, bro. These guys are. These guys are in it. All right. Let's make a little more progress here. Let's get into lovely chug water. Okay. Here it is, gang. Welcome to chug water. I thought they would have like a population sign population like four. All right. What do we have here? What is this? Chili. Hey, tug water. Chili. I like that. I can get down with some chili. Well tea. Wheel tea. Well tea service. A",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 62,
      "start_timestamp": "00:54:07",
      "start_timestamp_seconds": 3247.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=3247"
    }
  },
  {
    "text": "gang. Welcome to chug water. I thought they would have like a population sign population like four. All right. What do we have here? What is this? Chili. Hey, tug water. Chili. I like that. I can get down with some chili. Well tea. Wheel tea. Well tea service. A couple grain silos. All right. Let's get down main strip here. Look at the town hall. Yo, this is nuts. Is that the post office? There it is. Yo, this place is crazy. There it. Don't park here. Listen, don't park here. There's no parking here. If you you park here, there's going to be big trouble. The fact that there's even a no parking sign here is if there's like enough cars to park here. Is nuts. Okay. So now I know what chug water looks like. That makes me happy. Back to this though. Individuals with higher social security numbers submit higher estimates of the chug water temperature and example of anchoring. The error of assessing numbers or probabilities based on a reference point, which overly influences anchors the estimate. So just another bias. There's a couple others in there. We're not going to go through all of them. My main goal here is for you to take away the primary point that I'm sharing here is that the idea of not maintaining a log and expecting to have good outcomes going forward is not super great. It's not super great. And that's the whole goal of the",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 62,
      "start_timestamp": "00:56:01",
      "start_timestamp_seconds": 3361.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=3361"
    }
  },
  {
    "text": "them. My main goal here is for you to take away the primary point that I'm sharing here is that the idea of not maintaining a log and expecting to have good outcomes going forward is not super great. It's not super great. And that's the whole goal of the session today is to spend a little time building a log. So let's talk about how to build a trade log. The first thing here is you'll notice that I talk about essentially the outlier strategy process. Profit mechanism, profit mechanism, subtype or sub profit mechanism or whatever version of that. Really, I like to think of PMS here. That's why I like putting subtype is because I get to say PMS for the abbreviation. And then we need to define the profit mechanism signals PMS again. So joking aside, I normally would just do subtype or the qualities of the profit mechanism. Like this. So the reason Vladimir says last two social synomities can be zero zero and I nine. Anything between Wyoming's average temperature is 42. So the changes that Wyoming temperature will be lower. You're going off on a complete tangent that's not relative to the question that. The because the data sample, you're using a sample of one in terms of the extremes. So as you have a larger data sample, the fact that there can be somebody with a zero zero or 99 is very low or even people that have 90 or 10. Essentially,",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 62,
      "start_timestamp": "00:57:55",
      "start_timestamp_seconds": 3475.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=3475"
    }
  },
  {
    "text": "that. The because the data sample, you're using a sample of one in terms of the extremes. So as you have a larger data sample, the fact that there can be somebody with a zero zero or 99 is very low or even people that have 90 or 10. Essentially, you can say anybody that has the ending numbers of like 30 and below or 70 and above probably don't really contribute much to the sample, but they're going to be overwhelmed by the rest of the sample. So it doesn't really matter. Anyways, back to this. So we start with these details. Why do we start these details? Joey says, wasn't the question just what do you think the average temperature is not if it's higher or not? That's correct. What do you think the average temperature is? That's correct. What they're doing is they're showing a relationship, a correlation between people that have higher or lower social security numbers as the number sets and what their guess is. So people that have a higher social security number tend to guess higher. People that have a lower social security number tend to guess lower. So they're showing the the process of anchoring. So back here, why do you guys think we start with this? With the trade log, why do we start here? When we talked about this yesterday, notice how we started making a trade log up here that was literally just based on profit mechanism tracking. Why",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 62,
      "start_timestamp": "00:59:35",
      "start_timestamp_seconds": 3575.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=3575"
    }
  },
  {
    "text": "process of anchoring. So back here, why do you guys think we start with this? With the trade log, why do we start here? When we talked about this yesterday, notice how we started making a trade log up here that was literally just based on profit mechanism tracking. Why do we do this? It's specifically because like we talk about with the building of a strategy, where's that at? Where's that old strategy process at? Here, if you think about the strategy process, if you don't have profit mechanisms and their qualities and signals, if you don't have that right, none of the rest of this matters. So that's the exact reason why we start with those because without this, none of this matters. It's keeping first things first. So the way that I think for new traders to build a trade log, ideally, depending on where you're at in your trading journey, but for new traders, I would literally start by listing the profit mechanisms that you think you're going to try to trade. And then I would create trackers for all of them. And what goes into the tracker, it can be something as simple as this. It can be the profit mechanism, whatever you think it is, the date that you're coming up with your estimate, the ticker that you're looking at, whatever your thesis is, what the timeframe is for your thesis, especially if you're an options trader, you have to have a timeframe. And",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 62,
      "start_timestamp": "01:00:59",
      "start_timestamp_seconds": 3659.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=3659"
    }
  },
  {
    "text": "It can be the profit mechanism, whatever you think it is, the date that you're coming up with your estimate, the ticker that you're looking at, whatever your thesis is, what the timeframe is for your thesis, especially if you're an options trader, you have to have a timeframe. And what happened with the outcome? Was it positive or negative? Meaning did it match your thesis or not? That's it. Then over time, this can evolve. So we can have a thesis, then we can add something like a target, then we can add stuff like a probability, those kinds of things. But one of the things that you'll notice that I talk about with respect to building this, I got to find where we're at again. Oh, damn, un-lost. Here we go. Is we have to think about the details that matter and inform the strategy? Then we want to format for ability to conduct data analysis. And most importantly, we want to keep it consumable. So what that means is there's lots of people that when they first start thinking of a trading log of some sort, they're like, oh, I'm going to track everything. And then guess what happens if you try to track everything? You don't do it. Because it's too much work. Because you sit there and think to yourself, I don't want to have to put in 92 different inputs to track this one thing. So the purpose behind this is to focus on",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 62,
      "start_timestamp": "01:02:51",
      "start_timestamp_seconds": 3771.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=3771"
    }
  },
  {
    "text": "what happens if you try to track everything? You don't do it. Because it's too much work. Because you sit there and think to yourself, I don't want to have to put in 92 different inputs to track this one thing. So the purpose behind this is to focus on the things that matter to you. So I want to start with a profit mechanism tracking example. And I would like you guys to pick the profit mechanism that we're going to track. And then we will go through there. Vladimir says regarding comprehension is variable cross populations. Dog, we are way past that. If you want to enjoy chewing on that bone, go for it. But we're talking about logs now, homie. Okay, so Joey says breakouts that Lauren says volume changes. Okay, so we need a couple. We need a couple more just so that we can have a tie breaker, whatever the consensus is. So so far, I see breakouts in volume changes. So let's go up drift. Now we have a third one that's entered the equation. Any others, otherwise, I'm just going to have Siri pick a random one. I'm going to assign a, B and C to those. You see two for drift. All right, two for drift wins. We're going to do it for drift. Profit mechanism tracking. So we're literally going to build this together. First, the profit mechanism. And again, I'm just going to give you like a small example. And",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 62,
      "start_timestamp": "01:04:34",
      "start_timestamp_seconds": 3874.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=3874"
    }
  },
  {
    "text": "and C to those. You see two for drift. All right, two for drift wins. We're going to do it for drift. Profit mechanism tracking. So we're literally going to build this together. First, the profit mechanism. And again, I'm just going to give you like a small example. And then we can build it out over. James says is drift only to the upside or is it also to the downside? It's downside for sure. Downsides totally okay. In this case, I'm assuming that they're talking about price go up drift. That's kind of natural, but you're 100 correct. So profit mechanism here is going to be price, direction, up, quality or in this case, I'll just use subtype. I think that's probably a little more relatable to people. Subtype here will be drift. So now we have to continue building this out. What other things matter to us? If we're trying to trade drift to the upside and we want to measure our ability to capture this profit mechanism, what details matter to us? So again, that's what this is. So just brainstorm throw random stuff out there to start. And then we will refine it down. So I'm going to move this over here. So it's out of our way and we'll start with the brainstorm. So timeframe, okay. That's one of them. Velocity. Okay. What other ideas? So again, what I'm asking you is what do you think would be useful for you to be able",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 62,
      "start_timestamp": "01:06:09",
      "start_timestamp_seconds": 3969.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=3969"
    }
  },
  {
    "text": "I'm going to move this over here. So it's out of our way and we'll start with the brainstorm. So timeframe, okay. That's one of them. Velocity. Okay. What other ideas? So again, what I'm asking you is what do you think would be useful for you to be able to look at to be able to better trade drift price direction up? What details would be useful to you? So far we have time frame velocity. Reasons behind exactly so catalyst. I love that. Float, sure, we can throw that in. Volume, another great one. Market events. Long term trends. So, Shrej goes with trends, so kind of more generalized. Okay. What other stuff would be helpful to us? Short interest? Sure, we can throw it in there. Stock events. Market capture. Again, I'm not going to use all these, but I just want to see and put you guys through the exercise of thinking of things that you think are useful. Put call skew, sure. Sector trend. Vladimir is talking about the personality of a ticker. That's good. I hope you can take your tickers on a date. Skew, sure. Sector trend we have. Average temp in chug water, Wyoming. I think that's probably the most important one that we could possibly list here if I were to categorize it. I literally don't know if it gets more important than chug water. Chug water. Zachary is talking about physical pleasure coming from numbers. I don't know if that's",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 62,
      "start_timestamp": "01:08:00",
      "start_timestamp_seconds": 4080.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=4080"
    }
  },
  {
    "text": "water, Wyoming. I think that's probably the most important one that we could possibly list here if I were to categorize it. I literally don't know if it gets more important than chug water. Chug water. Zachary is talking about physical pleasure coming from numbers. I don't know if that's a kink. It's probably a kink, but I don't I'm unfamiliar with that as a specific kink. Red it would probably be the right place for you. Social media coverage, okay. Okay, I think you guys have done a good job building an initial list. Let me show you some of the things that I think matter. Joey says distance off highs. That's actually exactly one of them. Good old 50 day ma slop. I don't care about that for drift. I also care about okay. So now let's start building this thing. Let's find let's find something. And for our example, now again, the reason I'm starting with profit mechanism tracking is because if you can get down profit mechanism tracking, then the process of building a log for a specific strategy becomes really, really simple, right? So you can see here this is an example log for a covered strangle. And the things that I think matter to that in general. So this the reason why we're going to spend the majority of the time on the focus topic, looking at profit mechanism is I think for the overwhelming majority of you, this is what is going to",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 62,
      "start_timestamp": "01:09:53",
      "start_timestamp_seconds": 4193.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=4193"
    }
  },
  {
    "text": "covered strangle. And the things that I think matter to that in general. So this the reason why we're going to spend the majority of the time on the focus topic, looking at profit mechanism is I think for the overwhelming majority of you, this is what is going to matter the most. Then we can add different kinds of strategies and stuff. Reese says how are drift and trend different? Yeah, so trend kind of can apply to different time frames drift is a well documented profit mechanism. So the way to think about things that have drift trend momentum, there are three different ways to look at a different kind of behavior. Drift tends to be much longer term. So when we say the stock market as positive drift, we're thinking out generally in years trend tends to be longer term time frames, but not necessarily years. It can be sub time frames. It can be one month, six months. It can be years or years for sure. And then momentum is typically shorter term time frame. And there's also a difference in the velocity of the movement between them when we sub classify between drift and momentum. So drift tends to be slower style movements up momentum tends to be more aggressive style moves up stair step pattern. So just kind of different construction between them. Tommy says is momentum or trend as swing. So swing traders quote unquote, those are people that tend to have holding",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 62,
      "start_timestamp": "01:12:09",
      "start_timestamp_seconds": 4329.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=4329"
    }
  },
  {
    "text": "So drift tends to be slower style movements up momentum tends to be more aggressive style moves up stair step pattern. So just kind of different construction between them. Tommy says is momentum or trend as swing. So swing traders quote unquote, those are people that tend to have holding periods of a certain duration generally less than three months. That's like a swing trader could be out to six months maybe. But that's more talking about the holding duration of things. Yeah, a lot of these terms are really tricky because there's general definitions for them. But then there's the way that people generally use them. And there's absolutely a difference between those. So it can be a little yeah, it can be a little tricky to to align those. Oh yeah, I forgot. I got to get my dinner order going here. I was wondering. I was like, yo, my stomach is going. What's happening here? All right. What's for dinner tonight? Let's see if anything speaks to us. What do you guys think? That Lauren says I'm a swing trader by accident exit strategy. Sus you're not a swing trader. What you did in so far is like a two day trade. That's not swing trading. Don't come at us with the swing trading stuff. There ain't no way. So swing trading is a bit longer in duration than holding for like two days and then paper handing out of a trade that's moving in your favor",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 62,
      "start_timestamp": "01:13:32",
      "start_timestamp_seconds": 4412.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=4412"
    }
  },
  {
    "text": "like a two day trade. That's not swing trading. Don't come at us with the swing trading stuff. There ain't no way. So swing trading is a bit longer in duration than holding for like two days and then paper handing out of a trade that's moving in your favor massively. And just kind of exiting as soon as it does. Yeah. I'm just not kidding, but you know, I still love you Lauren. And we're going to do Carl Strauss, I think we're not going to do a meatball sandwich. I don't think we're meatball sandwiches. That's a hot take. That's a real hot take. Yeah. We're going. Oh, damn it. Yeah, I'm going to do, I think I'm going to go with a burger. Burger sounds right to me. Yeah, that all looks good. That looks good. Perfect. And then we need these. Perfect. We Gucci. Stake freets. I don't really understand the steak freets thing. Stake freets is kind of weird to me. I need to calm down so that she looks at the thing. But I don't call her if she won't look at it and then there's giant pain in the ass. Yeah. Stake freets, I just feel this kind of strange. It's like if I have a steak, I would much rather not have fries with that. I would much rather have what a terrible time, by the way, for Israel and I ran to start playing this game because I just put on",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 62,
      "start_timestamp": "01:15:07",
      "start_timestamp_seconds": 4507.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=4507"
    }
  },
  {
    "text": "I just feel this kind of strange. It's like if I have a steak, I would much rather not have fries with that. I would much rather have what a terrible time, by the way, for Israel and I ran to start playing this game because I just put on an SP position that's going to get smashed. Joey says, why not? Is she's steak some dipping sauce, fries and yeah, it's like I would much rather have like roasted potatoes or mashed potatoes or something like that. Some sort of potato. Less so on the French fry front. All right. Waiting for Mel to finish her order and then we'll keep running through here. I'm going to zoom in a little bit so you can see. Reese says the Middle East is all weekend to make up and be friends. Yeah, the problem is the market's still going to respond to that. I wish futures were open right now because I would have been stopped out already. I bet. But that's not our current state, unfortunately. All right. So we have like 40 minutes before dinner gets here plenty of time. All right. Oh, Spanish Ration chicken. I love that. My mom makes a super, super good Spanish Ration chicken. Big, big fan. Big, big fan. All right. So here's how I would build this profit mechanism tracking for price direction drift up. And this really would apply to just about anything, but I'm going to add a series",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 62,
      "start_timestamp": "01:17:14",
      "start_timestamp_seconds": 4634.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=4634"
    }
  },
  {
    "text": "that. My mom makes a super, super good Spanish Ration chicken. Big, big fan. Big, big fan. All right. So here's how I would build this profit mechanism tracking for price direction drift up. And this really would apply to just about anything, but I'm going to add a series of things in terms of the way that this is built. So it's kind of easier to track. So this would be entry date. This would be picker. Then I would add for drift. We can add a few things. I'm going to break this up into a couple different versions. I'm going to do a light version, which is what I would consider to be like bare bones minimal acceptable. So that because again, like I know a lot of people compliance is difficult in terms of doing this stuff. So I'm trying to make it so that there's different versions that you can use. And we can talk about why the details matter more than others and whatnot. So entry date ticker. I'm trying to think of like up to five inputs. Now in terms of like what we calculate, that's easy because once the calculations are made, the calculations are easy, right? And you'd like I think about inputs as the spot that I have to be really selective here. The reason why I think that is the case is inputs are what you manually are going to have to look at. What's calculated is automatically going",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 62,
      "start_timestamp": "01:18:44",
      "start_timestamp_seconds": 4724.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=4724"
    }
  },
  {
    "text": "the calculations are easy, right? And you'd like I think about inputs as the spot that I have to be really selective here. The reason why I think that is the case is inputs are what you manually are going to have to look at. What's calculated is automatically going to be calculated. So it's literally no skin off your back. So we're going to have entry date ticker. We'll have underlying price or stock prices. I typically would write it. And then I would have a target. I would have a time frame. I would have something to track signals. But again, I would track a bunch of these signals. I would boil this down to whatever the most pertinent signals are. So signal one, signal two, whatever those are, I would define those. And we can for the sake of drift, in this case, signal one could be percent off 52 week highs. Signal two can be three MA alignment. And then these would be defined obviously by the trader. The reason why I'm building this the way that I am is going back to this format for data analysis. A lot of people they would have a section here called like indicators. And then they would start writing. They would say 10 day MA is positive sloping with price above the keyboards off to the side to the typing terrible with price above 50 day MA is below the 20 day. Like this. You can't analyze this",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 62,
      "start_timestamp": "01:20:07",
      "start_timestamp_seconds": 4807.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=4807"
    }
  },
  {
    "text": "section here called like indicators. And then they would start writing. They would say 10 day MA is positive sloping with price above the keyboards off to the side to the typing terrible with price above 50 day MA is below the 20 day. Like this. You can't analyze this in a broad scale. You like it's a fucking nightmare. I'm not saying don't include that. But I would keep that to a minimum. And I would keep that relegated to a few spots. The majority of what I'm building here is specifically so that I can easily I can very, very easily I need to wrap the texture. I can easily see what I'm trying to filter by and I can look at it all at once. So in this case, and we'll look at it in example in a second. So then indicators. This is not that. MA alignment. Okay. And then the other thing I do is I actually pay pretty close attention to ordering of things so that it makes the most sense. So do you notice how I just reordered that? And it's because I have a feeling when I'm developing my price target. I'm trying to build a price target. I will have consulted the distance off of 52 week highs and the alignment of the three MAs that I'm going to use. The other thing that I would do here is I would post a comment and I would say MA one is",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 62,
      "start_timestamp": "01:21:43",
      "start_timestamp_seconds": 4903.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=4903"
    }
  },
  {
    "text": "trying to build a price target. I will have consulted the distance off of 52 week highs and the alignment of the three MAs that I'm going to use. The other thing that I would do here is I would post a comment and I would say MA one is 10 day MA two is 20 day MA three is 50 day again. If you are switching between indicators, you're testing in 11 day MA compared to a nine, those kinds of things. That's why this note is important. If you have a standard suite of tools, then you don't need to put the note, but the note's not going to hurt you. Okay. So this is the entry criteria. Then we have exit date, exit price. Again, this is the light version. This is what I would consider to be the minimal viable product. Now the way that I tend to build this would be like this. This would all start like that. This would be colored differently so that I know that these are exiting inputs. And then over here, I would color these differently so that I can track stuff like I can't tell if it's writing in there. There we go. Good old tit. So this would be time in trade. The next thing I would track would be before here actually. I forgot there's no cost. There's no strategy. So normally when I'm building this before this would be a cost thing, but that's going",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 62,
      "start_timestamp": "01:23:06",
      "start_timestamp_seconds": 4986.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=4986"
    }
  },
  {
    "text": "in there. There we go. Good old tit. So this would be time in trade. The next thing I would track would be before here actually. I forgot there's no cost. There's no strategy. So normally when I'm building this before this would be a cost thing, but that's going to be based on the individual strategy which we're not tracking for now. We're just tracking the profit mechanism. So we see exit date, exit price. Now what metrics would be useful for us to calculate to see how well we did. Time in trade is one of them. That law says do you always have an exit date and price? Yes. I always have an exit date and price. The reason why I care about exit date and prices because it allows me to track the movement of the underlying while I'm in the trade. PL, that's good. So PL, relic, that's fine. What other stuff would be useful here if anything? James says track when slash loss percent expected return if it exists. That would be at the strategy level. So I agree with you. This is looking at the individual profit mechanism in its occurrences. So then what I would build is an actual tab that lets me track the performance of the profit mechanism itself. So here we're just tracking all of these different profit mechanisms. Recess percent of portfolio, there's no position here so that's not a thing yet. Joey says thesis was correct. Sort",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 62,
      "start_timestamp": "01:24:47",
      "start_timestamp_seconds": 5087.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=5087"
    }
  },
  {
    "text": "what I would build is an actual tab that lets me track the performance of the profit mechanism itself. So here we're just tracking all of these different profit mechanisms. Recess percent of portfolio, there's no position here so that's not a thing yet. Joey says thesis was correct. Sort of, right, because PL would automatically do that for us. So we don't need to track that here. Vladimir says if anybody's interested, there are Excel trade log templates that can be downloaded or printed. If you track with pen and paper, I couldn't recommend against that enough. And the reason why I couldn't recommend against that enough is simply because you cannot do data analysis on pen and paper stuff. So for those that track on pen and paper, I would mega highly encourage you to not do that and to track it on Excel or Google sheets or something like that. Tommy says occurrences of the PM. That's at the strategy level. I would agree there. But that's not here. Vladimir says Lauren says she's pen and paper. Yeah, so Lauren, don't do that. Use Google sheets or Excel. Whoever, yeah, for sure. Don't, don't do. Pen and paper is it's doing the work of trading, of using a trade log. And it's not really giving you access to the benefit, which is the ability to analyze things in a large scale. So yeah, don't do that. Okay, so I would actually argue in the beginning, this is",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 62,
      "start_timestamp": "01:27:01",
      "start_timestamp_seconds": 5221.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=5221"
    }
  },
  {
    "text": "paper is it's doing the work of trading, of using a trade log. And it's not really giving you access to the benefit, which is the ability to analyze things in a large scale. So yeah, don't do that. Okay, so I would actually argue in the beginning, this is absolutely fine. Like I actually wouldn't start adding a bunch more here. There's one thing I would add over here. And again, normally, this would be in two different spots. This would be entry notes. Exit notes. So this is the place where if you want to be able to put your thoughts in, I would do those here. Like I said, there's no reason to not include them. The problem people have when they do trade notes like this is they put too many details that they would have wanted. Now, there's a couple other things from a calculation standpoint that I think make a lot of sense. So the first thing I would say that makes a lot of sense is percent to price target. That's a really important one. The other thing that we're missing here, return an avesi capital, that's more from like a trading perspective, which is okay, meaning if this was an actual position versus tracking the profit mechanism itself. So just essentially equate this to percent move, I think that's okay. The other thing, yeah, I think that this is fine to start from like a minimal viable perspective. I think this is",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 62,
      "start_timestamp": "01:28:33",
      "start_timestamp_seconds": 5313.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=5313"
    }
  },
  {
    "text": "which is okay, meaning if this was an actual position versus tracking the profit mechanism itself. So just essentially equate this to percent move, I think that's okay. The other thing, yeah, I think that this is fine to start from like a minimal viable perspective. I think this is fine. So then the whole point of this is you can turn this one template into something that tracks everything. So for example, I would change the three MA alignment and I would not make this yes or no. I would label this as bowl or bear. And then in here, I would update this note. I would say bowl equals 10 over 20 over 50. And then I would actually put price above all of them. Bear equals 50, 20 and price in terms of alignment. So that now, let's say I do later on, I want to start tracking price direction down, drift. I can literally use this same exact thing. And I can track all in one spot. And by doing this, I can then start summarizing like you guys are talking about. So for example, at the top of this, I could list out my profit mechanisms, each one. So this could be something like equals probably a little higher equals unique. And I can just list out the unique stuff that occurs. Right. So this is again, I'm using formulas. And then I can do count. So the number of times it happens, number of",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 62,
      "start_timestamp": "01:30:24",
      "start_timestamp_seconds": 5424.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=5424"
    }
  },
  {
    "text": "mechanisms, each one. So this could be something like equals probably a little higher equals unique. And I can just list out the unique stuff that occurs. Right. So this is again, I'm using formulas. And then I can do count. So the number of times it happens, number of wins, number of losses, average win, average, oops. And then I can just list out the numbers. Average win size, average loss size, and so on and so forth. And the cool part about setting it up this way is I can start tracking using the inputs here and have a summary at the top. So the other one I can do is the average tip, an important one. That kind of stuff. Joey says if you use chips for data validation, it can be pretty formatted too. So you don't have to type either. It's just a drop down. Yeah, the drop downs are good. And depending on how much freedom you ultimately want to have, then that's totally cool. Because the other thing that I will always do is add a filter here. So that now I can filter by, let's say I just want price direction up. Let's say I had a bunch of them. I can just see the price direction ups. These are a little more like doing it this way is a little more friendly to formatting changes, right. Because if you start doing stuff like chips and drop downs, it can be a",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 62,
      "start_timestamp": "01:32:17",
      "start_timestamp_seconds": 5537.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=5537"
    }
  },
  {
    "text": "Let's say I had a bunch of them. I can just see the price direction ups. These are a little more like doing it this way is a little more friendly to formatting changes, right. Because if you start doing stuff like chips and drop downs, it can be a little more annoying as you ebb and flow with the details that you want to include. So your homework for this weekend is to build a profit mechanism tracking log. That's your homework. And again, this is the light version. This is designed to be minimal viable product so that it's not difficult or annoying to build and maintain. That's your homework here. Now, when we start building a specific structure and strategy, that's slightly different, which is what we'll talk about now. So this inherently is going to track the signals as well by looking at this. So this almost becomes like one of the things that I would absolutely want to track is the average return by percent off highs. So then you can start doing a little bit of correlation analysis to see if percent off of highs actually has some sort of correlation with the average return of the trade. And this is how you can use higher level summaries to then inform strategy choices. Zachary says, do you use RSS minimally? The reason is like, for example, you could easily codify something like this. So you could do equals, Google finance, and then you could",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 62,
      "start_timestamp": "01:34:02",
      "start_timestamp_seconds": 5642.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=5642"
    }
  },
  {
    "text": "return of the trade. And this is how you can use higher level summaries to then inform strategy choices. Zachary says, do you use RSS minimally? The reason is like, for example, you could easily codify something like this. So you could do equals, Google finance, and then you could do whatever the ticker is. And then there's a command. I forgot exactly how it goes, but it's like 52 week highs or some shit, 52 week, I, whatever the fuck it is, I don't remember. But there's a specific operator that you can do to have it pull it. I think it's better to look at it personally. So here's your profit mechanism tracking. And then this would be up there. And then this column would go away. Any questions on this is it sits. This is literally all you need to start like literally. If you have this, you can start making decisions that are based on actual information. Like this is like literally all you need to start. Any questions here. And then if not, we'll take a look at strategy. That Lauren says, I have to take a class in this Google Docs crap. I will but tracking with paper now and we'll input once I figured out. Yeah. So exactly like Tommy said, you can either use Google Docs or some like chat GPT to help you or like literally just follow along with what we're doing here. If you open up a Google sheet",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 62,
      "start_timestamp": "01:35:46",
      "start_timestamp_seconds": 5746.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=5746"
    }
  },
  {
    "text": "but tracking with paper now and we'll input once I figured out. Yeah. So exactly like Tommy said, you can either use Google Docs or some like chat GPT to help you or like literally just follow along with what we're doing here. If you open up a Google sheet and do what I'm doing as I'm doing it, then you're not talking to birds out of the air with one stone because you're learning. But then you also literally have live support is as you're trying to do this stuff. You actually get three birds as I think about it because then it's also not something that's added to the do to the to do list. It's done. You're doing it as it's happening. So then you don't have it to do. It's fucking done. And then you just start filling it in. Okay. So now let's do the next version of this, which is strategy. So this is profit mechanism tracking. This will be strategy. Now this would be on another tab. So let's actually let's try to make this a little more how it would be specifically. So this would be here. This would be called PM tracking. And then this would be down here. I would start it at like n. Oops. And then this would be up here. And I would do the math for all this stuff up here. And then this would be a strategy, which again, like I'm actually going to delete",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 62,
      "start_timestamp": "01:37:18",
      "start_timestamp_seconds": 5838.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=5838"
    }
  },
  {
    "text": "tracking. And then this would be down here. I would start it at like n. Oops. And then this would be up here. And I would do the math for all this stuff up here. And then this would be a strategy, which again, like I'm actually going to delete this. We literally have a strategy right here. This is already done. And we've been looking at this one. So for the strategy, this is for coverage strangles. And notice how I have the little summary thing up top. I have multiple coverage strangles. I don't have anything on an hyg. I'm probably not going to put anything on in there for this. That Lauren says, Reese, can I do Google sheets on a MacBook? You absolutely can. Yeah. So Google sheets is through the through the browser itself. You can access Google sheets through Safari. You don't even have to use Chrome. Yeah. You 100 can. So here we have the coverage triangle. This is just an example. So let's build a simple version of something. What strategy do we want to try to build? I'm thinking something like, well, I don't know what you guys trade the most. Maybe long long options. Ratio call diagonal. I mean, I already have I've shown you guys examples of those to be honest. I'm trying to think of something that would be applicable to the to the largest number of people. So which would probably be my guess is. Yeah, my",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 62,
      "start_timestamp": "01:38:43",
      "start_timestamp_seconds": 5923.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=5923"
    }
  },
  {
    "text": "Maybe long long options. Ratio call diagonal. I mean, I already have I've shown you guys examples of those to be honest. I'm trying to think of something that would be applicable to the to the largest number of people. So which would probably be my guess is. Yeah, my guess is single options. And this can be something that's like really, really simple. Or it can be something that's less simple. So let's think of stuff that matters for single options. We can do something like date. Oh, hold on. Looks like there's a fake person. Hold on. I try to take care of these people super quicks. I don't like them being on the discord. Were you a little bastard? No, it doesn't look like they're in the discord. Okay. Reese says long long or long with a short. I use the ratio, but most commonly people don't. Yeah, for sure. Okay, so let's let's think about the details that are important for long single options. So we'll have an entry date. We'll have a ticker. We'll have an expiration. I'm just kind of spitballing here and then we can refine it. And I'm trying to think of it in terms of the way that I would input the data. So the reason why expiration comes early is because well, I guess we can move this over a little bit ticker. So this would be target. Then this would be what do we want to do? We don't",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 62,
      "start_timestamp": "01:40:42",
      "start_timestamp_seconds": 6042.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=6042"
    }
  },
  {
    "text": "it in terms of the way that I would input the data. So the reason why expiration comes early is because well, I guess we can move this over a little bit ticker. So this would be target. Then this would be what do we want to do? We don't really need. I'm trying to keep it super light. So I guess for this, we could either do signal, one, two, target expiration. Then we can do lots, meaning trade size. And then we could do long call delta, long put delta so that we can do either long calls or long puts. I mean, realistically, we could also do short options. So we could do short put delta, long put delta, short call delta, long call delta. Now again, for me, I would actually organize these. So it would be whatever I think I would do the most. So for example, if I'm not selling a bunch of calls, that would go over there. If I'm not buying a bunch of puts, that would go over there. If I'm mostly selling puts and buying calls, it would be like this, which is kind of more accurate for what I typically do. At least for single options. Then we would need a premium. And then we would need some sort of margin requirement. We would need a loss target. We would need a loss amount. And then we would need a loss amount. I would just call this risk. Then",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 62,
      "start_timestamp": "01:43:05",
      "start_timestamp_seconds": 6185.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=6185"
    }
  },
  {
    "text": "typically do. At least for single options. Then we would need a premium. And then we would need some sort of margin requirement. We would need a loss target. We would need a loss amount. And then we would need a loss amount. I would just call this risk. Then we would need exit date. Then we would need a close price. These are the manual inputs. And again, there's a bit more that I think we can build this out to. But to keep it, what I would consider to be the most important things to start, it's something like this. Joey says underlying price. Sort of. Like you actually don't even really need that technically. I think it's good to have. So this would be ticker price. The only reason I say that is because you can come up with a lot of background ways to find things. But I think in the beginning, it's probably better to have it. So I'm saying pages you. And then like you could put strike price or something, but you don't need strike price. Delta covers that. This is again, just for like trading single options that I'm expecting to hold for a little bit. And then looking to get out. So I'm not looking to build this super robust thing like we have, not that this is super robust, but slightly more robust thing that we have here. Because these are literally really short term occurrences. Like either I'm going",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 62,
      "start_timestamp": "01:44:44",
      "start_timestamp_seconds": 6284.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=6284"
    }
  },
  {
    "text": "for a little bit. And then looking to get out. So I'm not looking to build this super robust thing like we have, not that this is super robust, but slightly more robust thing that we have here. Because these are literally really short term occurrences. Like either I'm going to be right or I'm going to be wrong. And that's about all that's going to go on here. So these are all manual inputs, manual inputs. And then these are at the exit. And then from here, you can calculate the first thing I would do is like cost or entry price. The reason I do entry price instead of cost because we have long and short options. So it's kind of agnostic to that. So it would be entry price. DTE. And again, these are things that are now going to be calculated. So we can be a little more. We can be a little more aggressive with what kind of stuff we track. As long as it's stuff that you're going to look at. So the other thing I would do here is I know those are going to be really small inputs because Delta is a small number. So I can squish those down to give me more room. Because another thing is I don't like having to scroll too much. So I wouldn't want to have a bunch of stuff over to the side that I have to scroll. I would try to format stuff",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 62,
      "start_timestamp": "01:46:37",
      "start_timestamp_seconds": 6397.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=6397"
    }
  },
  {
    "text": "small number. So I can squish those down to give me more room. Because another thing is I don't like having to scroll too much. So I wouldn't want to have a bunch of stuff over to the side that I have to scroll. I would try to format stuff so that it's small and insignificant enough so that I don't have to do that. So we have days in trade, time in trade, then we would have a return on risk. And this is at the beginning. So this is looking at the opportunity itself. Because the other thing that again, I would add on optionally would be here, which is probability of target and then probability of loss target. I'll either do PLT or P loss. And then sometimes instead of probability of target, we could do probability of profit. That Lauren says, how do you find a target? It's a ballpark. So we'll look at an example here together in a second actually so that we could do it together. So we'll have a return on risk, we'll have rowic, we'll have exit cost, we're exit value again to keep it neutral. Then we will have P and L. And then again, the way that I typically would do this is this would be down a little bit like this. And the reason why I do that is so that it's out of the way so that I can do portfolio level summaries at the top. So",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 62,
      "start_timestamp": "01:48:03",
      "start_timestamp_seconds": 6483.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=6483"
    }
  },
  {
    "text": "and L. And then again, the way that I typically would do this is this would be down a little bit like this. And the reason why I do that is so that it's out of the way so that I can do portfolio level summaries at the top. So for example, here what I can do is I would do something like long call, long put, short call, short put, and then I can do that same thing I've shown.",
    "metadata": {
      "video_id": "0qWV5pAcbfA",
      "title": "0qWV5pAcbfA",
      "url": "https://www.youtube.com/watch?v=0qWV5pAcbfA",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 62,
      "start_timestamp": "01:49:47",
      "start_timestamp_seconds": 6587.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0qWV5pAcbfA&t=6587"
    }
  }
]