[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you I sick SA and that jacked up the probability of a Fed rate cut in the near term, it's about the same as what it was prior. What this also tells you is how sensitive the market is to this data. The fact that the market had the update that it did today on essentially no change is really telling. And this also, if you're not reading in between the lines here, if we do see an elevated print of inflation, I fully expect the market to have a pretty nasty visceral reaction. I actually had two different sets of trades primed for today, depending on which way this thing went. And it's simply because I thought whichever way it went, it was likely to give us a pretty strong day up or down either way and then probably into tomorrow, I've taken about half the trade down, but that's still my sentiment. The other thing is I got the McLaren back today and I was doing some things in the engine after bringing it home, getting it reset back up. And because I'm like disgustingly impatient, rather than waiting for the engine to cool off, I immediately start going into the car. So now my hands have these burns all over them. It's always funny to me how as",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=0"
    }
  },
  {
    "text": "the engine after bringing it home, getting it reset back up. And because I'm like disgustingly impatient, rather than waiting for the engine to cool off, I immediately start going into the car. So now my hands have these burns all over them. It's always funny to me how as a grown adult, this, it did even like surprise me. I knew what I was going into and I was just like, yeah, I'm probably gonna burn my hands and I was just like, still did it. This is still a good idea. Taking that back to the broader market, it seems like the market is kind of willingly burning its hand right now. And I think until we get a material change in terms of upside, it just seems like the downside is so much more favored by the broad market and broad market movements. Even the move that we saw today, I would feel pretty confident wagering that if this had gone the other way, that we wouldn't have seen this similar size down move, I think it probably would have been exacerbated to the downside. Now maybe not in cues, tech would probably be a little bit insulated from it, but you probably would have seen a little bit more of a continuation in it is compared to something like, buy. So what this tells me and the way that I position going forward is good news, is okay news, bad news is probably going to be",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 77,
      "start_timestamp": "00:07:25",
      "start_timestamp_seconds": 445.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=445"
    }
  },
  {
    "text": "insulated from it, but you probably would have seen a little bit more of a continuation in it is compared to something like, buy. So what this tells me and the way that I position going forward is good news, is okay news, bad news is probably going to be terrible news. That's my expectation. So it's going to be playing a lot of that kind of visceral short term reaction. We actually talked a little bit about a recent trade. We talked about this on the pro stream yesterday, but to give you a quick insight into that conversation, I discussed a trade in RGTI that's still on. And we spent a while on the stream yesterday discussing the approach of trading reversals. And there's a lot of nuance that goes into it, but it can be really, really lucrative. And I think that the market condition that we're in right now heavily favors that kind of trading. And it's because we have this volatility injection, we have people that are obviously overlavered, we have a ton of emotional movements in markets happening right now on short term positioning and sentiment. That leads to huge opportunity on things like this. Now again, like I was talking about yesterday on that stream, I didn't know it was going to be RGTI. I'm not like some clear, voient dude. I literally looked at quantum computing. I conducted an analysis based on the relative movement between them and then I played the",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 77,
      "start_timestamp": "00:08:47",
      "start_timestamp_seconds": 527.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=527"
    }
  },
  {
    "text": "this. Now again, like I was talking about yesterday on that stream, I didn't know it was going to be RGTI. I'm not like some clear, voient dude. I literally looked at quantum computing. I conducted an analysis based on the relative movement between them and then I played the intraday move, right? And we actually discussed another pro members recent trade in RGTI where they had bought, well, now two days ago, on this down day, which I did not do. And there's a bunch of reasons why I don't do that. My entry was specifically on this day, but all that stuff aside, I wanna just share the broader point from the Patreon stream, which is shifting your approach to suit current market conditions is one of the most effective ways to maintain optimal risk to reward trades. Back to what I was talking about a second ago. I do not think we're in a market condition where positive drift is going to be the story. There still would be some elements of positive drift, I would wager, but based on the movement that we saw today, the market and market participants are kind of showing their hands. And what they're showing is that this is visceral. This is visceral reactions that you're seeing. And that matters because the way that I, and maybe other people might consider trading in these different market conditions very greatly based on that. And again, looking for opportunities and stuff like this.",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 77,
      "start_timestamp": "00:10:06",
      "start_timestamp_seconds": 606.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=606"
    }
  },
  {
    "text": "And what they're showing is that this is visceral. This is visceral reactions that you're seeing. And that matters because the way that I, and maybe other people might consider trading in these different market conditions very greatly based on that. And again, looking for opportunities and stuff like this. So the broad market today, really, really interesting. And I think it was, it told us a lot. I really think it told us a lot. Yo, I cut my nails earlier today. I missed one. What was going on in my brain that I missed a nail? How do you cut nine out of 10 nails? What the fuck? Gonna have to punish myself for that because that's ridiculous. How do you miss a fucking nail? That's literally absurd. Unbelievable. All right. That's hard aside. S and P 500 solid day, cues solid day, small caps. Me, small caps had a me day. They did okay. But there's still in this really ugly consolidation phase down here from essentially the lows that they posted in mid-December. Whereas again, if you take a look at S and P 500, if you take a look at cues, they're still trying to fight this recent trend reversal. I am really sus that they're going to be able to successfully do it. I really am. I want them to. I'm positioned for them to, but I'm super sus on the likelihood and probability that they're going to genuinely. And the reason why I'm",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 77,
      "start_timestamp": "00:11:27",
      "start_timestamp_seconds": 687.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=687"
    }
  },
  {
    "text": "fight this recent trend reversal. I am really sus that they're going to be able to successfully do it. I really am. I want them to. I'm positioned for them to, but I'm super sus on the likelihood and probability that they're going to genuinely. And the reason why I'm so sus on this is, I mean, it's just such a well-defined downtrend. Take a look at the price movement as it started approaching this trend line. And again, the trend lines, they're just fucking lines on charts. Right. It's not dictatorial, but I cannot help but find that interesting. And when I'm conducting trend analysis like this, my disposition is to favor the dominant trend until there is a clear reversal. This is not a clear reversal. If we go back into spy, this is not a clear reversal. This looks like a bit of a recovery within this trend, but until this actually breaks above, you can see the level that I have drawn, 5.9748. It's got to be above that. That's when it actually starts breaking this prior local lower high. It's not done that yet. So that's also why at this point, I still generally favor the downside because it's not given me a reason not to yet. Still, I'm positioned bullish. And the reason why I'm positioned bullish is because I have those leveraged coverage strangles on both the actual portfolio and then the subset that I've been sharing with you guys. And I just",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 77,
      "start_timestamp": "00:13:01",
      "start_timestamp_seconds": 781.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=781"
    }
  },
  {
    "text": "the downside because it's not given me a reason not to yet. Still, I'm positioned bullish. And the reason why I'm positioned bullish is because I have those leveraged coverage strangles on both the actual portfolio and then the subset that I've been sharing with you guys. And I just made some adjustments to the Bitcoin trade, which I can share. I probably just do a video on it like at the end of the week recapping all that stuff. Maybe tomorrow's some shit. I don't know. But I think it's too early to be like, yeah, okay, market looks like it's starting to turn around rallies back on. I genuinely don't think that yet. I think it's way too early to tell. I think we need to see how this plays out. And then I think we need to see how we deal with this local high. Depending on how we deal with this local high, then we can have a conversation of if it's going to just continue a wider consolidation, slash basing. But this so far still is not super healthy. Where did it start the year at? This was the start of the year. So it just finally ticked positive for the year. What's the market up on the year right now? Wapping 0.58 up on the year. Not super solid. So yeah, opportunity, tons of it have to be selective. Lauren says, why is the energy sector doing so well? First of all, really good",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 77,
      "start_timestamp": "00:14:29",
      "start_timestamp_seconds": 869.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=869"
    }
  },
  {
    "text": "just finally ticked positive for the year. What's the market up on the year right now? Wapping 0.58 up on the year. Not super solid. So yeah, opportunity, tons of it have to be selective. Lauren says, why is the energy sector doing so well? First of all, really good observation. Genuinely, the reason why that's a good observation is because part of our jobs as traders is to look for themes within the market and to decide how we can potentially trade them. So what you've just identified is what's called a defensive sector. More often than not, money will rotate into defensive sectors during broader market downturns. It moves away from things with really high PE ratios, which require strong growth in order to sustain the value. And we move into lower PE ratio names, things like energy. So that's exactly what you're seeing. Defensive stocks like that tend to perform much better during broader market downturns. And it's not just energy. There's a couple of other sectors that can get bucketed into that. And you can see that if you conduct some basic trend analysis here, right? So you can see energy definitely is leading the leading the charge, so to speak. But you can also see health care on a relative basis is absolutely showing some strength as compared to some of the other sectors, which are not. Now the other thing that's going on today that's different than before. Also, I realize I don't have",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 77,
      "start_timestamp": "00:15:41",
      "start_timestamp_seconds": 941.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=941"
    }
  },
  {
    "text": "the charge, so to speak. But you can also see health care on a relative basis is absolutely showing some strength as compared to some of the other sectors, which are not. Now the other thing that's going on today that's different than before. Also, I realize I don't have my notepad open to capture the timestamps for this. So my bad, you guys are just going to be SOL on timestamps on this one. Maybe I'll just do it going forward. But I think you can see financials here. And financials are doing super good. And they had a really great earnings release today, which I want to talk about. Dark Mark says the Coke nail. Honestly, this would be, I've never done cocaine. And this would probably be the right amount though on this nail because the nail, I can't have nails that protrude past the finger. Like that's craziness. So this nail is already light years too long. But yeah, this would be a interesting Coke nail. Also really big finger in terms of width. Are you supposed to put it like up your nose? You're do you just sniff it out of your nail? So I wouldn't want to put a middle finger up my nose. I'm already ugly enough. I don't need to start like fucking stretching holes out on my face. So yeah, I don't know about that, man. But we'll see what it can be. Dark Mark says, or if you play guitar",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 77,
      "start_timestamp": "00:16:59",
      "start_timestamp_seconds": 1019.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=1019"
    }
  },
  {
    "text": "wouldn't want to put a middle finger up my nose. I'm already ugly enough. I don't need to start like fucking stretching holes out on my face. So yeah, I don't know about that, man. But we'll see what it can be. Dark Mark says, or if you play guitar and yeah, no need for Coke, I do not play guitar. My best friend does. He tried to get me into it. I am so not interested in music. It's not funny. I enjoy listening to it. Big fan of all different kinds of music. But I really, really, really just couldn't. There's not a fiber in my body that could care at all about playing music. Just don't care. Just don't care. Cool. I respect it. But yeah, I couldn't possibly care less about it. All right. So now we're at 19 minutes and 10 seconds. We already did kind of like a market recap. Let's talk about. We already kind of did. I guess we'll just do a quick sector analysis. I actually talk about the individual sectors because we already started talking a little bit about this. So within the individual sectors, as Lauren looks like pointed out, energy is still doing well. One of the notes about energy, though, is that it's still in a broader downtrend. The reason why that matters for something like XLE is because before we go starting like, oh, shit, this is where the new strength is. It's up strong. It's",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 77,
      "start_timestamp": "00:18:20",
      "start_timestamp_seconds": 1100.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=1100"
    }
  },
  {
    "text": "out, energy is still doing well. One of the notes about energy, though, is that it's still in a broader downtrend. The reason why that matters for something like XLE is because before we go starting like, oh, shit, this is where the new strength is. It's up strong. It's up 10 points. It's up 10. But wait, just says Bitcoin ad, how'd you get a bit that literally the fucking ads are off? Or was it when you joined? I literally haven't completely turned off. There should be zero ads for anybody. I wonder if it still does pre-rolls. That's super annoying. Do you take us as yes, you put your finger as far into your nose as you can before you snore, helps get the helps get to the blood faster. Yeah, then I, yeah, then I fucked that up. I left the wrong nail entirely because yeah, this, I don't, like, I don't even think you can get knuckle deep on that without maybe tearing something. I'm not trying to tear a nostril. This is still a broader downtrend. So we have to wait and see when this challenges this. The time to get into defensive names is when the market starts to roll over. Joe says, what are we talking about? Dude, you gotta, you gotta keep up. If you guys don't know, I have the, I don't know if it's an ability or maybe a mental affliction, but my brain can decisively just swap between",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 77,
      "start_timestamp": "00:19:34",
      "start_timestamp_seconds": 1174.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=1174"
    }
  },
  {
    "text": "is when the market starts to roll over. Joe says, what are we talking about? Dude, you gotta, you gotta keep up. If you guys don't know, I have the, I don't know if it's an ability or maybe a mental affliction, but my brain can decisively just swap between subjects with really very little, very little pause or need for transition. I don't know if that's a good or a bad thing to be honest. It might be a bad thing. But first we were talking about market recap, then we were talking about energy. Before then we were doing a callback to my surprise that I missed cutting a fucking nail, like an absolute imbecile. And then we started talking about doing different kinds of, I don't know if I could say the word on YouTube, I really don't. So then we talked about burning my hands. We've been all over the place. So we're going to get back to the market though because I don't really think anybody gives, I mean, if anybody wants to start to go fund me, to help me compensate for the burn wounds while I was working on the McLaren after I got it back today, I mean, that it sounds like I might need to go fund me. I'm going to try to get through it. But yeah, that would be good. I always find that kind of interesting. There's a bunch of people that are on the internet that are",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 77,
      "start_timestamp": "00:20:49",
      "start_timestamp_seconds": 1249.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=1249"
    }
  },
  {
    "text": "got it back today, I mean, that it sounds like I might need to go fund me. I'm going to try to get through it. But yeah, that would be good. I always find that kind of interesting. There's a bunch of people that are on the internet that are in like the finance space. And they start go funds, go fund me for stuff. And I always think like, bitch, aren't you supposed to don't you have money? Why are you asking people for money? You should have it. You're talking about it. I don't get that. So I just got to jump on that bandwagon, I think, because yeah, I have some slightly annoying minor trivial burns that bother me to literally the slightest degree, especially when I bend my hand like this. So I'll start to go fund me for that. All right. Back to the sectors. So let's actually take a quick peek within the sectors, though I had a sheer curiosity, because there were a couple names within energy that we've stumbled into before that have continued to show strength. Dark Mark says they're long nail habits got the best of them. You people really do it off a nail? I've heard that before, but like, is that actually a thing? I thought that you do like lines or something. Actually off a nail. That's crazy. I don't understand why. I'm like, why off a fucking nail, dude? Where am I going here? I was",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 77,
      "start_timestamp": "00:21:59",
      "start_timestamp_seconds": 1319.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=1319"
    }
  },
  {
    "text": "do it off a nail? I've heard that before, but like, is that actually a thing? I thought that you do like lines or something. Actually off a nail. That's crazy. I don't understand why. I'm like, why off a fucking nail, dude? Where am I going here? I was where I'm trying to go. Dan says so much curiosity about Coke. If you Dan, I don't know how many streams you've been on, but again, I don't know if this is another pro or con about Eric, but I am so curious about everything. I don't fucking know why. I am super curious about everything. It really doesn't matter what it is. I typically am curious about it. Yeah, even that, even when I was in college, and I was being, I did zero drugs in college, because I had a scholarship and I didn't want to lose it. I used to hang out with some friends in a quad next to me, and they were all into drugs. Not like terrible drugs. I don't think I think they mostly did just like pot and whatnot. I used to hang out with them and just learn all about it. It's fucking interesting. The fact that there's a plant that grows that does that, and then people have found a way to ingest the plant and experience different effects from the plant. It's just super interesting to me. Specific parts of the plant. You don't want all of the plant.",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 77,
      "start_timestamp": "00:23:27",
      "start_timestamp_seconds": 1407.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=1407"
    }
  },
  {
    "text": "It's fucking interesting. The fact that there's a plant that grows that does that, and then people have found a way to ingest the plant and experience different effects from the plant. It's just super interesting to me. Specific parts of the plant. You don't want all of the plant. Crazy. Travel says, how did curiosity work for being a marine? Really good. It works really good for being a marine officer. If you're in enlisted marine, it's not good. At least a junior enlisted marine. As a junior enlisted marine, your job seriously is just to shut the fuck up and do what you're told. A lot of that just, it's not that they have no ideas or anything like that, but in the broadest context, young Marines like that, they need to get that part dialed in first before we start turning to them for idea generation and for weighing in on things. As soon as you start picking up NCO and stuff like that, most of us have very open conversations with our NCOs. Even if it's a corporal, because Marine Corps, we treat our corporals with a lot of respect. I don't know now what the new Mar admin that came out that's automatically going to have people promoted to corporal. That might slow that down a little bit. But we treat our corporals as of right now. They're a fucking NCO. So there's expectations here. I think like anything though, curiosity does have to be",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 77,
      "start_timestamp": "00:24:58",
      "start_timestamp_seconds": 1498.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=1498"
    }
  },
  {
    "text": "new Mar admin that came out that's automatically going to have people promoted to corporal. That might slow that down a little bit. But we treat our corporals as of right now. They're a fucking NCO. So there's expectations here. I think like anything though, curiosity does have to be controlled, especially for somebody like me. This is actually why a lot of people that are in the mentoring program or when we talk in the discord, you will hear me re-center you and ask, what are we trying to solve for right now? Because sometimes our natural curiosity can start to pull our attention in different directions that may or may not ultimately lead us towards completing our objective. And it's super important to know that because then you have to mentally bucket what you're doing in different ways. You'll have part of your mental bucket that says, I'm going to spend time learning this because I'm interested in it. And that's secondary. The primary is whatever you're researching and whatever moves the needle towards the actual outcome that you're attempting to get to. That's super, super important. Okay. Now let's take a look at the actual sector performance. And 27, 40 sector performance. What do you notice here? Before I tell you what you should notice, you tell me what do you notice here? There's a couple things that should jump out to you. They should jump out to you, kind of like that dude from the hangover",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 77,
      "start_timestamp": "00:26:15",
      "start_timestamp_seconds": 1575.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=1575"
    }
  },
  {
    "text": "And 27, 40 sector performance. What do you notice here? Before I tell you what you should notice, you tell me what do you notice here? There's a couple things that should jump out to you. They should jump out to you, kind of like that dude from the hangover that popped out of the trunk of that car. It's probably one of the greatest scenes ever. I think there's a gif of it. How do you play this? Yep, here you go. This should jump out like this. We'll stretch us as a naked man is one of Eric's favorite scenes ever. Yeah. Fucking duh. Like Joe, you've known me well enough by now to know that like everything that I do is dominated by dudes, the Marine Court dudes, martial arts dudes, djitsu dudes, car dudes, rugby, dudes, it's all fucking dudes. I think about that actually pretty regularly that I would be in such a better position if I was just straight up gay because I, everything I do puts me around super cool people that do shit that I like. Now I got really fortunate with my wife, very, very thankful, but that was through a dating app. Really thankful for a dating apps. Recess chess equals dudes. chess is also dudes. Great fucking point. That yeah, that's exactly it. That's exactly it. Rudy says, hey, everyone, Eric, do you want to see an indoor pro match in ocean side Friday? I'm honestly not well, well,",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 77,
      "start_timestamp": "00:27:32",
      "start_timestamp_seconds": 1652.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=1652"
    }
  },
  {
    "text": "dating app. Really thankful for a dating apps. Recess chess equals dudes. chess is also dudes. Great fucking point. That yeah, that's exactly it. That's exactly it. Rudy says, hey, everyone, Eric, do you want to see an indoor pro match in ocean side Friday? I'm honestly not well, well, let me, let me, let me keep it a bug. I don't give a flying fuck about, wait, are you playing like what I be hanging out with you or is it to watch you play? Because either of those have definitely interested, but if it's just for her and I to go, I could fuck, I don't give a fuck to watch sports. I have so much other shit to do. A F. Oh shit, that's a tough ass name. A Fio. Oh, hold on. Let me see if I can get this right. A. Oh fuck. A.O. in a phoenix. A. A. Jesus. This one is kicking my ass. Normally, I can at least a non-seate. Hold on. A. E. F. is a. F. O. I. N. O. N. A. F. O. N. A. F. O. N. A. F. O. N. A. F. O. N. That's my take. Just like that. That's my best possible guess. If anybody knows how to actually say that, I would love to know, again, general curiosity, because I don't fucking know. Lauren says, Jotato, I couldn't figure out if I was in or not. Apparently, I missed the questions of some shit.",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 77,
      "start_timestamp": "00:29:29",
      "start_timestamp_seconds": 1769.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=1769"
    }
  },
  {
    "text": "Just like that. That's my best possible guess. If anybody knows how to actually say that, I would love to know, again, general curiosity, because I don't fucking know. Lauren says, Jotato, I couldn't figure out if I was in or not. Apparently, I missed the questions of some shit. Dude, you're so lucky, Lauren, that I'm the one that caught you because I have a few mods that helped me that are awesome. But we have such a little load tolerance for like lazy entries that don't pay attention to simple instructions. Like if you can't follow simple instructions, that discord's not for you. That's just the facts. But I also know that discord is really weird to a lot of people. So anyways, I saw that you joined and I saved you because you did what most of the fucking bots do, which is just drop a random fucking thing, which is hilarious. Lauren says, there were no instructions that I saw. Are you kidding me right now? You would have had instructions DM to you. And then in this section here, in this section here, where it says start here, the idea behind start here is you start here. So then when Lauren decided to join, this is an adm. Lauren, I'm just saying you would have got double tapped. Yeah, definitely don't DM. Definitely don't DM on discord. Let take a look. Take a look at Lauren's intro. Look, the fucking bot. This is a straight,",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 77,
      "start_timestamp": "00:31:11",
      "start_timestamp_seconds": 1871.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=1871"
    }
  },
  {
    "text": "start here. So then when Lauren decided to join, this is an adm. Lauren, I'm just saying you would have got double tapped. Yeah, definitely don't DM. Definitely don't DM on discord. Let take a look. Take a look at Lauren's intro. Look, the fucking bot. This is a straight, this is straight bot behavior. 100 bot behavior did, did not trust at all. Period. But I knew who it was. So you got to pass Lauren. Like I said, it's another weird, Tism thing about me. But I typically am way more lenient with females than males, don't know why I just them. Just kind of how it goes. And I realized we had somebody at the join. All right. Let's get back to business. There's actually something important that I do want to show you guys from here. Now I have to update this time again, because we still haven't done it because I'm fucking unhinged as fuck. And let me get caught up on the chat because I already asked you guys what you think or like what you saw. I don't actually see we might have been distracted. So what do you see here? There's two things. The first thing. If you look at the overwhelming majority of sectors, and you look at the percentage of them above relative moving averages, what do you see? There's some really, really tradable things going on right now. One of the things you see is staples. Staples is trying",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 77,
      "start_timestamp": "00:32:36",
      "start_timestamp_seconds": 1956.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=1956"
    }
  },
  {
    "text": "things. The first thing. If you look at the overwhelming majority of sectors, and you look at the percentage of them above relative moving averages, what do you see? There's some really, really tradable things going on right now. One of the things you see is staples. Staples is trying to turn, but it can't. It's still struggling so hard. The other thing that you see is energy is showing really strong short-term momentum. You're seeing financials now showing really strong short-term momentum. You're seeing industrials doing the same. The way that I'm identifying this is by looking at the difference between longer term moving averages and shorter term moving averages. Because if companies are below longer term moving averages and above, if they're below longer term moving averages and above shorter term moving averages, it means that they're starting to turn over. They're starting to rotate. This typically prevents a really short-term trading opportunity because I still don't think energy looks super good long-term because it's still in a broader downtrend. It's just an objective fact, but it does look good from a short-term trend following perspective. For sure. So let's take a look within energy and staples, specifically in staples. There are a few things we should look for in staples. The first thing we should look for in staples is what's dragging it down as an index. The second thing you should look for in staples is what is performing well despite the broader sector sucking wind.",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 77,
      "start_timestamp": "00:34:37",
      "start_timestamp_seconds": 2077.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=2077"
    }
  },
  {
    "text": "in staples. There are a few things we should look for in staples. The first thing we should look for in staples is what's dragging it down as an index. The second thing you should look for in staples is what is performing well despite the broader sector sucking wind. So between those two things, you can really clean up a lot of your exposure and find things that specifically hit what you want it to hit. That's one of the beautiful parts about building a diversified portfolio. Not only can you create diversification through things like strategies, time frames, long premium, short premium, but you can also start to find ways to diversify by finding strength within underperforming sectors, by finding weakness within underperforming sectors, or vice versa, finding weakness within outperforming sectors. I typically am less prone to fade those, simply because a rising tide does lift all boats and the way that the market moves to the downside is very different than the way it will behave to the upside. But this here is super telling. So let's take a quick peek within staples and let's see what we can find out. Let's go on a little investigation, shall we? So what's cool about this is it allows me to take a look at the price performance over various time frames and for all of the individual components of the sector. And the first thing I'm doing is I'm saying, okay, what's been up over the last",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 77,
      "start_timestamp": "00:35:59",
      "start_timestamp_seconds": 2159.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=2159"
    }
  },
  {
    "text": "investigation, shall we? So what's cool about this is it allows me to take a look at the price performance over various time frames and for all of the individual components of the sector. And the first thing I'm doing is I'm saying, okay, what's been up over the last year? And I can see things like Walmart. What is this? What's K? Is that Kmart? What is K? Helen, oh Kellogg's. I was like, Kellan Nova. Kellogg's ain't done shit. God, decent ball though. Not liquid enough. It looks interesting from a from a vault perspective, but not exactly it. Costco doing well. Proger doing well. Philip Morris doing well. Mozec doing well. That's interesting. I wouldn't have expected those two to be some of the stronger performers. But take a look at this, right? If we take a look at something like Philip Morris, take a look at their 52 week performance up 24. Now we know within staples, the sector itself is struggling. So what's leading us down the most over the last four weeks to like one to four weeks, depending on the trading time frame that you're looking at? Take a look. Philip Morris is down 6 over the last month and 2.3 over the last five days. So this could be something that's starting to show weakness and roll over within a broader week sector. Aha. Interesting. In it. So this becomes a short opportunity. The reason why this becomes a short opportunities because",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 77,
      "start_timestamp": "00:37:38",
      "start_timestamp_seconds": 2258.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=2258"
    }
  },
  {
    "text": "down 6 over the last month and 2.3 over the last five days. So this could be something that's starting to show weakness and roll over within a broader week sector. Aha. Interesting. In it. So this becomes a short opportunity. The reason why this becomes a short opportunities because it's in an overall underperforming sector. It as itself is starting to rotate over autonomously. And there are other names that are still doing moderately okay within this sector. But this is not. This is how you find opportunities with in sectors based on broader market performance to look for strength, to look for weakness. Rudy says, Paulo, why is your fucking name Rudy on here? It's so confusing. Will you be doing any paper trading anytime soon? And no, I'm going to be joining a semi-proteam this year. So I'll keep you updated for those games. Yeah, I would much rather watch you play, to be honest. I can at least like heckle. I love heckling. I love talking shit. So I would love to heckle you. But yeah, to like just go heckle a bunch of random people, not interested in that, but really appreciate the offer. And when you say any paper trading, you mean for me or you mean for other people because right now the the Patreon, they already that we already started like an annual long paper trading challenge. We're not balls deep into it yet because it's early, but we are in it.",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 77,
      "start_timestamp": "00:39:17",
      "start_timestamp_seconds": 2357.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=2357"
    }
  },
  {
    "text": "when you say any paper trading, you mean for me or you mean for other people because right now the the Patreon, they already that we already started like an annual long paper trading challenge. We're not balls deep into it yet because it's early, but we are in it. So yeah, that's already going on. Um, Paul says Mo is Altria. No, oh yeah, you're right. Mosaic is MOS, my bad. Yeah, this is Altria, my bad. I was thinking of Mosaic, which is MOS. Let's keep going, Clorox. So what I'm doing now is I'm trying to figure out which of these are starting to show stronger short term price action like KO. TSN maybe, but I wouldn't trade it that way. WBA WBA is crushing it. So wow, that's super ugly. That is not good. But decent earnings, but came in at 51 cents is compared to 37 cents. That's crazy. This would be okay for short puts, I think. The main reason is just because it looks like it has a floor priced in right around nine and eight. So you can sell puts then if we're challenged, you can roll them, roll them until you get down to the proverbial floor. That's kind of the game plan. I am doing something similar in a volunteer. So in volunteer right now, I'm short options. Normally, I would trade something like this from a breakout perspective, trying to use some long options, gain some leverage, but I'm",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 77,
      "start_timestamp": "00:40:48",
      "start_timestamp_seconds": 2448.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=2448"
    }
  },
  {
    "text": "get down to the proverbial floor. That's kind of the game plan. I am doing something similar in a volunteer. So in volunteer right now, I'm short options. Normally, I would trade something like this from a breakout perspective, trying to use some long options, gain some leverage, but I'm trading it a very different way right now. I'm trading it for short premium. The reason why I'm doing that is because it's already had a pretty big down move. I still think long term, the stock itself is probably super well positioned. The game plan for this is to start with some cash secured puts. Then if I need, I would turn into a coverage triangle. I would take shares on this happily. So even though I'm trading this as naked short puts, I'm sizing it as if it were cash secured puts because that might become an eventuality for it. We will see. Reece says, do you not trust Nvidia in other upmobes in this market? I think we talked about that a bit in the beginning. So I won't rehash that too much, but I think it's too early to tell. That's the cliff notes. I think even though the market has had an upmove, it's still in a downtrend. So until it clearly breaks this downtrend in as above here, it's still in a downtrend until it's not in a downtrend. And it's not in a downtrend until it breaks above here. That's kind of the",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 77,
      "start_timestamp": "00:42:31",
      "start_timestamp_seconds": 2551.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=2551"
    }
  },
  {
    "text": "even though the market has had an upmove, it's still in a downtrend. So until it clearly breaks this downtrend in as above here, it's still in a downtrend until it's not in a downtrend. And it's not in a downtrend until it breaks above here. That's kind of the in and out of it. So from a positioning perspective, I'm not like taking down coverage triangles that I have in the leverage ETFs and stuff. They're just still lightly offered. So the coverage triangle portfolio as it sits right now, I am 44, 45 utilized in TQs. I am 48 utilized in Upro. I am 64 utilized in IBIT. And I am 54 utilized in GameStop. These are for the coverage triangles that I'm essentially reporting out to you guys on. Most of these are subsets of larger positions that are in the rest of the portfolio. So the scale is about the same, but meeting in terms of the utilization. So most of them are really light. The only thing that has any sort of decent exposure right now is IBIT. And I actually think it might be time to add a little bit more here. I just took some short puts down today. And I probably need to add a couple more tomorrow. So that will be the game plan. And this is also another coverage triangle. But I mean, this thing has massive call open interest, especially for an index ETF like this. That's like really,",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 77,
      "start_timestamp": "00:43:52",
      "start_timestamp_seconds": 2632.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=2632"
    }
  },
  {
    "text": "took some short puts down today. And I probably need to add a couple more tomorrow. So that will be the game plan. And this is also another coverage triangle. But I mean, this thing has massive call open interest, especially for an index ETF like this. That's like really, really, really strong speculative upside positioning. That's exactly what that is. 39 of the transactions today were buck calls. So that's people prospecting upside. So right now the position as it sits, I will tell you, is still a thousand shares at 5455. So yeah, wouldn't buy out right here no reason to. And then I have two tranches of short puts. I have one tranche, which is a three lot of the 49s in 21 fed. Those were out for 216. I mean, those have to come down soon. Unfortunately, because I've only been in those trades, that trade for seven days. And there's already only a 1.18 left to go. So it already took essentially half the value out of it. So that will probably have to be rolled up to regain some sensitivity there, which is essentially what this next trade is, which is a two lot of the 52s. Those went on today. And those went on for 1.88. And you know, how that goes is soon as you put on any sort of short term or short premium, really as soon as you put on any trade in the near term, the market is immediately",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 77,
      "start_timestamp": "00:45:16",
      "start_timestamp_seconds": 2716.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=2716"
    }
  },
  {
    "text": "of the 52s. Those went on today. And those went on for 1.88. And you know, how that goes is soon as you put on any sort of short term or short premium, really as soon as you put on any trade in the near term, the market is immediately going to move against you. That's just something that always happens because fuck you. That's I think the, I think that's a cliff notes version of what that happens. I think the market has a way of being like, you know, fuck this guy or girl, it's equal opportunity. Everybody can get fucked here. So yeah, boy. Mateus. What up? What up? Mateus? Thank you Eric for the quality information you provide. What do you think about doing a coverage triangle with Palantir with IVR of more than 80? Well, first thing is I don't know if that's following when I mentioned the position that I have, but I already talked about the position that I have and why I have that. The implied volatility rank is 51 the implied volatility percentiles 95. So it's actually exceedingly volatile right now. Now, this is not the kind of thing I typically would base a position around right now. And it's because it's, it needs, it needs to chill out. What I mean by that is before we trade something like a coverage triangle, a coverage triangle requires something to be going up. That's the primary profit mechanism, bullish price movement. And",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 77,
      "start_timestamp": "00:46:34",
      "start_timestamp_seconds": 2794.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=2794"
    }
  },
  {
    "text": "would base a position around right now. And it's because it's, it needs, it needs to chill out. What I mean by that is before we trade something like a coverage triangle, a coverage triangle requires something to be going up. That's the primary profit mechanism, bullish price movement. And right now, objectively speaking, this thing is not going up. So it's not displaying bullish price movement. So I wouldn't start entering via long shares here, just based on my approach. I would wait until it starts breaking above now near-term resistance stuff like this. And you can see, funny enough, that I've actually been following this down move down and trying to figure out where does it start to slow down? Where does it might look favorable for some sort of entry from a long equity perspective? Because I do think, again, longer term, Palantir. So a big part of that question, it's Matias, Matias would be dependent on your holding duration. If you're trying to trade something shorter term and you're trying to trade this to the upside, I call it catching a falling knife. I don't think this wouldn't be my game. And it's just because there's way better looking stuff out there, like there's no reason to settle for something that looks like this when there are things that are performing really well right now. If you want to trade something short term directionally to the upside. Now, the position that I have on obviously is",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 77,
      "start_timestamp": "00:47:46",
      "start_timestamp_seconds": 2866.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=2866"
    }
  },
  {
    "text": "way better looking stuff out there, like there's no reason to settle for something that looks like this when there are things that are performing really well right now. If you want to trade something short term directionally to the upside. Now, the position that I have on obviously is completely different. It fits into the portfolio differently with a completely different thesis. So that may or may not apply to you. So yeah, that's the general idea. Wouldn't I wouldn't personally do a coverage triangle right now? I have cash secured puts out that I'm treating as naked puts will convert to cash if I need to. But I'm not really expecting to have to do that. But I'm also not expecting Palantir right now to show a whole lot. It's just in this weird no man's land right now. It's going to have to consolidate for a little bit. Find its feet under it. It's always important to remember markets can slide down much more effectively than they climb up in general, especially for bigger stocks. The bigger the stock gets the more difficult it becomes because more of its float ends up being locked up. So if we take a look at Palantir and we take a look at institutional ownership 48 so almost half of Palantir is owned by institutions. That's a significant amount when you compare that to some of the other names that we've been talking about. What the hell is the one with",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 77,
      "start_timestamp": "00:49:07",
      "start_timestamp_seconds": 2947.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=2947"
    }
  },
  {
    "text": "we take a look at Palantir and we take a look at institutional ownership 48 so almost half of Palantir is owned by institutions. That's a significant amount when you compare that to some of the other names that we've been talking about. What the hell is the one with the RGTI? I think that's it. The one that I was just trading RGTI. This one 16.7 and 7 between institutional insider. You see the difference. Much much much more free float. That's not locked up by big institutions and whatnot. So for something like Palantir, there's not a whole lot of this float floating around right now because a lot of it gets locked up. I still think that longer term that's good. That means that institutions are super interested in this and they are in this for a fucking reason. They know how to make money. So I think in the broader perspective, it's good. But I think in terms of a just shorter term price movement perspective, it's not as good because it's probably going to have to consolidate a bit before you're going to get new money flowing into it. So not an entry right now for a covered string goal outright. This seems like, okay, the least of my perspective obviously because I have the position on for short puts. And that's what the expectation of rolling and managing if needed. And then ultimately taking on shares if needed. James Airston. That's a cool last",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 77,
      "start_timestamp": "00:50:13",
      "start_timestamp_seconds": 3013.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=3013"
    }
  },
  {
    "text": "for a covered string goal outright. This seems like, okay, the least of my perspective obviously because I have the position on for short puts. And that's what the expectation of rolling and managing if needed. And then ultimately taking on shares if needed. James Airston. That's a cool last last name. What's your total return in your trading career? My compound annual growth rate after the completion of last year is 31.63. The reference compound annual growth rate, comparatively, is for the SP 500 in that time frame is 11.4. So about three times just shy of three times SP return. Yeah. Now, one important note on that though is the last two years have skewed that a lot. That's to the upside. I've had a really, really, really good last two years. And I mentioned that because if I get rid of those two years, and I always mention this because I think it's important for people to know by just this really fast. And instead, we cut it at the end of 22. So we need to go to here. Nope, that's not right. That's not right. We need to go to here. And it's 20.4. So the last two years have been huge. The last two years literally have raised my 18-year compound annual growth rate by 11 fucking points. So I mentioned it because very, very skewed. It's a skewed metric. I think a fair assessment of like my performance as a trader, I would",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 77,
      "start_timestamp": "00:51:28",
      "start_timestamp_seconds": 3088.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=3088"
    }
  },
  {
    "text": "the last two years have been huge. The last two years literally have raised my 18-year compound annual growth rate by 11 fucking points. So I mentioned it because very, very skewed. It's a skewed metric. I think a fair assessment of like my performance as a trader, I would feel really, really comfortable saying something like like 22, 24 compound annual growth rate, like that, something like that. But the last two years have been super, super good. Fortunately, but super, super good. James says, do you primarily do the wheel? I do not. I do not primarily do the wheel. I actually just about never do the wheel. I have a series of different strategies that I tend to run comparatively. Let me find this video. This video goes through my general approach to my general strategies. But I essentially never trade the wheel. The wheel has a lot of issues that I think always sound good in theory until you experience them. And that doesn't mean the wheel is bad. It just means that there are better things out there in my opinion. And it's why I don't really trade it. The coverage strangle, for example, is just way, way better than something like the wheel almost, like, almost entirely. I can find very few instances where I would be like, ah, fuck, I wish I had the wheel on right now as compared to the coverage strangle. I just about never feel that way. So I",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 77,
      "start_timestamp": "00:53:01",
      "start_timestamp_seconds": 3181.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=3181"
    }
  },
  {
    "text": "just way, way better than something like the wheel almost, like, almost entirely. I can find very few instances where I would be like, ah, fuck, I wish I had the wheel on right now as compared to the coverage strangle. I just about never feel that way. So I think it says a lot about the difference in the strategies. But part of this also is just a personal preference, right? Like, what do you like? What do you trade? And that's finding things that match up well for that is really good. I have a request. This is like the easiest request for me to satisfy because this is probably one of the hottest videos that you can imagine in your life, which is why the gang is always so excited to take a look at it. This video right here, which is about paper trading. And so I launched this video on 21 September as 492 view. Oh, God. It is like the one of the worst performing videos on planet earth. It's unbelievable. James says I was also wondering, hold on, I missed the first part. James says, would we be able to go over BLK as a short earnings risk premium play? Let's take a look. Be okay. Okay. Okay. Had a slight beat. Look at what is this 5631. BLK earnings analysis. Let's see. It looks decent. Like, that's one that I wouldn't. It looks like it might not have worked, but it looks",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 77,
      "start_timestamp": "00:54:46",
      "start_timestamp_seconds": 3286.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=3286"
    }
  },
  {
    "text": "as a short earnings risk premium play? Let's take a look. Be okay. Okay. Okay. Had a slight beat. Look at what is this 5631. BLK earnings analysis. Let's see. It looks decent. Like, that's one that I wouldn't. It looks like it might not have worked, but it looks decent. I'm signing into O-Rats right now because it has a couple other tools that I like to look at for this. But as you guys know, we have to go through the whole verification process, get the fucking email, send in a DNA sample before they will let me, let me log in. Let's see. So let's take a look at things. You okay? Yeah. I mean, this looks fine. I entered a short earnings risk premium position on my paper challenge. Wait, PCT. What the fuck is PCT? Do you mean PTC? Do you mean the paper trading challenge? Do you mean something else? Anyways, yeah, this looks fine. In retrospect, the IV over HIV hasn't been that large. It's sufficient. 1.4. Yeah. I think it's completely reasonable, James. The fact of the matter is, when you trade earnings, it is literally as a numbers game. We can't look at one instance and be like, ah, fuck this one didn't work out. Let me go through and see why I shouldn't have done this. Which is not how it works. This, in general, looks fine to me. I personally would have came into it for sure with a",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 77,
      "start_timestamp": "00:56:10",
      "start_timestamp_seconds": 3370.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=3370"
    }
  },
  {
    "text": "look at one instance and be like, ah, fuck this one didn't work out. Let me go through and see why I shouldn't have done this. Which is not how it works. This, in general, looks fine to me. I personally would have came into it for sure with a positive skew, meaning I would have either been lighter on the short calls, or I would have been skewed on the deltas, right, amount of ratio, whatever you want. But the reason for that is if we look across its past earnings profiles, it clearly, when it goes to the upside, that's where it's had its beats. I've seen zero beats to the downside. So it stays within bounds to the downside. So yeah. I mean, I think that this is completely reasonable. It's just a fucking numbers game. So I think the analysis in terms of tracking implied compared to realized is fine. I think the trade itself is probably fine. But yeah, I mean, it just had a bigger move than expected, which is going to happen. That's why that risk premium is there. Came in at, well, what did it open at? That's the important part. Opened here at 1020. So what had what? Like a five, a 5 move or something like that? 5 when it was expected at 3.6. So yeah, that's just a small loss. And then how we go on to the next. James says, thanks. This is my first loss from a",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 77,
      "start_timestamp": "00:58:20",
      "start_timestamp_seconds": 3500.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=3500"
    }
  },
  {
    "text": "here at 1020. So what had what? Like a five, a 5 move or something like that? 5 when it was expected at 3.6. So yeah, that's just a small loss. And then how we go on to the next. James says, thanks. This is my first loss from a short earnings risk premium perspective. So it's curious. Yeah, it literally is just a numbers game. It's straight up a numbers game. So on an average earnings series, you can typically get maybe one 200 trades on. And that's if you're trading at size, so you need to find things that are a little more liquid. If you're trading smaller, you can probably get more than that. Out of that, you would expect to win over 50 of the time, typically closer to like 65 plus. But you have to get a bunch of them on. Like that's just the way you have to get a bunch of them on. James Erison says, can the wheel make 50 or 80 in one year? Sure. Can it? Sure. Is it probable? No. But can it? Absolutely. The difference between like what's possible and what's probable? Very important differentiation. In the markets, there's the sky is the limit. There's so many possibilities joking aside. Realistically, the possibilities genuinely are just about limitless. It's kind of open-ended. But there's a difference between what is possible and what is probable. One of the biggest issues that the wheel might have is capped profit potential.",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 77,
      "start_timestamp": "00:59:37",
      "start_timestamp_seconds": 3577.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=3577"
    }
  },
  {
    "text": "there's the sky is the limit. There's so many possibilities joking aside. Realistically, the possibilities genuinely are just about limitless. It's kind of open-ended. But there's a difference between what is possible and what is probable. One of the biggest issues that the wheel might have is capped profit potential. So the ability to make 50 to 80 when the primary profit mechanism of the wheel is stock going up, that's a problem because we're capping the upside. So if you modify the wheel and at least trade the short premium at a ratio, that's your first step to make it more likely. And then the second step is you have to be really good at picking stocks. Like what that essentially says, James, when somebody says like, can the wheel make 50 or 80 in a year? Really, all that means is can I find a stock that returns greater than 50 or 80 like that's literally all it is. Can I find a stock that makes more than 50 or 80 a year? Yeah, that's the that's the basis. Joe says not making better than 50 due in the wheel unless you're investing in risky underlying or lucky. Yeah, I actually don't necessarily disagree. I don't necessarily disagree, but I also don't fully agree because it's entirely dependent on the skill, right? I can tell you by the way, James is looking at it, it's insanely improbable, right? Because James is looking at it from the prospect of",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 77,
      "start_timestamp": "01:01:02",
      "start_timestamp_seconds": 3662.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=3662"
    }
  },
  {
    "text": "Yeah, I actually don't necessarily disagree. I don't necessarily disagree, but I also don't fully agree because it's entirely dependent on the skill, right? I can tell you by the way, James is looking at it, it's insanely improbable, right? Because James is looking at it from the prospect of trying to sell his way to hit that metric. The probability of selling your way, meaning selling puts and getting all the way through to the end of the year and achieving that is, I don't want to say it's zero, but it is super improbable. And it's because you have capped profit potential. So what's happening? That's the nature of selling puts. You are exchanging a higher probability outcome for a lower severity reward. So the fact that when you see something like at the money puts in Tesla being at 7, that's what we call Goldilocks analysis. We're too focused on the puts being at 7, also, fun fact, as earnings coming up. So there's probably a reason why we see puts trading so richly. But when they are trading so richly, that's the market telling you that it's expecting a move. So what ends up happening is eventually you get stuck because the move eventually will roll over, like it always has an everything. We don't know when it is, but people are like so stoked with Tesla with where it's sitting right now, rightfully so it's done well. But if we zoom out a much longer",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 77,
      "start_timestamp": "01:02:27",
      "start_timestamp_seconds": 3747.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=3747"
    }
  },
  {
    "text": "eventually you get stuck because the move eventually will roll over, like it always has an everything. We don't know when it is, but people are like so stoked with Tesla with where it's sitting right now, rightfully so it's done well. But if we zoom out a much longer term timeframe, you can see it's now literally just now in the last two months recapturing the highs from late 21 early 22. It's just now recapturing these highs. So if you get caught during one of these bad paths, you're fucked. It's just not happening. So yeah, the probability of selling your way there like that is about zero. It's not impossible, but you would essentially have to not lose and have a really, really fortunate path in front of you. James says, I think it's also really important to consider the risks. The way you're phrasing Tesla puts, 7, makes me wonder if you're looking at specifically for the absolute return instead of risk adjusted bingo. James is on it. This is I can tell in James also really good on you. That's the cool part about doing these, right? Is I can see the various viewers are starting to understand what Goldilocks analysis is in how to avoid it because James, what you're picking up on there is exactly what's happening. Correct. James says, is wheel on SPX a good retirement strategy for income? SPX? No, you can't wheel the SPX. Part of the wheel is taking",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 77,
      "start_timestamp": "01:03:49",
      "start_timestamp_seconds": 3829.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=3829"
    }
  },
  {
    "text": "starting to understand what Goldilocks analysis is in how to avoid it because James, what you're picking up on there is exactly what's happening. Correct. James says, is wheel on SPX a good retirement strategy for income? SPX? No, you can't wheel the SPX. Part of the wheel is taking the underlying on, taking the shares on from the underlying. Can't do it in SPX. There's no underlying. James says, spy. That could be, it depends on your goals, right? Depends on how much money you're trying to make and what you're trying to do. And it also depends on what income means to you. For a lot of people, they trade the wrong way when it comes to this concept of income. The way we think about income is kind of broken. And when people say income, we tend to think selling strategies that will pay us out on a consistent basis. Well, that's in my opinion, a broken way to look at income for trading. I think a more effective way of trading for income is looking more specifically at what you need and how you get there in terms of overall returns, not what strategies are being used. The reason for that is because, once I let me update this, analyzing the wheel and trading for income. The reason for that is a lot of times when we sell premium to try and make income, it works until it doesn't, then the income is gone. A great",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 77,
      "start_timestamp": "01:05:10",
      "start_timestamp_seconds": 3910.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=3910"
    }
  },
  {
    "text": "used. The reason for that is because, once I let me update this, analyzing the wheel and trading for income. The reason for that is a lot of times when we sell premium to try and make income, it works until it doesn't, then the income is gone. A great example of that is if we go back and we take a look at SPI. And if you take a look at attempting to sell premium through pretty much this entire time frame, if you're selling puts as part of your income strategy, you're getting torn up to the downside. So then your income is now being tied up in rolling your trade because again, we cannot realize the credit received from a short put because it's tied to an open trade. So let's take a quick look at what, damn, let's take a quick look at what this might look like. So let's just zoom in on this section here. Now, if I sold to open one put at a dollar during this time frame, my cash and sweep is going to go, I don't know, I did a five, that was really dumb. It's going to be plus 100. My net lick is an inch. My net lick hasn't changed because it's tied to an open trade. So I have 100 sitting in my cash and sweep. You could take that out if you want, but you're going to have a fucking problem because let's do this. Let's",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 77,
      "start_timestamp": "01:06:34",
      "start_timestamp_seconds": 3994.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=3994"
    }
  },
  {
    "text": "100. My net lick is an inch. My net lick hasn't changed because it's tied to an open trade. So I have 100 sitting in my cash and sweep. You could take that out if you want, but you're going to have a fucking problem because let's do this. Let's say your cash and sweep is just this 100 and you're like, oh great, I have 100. Let me take that out, go grab gas. So then I withdraw. 100. And as I'm withdrawing 100, this giant legged abomination from the Paleolithic era or the Pettedullic era, hard to say which one. That looks like this. And you guys already know that they're dripped out with diamonds. And then I think now we've actually even upgraded to a silver watch and maybe some platinum grills. So we need that 100 because we're going to go, we're going to go grab some gas. And so we take this 100 out. So CNS now is at zero. Net lick is still unch unchanged. Okay, so now let's fast forward time. Now during this movement, our put got challenged. Our one put, we have to close it for 3. So then where is this money? We have to produce 300 to close this trade. Your cash and sweep doesn't have it. So now you're either going to go on margin and borrow the money from your bank or from your broker for a daily yield or you're going to have to liquidate other",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 77,
      "start_timestamp": "01:08:09",
      "start_timestamp_seconds": 4089.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=4089"
    }
  },
  {
    "text": "this money? We have to produce 300 to close this trade. Your cash and sweep doesn't have it. So now you're either going to go on margin and borrow the money from your bank or from your broker for a daily yield or you're going to have to liquidate other holdings to create cash and sweep to then be able to pay this 300. That's got to come from somewhere. So this is the problem when people have this fairytale idea of trading for income. The way that I talk about trading for income is essentially trading, making a bunch of money and then saving so that you have at least one year. If not two full years of expected monthly expenses that are padded. And then all we do is trade in the near term and pay back our surplus that's two years of buffer. If you're trying to live off this spoon to mouth, it is almost destined to fail. And it's because you can't take the fucking money out because you need it because the trade. The way that we manage this trade is either by rolling it which you have to produce the money in order to be able to roll it or by taking assignment. And if you go to take assignment, you have to have the money somewhere to take assignment unless you're going to go on margin. So James says, couldn't you just wait until the cycle expires before taking money out? Yeah,",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 77,
      "start_timestamp": "01:09:54",
      "start_timestamp_seconds": 4194.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=4194"
    }
  },
  {
    "text": "to be able to roll it or by taking assignment. And if you go to take assignment, you have to have the money somewhere to take assignment unless you're going to go on margin. So James says, couldn't you just wait until the cycle expires before taking money out? Yeah, that's exactly it. So then that's the longer term idea. But then that also means that there will be some periods where you don't get to take any money out. Because again, let's say this, let's say this exact scenario happens and you had 0 in your cash and sweep. Guess what? You still need 300. You have 100 of 300. You still need 200 more dollars. That's not here. So again, it goes back to this. Either we're going to go on margin, either we're going to liquidate, or we're going to add money into the account to make us whole to be able to make this transaction, to roll this put out, to close the put if you want, whatever it is you choose to do with the put rolling or closing it. The same thing. The only difference is if it's tied to an opening trade, but you need the fucking money. It's not here. So even if you wait to take your 100 out, it doesn't fix the problem. You have to have enough money sitting in the account. So the easiest way to circumnavigate that is to not need the credit that you're attempting to",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 77,
      "start_timestamp": "01:11:35",
      "start_timestamp_seconds": 4295.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=4295"
    }
  },
  {
    "text": "you need the fucking money. It's not here. So even if you wait to take your 100 out, it doesn't fix the problem. You have to have enough money sitting in the account. So the easiest way to circumnavigate that is to not need the credit that you're attempting to collect and give yourself a buffer. So that then, if you do need to roll this out, you already have your income because you saved it out for two years. It's still in the account. You're still using it. But then you can roll your trade a couple times. I still take my monthly income for four months because I need to live. I'm living off my expenses, but now my 24 month buffer is down to 20 month buffer. So now I need to start blessing that back up. When the trade eventually unwinds, then maybe you can start blessing it back up through other trading activities. But once the trade eventually unwinds typically when you're rolling like this, you're not collecting a bunch of credit even though you're tying money up for months at a time. So even in the scenario that you eventually get out of this unscathed, meaning your big loss that's been rolled a bunch of times is flattened out. You don't have a bunch of money after those three months. It's not like you made three months worth of income during those rolls. It doesn't work like that. So then you're behind and you",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 77,
      "start_timestamp": "01:12:52",
      "start_timestamp_seconds": 4372.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=4372"
    }
  },
  {
    "text": "unscathed, meaning your big loss that's been rolled a bunch of times is flattened out. You don't have a bunch of money after those three months. It's not like you made three months worth of income during those rolls. It doesn't work like that. So then you're behind and you have to find ways to accelerate. James says, I don't understand why we're going on margin if we have the cash sitting in our account to purchase the underlying. Yeah, you wouldn't go on margin in that case, provided that you do have the cash and it's sitting in your cash and sweep. It's not been taken out. Yeah, for sure. That's completely fine. What I'm explaining is the common understanding of trading for income and the common understanding is that we take this credit. We sell something for a dollar. We get the 100. I'm just using 100 for an example, obviously, but then we take the 100 and it creates a litany of different issues. Even now, if you have the position cash secured, let's clear all this out and let's talk about the problem with that. If the position is cash secured and you got in to SP 500 here when it was at, let's call it 450. I'm drawing this with the mouse. Well, what happens until essentially here, your trade is negative and it's negative for this entire duration. Where's the income? You now have a period from May of April, May of 22 until",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 77,
      "start_timestamp": "01:14:08",
      "start_timestamp_seconds": 4448.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=4448"
    }
  },
  {
    "text": "SP 500 here when it was at, let's call it 450. I'm drawing this with the mouse. Well, what happens until essentially here, your trade is negative and it's negative for this entire duration. Where's the income? You now have a period from May of April, May of 22 until July of 23. It's about a year where this is producing about 0 in income. Cash secured. It's great. You have the shares. It's great. You have no fucking income from it. Then we might say, well, we could sell calls against it. How much are we going to get for those calls when our basis is 450 and the underlying is trading 100 below that? Let's see. We go out 37 days. We go 100 out of the money. We need to pretend our basis is 692. Let's add a bunch more of these. 695. You get one and a half pennies for your 21 Feb 37 days to expiration. 10.5. Pretty sick, eh? What are you going to do with all the money? Sometimes that's the hardest part about trading, to be honest, is figuring out what you're going to do with all the money you've made. In this case, you have a big decision to make because we have a 1.50. Don't forget we do have to pay commissions on that. Maybe you walk out with a dollar, but you've got to be like, damn, what the hell do I spend this entire dollar on? Obviously, fucking",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 77,
      "start_timestamp": "01:15:22",
      "start_timestamp_seconds": 4522.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=4522"
    }
  },
  {
    "text": "this case, you have a big decision to make because we have a 1.50. Don't forget we do have to pay commissions on that. Maybe you walk out with a dollar, but you've got to be like, damn, what the hell do I spend this entire dollar on? Obviously, fucking around here. This is the problem. This is the entire problem when people talk about things like trading options for income or rolling until you're right. This entire thing is based on a complete and utter mental fallacy. It's that thing we were talking about before that you probably heard us when we were saying Goldilocks analysis. That's exactly what this is. Goldilocks analysis. And I'll explain why. We focus on the elements of the trade of the position that we think we like. That sound good. That are preferable to us. The elements that we like because they're there. And we completely spend insufficient amount of time considering the elements that would be shitty. That would be unfortunate and a very, very realistic part of the trade. That's one of the big issues with the wheel is that you can have sustained periods of time where you're just fucking holding. You're just holding. That's all you're doing. That's all you got. That is a bit of a problem. So yeah, it's an unfortunate reality that anybody that trades eventually comes to the understanding of. And I cannot tell you how many times I have different versions of this conversation",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 77,
      "start_timestamp": "01:17:11",
      "start_timestamp_seconds": 4631.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=4631"
    }
  },
  {
    "text": "holding. You're just holding. That's all you're doing. That's all you got. That is a bit of a problem. So yeah, it's an unfortunate reality that anybody that trades eventually comes to the understanding of. And I cannot tell you how many times I have different versions of this conversation with people trying to help talk them off the edge of this thing being is good as we think it is. James says, wheel would have been pretty good for 10-year stretch post-09. Yeah, I mean, we can definitely cherry pick all kinds of scenarios where something would be good. The funny part about trading the wheel on that time frame is you still fucking underperform buying and holding. So yeah, it would have been good. But it doesn't it doesn't mean anything. It's not how trading works. We don't just get to say like this one specific period of time, this was good. Bitcoin was great over that time frame. Where's the Bitcoin at? Do we all have tons of Bitcoin? No, because conditions are what they are at a given point in time. Looking back historically at a favorable stretch and saying it would have worked good in this duration is again pure Goldilocks analysis. We can't say post crash. This looked good. What about pre crash? How would it have done leading into the crash? How long did it take before we got back to break even? Same thing with the most recent move. And I want",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 77,
      "start_timestamp": "01:18:48",
      "start_timestamp_seconds": 4728.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=4728"
    }
  },
  {
    "text": "this duration is again pure Goldilocks analysis. We can't say post crash. This looked good. What about pre crash? How would it have done leading into the crash? How long did it take before we got back to break even? Same thing with the most recent move. And I want to be clear, trading the wheel or any sort of long equity position in the SP 500 index ETF, it's a solid choice. Like it generally is a solid choice. But we still have to acknowledge the realities of the position. What it behaves as, what it actually is, not just the spots that we like. If we have the propensity to just look at trading the elements or analyzing the elements of something that we like, we have a big problem. It's a big problem. We're on to water millen, which is sick. Really interesting conversation though, and as you can tell, like I absolutely will always spend the time talking about this stuff to try to help people learn this shit before they get into it. And they're like, wait a minute, this ain't working the way that I thought it would. What the hell's going on? And it's just because we had a lot of side of understanding of the way that this thing worked. That actually leads me the problem with trading the wheel for income. I'll make a video on that. Who's been a while since I made a video on the wheel specifically? I'll",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 77,
      "start_timestamp": "01:20:06",
      "start_timestamp_seconds": 4806.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=4806"
    }
  },
  {
    "text": "it's just because we had a lot of side of understanding of the way that this thing worked. That actually leads me the problem with trading the wheel for income. I'll make a video on that. Who's been a while since I made a video on the wheel specifically? I'll clear that out. Anything else that we should hit? Super fun, super fun combo. Tomorrow for the pro members, we're going to be doing a bunch of, we'll have some like quick trade updates. And then we'll go through the paper trading challenge, provide an update there, see how everybody's doing. And then we'll talk about the trading pairs program. And make sure that the conversations are happening that you guys are having good back and forth dialogue to talk about some of the learning so that we can cross share all that. And then on Friday, we have the outlier options trading basics. And we're actually doing buying versus selling options. And this is from a conversation I think we had yesterday. I typically expect this series to go about 15 episodes ish. So we have a handful of flex episodes. And that's by design. It's because if we go through this, and I noticed that there's some sort of knowledge gap or elements that are kind of missing from our understanding, then what I'll do is use one of these to find the elements we need to spend some more time on and slot them in. But this",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 77,
      "start_timestamp": "01:21:21",
      "start_timestamp_seconds": 4881.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=4881"
    }
  },
  {
    "text": "go through this, and I noticed that there's some sort of knowledge gap or elements that are kind of missing from our understanding, then what I'll do is use one of these to find the elements we need to spend some more time on and slot them in. But this is the general general path we're going to take. So this Friday, we're going to talk about buying versus selling options. What that looks like, how to think about them, the differences between them, how they behave, the settlements, all that kind of stuff. So if there's anything as we go through this and you're like, damn, I wish I knew more about blank. Tell me because that is exactly why we have some space here to add some stuff in. Travel says, have you ever had a year where you made no significant profit? Yeah. Well, I had my first two years of trading, I was negative. My first year of trading, I was down 1.1, the second year I was down 4.2. But after that, I didn't have anything sub double digit year. I had low double digits, like low teens. But yeah, other than the first few years, I've not had like a year where I didn't, and again, I don't consider that significant profit. But consistent. Again, that's like the entire, the basis of my approach to trading is it's entirely wrapped around consistency, not severity. But I also had a completely different series of objectives",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 77,
      "start_timestamp": "01:22:36",
      "start_timestamp_seconds": 4956.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=4956"
    }
  },
  {
    "text": "years, I've not had like a year where I didn't, and again, I don't consider that significant profit. But consistent. Again, that's like the entire, the basis of my approach to trading is it's entirely wrapped around consistency, not severity. But I also had a completely different series of objectives with what I was trying to do as a trader and whatnot. James says, in your wheel video, can you, can you review invest with Henry, one hour course on YouTube? I cannot because I already did a video on invest with Henry. And I don't know him personally, but I think this stuff he talks about is complete shit. And I think that the stuff that like the way he presents himself is straight trash. He makes it sound like he was like an X investment banker. I think from like Goldman Sachs or something, and he was a fucking intern there. So it's like it, and then he talks about like retiring from there. It's just all bullshit. So yeah, I don't have anything good to say about him. So I wouldn't do like some video review of, of whatever that is. I don't look at his stuff. I did a segment for a little while where I was going through trading services with my buddy Kyle, because at that point, I didn't have a Patreon or anything like that. And I just wanted to try to help people find genuinely like something that looked good. And after",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 77,
      "start_timestamp": "01:23:58",
      "start_timestamp_seconds": 5038.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=5038"
    }
  },
  {
    "text": "I did a segment for a little while where I was going through trading services with my buddy Kyle, because at that point, I didn't have a Patreon or anything like that. And I just wanted to try to help people find genuinely like something that looked good. And after I did, I forgot how many episodes we did of that. But like, I literally couldn't find stuff that I thought not even worked good. Then I thought we're like, okay, so I stopped. Yeah, I stopped doing, stopped doing that series. So it was like, this is fucking ultra-disenfranchising. Books are still the best. My hands down versus the courses and stuff is at least again, from what I saw. Books is seemingly the best. So yeah, sorry to pop the bubble games, but that's the honest opinion at least for me. Reese says, I find myself more emotionally attached to some positions than others trying to work on that. Oh, that's interesting. That's really interesting. As I think about that, my best guess, as at least a starting point, is to try to differentiate the origin of the trade. My guess is the reason why we might be more emotionally invested in something is if we believe in it, believe we know something about it, like something about it. And we allow that to cross over into the, into the like the business decision side of things. So I think I would clearly delineate between your thoughts about",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 77,
      "start_timestamp": "01:25:14",
      "start_timestamp_seconds": 5114.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=5114"
    }
  },
  {
    "text": "more emotionally invested in something is if we believe in it, believe we know something about it, like something about it. And we allow that to cross over into the, into the like the business decision side of things. So I think I would clearly delineate between your thoughts about something and the way that you choose to trade it. Yeah. And I think what I are too bad in James are saying are really, really wise. If you choose to have some sort of fundamental approach as compared to a trading approach and you're looking to express different time frames, like you can create different structures. It's exactly what I do with my IRA account is, I told you guys this a million times, like my IRA account almost always outperforms the market and I barely touch it. I really do barely touch it. And I provide an update on it most years. And it's really funny actually. I always get a kick out of that because I spend so much time trading, analyzing, moving positions. And then sometimes I look at the performance of what I'm doing in the IRA. I'm like, what the fuck am I, why don't I just do this? It's so I do nothing essentially. So the point being is the Roth IRA account for me has a completely different approach, not completely different, that's dramatic, but a different level of involvement than the primary margin account. And that can be recreated, meaning you",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 77,
      "start_timestamp": "01:26:39",
      "start_timestamp_seconds": 5199.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=5199"
    }
  },
  {
    "text": "don't I just do this? It's so I do nothing essentially. So the point being is the Roth IRA account for me has a completely different approach, not completely different, that's dramatic, but a different level of involvement than the primary margin account. And that can be recreated, meaning you can set up a different account if you want to have an investing component versus a trading component. But a big part of that is a really, really big part of that is aligning what you're doing with your temperament is a human being. Because sometimes let me let the dog out so we can go get his dinner. That's funny. Normally he's kind of like ready to go grab his dinner, but he was just literally debt asleep, not doing shit. That's actually hilarious. But you have to align what you're doing with your temperament as a person, as a trader. Because sometimes people we say we will say were things or want to be something that were not. So a lot of times people will say for me like, what do you buy and hold? And the answer is just about nothing. I don't really buy and hold anything. I very rarely have long term stock holdings. And if I do as part of like a covered strangle, I'm still almost always trading options around them. And you guys can tell hopefully that there's that that's part of my just general temperament and personality. I'm impatient. And I",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 77,
      "start_timestamp": "01:28:30",
      "start_timestamp_seconds": 5310.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=5310"
    }
  },
  {
    "text": "anything. I very rarely have long term stock holdings. And if I do as part of like a covered strangle, I'm still almost always trading options around them. And you guys can tell hopefully that there's that that's part of my just general temperament and personality. I'm impatient. And I want to accelerate things. And long term buy and hold is not that. Long term buy and hold is a really, really big, really big faith leap that the next 10 years is going to look like the last 10 years. And we never really know if it's going to. Let me I have a couple more minutes. It looks like you guys have a few more things which I'm happy to cover. I'm just updating the thing. Our little tracker. Let's see. Reese says I went long so far at 650 on a fundamental basis. I've traded options around it, but I haven't but haven't sold the shares, but I think it's time to what I think is it's time to analyze that ship before you enter the trade. That's what I think. You can't wait until you're in the middle of a trade. And I hope most people that are a part of the outlier community are full will aware of this at this point. There's there's not a scenario where you're in the middle of the trade that you should be figuring out what you're going to do while you're in it. That's not to be confused",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 77,
      "start_timestamp": "01:30:04",
      "start_timestamp_seconds": 5404.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=5404"
    }
  },
  {
    "text": "that are a part of the outlier community are full will aware of this at this point. There's there's not a scenario where you're in the middle of the trade that you should be figuring out what you're going to do while you're in it. That's not to be confused with having a set plan before you get into a trade. But we should have considered what we're going to do essentially in the full ray of possibilities. It shouldn't be figuring it out as you go. There's adjustments we can change, but Reese says it was before I found this channel. Yeah. So now's the next time, right? The first time to do that is before you put the trade on the next best time is now and figure out what the position is, what you're trying to do with it, what your underlying assessment is. But when you do that, my advice to you would be don't do it from the context of the position that you have on. Essentially pretend you don't have the position on. Pretend the position is not even there. And think about what you would do with the stock is now when you would buy it. If so, that gives you part of your answer is now when you would not buy it, but settle alerts. That gives you part of your answer and so on and so forth. The other thing I would always, always, always mention is it is almost never",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 77,
      "start_timestamp": "01:31:32",
      "start_timestamp_seconds": 5492.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=5492"
    }
  },
  {
    "text": "would buy it. If so, that gives you part of your answer is now when you would not buy it, but settle alerts. That gives you part of your answer and so on and so forth. The other thing I would always, always, always mention is it is almost never a bad thing to scale down a little bit and then leave some on. That almost always satisfies a lot of those urges, at least for me. And I recently did that in RGTI. I talked about that yesterday where I put on the position and then I let it ride. And on the day it was up almost 50. So then I took essentially enough of the trade down to then finance the remaining part of the trade and guess what? I'm very thankful that that remaining part of the trade is on. Since it's up another 24 percent today. So that's another really slick way to try and strike a balance between the urge to take something down because it's doing what you want and to then continue to let it go. So yeah, I think the main takeaway though, at least for everybody is always make sure that you're thinking through the full trade life cycle before entering. I are too bad says if it was mine, I would just sell enough to get my initial investment back and let the rest ride. I think that's okay. And I think to me, I think it's a little",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 77,
      "start_timestamp": "01:32:33",
      "start_timestamp_seconds": 5553.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=5553"
    }
  },
  {
    "text": "that you're thinking through the full trade life cycle before entering. I are too bad says if it was mine, I would just sell enough to get my initial investment back and let the rest ride. I think that's okay. And I think to me, I think it's a little bit of an arbitrary thing and I think it's good that you flagged for what you would do. Because that makes total sense from your perspective. But I think the broader point that I fully agree with is to literally we were just talking about, scale some of it down. But I think the amount to scale down should be variable, not just to get the initial investment back. Because there's also an opportunity cost for the time. So let's say for example, we take a look at SoFi. And we say that we got in at 650. Let's just pretend that it was somewhere in here. It probably is somewhere in here. But let's pretend it was somewhere in here. Well, if we got in here in June of 23. And then we essentially take enough off to cover the cost of the initial investment and leave the rest on. And then say for whatever reason, the stock plummets and comes back down to our stop. And then we get stopped out. Or if it goes down, you know, to zero ish, not saying it would, but it goes all the way down. Then you kind of don't have",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 77,
      "start_timestamp": "01:33:46",
      "start_timestamp_seconds": 5626.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=5626"
    }
  },
  {
    "text": "on. And then say for whatever reason, the stock plummets and comes back down to our stop. And then we get stopped out. Or if it goes down, you know, to zero ish, not saying it would, but it goes all the way down. Then you kind of don't have anything to show for that time. There's not much to walk away with. So I think the part of the scaling protocols should be relative to the time in the trade. That's also why for our GTI, I did that exact approach where I took enough of the trade down so that I have a risk-free trade on. But it's also because it was literally the same day that it happened. There's not really an opportunity cost there. And then what ends up happening is I set alerts in it with the expectation of exiting as it eventually starts to make its way down versus just letting it go and seeing what happens. But to the point I was making earlier, that's my approach. Just like your approach might be whatever it is in terms of take it off so that there's no risk. That's smart. But I think the trader has to figure out what makes sense in the context of the broader approach that they're taking. Because it's the same thing with rolling puts. The idea of rolling puts that are being challenged is fine until you realize that you have to roll them for six months. And",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 77,
      "start_timestamp": "01:35:09",
      "start_timestamp_seconds": 5709.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=5709"
    }
  },
  {
    "text": "trader has to figure out what makes sense in the context of the broader approach that they're taking. Because it's the same thing with rolling puts. The idea of rolling puts that are being challenged is fine until you realize that you have to roll them for six months. And at the end of the six months, you don't really have a whole lot to show for it. And there's a really, really simple example actually. Let me kind of feel in froggy. So 136, 55, rolling, short puts. Let's take a look. So let's go into here. Let's go to here. January 10th of 22. 22. And Jan, and then let's. I'm going to just grab this. This. Go over here. And I'm just going to track. Like the requisite details. I'm not going to track a bunch of shit just so that we can move through this fast. So I'm not going to bother with entry dates stock. I'm not going to bother with expiration. I'm not going to bother. We'll keep strike so that we can track the movements there. I don't care about the Delta wheel track essentially just lots. And lots premium strike these. So all of this doesn't matter. What am I doing with my life? Why is it? I can't want to do whatever. Oh, it's because it's already gone down. Okay, so let me brush this. I'm going to squish this down. And let's take a let's take it for a ride.",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 77,
      "start_timestamp": "01:36:15",
      "start_timestamp_seconds": 5775.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=5775"
    }
  },
  {
    "text": "all of this doesn't matter. What am I doing with my life? Why is it? I can't want to do whatever. Oh, it's because it's already gone down. Okay, so let me brush this. I'm going to squish this down. And let's take a let's take it for a ride. I'm going to get rid of this. This. This don't care. Delta don't care. Socket exit is fine. These I don't care. Yeah. Cool. All right. So let's clear this out. And I'm going to keep this off to the side just so that I can go faster. But this is what I'm getting those are the inputs. I'm going to be using in case you want to be able to follow along and make your own version or whatever. All right. So let's go in here. We'll just do like a six-month daily deposit. And let's sell our puts 18 Feb. We'll do the 443s. So the strike is 443. Premium is going to be 712. Let's just do a one lot. So let's say we have a 50,000 account. This is now using 44,000. We're getting 712, 1.6 return on invested capital for anybody that sells puts. You know that that is a insane, insane premium that you're getting. And I realized that we didn't go through two of the things I was going to go through today. So I'm just going to change this to analyzing the wheel and rolling options. Okay. And let's fast forward time.",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 77,
      "start_timestamp": "01:38:14",
      "start_timestamp_seconds": 5894.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=5894"
    }
  },
  {
    "text": "know that that is a insane, insane premium that you're getting. And I realized that we didn't go through two of the things I was going to go through today. So I'm just going to change this to analyzing the wheel and rolling options. Okay. And let's fast forward time. So I'm literally just going to bring us straight to expiration versus any management. We're just going to go and see what happened. Let's see. So it looks like our 443s. If it's at 457, we should be okay here. Except it's not. It's at like 436. Yep. Okay. There we go. So we're going to take this down for 8.6, which is actually really, really solid, by the way. The reason why that's so solid is because VAL was so damn high, which is one of the benefits actually of selling premium when VAL is so high. So 434.96 stock entry. I already forgot it was like 453. So here's what has happened so far. The stock has moved down 4. We don't care about this gap. We can just get rid of that. We don't care about percent capture. We can get kill that. We're down negative for negative 94 bucks and we're what 37 days into the trade. So I'm just going to track days of the expiration over here manually. The reason why I'm doing this is just because it's faster than me having an input like this specific dates for expiration. So I'll literally just",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 77,
      "start_timestamp": "01:39:58",
      "start_timestamp_seconds": 5998.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=5998"
    }
  },
  {
    "text": "negative 94 bucks and we're what 37 days into the trade. So I'm just going to track days of the expiration over here manually. The reason why I'm doing this is just because it's faster than me having an input like this specific dates for expiration. So I'll literally just track the raw days there. So that's what we have so far. And I'm going to run through a couple of these. I'm going to show you. So here's there. That's your first trade is you sold a put. You wanted the what is it? The 712. But after that 37 day period you actually had to give back 94. So let's try this again. Let's go out 28 days. That's the next generally closest. This is all skewed. So I just have to fix it. For those that don't know when you see it skewed like that in on-demand you just have to change the strikes and then it will rebalance you. So let's go here to the 418s. So now this stock is at 434. 96. Our strike prices for 18. Our premium now is 729. Lots size one fast forward. Now we're going to go to 18 March. See what it is. 438. So it looks like we would have made money on these. That's great. And this will be a good example. So these come down for two pennies. Stock is at 439. 97. And the original days for this was 28 days. So first thing",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 77,
      "start_timestamp": "01:41:49",
      "start_timestamp_seconds": 6109.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=6109"
    }
  },
  {
    "text": "March. See what it is. 438. So it looks like we would have made money on these. That's great. And this will be a good example. So these come down for two pennies. Stock is at 439. 97. And the original days for this was 28 days. So first thing to know. We are now 65 days. We're two months into this. And after the 65 days we have 633. Not ideal. If we are expecting to make 712 on the first month, 729 on the second month, we only have 633 to show for it. This is the problem of trading short puts with the idea that you're just going to be able to make income off of them. So now let's, I think the market starts to roll over a little bit more. So we'll have even better example from a rolling option perspective. Because one thing that I don't know if you noticed, but I gave us a break here. I didn't make us collect the same amount of credit. It allowed us to pick a more advantageous strike. So I didn't even really consider that as a role since it was a 100 loss. I mentally write those off as like a scratch. It doesn't even matter. Okay. So we're at 439. 97. New strike price 425, which is a 30 delta, which I'm not tracking here. I have to update the thing there. Okay. Premium on these 5.56, a one lot. And this is 27",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 77,
      "start_timestamp": "01:43:03",
      "start_timestamp_seconds": 6183.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=6183"
    }
  },
  {
    "text": "write those off as like a scratch. It doesn't even matter. Okay. So we're at 439. 97. New strike price 425, which is a 30 delta, which I'm not tracking here. I have to update the thing there. Okay. Premium on these 5.56, a one lot. And this is 27 days fast forward. And we need to go to 14 April. Do what we got. And 440. So our 425s look okay. I don't know if this actually goes all the way back to 08. That would be really nice. Yes. So our 425s, those come down for a penny minus 0.01. Stock is currently trading at 441.75. 441.76. Okay. So now let's go again. 36 days. 30 delta is the 428s. 428. Premium. We're going to get 605. Lot one days 36. Les go 20 May. We on the way. Ah, ugly one. So this looks like 386. Problem. We have a problem on our hands. And let's see what the problem looks like. And then I'll move this here for the example. So we now have to buy those back for 4046 minus 4046. Stock at exit now is 387.54. 387.54. So the first thing that's happened is shit. The first thing that's happened is we're now in the trade for a total duration of 128 days. In the course of that 128 days, our current realized PNL is negative 2,253. You literally have nothing to show for the past 100 and what was it? 28 plus 128",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 77,
      "start_timestamp": "01:44:55",
      "start_timestamp_seconds": 6295.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=6295"
    }
  },
  {
    "text": "shit. The first thing that's happened is we're now in the trade for a total duration of 128 days. In the course of that 128 days, our current realized PNL is negative 2,253. You literally have nothing to show for the past 100 and what was it? 28 plus 128 days. You have nothing. So now we have to look for a role. We have to figure out how can we roll these? So we need to find where we can get 40 dollars and 46 cents. So let's see where we can find that. Let's go to the 17 June. 40.46 puts us at the 427s. So we can improve our bases by 1 and go here for a 28 day trade. It's actually not genuinely not the worst. That's good. And this is an artifact of really high volatility. So 427 will be our role. The premium we're going to get is 4110, a 1 lot. And this is going to put us back in the market for another 28 days. That's correct. Yeah, 28 days. So now fast forward. June. Let's go June. 427 or 362 new low. Damn. Damn, Daniel. All right, let's see what we have now. Closing price. 6299. So minus 6299 stock is now at 360 405 360 4.05. Okay. So now we have a composite loss of 4400. We are now 156 days into the trade almost six months in. And you are down. 4400. So now let's find our next role.",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 77,
      "start_timestamp": "01:46:45",
      "start_timestamp_seconds": 6405.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=6405"
    }
  },
  {
    "text": "have now. Closing price. 6299. So minus 6299 stock is now at 360 405 360 4.05. Okay. So now we have a composite loss of 4400. We are now 156 days into the trade almost six months in. And you are down. 4400. So now let's find our next role. And then I'll pause it after this. I don't think we have to go through this exercise all the way through because I can I hope you can see what's happening. And then I'll show you the summary of what ends up happening. So 6299, where do we get 6299? 60 Gs. Gs Louise. 62 Holy shit. 1.50. Okay, 6299 is here at the 426. So not that one actually. That's only 6236. So we have to go further. I'm not going to bother with the weeklies. I'm going to keep it in the main explorations. This will just give us a better basis adjustments. It's going to be further out in time here. 6290. So this still doesn't get us what we need. We need 6299 to roll for a credit. We're now out 63 days. And this still doesn't get you there. So we have to go out even more 91 days. Let's figure out where that 6299 is at 6216. 6307 right here at the 426. So you do get your dollar basis adjustment. So now we're going to be at the 426. The premium is going to be 63.07. And it's going to be a one",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 77,
      "start_timestamp": "01:48:20",
      "start_timestamp_seconds": 6500.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=6500"
    }
  },
  {
    "text": "even more 91 days. Let's figure out where that 6299 is at 6216. 6307 right here at the 426. So you do get your dollar basis adjustment. So now we're going to be at the 426. The premium is going to be 63.07. And it's going to be a one lot. But now we're adding 91 days. Okay. So now let's fast forward that time frame to what 16 September. Does what I'm doing make sense? Like do you understand the implication of what I'm showing you right now? What I'm showing you is that even though you can adjust, defend and manage a in the money short put, there are still issues especially from an income generation perspective. But even more than that from a actual how much money you have to show for it at the end of this thing perspective. Okay. So this it's still in the money obviously. So these came down for 42 42. The stock is at 383 55. We are now 247 days in this trade and you are down 2377 dollars. So if we were to look at the averaged cash secure amount, it's essentially this divided by this is a percentage. So so far, being nearly a year in the trade, we are down 5.6. Now I want to be clear, that's not terrible. That's when I do stuff like this, I think sometimes people misconstrued what I'm doing and what I'm showing you. What I'm showing you is that it",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 77,
      "start_timestamp": "01:50:17",
      "start_timestamp_seconds": 6617.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=6617"
    }
  },
  {
    "text": "So so far, being nearly a year in the trade, we are down 5.6. Now I want to be clear, that's not terrible. That's when I do stuff like this, I think sometimes people misconstrued what I'm doing and what I'm showing you. What I'm showing you is that it simply isn't as nice of a thing as people like to think it is. That's all. It's not bad because the market had a rough year. So this is not doing bad. All right. So now let's take a look. We need to make 42 42. Where do we get that 42 42? At 427 that sucks because our basis right now is 426. So if we want to get 4242, we either need to go up a strike and worse in ourselves or go further out in time. So let's go further out in time. Let's find that 42 42, which is here at the 426. So now we don't get a basis adjustment. We're literally going to be at the same basis. So now we're going to be at 426. And we get 4309. One of those and we're adding 63 days was it 63. Okay. This will be the last one. We need to go to 18. And then I want to show you the example. James says better than buy and hold. It's a false comparison. Like that doesn't mean anything. And it's a concession to try to make us feel better because what is the",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 77,
      "start_timestamp": "01:51:54",
      "start_timestamp_seconds": 6714.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=6714"
    }
  },
  {
    "text": "be the last one. We need to go to 18. And then I want to show you the example. James says better than buy and hold. It's a false comparison. Like that doesn't mean anything. And it's a concession to try to make us feel better because what is the comparison even mean? Better than buy and hold. Better than buy and hold and what? Depending on what I buy and hold in, I could have made money this year. I get your point and I don't disagree with you, right? Comparing it against the underlying itself. But that's just like a standard basis of an argument. It's not a trader's approach to markets. Those aren't your two choices. You don't get to just sell cash secured puts in spy or buy spy. There's other shit you can do and there's other shit you should do, right? Because of this exact thing. This is how I made money during this year as compared to what this is showing you that essentially over the course of this year, you don't have much to show for it. So this now came down for 3146 minus 3146. And the stock is at 39442. Okay. So now we are 310 days into this trade and the portfolio at this point is down 2.8. So now we're going to have a look at the current. So now, what I want to show you is let's say that we're able to actually get this down. Let's",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 77,
      "start_timestamp": "01:53:12",
      "start_timestamp_seconds": 6792.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=6792"
    }
  },
  {
    "text": "Okay. So now we are 310 days into this trade and the portfolio at this point is down 2.8. So now we're going to have a look at the current. So now, what I want to show you is let's say that we're able to actually get this down. Let's say that this eventually expires worthless. Let's say this next role expires worthless. So let's say that we just keep it at the 426 and let's say that we got 3150. We had one. Let's say it's another 90 day trade. Let's say that it expires worthless. At the end of this whole thing, you would have made 3150, 3,150, tying up 42,600. You make 1900 total and now you're 400 days into the trade. So this is not bad, right? It's not bad. But it's not as pretty as people think it is when it goes this way. This is objectively problematic, especially if you're trying to do this for income. If the idea for doing this for income, guess what? You had one month where you had to add 3,441. You had another month that you had to add 2,200 in order to keep the trade going so that you can make the adjustments. So this process of rolling short puts and adjusting them, it's exactly what I do. There's nothing wrong with this. But I go into this with eyes wide open on what this does look like, the ugly parts of it. And it's why I",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 77,
      "start_timestamp": "01:54:39",
      "start_timestamp_seconds": 6879.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=6879"
    }
  },
  {
    "text": "that you can make the adjustments. So this process of rolling short puts and adjusting them, it's exactly what I do. There's nothing wrong with this. But I go into this with eyes wide open on what this does look like, the ugly parts of it. And it's why I make sure that I have other strategies that I can use to pick up the slack from the money that's tied in this now because it's not going to produce that much for a pretty long period of time. That's the whole point. So rolling short puts is fine. You can absolutely move around a basis. It's not as pretty as people think it is. You can go really, really, really long durations and have very little to show for it at the very end of it all. It's the reality of it. But this is still better than losing a bunch of money in the long run. But same vein, if we compare the entries and buy and hold comparison to this, this absolutely is beating by and hold at this point, not by a whole lot. Now the downside of beating by and hold in this scenario, a down market is that it will underperform by and hold in an up market. So then net net, it's about the same. It doesn't really help you that much, especially because the markets tend to exhibit positive. So rolling short puts, baby, it's fine, but you have to understand what",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 77,
      "start_timestamp": "01:56:26",
      "start_timestamp_seconds": 6986.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=6986"
    }
  },
  {
    "text": "down market is that it will underperform by and hold in an up market. So then net net, it's about the same. It doesn't really help you that much, especially because the markets tend to exhibit positive. So rolling short puts, baby, it's fine, but you have to understand what it is. So that is that. All right, gang. That is enough for me. I've been running my fat mouth for almost two hours. That is more than enough. If you guys need anything, hit me up. I will catch the Patreon gang on the stream tomorrow. And then if you guys need anything, hit me up in the discord. It's completely free to join for everybody. And yeah, we'll see you in there. Be an outlier. Catch you later.",
    "metadata": {
      "video_id": "0VLvs5Pv12A",
      "title": "0VLvs5Pv12A",
      "url": "https://www.youtube.com/watch?v=0VLvs5Pv12A",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 77,
      "start_timestamp": "01:57:41",
      "start_timestamp_seconds": 7061.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=0VLvs5Pv12A&t=7061"
    }
  }
]