[
  {
    "text": "What's up outliers? Welcome back to outlier options trading tips where you learn some new things in three minutes or less. Today, we're going to talk about three tips to survive as a new options trader. The first one is to target returns that are commensurate with your skill. So here's a conversation I had on Reddit. And this person was talking about their coworker who apparently is able to make 500 a day trading spy zero DTE options using only 5,000. So that represents a 10 return daily. If this person traded even 63 total trading days, they would have a 40,000 plus return. It is complete bullshit. Trading is the only skill I can think of where people regularly believe that you can get outsized returns with no skill. Think of anything else that requires a lot of skill. How long it takes you to get really good at it? It's not like months. It's literally years and years. Trading is no different. It's no different than being really successful at anything else. So my approach would be my first two years of trading greater than zero is great. That's a great target to start. And the reason why greater than zero is a great target, not trying to rapidly grow your 5,000 account is because it saves you from making stupid mistakes, trying to grow your small account into a large account, tracing a gene that really doesn't exist. Okay, the next thing here is focusing more",
    "metadata": {
      "video_id": "19oL0B8i2Fc",
      "title": "19oL0B8i2Fc",
      "url": "https://www.youtube.com/watch?v=19oL0B8i2Fc",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 3,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=19oL0B8i2Fc&t=0"
    }
  },
  {
    "text": "why greater than zero is a great target, not trying to rapidly grow your 5,000 account is because it saves you from making stupid mistakes, trying to grow your small account into a large account, tracing a gene that really doesn't exist. Okay, the next thing here is focusing more on the loss side of the equation. You'll come across posts like this literally all the time where traders put on trades. They're too worried about how much money they're going to make. What they're going to do with all the money they're going to make. And they don't even consider what they're going to do if the trade goes against the against them. And then when the trade goes against them, they come on well, place like Reddit asking for help. It just doesn't make sense. So you have to spend even more time looking at the risk side of your trade than literally the profit side. And the last thing is focus on building a robust process rather than trying to scale your small account into your future wealth. Because the probability of you scaling your small account into your future wealth super fast is about zero. However, your probability of becoming a millionaire, if you focus on maintaining a really good savings rate, investing your money and growing your income source, then all of a sudden it becomes much more realistic. Any questions? Let me know. Be an outlier. See you later.",
    "metadata": {
      "video_id": "19oL0B8i2Fc",
      "title": "19oL0B8i2Fc",
      "url": "https://www.youtube.com/watch?v=19oL0B8i2Fc",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 3,
      "start_timestamp": "00:01:21",
      "start_timestamp_seconds": 81.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=19oL0B8i2Fc&t=81"
    }
  },
  {
    "text": "your probability of becoming a millionaire, if you focus on maintaining a really good savings rate, investing your money and growing your income source, then all of a sudden it becomes much more realistic. Any questions? Let me know. Be an outlier. See you later.",
    "metadata": {
      "video_id": "19oL0B8i2Fc",
      "title": "19oL0B8i2Fc",
      "url": "https://www.youtube.com/watch?v=19oL0B8i2Fc",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 3,
      "start_timestamp": "00:02:27",
      "start_timestamp_seconds": 147.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=19oL0B8i2Fc&t=147"
    }
  }
]