[
  {
    "video_id": "1kGksRBt2aA",
    "title": "Charm (Delta Decay) Explained in 12 Minutes – The Greek Most Traders Ignore",
    "text": "What's up, outliers? We're back with another option Greek simplified video today. We're talking about charm. This is also known as Delta decay. Now, it's a little confusing because a lot of people don't even know that this exists. And I want to explain what it is. If we take a look at this plot here, this is plotting Delta by days to expiration. I think this was spy at the time. You can see that the at the money at the time is like right here. And the important thing to note is how for the very same strikes, say for example, the 350 strike, I'm going to tell the Delta is different. This one has a 70 Delta, yet this one has a 90 plus Delta. This is charm. What's going on here is every single option has to make a choice. It's either going to be out of the money with a Delta of zero or in the money with a Delta of one. This changes as time changes. So if you trade options buying or selling, being aware of charm in how it can impact your positions is super important. And I'm going to explain why this is one of those sneaky little things that you can get a lot of stuff right. But if you're unaware of this, your idea could still completely not pan out as you would like. So let's double click into this effect. First thing is first, we have to go",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 93.0,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=1kGksRBt2aA",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1kGksRBt2aA&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 716.0
  },
  {
    "video_id": "1kGksRBt2aA",
    "title": "Charm (Delta Decay) Explained in 12 Minutes – The Greek Most Traders Ignore",
    "text": "this is one of those sneaky little things that you can get a lot of stuff right. But if you're unaware of this, your idea could still completely not pan out as you would like. So let's double click into this effect. First thing is first, we have to go through some very, very basic terms and definitions. Again, this is all available in a deeper video. I have on my channel about the Greeks. We're not going to go through all this. But I want you to know first that charm is a second order Greek. What is the second order Greek? It's effectively telling us something about a first order Greek. This is the same thing as gamma. A lot of traders are very used to gamma. Gamma is the second order Greek. Gamma tells us the rate of change of Delta. This is focusing on rate of change of Delta per one point moving the underlying. Charm tells us rate of change of Delta per the passage of time. So going back to this example, we can see that as time is passing as we go from 325 days in approximately 31 days. We can see two things happening. We can see that in the money options are gaining Delta. This line is becoming steeper and steeper. Because at expiration, again, everything in the money is going to be a one. Everything out of the money is going to be a zero. So to give you a",
    "start_timestamp_seconds": 76.0,
    "end_timestamp_seconds": 171.0,
    "start_timestamp": "01:16",
    "video_url": "https://www.youtube.com/watch?v=1kGksRBt2aA",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1kGksRBt2aA&t=76",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 716.0
  },
  {
    "video_id": "1kGksRBt2aA",
    "title": "Charm (Delta Decay) Explained in 12 Minutes – The Greek Most Traders Ignore",
    "text": "things happening. We can see that in the money options are gaining Delta. This line is becoming steeper and steeper. Because at expiration, again, everything in the money is going to be a one. Everything out of the money is going to be a zero. So to give you a visual of what that looks like, it would be pretend that this is completely flat along the top there. And we would go vertically down through the at the money. Don't worry. We're not in danger here because there's only one part to this, which is this. And then this is the rest. This is the out of the money. They're all at zero. So you can see how this is approximating in this direction. And this is approximating in this direction. So let's take a look at how this can impact your position in play. What I did was look at spy. And I plotted very simply the terms and Delta's for the very same strike. I was looking at the 700. So at 441 days, that was a 56 delta. Then at 91 days, that same strike is a 42 delta. 28 days, it's a 26 delta, 7 days, 4 delta, 3 days, 1 delta. What's going on here? As an option has more time and more volatility, it has a greater potential to fall in the money. As we have less and less time, that options probability of falling in the money decreases naturally. So you can",
    "start_timestamp_seconds": 148.0,
    "end_timestamp_seconds": 249.0,
    "start_timestamp": "02:28",
    "video_url": "https://www.youtube.com/watch?v=1kGksRBt2aA",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1kGksRBt2aA&t=148",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 716.0
  },
  {
    "video_id": "1kGksRBt2aA",
    "title": "Charm (Delta Decay) Explained in 12 Minutes – The Greek Most Traders Ignore",
    "text": "days, 4 delta, 3 days, 1 delta. What's going on here? As an option has more time and more volatility, it has a greater potential to fall in the money. As we have less and less time, that options probability of falling in the money decreases naturally. So you can logically think of it this way. If we pull up spy and you were to just mentally ballpark, what do you think has a higher probability? Do you think it's more likely that spy will hit 700 sometime in the next 441 days? Or do you think it's more likely that spy will hit 700 sometime in the next three days? And this is what spy at 682. Of course, we would say 441 days as more time to move towards that price. That's what's happening here. Now, here's the functional issue. If we take a look at premiums, I'll throw those in now. Here's what's happening. As time is passing, if nothing else changes, this out of the money option because the call strike of 700 is greater than spot price of 682. These are out of the money even though Delta is a 56 for those wondering. There's a difference between the at the money and at the forward. That's a topic for another video if you're interested. But even though these have a 56 delta, they're out of the money. As time is passing, if nothing else changes, which is what this underlying assumption is, your Delta",
    "start_timestamp_seconds": 227.0,
    "end_timestamp_seconds": 327.0,
    "start_timestamp": "03:47",
    "video_url": "https://www.youtube.com/watch?v=1kGksRBt2aA",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1kGksRBt2aA&t=227",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 716.0
  },
  {
    "video_id": "1kGksRBt2aA",
    "title": "Charm (Delta Decay) Explained in 12 Minutes – The Greek Most Traders Ignore",
    "text": "a difference between the at the money and at the forward. That's a topic for another video if you're interested. But even though these have a 56 delta, they're out of the money. As time is passing, if nothing else changes, which is what this underlying assumption is, your Delta is declining pretty significantly. Now, your premium is also declining pretty significantly. And this has to do with the passage of time. And it also has to do with the overall duration of your contract. So how does this impact your decision making? Well, let's take a look at a practical example. Let's say that you wanted to buy a call. And let's say that you were going to buy this 42 delta call that was 91 days out. You like that one. You got it for 1498. Great. And let's say that you hold it for 60 days or so so that you end up around this this point here. This 28 DTE 26 delta point. Notice what happens to your premium. That's just from the passage of time. Now, let's say we look at one thing. Even though time is passed, now your Delta has gone from 0.42 to 0.26. Here's the issue. If you do get an accommodating move. Let's say that spy has a pretty decent move. Let's say it moves by 50 points. The issue here is that the total premium that you now will collect on these two scenarios. Originally, you would have gotten",
    "start_timestamp_seconds": 312.0,
    "end_timestamp_seconds": 407.0,
    "start_timestamp": "05:12",
    "video_url": "https://www.youtube.com/watch?v=1kGksRBt2aA",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1kGksRBt2aA&t=312",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 716.0
  },
  {
    "video_id": "1kGksRBt2aA",
    "title": "Charm (Delta Decay) Explained in 12 Minutes – The Greek Most Traders Ignore",
    "text": "to 0.26. Here's the issue. If you do get an accommodating move. Let's say that spy has a pretty decent move. Let's say it moves by 50 points. The issue here is that the total premium that you now will collect on these two scenarios. Originally, you would have gotten 21 bucks. Now with Delta decaying, you're only getting $13. You're getting a significantly less amount of premium at this point from this factor. So let's take a look at where this gets most aggressive. We can see from down here, I'm just plotting the differences between the top and the bottom number, rotating down like that. So this one is looking at 441 to 91. That represents a change of 350 days. The total Delta change is only 0.14. So even though Delta has moved meaningfully, it's over a 350 day period. So it's not moving that quickly there. Then if we go from 91 to 28, that represents 63 days. We go from 42 Delta to 26. That's a 16 Delta change. We've lost more Delta in 63 days than we did in 350 days. What is this reminding you of? It should be reminding you of other Greeks, like gamma, like bigger. The difference in sensitivity with relationship to time now, it's closer to gamma. And it's because let's continue the exercise inverse, but same behavior. If we go from 28 days to 7, that's 21 days. We go from a 26 Delta to a 4 Delta.",
    "start_timestamp_seconds": 378.0,
    "end_timestamp_seconds": 506.0,
    "start_timestamp": "06:18",
    "video_url": "https://www.youtube.com/watch?v=1kGksRBt2aA",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1kGksRBt2aA&t=378",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 716.0
  },
  {
    "video_id": "1kGksRBt2aA",
    "title": "Charm (Delta Decay) Explained in 12 Minutes – The Greek Most Traders Ignore",
    "text": "Greeks, like gamma, like bigger. The difference in sensitivity with relationship to time now, it's closer to gamma. And it's because let's continue the exercise inverse, but same behavior. If we go from 28 days to 7, that's 21 days. We go from a 26 Delta to a 4 Delta. That's a 22 point change or 22 cent change in your Delta. Yet that's over the course of just 21 days. You lose 0.22 Delta. Whereas over 350 days, you only lost 0.14. So what is this showing you? As you get closer in time, this accelerates very meaningfully. And you can see that represented here, but notice a very important detail. Notice the slope between 350 days and then this 91 days. And the 63 days or so. Those slopes are not that significant. Then when we go from 63 to 21 to slope is huge. And then when we go from 21 to 3 or 4 days, what happens? It drops off a cliff. Why? It's because you have less total Delta to give up. Going from 7 days to 3, you already are starting with the Delta of 0.004. Your Delta is effectively 0. So it can't decay that much more. Because it's already decayed. There's not much left. So if we were to do the same exercise, but re-center to being at the money, you would see a more significant change. Although there is a very interesting effect with being at the money. So if we",
    "start_timestamp_seconds": 479.0,
    "end_timestamp_seconds": 598.0,
    "start_timestamp": "07:59",
    "video_url": "https://www.youtube.com/watch?v=1kGksRBt2aA",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1kGksRBt2aA&t=479",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 716.0
  },
  {
    "video_id": "1kGksRBt2aA",
    "title": "Charm (Delta Decay) Explained in 12 Minutes – The Greek Most Traders Ignore",
    "text": "decay that much more. Because it's already decayed. There's not much left. So if we were to do the same exercise, but re-center to being at the money, you would see a more significant change. Although there is a very interesting effect with being at the money. So if we take a look at that example, we go 7 days out. Let's go to at the money. And we can see our Delta is 0.511. Let's go to 3 days and let's look at those same 682s. What's your Delta 0.50? It didn't change much. Why? Because you're at the money. There's still a really, really good chance that these 682s will be in the money. So that's why the Delta remains so high. But if we take a look at one strike in the money or one strike out of the money, let's take a look at the difference here. Let's go two strikes just to make the point a little more clear. These are a 45 Delta going to the 684s. And then if we go to the 684s, those are now a 35 Delta big change. So as soon as you are off that dance floor of being right at the money, and you're this close in time, your Delta will decay very quick. Now it doesn't just decay. It also expands. So options that are in the money become more likely to stay in the money. So let's take a look at this option here. This",
    "start_timestamp_seconds": 575.0,
    "end_timestamp_seconds": 668.0,
    "start_timestamp": "09:35",
    "video_url": "https://www.youtube.com/watch?v=1kGksRBt2aA",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1kGksRBt2aA&t=575",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 716.0
  },
  {
    "video_id": "1kGksRBt2aA",
    "title": "Charm (Delta Decay) Explained in 12 Minutes – The Greek Most Traders Ignore",
    "text": "being right at the money, and you're this close in time, your Delta will decay very quick. Now it doesn't just decay. It also expands. So options that are in the money become more likely to stay in the money. So let's take a look at this option here. This 57 Delta 680. If I go to the 680, notice how this is a 63 Delta, the Delta went up. That's because it's in the money and it's more likely to stay in the money. As you get closer to expiration, if it's in the money. So that is the concept of Delta decay. This is part of the reason why when you see me trading things like the ratio called diagonal, I prefer to be at the money or slightly in the money. Because if I'm going to hold it for some duration, I don't want to lose too many Delta's in case I do get my move. And then I lose on profitability by the main profit factor I have by being further out in time via Delta. This is Cliff Notes on Charm. If you have any questions, let me know. Be an Outlier.",
    "start_timestamp_seconds": 651.0,
    "end_timestamp_seconds": 714.0,
    "start_timestamp": "10:51",
    "video_url": "https://www.youtube.com/watch?v=1kGksRBt2aA",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1kGksRBt2aA&t=651",
    "chunk_index": 8,
    "word_count": 197,
    "upload_date": null,
    "duration": 716.0
  }
]