[
  {
    "text": "I love me some irony. This video is going to be about irony. It's going to be about Andrew left in Citroën research and what's going on with them because there's some really interesting information that's starting to come out with a recent DOJ filing, which we're going to go into all of that. This is primarily going to be about that with a quick recap of Game Stop's expiration today. So for those tuning in, today's about Game Stop for two days in a row, they don't have to get over it for those that want to see something else. We will have time for that for sure, but there's always time in the schedule for just some solid irony. So here we have Citroën research, Andrew left firm. And this was back on three June. And in here it says, we, what made Keith Gil interesting initially was his authenticity. Skip a bunch of words. This time it feels different, appearing more like manipulation without a solid thesis. Now again, trying to be as objective as humanly possible, I could see a world where somebody could think that. If you don't know anything else about Rowan Kitty and you probably operate in a really scummy place where people do stuff like that all the time, sure, maybe. But here's the irony. Andrew left 54 charge with a 16 million stock market manipulation scheme. But, but, but Rowan Kitty is the one manipulating things. Love that. Just love that.",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 24,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=0"
    }
  },
  {
    "text": "you probably operate in a really scummy place where people do stuff like that all the time, sure, maybe. But here's the irony. Andrew left 54 charge with a 16 million stock market manipulation scheme. But, but, but Rowan Kitty is the one manipulating things. Love that. Just love that. It's one of the best ways to try and keep the spotlight off you is to cast rocks at other people for the shit that you're doing. So I want to highlight for the non GME folks, something to be aware of. The ape community, which I still very much view myself as a guest, I do not have the depth with the entire story. I'm still learning about it literally every day. I am not as well versed in this stuff as everybody else. But I begin to understand their perspective of the world of markets and why they say and think the way they do at times. Because if you talk to an ape or somebody that's been around the GME community, they'll pretty much tell you that everything's rigged. It's all bullshit. And I don't fully fall into that camp myself. I do think that a lot of the market is efficient to a degree. I don't think it's perfectly efficient to a degree. But also to their credence, there's very clear examples of this shit, a very clear manipulation. So as I try to remind you guys, my goal when I'm reviewing any sort of information,",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 24,
      "start_timestamp": "00:01:09",
      "start_timestamp_seconds": 69.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=69"
    }
  },
  {
    "text": "of the market is efficient to a degree. I don't think it's perfectly efficient to a degree. But also to their credence, there's very clear examples of this shit, a very clear manipulation. So as I try to remind you guys, my goal when I'm reviewing any sort of information, specifically investing, trading, financial information to come up with ideas, I want to try be as objective as possible. How can I look at this information and strip away as much of my bias as I can, acknowledging the fact that it's never fully gone. It'll still be there to a degree. But I want to be cognizant that it's there. And I think for the people that are not as close to the ape community, the GME story stuff like this, I think those people sometimes are in Lalla land where they think that markets are efficient. It's all fair. It's competitively priced. And then that's one of the reasons why some of those folks might make the jump and say, oh, the GME community, they're all tinfoil hats, conspiracy theorists, they've all gone off the deep end. And it's so easy to dismiss broad concepts and ideas like that and lose all of the nuance because something gets people to that level. So what I would say for the people that aren't familiar with the GME story, this is why, this is why you have people in the ape community that are like, this is all bullshit. And",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 24,
      "start_timestamp": "00:02:30",
      "start_timestamp_seconds": 150.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=150"
    }
  },
  {
    "text": "that and lose all of the nuance because something gets people to that level. So what I would say for the people that aren't familiar with the GME story, this is why, this is why you have people in the ape community that are like, this is all bullshit. And how could you blame them? You have some dude that's throwing rocks at somebody talking about manipulation. Yet this guy has what, 17 counts of securities fraud and one count of securities fraud scheme. That's really difficult to reconcile. Now for the GME folks, I also think it's important to not go too far to where you think everything is rigged. Because then it kind of begs the question, why even do I do anything here? So to me, the truth typically lies in the middle of perspectives like this to a degree, but it is really important to acknowledge that when people hear about GameStop, the ape community, the GME movement, like all those kinds of things, it's not this radical idea. There are clear and very straightforward elements of different kinds of market manipulation to different degrees, different kinds of fraud that are in broad fucking daylight that nothing has happened for a long time. And now it looks like the SEC is finally doing something. Now this goes down a whole other path where I see people saying like, oh, well, this doesn't fix anything or this is just a drop in the bucket. And I don't",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 24,
      "start_timestamp": "00:03:40",
      "start_timestamp_seconds": 220.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=220"
    }
  },
  {
    "text": "nothing has happened for a long time. And now it looks like the SEC is finally doing something. Now this goes down a whole other path where I see people saying like, oh, well, this doesn't fix anything or this is just a drop in the bucket. And I don't disagree. This doesn't inherently fix anything. This is not even anything yet. Right? These are just charges. This is just an accusation technically. He's not convicted of shit. So we're at the very infancy of all of this. But what I try to remind people is that it's a step in the right direction. And if you ever get to the point where you're so disenfranchised that a step in the right direction still is meaningless to you, then you probably got to try and re-centred yourself just a little bit so that you can at least see that this is at least a positive direction. Does this entirely fix everything? Absolutely not. Absolutely not. But it's something. And seeing stuff like this starting to come to light is encouraging to me. So I'm excited to see it. Plus, again, like I said in the beginning, I love me some irony, especially when you have some sort of shitty person like this that's throwing rocks at somebody else that's being accused of this. Now it is important to say that he's charged. He's accused of this. This doesn't mean he did this. And again, trying to be middle of the",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 24,
      "start_timestamp": "00:04:54",
      "start_timestamp_seconds": 294.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=294"
    }
  },
  {
    "text": "irony, especially when you have some sort of shitty person like this that's throwing rocks at somebody else that's being accused of this. Now it is important to say that he's charged. He's accused of this. This doesn't mean he did this. And again, trying to be middle of the road and to try to allow the system some time to work, then based on the rest of the evidence that we see, based on the arguments that come out, then we can make a decision in an educated one. But right now he's just charged with this stuff. So I probably, again, like to just bear myself to you guys, my bias is I think this dude did this shit. I do think that. But I'm not going to let that bias dictate to me that I conclude with him being charged that he did do it. I need to see the information still. But I do lean that way. Now the other important thing here is that he might have done some of this. Typically when people are going to be charged like this, the DOJ is going to come with everything that they can find in the hopes that as much of it sticks as possible. There's also a reality where he did more than this. And this is just what the DOJ thinks that they can pin to them. All of that boils down to the fact that something is happening here. And I'm really, really",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 24,
      "start_timestamp": "00:06:04",
      "start_timestamp_seconds": 364.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=364"
    }
  },
  {
    "text": "hopes that as much of it sticks as possible. There's also a reality where he did more than this. And this is just what the DOJ thinks that they can pin to them. All of that boils down to the fact that something is happening here. And I'm really, really excited to see how this plays out and what kind of attention this gets. That's the thing. That's why I'm making a video about it. I'm not an attorney. I don't know anything about any of this stuff. I, like I said, I don't even know that much about GameStop. I've been learning about it for a few months now. And I have a long way to go before I fully know all the details in the story. But I'm really excited to see this. And I'm trying to help spread information about it because I think it's important that this shit gets out far and wide so that people can stop looking at the GME and the apes is just tinfoil had, people that have gone off the deep end and start to understand some of the perspective. But then also to see that there's some bullshit going on in the market. And people need to be aware of it. And I see this as the DOJ finally starting to even pretend to do something about it. Whether I'm eager to see how this goes based on another case recently with Atlas and all those guys. There was some",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 24,
      "start_timestamp": "00:07:13",
      "start_timestamp_seconds": 433.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=433"
    }
  },
  {
    "text": "in the market. And people need to be aware of it. And I see this as the DOJ finally starting to even pretend to do something about it. Whether I'm eager to see how this goes based on another case recently with Atlas and all those guys. There was some nasty components to that that left a bunch of those guys getting off, which is kind of frustrating to see because that one was also pretty clear based on the evidence that I saw that there was some shady things going on. But because of some technicalities, essentially quite a few of them got off. Which the funny part about that though is one of them took a plea deal in the beginning. And I think that one that one took the plea. So they obviously are getting hammered to a degree where everybody else got off because they fought through it. But I mean they rolled the dice and they were able to navigate it. So I guess that part is okay for them, but it's shitty to see that case go like that. So I hope this doesn't follow that example. But let's see what this is. So it says if convicted, he faces up to 25 years in prison on the securities fraud scheme 20 years in prison on each securities fraud count. So there's 17 of those depending on what the average lifespan is and depending on how fast Elon Musk can start implant and chips",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 24,
      "start_timestamp": "00:08:03",
      "start_timestamp_seconds": 483.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=483"
    }
  },
  {
    "text": "it says if convicted, he faces up to 25 years in prison on the securities fraud scheme 20 years in prison on each securities fraud count. So there's 17 of those depending on what the average lifespan is and depending on how fast Elon Musk can start implant and chips and people's brains and replace and limbs. We'll see. But based on current human biology, this is the rest of this dude's life in five years in prison on the false statements count. This one right here. Separately, the SEC's complaint alleges that left engaged in a 20 million multi-year scheme to defraud followers by publishing false and misleading statements regarding his supposed stock trading recommendations. The SEC is seeking dis-gorgement not going to lie. No idea what that means in this context. Act of giving up something. Okay. So you got to give stuff up. Prejudgment interest and civil monetary penalties against left and his companies to try and conduct based injunctions and officer and director bar and a penny stock bar. So essentially not letting him participate securities. The other side, I think that the government interest is trying to regulate through cases they prosecute as a result of a mean stock craze. Left has been around since 2001 his attorney tells Axios these guys. The DOG's indictment is based on contorted rhetoric, trying to make it appear like he was telling lies and there was not one lie alleged that he's provable. Love that. I mean, listen,",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 24,
      "start_timestamp": "00:08:59",
      "start_timestamp_seconds": 539.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=539"
    }
  },
  {
    "text": "of a mean stock craze. Left has been around since 2001 his attorney tells Axios these guys. The DOG's indictment is based on contorted rhetoric, trying to make it appear like he was telling lies and there was not one lie alleged that he's provable. Love that. I mean, listen, shout out to the attorney. He's not even trying to play anything other than technicalities. He's not saying my boy didn't lie. He's not saying my boy did lie. He's just saying, proving which is hilarious. So this is epic and it says left is expected to be arraigned in the next few weeks in the US District Court in downtown LA. So here's the rest of the statement you guys are free to look through this as much as you want. It's kind of essentially a a double down. This was just like a good synopsis that you could check out, which is pretty good. And let's see, there was a couple of other statements from this lawyer here. It says the investor plans to fight the charges. There is no crime here. He said Mr. Left is a publisher who has taken extraordinary steps to comply with all laws and neither the DOJ nor the SEC alleged that he ever once published information, he believes was not true and published. That's a notice that right? He believed was not true and published. So his attorney, again, I'm not a lawyer. There's probably going to be really good lawyers",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 24,
      "start_timestamp": "00:10:18",
      "start_timestamp_seconds": 618.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=618"
    }
  },
  {
    "text": "laws and neither the DOJ nor the SEC alleged that he ever once published information, he believes was not true and published. That's a notice that right? He believed was not true and published. So his attorney, again, I'm not a lawyer. There's probably going to be really good lawyers that look at this stuff. But for me, I'm seeing that is provable. And in this case, he believed not true when published, right? New wants. They're looking for new wants here. So that's interesting because there's not a statement here saying that he didn't do this. Again, they're being really calculated what they're saying, which I actually think is smart from his attorney's perspective. So I mean, this is been fascinating to see going down. I'm excited to see where it goes. And yeah, let's see a quick look at GameStop now. So today was, I mean, one of the most inside days you can think of, we had a high of 2477 in a low of 2411. Yep. You heard that right. That is a just tiny range for the stock. 66 cents is all it moved today. It just hung out pretty rock steady here. I don't think anybody really anticipated anything else. The stock has been quieting down. Today's sale volume was massive, 97 sale volume. And you can see even though that it was that much sale volume, the stock didn't move a ton. So again, it's just hanging right around this area of support",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 24,
      "start_timestamp": "00:11:29",
      "start_timestamp_seconds": 689.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=689"
    }
  },
  {
    "text": "think anybody really anticipated anything else. The stock has been quieting down. Today's sale volume was massive, 97 sale volume. And you can see even though that it was that much sale volume, the stock didn't move a ton. So again, it's just hanging right around this area of support and resistance. And the other thing I want to make a quick note about, there's been a couple videos where I say like technical analysis doesn't matter. And I realize people are taking that literally rightfully so because that's what I'm saying. But I just want to clarify what I mean by that. When we're looking at something like this, technical analysis is essentially a study of human behavior and habits. So when we look at standard technical analysis, we're trying to make inferences based on standard human behavior and how that essentially leads to different behaviors in the markets. The reason why I say technical analysis doesn't work really what I should be saying is standard technical analysis doesn't work because the things that you would typically apply in a quote unquote normal technical analysis approach depending on how colorful or how quantitative you want to get don't really hold here. So what that means is, for example, when I'm figuring out what kind of technical analysis tools, I want to use the standard deviation channels, the different moving averages, the volume profile. I'm not just picking stuff that I think I can see trends. I'm testing it. I",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 24,
      "start_timestamp": "00:12:40",
      "start_timestamp_seconds": 760.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=760"
    }
  },
  {
    "text": "hold here. So what that means is, for example, when I'm figuring out what kind of technical analysis tools, I want to use the standard deviation channels, the different moving averages, the volume profile. I'm not just picking stuff that I think I can see trends. I'm testing it. I have a really large data set that I've purchased from SIBO that includes underlying and options data. So I test the objective performance of the different tools by themselves. That means without my interpretation of them, how does this tool objectively work? What is its overall efficacy? How frequently? What is the standard deviation of the variance from whatever its alerts or signals are? So that I have an understanding of the tools. That's why I have what I have. And when I do all of that with GameStop, all of the standard relationships that I see generally break down, they go away. Stuff that I see in literally hundreds of other underlines does not work here. So that's what I mean because what I can tell you is that the frequency that you see things that go from 995 to 65 80 plus pre-market is seldom. That's not normal. So when you think about the application of standardized technical analysis, you're trying to pick up on standardized behavior. So support in resistance, the idea that every time price gets to this level, people continue to buy it or sell it, keeping it within a certain range of some sort.",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 24,
      "start_timestamp": "00:13:47",
      "start_timestamp_seconds": 827.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=827"
    }
  },
  {
    "text": "So when you think about the application of standardized technical analysis, you're trying to pick up on standardized behavior. So support in resistance, the idea that every time price gets to this level, people continue to buy it or sell it, keeping it within a certain range of some sort. That's what it infers. That doesn't work here because the other thing that you probably would assume then is as soon as it started getting up here, where is that 16 from 10? It just kept going up. And then why would it keep going from here? So I'm not saying that it can or can't. But what I'm saying is that the standard analysis that you would apply to things like this, there are so many anomalies when you look at the price performance of the stock that standard analysis breaks down. So I make that differentiation because the way that I look at this is through technical analysis, but it's very modified. The way that I interpret the information that I'm looking at is very different than if I'm looking at something like Apple, the way that I'm going to analyze price, I mean, just look at the difference in the chart. It looks completely different. And if you look at most other large cap stocks, the chart will look something like this. So what I'm highlighting to you is that when you look at something like GameStop or even things like biotech stocks, it's not specific to",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 24,
      "start_timestamp": "00:15:03",
      "start_timestamp_seconds": 903.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=903"
    }
  },
  {
    "text": "difference in the chart. It looks completely different. And if you look at most other large cap stocks, the chart will look something like this. So what I'm highlighting to you is that when you look at something like GameStop or even things like biotech stocks, it's not specific to just GameStop. But there's a completely different series of catalysts that are moving the price. And that leads to different price behavior and air go, different requisite analysis needed in order to apply technical analysis. Because if you're applying standard technical analysis, this will leave you behind over and over and over again. So yeah, things that I really like to wait in terms of analysis are price and volume, right? That's standard. And for me, that's one of the biggest things here. Because when you look at stuff like this, the moving averages are ascending, they're widening in terms of the distance between them. There's no reason technically from a moving average perspective why this would crater like that. If these are doing that, that typically means you'll get some level of continuation. It's across all of them. It doesn't happen here. And it's because of a bunch of structural reasons that lead this to behave very differently. So I just wanted to clarify that. I'm not saying that you can't apply technical analysis. I do all the time. It's how I find the trades. But what I really am trying to say is that there is a different",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 24,
      "start_timestamp": "00:16:06",
      "start_timestamp_seconds": 966.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=966"
    }
  },
  {
    "text": "structural reasons that lead this to behave very differently. So I just wanted to clarify that. I'm not saying that you can't apply technical analysis. I do all the time. It's how I find the trades. But what I really am trying to say is that there is a different kind of analysis required when you're looking at stuff like this. That's all. You'll find periods, especially going back over the last three years, where Bollinger bands are telling you that something is supposed to explode. They're super constricted. And then nothing happens. And it doesn't happen for weeks. So it's a really, really nuanced product. I'm actually in the process of analyzing tons of different indicators just because it's so anomalous to me. And I want to know the other indicators that I don't technically use that much. Maybe they work even better in this than what they work in the other products that I tend to trade. That's the fun part about something like this, about something that behaves so differently. So yeah, there's that. All right, let's take a look at the options quick. We got a few things going on. Volume today 161,000 calls versus 51,000 puts. And if you take a look, it again looks like more positions moving out at the 25. So at the 25, we had 22,000 volume in the front expiration. And then in two aug, Nest week next week's expiration, we had 14,938. To me, I would assume I've been",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 24,
      "start_timestamp": "00:17:13",
      "start_timestamp_seconds": 1033.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=1033"
    }
  },
  {
    "text": "puts. And if you take a look, it again looks like more positions moving out at the 25. So at the 25, we had 22,000 volume in the front expiration. And then in two aug, Nest week next week's expiration, we had 14,938. To me, I would assume I've been looked at this yet. I would assume if I open this up, the 25s will have decreased from yesterday. And my guess is, well, they're all going to be gone now because they expired. But that's my first guess. Let's see. 25s, did they damn it? Completely wrong. That surprises me. So anyways, my hypothesis was starting yesterday. I thought that most people were rolling out. Now, we'll be able to see how many of these did move out net net because there was a lot of volume yesterday. So it just means that not all of it was rolling out. It means that some people were opening positions here. So now let's take a look at the two aug. And my guess is the 25 strike, the 25 calls would be expanding in OI. That's my guess here. Let's see. Okay, got that one right. We're one for two, which doesn't mean much. So I would throw essentially everything I say out. But what I also can tell you though is objectively speaking, there's 15,000 volume against 10,500 OI. So there is going to be at least another 4,000 plus added onto this. So people are still scaling into",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 24,
      "start_timestamp": "00:18:13",
      "start_timestamp_seconds": 1093.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=1093"
    }
  },
  {
    "text": "which doesn't mean much. So I would throw essentially everything I say out. But what I also can tell you though is objectively speaking, there's 15,000 volume against 10,500 OI. So there is going to be at least another 4,000 plus added onto this. So people are still scaling into these 25s. That's for sure. So this surprised me a little bit to see people still opening 25s. But there was enough of people opening 25s that it accounted and overwhelmed the number that we're moving out, rolling out to this. That's essentially what that means. And the reason why I didn't edit any of that out and make it look like I know is because I think you guys should be completely full well aware that it were wrong. Traders are wrong all the time. I am literally wrong all the time. Nobody knows everything. One of the worst things that you can find in somebody is that they make a bunch of guesses predictions. And then the only thing you hear from them is when they eventually get something right. That right there is somebody who's too tight to their ego and they're a bullshit artist. They don't want you to look at the failed track record. They only want you to look at all this shit that they got right. However, a few or a large that is compared to the sample that was wrong. And from a consumption standpoint in terms of receiving information, you guys",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 24,
      "start_timestamp": "00:19:19",
      "start_timestamp_seconds": 1159.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=1159"
    }
  },
  {
    "text": "want you to look at the failed track record. They only want you to look at all this shit that they got right. However, a few or a large that is compared to the sample that was wrong. And from a consumption standpoint in terms of receiving information, you guys have to be so careful of that because there's so many people that just like seeming infallible and it's bullshit. We're wrong all the time. I'm literally I was literally just wrong. So don't ever listen to somebody just blindly and think that because they're making a video or doing something like this that they know what the fuck they're talking about. We're all figuring it out together. So I just think it's so important to reiterate that message because I see a lot of people sending stuff in of all these different people coming up with these different theories and ideas about what might happen in that school. But the problem is is that if you buy into them each one of them thinking, okay, this is the one and then this is the one and then it continues not being the one that leads to a disenfranchised human being that then when there might be really good information, they're just like, ah, it's all bullshit. None of this matters. And it sends you down that path, which to me is not an effective path, especially for something like trading. So yeah, completely wrong there. Back to this though.",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 24,
      "start_timestamp": "00:20:29",
      "start_timestamp_seconds": 1229.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=1229"
    }
  },
  {
    "text": "being that then when there might be really good information, they're just like, ah, it's all bullshit. None of this matters. And it sends you down that path, which to me is not an effective path, especially for something like trading. So yeah, completely wrong there. Back to this though. I see a few other things going on. As you can tell, the two-walk is still being built out. Let's see to what degree though. So if we check out the OI and interesting. So this is starting to scale up more. So we're now at 750,000 total calls to 400,000 total puts. So this is now getting closer and closer and closer to being at least two to one calls to puts, which again, that's the general configuration that I've seen previously when this thing was starting to make big moves up. It's still not there to be very clear. We still have a ways to go. But it's at least drifting that way. And then let's take a look at these expiration. So the two-walk has 71,000 versus 34,000. So it's essentially two to one, but very light. There's not a lot of conviction and two-walk. Nine-walk is 26 to 9,000. Just not much there. 16-walk is the next one. And again, this is almost two to one 200,000 calls to 109K puts. So this to me looks like the next expectation of a busy cycle. Which again, this aligns beautifully. This is very standard for options. This",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 24,
      "start_timestamp": "00:21:25",
      "start_timestamp_seconds": 1285.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=1285"
    }
  },
  {
    "text": "26 to 9,000. Just not much there. 16-walk is the next one. And again, this is almost two to one 200,000 calls to 109K puts. So this to me looks like the next expectation of a busy cycle. Which again, this aligns beautifully. This is very standard for options. This is not novel to GameStop where you tend to see more activity in the monthly explorations. They're more liquid. That's what's happening here. Now, if I'm not mistaken, there was a couple bigger positions being built out. Yeah. So like these, I've been keeping an eye on these 24s. And it's because it's not a ton of options, but they're right at the money. And there was another 2,000 traded today. I'm assuming not all of that is closing. I probably would wager more of that is opening than closing. And net over yesterday was plus 1,500. So people are starting to build out these 24s. That's interesting because these are right at the money. As people are buying stuff like that, it forces the market makers to consider how they want to manage that position. So it's already over a 50 delta. It's only got seven days left to go. So you don't want to not have the underlying in order to hedge these if you get an even moderate price accommodation and they fall further in the money because then you have to start hedging the rest of these that are now bigger by buying more and more",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 24,
      "start_timestamp": "00:22:31",
      "start_timestamp_seconds": 1351.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=1351"
    }
  },
  {
    "text": "go. So you don't want to not have the underlying in order to hedge these if you get an even moderate price accommodation and they fall further in the money because then you have to start hedging the rest of these that are now bigger by buying more and more shares. Notice the configuration here. This is actually interesting to me. 2,000, 1100, 10,000, 1,000, 3,000, 1,000, 2,000, right? That's a lot of shares. And they're all stacked like that. So as market makers go out and they have to buy the 24s by to cover the 24s, I should say, then that could conceivably push the 24 and a half in. Then the 24 and a halfs go in. Then we have to buy to hedge those and that could push us just enough to put us into the 25s, which is a much bigger strike. Now we got to buy even more, which can easily push you to the 25s and a half to the 26s over the cat. And you get what I'm talking about. This is essentially what starts a gamma squeeze. Now I don't want to get people's hopes up. I think you would need much deeper options chains, but it wouldn't surprise me to see a smaller element of that potentially go with that kind of buying behavior because it's solo volume because it's solo volume because there's not a ton of transactions happen on a daily basis. Those kinds of relative style transactions",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 24,
      "start_timestamp": "00:23:38",
      "start_timestamp_seconds": 1418.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=1418"
    }
  },
  {
    "text": "much deeper options chains, but it wouldn't surprise me to see a smaller element of that potentially go with that kind of buying behavior because it's solo volume because it's solo volume because there's not a ton of transactions happen on a daily basis. Those kinds of relative style transactions can start to have a bigger impact on the chain. But again, going all the way back to what I was saying, nobody knows, nobody is, is been omnipotent. I don't know if you should think anybody's got it right yet. So what I'm talking about should be completely filtered very heavily so that you are doing what's right for you. But that's just an interesting function here. Again, in order for this to be like a true gamma squeeze or something like that, these would have to be really heavy. And we would need the market makers essentially punch each other in the face so that they can grab shares so that they can cover theirs, which would make it more difficult for another market maker to get their shares, really skyrocketing price. I don't necessarily see that here, but I do see an interesting stacking of OI for all of these right at the monies, which that is interesting to me. We'll have to see if that leads to some sort of upside pressure in the underlying. I just realized I'm already at 25 minutes rambling about this. So I am going to wrap it up here. If",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 24,
      "start_timestamp": "00:24:32",
      "start_timestamp_seconds": 1472.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=1472"
    }
  },
  {
    "text": "all of these right at the monies, which that is interesting to me. We'll have to see if that leads to some sort of upside pressure in the underlying. I just realized I'm already at 25 minutes rambling about this. So I am going to wrap it up here. If there's any questions, let me know. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "1O0HX-C-4PU",
      "title": "Andrew Left Fraud and GME Options",
      "url": "https://www.youtube.com/watch?v=1O0HX-C-4PU",
      "upload_date": "",
      "duration": 1554.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 24,
      "start_timestamp": "00:25:34",
      "start_timestamp_seconds": 1534.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=1O0HX-C-4PU&t=1534"
    }
  }
]