[
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "you you you you you you you you you you you you you you you you you you people think about trading something like that. My guess is for a lot of people in the game stop community is probably just buy and hold dollar cost average, which again, that's not about answer. That can work just fine. But I'm curious what the idea here is. Reggie says sell when it gets above 25. So Reggie talked to me when it gets above 25 do you mean that you're selling shares that you had bought before and then looking to get back in or do you mean something else? Okay. So calls above 25 got it. Okay. I could see that. Lawrence says bought the dips. I think that generally makes sense as well. And again, if I were to guess what the majority of the game stop community that does trade something like this would do, it would be that. It would be some form of just accumulating. And the reality is accumulation there, it's not bad. But there's something that we have to pay very, very close attention to when we're doing some sort of accumulation phase. And let's work through this together. Again, my hope at the end of the stream today, I don't have anything planned. This is all just stuff that I'm kind of thinking about as I'm sitting here looking at this with you guys. My goal at the end of the stream is",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 501.36,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "let's work through this together. Again, my hope at the end of the stream today, I don't have anything planned. This is all just stuff that I'm kind of thinking about as I'm sitting here looking at this with you guys. My goal at the end of the stream is for you to at least walk away with a couple tools in the toolbox for trading something like GameStop because GameStop is extremely unique, extremely unique in what it is, how it behaves and how it can be traded. So I want to talk about that. Let's first just start with a scenario. Let's say we have $25,000. We have 25 grant and you decide that you're going to buy GameStop. Let's walk me through this. If you had $25,000 now, whether you have more or less doesn't matter to me, just step into this scenario with me. If you had $25,000 right now and you were to build a position in GameStop, what would the position be? And for context, GameStop's current price is not a nickel. We're going to call it 2160. So we're going to call Spot Price 2160. So what's the move here? How are we thinking about doing this? We have our position allocation is 25 grants. Spot Price right now is $21.60. What do we think? TCM says at this level, I would buy January 2620 calls. Okay, so we could take a look at that. So we have January 2620 calls and would",
    "start_timestamp_seconds": 487.4,
    "end_timestamp_seconds": 608.24,
    "start_timestamp": "08:07",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=487",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "thinking about doing this? We have our position allocation is 25 grants. Spot Price right now is $21.60. What do we think? TCM says at this level, I would buy January 2620 calls. Okay, so we could take a look at that. So we have January 2620 calls and would you use the 25 grant there? Is that the move? Brian says $12.50. Does that mean that you would buy $12.50 worth or what's the scenario you're thinking Brian? Reggie says buying shares under 22 is a great entry to just buy shares. Okay, great. And Reggie, for your trade of this $25,000 were below 22 right now. So what do we think? Do we use the 22 or do we use the 25? Okay, or do we use some subset of that? What do you think? I want to walk through this in detail because I want to show you guys a few things. And hopefully it will be useful, I think it will. Now the first thing is, okay, so TCM would effectively use the 25. So we have one scenario where we are 100% allocated or utilize, sorry. We have one scenario where we are 100% utilized. So this will be 100% of the position. Reggie says, I go all in at this price given the floor. Okay, so we have two, so we have buying these with 100% and then we have buying all shares with 100% capital. Okay. So let's talk about it. TCM says",
    "start_timestamp_seconds": 586.44,
    "end_timestamp_seconds": 727.96,
    "start_timestamp": "09:46",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=586",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "So this will be 100% of the position. Reggie says, I go all in at this price given the floor. Okay, so we have two, so we have buying these with 100% and then we have buying all shares with 100% capital. Okay. So let's talk about it. TCM says I like short puts here, but I think upside is greater at this level. It's a great topic which we'll talk about as well. First things first, if I were to build a position here in GameStop personally, this is what mine would probably look like. If I have $25,000 to use, the first thing I'm going to do is eyeball where are we in relative ranges. Over the last three years, we are up a handsome amount still about 115% from the presquees lows. Now a lot of stuff has changed. So we can see that there is kind of a new proverbial floor being priced in. However, that floor got challenged pretty massively because it used to look like the floor was around here. And then we've just recently cracked below that 22 handle. So now we find ourselves closer to like this 20 and a half handle floor. So the first thing I'm saying to myself is how confident am I in this 20 and a half handle floor, meaning that generally speaking, GameStop would be broadly disincentivized from going below 20 and a half. That starts to get into a lot of fundamental analysis and stuff.",
    "start_timestamp_seconds": 697.28,
    "end_timestamp_seconds": 818.64,
    "start_timestamp": "11:37",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=697",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "floor. So the first thing I'm saying to myself is how confident am I in this 20 and a half handle floor, meaning that generally speaking, GameStop would be broadly disincentivized from going below 20 and a half. That starts to get into a lot of fundamental analysis and stuff. That's worth your consideration broadly, but a little too time consuming for here. So what I'm doing instead is I'm just using some prior benchmarks. I'm going back and I'm seeing that price here was sub 20, not that long ago. Here it's sub 20, here it's sub 20. Again, a lot has changed, but this is still sub 20. So if I were to ballpark, where do I think like a true floor might be? You could use the intrinsic value of the company, which I actually don't know what that is right now. I'm going to ask, rock. I have no idea what the actual intrinsic value is. What is the per share intrinsic value of GameStop stock? Let's see what crox is. The reason why I'm using this is in my mind, I need to come up with some sort of calculus on how I want to scale because one thing I can tell you that I would differ greatly from everybody so far is that I would not use 100%. There's no way I would use 100%. And it's because as soon as you use 100%, you are now stuck and even a rudimentary search of",
    "start_timestamp_seconds": 794.0,
    "end_timestamp_seconds": 903.16,
    "start_timestamp": "13:14",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=794",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "scale because one thing I can tell you that I would differ greatly from everybody so far is that I would not use 100%. There's no way I would use 100%. And it's because as soon as you use 100%, you are now stuck and even a rudimentary search of recent history shows that this thing going sub 20, although I instinctually would say really unlikely, doesn't mean that it can't happen. And more importantly than that, it doesn't mean that if it did happen or some version of that did happen, that it couldn't happen for months, just like you saw here where it literally just went completely sideways, effectively for an entire quarter. So I wouldn't want to be stuck there because the risk that we run, if we use 100% of the money and then it does take a bit of a step down, well, now you're kind of in a little bit of a sticky scenario. And again, I'll show you why. You've essentially handcuffed yourself in terms of what kind of basis adjustment you could get. Okay, so let's see. So, Brock says, it looks like a bunch of them are saying $35 a share. A growth exit DCF model is at 1873. That sounds more correct to me. A projected free clash free cash flow model guru focus. I don't know who that is. 759, that seems really, really low. And then base case scenario from Alpha spread, don't know who that is, says",
    "start_timestamp_seconds": 881.48,
    "end_timestamp_seconds": 986.4,
    "start_timestamp": "14:41",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=881",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "A growth exit DCF model is at 1873. That sounds more correct to me. A projected free clash free cash flow model guru focus. I don't know who that is. 759, that seems really, really low. And then base case scenario from Alpha spread, don't know who that is, says 466. That also seems just obviously way too low. Because even though the company is not cash flowing massively from sales and stuff, it still does have a pile of cash and it has a lot of cash. So I don't think those like single digit estimates are correct. Like my gut says something high teens low 20s. That would be my expectation of a potential floor. And again, I'll show you why this matters to me. Because if I'm thinking about how do I want to set up this position? Well, the first thing is it really two years out where that is. Anyways, what I want to do is see how much money can I use here based on my confidence interval that it might have some sort of downside move and to what level. Guess what we can use to help us. Options. Now before I get into doing a little bit more of like this detail analysis that I'm explaining to you, this is my gut reaction, my gut reaction before we validate anything. Is that I would probably want to target utilization around 80% right now. That's closer to where I would be. So that",
    "start_timestamp_seconds": 969.4,
    "end_timestamp_seconds": 1073.88,
    "start_timestamp": "16:09",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=969",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "into doing a little bit more of like this detail analysis that I'm explaining to you, this is my gut reaction, my gut reaction before we validate anything. Is that I would probably want to target utilization around 80% right now. That's closer to where I would be. So that 80% utilization gives me three octo. I'm just kidding. It's all formatting. It gives me 20 grand to use. Now of this 20 grand, I need to figure out how I want to split this up. Now for me personally, even though the equity here looks like a good value and it is, I wouldn't want to be mostly equity here. Why not? The reason is because when you trade equity, you make money when the thing goes up. If it's not going up, you don't make money. And if it goes down, lose money. Right now it's going down. And also again, if I had bought 100% here when it was 23, and then I had gotten out effectively before the next earnings on that quarter, I would be about flat. I would have made nothing, but I would have tied up that money for an entire quarter. Now again, the one thing I want to make sure that is exceedingly clear to everybody is that I'm a trader that means that I'm trying to maximize price fluctuations and spend less time just holding things and waiting. There's nothing wrong with holding things and waiting. So if somebody says,",
    "start_timestamp_seconds": 1050.04,
    "end_timestamp_seconds": 1160.24,
    "start_timestamp": "17:30",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=1050",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "again, the one thing I want to make sure that is exceedingly clear to everybody is that I'm a trader that means that I'm trying to maximize price fluctuations and spend less time just holding things and waiting. There's nothing wrong with holding things and waiting. So if somebody says, well, I'm an investor, why would I do this? You wouldn't. There's no reason to do this. If you're an investor and you like to stock long term, beautiful spot to get in. Literally a beautiful spot to get in. But if you're not that in your somebody that's like me, where I'm trying to generate capital and make a profit even when it's doing stuff like this, that's my world where at the end of this quarter, if I bought 100% of my capital here, and then even if I got the move to here, right, let's see what return on that money is. Even if I top-ticked it, that's 19%. I would have made a 19% return on the capital over the course of five months almost. So if I break that out to a per month return, it really is not great. It's a fairly poor return for a more speculative trade like this. So I'm just giving you my lens for the trading side, which is very different from the investing side. Okay. Now, we have 20 grand to use again. I'm going to validate these numbers. I'm just literally giving you my gut feel, and",
    "start_timestamp_seconds": 1138.4,
    "end_timestamp_seconds": 1227.88,
    "start_timestamp": "18:58",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=1138",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "for a more speculative trade like this. So I'm just giving you my lens for the trading side, which is very different from the investing side. Okay. Now, we have 20 grand to use again. I'm going to validate these numbers. I'm just literally giving you my gut feel, and then we'll see how close it is to what actually makes on this. So of this 20 grand, I need to split this up. There's essentially three ways that I would play this. The first way is with a coverage triangle. Within the coverage triangle, there's going to be short puts and long stock. This is the base position. This would be the main position that I would have on. I need to figure out of this 20 grand, how much does this get? Now, again, my typical instinct, I would be probably 15 to 17.5, something like that. So let's call it 15. 15 grand. This is going to get $15,000. The last strategy that I would use here is long calls of some short of some sort. Notice how I didn't say ratio called diagonals. If you're not familiar with the words that I'm saying, they're just different option strategies. Now, a ratio called diagonal simply is an options version of a covered call with some minor tweaks. But I wouldn't do that here. Why? Because I kind of have this already. And this is already generally serving that purpose. The purpose of a ratio called diagonal is",
    "start_timestamp_seconds": 1211.52,
    "end_timestamp_seconds": 1315.96,
    "start_timestamp": "20:11",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=1211",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "option strategies. Now, a ratio called diagonal simply is an options version of a covered call with some minor tweaks. But I wouldn't do that here. Why? Because I kind of have this already. And this is already generally serving that purpose. The purpose of a ratio called diagonal is to decrease your gamut exposure, decrease your theta exposure, and have something that's a levered stock position. That's kind of where we're at here. So no need to duplicate. So for the long call of strategy in general, what am I looking for? I'm looking for really aggressive moves. What's the issue with long call style strategies in something like game stop? The issue is that if it does go into a squeeze, which in my opinion, it is not primed in any way for right now, I can't see anything that would leave me to believe that, then if it does find its way into a squeeze, my ability to actually exit my calls and make money is really challenged. And it's because of how much volatility comes into the market. So I actually wouldn't be looking to wait the long calls that much, especially during a squeeze. During a squeeze, I want to be in the equity way more liquid, way more liquid. And you stand a much better chance to get a decent price on your exit. Now that doesn't mean that I wouldn't use long calls, I still would, and I did during the prior squeezes.",
    "start_timestamp_seconds": 1293.36,
    "end_timestamp_seconds": 1394.28,
    "start_timestamp": "21:33",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=1293",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "a squeeze, I want to be in the equity way more liquid, way more liquid. And you stand a much better chance to get a decent price on your exit. Now that doesn't mean that I wouldn't use long calls, I still would, and I did during the prior squeezes. There's still something there. But it's really important to note that based on the price of the thing that you're trading, you're giving up a lot. And the market is taking their pound of flesh because one thing that really rattles market makers and other liquidity providers is that as soon as things go just absolutely ballistic haywire, that's a massive risk scenario. So they're absolutely going to charge a premium with respect to liquidity because like, there are some on the line now. And they're taking legit risk. So what that means is a lot of the times that I'm going to be using this long call capital is very, very specific. So how do I become really, really, really efficient? The way that I would go about this personally is I would actually bump up how much the coverage triangle gets. And I would be prepared to pair this back down to 15k immediately in order to allocate the $5,000 to the long calls. But just because the long calls are going to get allocated $5,000 doesn't mean that I immediately going to employ it here. In this case, I probably wouldn't. So what does this all summarize",
    "start_timestamp_seconds": 1378.0,
    "end_timestamp_seconds": 1476.52,
    "start_timestamp": "22:58",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=1378",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "this back down to 15k immediately in order to allocate the $5,000 to the long calls. But just because the long calls are going to get allocated $5,000 doesn't mean that I immediately going to employ it here. In this case, I probably wouldn't. So what does this all summarize to? I probably be closer to like $18,000 here and about $2,000 here. Ish. Now we still have another problem set to solve, which is for of the $18,000 that's going into the coverage triangle. How much of this is in short parts of short puts versus long stock? As I mentioned before, right now it's at a really advantageous price. So that means that I don't want to have no stock. But it's also going down. So if I buy stock and I buy too much, then I'm eating up the capital that I have to improve my basis. Now for an example, really quick on what that looks like. Let's say we have the $25,000. And let's say that we use $20,000 when the stock is at $2160. So this is going to cost us. Well, this will get us. Sorry, this will get us 13 July shared. I like that a game's given me fucking date. It will give me 926 shares. So this is spot, this is shares. Now let's say that game stop then goes down to 20. And when it's down at 20, I'm going to want to grab some more probably because I",
    "start_timestamp_seconds": 1453.28,
    "end_timestamp_seconds": 1564.16,
    "start_timestamp": "24:13",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=1453",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "I like that a game's given me fucking date. It will give me 926 shares. So this is spot, this is shares. Now let's say that game stop then goes down to 20. And when it's down at 20, I'm going to want to grab some more probably because I already used some. And let's say when it gets to 20, I use another $25,000. I use the $25,000 box. I get four May shares, also known as $120.25. That's going to be like the new autistic way of having to come up with a share count is by doing this. So it will cost so far here. This gives us our per share basis. Let me make this. Makes sense. 21 in change. 21, 41. What's the problem so far? The problem so far is I use 20 grand and I got in here, which is good. But then when it drops down to 20, and I use half of what's remaining, I get 125 shares. And I've reduced my basis from 2160 to 2141. And the reason why I don't love that is because I moved my basis minimally less than 20 cents. But now I have very little capital left. So then let's say that it does go to 19. I use the rest of my money there. What do we get? We get 132 shares there. Our basis now is at 1903, which is actually not bad. But I want you to notice something. Notice how",
    "start_timestamp_seconds": 1543.32,
    "end_timestamp_seconds": 1689.4,
    "start_timestamp": "25:43",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=1543",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "little capital left. So then let's say that it does go to 19. I use the rest of my money there. What do we get? We get 132 shares there. Our basis now is at 1903, which is actually not bad. But I want you to notice something. Notice how many shares that we got here compared to here. It doesn't seem like a lot. It's only seven more shares. But this is what I call units and actually building inventory. When we're talking about scaling and we're talking about the use of the limited capital that we have, if we're very strategic about when we deploy it, we can create the maximum effect, the maximum impact to our portfolio. The risk here is that if you're not aggressive enough in your initial utilization, you're not going to use enough money and you're going to miss out. If you're too aggressive, then you miss out on future opportunities if it does have some sort of larger down move, which now leads to a beautiful tool that we have to help us understand what's the probability of this different stuff happening. And we use the options chain. So if we go into the options chain, and let's go out 69 days because it's a fun number to 16 Jan 26. What I can do is I can literally look at the probability of touching different numbers. So the probability of us touching the 21 strike is about 50, 50 and a",
    "start_timestamp_seconds": 1665.36,
    "end_timestamp_seconds": 1764.04,
    "start_timestamp": "27:45",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=1665",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "into the options chain, and let's go out 69 days because it's a fun number to 16 Jan 26. What I can do is I can literally look at the probability of touching different numbers. So the probability of us touching the 21 strike is about 50, 50 and a half percent over 50 percent chance that we get there. At 20, it's a 43 percent chance. At 18, it's a 29 percent chance. At, I'm sorry, these are probabilities of in the money. So we got a shift over one more column. This is the probability of these options expiring in the money. I was wondering why these seem a little too low. Probability of touch is a little bit higher. So anyways, what I'm doing is. I'm figuring out like, where's the 50 percent chance? The 50 percent chance is this 18 handle. There's right now a 54 percent probability that we will touch 18 before 16 Jan 26. It's a much lower probability that we will expire there, but it's a pretty good probability over half chance that we touch it. That matters because when I'm figuring out where I want to scale the rest of this capital, that helps me determine what would make sense because let's say in my mind, I'm like, well, I want to make sure that I have money in case it gets down to 10, right? Just picking a number. Well, what's the probability of this thing getting to 10? The",
    "start_timestamp_seconds": 1747.72,
    "end_timestamp_seconds": 1848.52,
    "start_timestamp": "29:07",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=1747",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "capital, that helps me determine what would make sense because let's say in my mind, I'm like, well, I want to make sure that I have money in case it gets down to 10, right? Just picking a number. Well, what's the probability of this thing getting to 10? The probability of us touching 10 is less than 10 percent because this number is wrong. This is because the bid out spread is blown out. The accurate. You could just follow the general trend here. It's probably like 10 to 11 percent. It's exceedingly low. So if I did that, I've now positioned myself in all likelihood to just not use money that otherwise could have been used at a generally advantageous point. The last thing that I want to make sure that you guys keep in mind with respect to something like scaling is this effect here that I was just explaining in terms of building units. The beautiful part about when a stock does continue lower is you can accumulate more units relative to cost cheaper per share, which means that you don't need to save as much money to scale in as it's a little bit further and get an even more meaningful adjustment to your basis. Let me give you an example. Let's say we first buy $20,000 worth of 2160. And let's say when it gets to 21 or I'm sorry, when it gets to 20, rather than doing 2500 bucks, it gets 500. Wait",
    "start_timestamp_seconds": 1827.96,
    "end_timestamp_seconds": 1932.6,
    "start_timestamp": "30:27",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=1827",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "and get an even more meaningful adjustment to your basis. Let me give you an example. Let's say we first buy $20,000 worth of 2160. And let's say when it gets to 21 or I'm sorry, when it gets to 20, rather than doing 2500 bucks, it gets 500. Wait less. And instead, we tell ourselves, I'm going to wait to scale in more heavily when this gets closer to 1918 something like that. Then let's say it does get to 18 or so. As it drifts down towards 18, now is when you can say, well, at this point I have 20,500 used. So you are running at a capital, but you still have something left. You still have 26 April capital left, which is 4500 bucks is those keep in score at home. We're getting close to what seems like the proverbial floor based on the pricing here. At this point, rather than coming in too light, maybe we come in a little bit heavier. Maybe we come in at like three grand. This gets three grand. What do you notice this does to our total position? It really allows us to start scaling. Now this is artificially low because we need to add this number as well. But it brings us down over half a dollar compared to where we were before. Why does all this stuff matter? Because if you do have long shares and you do want to sell some calls against your shares as",
    "start_timestamp_seconds": 1910.32,
    "end_timestamp_seconds": 2020.76,
    "start_timestamp": "31:50",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=1910",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "low because we need to add this number as well. But it brings us down over half a dollar compared to where we were before. Why does all this stuff matter? Because if you do have long shares and you do want to sell some calls against your shares as the underlying might be oscillating sideways, you want to be able to sell your, you want to be able to sell calls at a solid basis against your basis without potentially locking in a loss. What I mean by that is if you sell short calls against your shares and the strike for your short calls is lower than your stock basis, you now are potentially locking in a loss, which is a problem. All right. So we have some intuitive understanding of this idea of scaling. We also have hopefully an intuitive understanding of what my position or my general approach might look like here to finish this out in terms of short puts versus long equity for the current utilization of this. I would say maybe it's like 40%, 40%, like essentially split it or so. So that means that I would get nine grand and nine grand. The way that I would reconcile this is I would set some points of interest. So let's go back in time. Let's literally go back in time. Let's go to 12th of June and let's play some of this and I want to play out some of these different scenarios",
    "start_timestamp_seconds": 2001.8,
    "end_timestamp_seconds": 2107.24,
    "start_timestamp": "33:21",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=2001",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "The way that I would reconcile this is I would set some points of interest. So let's go back in time. Let's literally go back in time. Let's go to 12th of June and let's play some of this and I want to play out some of these different scenarios that we just looked at. Let's go into on demand and we need to go to 12 June. Now, before we start this exercise, what questions you guys have so far? Is there anything that we talked about that's unclear? This is a completely completely chill space. So even if you think it's something stupid, it's not. Let me know whatever it is. Okay, David says, would it be smart to use half and by warrants instead of call options? I would not. I would not do that. The issue with warrants is that there is a decent probability that they're going to end up out of the money like a pretty good probability. So I that's not the route that I would go personally, but it's not a bad idea. If I wanted to play that kind of upside and effectively have a call like exposure, I would just use calls versus the warrants. On let's say, would you consider crazy beta slash ADR stocks mean? They're like rocket ships. Really, I would potentially either growth stocks or meme stocks really. That again, like I genuinely use the term meme stocks in the pure sense of things that have",
    "start_timestamp_seconds": 2091.32,
    "end_timestamp_seconds": 2172.8,
    "start_timestamp": "34:51",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=2091",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "use calls versus the warrants. On let's say, would you consider crazy beta slash ADR stocks mean? They're like rocket ships. Really, I would potentially either growth stocks or meme stocks really. That again, like I genuinely use the term meme stocks in the pure sense of things that have just a really strong social media following where there's memes made about the stock, like that kind of thing. So whether it is or isn't, it might share to your broader point some of the same profile. But if not technical meme stock, then I would happily consider something like that just a growth stock, which can have the same exact behavior as meme stocks. Another thing to remember is that there's a lot of stocks that experience gamusqueases that aren't meme stocks and it's not mutually exclusive. So yeah. Uber, what up? Zuber says, do you think iron condors and put spreads are safe strategies? I mean, by definition, they certainly are safe, especially if you size them appropriately. But the problem is, is like, safe doesn't equal profitable. And a lot of times people will safely lose a lot of money. So I would personally worry less about safety. And I would focus more on, does this thing do the thing that I want it to do? In terms of like, what risk do I want to take? What risk don't I want to take? And does this provide like a healthy return on the risk that I'm",
    "start_timestamp_seconds": 2158.64,
    "end_timestamp_seconds": 2252.4,
    "start_timestamp": "35:58",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=2158",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "safety. And I would focus more on, does this thing do the thing that I want it to do? In terms of like, what risk do I want to take? What risk don't I want to take? And does this provide like a healthy return on the risk that I'm taking? Because otherwise, for example, in something like this, if you're trading put spreads or something like that, you're kind of defeating the purpose of what you're trading. You're better off trading that in something that has much greater relative vol compared to historic moves. So yeah, objectively, I would consider them safe if they're set up appropriately, even in iron condor for those that don't know. That's an iron condor in an index is the position that had the largest percent drawdown on my portfolio, even to this date that happened like five or six years after I started trading was a while after I got into trading and I'd spent a lot of time learning. So there is absolutely even scenarios where something that we might consider safe can still cause issues that absolutely cause issues for me. That was a really wide iron condor in the rut. So they certainly can be safe, but that typically leads to just losing money or underperforming a benchmark. And they can also be made unsafe for sure. I can definitely give you my own experience and testament to that fact. Omlet says they're really hard to break out trades, so",
    "start_timestamp_seconds": 2238.24,
    "end_timestamp_seconds": 2330.04,
    "start_timestamp": "37:18",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=2238",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "So they certainly can be safe, but that typically leads to just losing money or underperforming a benchmark. And they can also be made unsafe for sure. I can definitely give you my own experience and testament to that fact. Omlet says they're really hard to break out trades, so I want to look at options. They can move like 10x in days. Yeah, the issue with a lot of stuff like that is, yeah, so and I would even consider some of those that you're listing definitely meme stocks. Because I've seen them in the lists, right? Like O and D S for sure, iron for sure, open for sure. Like a lot of those I think do qualify. But yeah, there's definitely a lot of stocks that exhibit a tremendous amount of volatility, which again is one of the superpowers of something like GameStop. So let's continue the example. Let's map out the 100% equity position. GameStop right now is 2253. That's the price that we're working with. And we're going to keep the same total allocation at 25 grams. That means the 100% equity position is going to get 1109 shares. And then these calls were about 70 days to expiration. So let's find closest to 70 days here. So this will put us in the 15 aug. That's the the commensurate for doing the 26 Jan 20s. And GameStop spot price now is what like 20, right? So this would be like at the money or",
    "start_timestamp_seconds": 2313.6,
    "end_timestamp_seconds": 2415.44,
    "start_timestamp": "38:33",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=2313",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "70 days to expiration. So let's find closest to 70 days here. So this will put us in the 15 aug. That's the the commensurate for doing the 26 Jan 20s. And GameStop spot price now is what like 20, right? So this would be like at the money or 21. So it's like a dollar in the money. So that would put us at like the 22's. That gives us $3.35. So this will be the 64 DTE options, which are what is this 15 aug. And we're going to do the 22 calls. We'll know you're a dollar in. So the 23 calls. I'm sorry, the 21 calls. Sometimes I'm an idiot. That gets us. So grab those for $3.88. That means we can get 64 of those. You get 64 of these for $3.88. This is the current spot price. This is the current lot size. This is this current price. Again, this is the entry at 2253. What I'm going to do is help us explore these different scenarios. And then the other short puts, the short puts would actually do well in this scenario. So we'll track these as well. And let's say we did a standard 30 delta that puts us at the 20. There will be a dollar 60 credit. But what did I say? The 20 strike. So those are the 20 puts. We'll do these. I'm just going to do them in 15 aug just to make this all easy. Realistically",
    "start_timestamp_seconds": 2396.8,
    "end_timestamp_seconds": 2527.76,
    "start_timestamp": "39:56",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=2396",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "a standard 30 delta that puts us at the 20. There will be a dollar 60 credit. But what did I say? The 20 strike. So those are the 20 puts. We'll do these. I'm just going to do them in 15 aug just to make this all easy. Realistically speaking, the way that I would maximize the income from the put side, or I should say the P and L from the put side, is by selling on maybe like 20 days out. Definitely not this far. Fuck it. We'll just do the the more realistic scenario. Let's do like these. 30 delta here is the 21s. So that'll get us the 21 puts or those 21 puts. We are going to get I'm going to call it a dollar. And we're going to cash secure them just to simulate likely. Most people's accounts. So we take this divided by this times 100. That gives us 12. It gives us 11. Can't round up. So we have 11 of these 21 puts that we sold for a dollar. Okay. And let's take a look at one other scenario using my general positioning that we outlined. It's a little more complex. I don't want to like make this super annoying. So I'm just going to do it as the coverage triangle entirety. Get rid of this short call piece. Just to make it easier. And let's say that they both get 10. So the same effectively the same. I'm just",
    "start_timestamp_seconds": 2505.96,
    "end_timestamp_seconds": 2620.92,
    "start_timestamp": "41:45",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=2505",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "complex. I don't want to like make this super annoying. So I'm just going to do it as the coverage triangle entirety. Get rid of this short call piece. Just to make it easier. And let's say that they both get 10. So the same effectively the same. I'm just not worried about the other piece, just so that you can see how the the coverage triangle would perform here. So this is the CS example, I guess I can move this ear. And this is the positions for CS. Which is going to be 80% utilized. And for this, we're going to get $10,000 of stock. That's going to give us 443 shares. These are also going to have race ratio short calls against. That's literally a covered call, but we're going to sell the calls at a ratio. So we're not going to sell. Well, really we can't. It has to be at a ratio because we we wouldn't sell five. And if we sell four, we have 43 shares on cap, which is great. And on the short put side, I literally would do the same thing as this. Except it would be sized a little bit differently. So for the sizing on these puts. We have. We get four. Okay. Right now, we are comparing three different positions at the same time. The positions that we are comparing are first covered triangle. Second, being 100% equity. Third, being long calls. Fourth, being short puts. Let's fast",
    "start_timestamp_seconds": 2604.68,
    "end_timestamp_seconds": 2740.84,
    "start_timestamp": "43:24",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=2604",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "differently. So for the sizing on these puts. We have. We get four. Okay. Right now, we are comparing three different positions at the same time. The positions that we are comparing are first covered triangle. Second, being 100% equity. Third, being long calls. Fourth, being short puts. Let's fast forward two weeks. So we'll go from 12 to 27. I'm going to be two weeks in a day. And then we're just going to effectively manage like every two weeks on the Friday. We're not going to like specifically time stuff for the example here. We're not going to go through the whole duration. I just want to give you a sense of what the P and L will look like for these different positions. That's all. Okay. So the 21s are now trading for a nickel. So these are at 0.05. And again, you have 11 of them. On the short puts, that means your total. Let me add a thing here for total credit. Your total credit was 1100 bucks. And now I'm going to move everything over just like one or two. For the short puts, the reason why I'm doing that is so that I can throw this in line to make it easier. And it's a loss this. I'm going to update it to be a negative. Okay. So you made 1045 in terms of a percent return on your capital. This gave you 4.52 percent return on a basic capital, not bad. The",
    "start_timestamp_seconds": 2691.52,
    "end_timestamp_seconds": 2884.44,
    "start_timestamp": "44:51",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=2691",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "can throw this in line to make it easier. And it's a loss this. I'm going to update it to be a negative. Okay. So you made 1045 in terms of a percent return on your capital. This gave you 4.52 percent return on a basic capital, not bad. The 15 aug 21 calls that are now 49 days to expiration. Those are now at 385. I'm going to reorganize these so that it can make them a little more critical. So these were the 21 calls. We bought them for 388. We got 64 of them. Now they're trading at 385. So our total cost. This times this. 24,000 current value. Is. 10,000. 10,000. Not much. Just like a few bucks. We'll do the raw cost and then we'll do the current value separate. So that's a little easier to see. So this is currently. Your piano. You are down $192. And then the last one really quick. Or this position, which again, this would have some sort of short calls. It's kind of like both of these combined, right? For the equity side we're at 23, 9, 4, 3, which again, the interesting thing here is that if you notice it actually went up a little bit. It didn't go up much at all, but it went up a little bit from where we started. Yet as this thing went up for where we started, the long calls lost money because of theta. This thing is oscillating sideways,",
    "start_timestamp_seconds": 2832.52,
    "end_timestamp_seconds": 3034.76,
    "start_timestamp": "47:12",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=2832",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "you notice it actually went up a little bit. It didn't go up much at all, but it went up a little bit from where we started. Yet as this thing went up for where we started, the long calls lost money because of theta. This thing is oscillating sideways, which is hurting this position. Now your equity position will be doing a little bit better here. And it's just because it's chilling. Your equity position doesn't really care that much. Your equity position made 1567. So decent move here helped out your equity position. And your put position is again up 1050. And then the one thing we have to go back in time for really quick the other direction back to here is I want to get the short call details just because that will be useful information. And then for this for the coverage triangle, I'm literally just going to copy this part and size it appropriately. So for the coverage triangle, we only got four. For the short put side. So these are the short puts. This is long stock and then ratio short calls. Because this one's going to have those three legs. And we'll literally just do this like once or twice. So the long stock details are effectively the same as the other. So we got it for 2253. That means we were able to get 443 shares. Current price is 2394. That leads our P&L on this part to positive 625. So",
    "start_timestamp_seconds": 3016.44,
    "end_timestamp_seconds": 3151.0,
    "start_timestamp": "50:16",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=3016",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "literally just do this like once or twice. So the long stock details are effectively the same as the other. So we got it for 2253. That means we were able to get 443 shares. Current price is 2394. That leads our P&L on this part to positive 625. So the thing that I want to show you so far without adding the ratio short calls against this is this position is at 1000 and 5. So it's underperforming the short puts raw. It's outperforming the long calls raw. And it's underperforming the equity, which is exactly what I would expect. Now for the short calls, we'll put ourselves close to like a 3031 delta somewhere in here. That's going to give us a $1.53. So that is the 30 handle. So this will be the 30 call. And those are currently priced. I said at $1.53. We can do up to 4. I wouldn't do 4. I would do 3 of them or so to give the trade a little bit of room. And then now we'll fast forward and see what they're worth. Oh no shit, fucked up. That's the rolling exploration my bad guys. These would be in the same exploration as these puts, which is like the 3 July. What's is that get us? That puts us at like the 26, which is 99 cents. So 26 call, 0.99 and we get our 3 still. Okay, now I confess. All right, so now in 3 July,",
    "start_timestamp_seconds": 3116.04,
    "end_timestamp_seconds": 3242.44,
    "start_timestamp": "51:56",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=3116",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "in the same exploration as these puts, which is like the 3 July. What's is that get us? That puts us at like the 26, which is 99 cents. So 26 call, 0.99 and we get our 3 still. Okay, now I confess. All right, so now in 3 July, I'll see what those calls are at. That's the last part. Those are at 14 cents. 0.14. That's what we're going to have to buy them back for. So we have this plus this. Times this times 100. We get 250.5. So the net P&L just because this has additional line items for this strategy is 1260. So here's here's what's happening thus far. The equity position, the 100% equity position outright, bought 1109 shares at 2253. The spot price at our check here is at 2394. That leads to a P&L of 1567, like really, really solid returns so far here. The puts are 1045. The calls are showing negative 192. And then the covered strangle as it sits right now is again 1260. So the reason for this scaling protocol being designed as it is is as the underlying oscillates and finds different prices what we can do is slowly buy more as this thing is moving around. Because one of the things that's really, really important to know is that these other strategies are using all of the money. This one isn't. This one got 1260 using 20 grand. So the return on invested capital here compared",
    "start_timestamp_seconds": 3215.56,
    "end_timestamp_seconds": 3364.52,
    "start_timestamp": "53:35",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=3215",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "is slowly buy more as this thing is moving around. Because one of the things that's really, really important to know is that these other strategies are using all of the money. This one isn't. This one got 1260 using 20 grand. So the return on invested capital here compared to the others is 6.3%. The return on invested capital here is 6.3%. So the thing that I want you to pay close attention to is this strategy even though it's slightly underperforming in terms of gross dollars, it got the same exact return on invested capital except it's using less money. So what's the benefit to that? The benefit to that is if game stop does start to retrace down a little bit, this strategy can do something about it. This strategy cannot. This strategy can just sit and wait. So let's just see really quick what price we might want to scale in the short puts at and we'll do the same exact exercise before. We'll go out a few months. 12 is fine. It's a little far so we'll do like 49 days and we'll find where the probability of a touch is just over 50%. That takes us to the 21. So that means if we hit 21, we're going to scale in. That's effectively the protocol. So what I'm going to do is fast forward like a week or two really quick. I just want to see if it hits anything close to that handle",
    "start_timestamp_seconds": 3334.92,
    "end_timestamp_seconds": 3441.24,
    "start_timestamp": "55:34",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=3334",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "takes us to the 21. So that means if we hit 21, we're going to scale in. That's effectively the protocol. So what I'm going to do is fast forward like a week or two really quick. I just want to see if it hits anything close to that handle and then based on that, I just want to show you that that scaling piece so that you can see what what it would do. Now again, the thing to keep in mind is I just fast forward two weeks. One of the differences is that the P&L here would be whatever the P&L is at the end of this duration. The P&L in this will be improved and it's because it's going to have another layer of this trade and this trade, which again, I can show that to you really quick just so that the example is based on pieces being left out of the equation. My goal is for you guys again to have like a pretty clear understanding of what this thing actually looks like. So I'm going to go back really quick through the 27th and I'm just going to re-establish the positions that would belong in this one. I'm going to skip with the short puts one for now just because it literally is baked into this so we can track it there for ease so I'll kill that one but then we'll still look at this one because it is a bit of",
    "start_timestamp_seconds": 3427.8,
    "end_timestamp_seconds": 3511.4,
    "start_timestamp": "57:07",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=3427",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "belong in this one. I'm going to skip with the short puts one for now just because it literally is baked into this so we can track it there for ease so I'll kill that one but then we'll still look at this one because it is a bit of a standalone strategy. So now for the short puts, though we would it took those other ones down and now we're offering new ones. The 30 delts is at the 22 handle we get a dollar seven. So 22 handle we need to figure out our sizing again, remember for the puts we get 10 grand. So we need to figure out this divided by this times 100 gets us our size so we can do another four for puts. So we get four of those puts out and we get a dollar seven for those. Now the other thing I want you to notice really quick is you can kind of see how this is like turning into a little thing that you can then build out, right? And it's literally something that I'm literally just kind of building on the fly. They're it's not pretty at all but it generally does the main stuff that we need it to. So it's a way to analyze stuff but actually have something to show for it at the end which is like really, really useful so that you can make a decent comparison as compared to what you just might",
    "start_timestamp_seconds": 3495.8,
    "end_timestamp_seconds": 3598.76,
    "start_timestamp": "58:15",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=3495",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "it generally does the main stuff that we need it to. So it's a way to analyze stuff but actually have something to show for it at the end which is like really, really useful so that you can make a decent comparison as compared to what you just might happen to remember. Okay so that's the new put position that went on. This is again the short puts. Let's take a look at the call side where we at like a 31 delta that takes us to the 28 we get a dollar 10 for those. So 28 calls we get a dollar 10. We're going to do three of those just like we did last time. And then our long stock, lat, no change and now let's fast forward two weeks. That takes us to the 11th. Okay. So this 15 August and I put stuff further out in time 49 days literally just to make this a little quicker and easier. So now we're at 23, 725 and I'm going to fast forward another week just to earn another two weeks so that this is closer in time I want to get us closer to like 20 days because that's when it would be managed. That takes us to what's our new spot price. 2335. So again we're kind of like not doing anything 20 23 dot 35. So now we are about six weeks into the trade six weeks in your return on the equity side",
    "start_timestamp_seconds": 3573.48,
    "end_timestamp_seconds": 3707.64,
    "start_timestamp": "59:33",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=3573",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "days because that's when it would be managed. That takes us to what's our new spot price. 2335. So again we're kind of like not doing anything 20 23 dot 35. So now we are about six weeks into the trade six weeks in your return on the equity side is at 34% return on invested capital 3.64% not bad for six weeks time but also again not blowing anybody's doors off. Let's take a look at the 22 puts. Those are trading for 45 cents so we'll take those down. So minus 0.45 we made 248 there and then let's take a look at those 28 calls those 28 calls are at 45 cents. Wait did I fuck that up I think I did. Yeah 38 cents. So these are at minus 0.38. So now what what do you see the first thing that you should see is that the position itself is actually starting to outpace. The reason with this beginning to out pace is because this is still able to generate something while this is now again just kind of doing nothing. It's waiting until there's hopefully some sort of uptick which just it happened but then we're kind of oscillating sideways around that level. So now this thing is up 98 and again we still have $5,000 in reserve. We've not used all of our money like this position just yet and let's check in on the 15 August 21 calls really quick which is here.",
    "start_timestamp_seconds": 3676.52,
    "end_timestamp_seconds": 3806.92,
    "start_timestamp": "01:01:16",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=3676",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "we're kind of oscillating sideways around that level. So now this thing is up 98 and again we still have $5,000 in reserve. We've not used all of our money like this position just yet and let's check in on the 15 August 21 calls really quick which is here. Those 21 calls those are trading for $2.70. So you can see the issue with the calls is that they're they're just decaying. They're becoming anemic because we're not getting the move that we want. This issue gets compounded for the long call side of the equation because when you buy long calls and something like gain stop you're almost always overpaying for fall and if it goes into a quiet period not only did we overpay for fall but we're experiencing heightened faded decay because of it. This becomes a really challenging positioning team. So this is probably where the long call buyer might choose to throw in the towel take that $7,500 loss and prevent further loss. That would be the better decision here or they could roll it out again and you know maintain exposure but we already know the future in this scenario which would end up being suboptimal. The last thing I want to do really really quick is I'm going to fast forward a bunch of time. I just want to see if it gets down to like that 21 handle or anything close to that which is what we define as our scaling",
    "start_timestamp_seconds": 3781.88,
    "end_timestamp_seconds": 3882.84,
    "start_timestamp": "01:03:01",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=3781",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "up being suboptimal. The last thing I want to do really really quick is I'm going to fast forward a bunch of time. I just want to see if it gets down to like that 21 handle or anything close to that which is what we define as our scaling which it looks like it didn't. It stayed in like the the 20s all the time. So in that scenario we would just be sitting pretty. Not really using that residual five capital leaving it on the side or whenever you choose to scale it. Now again for me a lot of times I would use something like this potentially to scale in a little bit to play the poster and announcement drift with a little bit of a dedicated position but that's a different story. So I'm going to pause there and I want to summarize what we've learned hopefully and just again to give you more tools for the toolkit. GameStop goes through pro-longed periods where it oscillates where it consolidates where it trends sideways with minor movements. That leads to rapid erosion of long call trades across the board but especially anything that's within 120 days makes it very difficult for those to make money. Long equity allows you to capture big moves but in order to monetize big moves you need to sell your shares. That leads to a timing issue for people. So for example with the stock at 27 that long equity position would",
    "start_timestamp_seconds": 3870.92,
    "end_timestamp_seconds": 3979.4,
    "start_timestamp": "01:04:30",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=3870",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "it very difficult for those to make money. Long equity allows you to capture big moves but in order to monetize big moves you need to sell your shares. That leads to a timing issue for people. So for example with the stock at 27 that long equity position would look good. So at 27 that long equity positions up like 19 percent. But what's the problem? Well the problem in this scenario is the trade itself although is up decent money it has the confounding problem of you don't actually get it. You don't get the money until you sell. That's the problem with this position in context. Now again that's not like the end of the world or anything but it is something that you have to pay attention to. Because otherwise you can have instances where your equity position will be up handsomely but unless you have some sort of timing protocol to monetize it and actually realize the money if we fast forward to where we are now at 2095 and let's say that you did nothing. You just held it. Well you literally went through a period where you were up 20 percent. You are now how far is this? This is the 12th of June to the 8th of November. Like you're a hot minute into this trade and at this point this position literally is nothing to show for it. You don't even get a dividend here. Yet this position would continue to",
    "start_timestamp_seconds": 3949.72,
    "end_timestamp_seconds": 4061.56,
    "start_timestamp": "01:05:49",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=3949",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "now how far is this? This is the 12th of June to the 8th of November. Like you're a hot minute into this trade and at this point this position literally is nothing to show for it. You don't even get a dividend here. Yet this position would continue to grind out a profit of sort. Now the last piece that I said I wanted to show you is the scaling in protocol and we decided 21. So I'm not going to cherry pick and say 2095 and pick the low. I'm going to say that we scale in at 21. So with the underlying at 21 that allows us to buy how many shares. We only have $5,000. So we don't have a bunch of residual capital to use here. So we have $5,000 remaining that we can use for something that's at 21. That means we can get 25 August. Worth, which is 238 shares. The thing that I want you to pay attention to is this factor right here. Notice how the underlying is a little bit cheaper, not much cheaper, a little bit cheaper. But with it being just a little bit cheaper you can still see that the overall position itself is still pretty damn strong. That means in terms of how much you were able to buy. So I'm going to track the cost basis for this one and then for that one we need this to calculate the rest of the position. And",
    "start_timestamp_seconds": 4046.84,
    "end_timestamp_seconds": 4146.52,
    "start_timestamp": "01:07:26",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=4046",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "see that the overall position itself is still pretty damn strong. That means in terms of how much you were able to buy. So I'm going to track the cost basis for this one and then for that one we need this to calculate the rest of the position. And then I'll pause here for any questions. So if you have any questions about any of this now is the perfect time to throw them in. So that's our total cost. This is our total shares. This is our per share cost. 22. So you got the per share cost down. Actually, like not too bad. All I'm doing is finishing the rest of the metrics for you guys. The thing that you'll see here is actually kind of important. Which is this. Notice how being able to scale in makes a material difference. Not even in terms of the gross P&L, again, extra using different amounts of money. But in terms of the actual return on a vesicapital, we can see that we're actually dampening ourselves pretty significantly by being able to scale in and by being able to drive our bases down. The last thing that I'm going to show you on this really quick is if I were to try to sell calls, let's go a 41 days out. In this trade, I effectively have to sell it 23. Here I can sell at 22 or greater. It's really up to me. So at 22, you get",
    "start_timestamp_seconds": 4122.92,
    "end_timestamp_seconds": 4247.4,
    "start_timestamp": "01:08:42",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=4122",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "to show you on this really quick is if I were to try to sell calls, let's go a 41 days out. In this trade, I effectively have to sell it 23. Here I can sell at 22 or greater. It's really up to me. So at 22, you get a dollar 71 at 23, you get a dollar 41. Really, I would pick 23. So it's no problem in this scenario. The problem becomes if it slips a little further down. Then this slight difference can make a pretty big impact. So with this position though, over that course, you can see that you're actually able to still generate an a net positive P&L. Again, it would be net positive just because we only did two iterations of this. It technically would have been way more iterations over that time frame. To summarize all of that, there's nothing wrong at all with being 100% equity. But you need to have some sort of timing protocol. If not, you're just holding stuff and unless you monetize it, you don't give yourself the ability to actually maximize it. So what that might look like is something like this. If when it was at, even close to what it was, well, let's just apply technical analysis. So it rallied, it rallied up here. So this is kind of like your support and resistance. And then you get a firm close below. So let's just call it 2540, where we might have gotten",
    "start_timestamp_seconds": 4229.88,
    "end_timestamp_seconds": 4324.92,
    "start_timestamp": "01:10:29",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=4229",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "was at, even close to what it was, well, let's just apply technical analysis. So it rallied, it rallied up here. So this is kind of like your support and resistance. And then you get a firm close below. So let's just call it 2540, where we might have gotten out, 25.4. That means that you would have generated $3,182. Why does that matter? It matters because you started with 25. Now you just added 31.82. You now have $28,000 to do something with that something can literally be by more shares. But now you have something to do with. So for example, let's say that you saw this breakout and you wanted to start getting in here, you could. Or let's say that you were like, okay, I think it's going to roll back over. I'm going to wait until it's back at the point of control at like 2334. Whatever. What I'm going to do for the scenario, though, is say at the same price. So the same 2253, if you got back in at that point, the difference now is that you can get 1250. So the difference in your shares is 141 shares. You can get 141 more shares now because we realized some of this money and then we used it to then accumulate more shares. That's the other thing a lot of times people will do with this kind of strategy and game stop, especially like the true ape style folks that want to",
    "start_timestamp_seconds": 4304.2,
    "end_timestamp_seconds": 4399.88,
    "start_timestamp": "01:11:44",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=4304",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "141 more shares now because we realized some of this money and then we used it to then accumulate more shares. That's the other thing a lot of times people will do with this kind of strategy and game stop, especially like the true ape style folks that want to build a big stock position and hold it. You can do that. But if you do something like this to accumulate it, you can literally buy, again, you made $380 here, you made $248 here. If we convert that to general share price around that time, which is what 23-ish. So this divided by 23, you could have got 16 shares with that and then you could have got 10 shares with that. So you could have got 26 shares across this stuff by using, again, this other income source. This exists because game stop is so volatile. It's why you get such good premium for the call side of the equation typically wouldn't you also get it on the put side of the equation. That's super unique. This is exactly why I personally am trading a coverage triangle in game stop. It's because it does this exact kind of behavior, this exact kind of behavior for a prolonged periods of time. And the cool part is at the end of this kind of scenario with the coverage triangle, I will still have a positive in L despite it going down whereas if you're 100% equity, that's not the case.",
    "start_timestamp_seconds": 4383.32,
    "end_timestamp_seconds": 4485.0,
    "start_timestamp": "01:13:03",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=4383",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "behavior, this exact kind of behavior for a prolonged periods of time. And the cool part is at the end of this kind of scenario with the coverage triangle, I will still have a positive in L despite it going down whereas if you're 100% equity, that's not the case. So if I look at the coverage triangle right now that I have in game stop out of actual curiosity. When I started trading game stop, it was at $29 for this example. This is part of the sample portfolio that I was sharing for a while. It was at $29. So right now the 100 equity position, the 100% equity position is down 25 0.86%. It's down 25% from where it started. My coverage triangle that I'm trading here is currently up over 13%, 13.5% positive. That means that I'm outperforming the buy and hold equivalent by 39.4%. Same thing, same time, same ticker, nothing magic about this approach. But this approach differently captures one of the more pervasive elements of game stop that if you monetize it, you can make a lot of fucking money. That's my TED talk on developing different kinds of positions in game stop and how they behave against one another strategy. What questions do you guys have? Lawrence says question with this strategy, what's the worst case scenario and how do you manage it? I think technically speaking the worst case scenario would be game stop goes in solving and it gets de-listed.",
    "start_timestamp_seconds": 4460.76,
    "end_timestamp_seconds": 4603.4,
    "start_timestamp": "01:14:20",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=4460",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "and how they behave against one another strategy. What questions do you guys have? Lawrence says question with this strategy, what's the worst case scenario and how do you manage it? I think technically speaking the worst case scenario would be game stop goes in solving and it gets de-listed. Now the way you manage that is by just allocating the risk to the trade that you are again realistically comfortable with that potential scenario. Now if I were to apply a probability to that it would be low, I don't think that the probability of game stop having that kind of scenario is super high. Now that said, if I were to think again to give you some context in the military in the Marine Corps, we use two different enemy-based course of action analysis. We have an ML COA and then an MD COA. Now the ML COA is the enemies most likely course of action. What do we think is most likely to happen? And then the MD COA is the enemy's most dangerous course of action. Again, so much of this stuff from the Marine Corps literally applies directly to trading. So what's the MD COA? The most dangerous scenario here is game stop going in solving and being de-listed. How do we manage that? We accept it and whatever capital we put into the trade we acknowledge that that could happen despite it being quite unlikely. What's the most likely scenario? The most likely bad",
    "start_timestamp_seconds": 4575.88,
    "end_timestamp_seconds": 4683.4,
    "start_timestamp": "01:16:15",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=4575",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "The most dangerous scenario here is game stop going in solving and being de-listed. How do we manage that? We accept it and whatever capital we put into the trade we acknowledge that that could happen despite it being quite unlikely. What's the most likely scenario? The most likely bad scenario is what we were just talking about at the beginning trying to gain some context on what the intrinsic value might be. So in my planning factor that would put us in the high teams that would be the most likely downside scenario. Again, with some severity added to it. So again, the way that I plan and manage for that is first by what's the allocation? How much money does the position get? But then the second is how much am I actually going to utilize? So again, in this case instead of using 25 grants, I'm using 20. And then of that 20, not all 20 is going into something that I can't adjust the basis of, which is long stock without adding more money. I have that in something that I can adjust the basis of, which is short puts. So it allows me to maintain spot price sensitivity as it goes down. So you can see it's literally a layered management approach because there is also short calls. These will make money if and as it goes down. So the entire position is really built in a way to really be robust in those kind",
    "start_timestamp_seconds": 4665.88,
    "end_timestamp_seconds": 4762.52,
    "start_timestamp": "01:17:45",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=4665",
    "chunk_index": 46,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "spot price sensitivity as it goes down. So you can see it's literally a layered management approach because there is also short calls. These will make money if and as it goes down. So the entire position is really built in a way to really be robust in those kind of scenarios. Rhinese says, do you ever do poor man's coverage triangle? No, I don't. It could be done. The way that, like the closest version that I get into stuff like that is a ratio call diagonal, but I don't really do a poor man's coverage triangle. One of the most important factors for a coverage triangle is to be able to take a assignment. One of the other most important factors for a coverage triangle is to be able to hold inventory and wait because there can be prolonged periods where something doesn't look good. And this is actually a prime example, right? Like if we did that poor man's coverage triangle using the long call position, that's literally bleeding during this time frame. And that obviously performs completely differently than this, which is actually still generating a net positive return if the rest of the trades were calculated in here. So yeah, I don't do that. And it's just because they're very different profit mechanisms that the strategies are built around. Personally. Also, I just realized that it's not Brian. It's fucking brain. Sorry. And the emoji helped a lot. In my mind, you're still Brian now.",
    "start_timestamp_seconds": 4740.28,
    "end_timestamp_seconds": 4852.6,
    "start_timestamp": "01:19:00",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=4740",
    "chunk_index": 47,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "calculated in here. So yeah, I don't do that. And it's just because they're very different profit mechanisms that the strategies are built around. Personally. Also, I just realized that it's not Brian. It's fucking brain. Sorry. And the emoji helped a lot. In my mind, you're still Brian now. Unfortunately, excited. I'm stupid. And as soon as my brain attaches that, now we're fucked. Resize in a massive up move, how might ACS underperform? It's a great question. So let's take a look. I mean, it's not a massive up move, but let's take a look at this up move. We can literally see how it would have done over this time frame. So I'll take as to nine september and we'll re-establish a position and we'll literally compare it so that you can see exactly how it would behave here. What I'm going to do is I'm going to go with the assumption that we have not scaled in more. So we still just have the 10 grand there. And then we have the call position and what not separate. But what I'm going to do is add more short puts and what will literally trade this move so that you can see exactly how it would perform. Just give me one second. I got to grab some water. That last one there was Norway. Pretty six spot. Okay. So let's let's literally build a position and let's see how it does. So we're going to go out",
    "start_timestamp_seconds": 4829.0,
    "end_timestamp_seconds": 4966.76,
    "start_timestamp": "01:20:29",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=4829",
    "chunk_index": 48,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "so that you can see exactly how it would perform. Just give me one second. I got to grab some water. That last one there was Norway. Pretty six spot. Okay. So let's let's literally build a position and let's see how it does. So we're going to go out 24 days again and then we're just going to run in two weeks, two weeks snapshots. I'm going to move this off to the side for now so that I can go a little faster. Let's let's do it. Okay. So here the 30 delta ish is like the 22. So that's why I would go for so the 22. What is this divided by? One of my formulas got fucked up moving stuff. Okay. So we can do four again. We're going to get $2. We'll get four of those. And then for the ratio short calls again keeping us close to a 30 that puts us at the 26. So the 26 call we're going to get 82 and we still have four and 43 shares. So we're going to get three of those. So let's fast forward two weeks. So that takes us to the 23. Active rehab says so no one hears long on game stop. No, that's completely incorrect. The coverage triangle is is literally a long delta position. It's quite long. Okay. So let's see what the short put did. We had the 22. The 22 is now down for seven cents. And the",
    "start_timestamp_seconds": 4913.0,
    "end_timestamp_seconds": 5080.2,
    "start_timestamp": "01:21:53",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=4913",
    "chunk_index": 49,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "rehab says so no one hears long on game stop. No, that's completely incorrect. The coverage triangle is is literally a long delta position. It's quite long. Okay. So let's see what the short put did. We had the 22. The 22 is now down for seven cents. And the 26 call is literally now in the money. It's in the money at a dollar 37. So this will need to be rolled. Now one important note. One of the things that I will do if I have short calls, but I don't want to unwind my inventory is either roll it or I will instead buy shares as it's about to breach. But in this case, I'm literally just going to continue to unwind and put stuff back on. So this one's going to come down for $37, which is a net loss of $1.65. Okay. Let's do one more. Let's find our way out 24 days or so. And we can get to the 25 for 64 cents. We can get four of those now with this recent up move. The way that my rule set typically would behave would be to do less of these after that kind of surge. But I'm just going to keep the overall plan the same. So these are 64 cents. They're also not getting enough money. They're getting about half of what they were getting before. So these would actually get less. Those are going to get a two lot. So",
    "start_timestamp_seconds": 5050.28,
    "end_timestamp_seconds": 5166.04,
    "start_timestamp": "01:24:10",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=5050",
    "chunk_index": 50,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "kind of surge. But I'm just going to keep the overall plan the same. So these are 64 cents. They're also not getting enough money. They're getting about half of what they were getting before. So these would actually get less. Those are going to get a two lot. So we're going to use less, less total capital. I'm going to add a hash secured element this. This times this times 100. Just so that you can see what the overall tracking is. Okay. And then for the call side of the equation, we have a 35 delta for 93. So this will be the 29 calls. We're going to get those $37. I might get a little more aggressive just because the last one's came down for $1.37. So I would take those to the 28 calls. Those will go for a dollar and we can get three of those. Okay. So let's fast forward two weeks. Well, I don't think we can go two weeks. Anyway. Yeah, we can. I got my fucking months fucked up. My bed. Well, there's the 30th. Here's the seventh. I want to see if this is at the peak yet or not. Okay. So that was at the peak. I'm going to go back and then I'm just going to take a look at where everything's sat at the peak. So like right here. And then this way we can make a direct comparison. So spot price right now is what 2684.",
    "start_timestamp_seconds": 5147.4,
    "end_timestamp_seconds": 5248.76,
    "start_timestamp": "01:25:47",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=5147",
    "chunk_index": 51,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "Okay. So that was at the peak. I'm going to go back and then I'm just going to take a look at where everything's sat at the peak. So like right here. And then this way we can make a direct comparison. So spot price right now is what 2684. I'm just waiting for it to go. I think it might be a little higher. Let's see. I also don't know why it says pre-buffering. Why wouldn't it just be buffering? Okay. 26.9. 26.9. And let me show you where we're at so far. So this needs to be a sum of this. Oh, no. That's my bed. That's not it. That's fine for now. So this is the put. This is the calls. This is the underlying. So this is the variance in performance on a pretty significant upmove. So this shows us we are down about 1200 bucks. I compared to the long equity position. Now one of the things that is really, really, really important to differentiate however is this is still open. So unless this was sold and you top ticked it, meaning you sold it near the top, then this is the best case P&L for the long equity position. But it's not realized. It's still open. So what that means is as this thing starts to roll over, you're going to lose this. A big difference between this and the coverage triangle is that the coverage triangle equity position is up 1900 bucks way",
    "start_timestamp_seconds": 5235.48,
    "end_timestamp_seconds": 5381.32,
    "start_timestamp": "01:27:15",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=5235",
    "chunk_index": 52,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "for the long equity position. But it's not realized. It's still open. So what that means is as this thing starts to roll over, you're going to lose this. A big difference between this and the coverage triangle is that the coverage triangle equity position is up 1900 bucks way less than this. But this is a small portion or I guess a meaty portion, but not the entire P&L profile for this. So the difference is this 3677. If I were to split this into realized and unrealized. So realized meaning you booked it, unrealized meaning you did not book that P&L yet. It's still waiting to be realized. Is your realized P&L here is 1742. Your unrealized P&L here is that 1935. So one of the major benefits of something like the coverage triangle is it mixes these returns which is very, very important because it means that you no matter what have actually booked profit. And again, for context, this 1742 can be used to buy more shares. This cannot. You can't buy more shares with this 1935 unless you close it and realize it. So in the most recent example, this is the underperformance variance. It's about a percent of the total allocated capital. In terms of a dollar amount, it's about 1200 bucks. Is the difference. What's again, that's not insignificant. But in the broader context and the practical application, I'm also full well aware to know that most people are not actually going to",
    "start_timestamp_seconds": 5363.24,
    "end_timestamp_seconds": 5497.8,
    "start_timestamp": "01:29:23",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=5363",
    "chunk_index": 53,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "about a percent of the total allocated capital. In terms of a dollar amount, it's about 1200 bucks. Is the difference. What's again, that's not insignificant. But in the broader context and the practical application, I'm also full well aware to know that most people are not actually going to realize that. Most people would have if they're trying to sell in time stuff. They probably sold some of it on the way up. Let's take a look at a realistic cell scenario, just using a moving average approach. If we use the moving average approach or a, let's just use the support and resistance approach, whichever you want, if we did a moving average approach, depending on what moving average you used, I'm just going to come out on demand to be able to see all of it quicker. If you use a moving average approach, that would put you out really, they kind of coalesce on the same day, which is nice because it gap down. So if you use the 10 day, which you would be in and out a lot, or more commonly for like swing style, you use like a 20 day or so, this puts you at, let's just call the midpoint of like 25, 64. So let's see in a realistic scenario, what that would look like. Notice it's still outperforms as I would expect in this scenario. But that means that you got stopped out at 25, 64 and you made 34,",
    "start_timestamp_seconds": 5471.64,
    "end_timestamp_seconds": 5568.84,
    "start_timestamp": "01:31:11",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=5471",
    "chunk_index": 54,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "puts you at, let's just call the midpoint of like 25, 64. So let's see in a realistic scenario, what that would look like. Notice it's still outperforms as I would expect in this scenario. But that means that you got stopped out at 25, 64 and you made 34, 48. In this case, again, you're still up about 3,100 bucks. But again, a big difference is that there would be more of these positions on that would boost this return slightly. So it's not a apples to apples comparison in this context. But what I'm giving you is two different scenarios, at least to model that question. The first model is perfect timing you top ticket, difference is about 1200 bucks. In this scenario, accepting that you're using some sort of momentum following approach that's going to have some lag to it. This one's making 34.50 and this one would probably be about the same, realistically speaking with another iteration of these out that it otherwise missed for the example. But just calling that as it is, this now underperforms by like 300 bucks if you just stop doing the rest of the stuff. So that should give you at least some like actual context on the performance difference during, again, like a pretty serious up move. That's like a 20% up move in a relatively short period of time. From there, you can just model what it would look like during much bigger moves for sure. Level says",
    "start_timestamp_seconds": 5546.12,
    "end_timestamp_seconds": 5651.32,
    "start_timestamp": "01:32:26",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=5546",
    "chunk_index": 55,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "at least some like actual context on the performance difference during, again, like a pretty serious up move. That's like a 20% up move in a relatively short period of time. From there, you can just model what it would look like during much bigger moves for sure. Level says was this study using 45 DTE's now? That 45 DTE's again is like a tasty trade artifact that I think is broken a lot of people because 45 DTE's especially in something like this would actually underperform significantly. The reason for that is because something like this that has so much volatility, you get paid for effectively fighting gamma. But if you're trading something like a covered triangle, you really don't care about the gamma risk because you have a defined playbook. Either you're going to take assignment on the puts or you're going to roll them and same story for the calls. So a very, very different, a very, very different playbook underway here. But it gives you a much more flexible position as compared to like just wrote being out 45 days. If we just eyeball really quick, again, for an example, let's just look really quick. 41 days to expiration is here. Let's do the same position as super fast. So we have the 20s that you get $4 for. So you have the 20 puts. You get those for $1.4. In terms of a return on a Vesic Capital, you get 30 December or 5.2% which",
    "start_timestamp_seconds": 5633.8,
    "end_timestamp_seconds": 5738.6,
    "start_timestamp": "01:33:53",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=5633",
    "chunk_index": 56,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "days to expiration is here. Let's do the same position as super fast. So we have the 20s that you get $4 for. So you have the 20 puts. You get those for $1.4. In terms of a return on a Vesic Capital, you get 30 December or 5.2% which again, it's a really good return. But this is for 41 days. If we look at instead where I was doing like 20 to 30 days, which would put us about here, and we go to that same 30 delta, you're going to get like 56 cents for the 20. So 0.56 for the same strike, which is the 20. 2.8% but again, this is for 27 days. So then if you annualize these returns, this is going to annualize out much greater. That's the reason for something using closer to 2021 days versus the more standard selling duration, which people typically use something like 45 days. It's not as optimal as people think it is, unfortunately. But it's just something that a lot of people have heard and then perpetuate. It's not the end of the world, but it definitely is not. It's not optimal across all scenarios, especially this scenario. Really interesting conversation, actually went a lot longer than I thought, but I hope it's useful. Now, before I jump, anything else on this specific conversation, I'm very, very happy to spend the time with you guys and to try to help. This is one of the things",
    "start_timestamp_seconds": 5716.84,
    "end_timestamp_seconds": 5845.08,
    "start_timestamp": "01:35:16",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=5716",
    "chunk_index": 57,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "this scenario. Really interesting conversation, actually went a lot longer than I thought, but I hope it's useful. Now, before I jump, anything else on this specific conversation, I'm very, very happy to spend the time with you guys and to try to help. This is one of the things that I'm very passionate about, especially with the the ape community is trying to help reframe the way that things are approached to try and increase overall profitability. Because something like GameStop is a very, very cool stock that a lot of people don't fully appreciate how you can take advantage of it and still be involved in it in different kind of ways. Lawrence is I'm still learning how to define risk and if I can't define it, I'm not comfortable doing it. Yeah, I think that's fair. One of the easiest ways to define risk in something that you're trading in terms of a price direction is just a touch of price level to it, which is the same thing is defining the spot that you would be wrong directionally. So for example, in GameStop, it's kind of like what we did before when I was trying to find what the intrinsic value was, so then I could attempt to target what the floor is. Because at that point, let's say GameStop starts violently going below that. Well, I would just take the loss at where I think the floor is, where I think it won't go below.",
    "start_timestamp_seconds": 5823.0,
    "end_timestamp_seconds": 5913.0,
    "start_timestamp": "01:37:03",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=5823",
    "chunk_index": 58,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "find what the intrinsic value was, so then I could attempt to target what the floor is. Because at that point, let's say GameStop starts violently going below that. Well, I would just take the loss at where I think the floor is, where I think it won't go below. Because then if it goes below where I think it won't go below, it means I miss something or something is materially changed. So therefore it's time for me to reevaluate the trade, make adjustments if needed, but more likely than not get out and just take the loss is what it is. So the most important part when it comes to being a trader and to remind yourself is that you actually define what the risk is. Now again, there's exceptions to that via gaps and stuff like that, but even in those scenarios, you still define the risk by what you give the trade. You always have control over that. TSM says how to be less bullish. The way that you hold on, let me clarify, TSM, do you mean how to be less bullish with the coverage triangle? Or do you mean how to be less bullish on just the game stop itself as it's going through down moves? Could you clarify that a little bit? Because I think, yeah, depending on which angle you're approaching on game stop, you could really trade any number of things that become less bullish. That becomes a factor of like",
    "start_timestamp_seconds": 5895.16,
    "end_timestamp_seconds": 5983.4,
    "start_timestamp": "01:38:15",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=5895",
    "chunk_index": 59,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "on just the game stop itself as it's going through down moves? Could you clarify that a little bit? Because I think, yeah, depending on which angle you're approaching on game stop, you could really trade any number of things that become less bullish. That becomes a factor of like what's the profit mechanism? So if the profit mechanism is priced direction down, that's one approach. If the profit mechanism is just, I don't necessarily think it's going to go up as much. That's a different thing. So TSM, in this scenario that you're outlining, like what's the scenario you're thinking of? What's the hypothesis that you have? TSM says I only trade GME, which is its own problem. It's not necessarily its own problem. I mean to be honest, but it just, in this case, it depends on like what's the profit mechanism, though. So when you're saying, when you're saying less bullish, what's the hypothesis then? I mean, I just always think it will go up. So it holds me back from selling a lot of covered calls price goes up. Well, now I'm confused. Because you're asking how to be less bullish, but if your, if your bias is, you think price is going to go up, then I guess I don't understand that at all. That seems like a mismatch, which is actually pretty common. But to zoom back out with something like if it's going to go up, again, there's a bunch of ways to",
    "start_timestamp_seconds": 5961.56,
    "end_timestamp_seconds": 6086.84,
    "start_timestamp": "01:39:21",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=5961",
    "chunk_index": 60,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "bias is, you think price is going to go up, then I guess I don't understand that at all. That seems like a mismatch, which is actually pretty common. But to zoom back out with something like if it's going to go up, again, there's a bunch of ways to manage the short call side of the equation. The first one is to do it at a ratio. The second is you can always buy shares as it's starting to blast through your short call. You can always buy long calls as it starts to blast through your short calls. Again, there's a bunch of things you can do to manage it, but you have to have successful timing in management with those. Because if you don't do that, then you find yourself in a scenario where you're just kind of holding something and losing money, which is no good. Also, I realized that I didn't actually run the return on invested capital formula for you guys, my bed. That is not correct. Oh, because it's doing my bed. It's converting it out of a percent. I think it's holding two spots at the same time. Brain says TCM instead of selling covered calls, you can sell call spreads. Certainly wouldn't do that. Because that, again, the call spread side of the equation really starts to break down the base that you have. It's a really good way to start like legitimately locking and losses that are unnecessary. Level says",
    "start_timestamp_seconds": 6073.8,
    "end_timestamp_seconds": 6204.92,
    "start_timestamp": "01:41:13",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=6073",
    "chunk_index": 61,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "of selling covered calls, you can sell call spreads. Certainly wouldn't do that. Because that, again, the call spread side of the equation really starts to break down the base that you have. It's a really good way to start like legitimately locking and losses that are unnecessary. Level says to put your positions on, would you target a specific delta here, like you've shown, or would you as you support and resist as levels? It's a little bit multifactor in practical application. A lot of it is based on really how I feel about inventory. Here's the way that I think first is inventory second is what is it doing? In this kind of scenario where it's like consecutively and pretty just consistently moving down, then I don't necessarily want to take on inventory. I'm not going to be super aggressive with my delta's. I'll actually probably take the delta's down to like a 20 delta or like a 30 delta maybe. If it's something that's like rallying up like this, I would actually look to be more aggressive. Maybe like 35, 40, even 45, 50 delta's. If it's something that's like rotating sideways like this, that's typically like a 35 delta ish. So a lot of it is based on what the underlying is doing, but then the second overlay and overriding overlay is inventory. Do I want to take shares on or not? That's a really, really important put. Brain says I'm so confused. Yeah, let me",
    "start_timestamp_seconds": 6178.36,
    "end_timestamp_seconds": 6276.68,
    "start_timestamp": "01:42:58",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=6178",
    "chunk_index": 62,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "a 35 delta ish. So a lot of it is based on what the underlying is doing, but then the second overlay and overriding overlay is inventory. Do I want to take shares on or not? That's a really, really important put. Brain says I'm so confused. Yeah, let me explain I could see how that comment could be confusing. So let's take a look at a P&L diagram. Maybe this will help a little bit. Let's say that we have a thousand shares of game stop. I think get rid of the so we're going to pretend we have a thousand shares of game stop. Let's say that we sell like a 30 ish delta call against. Let's say we do it at like a 50% ratio. So this is what the ratio covered called does. Now let's instead do the, let's do the call credits bread and we'll short the 25 and we'll go what like $2 wide maybe? Something like this. And let's just compare these scenarios against the long stock. And again, we can do like five of these. If I run five of these and let's say that the underlying does go down to like 2040s or just as 5% down move because it's already price-themma's a little easier. At this 5% down move, the P&L for my position is down 11, 24. In this scenario, my position is down 1020. So the big thing that's happening here is I'm offsetting much more of the",
    "start_timestamp_seconds": 6254.92,
    "end_timestamp_seconds": 6371.32,
    "start_timestamp": "01:44:14",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=6254",
    "chunk_index": 63,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "2040s or just as 5% down move because it's already price-themma's a little easier. At this 5% down move, the P&L for my position is down 11, 24. In this scenario, my position is down 1020. So the big thing that's happening here is I'm offsetting much more of the position by having more of these calls that are effectively at their full size. Now the trade-off here is if there's some sort of big massive up move. Let's say that it goes to 30. At 30, this makes 5860. At 30, this makes 7911. But what's the big difference? The big difference is that with this, you're going to realize the loss. With the short calls, you don't actually have to ultimately realize the loss. You can roll them. So you will realize losses along the way that eventually will pay themselves out. And I'll show you what that looks like really quick before I got a hop off. Let's go here to again the 9th of September. Here. And I'm just going to short like an at the money call so that you can see how this effectively plays out. If I sell, well, let me wait till the options to gain updates. And then I'm just going to literally track it here so that we can, yeah, it goes. Okay, so it's all good. So I'm going to do something at the money and I'm doing it at the money on purpose so that we can actually",
    "start_timestamp_seconds": 6347.24,
    "end_timestamp_seconds": 6447.0,
    "start_timestamp": "01:45:47",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=6347",
    "chunk_index": 64,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "the options to gain updates. And then I'm just going to literally track it here so that we can, yeah, it goes. Okay, so it's all good. So I'm going to do something at the money and I'm doing it at the money on purpose so that we can actually sell it perform. It's like a dollar 65. So that's the 24 call. We're going to get a dollar 65 for selling it. Now, if we have the all credits spread in the same scenario, the thing to keep in mind for that call credits spread is that it's going to lose. It's actually going to lose and then that's all there is to it. But in this scenario, it's a little bit different. So let's go fast forward a week. With the underlying at once it loads. Again, I kind of want to try to like top ticket. I want to get is close to the peak as we can, which I think this is pretty close. I think it peaked out of what like 27. Yeah, this is close enough. So I'm just going to call it 2680 or I'll just call 27. But here the 24 call that's going to come down for $2.98. Okay. So our realized P&L here, her contract is 10 June. Whoever can guess what that actually is. Something's fucked up. What's fucked up? What the fuck's going on here? What's up? It'll math from Marines, order of operations, something something order of",
    "start_timestamp_seconds": 6432.84,
    "end_timestamp_seconds": 6547.96,
    "start_timestamp": "01:47:12",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=6432",
    "chunk_index": 65,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "that's going to come down for $2.98. Okay. So our realized P&L here, her contract is 10 June. Whoever can guess what that actually is. Something's fucked up. What's fucked up? What the fuck's going on here? What's up? It'll math from Marines, order of operations, something something order of operations, whatever the fuck that means. Okay. So here we lost $133. And let's say for the same credit spread $2. Wide it would have lost like a hundred in change or really whatever that is. I don't really remember what it was. We can check really quick just for the sake of the example. Let's say that the credit spread went out here at the 27. Yeah. So you got $22 for something that's $2. Why? So this is $2. Why? You collected 0.22. That means your total risk is 31 December of risk. It's so funny. Is a dollar 78. That's your total risk. 178 bucks. So this in this case at the 2728 it wouldn't have gotten realized. It doesn't really matter. I just wanted to give you a sense of the size of stuff. But now let's go back here really quick. And then I just want to show you instead with those call credit spreads what you can't do is roll them. You just have to establish a new one. But the problem is with the new one, you're not going to get a lot of money. You're only going to get that 20 sensor",
    "start_timestamp_seconds": 6502.68,
    "end_timestamp_seconds": 6634.2,
    "start_timestamp": "01:48:22",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=6502",
    "chunk_index": 66,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "want to show you instead with those call credit spreads what you can't do is roll them. You just have to establish a new one. But the problem is with the new one, you're not going to get a lot of money. You're only going to get that 20 sensor that 20 30 cents. So when you lose on this one, you're losing 178 bucks. When you win, you're getting 22 cents. So what that means is your risk to reward ratio here is quite skewed. You need 7 January of these, which is 8. You need a win eight of these. So that's the problem with that. Now comparatively, really quick. Let's take a look at what this short call could be. So the short call came in for $2.98 and it was realized at $133 loss. Now that means I need to get a dollar 33 at least in order for this thing to make money. So I can actually get that right here. So I can get a dollar 39 by taking it to the 27. So here's what happens in this rolling option scenario. What I've done is I've moved my basis from 24 to 27 over 10% change in my basis. I'm going to get a dollar 39 for this. That means that my net P&L here is going to be very little, but it will be something. So now let's fast forward two weeks or so. And then this will get us to kind",
    "start_timestamp_seconds": 6615.08,
    "end_timestamp_seconds": 6721.4,
    "start_timestamp": "01:50:15",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=6615",
    "chunk_index": 67,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "over 10% change in my basis. I'm going to get a dollar 39 for this. That means that my net P&L here is going to be very little, but it will be something. So now let's fast forward two weeks or so. And then this will get us to kind of the the heart of the example. I think we have to go a little bit further. I'm just going to go into the standard expiration in October. So let's see now what these calls are trading at. The 27s, they'll effectively be worthless. But I just want to again show you the difference in these scenarios. Okay. So the 27s are completely flat. There's zero. So what that means is in this scenario, again, you didn't make much, but the important thing is that you didn't lose money at the end of it. You actually made six bucks. Why does that matter? Well, the reason why that matters is because if you lost on your $2 call credits bread, you lost a dollar 78 or 178 bucks. Again, not the end of the world. But the difference is, if you then put another one of these on over that timeframe in order to start making some of your money back, you would have made 22 cents or 22 bucks. So what's your net profit here in really it's this minus this. So you still lose money. You still actually lose a decent amount of money. So this trade net,",
    "start_timestamp_seconds": 6694.76,
    "end_timestamp_seconds": 6826.2,
    "start_timestamp": "01:51:34",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=6694",
    "chunk_index": 68,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "timeframe in order to start making some of your money back, you would have made 22 cents or 22 bucks. So what's your net profit here in really it's this minus this. So you still lose money. You still actually lose a decent amount of money. So this trade net, which again, this includes adding another call credit spreads to try to make some of that money back, a fuck the order of. You lose 156 bucks. That's the difference. So in this scenario with the naked, it's not even naked with the covered call. You're able to manipulate it so that you get out at a slight profit. Again, it's not about the profit here. It's that you walked out and you didn't lose net net overall. In this scenario, you did lose net net overall. That's the big difference. And that's why in something like this, I actually would not sell a call credits spread versus the ratio covered calls. I would just keep the ratio closer to what you want it to be. And then manage the short call side of the equation because again, this didn't make a bunch of money. But if you look at the the difference between these, it actually made a decent amount of money. Made a hundred and sixty two dollars more than this one. That ultimately matters. So that's why I would avoid the call credits spreads. And instead just focus on management of the ratio, short calls part of",
    "start_timestamp_seconds": 6790.12,
    "end_timestamp_seconds": 6921.64,
    "start_timestamp": "01:53:10",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=6790",
    "chunk_index": 69,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "the the difference between these, it actually made a decent amount of money. Made a hundred and sixty two dollars more than this one. That ultimately matters. So that's why I would avoid the call credits spreads. And instead just focus on management of the ratio, short calls part of the covered triangle. This is an overview of some of the different ways that you can trade something like game stop. The main thing that I hope you take away. And genuinely, I normally don't mention this. But like I really hope you guys share this video specifically with people that have long equity positions in here, simply to give them information on different ways they can manage it. That doesn't mean have no long equity position. This covered triangle has a long equity position. But it's a way to monetize the rest of the factors of game stop, which make it so unique. And it's so that at the end of the day, you can still buy more inventory if you so choose as compared to this. So a lot of people do this and they don't time it well and they don't have much to show for it. The people that do this typically are just lighting their money on fire. This is one of the more optimized methods to trade something like this. There is a downside where if there's a massive short squeeze, you're not going to be totally exposed to it. But it doesn't mean",
    "start_timestamp_seconds": 6899.96,
    "end_timestamp_seconds": 6998.28,
    "start_timestamp": "01:54:59",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=6899",
    "chunk_index": 70,
    "word_count": 250,
    "upload_date": null,
    "duration": 7024.0
  },
  {
    "video_id": "1rqLJW1nK40",
    "title": "Strategy Comparison in GameStop | Meme Stock Watch Ep54",
    "text": "The people that do this typically are just lighting their money on fire. This is one of the more optimized methods to trade something like this. There is a downside where if there's a massive short squeeze, you're not going to be totally exposed to it. But it doesn't mean that you can't get exposed during the move. You can still adjust things and move things. But it means that in the majority of instances for something like game stop, you can still make money from it. If you have questions, you can hit me up in the discord, be an outlier. See you all later.",
    "start_timestamp_seconds": 6986.12,
    "end_timestamp_seconds": 7017.72,
    "start_timestamp": "01:56:26",
    "video_url": "https://www.youtube.com/watch?v=1rqLJW1nK40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=1rqLJW1nK40&t=6986",
    "chunk_index": 71,
    "word_count": 106,
    "upload_date": null,
    "duration": 7024.0
  }
]