[
  {
    "text": "What's up outliers today? We are going to talk about the absolute best option strategy. I'm going to walk you through seven traits that we need to look for to identify what we would consider to be the best. And then I'm going to give you some ideas to think about with respect to actual strategies that might fit the bill for us. Now, as you know, options are very complex. However, they offer a exposure to a lot of really interesting ways to make money. So when we're looking at the best option strategy, one of the most important elements of this is something that can trade different market conditions because the market goes through different regimes. If we pop over to the platform and we take a look at a five year weekly chart in SPX, you can see that most of the time SPX is upwards trending. So bullish direction. However, you can also see that there are periods like 2022, which is this entire time for you in here where it actually declined. So being able to trade multiple market conditions is going to be really, really important for the best option strategy. We need something that we can consistently make money off of that reliability is one of the most important elements of a strategy because if it's something that regularly produces the results that we expect and they're positively expectant, meaning they're profitable, then it's something we can continue doing in the future, which",
    "metadata": {
      "video_id": "2dP1Cu9Pjt8",
      "title": "The Myth of the ‘Best’ Options Strategy (Here’s What Actually Works)",
      "url": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8",
      "upload_date": "",
      "duration": 779.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8&t=0"
    }
  },
  {
    "text": "that we can consistently make money off of that reliability is one of the most important elements of a strategy because if it's something that regularly produces the results that we expect and they're positively expectant, meaning they're profitable, then it's something we can continue doing in the future, which is really important must have. We want to see things that have larger winning trades relative to the losing positions. Why is this important? Well, it's for convexity. One of the issues with really high win rate strategies here, high win rate strategies is although they win a lot, they tend to win not that much money. So here's a great example of this. If we go into SPX and we go into short term options. So let's use these three day options for an example. I can come out here and we can go super far out of the money and I can sell these two delta puts and I can get like 90 for these two delta puts. So this means that the overwhelming probability is that these are going to expire out of the money. However, this is what we refer to as selling the tails because every once in a while you will get caught. Meaning there will be a big move and when you experience that one, but rare big move, it can wipe out multiples of winners, which is a big problem. Now this leads to our next point where we would prefer something",
    "metadata": {
      "video_id": "2dP1Cu9Pjt8",
      "title": "The Myth of the ‘Best’ Options Strategy (Here’s What Actually Works)",
      "url": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8",
      "upload_date": "",
      "duration": 779.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 10,
      "start_timestamp": "00:01:32",
      "start_timestamp_seconds": 92.32000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8&t=92"
    }
  },
  {
    "text": "every once in a while you will get caught. Meaning there will be a big move and when you experience that one, but rare big move, it can wipe out multiples of winners, which is a big problem. Now this leads to our next point where we would prefer something that is undefined profit potential and that's simply because if we're correct in terms of our direction, we don't want to cap our potential losses to that to our potential gains to that same vein. We do want to cap our losses because again, going back to this scenario, if we choose to sell this 5765 put that expires in three days, let's analyze this trade and let's just say that there happens to be a massive move against us. Let's say that the market drops 15 come Monday because over the weekend, there's some really terrible news that comes out or even if it drops 10 or even 5. What you'll notice is that even on a 5 decline while we're in here trying to make 85 or 90, we're going to lose 7,624. So the probability of SPX dropping this 5 over the weekend, opening Monday and then trending down is low, but you can literally do the math to see how many trades you would wipe out with this 1,7600 loser, which is like 89. So the issue with undefined losses is that they can rack up very, very quickly unless there's a control in place for",
    "metadata": {
      "video_id": "2dP1Cu9Pjt8",
      "title": "The Myth of the ‘Best’ Options Strategy (Here’s What Actually Works)",
      "url": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8",
      "upload_date": "",
      "duration": 779.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 10,
      "start_timestamp": "00:03:04",
      "start_timestamp_seconds": 184.64000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8&t=184"
    }
  },
  {
    "text": "trending down is low, but you can literally do the math to see how many trades you would wipe out with this 1,7600 loser, which is like 89. So the issue with undefined losses is that they can rack up very, very quickly unless there's a control in place for them. We also would want something that benefits from ThaidedaK, which is the standard holding penalty for long options. And we would prefer something that benefits from Gamma because again, that provides convexity to our return, the ability for the actual return profile to accelerate. So now that we know the traits of the best option strategy, what fits the bill and this will be of absolutely no surprise to you. Nothing. Nothing fits this bill. There is no option strategy that does all of this. It doesn't exist. And this is the problem when we try to frame things like what is the best option strategy is we're trying to be lazy. We're trying to say what is the best thing I can do that always works optimally. Guess what? That doesn't exist. Now there's a benefit from all of this. You can absolutely build relative best option strategies. And we use something like the Outlier Strategy process to help us do this. I have a link that talks about this in detail in the notes below. But I want to review it quickly and show you an exact example of this concept. So the Outlier Strategy process, you",
    "metadata": {
      "video_id": "2dP1Cu9Pjt8",
      "title": "The Myth of the ‘Best’ Options Strategy (Here’s What Actually Works)",
      "url": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8",
      "upload_date": "",
      "duration": 779.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 10,
      "start_timestamp": "00:04:36",
      "start_timestamp_seconds": 276.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8&t=276"
    }
  },
  {
    "text": "And we use something like the Outlier Strategy process to help us do this. I have a link that talks about this in detail in the notes below. But I want to review it quickly and show you an exact example of this concept. So the Outlier Strategy process, you will notice that there is absolutely a way to build a best strategy. The problem is the best strategy is going to be relative to specific profit mechanisms or market effects. You will not have something that provides the best across all forms because going back to this, we would prefer something that has large winners relative losses in ideally something with a high win rate. Those two don't typically go together. Same thing with wanting to benefit from theta decay but then also benefiting from gamma. Those two quickly go together. So the broader point here is if we take the time to isolate the actual profit mechanism, the market effect that we're trying to capitalize on, then we absolutely can find optimal structures that we turn into strategies for those very ideas. And I'm going to show you an example right now. So if we go back into the platform and now I actually want to go into on demand. And I want to go back in time to show you an example. And I'm going to show you an example in video because this is actually a position that I spoke to pretty much everybody about on",
    "metadata": {
      "video_id": "2dP1Cu9Pjt8",
      "title": "The Myth of the ‘Best’ Options Strategy (Here’s What Actually Works)",
      "url": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8",
      "upload_date": "",
      "duration": 779.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 10,
      "start_timestamp": "00:06:09",
      "start_timestamp_seconds": 369.28000000000003,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8&t=369"
    }
  },
  {
    "text": "the platform and now I actually want to go into on demand. And I want to go back in time to show you an example. And I'm going to show you an example in video because this is actually a position that I spoke to pretty much everybody about on different streams. And it's because in Nvidia, when deep seek R1 came out, there was this massive adverse reaction that led to a big decline. And my original response was wait and see how this goes. And the idea, the broader idea was eventually I would expect to see a recovery. It's just a hunch based on a bunch of different analysis, but that's the idea. So based on this hunch, there are a couple of different trades we can model. So if we go into the trade tab here and I will show you two different positions that we built using the 21 March and the 16 May option cycles. Let's go to the analyze tab to show you. So the first trade that I built was selling a 21 March, one 12 put, collecting 5.45. And let me scoot this up a little bit so that you can see the actual trade right there. So this is the trade. It's selling essentially a 26 delta put, which is a really high probability of making a decent amount of money. This is through a virtual account. So it's going to require regulation T margin. So in this case, it's",
    "metadata": {
      "video_id": "2dP1Cu9Pjt8",
      "title": "The Myth of the ‘Best’ Options Strategy (Here’s What Actually Works)",
      "url": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8",
      "upload_date": "",
      "duration": 779.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 10,
      "start_timestamp": "00:07:41",
      "start_timestamp_seconds": 461.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8&t=461"
    }
  },
  {
    "text": "see the actual trade right there. So this is the trade. It's selling essentially a 26 delta put, which is a really high probability of making a decent amount of money. This is through a virtual account. So it's going to require regulation T margin. So in this case, it's asking us to put up 1,500 bucks in order to hold this position. If you were to cash, secure this put, you would need 11,200. Okay. So we have the short put on. Then comparatively, we use something similar to what I trade for directional breakouts, which is what we might consider this as it's breaking out on volume compared to the congestion zone over here. And we go out to the 16 May 120 calls. We buy those for 15 90 now right off the jump. You'll notice that this costs 1,590 to put on. This one only requires 1,500 bucks. So right from the get go, we can put on a bunch of these puts if we're so inclined. What's the downside of putting on a bunch of these puts? Well, if we start ramping up the size of this so that it's about the same size position, the issue we run into now is that if we do get a continuation and if Nvidia continues to trend down, had to update the date for you. But if Nvidia dips down 10, you lose 3700 bucks. If it dips down 15, you're now down 6800 bucks. Comparatively to",
    "metadata": {
      "video_id": "2dP1Cu9Pjt8",
      "title": "The Myth of the ‘Best’ Options Strategy (Here’s What Actually Works)",
      "url": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8",
      "upload_date": "",
      "duration": 779.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 10,
      "start_timestamp": "00:09:13",
      "start_timestamp_seconds": 553.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8&t=553"
    }
  },
  {
    "text": "the issue we run into now is that if we do get a continuation and if Nvidia continues to trend down, had to update the date for you. But if Nvidia dips down 10, you lose 3700 bucks. If it dips down 15, you're now down 6800 bucks. Comparatively to this, if Nvidia dips down 5, you lose 270. If it dips down 10, you lose 592. It dips down 15, you lose 865. So this immediately shows you the trade off of different options positions. So now I just want to fast forward time until as far forward as we can go, just for the example, and I just want to compare these different positions for you. Because if I size this back down to just kind of compare them on a one lot basis, I want to show you a couple things. Now I need to update the date and here again, let's go to the 19th. And so this long call at this point is showing us 952 profit. This short put is showing us 424 profit. So via the long call, again, we picked a favorable condition, but for this specific profit mechanism, we make more money with this long call. Now this still isn't optimized for exactly what happened. If we wanted to fully optimize for exactly what happened here, right, to overfit it entirely, you would have bought short dated calls that were out of the money. But the general point I'm trying to",
    "metadata": {
      "video_id": "2dP1Cu9Pjt8",
      "title": "The Myth of the ‘Best’ Options Strategy (Here’s What Actually Works)",
      "url": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8",
      "upload_date": "",
      "duration": 779.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 10,
      "start_timestamp": "00:10:46",
      "start_timestamp_seconds": 646.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8&t=646"
    }
  },
  {
    "text": "money with this long call. Now this still isn't optimized for exactly what happened. If we wanted to fully optimize for exactly what happened here, right, to overfit it entirely, you would have bought short dated calls that were out of the money. But the general point I'm trying to show you is that if we're trying to trade something that quote unquote is the best, and it means that we always do something, always buy an option, always sell an option. There are periods where both will underperform comparatively. And as a trader, you are so much better off outlining different profit mechanisms that you're going to attempt to trade. Again, in this case, the profit mechanism is a price reversion based on a breakout and overextension to the downside. So in that kind of context, if we understand what this kind of price movement typically looks like, we would naturally back into saying, well, selling a put here might cap me short. And if I sold the put at the same size as the long call, I'm taking a ton of risk on a relative basis because I am in the process of playing something to the upside that had a pretty vicious down move. And it can, as always, roll back over to the downside. So the best option strategy is going to be relative and built first around the profit mechanism you're trying to trade. And then the second something that fits in with your broader",
    "metadata": {
      "video_id": "2dP1Cu9Pjt8",
      "title": "The Myth of the ‘Best’ Options Strategy (Here’s What Actually Works)",
      "url": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8",
      "upload_date": "",
      "duration": 779.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 10,
      "start_timestamp": "00:12:18",
      "start_timestamp_seconds": 738.5600000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8&t=738"
    }
  },
  {
    "text": "that had a pretty vicious down move. And it can, as always, roll back over to the downside. So the best option strategy is going to be relative and built first around the profit mechanism you're trying to trade. And then the second something that fits in with your broader portfolio objectives. Be an outlier. See you later.",
    "metadata": {
      "video_id": "2dP1Cu9Pjt8",
      "title": "The Myth of the ‘Best’ Options Strategy (Here’s What Actually Works)",
      "url": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8",
      "upload_date": "",
      "duration": 779.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 10,
      "start_timestamp": "00:13:50",
      "start_timestamp_seconds": 830.8800000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2dP1Cu9Pjt8&t=830"
    }
  }
]