[
  {
    "text": "First off, my bad outliers, I realized that the video I did yesterday was like 20 minutes long. When I start talking about the markets, I kind of can do that. So my goal for today is to keep this a little more palatable for people. And I have two things I want to cover. Obviously, the tech leading sell-off will be the first thing. And then the second thing is we have some really, really interesting new data that's come out in GameStop specifically with this. And I want to talk about some of the homework that I started doing about this specific fund that supposedly holds a just tremendous number of shares. In this case, actually, technically speaking, it's more than the entire flow and then some. So there's some very specific things we can learn about that. And we'll get to that towards the end of the video. So let's start with the broad market, though, because there's important activity going on. Again, exactly what I've been talking about where I don't know which way the market is going to go. But for leading into this week and throughout last week, it just felt like we were in a bit of a rotational period where didn't have a sense where things were going to go, but it felt like we were going to break one way or the other. And one of the things that you've heard me note a few times as we take a look",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=0"
    }
  },
  {
    "text": "in a bit of a rotational period where didn't have a sense where things were going to go, but it felt like we were going to break one way or the other. And one of the things that you've heard me note a few times as we take a look at the broad markets is that tech does not look good. And I've said that multiple times. So and I also in the context of wanting to unwind my teacher's position, which I finally got out of today. So this is looking across the SP 500. We're looking across all of the individual sectors. And take a look. We see XLC communications going down hard. We see XLC technology going down hard. There's a couple others that are falling moderately so XLI would kind of be the next closest in the pack as well as XLB. But guess what? The same tickers I've been talking to you about are showing strength still hitting highs. XLP hit a new high XLR. Hit a new high XL you hit a new high XL V hit a new high XL F hit a new high. So this is the entire idea behind a sector rotation strategy. It's why I have exposure in real estate. It's why I have exposure in XLP products, individual tickers, not XLP itself. It's why I have exposure right now in XLF. And I also have exposure in XLE, which is not, you know, not really playing ball as",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 18,
      "start_timestamp": "00:01:37",
      "start_timestamp_seconds": 97.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=97"
    }
  },
  {
    "text": "sector rotation strategy. It's why I have exposure in real estate. It's why I have exposure in XLP products, individual tickers, not XLP itself. It's why I have exposure right now in XLF. And I also have exposure in XLE, which is not, you know, not really playing ball as much. You know, there's going to be one in the group. That's not doing what I wanted to do. But really, this is more of a individual strength play within the sector, even though XLE is not doing great. It's the NEM trade that I was reviewing earlier, which is doing still well. And realistically, even NEM, which is kind of funny because if we take a look at it, NEM is more related to gold, but it actually has a really high correlation to energy. So I will use this to kind of play both at the same time, the gold commodity in and of itself, but then also the energy sector because especially in short term correlations, this will tie very, very closely to energy. So it's a little bit of a duplicative play. So when I'm talking about it, tying to energy, it's not a direct play on energy. It's actually more of a direct play on materials, but it does carry over massively into energy. But right now, energy was down today and so was NEM, but materials also didn't fly off the shelf today. So kind of a little bit of both, I suppose. Now",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 18,
      "start_timestamp": "00:03:15",
      "start_timestamp_seconds": 195.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=195"
    }
  },
  {
    "text": "on energy. It's actually more of a direct play on materials, but it does carry over massively into energy. But right now, energy was down today and so was NEM, but materials also didn't fly off the shelf today. So kind of a little bit of both, I suppose. Now looking across the market, I continue to see the same thing I always do, opportunity. There are things we can trade to the upside. There are things we can trade to the downside. There are things we can trade sideways. X, L, Y, who's been trading sideways. So you can look in there for individual products that are just sideways trending. Same thing for XLE. Tons of things in there rotating sideways. Some things in there showing strength still. So I always try to remind people that whenever the market starts throwing some of these curve balls that we might feel some type of way about. Right. In videos down almost 10 today, 9.5. That's literally a correction almost in a single day. That's not an insignificant move, especially on a gap down, especially following three preceding down days. This, I'm not going to lie, this looks uglier than I was expecting. I really am a bit surprised because after the earnings, I understood this move. I understood this move. These two to me looked like most people were getting shaken out of the position. And then the people that wanted to be in were going to be in. And",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 18,
      "start_timestamp": "00:04:53",
      "start_timestamp_seconds": 293.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=293"
    }
  },
  {
    "text": "was expecting. I really am a bit surprised because after the earnings, I understood this move. I understood this move. These two to me looked like most people were getting shaken out of the position. And then the people that wanted to be in were going to be in. And then today there's just this big continuation. So one of the things to highlight here is that the markets, they do have momentum and drift. And that's kind of what you're seeing here. People, late comers to the party, people that were figuring out what they wanted to do with their portfolios and then submitting orders. It's just really interesting to me to see this starting to pair down so far. Now, really critical point here for me, if this does not start to base before we start getting down to kind of this level in here, I don't like that. And I don't like that specifically because even though we're starting to rotate down, if this begins basing here and creating a higher low, I'm still okay with it. We're still in an uptrend. It's obviously a correction from here at this point, but it's not egregious. This is still completely okay. What's not going to be okay is if this starts rotating down into this value area. And again, that doesn't mean immediately that we're falling out of bed, but that starts to, in my opinion, really, really call into question the strength of this trend. And all",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 18,
      "start_timestamp": "00:06:31",
      "start_timestamp_seconds": 391.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=391"
    }
  },
  {
    "text": "still completely okay. What's not going to be okay is if this starts rotating down into this value area. And again, that doesn't mean immediately that we're falling out of bed, but that starts to, in my opinion, really, really call into question the strength of this trend. And all trends reverse at some point, at least temporarily. So we have this little bit of a double top almost, but we're starting lower highs, right? So there's our high, lower high, lower high. We have higher low than we come to lower lows, lower lows. So if this comes down to another lower low, that is, in my opinion, clear, clear sign that we're starting to rotate over on this trend. So for me, and I, I mean, I have no direct exposure to Nvidia. I don't care to. I'm typically trading things like T triple cues or NASDAQ futures, which both of those obviously have a ton of exposure to Nvidia inherently leveraged from the jump. But I'm seeing a lot of people getting really antsy to start buying into Nvidia. And I don't blame you, especially if you like the company long term, but as per usual, I always think wait for strength. There's no reason to buy it here at 108 if it's going to drop down to 91. We don't know where it's going to drop. But the way that I typically handle these is I'll literally just set an alert on both sides. So I'll",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 18,
      "start_timestamp": "00:08:09",
      "start_timestamp_seconds": 489.00000000000006,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=489"
    }
  },
  {
    "text": "always think wait for strength. There's no reason to buy it here at 108 if it's going to drop down to 91. We don't know where it's going to drop. But the way that I typically handle these is I'll literally just set an alert on both sides. So I'll be like, okay, if we get a break below here, that tells me we're continuing to the downside. If I get a break above here to the high of this candle, then I start liking it more to the upside and I can play it that way if I'm so inclined and still get it at a relative discount within that range. So it all depends on your trading style, your trading timeframes. But the one thing I try to remind people is when you buy things that a discount or typically a discount for a reason, Nvidia is a really interesting case here because I still think it's an incredibly strong performing stock, but it is rotating down like it's objectively the case. If you had bought up here or up here, you are currently down money. And again, if you're a long term investor, literally nobody cares. That's totally fine. And when I say nobody cares, it means this little down move. It's inconsequential if you're going to hold this for years. And I mean, if I had to bet, I absolutely would bet Nvidia will be worth more in a year or two years than it is",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 18,
      "start_timestamp": "00:09:46",
      "start_timestamp_seconds": 586.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=586"
    }
  },
  {
    "text": "totally fine. And when I say nobody cares, it means this little down move. It's inconsequential if you're going to hold this for years. And I mean, if I had to bet, I absolutely would bet Nvidia will be worth more in a year or two years than it is today. But that's an investor's perspective where there's a giant opportunity cost for that capital being parked there that for me as a trader, I'm uninterested in. I want to trade things as they're doing things that I can tie along with. So for this, a little bit different approach. And again, you can see what I would do is just see, okay, which way do you want to break down or up? And then depending on that, if I want to get some sort of thematic reversal position to the upside, because that's what I would expect to see at some point, it just depends on where does the market decide that the floor starts to get priced in. And we don't know yet. So in video, very interesting case and very clearly just driving the tech sector down. And then when we look across the indices, there's still excessive weakness in IWM, down over 3 today, Hughes, tech heavy, down over 3 today. So these two really dragging. And the SP 500 was only down 2. So the SP 500 continues to be propped up by all these other sectors. Now the question is, how long do they",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 18,
      "start_timestamp": "00:11:24",
      "start_timestamp_seconds": 684.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=684"
    }
  },
  {
    "text": "excessive weakness in IWM, down over 3 today, Hughes, tech heavy, down over 3 today. So these two really dragging. And the SP 500 was only down 2. So the SP 500 continues to be propped up by all these other sectors. Now the question is, how long do they hang on? So for me, in the way that I trade, also I realize that the video is already nine minutes long. I'm doing the same thing I did yesterday, sorry. When I look at the SP 500, it does look like it's maintaining at least some residual strength, but the question is for how long? And for me, with stuff like this, what I try to do now is keep a really sharp eye on everything that's propping up the SP 500 right now. But again, are those same sectors that I was highlighting before? And if those start showing weakness or rotating over, and this continues to be the case, then I mean, that's essentially alignment to the downside, very difficult to slow down until people decide that there is value at that point and they want to buy back in. So that is what I am keeping a very close eye on. Now let's pivot over to GameStop because we did see some kind of interesting news today. From a trading perspective, we had a little bit of a gap up, which was nice to see that was kind of shunted pretty quickly, still continues this uptrend.",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 18,
      "start_timestamp": "00:13:02",
      "start_timestamp_seconds": 782.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=782"
    }
  },
  {
    "text": "a very close eye on. Now let's pivot over to GameStop because we did see some kind of interesting news today. From a trading perspective, we had a little bit of a gap up, which was nice to see that was kind of shunted pretty quickly, still continues this uptrend. So I'm digging that, no issues with it. And I don't, I think I still have my calls on. I haven't looked actually in a little bit to see what they're doing, but they're going to be coming up on soon that I have to do something with them. It's the short calls. Oh yeah, and for those that are wondering about the conversation before about Newmont and XLE, you can see in the shorter term timeframes, it correlates pretty heavily. So three days, 99 correlation, five days, 85 and then 10 days, 77. So sometimes when I'm trying to trade the kind of both of those ideas in one ticker, Newmont is one that I will take a look at. Again, it's not like a pure energy play. So that's not what we were coming here to look at though. We were coming to look at GameStop. So if we take a look at the open interest, we have 560,000 calls against 269 on the put side. We're not quite two to one or maybe actually right about two to one, but it's still scattered all over the place. When I see what explorations are hot, it's actually not",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 18,
      "start_timestamp": "00:14:40",
      "start_timestamp_seconds": 880.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=880"
    }
  },
  {
    "text": "we take a look at the open interest, we have 560,000 calls against 269 on the put side. We're not quite two to one or maybe actually right about two to one, but it's still scattered all over the place. When I see what explorations are hot, it's actually not the six-sep. I'm seeing 13-sep starting to catch up a little bit here, but you'll notice like I'm seeing a lot of green, which is 18-Oct. I'm seeing a lot of 20-sep, which is this kind of salmon color. Then we have these gray boxes, which are further out in time, 17-GN 25. So we're just kind of all over the place, which just means that we don't have a clear chain that we're leaning on right now. When I look at volatility, this looks completely normal now. Short-term vol, 133, 140 for earnings vol, right? Because we know earnings right now is still scheduled for the 10th after the market. So this is the interesting news that came out today though. This popped up, I think on Superstunk, and then a couple folks in the Discord brought it in there just because it's an interesting observation. And we see that we have this entity that essentially has what, 4 billion shares, which 4.7 billion, which, you know, if you're, I'm not good at math, but there's not that many shares. So then what does this tell me? It tells me more likely than not. One, there could be some",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 18,
      "start_timestamp": "00:16:18",
      "start_timestamp_seconds": 978.0000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=978"
    }
  },
  {
    "text": "that we have this entity that essentially has what, 4 billion shares, which 4.7 billion, which, you know, if you're, I'm not good at math, but there's not that many shares. So then what does this tell me? It tells me more likely than not. One, there could be some sort of reporting error. That can be the case. Now what I also would imagine to be the case here is this could just be use of derivatives. So when I took a closer look at the fund itself, this is the non-lending variation, which this one is the lending variation, just showing you that there's a difference between these funds. So there is a non-lending variant of this. That's not what this one is. This one that corresponds with this clearly says lending. So we can find the lending variation here and we can see this. The fund may make limited use of futures and or options for the purpose of maintaining equity exposure. This fund may participate in securities lending. A lot of questions. I don't have answers yet. So this is something I'm actually going to chat with Newton about a little bit because he might have a better sense on this particular topic than I do. I don't know if this is part of this kind of creation redemption cycle. I also don't know the way that these run because it's flagged as an index fund, which is fascinating because if you go to their website",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 18,
      "start_timestamp": "00:17:55",
      "start_timestamp_seconds": 1075.8000000000002,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=1075"
    }
  },
  {
    "text": "a better sense on this particular topic than I do. I don't know if this is part of this kind of creation redemption cycle. I also don't know the way that these run because it's flagged as an index fund, which is fascinating because if you go to their website and we want to take a look at their funds, they have equity funds. And then if we break down these equity funds management style, there's actively managed funds. And then there's index style funds. The whole point of index style funds is they're supposed to represent an index. So it's very, very curious to me that we see this kind of structure. I don't fully understand what it is or why it is the way it is. The other thing that I can't find is just a ticker for this. If any of you all know what the ticker symbol is for this product, I would love to hear it. What the ticker is for this because as I go through their funds, I don't see anything labeled this. Right? So if I literally copy this directly, the terminology perfectly, I uncheck any filters, right? So that we're seeing everything that they have. I drop that in, nothing returns. So then I was like, okay, well, maybe somehow it's in something else. Maybe it's in this or the multi asset. So check out maybe the cash fund and see if there's anything in here. Obviously not. This is looking",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 18,
      "start_timestamp": "00:19:33",
      "start_timestamp_seconds": 1173.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=1173"
    }
  },
  {
    "text": "everything that they have. I drop that in, nothing returns. So then I was like, okay, well, maybe somehow it's in something else. Maybe it's in this or the multi asset. So check out maybe the cash fund and see if there's anything in here. Obviously not. This is looking at typical security. So then let's go to multi asset and see if there's anything like this in here, which, again, this is, I just don't see it because this is talking about completely, like a completely different set of products, right? This is global tactical asset allocation. So this is using stuff from all over the place. So yeah, I'm confused. I don't know where this is on their website. So if anybody, maybe all funds, I didn't check in here yet. See, I don't get it. Maybe if I get rid of some of the extra tail in the words. Nothing. I guess I'm going through none of those are popping up. So I don't know where this is. I'm actually like, like, kind of, I'm kind of confused. So because I went to the website directly from here and I was trying to find the specific details for this, again, for this specific product so that I could try to look more closely. Because the other thing is, again, like if this is 1.56 of the fund and this is Uber technologies and we can figure out how much the fund is, 4.38 billion. So if we",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 18,
      "start_timestamp": "00:21:11",
      "start_timestamp_seconds": 1271.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=1271"
    }
  },
  {
    "text": "for this, again, for this specific product so that I could try to look more closely. Because the other thing is, again, like if this is 1.56 of the fund and this is Uber technologies and we can figure out how much the fund is, 4.38 billion. So if we take handy dandy calculator, we go 438 billion, got to turn it sideways so we can get enough zeros that is million, there's billion, 4.38 billion. And then we just multiply that by 1.56 times 1.56. Oops, by 0156, my bad. Times point 0156. So it gives us 68 million, 68.3 million. Why do I care about this? Because I can figure out at least about what this is. Right? Because if this is telling me that in this fund, there's again, 68 billion dollars of Uber, well then how does this other stuff fit into their fund? Because this is telling me that they control 4.7 billion dollars of GameStop. Which again, even if you're using derivatives, the notional exposure matters, which, I mean, let's just do the math. It's going to be significantly more than that. So if we do 4.7 billion shares, I'm just going to round it. So 4.7 billion times current market price, 23. So 100 and 8 billion dollars, notional value. So just something weird is happening here. And again, I don't know what it is. So this is something I intend to look more deeply into to try to sort this out. And",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 18,
      "start_timestamp": "00:22:49",
      "start_timestamp_seconds": 1369.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=1369"
    }
  },
  {
    "text": "it. So 4.7 billion times current market price, 23. So 100 and 8 billion dollars, notional value. So just something weird is happening here. And again, I don't know what it is. So this is something I intend to look more deeply into to try to sort this out. And again, this is why for the people that are kind of like Eric, why do you spend time looking at GameStop? It is because of shit like this. It's because this doesn't make sense. I am not quite as far as like the full tin foil apes. And I'm not jumping to the idea of like, it's all bullshit. It's immediate manipulation. So there's a solid part of me that looks at this and says, it kind of looks like manipulation of some sort. I don't know. So then the objective part of my analysis wants to try to find an objective, an objective output that I can prove, right? Because I have my instincts, which says this looks weird. But just because my instincts say that, I don't think those to the bank and just say, yeah, it's all rigged. Very well could be. But I'm going to try and analyze it to see if I can find an answer, which right now I don't have one. I don't know what this is. But I know just in terms of the notional size, it doesn't make sense relative to GameStop, which leads me to believe based on again, this",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 18,
      "start_timestamp": "00:24:27",
      "start_timestamp_seconds": 1467.0000000000002,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=1467"
    }
  },
  {
    "text": "and analyze it to see if I can find an answer, which right now I don't have one. I don't know what this is. But I know just in terms of the notional size, it doesn't make sense relative to GameStop, which leads me to believe based on again, this perspective that I cannot find this freaking fund on their website. But it tells me that they do use futures and options in that they might participate in securities lending. It's just weird, man. It's just weird. So yeah, just like I said at the beginning of the video, I'm so sorry. Because here we are at 20 minutes again. But these are just two really interesting topics to me right now that I want to understand more deeply. This one's going to take me some time because everything I look at with this, there's no clear simple answers. I actually just set up a call. Well, I reached out to one of my friends who's a market maker because I'm literally going to ask about this because I'm just curious how this kind of thing structures itself, specifically with respect to the fund. And he runs some different funds as well for white labeled clients. And so I have a bunch of questions, not just about this, but also just about the creation redemption cycle as far as he sees it from a market making perspective. So this will be just another thing I'm adding to the list. Last",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 18,
      "start_timestamp": "00:26:04",
      "start_timestamp_seconds": 1564.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=1564"
    }
  },
  {
    "text": "as well for white labeled clients. And so I have a bunch of questions, not just about this, but also just about the creation redemption cycle as far as he sees it from a market making perspective. So this will be just another thing I'm adding to the list. Last time I spoke with him, we literally spoke for like three and a half hours. So it'll probably be a long conversation. But hopefully I can learn a little bit more because again, this is why I'm fascinated with GameStop is every time I look at it, there's some shit that's completely in the anomalous to me that I don't understand and I want to learn. And I'm learning a ton even with something like this. It's a blast. So as always, anything I should take a look at, let me know, be an outlier. I will see you all later.",
    "metadata": {
      "video_id": "2I6SPZjnjew",
      "title": "NVDA Market Correction & Analysis of Fund GME Holdings",
      "url": "https://www.youtube.com/watch?v=2I6SPZjnjew",
      "upload_date": "",
      "duration": 1219.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 18,
      "start_timestamp": "00:27:42",
      "start_timestamp_seconds": 1662.6000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2I6SPZjnjew&t=1662"
    }
  }
]