[
  {
    "text": "What's up, Abe's time for your game stop update as promised every week. We're taking a look at it even though this week is a little bit quiet. There's a couple of things I want to highlight and I do want to spend a little time talking about some of the latest news around store closures, analyst estimates and stuff like that. Then do you think it kind of paints a little bit of a picture for where we're at with the stock? Now, first thing, price performance, you can see that we're actually leveling off here. And this is a very welcome surprise. None of these lines have been drawn recently. These are all things that have been existing on the chart for a little while. And I draw that point out just because you can see that this down move has been in a couple of different stages. This hasn't been parabolic down. It's been down, big down day, but then consolidation down, slight drift down and gap up consolidation sideways, then three down days. And now we are consolidating sideways. So what this tells me is that the market is still both well game stop is susceptible to the broader market movements, but then it's also still catching bids, which in the grand scheme of things is really solid, I think. Now it does need to make a choice from essentially this zone that's building out. It's good that it's trending sideways through this, especially as the",
    "metadata": {
      "video_id": "2wlur2p61Mg",
      "title": "Options Trader's Analysis of GameStop (GME)",
      "url": "https://www.youtube.com/watch?v=2wlur2p61Mg",
      "upload_date": "",
      "duration": 617.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2wlur2p61Mg&t=0"
    }
  },
  {
    "text": "to the broader market movements, but then it's also still catching bids, which in the grand scheme of things is really solid, I think. Now it does need to make a choice from essentially this zone that's building out. It's good that it's trending sideways through this, especially as the market was showing some pretty heavy weakness during the same stage. If we take a look at another chart really quick, just to share that point more closely, I want to give you a specific comparison point because I think it is useful. So let's take a look at game stop. Well actually, let's take a look at small caps here. We'll take a look at IWM and then we already have game stop ups. Let's great. And let's zoom these out a little bit more just to get a bit more data points in there but to the laptop can't do that with game stop up for goks. It's gone completely parabolic within the last year. So we have to tighten this up. So let's take a look. I want you to specifically monitor the time frames from this part of the chart, right? So I'm kind of highlighting the 20th here and then the same period here. And I want you to take a look at the move in game stop relative to small caps over this time frame, right? So game stop has been showing some pretty significant relative strength, even if we go out to large",
    "metadata": {
      "video_id": "2wlur2p61Mg",
      "title": "Options Trader's Analysis of GameStop (GME)",
      "url": "https://www.youtube.com/watch?v=2wlur2p61Mg",
      "upload_date": "",
      "duration": 617.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2wlur2p61Mg&t=0"
    }
  },
  {
    "text": "the 20th here and then the same period here. And I want you to take a look at the move in game stop relative to small caps over this time frame, right? So game stop has been showing some pretty significant relative strength, even if we go out to large cap stocks. And again, we use the same reference period of essentially from the 20th, which is right here on both. And if we look at the moves here, game stop has gone from 27 and now it's sitting at 25. So definitely a pretty big decline on a percentage basis, but two point decline otherwise. So it's around 10, but then we can see on the 20th here on a relative basis, SP 500s gone from 612 down to 583. The main thing is obviously an volatility adjusted move 10 in game stop is kind of a nothing don't standard fair game stop moves a lot. And if you take a look at the average true range or average daily range comparison in the SP 500, this is accelerated massively over this time frame, right? But if you take a look over the last 90 day period, the average true range is 1.16, then it goes to 1.33 and then it effectively almost doubles to 2.3. Whereas if we take a look at the difference between the 20 day on game stop, which is 5 and then on a 5 day, it's 4.7. So even though on a relative",
    "metadata": {
      "video_id": "2wlur2p61Mg",
      "title": "Options Trader's Analysis of GameStop (GME)",
      "url": "https://www.youtube.com/watch?v=2wlur2p61Mg",
      "upload_date": "",
      "duration": 617.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2wlur2p61Mg&t=0"
    }
  },
  {
    "text": "true range is 1.16, then it goes to 1.33 and then it effectively almost doubles to 2.3. Whereas if we take a look at the difference between the 20 day on game stop, which is 5 and then on a 5 day, it's 4.7. So even though on a relative basis, this is moving a lot relative to game stop specifically, it's actually kind of a stabilizing factor, which is very interesting to see. That aside, I did go through the options chain as per usual, just to see if anything sticks out to us. And honestly, not much. There was a little bit of a spike today that I can see here with respect to net call premium, but it's still not like a tremendously massive amount or anything that I would say, like, oh, yeah, this is a game changer, something crazy is going on here. I will say that this is notably bullish, though, compared to effectively the last two months. We haven't hit the same one mill level since towards the end of April. The net call premium has been pretty light. So the fact that it is skewing bullish today is actually noteworthy in and of itself from a net premium perspective. And then if we take a look at this overall trades and see if anything sticks out to us from the perspective of directional plays, we have to kill the spreads so that we're just looking at single legs. And we can see",
    "metadata": {
      "video_id": "2wlur2p61Mg",
      "title": "Options Trader's Analysis of GameStop (GME)",
      "url": "https://www.youtube.com/watch?v=2wlur2p61Mg",
      "upload_date": "",
      "duration": 617.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2wlur2p61Mg&t=0"
    }
  },
  {
    "text": "of itself from a net premium perspective. And then if we take a look at this overall trades and see if anything sticks out to us from the perspective of directional plays, we have to kill the spreads so that we're just looking at single legs. And we can see a lot of the build out is still out in 2026. These are people speculating on longer term ideas, which again is good to see because this is not game stop being dominated by expectations of short term price distortions. This is expectation of game stop as a company growing in value, which is exactly the kind of thing that I want to see as an investor. If we take a look at the options chain in the platform, you'll notice a couple things. The first thing is obviously we can see volatility is getting way, way, way elevated here in the 28 March expiration cycle. And right now earnings is slated for the 25th after the close. We'll see if it actually sticks there. But right now that's where the market is agreeing. It's seeing it there. If we take a look at the total breakdown of calls to puts still maintaining pretty strong and calls skew, not a big shift there, but a ton. Take a look at this volume today. 72,000 calls again, 17,000 puts and take a look at how many were bought at the ask or above. That's a actually tremendous value. The fact that",
    "metadata": {
      "video_id": "2wlur2p61Mg",
      "title": "Options Trader's Analysis of GameStop (GME)",
      "url": "https://www.youtube.com/watch?v=2wlur2p61Mg",
      "upload_date": "",
      "duration": 617.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2wlur2p61Mg&t=0"
    }
  },
  {
    "text": "puts still maintaining pretty strong and calls skew, not a big shift there, but a ton. Take a look at this volume today. 72,000 calls again, 17,000 puts and take a look at how many were bought at the ask or above. That's a actually tremendous value. The fact that that's 44. I typically would expect to see the 40 handle as the in between the market. So these are absolutely people speculating to the upside. A lot of the volume is in the seven March expiration. So if we take a look, 28,000 of that is in seven March. And then if we go out to that longer term expiration, the 16 Jan, only 1500 options out that far, 21 March is about 10,000. So most of it is in the longer term, expiration on a combination. Obviously, a lot of it is the short term front play as per usual, but those are lower overall values. If we take a look at overall build out, the green here tells me that these are net ads. The contracts are still building out to the upside and a little bit same on the put side, but again, nothing to extreme here. Now the last thing I want to talk about is this. So there's some recent news that relates to the store closures. We can see that I think we already talked about some of these in Ohio. I think this article is from like the 26th or something like",
    "metadata": {
      "video_id": "2wlur2p61Mg",
      "title": "Options Trader's Analysis of GameStop (GME)",
      "url": "https://www.youtube.com/watch?v=2wlur2p61Mg",
      "upload_date": "",
      "duration": 617.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2wlur2p61Mg&t=0"
    }
  },
  {
    "text": "here. Now the last thing I want to talk about is this. So there's some recent news that relates to the store closures. We can see that I think we already talked about some of these in Ohio. I think this article is from like the 26th or something like that. Yeah, 27 Feb. And it just talks about closing more of the stores, which again, I think is everybody knows this. We're trying to offload the stores that are not driving profitability, which is exactly what should happen. And you can see that here's an entire list of the stores so far. So this is continuing to expand and you can see that it's not limited to a place like Ohio. It's kind of across the board. The other thing that was really interesting was this. So they're talking about selling their international operations. This came out a little while ago. We originally discussed this, but I think it's worth just like just mentioning it in total because this drives the broader picture that GameStop is reinventing itself. It's doing what it needs to do to survive as a company. The fact that it's looking for stuff like this, the footprint that it has in Canada in France with Canada specifically representing 5 of sales are saying, okay, well, this isn't worth the investment we should divest from this and try to reallocate that money to where we see strength, which again, makes a lot of sense. Now the",
    "metadata": {
      "video_id": "2wlur2p61Mg",
      "title": "Options Trader's Analysis of GameStop (GME)",
      "url": "https://www.youtube.com/watch?v=2wlur2p61Mg",
      "upload_date": "",
      "duration": 617.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2wlur2p61Mg&t=0"
    }
  },
  {
    "text": "the footprint that it has in Canada in France with Canada specifically representing 5 of sales are saying, okay, well, this isn't worth the investment we should divest from this and try to reallocate that money to where we see strength, which again, makes a lot of sense. Now the last thing I want to mention quick here, I was looking through this. This is kind of interesting. This is from the street and it just shares analyst estimates on GameStop EPS and most of them are showing negative expectations for fiscal year 2425. You can see what the ranges are for both of those periods. There are some that are starting to eyeball potential profitability is again, as you can see, expanding towards 2025. But these are using mean estimates. So we'll see exactly how it lands because again, they're sitting on a lot of cash which does help, but revenues are still contracting. So we kind of need to see where revenues go. But one of the cool parts about this is on a value basis. You can see price to sales are actually starting to show a little bit of opportunity from like a value perspective. So that is the current state of GameStop as I see it from a trader's perspective. As always, if you guys want to learn more about the depth and the lore, the due to talk to is Richard Newton. He's the guy to go see for all that stuff. He knows",
    "metadata": {
      "video_id": "2wlur2p61Mg",
      "title": "Options Trader's Analysis of GameStop (GME)",
      "url": "https://www.youtube.com/watch?v=2wlur2p61Mg",
      "upload_date": "",
      "duration": 617.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2wlur2p61Mg&t=0"
    }
  },
  {
    "text": "that is the current state of GameStop as I see it from a trader's perspective. As always, if you guys want to learn more about the depth and the lore, the due to talk to is Richard Newton. He's the guy to go see for all that stuff. He knows way more about GameStop than I could ever even hope to approach. So he's the guy for that kind of context, but I aim to add a slightly different lens and talk about the actual traders' lens of stuff as well as the options market. So as always, if you have any questions, let me know. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "2wlur2p61Mg",
      "title": "Options Trader's Analysis of GameStop (GME)",
      "url": "https://www.youtube.com/watch?v=2wlur2p61Mg",
      "upload_date": "",
      "duration": 617.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2wlur2p61Mg&t=0"
    }
  }
]