[
  {
    "text": "I'll hire options trading quick tips when you learn something in three minutes or less. Let's get in. One of the most common mistakes new options traders make is solving the wrong problems. What does that look like? Well, above my head here we have a three-month daily chart of Nvidia and it looks like it's going down. And very frequently an option trader will see something like this and they will go into the options chain and they'll start to say, well, how do I essentially play my idea? Should I use the options that expire in 16 May and 21 March and should I do more of the 21 March than the 16 May because they're cheaper? Meanwhile, they're not answering the most important question. The most important question here is what is the profit mechanism that I'm trying to trade? And then what structure and strategy fits this profit mechanism the best? What does that mean? Well, let's say for example, we think Nvidia might go down a little bit but it might not actually go down very much. Let's just say that we think it might hang around between 14 and 110 something like that, not really moving a whole lot. Well, here's the problem. If it does that, whether you buy the options that are near term, 21 March or the options that are further out in time, it doesn't matter. You're going to lose money in either scenario and it's because we're trying to",
    "metadata": {
      "video_id": "2xpqAj677Cc",
      "title": "Solving the Right Problems as an Options Trader",
      "url": "https://www.youtube.com/watch?v=2xpqAj677Cc",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 3,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2xpqAj677Cc&t=0"
    }
  },
  {
    "text": "really moving a whole lot. Well, here's the problem. If it does that, whether you buy the options that are near term, 21 March or the options that are further out in time, it doesn't matter. You're going to lose money in either scenario and it's because we're trying to answer the wrong problem. We're trying to say, what should these explorations make the most sense? And we really need to start answering the problem sooner further up to chain the map, which is what fits my idea the best because in this case, maybe it actually makes more sense to sell calls and show you can spread them off, trade a short call vertical spread. But if we're not actually expecting it to move that much, rather than buying premium when implied volatility is up at 88 if we don't really expect that big of a move, the only scenario that you're walking into with those long puts is which one's going to lose more money faster. So solve the right problems as a trader. It typically starts with clearly identifying the profit mechanism that you're trying to trade and then building the best possible position you can around that, not trying to solve for trivial details like should I do a 50 delta or a 51 delta, that comes later down the line, being outlier, see you later.",
    "metadata": {
      "video_id": "2xpqAj677Cc",
      "title": "Solving the Right Problems as an Options Trader",
      "url": "https://www.youtube.com/watch?v=2xpqAj677Cc",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 3,
      "start_timestamp": "00:01:22",
      "start_timestamp_seconds": 82.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2xpqAj677Cc&t=82"
    }
  },
  {
    "text": "that, not trying to solve for trivial details like should I do a 50 delta or a 51 delta, that comes later down the line, being outlier, see you later.",
    "metadata": {
      "video_id": "2xpqAj677Cc",
      "title": "Solving the Right Problems as an Options Trader",
      "url": "https://www.youtube.com/watch?v=2xpqAj677Cc",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 3,
      "start_timestamp": "00:02:30",
      "start_timestamp_seconds": 150.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=2xpqAj677Cc&t=150"
    }
  }
]