[
  {
    "text": "What's up gang? Today we're talking about zero DTE SPX options trading specifically in 2023 because this year's been kind of interesting. I'll be honest with you. I take a look at data pretty much every day with regards to trading and there are some anomalies this year that I picked up on and I actually pivoted what I was doing mid-year because of that. So the goal of this video is to walk through two things. The first thing is kind of what happened with the trading side of stuff and then the second part is to walk you through a little bit of this concept of being able to pivot. This is one of the reasons why a lot of traders in my opinion fail that become too systematic because you try to execute the same exact way every single time without fail and sometimes markets change. What we did before might not work now and that's the point. What's up everybody? Eric here. Welcome back to the outliers. Shout out to the Patreon family. You guys make content like this possible for everybody else. So if what I do helps you in any way consider signing up. All right so let's start with what didn't work. What I'm showing you here is a back test from my friends over at Options Omega. I am affiliated with them. This isn't a promoted video by them. This is just me using the platform because I think it's usable for",
    "metadata": {
      "video_id": "3_VUjiChU4o",
      "title": "0DTE Options Trading Performance",
      "url": "https://www.youtube.com/watch?v=3_VUjiChU4o",
      "upload_date": "",
      "duration": 548.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3_VUjiChU4o&t=0"
    }
  },
  {
    "text": "All right so let's start with what didn't work. What I'm showing you here is a back test from my friends over at Options Omega. I am affiliated with them. This isn't a promoted video by them. This is just me using the platform because I think it's usable for you folks. So the details to signing up for them for 50 off are in the notes below for those interested but this is an easy way to summarize a lot of information. This is going to be a mix of their information and then my own trade data that I track. So here I was looking at 2015 and I was using two days of expiration because daily expiration weren't launched then and I was looking at 50 delta short straddles worked which is really to capture variance risk premiums for those that are unaware a short straddle simply looks like this. It's a short option both call and put that share the same strike price typically trying to get rid of 50 delta and the whole premise of this trade is to capture variance risk premiums which I have a standalone video that walks through what those are in detail a link to them in the notes below but in the meantime for a quick refresh variance risk premiums is simply the tendency for implied volatility which is the yellow lines in this graph down here that I'm highlighting pens to trend over realize volatility which are the",
    "metadata": {
      "video_id": "3_VUjiChU4o",
      "title": "0DTE Options Trading Performance",
      "url": "https://www.youtube.com/watch?v=3_VUjiChU4o",
      "upload_date": "",
      "duration": 548.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:01:29",
      "start_timestamp_seconds": 89.42222222222223,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3_VUjiChU4o&t=89"
    }
  },
  {
    "text": "in detail a link to them in the notes below but in the meantime for a quick refresh variance risk premiums is simply the tendency for implied volatility which is the yellow lines in this graph down here that I'm highlighting pens to trend over realize volatility which are the white lines that you see here and you can see in general the yellow line is above the white line that's variance risk premiums and it's a sort of systematic alpha it's actually one of the best possible things retail traders can expose themselves to because it is really persistent okay so that is the short straddle why the short straddle because this is kind of a more pure play on variance risk premiums compared to something like this now this is looking at the same time frame but looking at a 20 delta two-days expiration short strangle and this is from the same exact time frame the idea here is if you look at the PL for these two different positions the short straddle performed much better it came out like 700 dollars ahead I was just using essentially one lot for each of these trades but you can see that in general the straddle performed better and this was back in 2015 so to give you some context let's take a look at the chart over here this is one 2015 kicked off notice how relative to what we're seeing now kind of flat there's really not a",
    "metadata": {
      "video_id": "3_VUjiChU4o",
      "title": "0DTE Options Trading Performance",
      "url": "https://www.youtube.com/watch?v=3_VUjiChU4o",
      "upload_date": "",
      "duration": 548.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:02:58",
      "start_timestamp_seconds": 178.84444444444446,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3_VUjiChU4o&t=178"
    }
  },
  {
    "text": "see that in general the straddle performed better and this was back in 2015 so to give you some context let's take a look at the chart over here this is one 2015 kicked off notice how relative to what we're seeing now kind of flat there's really not a whole lot going on here until towards the end of the year which we did start to see some volatility it's actually why these strategies didn't do super great because of this period here but in general the daily movements were not that big and that's an important detail especially if you look at that compared to what we see now the daily movements are much larger in general just for reference this is using a weekly aggregation but still you can see that they're much larger in scale so why does all of this matter what what didn't work is what did work for a long time I'm sorry I'm confused which is just selling the short straddles so now I want to walk you through what did actually work and then most importantly how I actually did trading what I do because there is a slight difference between the data you're about to see and what I did so this is looking at one lots looking at this year only 2023 and it's looking at one January to 10 November and you'll see there's a bunch of different permutations up here the way you can think about this",
    "metadata": {
      "video_id": "3_VUjiChU4o",
      "title": "0DTE Options Trading Performance",
      "url": "https://www.youtube.com/watch?v=3_VUjiChU4o",
      "upload_date": "",
      "duration": 548.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:04:28",
      "start_timestamp_seconds": 268.26666666666665,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3_VUjiChU4o&t=268"
    }
  },
  {
    "text": "the data you're about to see and what I did so this is looking at one lots looking at this year only 2023 and it's looking at one January to 10 November and you'll see there's a bunch of different permutations up here the way you can think about this is that the different columns are different combinations of the strategies we have the delta's so this is looking at a 15 delta 20 delta 30 delta 50 delta for calls and puts so this entire study is looking at straddles or strangles straddles are the 50 delta anything other than that are strangles now these two rows here max profit max loss this is showing if there is any max profit management applied or max loss management so kind of for these first four columns notice how there's no max profit no max loss management and then at the next sets of columns I start to introduce max loss management and that's because I talked about this a little bit earlier in the year but I already started to catch wind that things were changing so I was testing different things now this is essentially how it all played out what worked the best from a back testing perspective was 20 delta short call short put so short strangle managed at a 300 percent max loss there's a really really really interesting piece that comes with this notice how if we look at something like the 20 delta strangle",
    "metadata": {
      "video_id": "3_VUjiChU4o",
      "title": "0DTE Options Trading Performance",
      "url": "https://www.youtube.com/watch?v=3_VUjiChU4o",
      "upload_date": "",
      "duration": 548.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:05:57",
      "start_timestamp_seconds": 357.6888888888889,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3_VUjiChU4o&t=357"
    }
  },
  {
    "text": "out what worked the best from a back testing perspective was 20 delta short call short put so short strangle managed at a 300 percent max loss there's a really really really interesting piece that comes with this notice how if we look at something like the 20 delta strangle with no loss management there's 154 winning positions now if we apply a 250 percent loss management there is now 149 if we look at a 300 percent loss management 152 and then 153 winning trades the reason why this matters is because we do not want to get stopped out prematurely which is what happened in this 250 percent scenario this means that there were trades that went outside of our loss management band that actually came back in now fortunately that's actually not that big of a difference and that's why this worked so well this year notice how the max winners if no no management was applied was 154 so what this means is that there's only five trades that you artificially cut out and in this case there's only two trades notice though the change in the max loss this is why it all comes together because the max loss in this trade went from 5,623 bucks and it dropped down to 3360 big change in max loss this is the exact thing that I'm talking about when I'm saying cut off the tails because if we take a look at a bell curve imagine that",
    "metadata": {
      "video_id": "3_VUjiChU4o",
      "title": "0DTE Options Trading Performance",
      "url": "https://www.youtube.com/watch?v=3_VUjiChU4o",
      "upload_date": "",
      "duration": 548.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:07:27",
      "start_timestamp_seconds": 447.11111111111114,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3_VUjiChU4o&t=447"
    }
  },
  {
    "text": "because the max loss in this trade went from 5,623 bucks and it dropped down to 3360 big change in max loss this is the exact thing that I'm talking about when I'm saying cut off the tails because if we take a look at a bell curve imagine that each individual trade here is a dot and this represents the distribution of those dots what we're doing by cutting off the tails is we are managing this loss we're taking away these really large losing trades and it drastically increases our wind potential which is exactly the point here so what did I actually do here it is from the middle of the year is about 22 May is when I made this pivot and I ran this I typically run the strategy almost always so in this case I ran 20 delta short strangles managed at a 300 max loss now instead of a one lot I typically trade five lots so that's why you'll see these numbers look quite different however the things I want to hone in on is the total number of trades I had was 121 with 89 winning trades so I did still have some pretty serious large losses that occurred relatively infrequently but still enough that it hurts the profitability of the position so I did take a look at this study to see okay well if I'm doing this 20 delta strangle what if I either decrease or increase the max",
    "metadata": {
      "video_id": "3_VUjiChU4o",
      "title": "0DTE Options Trading Performance",
      "url": "https://www.youtube.com/watch?v=3_VUjiChU4o",
      "upload_date": "",
      "duration": 548.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:08:56",
      "start_timestamp_seconds": 536.5333333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3_VUjiChU4o&t=536"
    }
  },
  {
    "text": "have some pretty serious large losses that occurred relatively infrequently but still enough that it hurts the profitability of the position so I did take a look at this study to see okay well if I'm doing this 20 delta strangle what if I either decrease or increase the max loss potential and this is actually still the sweet spot it's just a function of trading this kind of thing so I actually walked out up about 6,000 so far in the year so as long as I don't throw it all away it's a pretty good year the main thing I want you guys to take away from this is you might have your typical way of deploying which is great however you have to stay sensitive to the current market conditions because what worked before doesn't always continue to work in the future and it's a continual system of optimization that's all based on what a good trading log it's beautiful if you are tracking all of this detail you can come across like I did earlier in the year when something didn't look right compared to what it looked like when it was working and I knew it was time to try something else if any questions comments concerns as always drop me a line throw it in the comments below be an outlier see you guys later",
    "metadata": {
      "video_id": "3_VUjiChU4o",
      "title": "0DTE Options Trading Performance",
      "url": "https://www.youtube.com/watch?v=3_VUjiChU4o",
      "upload_date": "",
      "duration": 548.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:10:25",
      "start_timestamp_seconds": 625.9555555555556,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3_VUjiChU4o&t=625"
    }
  },
  {
    "text": "it was time to try something else if any questions comments concerns as always drop me a line throw it in the comments below be an outlier see you guys later",
    "metadata": {
      "video_id": "3_VUjiChU4o",
      "title": "0DTE Options Trading Performance",
      "url": "https://www.youtube.com/watch?v=3_VUjiChU4o",
      "upload_date": "",
      "duration": 548.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:11:55",
      "start_timestamp_seconds": 715.3777777777779,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3_VUjiChU4o&t=715"
    }
  }
]