[
  {
    "text": "What's up you guys this one's all about GME because it's kind of quiet out there So should be a relatively quick video just keep in the cadence up taking a look at what's happening on a daily basis here So what did we see today? Well ended at 25 50 1.11 percent on the day and We are in this consolidation Section in here you could tell it is about As narrow as you can get were range bound between 25 70 and to the downside on the closes opens 24 75 so like a buck We are just below the point of control and All this means to me is that a lot of people are still willing to transact here. There's a lot of Both buying and selling when we look at the overall average volume though. It's pretty quiet It's below the one month average vault today has been the quietest. It's been Since it looks like looks like pre squeeze This might be close. What was the volume here 9.5 To 7.7. Yeah, so this is the quietest bend essentially since we saw this Pop way back here and the beginning or in the middle of May I should say So Quiet day out there moving averages are all starting to look flat and Yeah, I mean for me the way I'm looking at it right now I have no options out on the position and that's just because it's not really moving a whole",
    "metadata": {
      "video_id": "3J1_0s0qHPU",
      "title": "GME Options Update - Slow Day",
      "url": "https://www.youtube.com/watch?v=3J1_0s0qHPU",
      "upload_date": "",
      "duration": 445.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3J1_0s0qHPU&t=0"
    }
  },
  {
    "text": "of May I should say So Quiet day out there moving averages are all starting to look flat and Yeah, I mean for me the way I'm looking at it right now I have no options out on the position and that's just because it's not really moving a whole lot But I do have shares on the position. I actually just added some more shares The primary reason for that is just complementing a little bit of the broader portfolio and specifically with this position I do have some short options out against it 90 days out It's for a couple different reasons, but it's mostly to provide a bit of a short-term tailwind In case we do get a pullback So this is not so much is some sort of theta to K play It's definitely much more of a downside hedge if needed and it guarantees a decent profit with where we're at right now But those will be managed more likely than not on either a pullback or they'll be moved out as we get closer in time So typically when I'm selling options, especially like short calls against long Delta's whether it's long calls or long shares. I like to be a little bit closer in time But I'm actually planning on playing both of these expiration cycles when I start to see Just a little bit more movement. So that's why I'm moving these further out. It fits the broader picture Just a little",
    "metadata": {
      "video_id": "3J1_0s0qHPU",
      "title": "GME Options Update - Slow Day",
      "url": "https://www.youtube.com/watch?v=3J1_0s0qHPU",
      "upload_date": "",
      "duration": 445.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3J1_0s0qHPU&t=0"
    }
  },
  {
    "text": "long shares. I like to be a little bit closer in time But I'm actually planning on playing both of these expiration cycles when I start to see Just a little bit more movement. So that's why I'm moving these further out. It fits the broader picture Just a little bit better now overall volume today was very light we had 118,000 calls trade Looks like my strangle expired out of the money. That's great news And we had the put side at 26,800 so very very quiet across the board Now when I look at the existing open interest this is still narrower than it's been historically calls 691,000 against through 1804,000 puts so not a ton That I'm seeing there volatility is so below this is we haven't seen this front expiration below 104 a hot Minute and it's not above 100 until we get to the 16 aug expiration So again, I already talked about this the last couple days that it just seems like we're coming into a bit of a quiet period At least based on what I can see from the options markets and this continues To seemingly confirm that the other thing is take a look at the number of calls being sold here 34 of the volume today was sold calls. I was part of that But for people like me, we're just looking at a way to take in a little bit of premium The downside is it's not even really",
    "metadata": {
      "video_id": "3J1_0s0qHPU",
      "title": "GME Options Update - Slow Day",
      "url": "https://www.youtube.com/watch?v=3J1_0s0qHPU",
      "upload_date": "",
      "duration": 445.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3J1_0s0qHPU&t=0"
    }
  },
  {
    "text": "take a look at the number of calls being sold here 34 of the volume today was sold calls. I was part of that But for people like me, we're just looking at a way to take in a little bit of premium The downside is it's not even really that sweet to the upside when I say that sweet in this context. It's just kind of A cheeky way of saying expensive call Options Like these you you guys have seen me look at these enough by now look at how crazy these are This front expiration is all over the map and I find that very interesting We haven't seen this low of a ratio of call side to put side In a really long time and then out here in the 16 aug you can see the 120s are really being bit up pretty heavy But pretty much everything from like the 95s to the one 15s. They're really really suppressed So another opportunity down in here You can There you go Just in case you wanted to see a lot of people who they get upset when they can't see the whole thing I'm looking at what I get so let I get my fat head out of your way But yeah The the vault curve here is interesting but Mostly what I'm seeing across the board in this is stuff just quieting down That's overall what it looks like when I take a look at",
    "metadata": {
      "video_id": "3J1_0s0qHPU",
      "title": "GME Options Update - Slow Day",
      "url": "https://www.youtube.com/watch?v=3J1_0s0qHPU",
      "upload_date": "",
      "duration": 445.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3J1_0s0qHPU&t=0"
    }
  },
  {
    "text": "what I get so let I get my fat head out of your way But yeah The the vault curve here is interesting but Mostly what I'm seeing across the board in this is stuff just quieting down That's overall what it looks like when I take a look at trades in this case I'm filtering by stuff that at least has 50 contracts. I don't care if it's call or puts But you can see the overall sizes trading are small And the relative value of a lot of these is also very small right so we have 485 but these are 47 cents We had 372 of these 25 and a half calls that were bought but there is 61 cents So like these aren't a lot of like really high conviction style trades There's a lot of premium selling going on that I can see and then when we take a quick look here at our Options flow from unusual wills. Just kind of aggregates this a little more cleanly for you guys Looking at the call side on purchased calls everything is below 100,000. This is again one of the most quiet days that I've seen since If I look on the sales side again very very quiet All across the board Now if we add quickly the put side in drop these calls out Super quiet all below 100,000 and then on the purchase side also all below 100,000 So what I'm highlighting is We",
    "metadata": {
      "video_id": "3J1_0s0qHPU",
      "title": "GME Options Update - Slow Day",
      "url": "https://www.youtube.com/watch?v=3J1_0s0qHPU",
      "upload_date": "",
      "duration": 445.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3J1_0s0qHPU&t=0"
    }
  },
  {
    "text": "since If I look on the sales side again very very quiet All across the board Now if we add quickly the put side in drop these calls out Super quiet all below 100,000 and then on the purchase side also all below 100,000 So what I'm highlighting is We are coming into a bit of a quiet period. It would seem And with something like GameStop you never know if it's actually quiet or if it's temporary quiet about to get real loud We do not know and I do think now's an interesting time to start looking at the positions that you have Make sure that you have the exposure you want because a lot of times you can see something in here And you're like man it looks kind of boring and sometimes that's a good time To reconfigure your exposure because if you start trying to get long when things are up here It's much more difficult and your risk is much higher whereas if you're Adjusting when we're down just hovering in these really consolidated levels It's a little bit of a different story I set a bunch of different stops for me to phase out of my positions That's essentially what all these different alerts are To get me out when I don't want to hold when things aren't moving my direction So take a look at what you got And as always if you have any questions or anything you want me to",
    "metadata": {
      "video_id": "3J1_0s0qHPU",
      "title": "GME Options Update - Slow Day",
      "url": "https://www.youtube.com/watch?v=3J1_0s0qHPU",
      "upload_date": "",
      "duration": 445.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3J1_0s0qHPU&t=0"
    }
  },
  {
    "text": "out of my positions That's essentially what all these different alerts are To get me out when I don't want to hold when things aren't moving my direction So take a look at what you got And as always if you have any questions or anything you want me to take a look at let me know I am here for it being outlier. See you guys later",
    "metadata": {
      "video_id": "3J1_0s0qHPU",
      "title": "GME Options Update - Slow Day",
      "url": "https://www.youtube.com/watch?v=3J1_0s0qHPU",
      "upload_date": "",
      "duration": 445.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3J1_0s0qHPU&t=0"
    }
  }
]