[
  {
    "text": "You ask, I answer back with another question from the homie Zach. And he says, when choosing a far out of the money strike makes sense, it's a great question. The way to think about far out of the money strikes is that they typically are cheap. So if we think of an option's chain, let's call this at the money. This is in the money. This is specifically for the call side by the way. And then this is out of the money. Well, these out of the money calls have a couple really interesting traits, depending on the expiration. But one of the things we know is relative. They're going to be cheap. We also know that if they're nearer term in time, these will still gain gamma quickly. They might not have gamma in the beginning fast, but they'll gain gamma quickly. So the cliff notes version of this is typically when trying to choose some sort of far out of the money strike is if you're expecting a really big move. And you want to buy a bunch of units because these are cheap. So let's say that this option is typically a dollar for the at the money. And these are typically 10 cents. Well, you can get 10 of these for every one of these. You could buy more units here. The last thing to pay attention to is that these also have less extrinsic value. So for extrinsic value, these are lower. These",
    "metadata": {
      "video_id": "3MTc2MylrDQ",
      "title": "buying otm options",
      "url": "https://www.youtube.com/watch?v=3MTc2MylrDQ",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 2,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3MTc2MylrDQ&t=0"
    }
  },
  {
    "text": "at the money. And these are typically 10 cents. Well, you can get 10 of these for every one of these. You could buy more units here. The last thing to pay attention to is that these also have less extrinsic value. So for extrinsic value, these are lower. These are higher. And then these are lower. So that also means that your theta decay is lower. What's the downside here? You need a bigger move in order to turn on the gamma to start making money. Because for each dollar move, your delta isn't giving you that much because they're super far out of the money. So you need a big move. Great question back. Any other's let me know. Be an outlier. See you later.",
    "metadata": {
      "video_id": "3MTc2MylrDQ",
      "title": "buying otm options",
      "url": "https://www.youtube.com/watch?v=3MTc2MylrDQ",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 2,
      "start_timestamp": "00:00:56",
      "start_timestamp_seconds": 56.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3MTc2MylrDQ&t=56"
    }
  }
]