[
  {
    "text": "What's up, outliers? Let's talk about building a trade log. If you've heard me on YouTube at all I've talked about this because it is one of the most important things you can possibly do as a trader. So I'm going to walk you through a process of what this whole thing is, how it looks, and why you should consider it. And then I'm going to walk you through an actual example in Google Sheets right now. So you can see exactly how to go about building your own. Now a couple things. The first thing is one of the absolute best outputs of building a trade log is the process of building it. It's the same thing for building a trading plan. The process of building the log is really useful because it brings you closer to your strategies, closer to the information, and it makes you think analytically and forecast the kinds of things that you might want to track. The other thing about building a trade log is you don't need to have the final solution to start. My trade log continues to evolve. I just wrapped up my 18th year of trading. I went through a phase where it was handwritten. Then I realized handwritten kind of sucks because you can't conduct data analysis on it. So then it went into manual input, but that kind of sucked because it was taking me a long time to input all the things that I was trying",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 23,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=0"
    }
  },
  {
    "text": "a phase where it was handwritten. Then I realized handwritten kind of sucks because you can't conduct data analysis on it. So then it went into manual input, but that kind of sucked because it was taking me a long time to input all the things that I was trying to input. Then I went to full automation. I was using different kinds of integrations to pull all the information into a single spot with literally not having to input anything. That kind of sucked because it started moving me further away from the individual trades I was placing. Now we've gone essentially full circle, not full circle, partial circle. I'm back to generally using manual inputs, but rather than the second step where I was trying to track everything, I've become really specific with what I track. We're going to talk about that entire process. The first thing, why a trade log? Why is it that so many traders trade without a trade log? Well, the reason why they don't genuinely is because they're lazy. The reason why they're lazy is a lot of us start trading thinking that this is going to be fast easy money. Then as soon as you put something in front of somebody building a trade log where you have to track things, that sounds like work. That sounds like the antithesis of the expectations of when we started this thing. The sooner you can get over that, the better off you're going to",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 23,
      "start_timestamp": "00:00:58",
      "start_timestamp_seconds": 58.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=58"
    }
  },
  {
    "text": "soon as you put something in front of somebody building a trade log where you have to track things, that sounds like work. That sounds like the antithesis of the expectations of when we started this thing. The sooner you can get over that, the better off you're going to be. So the trade log is designed to complement the trade plan, which I have a video that talks about both of those in detail. I'll throw that in the description below. But the trade plan is where we outline our ideas as we think we're going to do something. We include our research, how stuff is worked based on back testing, that kind of stuff. Then the trade log is where we actually see the results. We track the results. Now, one of the cool things about a trade log is I use the same trade log for tracking things that are both live trades, but then paper trades variations. Yes, what that does. It gives you a massive amount of information to make decisions off of because the second and third bullet points in this section over here, you have a unbelievable amount of cognitive biases in the way that you perceive information, reactive information, digest and analyze things. Some of them will be conscious. You will be aware of it. Some of it you won't. So the way we use a log is to short circuit those to make sure that we're not applying Goldilocks analysis and",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 23,
      "start_timestamp": "00:02:08",
      "start_timestamp_seconds": 128.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=128"
    }
  },
  {
    "text": "way that you perceive information, reactive information, digest and analyze things. Some of them will be conscious. You will be aware of it. Some of it you won't. So the way we use a log is to short circuit those to make sure that we're not applying Goldilocks analysis and saying, oh, yeah, I thought I made some money on that trade. Then when you go back and look, including fees, it was a loss. Or if you're an options trader and you're rolling options for six months and you're like, man, I'm so glad I got out of this thing out of profit. But then you realize once you calculate the total returns over that six month time frame, you're like, well, crap, I have essentially nothing to show for it. Sure, I got out of those series of roles for a small profit. But then if I look at the overall return on that money for that time frame, it's not good. So coming to reality with stuff like that is very important. Now, the last point here is designed to frame a thought for you. Building a trade log can be overwhelming. But if you're planning to trade for a long duration of time, a trade log is essentially bookkeeping. This is what businesses do. This is how businesses make decisions and survive in last. The sooner that we accept that there's work to be done as a trader. And if we embrace this work and get",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 23,
      "start_timestamp": "00:03:15",
      "start_timestamp_seconds": 195.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=195"
    }
  },
  {
    "text": "trade for a long duration of time, a trade log is essentially bookkeeping. This is what businesses do. This is how businesses make decisions and survive in last. The sooner that we accept that there's work to be done as a trader. And if we embrace this work and get over it and get on board with it, the faster you're going to see results. So the how, what kind of things belong in a trade log? The way that my mind buckets it is there are things that we need to track for every individual kind of log we might build. Then there are elements that are going to be highly specific to the individual strategies that we're building. So let me show you what this looks like. What I do is use different tabs for different strategies. So strategy one gets its own tab strategy two gets its own tabs G3 gets its own tab paper trading strategy one gets its own tabs own and so forth. And then I summarize all of these individual sheets within the tab itself. And then also I pull out the requisite details into a C2C tab C2C in the military stands for command and control. But I want to show you take a look at our sample log that I'm going to be showing you. So we have a coverage strangle tab here. If you're following the coverage strangle videos that I've been doing, you will have seen a lot of",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 23,
      "start_timestamp": "00:04:17",
      "start_timestamp_seconds": 257.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=257"
    }
  },
  {
    "text": "for command and control. But I want to show you take a look at our sample log that I'm going to be showing you. So we have a coverage strangle tab here. If you're following the coverage strangle videos that I've been doing, you will have seen a lot of these. Then I have things for single options. Then I have another tab for box spreads. But the C2C tab is going to collate all of them into one visual spot for me think of it like a dashboard. So what you'll notice is that these different strategies will have things in common, but then these different strategies will have unique elements that matter for the strategy itself. So the way that I think about building this is the C2C tab gets built as you go along because you'll get a sense of the things that you might want to include. Then where the individual strategy tabs before you start building anything, trying to figure out the layouts, we want to keep a few things in mind. The first thing is we want to make sure that we can conduct actual data analysis to see what's going on to track trends. So we want to keep that in mind in terms of how we set things up. What doesn't work well for data analysis is if you have an individual cell like this and you do something like today, I sold five puts for two dollars in GameStop and made",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 23,
      "start_timestamp": "00:05:26",
      "start_timestamp_seconds": 326.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=326"
    }
  },
  {
    "text": "trends. So we want to keep that in mind in terms of how we set things up. What doesn't work well for data analysis is if you have an individual cell like this and you do something like today, I sold five puts for two dollars in GameStop and made one dollar, right? Like you can't do anything with this. This is effectively useless. So we want to think about the data points that matter to us based on the strategy and then create a format to pull them out. The other thing is you want to make sure that you keep it consumable. In the beginning, you will probably overtrack things and that's okay. The reason why it's okay is overtracking in the beginning is part of the process of clearly identifying the things that actually matter for what you're doing. Then once you get a sense of that, you start to dial in what things actually matter for the individual strategies, which you'll get a sense of. So I think or the outlier approach to trading, which we leverage things like the outlier strategy process and the outlier trade process, I will throw links to both of those videos that's available for everybody. They're just frameworks to think about trading. I'll throw links to those in the description. But based on those, you will be familiar with these things, things like profit mechanisms, profit mechanism qualities, profit mechanism signals. Based on the individual strategies and its requisite details",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 23,
      "start_timestamp": "00:06:30",
      "start_timestamp_seconds": 390.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=390"
    }
  },
  {
    "text": "videos that's available for everybody. They're just frameworks to think about trading. I'll throw links to those in the description. But based on those, you will be familiar with these things, things like profit mechanisms, profit mechanism qualities, profit mechanism signals. Based on the individual strategies and its requisite details pertaining to these topics, I can think of different different metrics that will be relevant to the individual thing that I'm trying to try. So the last thing is try and be efficient. So when I'm setting up the sheets, as you'll see in a minute, I try to make it so that it's a light lift easy to move, easy to replicate, easy to adjust. If you make it to be really, really annoying, then it'll be a bear to deal with and you probably won't want to. So let's take a first look at the covered stringle strategy. This is the summary tab for an individual strategy. In this case, the covered strangle. And again, you all will have seen a bunch of different versions of this. For those that are unfamiliar, I'm doing a subset of my broader portfolio and I'm trading the covered strangle in these four different names, TQs, Upro, Ibit, GameStop. And I'm essentially using this as an example to just show a bunch of things about trading in my approach. So what you'll notice is on the top, I have overall aggregate level details. I want to see how much premium is open",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 23,
      "start_timestamp": "00:07:54",
      "start_timestamp_seconds": 474.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=474"
    }
  },
  {
    "text": "four different names, TQs, Upro, Ibit, GameStop. And I'm essentially using this as an example to just show a bunch of things about trading in my approach. So what you'll notice is on the top, I have overall aggregate level details. I want to see how much premium is open at a given point in time. I want to know what the total PNL is. I want to know how many trades are open. I want to know our distance off of 52 week highs. Why do I care about the distance off of 52 week highs? Because in my trade plan for these strategies that informs some of my sizing decisions, I have a column here for notional value. The reason why I have notional value is because TQs and Upro are leveraged. So what that means is if I have a total dollar utilization and T triple Qs of 44,000, 665,000, that's not really the risk that that represents. It represents broader risk because it's three times leveraged. Do I track that here? Then we have overall dollar utilization. So how much money is tied up in the trade right now? So that includes both cash secured puts and long shares. And you can see that I break that out here so that I can say, okay, right now I'm only actually a little bit in equity outright for T triple Qs and I'm mostly in cash secured puts. Does that reflect what I want to have right",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 23,
      "start_timestamp": "00:09:06",
      "start_timestamp_seconds": 546.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=546"
    }
  },
  {
    "text": "and long shares. And you can see that I break that out here so that I can say, okay, right now I'm only actually a little bit in equity outright for T triple Qs and I'm mostly in cash secured puts. Does that reflect what I want to have right now? Then I start with, I don't know why I naturally went right to left. I think that shows how backwards my brain is. But the starting point here is the allocation. So what I do is I say of the portfolio, how much money do each of these individual trades get for this strategy? So for TQs, it got 100,000, you pro 200,000, I bit 125, game stop 25 so far. And again, these are subsets of the broader portfolio, but this is the same process I follow across the broader portfolio. So now let's take a look at one of these. And I'm actually in my actual log, these are all linked, right? So it takes me right to it. The links break when I copy and paste it. It's kind of annoying. But that's what these are. So if we take a look at T triple Qs, you can see that this is the total log here. And based on this total log, I have about all of the details I use to make decisions. I summarize things on the left hand side for the total position. And then I track all of the individual stuff here",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 23,
      "start_timestamp": "00:10:13",
      "start_timestamp_seconds": 613.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=613"
    }
  },
  {
    "text": "you can see that this is the total log here. And based on this total log, I have about all of the details I use to make decisions. I summarize things on the left hand side for the total position. And then I track all of the individual stuff here in the center. I split short puts, short calls that are open. And then I have sections to track the closed versions of those trades. Then you might ask, well, why don't I just put the closed up here below this section? Well, it's because I tend to trade more puts than calls. So then this would push the call section down too far over times. So I have to scroll a lot. Again, even though I prefer manual inputs, I have to be thoughtful about what I'm doing and how I input things so that it's sustainable. So then the other thing you'll notice is that there are some sections that are coded in green. That represents elements that require my physical input. Then there are these sections over here, which are automatically going to calculate based on these inputs over here. So my goal is to make it really, really easy for me to see where I need to input information and what information needs to go there. So if we take a look, you can see for the covered strangle, I'm tracking things like entredate, stock, expiry, strike, delta premium, lots. Now notice how I'm not tracking",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 23,
      "start_timestamp": "00:11:22",
      "start_timestamp_seconds": 682.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=682"
    }
  },
  {
    "text": "really, really easy for me to see where I need to input information and what information needs to go there. So if we take a look, you can see for the covered strangle, I'm tracking things like entredate, stock, expiry, strike, delta premium, lots. Now notice how I'm not tracking something like data and I'm not tracking something like Vega. And the reason is because although I care about those metrics and they're actually part of my trading plan from a tracking perspective, those don't really impact the breadth of what I'm doing. Even something like volatility, which is in my trading plan in terms of how I think about selling, but it's a secondary input in terms of how I think about selling. My primary input for what I think about selling is what is the total amount of money this position gets? How much am I using right now? How much is in stock? How much is in cash secured puts? Does that align with what I want it to be today? And if it does great, if I take a look at my utilization and my utilization is low, I don't really care what volatility is too much because I need to get the utilization to be what it should be based on what my disposition is. And then the difference between buying stock out right or cash secured puts, again, is an artifact of my disposition, not so much what volatility is. There can be periods",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 23,
      "start_timestamp": "00:12:35",
      "start_timestamp_seconds": 755.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=755"
    }
  },
  {
    "text": "much because I need to get the utilization to be what it should be based on what my disposition is. And then the difference between buying stock out right or cash secured puts, again, is an artifact of my disposition, not so much what volatility is. There can be periods where volatility is low and I'll sell more sometimes because that's more advantageous. Sometimes if volatility is high, I might sell more than it's based more on the utilization than trying to capitalize on volatility. That is for this specific strategy, the coverage triangle, which I'll throw a playlist for it in the notes below. But this is really an entire strategy based around optimizing an underlying buy and hold equity position. So the options are ancillary here. These are secondary. The primary position are going to be the long equity component. So this is the log as it sits. Now, another thing you'll notice in the coverage triangle log is I've built is I actually keep a little rolling option calculator off to the side here to help me analyze something like it's going on right here. So we can see that this trade was actually adjusted. So this trade started at a two lot. The opening premium that I gave it was 256. The closing premium when I took the trade down was 825. So then I opened up a new trade, another two lot. These should be the same format as this. The opening premium for these",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 23,
      "start_timestamp": "00:13:43",
      "start_timestamp_seconds": 823.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=823"
    }
  },
  {
    "text": "trade started at a two lot. The opening premium that I gave it was 256. The closing premium when I took the trade down was 825. So then I opened up a new trade, another two lot. These should be the same format as this. The opening premium for these were 8.5. So now this tells me exactly what I need this new option to be trading at in order to hit break even. So what that means is this option right here, which is at an 850 premium. Once it hits 2.81, that tells me that I will be at a break even. So then if I close this trade for 2.81, it will net outwash this prior trade. So I use that when I'm making adjustments. Everything in here is designed for a purpose. So this is the covered strangle tab. And you'll notice that there's multiple covered strangles in here. It's the same thing, just several times. And then I aggregate it up at the top. Now we can take a look at single trades. Single trades is something that shorter term in nature. And this can be simple stuff like trading something directionally. That's mostly what I find in here. For things like trading volatility and whatnot, I have separate tabs for those. Now the way that this one's built is also very purposeful. You'll notice that I have all these different strategies up top. And then it aggregates all of the total data based on",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 23,
      "start_timestamp": "00:14:52",
      "start_timestamp_seconds": 892.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=892"
    }
  },
  {
    "text": "I find in here. For things like trading volatility and whatnot, I have separate tabs for those. Now the way that this one's built is also very purposeful. You'll notice that I have all these different strategies up top. And then it aggregates all of the total data based on the strategies. This is the section for open trades. Then this is the section that collates all the closed trades. So now the way this works is let's say today's 16 Jan, I have stock XYZ. It's at 10 bucks. It's a five lot. I'm going to look at the 21 Feb expiration. It's a 15 strike. I want to buy calls. Well, what I do is I find a call. I find a 55 delta call. The total premium to get into that call is 2.50. Now one of the things you'll notice right out of the gate is it does a bunch of math for me off to the side. And it actually helps me codify what the strategy is right out of the gate. This is just with a formula. So then what I do is I say, okay, what's the margin requirement for this trade? A lot of times I'll just use the total cost right because when you're buying options, that's typically what it'll be. And then for short options, I'll use whatever the broker tells me the margin requirement is then I'll input whatever my risk is the risk is defined at entry. This",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 23,
      "start_timestamp": "00:16:10",
      "start_timestamp_seconds": 970.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=970"
    }
  },
  {
    "text": "lot of times I'll just use the total cost right because when you're buying options, that's typically what it'll be. And then for short options, I'll use whatever the broker tells me the margin requirement is then I'll input whatever my risk is the risk is defined at entry. This is where I say when am I going to get out of this trade based on the chart. So if I'm trading a long call, it's based on a breakout wherever I decide based on my analysis where if it breaks down below that level, I would get out. That's what gets input here. So let's say at that point, I lose 500 bucks. That's my total risk. So now this is the open trade as it sits. And you can see that there's a gray section here. This is what I input when I'm actually exiting the trade. So let's say it's the 16th of Jan. The stock goes up to 12 and then let's say that I closed this for 2.75. Great. So now I have a sense of what the actual move was. But when I look at this, well, I see 2625. That's way too high. So what happened here? Really simple. We have to pay attention to the signage that we use in whatever we codify into our plan. So for me, if it's a debit, I use negative numbers, meaning money has gone out. Now, all of a sudden, the PNL is accurate. It",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 23,
      "start_timestamp": "00:17:13",
      "start_timestamp_seconds": 1033.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=1033"
    }
  },
  {
    "text": "So what happened here? Really simple. We have to pay attention to the signage that we use in whatever we codify into our plan. So for me, if it's a debit, I use negative numbers, meaning money has gone out. Now, all of a sudden, the PNL is accurate. It makes sense. So we just take this. This trade is closed. We copy it, paste it down here. And then you'll notice that it'll start to aggregate all these different trades. And you can make this as customizable as you want. Let's say that I'm trading a ratio called Agno where I have a long option leg and then a short option leg easy. I literally just copy and paste this down, whatever it is. And instead of doing a five lot since we normally do a ratio, maybe it's a two lot. And normally we sell these closer in time. So maybe we do this for 17 Jan instead. And the strike price will typically be a little bit different than the long call will be a little further out of the money. So maybe this is like 25. And let's say that the short call is like a 30 delta. Well, I want to know though that this is part of a ratio called diagonal, not a long call and a short call. So all I do is drop a dash in there, drop a dash in here. The dash tells me that there's another component to this",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 23,
      "start_timestamp": "00:18:17",
      "start_timestamp_seconds": 1097.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=1097"
    }
  },
  {
    "text": "30 delta. Well, I want to know though that this is part of a ratio called diagonal, not a long call and a short call. So all I do is drop a dash in there, drop a dash in here. The dash tells me that there's another component to this trade, another leg, but this is the base leg. So this is the base leg for this line item, which is the long call. This is the base leg for this line item, which is the short call. And you can see that it automatically changes the strategy to be what I want ratio called diagonal. So this is the process for singles. And then I have another one for box spreads. There is a video that I have that talks about this. This sheet itself is available to those in the Patreon. You can go download it from the shop for free. And yeah, so this is like a really easy tool to help me track box spreads. Let's take a look at C2C. C2C, I have a couple different sections. Now this is a really broken down version of what I have just because mine is very noisy. But I'm giving you some ideas on tools that you might want to include in yours. This section represents portfolio level tracking metrics. So these are things like what's the beginning value of the portfolio, how much money have I made, how much is my current theta, a comparison against",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 23,
      "start_timestamp": "00:19:16",
      "start_timestamp_seconds": 1156.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=1156"
    }
  },
  {
    "text": "But I'm giving you some ideas on tools that you might want to include in yours. This section represents portfolio level tracking metrics. So these are things like what's the beginning value of the portfolio, how much money have I made, how much is my current theta, a comparison against a reference return of some sort is designed to be a drop down in my main one where it'll say based on whatever this percentage is, it'll do the math here based on the portfolio value. And it'll just tell me what the overall sizing would be. I can also just input it manually. I can say, well, I want to put on a 5,000 trade. And this will tell me how much that is of the total portfolio. So just little tools like that to help the day to day stuff be a little bit easier. Then I have a total section that collates everything from the sub-sections down here. So this section is going to use all of these different details to summarize. So right now I can see of my 600,000 portfolio right now, I'm using 748,000 in terms of allocation. In terms of actual utilization, I'm only using 532. The difference between allocation is how much money I'm setting aside to do something. Utilization is how much I'm using at a given point in time. Then I purposely have a section that takes out box spreads. The reason why I want to take out box spreads",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 23,
      "start_timestamp": "00:20:11",
      "start_timestamp_seconds": 1211.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=1211"
    }
  },
  {
    "text": "only using 532. The difference between allocation is how much money I'm setting aside to do something. Utilization is how much I'm using at a given point in time. Then I purposely have a section that takes out box spreads. The reason why I want to take out box spreads is because a lot of times box spreads are tied to other trades, but it's a place that I park cash to be more efficient. Then we have noional exposure. The reason why you have noional exposures because if I'm trading leveraged underlines, I want to know what my actual risk is. So a good example of that is here in the coverage triangle because as I showed you, we're trading Upro and TQs. So when I'm figuring out what my total exposure is, I don't want to just use my actual dollar utilization because even though this is the max I could technically risk at a given point in time, the notional exposure will help me understand how leveraged I am and give me some sense of the total risk there. Again, this is an aggregate level tab. Then I have just some standard market tracking stuff. How far we are off of highs and off of local highs for different indices, a watch list and stuff to do and then just some basic calculators over here. Then this is where I would continue building out other sections. This would actually be input in here. So I took it",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 23,
      "start_timestamp": "00:21:16",
      "start_timestamp_seconds": 1276.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=1276"
    }
  },
  {
    "text": "we are off of highs and off of local highs for different indices, a watch list and stuff to do and then just some basic calculators over here. Then this is where I would continue building out other sections. This would actually be input in here. So I took it out to make it look a little easier to see, but the way that this would actually look is this would go down here. Then all of this would slide up into this. And then all of this would be filled in and I would apply the same lines and all that stuff to make it easy for me to see. And each of these would go to the individual tabs to pull together the futures tab, everything that's going on in the futures trading space, the ratio diagonals and so on and so forth. This is literally a step-by-step process on how you build a log. You start by the individual tabs. You track the things that you need, but you make it so that you can conduct broader analysis. What I typically do is you'll notice that I set space off to the side here so that I can write different formulas to test different ideas. I don't bother with graphs and stuff like that. I know people like those kind of visuals. I think they're fine, but I don't need it. It's just stuff that gets in the way I can just see the numbers. But if",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 23,
      "start_timestamp": "00:22:20",
      "start_timestamp_seconds": 1340.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=1340"
    }
  },
  {
    "text": "can write different formulas to test different ideas. I don't bother with graphs and stuff like that. I know people like those kind of visuals. I think they're fine, but I don't need it. It's just stuff that gets in the way I can just see the numbers. But if you like graphs and stuff, you can build all of those off to the side or appear if you're so inclined. But the idea is to outline what you need. Then figure out a format that allows you to input the details that you need efficiently. And you start a little bit by overtracking, but then you back off of overtracking. The reason why you back off is so that you'll actually adhere to the process. If you have too much in here, you simply won't do it. That's not a good approach. Then the other thing to note is you can input comments in here. If you're filling in something, you're like, oh crap, I forgot what this acronym means or what I meant when I said percent capture, which for me, it's just how much of the actual premium did I capture, stuff like that. So if you have any questions, let me know. Go out there and build a log. It'll help you a lot. I literally, literally promise you that building this will at least give you more information to make better decisions as a trader. You know, I'll see you later.",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 23,
      "start_timestamp": "00:23:26",
      "start_timestamp_seconds": 1406.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=1406"
    }
  },
  {
    "text": "have any questions, let me know. Go out there and build a log. It'll help you a lot. I literally, literally promise you that building this will at least give you more information to make better decisions as a trader. You know, I'll see you later.",
    "metadata": {
      "video_id": "3STDqRx1o8w",
      "title": "Track Your Trades Like a Pro – Build the Perfect Options Trade Log",
      "url": "https://www.youtube.com/watch?v=3STDqRx1o8w",
      "upload_date": "",
      "duration": 1490.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 23,
      "start_timestamp": "00:24:28",
      "start_timestamp_seconds": 1468.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3STDqRx1o8w&t=1468"
    }
  }
]