[
  {
    "text": "Everyone Eric here up next is a pretty fun topic, which is trading in your IRAs So let's jump over to the main screen and dig in so first off The very first thing I have on here is if you are Interested in setting up a Roth IRA Do yourself a favor and make sure you do it as soon as possible and max it out as Frequently as possible and here's the reason why I'm gonna pull up a quick overview that reviews Roth IRAs versus traditional So if you take a look traditional is on this side Roth is on this side same thing traditional is here and then Roth is over here and that's what the mouse so don't make fun of the handwriting anymore than we already need to most of it is gonna look pretty similar, but there is a very significant difference in income eligibility and that is right here So the reason why it's important to start in your Roth is soon as possible is once you hit 124k if you File single or 196 if you file jointly Once you hit those thresholds and you move over you cannot Contribute to the account anymore. So what happens is you can get stuck with a certain amount of money in that account and You're gonna essentially completely rely on your ability to develop the account or the accumulation of wealth in there so Big recommendation if you are gonna trade Roth IRAs",
    "metadata": {
      "video_id": "3sYsqAWBo80",
      "title": "Trading in IRAs",
      "url": "https://www.youtube.com/watch?v=3sYsqAWBo80",
      "upload_date": "",
      "duration": 353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 5,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3sYsqAWBo80&t=0"
    }
  },
  {
    "text": "the account anymore. So what happens is you can get stuck with a certain amount of money in that account and You're gonna essentially completely rely on your ability to develop the account or the accumulation of wealth in there so Big recommendation if you are gonna trade Roth IRAs start as soon as possible give yourself as much time to continue max it out Before you hopefully hit these thresholds. It's like I said once you hit there like I can't add any more to the account So it's stuck I can only trade what's in there and it is what it is now the good part is you can always have a traditional IRA which is nice So once you finish your time in your Roth or you can even have them both simultaneously You know you can still do the traditional now something to keep in mind is you're you're still gonna be limited on The amount you can apply to Roth. I mean sorry not Roth that you can apply to IRA accounts So keep that in mind don't start maxing out both because you're gonna find yourself in a bad spot You can you get up to that amount for IRAs in general not whether it's Roth or traditional So moving on to a couple I don't know I guess just quick overview of what I like to do a couple things first one is I Typically trade cash secured positions in there But there",
    "metadata": {
      "video_id": "3sYsqAWBo80",
      "title": "Trading in IRAs",
      "url": "https://www.youtube.com/watch?v=3sYsqAWBo80",
      "upload_date": "",
      "duration": 353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 5,
      "start_timestamp": "00:01:24",
      "start_timestamp_seconds": 84.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3sYsqAWBo80&t=84"
    }
  },
  {
    "text": "up to that amount for IRAs in general not whether it's Roth or traditional So moving on to a couple I don't know I guess just quick overview of what I like to do a couple things first one is I Typically trade cash secured positions in there But there is a loophole which is interesting enough that it exists because it's for futures Which you know the idea of forcing people to not be able to trade on margin in a Roth account is Obviously for the security of the account to make sure that it's less volatile things like that kind of protect you again yourself Forces people until less volatile trading styles, but you can trade futures I can trade options on futures. I can sell naked calls on futures. Just can't do it with options No idea why it exists, but it is helpful to know that it is there in case you want to speculate in your IRA You most certainly can you just use futures Now something else to keep in mind is If slash when you do trade futures in your IRA it requires a 125 of standard margin so they're gonna Essentially force you to have more money that you would have to set aside for those trades than you would see And you know your standard margin account before you're margin so on so forth. So just keep that mind My general focus is coverage triangles. That's 99 of the trades",
    "metadata": {
      "video_id": "3sYsqAWBo80",
      "title": "Trading in IRAs",
      "url": "https://www.youtube.com/watch?v=3sYsqAWBo80",
      "upload_date": "",
      "duration": 353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 5,
      "start_timestamp": "00:02:30",
      "start_timestamp_seconds": 150.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3sYsqAWBo80&t=150"
    }
  },
  {
    "text": "force you to have more money that you would have to set aside for those trades than you would see And you know your standard margin account before you're margin so on so forth. So just keep that mind My general focus is coverage triangles. That's 99 of the trades that I'm gonna put on in my IRAs and With that I just looked at the accounts and I have averaged from 2007 19 15.2 percent so it's not as high as my general margin account by a fair margin sorry for the pun But that part aside it's still slightly above the market and You know it just shows that using options kind of in a very conservative manner We can still enhance our returns modestly over the market but again kind of fall fall within the rules of The IRA structure so that's pretty much all I have for this I don't really believe in actively trading the IRA This is where I put a lot of my slower trading things and I focus on my margin accounts for more actively trading and Like I said just keep in mind the amount that you can contribute to all IRAs is 6,000 a year as of right now so If you're interested in a Roth I would focus on that get that thing going and continue to max that out until you hit that threshold Then when you can't add to that anymore then you can rotate over to",
    "metadata": {
      "video_id": "3sYsqAWBo80",
      "title": "Trading in IRAs",
      "url": "https://www.youtube.com/watch?v=3sYsqAWBo80",
      "upload_date": "",
      "duration": 353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 5,
      "start_timestamp": "00:03:49",
      "start_timestamp_seconds": 229.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3sYsqAWBo80&t=229"
    }
  },
  {
    "text": "IRAs is 6,000 a year as of right now so If you're interested in a Roth I would focus on that get that thing going and continue to max that out until you hit that threshold Then when you can't add to that anymore then you can rotate over to a traditional if you feel like it Just keep that mind if you do use Roth once you hit that threshold you're stuck and then the other Thing to keep in mind like I said is the futures trading if you do want to speculate you can use futures But other than that it's going to behave a lot like a regular account It's just going to force you to be cash secured. So you're not going to be able to trade on margin for options So that is essentially my approach. I keep it really simple in there nothing crazy If anybody's any questions or anything that they like to add on what they like to do in their IRAs feel free to chime in Let me know and I'll catch everybody later",
    "metadata": {
      "video_id": "3sYsqAWBo80",
      "title": "Trading in IRAs",
      "url": "https://www.youtube.com/watch?v=3sYsqAWBo80",
      "upload_date": "",
      "duration": 353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 5,
      "start_timestamp": "00:04:57",
      "start_timestamp_seconds": 297.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=3sYsqAWBo80&t=297"
    }
  }
]