[
  {
    "text": "What's up, outliers? Quick market update talking about the Trump tariffs, what happened, what the market is doing. We've been covering this pretty closely because obviously the market is very interested in this and we can see based on the futures reaction after hours, this didn't go as planned. We saw volatility leading into the event using things like term volatility in SPX, thinking to look at VIX term structure and it really didn't have a lot of all for this event. Then if we take a look right now at the eminies, they're down about three and a half percent, we have the Russell down about four, four point eight percent, almost five percent, NASDAQs down four and a quarter percent and VIX is up over six percent. Bitcoin is down almost five percent. We're down almost three. What this is telling us is this didn't go as planned. The market was generally expecting another outcome here and this is why trading volatility around events like this can be very interesting, but you got to make sure you get paid. In this context, trading volatility around the release didn't seem to make a lot of sense because the market wasn't pricing in the ball that otherwise we would have needed to see because of the potential for this exact kind of move. What's happening now? Let's take a look at what's been announced and what the implication of that is. Here you'll see if we just start at the",
    "metadata": {
      "video_id": "5-n_K32MGYo",
      "title": "Trading Trump’s Tariffs: Strategy Behind the Headlines",
      "url": "https://www.youtube.com/watch?v=5-n_K32MGYo",
      "upload_date": "",
      "duration": 565.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5-n_K32MGYo&t=0"
    }
  },
  {
    "text": "wasn't pricing in the ball that otherwise we would have needed to see because of the potential for this exact kind of move. What's happening now? Let's take a look at what's been announced and what the implication of that is. Here you'll see if we just start at the top, there's a pretty big change in the broader policy than what is expected. The market and what Trump had been saying is that this was going to be a very scalpel approach where it's going to be primarily reciprocal, even nicer in some instances. This is a primetime example of the way that the market is trying to price risk and how interesting it is because the market is looking at all the information available to them. Statements being made, pricing of other instruments. Trump is saying things like I was listening to him talking last night and he was saying that he's actually being much nicer than some of the other countries have been with us. Things like that, right? So it brings this muted expectation, but then you also have to remember that this is Trump and it's kind of like WWE wrestling where Stone Cold Steve Austin can pop out at any time with a chair. That's kind of what's happening here because this I do not believe anybody expected. I didn't see this covered literally anywhere. You can see that it says there is a 10 baseline tariff that are across the board levies on",
    "metadata": {
      "video_id": "5-n_K32MGYo",
      "title": "Trading Trump’s Tariffs: Strategy Behind the Headlines",
      "url": "https://www.youtube.com/watch?v=5-n_K32MGYo",
      "upload_date": "",
      "duration": 565.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 8,
      "start_timestamp": "00:01:37",
      "start_timestamp_seconds": 97.10000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5-n_K32MGYo&t=97"
    }
  },
  {
    "text": "Austin can pop out at any time with a chair. That's kind of what's happening here because this I do not believe anybody expected. I didn't see this covered literally anywhere. You can see that it says there is a 10 baseline tariff that are across the board levies on all imports. Effective five April. This is what we would call the antithesis of scalpel approach, which I find very interesting. Now this next line talks about that piece that I was listening to last night and I think he was in the Oval Office just kind of taking general reporter questions. And he was saying that he's going to be much nicer, what I'm quote, then some of the other countries have been. So this is what I think he means by that. Where he's saying that there's going to be discounted reciprocal tariffs. So based on relationships and existing trade policy, we can see that duties 24 on Japan 20 on the EU in lieu of the universal 10 tariff. So he's being real nice here and instead of stacking these, he's just giving them the own special tariff without the additive effect, which is again significant. So the market right now is really doing its best to price this in because I think by all accounts, this came in heavier than expected. You can see that there's a 34 tariff on China and it's looking like it says like the 20 tariff Trump imposed over fentanyl. So",
    "metadata": {
      "video_id": "5-n_K32MGYo",
      "title": "Trading Trump’s Tariffs: Strategy Behind the Headlines",
      "url": "https://www.youtube.com/watch?v=5-n_K32MGYo",
      "upload_date": "",
      "duration": 565.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 8,
      "start_timestamp": "00:03:14",
      "start_timestamp_seconds": 194.20000000000002,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5-n_K32MGYo&t=194"
    }
  },
  {
    "text": "the market right now is really doing its best to price this in because I think by all accounts, this came in heavier than expected. You can see that there's a 34 tariff on China and it's looking like it says like the 20 tariff Trump imposed over fentanyl. So it's adding to previous duties. The base tariff rate on Chinese imports will be 54 before adding tariffs imposed during Joe Biden's pregnancy and Trump's first term. So massive, massive tariffs. And you can see this being reflected across the market, right? So there's a lot of companies that rely pretty heavily on Chinese manufacturing. Some good examples of that are if we take a look at Apple, if you take a look at Apple after hours, they're literally down almost 10. Right now they're trading they close that 22389 up about 0.3. And right now they're trading at 208. So this is because there's a massive vulnerability. Now the beautiful part about all of this and this is one of the things I'm going to go into the pro livestream that I'm expecting to have later with the outlier pro members is talking about ways to capitalize on this because there's a lot of them. You can absolutely expect to see some behavior based on what we're looking at right now together over the next couple days. This is a beautiful opportunity. Anytime there's a dislocation between what the market expected to happen and what actually happened, there's a",
    "metadata": {
      "video_id": "5-n_K32MGYo",
      "title": "Trading Trump’s Tariffs: Strategy Behind the Headlines",
      "url": "https://www.youtube.com/watch?v=5-n_K32MGYo",
      "upload_date": "",
      "duration": 565.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 8,
      "start_timestamp": "00:04:51",
      "start_timestamp_seconds": 291.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5-n_K32MGYo&t=291"
    }
  },
  {
    "text": "because there's a lot of them. You can absolutely expect to see some behavior based on what we're looking at right now together over the next couple days. This is a beautiful opportunity. Anytime there's a dislocation between what the market expected to happen and what actually happened, there's a trading opportunity in the price movement between those two points. This is exactly what's going to happen tomorrow. It's going to be really interesting to watch. And for those that are able to move quickly and get trade ideas online, you can absolutely participate in your own way. Another great example here is Nike. We take a look at Nike Nike close that 65 now they're trading at 60 and a half. So not quite 10 but also showing a lot of weakness. And again, this is likely to be continued weakness because these tariffs don't just impact up front is where most of the pricing of the tariffs are going to be done and negotiated out between the open market, right? By and selling until we arrive at what we think the total impact will be. But the short term effect of that dislocation is highly tradable. And again, you can see it present in things like this. So you can effectively look through things and say, huh, what has exposure to some of these countries? As an example, and then use that as your barometer. So let's take a look through a couple other things, right? So auto",
    "metadata": {
      "video_id": "5-n_K32MGYo",
      "title": "Trading Trump’s Tariffs: Strategy Behind the Headlines",
      "url": "https://www.youtube.com/watch?v=5-n_K32MGYo",
      "upload_date": "",
      "duration": 565.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 8,
      "start_timestamp": "00:06:28",
      "start_timestamp_seconds": 388.40000000000003,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5-n_K32MGYo&t=388"
    }
  },
  {
    "text": "you can see it present in things like this. So you can effectively look through things and say, huh, what has exposure to some of these countries? As an example, and then use that as your barometer. So let's take a look through a couple other things, right? So auto tariffs that 25 tariffs on all foreign made autos as of midnight. Okay. So then let's take a look. There could be even a pairs idea here. Let's say look at Ford F and Ford is trading about the same. What does that tell you? Well, it tells you that what's happening here is generally expected. There's not a big surprise here. They knew this was coming. This isn't shocking anybody. Another thing that we uncovered during a stream yesterday that was very interesting was the wildly bullish positioning in Ford leading into today. And you can see that represented. It was up almost over 3 at one point during the day, just following along with the price activity from the day prior. So let's take a look at GM. Let's see how GM is varying here. 37, 98, close, 47, 25, 47, 10. What about the same, a little bit of a dip, but about the same. Let's take a look at something like Tesla. The reason why I like looking at Tesla is because Tesla typically is widely produced within the US. But notice how Tesla is down still here. Why would that be? Well, it's because of",
    "metadata": {
      "video_id": "5-n_K32MGYo",
      "title": "Trading Trump’s Tariffs: Strategy Behind the Headlines",
      "url": "https://www.youtube.com/watch?v=5-n_K32MGYo",
      "upload_date": "",
      "duration": 565.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 8,
      "start_timestamp": "00:08:05",
      "start_timestamp_seconds": 485.50000000000006,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5-n_K32MGYo&t=485"
    }
  },
  {
    "text": "bit of a dip, but about the same. Let's take a look at something like Tesla. The reason why I like looking at Tesla is because Tesla typically is widely produced within the US. But notice how Tesla is down still here. Why would that be? Well, it's because of other integrations. It has beyond the auto motive side of things. So this is now the game. And it's a really fun game because there's a lot to look at. There's a lot to price in. And I imagine that you're going to see a lot of news coming out about this as everybody's digesting what's going on. Pay attention to the industries, pay attention to the countries, pay attention to expectation price dislocation. The other thing to pay attention to in my opinion is the use of these tariffs for follow-on conversations. And there's actually a really important line I saw from here. I would advise none of the countries to panic. I wouldn't try to retaliate because as long as you don't retaliate, this is the high end of the number. What does that tell us? It tells us that the broader intention here is to use this as a negotiating tool. It tells me that the intent behind this is to try and draw back some of the other tariffs that other countries have. And if we go that route, there's a chance that this abates relatively quickly, which I would be surprised if that were the",
    "metadata": {
      "video_id": "5-n_K32MGYo",
      "title": "Trading Trump’s Tariffs: Strategy Behind the Headlines",
      "url": "https://www.youtube.com/watch?v=5-n_K32MGYo",
      "upload_date": "",
      "duration": 565.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 8,
      "start_timestamp": "00:09:42",
      "start_timestamp_seconds": 582.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5-n_K32MGYo&t=582"
    }
  },
  {
    "text": "as a negotiating tool. It tells me that the intent behind this is to try and draw back some of the other tariffs that other countries have. And if we go that route, there's a chance that this abates relatively quickly, which I would be surprised if that were the case, but it could. And if that did happen, I would expect the market to love that, to respond very, very favorably to that news. If it goes the other route and we start to see more tariff reciprocity, look out below. That just adds massive inflationary pressure on top of the already tenuous spot that we're sitting in. So it can absolutely get ugly pretty quick. We have to wait and see. Now the question is, how do other countries respond? Two things on top of mind. First one, trading the near term ingestion of this information and price dislocation against expectations. The second thing is following how other countries respond, because that's absolutely going to drive what you see happening today in a pretty big way. If you have any questions, let me know. Be an outlier. See you later.",
    "metadata": {
      "video_id": "5-n_K32MGYo",
      "title": "Trading Trump’s Tariffs: Strategy Behind the Headlines",
      "url": "https://www.youtube.com/watch?v=5-n_K32MGYo",
      "upload_date": "",
      "duration": 565.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 8,
      "start_timestamp": "00:11:19",
      "start_timestamp_seconds": 679.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5-n_K32MGYo&t=679"
    }
  }
]