[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you in I don't know the nuance of how it populates this list. So that being a limitation, that's why I have two resources pulled up so that we could look through both. So what I'll do is I'll grab the handy dandy workbook and on the scratch page, we'll literally just take like the top 10 names from both sides. And then I literally want to go through the names and do a quick analysis, see what they're doing. Take a look at some of their recent earnings. The reason why I'm doing this is also literally so that I can look for trade ideas. Some of these are things that I'm actually trading. Some of these are new names for me, like ANVS. I don't know much about ANVS. I am going to make sure that Palantir is in one of these because I have a position in Palantir and I actually want to take a closer look at that in video, snow, ASMR. And then if there's any other ones on this list, that should be a thing. Let me know. And then we'll add Palantir. Cool. So here's our current working list of stuff. What is this? 16, 16 tickers. So first things first, I want to literally pull up a chart for all of them. I'm going to move this off to the side so",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "thing. Let me know. And then we'll add Palantir. Cool. So here's our current working list of stuff. What is this? 16, 16 tickers. So first things first, I want to literally pull up a chart for all of them. I'm going to move this off to the side so that I can more quickly see what's happening. And the other thing actually that I should pull in from this one is the fail to deliver. Fail to deliver is the ratio of median aggregate FTDs. Over the last 60 days, two shares outstanding. That's actually a very interesting metric. I like that a lot. So can I copy those done? I can't. Well, at least quickly. So I'm going to just populate these really fast. 99, like 394, 96, 91, 94, 94, 94. Cool. Got them all. And let's flip through these. There's going to be two things I'm looking for. The first thing is if there's anything interesting about the chart to start, it's always an easy jump off point. But then if there's anything that catches my eye, we'll do a double click. We'll take a look at the options chain. And then we'll take a look. Some of these actually want to look at some of their recent earnings, because I'm very interested. Like, sound how I know what they're doing. So the fact that they're very popular right now is not at all surprising. They're very, very involved in the broader AI space. And they",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "Some of these actually want to look at some of their recent earnings, because I'm very interested. Like, sound how I know what they're doing. So the fact that they're very popular right now is not at all surprising. They're very, very involved in the broader AI space. And they actually are doing a pretty good job pivoting and cornering the market. So I'll show you their most recent earnings. This is a good example of one that we do want to look at, I think. Here. Uh-uh. Let's find their actual earnings really fast. And what we're interested in here is how they're building the business. This is what we're interested in. So let's flip through this. We can look through the financials later. I actually don't care that much. And I don't want to get bogged down in those details. The reality is for a lot of these names, the financials are kind of, they're part of the puzzle, but it's more the trend of them. So like, what I mean by that is if we take a look at sound hown really fast, let's go into here, let's go to S.O. U.N. And let's take a look at their actual financials. So stuff in here that tends to matter to me, net receivables is important. I use this as a sales proxy. It's not the same revenue, super, super important. And the trend of revenue is really, really important. Um, shares outstanding all like and stuff. I",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "at their actual financials. So stuff in here that tends to matter to me, net receivables is important. I use this as a sales proxy. It's not the same revenue, super, super important. And the trend of revenue is really, really important. Um, shares outstanding all like and stuff. I really don't care about that. This, this tool that they have here is decent, but it doesn't have all of the stuff that I care about in one spot. Unfortunately, I think our swim has a decent tool. It's still not exactly everything that I want in one spot. I'll show you some other pieces that are important to me. So looking at the, well, I think we've talked about this before. Let yeah, I just realized I think I'm repeating something that we've like recently talked about if I'm not mistaken. If any of this on here confused as you let me know, otherwise, I'm just going to look through it really fast and see if anything sticks out to me. But if you have a question, ask, I'm always happy to answer. All I'm looking at here is sales. Like at the end of the day, sales is one of the most important things to me. And I think for any company on planet earth, sales is one of the dominant forces. And we want to see sales increasing. But as always, you have to take into account seasonality. So looking at quarter over quarter is fine to",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "one of the most important things to me. And I think for any company on planet earth, sales is one of the dominant forces. And we want to see sales increasing. But as always, you have to take into account seasonality. So looking at quarter over quarter is fine to look at a broad trend. But if we see from December going from 34,000 down to 29, this isn't inherently the end of the world. I also compare it year over year. So we're almost triple where we were year over year. The reason why that matters is because, again, there's seasonality, periodicity to it. Joe says, I tried buying fractional shares in Toss found out they don't have that. That's good. I'm glad that they don't. I think fractional shares are a little bit of a doop for people. I mean, it's fine, I suppose, but I in general don't really like it. Let's see what their highlights are. So agentic AI unveiled Amelia 7. Oh, business is the heart of the power of agentic AI with category leading voice tech platform leap forward smart, a agents to perform complex tasks, voice commerce, restaurants, see like this is pretty cool. And this is also a really, really, really great example of a company that has made a hell of a pivot. Because if you remember, soundhounds business model has varied quite a lot over the years. But they had a specific fastball that they really stuck with. And now",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "cool. And this is also a really, really, really great example of a company that has made a hell of a pivot. Because if you remember, soundhounds business model has varied quite a lot over the years. But they had a specific fastball that they really stuck with. And now they're branching out pretty significantly and going all in on the AI thing, which I just think makes sense. You can see the penetration into all of these different sectors, which just makes them stickier. It makes them definitely a more important thing to keep an eye on if they can maintain their footing. So let's take a look at this isn't what I wanted. There's another piece to this that I want to see, but that's okay. I don't want to get too slow down. Let's take a look at the options change really fast. What the fuck is this? Why is this thing all fucked up? There we go. So really, really long call skew expectations. And a lot of them are pretty close in time in 18 July. They have earnings seven August. But a bunch of those calls were sold. So this is, I mean, this looks like very standard meme stock, right? Like really, really heavy call skew if we take a look at the ball surface, I would expect to see some call side skew like this. Not necessarily massive. This is super heavy put side in August. And then in set call side",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "looks like very standard meme stock, right? Like really, really heavy call skew if we take a look at the ball surface, I would expect to see some call side skew like this. Not necessarily massive. This is super heavy put side in August. And then in set call side 16 Jan call side 15 Jan about flat. So they do have some pretty serious call skew. And let's take a look at one more thing. And then we'll move on to the next name and then we'll decide if this is one that we want to revisit or not. Let's take a look at this here. This is interesting. This almost looks like somebody had a pretty good idea about the move here. That's what that looks like to me. Four million in net call premiums here. The only thing that doesn't make sense is it looks like there was a big unwind here. I want to see what this was on 30 June. Because that's just a strange. That's a strange amount of activity. And then some of it reverted here. So what is this 30 June? So we got really, really busy. The stock was up 9 on the day. This is a super volatile stock. And let's take a look at the not this one. Not this one either. What am I doing with my life? No. No. I guess we can use. Let's see what this one is. This is sound. All right. This isn't",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "on the day. This is a super volatile stock. And let's take a look at the not this one. Not this one either. What am I doing with my life? No. No. I guess we can use. Let's see what this one is. This is sound. All right. This isn't exactly where I want to land. I'm just seeing what kind of activity came through on the 30th. So the other thing I'm noticing here on the 30th is that it's a lot of disaggregated trades, which is actually a lot different than you might expect. That's interesting to me. It's super interesting to me. Let's get rid of these. Let's add sound. And then let's also do like the last week. Good, good, good. We want at least, let's say at least 5,000 in premium. We can sort it by premium. Sort by premium. Yeah, good. Good, good, good, good, good. We want opening trades specifically. So that's a smaller component to it. And then get rid of the spreads and some big activity here. And it's over a couple days in the 9s over several days in the 9s. Look at this. 30th, first, 30th, second. This was at 0748, 0655, 01. I'm impressed that they get it at 1.08. Look at that. That's cool. So what you're seeing here is somebody that literally got into this thing at a few different points throughout the day. And then they also had the eights going. Very curious. So this",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "at 0748, 0655, 01. I'm impressed that they get it at 1.08. Look at that. That's cool. So what you're seeing here is somebody that literally got into this thing at a few different points throughout the day. And then they also had the eights going. Very curious. So this definitely seems to be in play, to me at least, especially from a vol perspective. If we take a look at the vol, implied volatility percent, high, 36 percent. Except it does have a lot of periods where realize this. Eeking. So I don't have like a strong directional preference in here. This I would mostly want to trade the vol, but what I'm doing is I'm setting alerts. To see if it starts breaking out one direction or the other. Next. Rivian, Rivian, I think most of us are familiar with Rivian. They have been. Also all over the map because they had like a really cool tech. And then it started, it started to look like they were a straight scam, which didn't work well for them. This also looks great. This interests me from a vol perspective, right? So take a look at the risk premiums in here. It's got really strong risk premiums, like very, very persistent. It has earnings on the. What is this? The fifth after the market, but this looks. This looks good just for vol. But just says that's exactly what I was trying to hold on recess. I thought it did",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "here. It's got really strong risk premiums, like very, very persistent. It has earnings on the. What is this? The fifth after the market, but this looks. This looks good just for vol. But just says that's exactly what I was trying to hold on recess. I thought it did have fractional had drip and Roth. I see. So maybe they do for a thinkorswim. I've never actually tried to maybe it's based on the name. Because that is another limiting factor. The way that fractional shares work is it's essentially an internalized order. What it means is that the broker holds the inventory. They hold the shares and then they're just letting you hold on to a piece of it. That's how they because there's no fractional shares that actually get sent across the exchange. That's all internalized stuff. So my guess is it will depend by the broker and what names they choose to hold for fractional. Some will do most names or at least a lot of the big names. Others probably have a smaller amount of names that they might offer it on. But Rivian, I will add this to my list for risk premiums of 5 July. Rivian, BRP. That one looks interesting. Next. And then if there's any of these that you guys want to double click into as we're poking through, let me know. I'm happy to. We'll take a look at AMC. Look at their risk premiums. For the past year, they've",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "5 July. Rivian, BRP. That one looks interesting. Next. And then if there's any of these that you guys want to double click into as we're poking through, let me know. I'm happy to. We'll take a look at AMC. Look at their risk premiums. For the past year, they've had persistent risk premiums except for what is this from the third to the 25th except for a streak of 20 days on this down move. So right now I have a coverage strangle in AMC. And I think I've talked to you guys about this before. The main reason for the long stock component to the trade is based on a bet that I made a few years ago with a viewer. So since I have the shares, I just trade around them essentially. So this has been really good from a coverage strangle perspective. Simply because it does seem like there's a general floor that's been priced in around here. It's too early to tell if the floor is actually strong or not. But it's in the process of like a counter-trying to move. So it's been coming down, coming down, coming down. It's a low, it's a lower high. So this is standard downside continuation. But then it hits the same low. So this is pretty standard basing activity. Normally you'll get like a couple more. But pretty standard basing. And then it gets a rally out with a really small consolidation here posting a higher high.",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "lower high. So this is standard downside continuation. But then it hits the same low. So this is pretty standard basing activity. Normally you'll get like a couple more. But pretty standard basing. And then it gets a rally out with a really small consolidation here posting a higher high. So this is a trend reversal. And then it gets a higher high here along with higher lows here. But then it's starting to unwind fall back. Even this would still be considered upside trend because these lows are higher than these. But these are starting to trickle back down. So this looks like it still looks broad downtrend, but the stock is definitely trying to show a little bit of fight. Risa's, how do you scan for risk premium? More to it than implied over historic, right? Definitely. The way that I think about using implied over historic is it's a very, very simple initial filter that will get rid of most things that don't qualify. So everything that has reasonable implied over historical fall is not immediately a good risk premium candidate. But it is very rare the case where something is a good risk premium candidate and it does not have implied that trends over realized. So I guess in a way, I do use that to scan because it's just a very simple filter. From there, I have a series of volatility calculators that I'll use to try to refine if it's something that I'm interested",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "it does not have implied that trends over realized. So I guess in a way, I do use that to scan because it's just a very simple filter. From there, I have a series of volatility calculators that I'll use to try to refine if it's something that I'm interested in. So I calculate volatility in a few different ways. And I've developed kind of like a composite score based on realized vol trends. So for those that are in the Patreon, you guys might have seen this document before. Let me find it for you guys really fast. And I'll show you. This is like a simplified version of what I use. I have to go in here. So I use a tool like this. And the one that I use live actually allows me to also forecast all. But essentially what I'm doing here is I'm calculating a bunch of different types of volatility. And I create a waiting based on these so that I can determine whether or not it's something that I like or don't like. It might seem a little heavier than, I mean, it's not that crazy. But the synopsis for all of that starts with the scan of implied versus realized. From there, if it's something that seems to look good like this, I'll also take a look at the surface. And then I can essentially plot risk premium. This is using underlying vol, right? So 30 day vol for the underlying. But",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "starts with the scan of implied versus realized. From there, if it's something that seems to look good like this, I'll also take a look at the surface. And then I can essentially plot risk premium. This is using underlying vol, right? So 30 day vol for the underlying. But you can do this for individual options. Just as the underlying vol has volatility, which is 30 day vol, you can take individual expiration and individual strikes. And you can plot this same exact plot just using individual option. So I'll do that as well. So there's a few things that I'll do. All right. AMC, let's move on. So far. So far. So far is breaking out upside, isn't it? Let's take a look at their financials. Because so far, I think, has been, I'm not doing the thing. Meaning they've also fundamentally started to pivot pretty well. Yeah. And see, the interesting thing here is that it's been essentially net long call premium at pretty high levels for a sustained duration at this point. This still looks like upside to me, like longer term upside. For sure. That's why you see so much of these really peaky style long premiums, right? If you take a look at this, right where I have the mouse that horizontal line, you can just eyeball and see that this thing has been getting bought on the long call side of the equation for the vast majority of what you see here. So",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "long premiums, right? If you take a look at this, right where I have the mouse that horizontal line, you can just eyeball and see that this thing has been getting bought on the long call side of the equation for the vast majority of what you see here. So this still looks really, really strong. Did I mean the net flow has been very positive, like very, very positive, big time positive, even on the down days. So that's also very interesting. When you see net flow runs so positive, even as the stock is having these small down days, I mean, this to me looks like a really, really simple, highly speculative, but upside play. The way that I would play something like this at this point, since it's starting to break out of these highs is I would think it would consolidate a little bit. It's already starting that, but it still has pretty strong volume on these days. So this becomes a longer term idea, especially with how volatile it is. Lauren says I think so, if I was been undervalued, as it what's its forward PE? I don't know which one of these has it. No one of these has it. Not in the options, not there. Maybe here. Rose. No. I know that this thing has forward PE somewhere. I don't think it's here. Oh, wait, is it over here? Christ, the earnings. Here we go. Forward PE. Sticks be seven. You think that's",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "No one of these has it. Not in the options, not there. Maybe here. Rose. No. I know that this thing has forward PE somewhere. I don't think it's here. Oh, wait, is it over here? Christ, the earnings. Here we go. Forward PE. Sticks be seven. You think that's undervalued? Who's it competing again? That's fucking crazy. Yeah. So if we look at forward PE, so five is one, two, three, four, five, six from the top, seventh, seventh from the top out of all of its competitors. I wouldn't call that relatively cheap personally. That doesn't mean that it's not worth it. And I think that's an important differentiation. You can have something that's expensive that's still worth it. But yeah, I mean, that is expensive objectively. Anything that's trading at 50 times forward earnings, you are kind of walking on a tightrope. Like you've got to deliver. Yeah. I mean, there's a, and you can see there's such a big jump that happens from like the 30 handle. 30 handle, big jump into the 60s and then it just goes parabolic. But there's not even that many around this handle. So I mean to me, that looks, that looks expensive. But just because it looks expensive doesn't mean that it's bad in my opinion. It means that it does need to deliver though. That's for sure. This is good to see institutional sponsorship that high, that's actually very, very important. And then as always over to the",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "that looks expensive. But just because it looks expensive doesn't mean that it's bad in my opinion. It means that it does need to deliver though. That's for sure. This is good to see institutional sponsorship that high, that's actually very, very important. And then as always over to the income statement, sales. Sales is good. Sales is very, very good. So this is good. Sales growth see, and this is why the company is going to have a astronomically high PE ratio because they're trying to discount this future sales growth, which is difficult. Let's take a look at so five earnings. All right, let's see. ZX Board says so five also RSI well over bought. How can you tell when it's a bad deal right now versus jumping on a great upswing? That's a great question. It's because it's one of those things that seems like duh, why wouldn't we look for that? The answer is that really is where the art of trading is because for something like so five, for example, even though that it's very highly valued right now, I would still be interested in it to the long side. And it's because there's two parts of my brain on the way that I would trade something like this. There's the really near term so trading the short term price behavior like these kinds of moves. And then there's the long term price behavior. So for something like this, ultimately what matters is where the",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "parts of my brain on the way that I would trade something like this. There's the really near term so trading the short term price behavior like these kinds of moves. And then there's the long term price behavior. So for something like this, ultimately what matters is where the momentum is. And objectively speaking, the momentum is pretty strong. It's almost in perfect alignment. What I mean by that is we have a 10, 20, 50 and then I think this is a 150, either use 150, 200, something like that. But you can see that the 50 is also coming up above the 50, which is important. This, I mean, the 50 above the 150. I don't know if I said that. That's really important though. That configuration means that it's in a general upswing. So just because it's expensive doesn't mean it's a no go for me. The way that I would trade something like this is really, really simple. I would use a stop around this near term consolidation. And I would give it some room. So it would be based off of the bottom of this candle. So if I zoom us in a little bit further. It would be based somewhere around here, maybe give it a little more room at like the 17 handle, something like that. But this is a really early consolidation. So early consolidations tend to be higher fail rate. But that's okay, right? The way that I look at",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "bit further. It would be based somewhere around here, maybe give it a little more room at like the 17 handle, something like that. But this is a really early consolidation. So early consolidations tend to be higher fail rate. But that's okay, right? The way that I look at this is it's an attempt to play an asymmetric upside move. So here's what that ultimately looks like. And this is honestly what we spend a lot of time doing in the pros streams, right? It's like actually looking at trades and trying to build them. So I'm glad that we're doing this because it's an important exercise. So if I were to do something in here, we can take a look at where the wall surface looks cheap. So this looks cheap here. No, not this one. This one. This one looks cheap. 42 wall. That's cheap relative to the underlying wall out here. It's cheap 54 at 440. You still get a really high delta. So it's fine. And it's nice and liquid, right? 10 points wide, easy day. So the first thing that I'm doing here is I'm actually looking for cheap ball. And it's because in really high volatility names like this, it is super, super important to not overpay for your wall. Otherwise you will get smashed. So if we go out to that 18 step expiration, notice how cheap that wall is relative speaking. And the reason why this is super important is because",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "really high volatility names like this, it is super, super important to not overpay for your wall. Otherwise you will get smashed. So if we go out to that 18 step expiration, notice how cheap that wall is relative speaking. And the reason why this is super important is because the wall on stuff like this, even for long calls that are far out in time can completely eat your lunch. It can ruin a trade. So this I would actually be inclined to go out here 18 step, which is really far out in time. But what I'm doing is I'm trying to look for cheaper wall at the money. The wall here is about 58. It's about 20 points cheaper, ish a little less than the underlying wall itself and then the front wall. So I would be inclined to go really far out in time to try to get that much cheaper, cheaper wall. And what I'm doing right now is I'm comparing Vega. See that's another, that's another interesting thing. So if you take a look at Vega across the surface, Vega here is .03 at 76 days. Here it's .025. So if we were to make a comparison of Vega, I literally think I had a plot on the other one, but we'll just do, um, X-Berry, we'll just do DTE, then we'll do Vega. And I want to show you guys something. Let's start with, we'll just do the main explorations. So we'll do",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "make a comparison of Vega, I literally think I had a plot on the other one, but we'll just do, um, X-Berry, we'll just do DTE, then we'll do Vega. And I want to show you guys something. Let's start with, we'll just do the main explorations. So we'll do 13 and I'm going to keep it all at the same delta. So I'm going to look for the closest to 50, which is right in here. The Vega will be .014. It'll be about the same. So 014. Then let's go to 41, Vega here .025. I have to paint the format in Google Sheets because when you clear everything, it'll still keep the old formatting, which is kind of annoying. 76. That puts us at .034. Let's go to here .195. That puts us at .054. And then let's go out here to 440, just .078. Okay. So now let's visualize what we're looking at here. This itself might not really mean anything, but it definitely means something to me. So here's a chart showing you Vega versus DTE. And what I'm going to do is actually show you also the percent change. If I can get myself to do math, which it looks like it's . . . it looks like a no. There we go. So take a look at what happens here. If we plot Vega across these different explorations, which is down at the bottom, and what I specifically want you to look at",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "to do math, which it looks like it's . . . it looks like a no. There we go. So take a look at what happens here. If we plot Vega across these different explorations, which is down at the bottom, and what I specifically want you to look at is the percent change in Vega. So what ends up happening is even though these have more Vega, the amount more Vega compared to the other Greeks is actually low compared to the change that you see from 13 to 41. That's a 78 change in Vega over these two time frames. Same from 195 to 440, which is a much bigger percent change in total time. So if we take a look at the percent change in total time, in a raw number sense, obviously a much bigger change in a percent change, it's actually quite a bit lighter going from 13 to 41, right? Which obviously makes sense based on just the base numbers. But what's happening here is if we look at an actual count in terms of day change first between these, it's kind of more the way I'm looking at it. It's a significant significant change in total time that you're gaining from 195 to 440. So even though is a percent, this is definitely bigger. If you think about the total number of times where this change can fit into this change it's profound. So what ends up happening is this is a significant",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "change in total time that you're gaining from 195 to 440. So even though is a percent, this is definitely bigger. If you think about the total number of times where this change can fit into this change it's profound. So what ends up happening is this is a significant change, but the total change in Vega is much smaller than what you see here. And again, even if we had those percentages back, we take a look at the difference between these percentages. It's not as dramatic as you might think. And the reason is because for short term options, you're going to see the most profound change in most of the Greeks. And it's because everything becomes hypersensitive when you are coming up on expiration. Now Vega is the exception to that. Vega is much higher further out in time. But again, what I'm showing you is by going far enough out in time, the change in expiration over doesn't lead to a massive change in Vega. So all of this is designed to show two things. It's designed to show how when trading something that is really, really high volatility, not overpaying for the option is one of the utmost tasks you have. And in this case, going out 440 days is an economical choice, not in terms of raw cost. Raw cost, this will be way more expensive compared to the 76 days. 76 days if we go to a 50 delta, these are like 1.70,",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "of the utmost tasks you have. And in this case, going out 440 days is an economical choice, not in terms of raw cost. Raw cost, this will be way more expensive compared to the 76 days. 76 days if we go to a 50 delta, these are like 1.70, just taking the midpoint ish between these or your 50 delta. These are 455. So on a gross dollar amount, way more expensive. But just because they're more expensive doesn't mean that they don't make sense. And one of the reasons why they do make sense is because they help offset a lot of these other factors. And the process of offsetting these factors is really important. Lauren says September 26 can afford that. Funny. Lauren, what expiration are you in? September 19 here. What options do you have? Tell me. And give me one sec. I'm just going to go grab another seltzer water. All right. Yeah, what strike though? You said September of this year. What strike do you have? So if we take a look, let's compare these. This is a great example. So let's take a look at the wall surface. And let's compare 19 sep versus this 19 strike. So the 19 strike is currently you did fine. Yeah, you did absolutely fine. Now let's go further 18, 726. Yeah. You did absolutely fine because the 19 handle right now for both of these is like right around 60 wall. Now the only downside is",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "versus this 19 strike. So the 19 strike is currently you did fine. Yeah, you did absolutely fine. Now let's go further 18, 726. Yeah. You did absolutely fine because the 19 handle right now for both of these is like right around 60 wall. Now the only downside is that your 76 days to expiration will experience a lot more total change, which you'll see in a moment, what I mean. So if we take a look at your 70 days, which is kind of closest to 60, and we compare those against the 365 365 as far as it goes out, this is close, but not really, right? This would need to go out essentially to 500 days to be closer still, but this will still serve the example. So if we look at the difference between the moves here, right? A good example of this is the overall level is good. Let's take a look at the IV percentile because it looks like you got in at a good level. Yeah, 44. So a little high, but not crazy, but take a look at the difference in terms of IV percentile between these explorations. This is what I'm talking about. So in the process of looking for cheaper, vol, I found it. You didn't because looking at the options that I am in, I'm getting in at something that's less than 5 implied volatility percentile. You got into something that's 44 IV percentile. So if we think",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "I'm talking about. So in the process of looking for cheaper, vol, I found it. You didn't because looking at the options that I am in, I'm getting in at something that's less than 5 implied volatility percentile. You got into something that's 44 IV percentile. So if we think about, I have a video coming out next month that's actually going to deep dive imply volatility, which I'm pretty stoked for for you guys. Our video from last weekend, I actually think is what spurred it. But so what's going to, what happens here is in this example, the 60 day to 90 day imply volatility percentile, it's still below 50, which is good, but it's still on the high end because what this means is 44 of the time vol is cheaper for the 60 days than it is now. Whereas for the 365 plus, it means only 4 of the time is vol cheaper than what it is right now. That's truly cheap. So this is like, this is literally a trade that I'm going to look at on Monday and it's partially designed to play the direction, but it's also partially designed to literally just play the volatility. So I'm going to be looking at, what did we say, the 18-Sept 26? So I have that on my hit list. Let me know if you guys have any questions on what we just did. ZXBorg says, make sense to look at the charts this way, had",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "the volatility. So I'm going to be looking at, what did we say, the 18-Sept 26? So I have that on my hit list. Let me know if you guys have any questions on what we just did. ZXBorg says, make sense to look at the charts this way, had the experience of losing an option while the underlying went up was directly correct, but bought too close in time and got hit by volume faded. Yeah, that's exactly correct. And that's exactly what got you. Now the good part is, even if you get something that's close in time, if the magnitude of the move is correct, you'll still make money despite those effects. In the case of ZXBorg, what I can tell you from the story that he gave us, that he would have bought something that's out of the money that stayed out of the money. Because if he had bought something that was out of the money that came into the money, then the position would be much healthier despite things like volatility and theta contracting. However, if you buy something that's out of the money, you get an accommodating move, but it's still out of the money, it's still all X-Trensick value, which can get torched by those other effects. So that's another, that's a good anecdote to share. ZXBorg, thank you for sharing that. Let's flip through this really fast and see if anything sticks out to us here. Yeah, so I mean, it's",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "the money, it's still all X-Trensick value, which can get torched by those other effects. So that's another, that's a good anecdote to share. ZXBorg, thank you for sharing that. Let's flip through this really fast and see if anything sticks out to us here. Yeah, so I mean, it's just growing. It's growing super, super fast. ZXBorg exactly still trying to figure out when out of the money is a good deal or just a lottery ticket. It's the way I would look at it and classify it as a good deal is when you expect a big move, but you have to get a big move. That's the way that out of the money's make money. So let's say, for example, we'll literally look at a case study here because why not? ZXBorg, do you remember what the trade was that you had that that happened in? Because we can look at it directly. CCCES says, so, Fy, great stock, long time frame, I agree with you. It does look good, long-term time frame. From a fundamental picture, it's growing. It still seems to have pretty good institutional sponsorship. We're seeing definitely options markets buying the hell out of it. I legitimately do like it longer term. Now how long term, longer term for me is like a few months. What that shapes out to be longer than that? I have no idea. I have to be generally bullish, but I have no idea within that context. So",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "of it. I legitimately do like it longer term. Now how long term, longer term for me is like a few months. What that shapes out to be longer than that? I have no idea. I have to be generally bullish, but I have no idea within that context. So yeah, I do like this. What do they do though? Social financial services, yeah, I know this, but what do they do? Good morning, Olivia. So it looks like banking, credit card, investing, loans. So it's all in one? Yeah. Okay. Members, one stop shop. I get it now. What the fuck is so fibrillate? So this is a little less Q424, Q125 I see. Yeah. So they essentially do everything. Now, do any of you guys use SoFi like on the consumer side? Reese, okay. So Reese, why do you use them compared to something else? Just out of curiosity. I'm curious like what the draw is for people, like what makes them attractive from like literally a deck plate consumer perspective. ZXBorg says 230 after the plane crash. So Boeing, when was that? Are you talking about the most recent, recent plane crash? C says says they would, but a New Zealand. We were literally just looking at going to New Zealand. We were very, very close. Thoughtland is next for us, but we'll be out in New Zealand not not too long. So I guess they're not just not offered internationally. Is that what I'm picking up",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "but a New Zealand. We were literally just looking at going to New Zealand. We were very, very close. Thoughtland is next for us, but we'll be out in New Zealand not not too long. So I guess they're not just not offered internationally. Is that what I'm picking up there? And ZXBorg, one was the, are you talking the most recent plane crash slash when was that? One was Boeing's most recent plane crash. I mean, they got fucking planes falling out of the sky all the time. That's also as much as I like to make that joke, it is important to remember. They also corner the market. They have like the most planes in the fucking sky. So naturally, you're going to see that. Okay, so it looks like the 12th, which this is exactly where I would expect to see it. Massive dip there. So let's go back in time and let's trade that. Let's go to the 12th of last month. 12 June. And we went to two 30s and 25 July. I mean, 43 days isn't that close, to be honest. Like that's still a decent amount of time. When I'm thinking like really short term timeframe, I'm thinking stuff that's like 10 days, maybe 20 days. So this is, I still would give this like this is a decent duration. And the two 30s, 34 vol. Does this give me underlying vol at dozens? Don't know what the underlying vol is and I",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "short term timeframe, I'm thinking stuff that's like 10 days, maybe 20 days. So this is, I still would give this like this is a decent duration. And the two 30s, 34 vol. Does this give me underlying vol at dozens? Don't know what the underlying vol is and I don't know what the term vol is. Fly and blind. 30s, 17 delta. I don't hate that. Let me clear what's in here. Oh, nine. Yeah, I don't. I don't actually hate this ZX. I think the issue ZX that I would take with the trade personally is this is what I call catching a falling. I call catching a falling knife. You really don't stand to gain a whole lot if you like perfectly time the drop. So when I'm trading stuff like this, I just try to wait until it starts to show some level of strength. So it's not here. If we go to the 16th. I'm going to say about where I would be looking to enter this is still a little early. I personally would probably wait another day to see if it holds that which it does. So now I'm essentially waiting to see does this start breaking out on volume, which it hasn't yet. It's actually going the wrong way. So still it's waiting. I don't know how it consolidates, but yeah, your trade absolutely would have got chewed up by theta by like the moves that you're seeing here. Essentially this thing",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "does this start breaking out on volume, which it hasn't yet. It's actually going the wrong way. So still it's waiting. I don't know how it consolidates, but yeah, your trade absolutely would have got chewed up by theta by like the moves that you're seeing here. Essentially this thing oscillating almost completely sideways. This starts to look better on the 23rd. Yeah, so then this either either these days here look okay to me. But the 24th this looks like a fine entry small gap up rallying down, but that looks okay. So now your options at the 230. We'll wait for this to catch up. Yeah, you just got fucking killed by theta. This was mostly theta that hurt you less so volatility. Because this also directly win against your entry pretty strong right like there is a directional component here as well. Because at the low here it went against you 5 and then where it sits now against you is a percent and a half. So the reason why this hurt you is it went against you in a couple ways. I actually think I have a calculator somewhere. This one. So we can literally deconstruct what happened with something like this. So I'll move this out to the side. And let's go back to 12 June. And let's see. This is when. I got it on like the day after I'm in the wrong month. Oh, not my confused. I got the date fuck. Well,",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "what happened with something like this. So I'll move this out to the side. And let's go back to 12 June. And let's see. This is when. I got it on like the day after I'm in the wrong month. Oh, not my confused. I got the date fuck. Well, June, I am in the wrong. I'm not fucked up. No three. Okay. And let's see what's happened. So this we don't have yet days in trade. DTE will be 43. And we started. This is 12 June. And we'll do a one lot. The two 30s here. So the ball for those is 34.53. The delta is 0.172. The gamma is 0.010. Vega. And now let's fast forward. We'll go to I think where we were like the 23rd. 23rd June. So we're 11 days in the trade. And prices now. Where we at on this chart. We'll do one more day. I think the 24th is when we were looking together. So prices now 200. And the IV for your options that you 30s. Is now 28.69. Delta is 0.065. Gamma is 0.007. Vega is 0.075. Data is negative 0.035. So what I can do. I'm going to talk about the data. The data is deconstruct. How much time passed in the trade. What the interpolated Greeks are. And then what the resulting PNL is. For the different Greeks. So we can see which of these would have helped. And in this case, you got really hurt by",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "talk about the data. The data is deconstruct. How much time passed in the trade. What the interpolated Greeks are. And then what the resulting PNL is. For the different Greeks. So we can see which of these would have helped. And in this case, you got really hurt by delta. And you got really hurt as I discussed by theta. It was actually less from Vega, which we also discussed. We can kind of detect by the way that volatility behaved. That that actually wouldn't have been the dominating downside force. So. Pretty interesting move overall. But in that case, it was like very, very clear to see. What. What happened and why. And again, it's it's pretty simple, I think. In the context of. Theta was very high for that trade. So that absolutely hurts you. But then. Funny enough, some of the other. Some of the other Greeks that typically might have been assumed. To be pretty significant impact. I actually would argue were lower impact. Funny enough, which is not. Not very commonly the case. Yeah, super, super interesting. Thanks for bringing that example. The example up. It's just that kind of stuff is really interesting to me. Yeah. Interesting trade. Cool. Let's now take a look at a couple other things. Shall we. I'd like to see. I'd like to see what's going on. With. Palantir because as I discussed, Palantir is one of. One of the holdings that I have. All right. Let's grab.",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "to me. Yeah. Interesting trade. Cool. Let's now take a look at a couple other things. Shall we. I'd like to see. I'd like to see what's going on. With. Palantir because as I discussed, Palantir is one of. One of the holdings that I have. All right. Let's grab. Palantir. Doji don't see a lot of those, especially in higher ball names like this. So Palantir is pretty high ball right now. And the call skew is evening out. This to me looks like. A building expectation of like this really, really massive growth cycle starting to slow down. So it still looks pretty good long term, I think. But yeah, you can see like the overall call premiums have been slowing down pretty significantly. You can see some signs of insider offloads. Lot of sales. Lot of sales very few buying. That I don't like to see. Because these are people that are just. Caching out. I mean, they're cash and out multiple millions. So I get why they do it. They're just trying to realize some of the profit on the move. But this also starts to indicate a slightly. A slightly lower expectation. Future price performance, right? It's like, why do you cash out here? If you think it's going to go here, for example. So. I'm not cash out. I don't love. The earnings has been pretty good to the upside. It's had a lot of misses on EPS, though. Which that's not good. A",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "right? It's like, why do you cash out here? If you think it's going to go here, for example. So. I'm not cash out. I don't love. The earnings has been pretty good to the upside. It's had a lot of misses on EPS, though. Which that's not good. A lot of misses means that they're either not doing a good job explaining what they're doing. Or they have a lot of curve balls. Revenue is good. Revenue by product is interesting. I think this is an important factor for balance here because they're, in my opinion, the ability to capture. Non government. Non government markets is, I think, really, really important. So it and it looks like they're doing that, right? Like the commercial segment that I see here is. Absolutely expanding. While they're still getting government expansion. I actually, I kind of like that. Yeah, I kind of like that for them. But I think. We'll have to take a look at their earnings really fast. I'm pretty interested. Let me grab my dinner order really fast. I think we're going to do. There's a place bias that's called Shake Shack. That apparently they have pretty good burgers. So we're going to try Shake Shack. A little outside of the norm, but every once in a while, I feel like you got to keep the body guessing. Cool. All right, let's see. So let me grab. On tears earnings. We looked at this not that long ago. We",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "So we're going to try Shake Shack. A little outside of the norm, but every once in a while, I feel like you got to keep the body guessing. Cool. All right, let's see. So let me grab. On tears earnings. We looked at this not that long ago. We know that they're doing well. All right, dinner orders ready to go. That's what we like to see. All right. We're going to do. US revenue 55. That's just a good revenue growth. And they're tapping more. Into the commercial side, which is good. I think that they have a really strong. So if I can get. You're the actual presenting. Yeah. So they had. Let's watch this. Let's just block the pop up. Oh, cool. Let me play this for you guys. It's a pretty cool packet. Like I think the actual involvement for the war fighter is really, really cool. Part of me wonders though how this is actually going to play out from a war fighter perspective, you know, from like the marine side of my brain. Because I do think that there's a really high probability that the next conflict that we fight is actually going to essentially not take us back to the Stone Age is that's dramatic. But I do think people are going to be using EMPs at a cyclic rate to try and level the playing field from all this stuff because the technological advantage that the US military has is profound.",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "to essentially not take us back to the Stone Age is that's dramatic. But I do think people are going to be using EMPs at a cyclic rate to try and level the playing field from all this stuff because the technological advantage that the US military has is profound. And if I am an adversary, I would be investing a lot into finding ways to flatten that relationship pretty quickly because why would you not? It's just like what we're it's just like Ukraine's doing with the drones. Ukraine has been able to do a lot against Russia because of the innovations in drone technology. Otherwise Ukraine military and Russian military they're not even close. Which is really interesting. Devcon to invade latest products towards enterprise automation that will be pretty pretty pretty profound, I think. And then you can see the penetration into different brands, high and again, Wendy's. Yeah, it's pretty cool. Cities latest earnings release highlighted a new partnership of balance here and prove client experience. So they're getting in with the big banks. Same thing with AIG, which is huge in the finance industry. They're getting touched in with. Archer, I mean, they're just tapping into everything, man. It's kind of incredible. This to me still looks really, really strong. And being on just such an early phase of the AI growth curve. But it does look like. It does look like it's starting to slow down a little bit. Not a lot like this",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "into everything, man. It's kind of incredible. This to me still looks really, really strong. And being on just such an early phase of the AI growth curve. But it does look like. It does look like it's starting to slow down a little bit. Not a lot like this is still really big. So this is. This is soon too. What is this part of? I'm going to get rid of these multi legs. The reason why I want to get rid of multi legs is because we can get rid of a lot of. I'm going to get rid of the multi legs. I'm going to get rid of the multi legs. I'm going to get rid of the multi legs. I'm going to get rid of the multi legs. I'm going to get rid of the multi legs. I'm going to get rid of the multi legs. I'm going to get rid of the multi legs. Hey, yo, what's up? Day swag. Good to see you. I think, yeah, day swag. I think Lauren is, I think Lauren is delivering. It looked like based on the example we looked at earlier, we can co-sign that it seems like. She made better choices on the option purchases. This activity looks like sell side, though. It does look like near term. The stuff that isn't. She's a little bit smaller. To me, it looks like Palantir is actually becoming a little bit stronger positioned from a fundamental lens, but",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "like. She made better choices on the option purchases. This activity looks like sell side, though. It does look like near term. The stuff that isn't. She's a little bit smaller. To me, it looks like Palantir is actually becoming a little bit stronger positioned from a fundamental lens, but it's really neat because for a long time, the company, you know, it's the same thing that you see with a lot of promises. And people are interested to see how they deliver on the promises, but this looks like so far, they're still continuing to deliver. So this looks good to me. So I already have a position on it here like I told you guys. So I am not looking to add anything. This is more just kind of poking through and seeing what's new. Sweet. Anything else you guys want to take a look at super fast before I bounce. Look at that. Jesus. Yeah, we can take a look at him real fast. Got it, Reese. From a chart, this looks less good. This looks like it's slowly. Slowly stepping its way down. 23rd obviously is something. Interesting. No vote abruptly ends partnership. Why? A legal mass compounding and deceptive marketing holy shit. That's bad. That's really bad. The fact that there is like this really public release like that, that is bad. I don't like that. Let's take a look at what the options flow looks like. A lot of downside plays. So you see",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "mass compounding and deceptive marketing holy shit. That's bad. That's really bad. The fact that there is like this really public release like that, that is bad. I don't like that. Let's take a look at what the options flow looks like. A lot of downside plays. So you see the put side premiums here. This we want single leg. This doesn't look good. It looks like there's some speculative upside playing happening here. But it doesn't look good and it doesn't look that sized. So it's not very high conviction. So where did that flow happen? Oh, it looks like a lot of near term. So that's probably stuff. Yeah, so that's fascinating. That's a lot of intraday moves. That's a whole lot of intraday moves. It still has pretty clear upside skew in terms of open interest. But yeah, the net flow doesn't look that great. Yeah. Let's take a look really quick here. So definitely still favoring call side premium for sure. But it looks like there's an expansion and put side. Yeah, big expansion and put side here. Big expansion and put side here. Out here. So yeah, this to me. This to me looks like long term slightly stronger upside expectation. Also some near term rebound plays. But a lot of a lot of people playing this short term drop. This is all obviously in pound here, dominion. Oh, interesting. So for the front. Oh, man, this is now even more interesting. It's even more",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "long term slightly stronger upside expectation. Also some near term rebound plays. But a lot of a lot of people playing this short term drop. This is all obviously in pound here, dominion. Oh, interesting. So for the front. Oh, man, this is now even more interesting. It's even more profound. Yeah, it's even more profound. The put expansion. Let's take a look at. 30 day. Yeah, so 30 day. This is even more bearish because. There's a lot of long puts coming in. Running short calls and then just a little bit of long calls. But also long puts. Last trading day. Most of this is near term stuff that's been moved out. This is really common with meme stocks. That's why when we were looking at a palancier a second ago, you see like a lot of the volume contracts or stuff from the recent expiration. And that's going to be common across most names because people will be taken down the front trades. And move an amount. The interesting part of Palantir that we were just looking at though, the volume is like five times the OI. Whereas this is just one times the OI. So that's like multiple intradate trades. That's how you get there. Which is interesting. Let's take a look at a couple other things. Yeah, boy. Pretty strong net cell volume. Across hedge funds institutional ownership is expanding. Let's see if insiders are buying or selling. Sell it. Fuckin. Hey, they're selling holy",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "like multiple intradate trades. That's how you get there. Which is interesting. Let's take a look at a couple other things. Yeah, boy. Pretty strong net cell volume. Across hedge funds institutional ownership is expanding. Let's see if insiders are buying or selling. Sell it. Fuckin. Hey, they're selling holy shit. They're selling hard. Now one thing to keep in mind again for a lot of these places. This is how this is like a big part of their compensation for smaller startups and stuff like that. So you have to take the sale volume within good taste. And it's because a lot of these places they might have really good salaries. But most of the time they're going to be paid more strongly with equity to drive the value of the business. So some of this is people literally just realizing they're fucking money so that they can continue living and expanding their lifestyle. Like obviously they're hoping for. So I wouldn't look at all this is like necessarily super, super bearish, but this is a lot like this is a lot. So that I don't love for smaller companies like this. You'll tend to see sell premium higher than buy. And it's again because people are using this to actually add to their own wealth. Realize gains, whereas bigger stocks, you'll see a bigger balance between these typically not always, but generally speaking. And that's just because they're pretty well established people aren't taking out their founders fee",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "than buy. And it's again because people are using this to actually add to their own wealth. Realize gains, whereas bigger stocks, you'll see a bigger balance between these typically not always, but generally speaking. And that's just because they're pretty well established people aren't taking out their founders fee so to speak in terms of liquidating their positions. Let's take a look at this. Yeah boy. See look at that. So put premium is almost on pace with call premium that's abnormal. That's highly abnormal. Palantir is a great example that we were just looking at the call side, even though there is decent put activity. The call side is way more aggressive in terms of premiums. That's not the case in him's in him's especially in the front the put side is pretty heavy. It looks bearish and like this doesn't look good. Now I still think the long term health of the company is probably okay, but this sponsorship or like this relationship getting cut off that way is not good. That could be a ticking time bomb, especially the way that like the fact that it sites. Illegal mass compounding and deceptive marketing like to put that out publicly is a pretty big shot. You don't say that lightly. Now what happened here on the 26. Investors substantial losses class action law these are just the fucking predatory lawyers same same. Let's see. This should a statement it would no longer with yeah we know this",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "that out publicly is a pretty big shot. You don't say that lightly. Now what happened here on the 26. Investors substantial losses class action law these are just the fucking predatory lawyers same same. Let's see. This should a statement it would no longer with yeah we know this FDA previously ruled gluteide no longer be compounded by answers. So for me you can already see we're like the next upside level to be in my mind is like 52.55. But any sort of like mark to the downside here would lead me to believe like another visit to the point of control down here is like the 42 handle. And then a drop below 40 and a half would be real bad I think because then the next spot to grab a bite of big interest is at like the 36 and more importantly the 33. And let's take a look at their earnings real fast. Let's. I quality personal solutions so you essentially frictionless drugs. So people with lots of other company experience this one works only with companies that use script which nobody does any nobody uses cursive anymore. Sexual dermatology mental health weight loss these are actually kind of big to be honest this to our own longevity like those are pretty solid. So that's interesting so they're using like broad data that's kind of interesting I'm actually in the process of working with a fund. So I think that's just kind of in a",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "are actually kind of big to be honest this to our own longevity like those are pretty solid. So that's interesting so they're using like broad data that's kind of interesting I'm actually in the process of working with a fund. So I think that's just kind of in a consulting capacity to try to discuss some of the capability of like using a platform to then analyze like the broader behavior of the people on the platform and use that. So I think that there's like doesn't I think you're going to see that more and more pretty much everywhere. Not only can you get a super hard deck but you can get it in a tasty breathman that's nice. Oral weight loss so I guess oral weight losses a thing right it's just called stop putting fucking food in your mouth and then you'll lose weight. Hair health that's solid. What's their sales notice notice a big difference here right as we go through their earnings compared to some of the other earnings notice how we haven't gotten any fucking financials yet this is all aspirational shit like what we care about is fucking sales this looks like nothing. Dog where is your fucking financial information for your earnings release. Here we go. So this is them showing consumption of other market share that's good so this is a good this is a good graph. Yeah I like this graph and I like that it's from Bloomberg I",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "nothing. Dog where is your fucking financial information for your earnings release. Here we go. So this is them showing consumption of other market share that's good so this is a good this is a good graph. Yeah I like this graph and I like that it's from Bloomberg I was going to question where they got it from but the fact that this is from from Bloomberg is also really good I like that. 2030 like this doesn't fucking mean anything nobody cares about that this is crazy that I have to scroll that fucking finally by 26 and I get to the financials. This is good but this is not as strong as I would expect it to be. And it's margins are not expanding that much this is still good revenue growth by the way it's just not as much as I would think. Especially for something that's so early. This is where you tend to see like the strongest growth potential so the fact that it's not as strong as that. Like this is already showing revenue growth slowing. 136 year over year that's good. But yeah like take a look at quarter over quarter. You're over years good it's just not as strong as I thought it would be. I mean the way I feel about this is the underlying company still seems to be doing well and expanding it's not growing as strong as I thought it would but that doesn't really matter it",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  },
  {
    "text": "over years good it's just not as strong as I thought it would be. I mean the way I feel about this is the underlying company still seems to be doing well and expanding it's not growing as strong as I thought it would but that doesn't really matter it can still do well even like despite that. The main thing is seeing how this fucking these these claims resolve because that matters and that can absolutely cause near term sentiment shifts which tend to not be great so we'll see how it does. All right gang time for me to bounce great catching up with everybody tomorrow we have the outlier pro market prep stream and then on Monday I'm super stoked we have our first very first outlier pro plus it's a live zoom workshop at five p.m. Pacific time so I will see the group there and as always if you guys need anything just let me know be an outlier see you guys.",
    "metadata": {
      "video_id": "5bwYlR-1Tdk",
      "title": "Analyzing Top Meme Stocks | Meme Stock Watch Ep46",
      "url": "https://www.youtube.com/watch?v=5bwYlR-1Tdk",
      "upload_date": "",
      "duration": 5958.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 48,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5bwYlR-1Tdk&t=0"
    }
  }
]