[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you about this price action. And I know everybody that follows game stop, especially the diehards, we kind of look at it and we just dismissively say, well, the price is fake, the head users are just trying to put it into the dirt and then we just kind of write it off as that. And I don't blame you. But again, my entire message and my entire purpose of doing these kinds of things is try to offer a slightly different perspective. And it's not, I'm not saying that that's not happening. But what I am saying is I don't think that's just what's happening. I think that there's a mix of forces at play here. And I do think that it exhibits some level of standard market forces, but then obviously it has a lot of injections that don't follow standard market forces. The reason why that differentiation is really important is because as we're analyzing the stock, we have to keep that in mind. Because what I typically tell people is like, well, if we say the hegees wanted it into the dirt, then why isn't it in the dirt? Like we say that they're all powerful. We say that they essentially control the price. If that is fully the case, why isn't it lower? We're saying that's what",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 50,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=0"
    }
  },
  {
    "text": "people is like, well, if we say the hegees wanted it into the dirt, then why isn't it in the dirt? Like we say that they're all powerful. We say that they essentially control the price. If that is fully the case, why isn't it lower? We're saying that's what they want, so why isn't it? So again, that's not to say that that's not happening. I think we, as we go through the DD library, there's literally clear evidence that it's happening to a degree. But the broader point I'm trying to make is that it's not all that's happening. There are other participants in the stock, like you and I and other people and other institutions that aren't inherently trying to sell or box something down into the dirt manipulate the price, those kinds of things, and they enter the equation. Now, who's the dominant force? It's a great question. What I can tell you the dominant force isn't is the hedge funds. And I know that probably surprises a lot of people. People, when I say something like that, people will probably say, well, how could you possibly say that? The reason why I say that is because if we think about hedge funds being short, they don't want this. An entity that supremely short something like GameStop would not want the stock, especially if they're short down here at 15, they don't want the stock up at 65. So there's an effect that starts to take",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 50,
      "start_timestamp": "00:11:54",
      "start_timestamp_seconds": 714.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=714"
    }
  },
  {
    "text": "because if we think about hedge funds being short, they don't want this. An entity that supremely short something like GameStop would not want the stock, especially if they're short down here at 15, they don't want the stock up at 65. So there's an effect that starts to take the thing out of their hands to a degree. Then there's the structural re-intervention. And whether we think that's inclusion with the hedge funds, the market structure, you know, writ large, whatever, but there is another inject that then stifles this and stops it. But why if hedge funds fully control the price themselves, why even go through this? It shows that they're not fully in control. And it's important, again, for us to acknowledge that fact, that there are areas that they are forced out of control. Because from a hedge funds perspective, as we typically think, if they just want to drive it down to zero, why wouldn't they just do that? They're not. They can't. And it's because there are other factors here. So that's a good thing, actually, in my opinion. Also a good thing is you guys can't probably see it. I don't know if you can see that little rubber band on the tip of my finger. I'm kind of like a very simple person. But I got this when I bought a new hard drive to put stuff on my TV for my wife. And it had this little rubber band on it.",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 50,
      "start_timestamp": "00:13:04",
      "start_timestamp_seconds": 784.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=784"
    }
  },
  {
    "text": "you can see that little rubber band on the tip of my finger. I'm kind of like a very simple person. But I got this when I bought a new hard drive to put stuff on my TV for my wife. And it had this little rubber band on it. And I really like this rubber band. It's very satisfying to just pull on it. So as you see me here playing with this, that's what I'm doing, just so that you know it's up. Like this is fun to do. Pretty sure I'm on the spectrum, but I enjoy this. So back to the stock, back to where we are current day. So now we have a slightly new picture to pay attention to. I'll clear out. I don't want to clear this out to be honest. I kind of want to keep these. I'm just really, really interested in these value areas. Yeah, man. What do I do? What I want to do is actually draw a couple more lines. But I don't want this to become like just madness with lines. Well, let me just try to, I got an idea. I got an idea. I got an idea. This is what we'll do. And then so that this is kind of the value area that we're looking at right now. And if you take a look at the volume node that's being built here, there are again, lots of people willing to transact at this price",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 50,
      "start_timestamp": "00:14:29",
      "start_timestamp_seconds": 869.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=869"
    }
  },
  {
    "text": "an idea. This is what we'll do. And then so that this is kind of the value area that we're looking at right now. And if you take a look at the volume node that's being built here, there are again, lots of people willing to transact at this price handle. And again, I'll just reiterate quickly from the last stream that we did, there hasn't been a fundamental underlying change in GameStop to really even loosely cover what this is, meaning this drop, whatever this was. So because of that fact, and because we continue to see a lot of people transacting in here, this to me is still the area to beat, specifically to the upside. To the downside, I think the floor is starting to be generally priced in. Again, at least in terms of what information is currently available, available to us today right now. That doesn't mean that that's always going to be what the case is. But right now, this seems like the general zone it's looking to be in. We can see that there's a general floor being priced in. This is now the big question. How does the next couple days fare? How do the next couple days fare against this broader descending trend as we continue to bump up against this floor? So there's one other effect to be aware of from a broader technical analysis perspective. Is as we have descending channels like this, the more times that the stock",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 50,
      "start_timestamp": "00:15:31",
      "start_timestamp_seconds": 931.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=931"
    }
  },
  {
    "text": "How do the next couple days fare against this broader descending trend as we continue to bump up against this floor? So there's one other effect to be aware of from a broader technical analysis perspective. Is as we have descending channels like this, the more times that the stock will break out of the descending channel, the less strong that general direction becomes. And obviously we move in favor of a consolidation. So it's broken out of the descending channel once, and it's essentially going to have to make a choice on it sometime next week again. So next week will be, I think, an important, an important week. Now, if it does, again, start breaking to the downside, is anybody's game really is. It's really hard to tell because what I can tell you is that there is nobody transacting in here. I have a hard time thinking that the stock would traverse this entire space. It just seems unlikely to me, but just because it seems unlikely doesn't mean it's not doable or not possible. So I would rate that as possible, seemingly unlikely. Now from an options perspective, let me move you guys over here. I think we have, yeah, there we go. So this is the latest coverage strangle update. And funny enough, I think right after Wednesday, what was Wednesday, the 29th, right? Yeah, the 29th. So that I was thinking that the humor of it, because right after the 29th, I hadn't made",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 50,
      "start_timestamp": "00:16:43",
      "start_timestamp_seconds": 1003.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=1003"
    }
  },
  {
    "text": "think we have, yeah, there we go. So this is the latest coverage strangle update. And funny enough, I think right after Wednesday, what was Wednesday, the 29th, right? Yeah, the 29th. So that I was thinking that the humor of it, because right after the 29th, I hadn't made any changes whatsoever in the position. And then, you know, as fate would have it literally the day after I ended up making changes to the position. And that's just from managing the trade as it sits. So I won't belabor anything in here. You guys can all see kind of what's going on. The main notes to take away is I did add a little bit of shares. And I adjusted the short puts and the short calls. None of them were in the money. They all came down at a profit. That's a, yeah, this is still a profit. It's just the coloring on this is wrong for whatever reason. So that's, that's all there is to this one. So right now the game stop position in the, this part of the portfolio is 250 shares at 2821. So we're utilizing 19,500 bucks. Only 28 of that is in the stock. 50 of that is in cash secured puts. That is by design. The reason why I'm doing that is because of this. This is going down. Don't want to buy shares right now. I want to wait until it starts to level off. Now the reason why",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 50,
      "start_timestamp": "00:18:04",
      "start_timestamp_seconds": 1084.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=1084"
    }
  },
  {
    "text": "in the stock. 50 of that is in cash secured puts. That is by design. The reason why I'm doing that is because of this. This is going down. Don't want to buy shares right now. I want to wait until it starts to level off. Now the reason why I had bought shares on the 30th is because it looked like after this breakdown day on the 29th when it broke out of this consolidation. Or I'm sorry, out of the downtrend into consolidation. And it gapped up a little bit, started showing strength. It looked like we were going to start appreciating. But also notice how little I bought about 50 shares. And that's just like a prospecting position. The reason why is because the overall stock component of the trade was too light for what I wanted. But I also am, I don't want to call it smart enough because I'm really not that smart. But I'm experienced enough at this point to know that entering too aggressively at that point, meaning here, when the stock was up at, I'll show you, when the stock was up here is, I know better. And the reason why I know better is because I know that that's a very tentative spot for a stock. After it just comes out of a downside consolidation, it's not yet broke up above local highs. So it's a prospecting position. It's putting on a little bit of a trade to build up the",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 50,
      "start_timestamp": "00:19:14",
      "start_timestamp_seconds": 1154.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=1154"
    }
  },
  {
    "text": "know better is because I know that that's a very tentative spot for a stock. After it just comes out of a downside consolidation, it's not yet broke up above local highs. So it's a prospecting position. It's putting on a little bit of a trade to build up the stock position just a little bit. But there's a reason why I prefer to remain primarily in the short puts. The reason why I'm remaining in the short puts is twofold. The first one is because I have a much better basis that I can work off of. So if these continue to go unassigned, what I will do is start to split this and I'll trade something like a six lot. I will have three lots further out, 30 delta, something like that. And then I'll have three lots that are actually closer to spot price to start trying to pick up some more shares. The stock needs to consolidate before I do that. Buying stock as it's going down is not good business for a trader. Now I emphasize that point heavily because from an investor's perspective, it's kind of whatever you want it to be, right? But from a trader's perspective, it's not. From a trader's perspective, I'm here to make money. So that's why the positioning is the way it is. The other reason, the second reason, as I told you, there's two for this is because volatility right now is still high on the put",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 50,
      "start_timestamp": "00:20:27",
      "start_timestamp_seconds": 1227.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=1227"
    }
  },
  {
    "text": "from a trader's perspective, it's not. From a trader's perspective, I'm here to make money. So that's why the positioning is the way it is. The other reason, the second reason, as I told you, there's two for this is because volatility right now is still high on the put side. And the reason why volatility is high on the put side is because of the drop. As stocks tend to drop, you will typically see an expansion in put side volatility because people will be buying puts to hedge to the downside. So I am selling them that risk. And I'm taking the risk on for them essentially because I don't mind holding the stock obviously, but I'm going to collect a premium in excess of what the otherwise normalized volatility should be on these puts. So all of that word stuff comes down to these are relatively expensive for what they are. So I sold them. It sums it up. Okay. So now let's take a look at the options chain. And we have a bit of an offload on the call side. So we're at 513 against 165. So still really heavy calls you, but also quite a bit lighter than what it was before on a relative basis from a volume perspective. There was a lot of volume being pushed out into this next front expiration. So if we take a quick peek at open interest, and then if we take a quick peek at this",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 50,
      "start_timestamp": "00:21:34",
      "start_timestamp_seconds": 1294.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=1294"
    }
  },
  {
    "text": "a bit lighter than what it was before on a relative basis from a volume perspective. There was a lot of volume being pushed out into this next front expiration. So if we take a quick peek at open interest, and then if we take a quick peek at this upcoming week, it's 7,000,000 calls against 12,000 puts. So heavy, but not crazy. The next biggest expiration still is 21 feb. And then anything close to that, not really. Yeah, not really. The only other two is the March and the April. Oh no, I'm sorry. Was it April and June? Yeah, April and June my bad. April and June are both over 100,000. The other one is just 21 feb. So quiet, that's all that boils down to. The option chain isn't exceedingly busy right now. So that's that. All right, so what I want to do now before we get into the DD library and all that is I actually want to poke through. I'm sure it'll be on X somewhere, but I just want to look up Ryan Cohen and the change that he made so that we can do a little bit of homework. Ryan Cohen. I'm sure that there will be no. OK, so let's just look through this together and see what this is. So this looks like somebody thinks the move. Also, it is real out of Sonia got knocked the fuck out in case you guys didn't know. And then he got",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 50,
      "start_timestamp": "00:22:43",
      "start_timestamp_seconds": 1363.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=1363"
    }
  },
  {
    "text": "I'm sure that there will be no. OK, so let's just look through this together and see what this is. So this looks like somebody thinks the move. Also, it is real out of Sonia got knocked the fuck out in case you guys didn't know. And then he got upset and he was like pissed off again for the stoppage. And it's just surprising at this point, because it's like, dude, just don't. If you stop getting knocked down, then they're less inclined to stop the fight. But you're in these like super compromised positions. Anyways, I still respect a ton of respect for Izzy, by the way, he's a fantastic striker. But yeah, you got knocked the fuck out. So this leads me to believe that people think by making the switch, it now means they're going to have to deliver the shares. This is hilarious, by the way. Now, OK, here's the next. Why do we think this? This is, this really infuses me. So why do we think that they're struggling to find the 36 million shares given the recent offerings? I don't understand that. I don't think the shares are really that scarce anymore. I'm just trying to see if there's anything else. A merger and acquisition. Move 36 million GMI shares to Canada making them no longer available to US short sellers. Is that just struggle? You struggle with the theory. Let's see, first I'm going to ask Chatcha BT. I'm going to use",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 50,
      "start_timestamp": "00:24:04",
      "start_timestamp_seconds": 1444.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=1444"
    }
  },
  {
    "text": "just trying to see if there's anything else. A merger and acquisition. Move 36 million GMI shares to Canada making them no longer available to US short sellers. Is that just struggle? You struggle with the theory. Let's see, first I'm going to ask Chatcha BT. I'm going to use the new model. I'm going to use the. 03. Yeah, let's do. So we use 0 1 or 03. I'll try it. Oh, one, because I think that's the deeper one. So let's let's do some prompt engineering here. Why did Ryan Cohen transfer? His GMI shares from what was the original. I'm going to move this chat so I can ask you guys questions. What was the original location of the entity that he held him? Was it Delaware meaning US based? Is that correct? And then I'm going to ask Chatcha BT. Why did Ryan Cohen transfer his GMI shares from US based entity? And then did he do it into his personal name? Or I think it was. Delaware. X axis. Okay, cool. Thank you. There was somebody that has the documentation into his personal name. Yeah, okay, here we go. That out to Kevin. Also, it seems like people have mixed opinion on Kevin. I've talked to him a couple times. I was actually going to connect with him again. But I don't know the. Yeah, okay. So it's from RC ventures in Delaware. Okay. From his entity RC ventures based out of Delaware. Into his",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 50,
      "start_timestamp": "00:25:57",
      "start_timestamp_seconds": 1557.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=1557"
    }
  },
  {
    "text": "seems like people have mixed opinion on Kevin. I've talked to him a couple times. I was actually going to connect with him again. But I don't know the. Yeah, okay. So it's from RC ventures in Delaware. Okay. From his entity RC ventures based out of Delaware. Into his personal name. Where this where he is a Canadian citizen. First, let's see that. I'm not giving it all the Xs details of GameStop being like a really heavily shorted stock. And you know, all the ideas. So let's. While that's reasoning through that, let's talk about it, right? Like let's let's reason through it. So. X axis. Do you think Cohen converted shares due to his divorce? I don't think. I don't think so because. In the divorce. I didn't know he's going through divorce and I actually have no idea where he would be. Is he well, first, yeah, actually, coffee and donuts. Ask a great question. I just kind of took it as truth since somebody brought it up. But like, is he getting divorced? Do we know that? I think that's a. Then it's a good starting point, actually. Okay. Well, anyways, whether he is or isn't anything beyond that. I mean, we could look it up, but. I don't think. I don't think there's any ish with that because if he puts it in his personal name, I feel like. That just makes him more susceptible than anything. Lawrence says I'm not sure in some",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 50,
      "start_timestamp": "00:28:07",
      "start_timestamp_seconds": 1687.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=1687"
    }
  },
  {
    "text": "isn't anything beyond that. I mean, we could look it up, but. I don't think. I don't think there's any ish with that because if he puts it in his personal name, I feel like. That just makes him more susceptible than anything. Lawrence says I'm not sure in some universities, great guy, but he can suck a D. Oh, interesting. I didn't know that is did he do something. You guys obviously know I don't know anything about most of this stuff. So I'm learning. But yeah, I'm curious why the why the disposition. I was also learning there is that dude from the documentary we were watching. One of those attorneys and somebody was saying that like he was. Just kind of. Scrowing people over, which is also really interesting. A coffee says isn't Florida state to hide your money of getting divorced can grip and move there. Well, they probably moved there for taxes. The most people go to Florida for the tax treatment Delaware is actually a really, really friendly, well, privacy friendly state to come up with and to base your entities out of. So a lot of people will use Delaware for that reason. But for people moving to Florida, the majority is for tax and to try to offload some of their tax burden, which. Can blame them. Shit's expensive. Gab says it wasn't west who screwed over people it was people pretending to raise funds to higher west see that that's what",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 50,
      "start_timestamp": "00:30:04",
      "start_timestamp_seconds": 1804.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=1804"
    }
  },
  {
    "text": "But for people moving to Florida, the majority is for tax and to try to offload some of their tax burden, which. Can blame them. Shit's expensive. Gab says it wasn't west who screwed over people it was people pretending to raise funds to higher west see that that's what I'm talking about. There's always so much fucking shit behind all of these. And. I'm a natural skeptic not because I don't trust people actually as you could tell by the divorce comment actually inherently trust people, but I still like to see source information. So yeah, the thing about that lawyer kind of makes sense. I don't know what's true or not because I haven't seen anything, but I'm just curious. Lauren says he just strikes me as a super douche brutal. That's a I don't even want to know how I come off to people. I can I can only imagine the kind of if there's other permutations of douche, Lauren probably has because I also draw Lauren with these gargantuan giraffe legs, which I just have to imagine puts me in the fucking in the shit column. So yeah, I don't even want to fucking know. Mashin says the divorce thing is fun. Wife's name is wrong. Okay, got it. Yeah, regardless of all that honestly, it doesn't really matters because if you put stuff in your personal name going through anything like that, you're at it's a bigger risk than having it in an entity. So",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 50,
      "start_timestamp": "00:31:21",
      "start_timestamp_seconds": 1881.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=1881"
    }
  },
  {
    "text": "says the divorce thing is fun. Wife's name is wrong. Okay, got it. Yeah, regardless of all that honestly, it doesn't really matters because if you put stuff in your personal name going through anything like that, you're at it's a bigger risk than having it in an entity. So yeah, I mean, decoupling the two speaking in generalities. Yeah, it wouldn't make sense for that perspective. All right, let's see what GPT01 says. Okay. It says the shift could involve tax regulatory or compliance or something else entirely. They might involve personal control voting rights tax planning regulatory issues or organizational restructuring speculation on a strategy or future plans could be a factor to. He may have transferred the shares for personal tax or corporate structure reasons preparing for a Canadian move. Is he is in a already in Canada? I don't know. Organizational changes speculation is abundant, but no official statement exists. Collins SEC form for details could hint at a personal preference reorganizing to avoid LLC maintenance. I can't imagine that. Collins reasons for transferring shares could involve tax exposure reduction preparation for a corporate action. Like, ah, interesting. This one actually is slightly interesting. So Cohen's reasons for transferring shares could involve tax exposure reduction, which I can't imagine that being the case because LLCs are passed through entities anyways. So I, yeah, just I don't think that's going to help them and the difference between having it in an LLC or not. I don't think",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 50,
      "start_timestamp": "00:32:52",
      "start_timestamp_seconds": 1972.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=1972"
    }
  },
  {
    "text": "reasons for transferring shares could involve tax exposure reduction, which I can't imagine that being the case because LLCs are passed through entities anyways. So I, yeah, just I don't think that's going to help them and the difference between having it in an LLC or not. I don't think there's a big change there, but listen to the other part of this preparation for corporate action like a take over or spin off. We have to ask more about that one because I don't know the, I don't know how that works, but I want to know. Without knowing him, the transfer shares seems likely due to personal financial gains, the state planning or preparation for a corporate transaction or reorganization. Alright, so let's explain that. And you expand on the transfer and relation. So let's see why that might be. And it says it could be from emanates easier if it's in your personal name for some reason. I don't know if that's true to be honest. Because again, depending on who, who and what holds RC ventures LLC, which I imagine would be RC maybe somebody else of his choosing you don't it can just be you. So from that perspective, it's the same. It's essentially the same as you because he would be the manager for the LC, which essentially would control the actions of it. So I don't think that's true. So let's see what GPT says. Activist investment vehicle, verse direct ownership, purpose of",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 50,
      "start_timestamp": "00:34:16",
      "start_timestamp_seconds": 2056.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=2056"
    }
  },
  {
    "text": "So from that perspective, it's the same. It's essentially the same as you because he would be the manager for the LC, which essentially would control the actions of it. So I don't think that's true. So let's see what GPT says. Activist investment vehicle, verse direct ownership, purpose of RC ventures, activist investors or major see this is cool because this is a brand new fresh blank chat with chat GPT01. And it's already doing research on him in the background through the reasoning function and it's talking about the activist investor side of it, which is interesting. But it says actress investors or major shareholders often set up special purpose LLCs are holding companies like RC ventures to accumulate shares and target company. Now, you can help manage risk isolate liabilities consolidate funding for multiple partners that are once Ryan Cohen became more formally involved with GameStop joined the board became chairman influence corporate strategy also interesting. I didn't tell GPT any of that. I'm highlighting that there's actually some pretty good accuracies in this reasoning because normally I don't trust it. It may no longer have been necessary or cost effective to maintain a separate holding vehicle solely for GM. He shares not that expensive to maintain an LLC. So I don't think that's that because the dudes also super fucking rich. You may have planned to use RC ventures for other investments or wind it down after fulfilling its initial purpose in an activist campaign. I",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 50,
      "start_timestamp": "00:35:53",
      "start_timestamp_seconds": 2153.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=2153"
    }
  },
  {
    "text": "solely for GM. He shares not that expensive to maintain an LLC. So I don't think that's that because the dudes also super fucking rich. You may have planned to use RC ventures for other investments or wind it down after fulfilling its initial purpose in an activist campaign. I doubt that. If I'm not mistaken, RC ventures probably been around for a while. I don't know that either, but I'm just speculating. Direct ownership can appear more transparent from the perspective of other shareholders in the market at large. This is funny reinforcing Cohen's commitment to GameStop's turnaround. So this already did all the research on fucking GameStop. And the context and it's bringing all of those elements into this response, which is really impressive to me. As chairman Cohen is subject to ongoing disclosure obligations, sometimes having shares in a personal account makes reporting a compliance more straight forward. Then holding them through layers of an LLCs that could be that could be a thing. Corporations often prefer direct ownership with the principal shareholder rather than intermediate entity can simplify communications about voting and stuff maybe, but since he's so involved, I doubt it. When Cohen was purely an activist investor, it made sense to aggregate shares and a holding LLC that could lead a proxy fight of necessary after securing board representation and stepping into the chairman role. Some of the original legacy for holding the shares and RC ventures may no longer be needed. So I",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 50,
      "start_timestamp": "00:37:21",
      "start_timestamp_seconds": 2241.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=2241"
    }
  },
  {
    "text": "an activist investor, it made sense to aggregate shares and a holding LLC that could lead a proxy fight of necessary after securing board representation and stepping into the chairman role. Some of the original legacy for holding the shares and RC ventures may no longer be needed. So I think chat to be seems to continually lean towards this efficiency concept. And I actually don't think it's about like decreasing administrative overhead. I just don't see that because he's more than capable of doing it and he has this stuff in place. Okay, here we go. The tax conversation. Canadianverse US tax rules since Cohen is Canadian, the interplay of US corporate tax law, state Delaware and Canadian tax law can get complicated. Depending on his personal tax planning, it might be more favorable to hold GM, GM, GM share directly rather than through a US LLC. So it could be something between the interplay between Canadian citizen ship and the domestic holding. Does Cohen have kids is Ryan Cohen of kids? Do you guys know. A coffee says safer to have shares in Canada if the market crashes. I don't think so. It's the shares would be on the same exchanges. It'd be what it would be. Do you guys know if he has kids? Another thing that I don't know. Brad says I think to okay, so we don't know. Let me look. Does Ryan Cohen have babies? Little humans. This says no, he doesn't have any",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 50,
      "start_timestamp": "00:38:48",
      "start_timestamp_seconds": 2328.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=2328"
    }
  },
  {
    "text": "the same exchanges. It'd be what it would be. Do you guys know if he has kids? Another thing that I don't know. Brad says I think to okay, so we don't know. Let me look. Does Ryan Cohen have babies? Little humans. This says no, he doesn't have any children. This says they have a son. This says they have two kids. This says there's no kids. Okay, well, the key takeaway is that he may or may not have kids. Anyways, this like this, I would assume that would be his kid, but I don't fucking know that could be a I generated. I don't know his family. Anyways, the reason I'm asking is because it says that there could be an estate planning component to it. So anyways, after going through like even this general overview with. Even go through this general overview with GPT01. It doesn't look like there's like some sort of clear thing we can point that that Lauren says I'm glad his kids can't be Googled for real though. Yeah, that is it's better for them for sure. So I guess the the way to think about it here is there's no since there's no definitive answer. It's unlikely that it's like for this very hyper specific reason that people can cleanly point towards now. Let's ask it the other question though. So when Cohen when RC moved his shares does that force. I want to see the exact terms people are using.",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 50,
      "start_timestamp": "00:39:53",
      "start_timestamp_seconds": 2393.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=2393"
    }
  },
  {
    "text": "there's no definitive answer. It's unlikely that it's like for this very hyper specific reason that people can cleanly point towards now. Let's ask it the other question though. So when Cohen when RC moved his shares does that force. I want to see the exact terms people are using. So this is divorce. I don't think that's correct. Believe in it doesn't matter. Yeah, so this is exactly what's happening right now. What is this say that's nothing. Yeah, we already did this. Let's just see if we can figure out. Let's just see if we can figure out does that force. The corresponding. To be located and delivered. Could this cause some sort of sort of squeeze. Or is there enough availability of shares. That this might not be an issue. And general when an investor transfer shares from one account to another to from an L. C. to the personal name. It does not automatically force a broker. Anyone else to locate and deliver shares in a way that would trigger short squeeze. The move typically happens at an internal book entry at the brokerage or custodian level. The meaning the shares are re registered under the new owner. So you do not necessarily need to be pulled from the market. Yeah. So. And that's I mean from my broader perspective anyways, even putting the idea of whether the shares move decide. Looking at it from the function of share availability. There's now right there's 446,800 shares",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 50,
      "start_timestamp": "00:42:10",
      "start_timestamp_seconds": 2530.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=2530"
    }
  },
  {
    "text": "new owner. So you do not necessarily need to be pulled from the market. Yeah. So. And that's I mean from my broader perspective anyways, even putting the idea of whether the shares move decide. Looking at it from the function of share availability. There's now right there's 446,800 shares they just did two offering. So I'm really not sure that. With the two recent offerings that the shares are going to be that that hard to find. And we've looked at information like. What are the days to cover we can look at that really quick just at a curiosity this one I this one I honestly don't trust because it's typically all over the place. But let's just take a look at you me. For interest. Normally used Fintel. So this is actually highest fuck I'm not even going to lie. Nine and a half days to cover is crazy work at only 7.7. What the fuck. Does it make any sense. 4.5. Let's do a little math real quick. So 4 million five like we have to look at the average I don't want to look at that. What is this. 32 138 again this one again like this number. I fully would expect to be not trustworthy. But this would be number. Number short shares. And then let's take a look at a couple different scenarios. This will be five. I know what the number five looks like five day average volume. What the fuck Eric",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 50,
      "start_timestamp": "00:44:35",
      "start_timestamp_seconds": 2675.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=2675"
    }
  },
  {
    "text": "like this number. I fully would expect to be not trustworthy. But this would be number. Number short shares. And then let's take a look at a couple different scenarios. This will be five. I know what the number five looks like five day average volume. What the fuck Eric spell right you fucking buffoon. Is the keyboard slightly off. 20 day. And then we have the average volume. Naryl one. These to cover. Naryl two days to cover. Let's see. What was that. Five days is. It was called 3.9 mil. And then 6.7.6. 6.7.6. So it's something between. Again, 4.2. 4.8. Yeah, cuz this just looks high. It's such a short. Such a short flow in total short interest of 32 mil. Because the other thing is. Volume is absolutely. quite a lot. Amechens says hypothetically could he use his shares for a loan to buy something? Would it need to be on a razon name? It wouldn't. So you can take out margin loans against your assets as long as you're tied to the assets. So it doesn't have to be in your name. It's a great, great guess. But yeah, I don't think that's it either. So this is what right now. Days to cover would look like, which this is a little more in line with what I would expect to be honest. Yeah, this is 2.9 days to cover. 32 140. 32 140. What is this reporting? That's close enough. Let's just see if",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 50,
      "start_timestamp": "00:46:29",
      "start_timestamp_seconds": 2789.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=2789"
    }
  },
  {
    "text": "So this is what right now. Days to cover would look like, which this is a little more in line with what I would expect to be honest. Yeah, this is 2.9 days to cover. 32 140. 32 140. What is this reporting? That's close enough. Let's just see if we can find more. Because these other ones are probably using a longer term. Yeah, yeah, yeah, yeah. See, this looks right to me. 3.7. Most of these. So for those that don't know what I'm doing. To figure out the days to cover. All you do is take the average volume or for whatever period you're interested in. And then you can see that. The total number of short shares by that volume and the idea is. At current steady state volume. This is how many days it would take to cover. Here's the reality of things though is that there's actually a scenario 3. And this is what I would consider to be a more accurate. Depiction of the current state volume. And this is what I would consider to be. More accurate. Depiction of this. Is. And by scenario 2, I obviously mean scenario 3. The more accurate depiction of this would be like. Surge average volume. What I mean by surge average volume is we can clearly see that there are periods where volume really starts to pick up heavy. And this is during periods when short covering starts to jack up. Right. So you can",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 50,
      "start_timestamp": "00:49:14",
      "start_timestamp_seconds": 2954.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=2954"
    }
  },
  {
    "text": "accurate depiction of this would be like. Surge average volume. What I mean by surge average volume is we can clearly see that there are periods where volume really starts to pick up heavy. And this is during periods when short covering starts to jack up. Right. So you can see that the stock can handle much more average volume. So if we go here, the five day average volume is 139 against 46.7. So let's just take the midpoint 139 million. 46.7. 46.7. The average between those is 92.850. 92.50. So then if we do the math. Using that surge volume. It's like three days. So the main point here is that the stock can absolutely handle pretty significant expansion and volume. So this all of this is to go back to the idea and the current my current hypothesis is just that. It doesn't look like the conditions for a short squeeze are massive right now. There's not a lot of delta that's sitting out at dangerous levels. Well, what the fuck happened in the chat? Yo, I'd rather be skiing first off. Thank you so much for hooking some people up with a nice good old fashioned. All right, trading membership. It helps support the channel. Thank you so much. And let's take a quick look at. Game stop. And we want to take a look at gecks. Let's see. So we can see, I mean, most of it's around spot and then there's a little bit",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 50,
      "start_timestamp": "00:50:51",
      "start_timestamp_seconds": 3051.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=3051"
    }
  },
  {
    "text": "All right, trading membership. It helps support the channel. Thank you so much. And let's take a quick look at. Game stop. And we want to take a look at gecks. Let's see. So we can see, I mean, most of it's around spot and then there's a little bit elevated up here to the long side, but most of the outstanding gecks right now, game exposure is actually negative on gamma, which is actually kind of kind of good. But yeah. I'm seeing if chat you be tears at any other ideas about this calling thing. Yeah. Nothing. Okay. Mark says, red show 13 F2 just came into play last month. Time will tell if anyone complies, but it does know non reporting issuers without specifying who they are. Well, let's explore that a little bit more. Let's take a look at. I'm going to chat you PT talk to me about it. Teach me about. Reg show 13 F dash two. Let's see what it says. I went back into the a one. Okay. So let's see. The. The new 13 F2 would effectively introduce a parallel reporting framework for short positions. Okay. So there's been no equivalent for short position disclosure. Now there is monthly discosers to SEC institutional managers meeting certain thresholds would. Report short positions and certain short selling activity monthly on a new form. The position level data would be submitted confidentially to the SEC not immediately disclosed to the public at the manager",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 50,
      "start_timestamp": "00:52:37",
      "start_timestamp_seconds": 3157.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=3157"
    }
  },
  {
    "text": "for short position disclosure. Now there is monthly discosers to SEC institutional managers meeting certain thresholds would. Report short positions and certain short selling activity monthly on a new form. The position level data would be submitted confidentially to the SEC not immediately disclosed to the public at the manager level aggregate public disclosure after a time delay the SEC would publish aggregated short sale data by issuer. But without revealing the identity of each manager specific position that's good. They should do that. Fresh holds the proposal included specific thresholds to determine which managers have to file. Typically it targets managers ready subject to 13 F reporting so 100 million plus and 13 F securities. Okay. So now let's see what happens. If they don't do it. What are the penalties. If the entity doesn't comply and disclose. Let's see. Civil enforcement actions is probably just fucking fines man. Yeah, it looks like the main thing is they're talking about. The fines. R Us says and who are the non reporting entities it looks like non reporting and well let me ask. What would be considered the non reporting entity. My expectation is what we talked about funds that aren't over that threshold of 100 mil. Non so private companies. So a company that has not registered investment managers below the thresholds entities not subject to exchange act regulation or SEC requirements so they wouldn't comply with anything else. So this. Russ. And mark it looks like the non",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 50,
      "start_timestamp": "00:55:14",
      "start_timestamp_seconds": 3314.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=3314"
    }
  },
  {
    "text": "aren't over that threshold of 100 mil. Non so private companies. So a company that has not registered investment managers below the thresholds entities not subject to exchange act regulation or SEC requirements so they wouldn't comply with anything else. So this. Russ. And mark it looks like the non issuing and to or the non reporting entities would be what we would think meaning the people that don't meet. The disclosure requirement thresholds which I mean to me that makes sense. To denote them is non. Non reporting entities. That's what it looks like. Cool. Now that we're literally an hour in we have like 15 minutes left. And then we'll just talk about the data. And then we'll just talk about the data. So I'm not going to be a lot of time to analyze this by the way really, really enjoyed that. But let's now get into. Actually analyzing. The D.D. I just got a update our timestamps. I've been. I thought that. We'll call it five minutes. This was the kick off. And then we got into game stop analysis. We're going to see. And then now we're at 59 30. We're now getting into. The analysis. And then we're back to Lucy. Who I did reach out to. I think that. Russ says. As. J.H.P.T. if they're exempt from. Well, yeah, the reason why market makers would be exempt from it, that makes sense is because again, the short shares that a market maker would",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 50,
      "start_timestamp": "00:57:23",
      "start_timestamp_seconds": 3443.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=3443"
    }
  },
  {
    "text": "analysis. And then we're back to Lucy. Who I did reach out to. I think that. Russ says. As. J.H.P.T. if they're exempt from. Well, yeah, the reason why market makers would be exempt from it, that makes sense is because again, the short shares that a market maker would hold. From a theoretical perspective. But it's not to take a directional bet on the stock. If we think of. The entities that are trying to push price down. It's typically institutions that then are in collusion with other supporting entities. But it's external entities because as always, market makers are going to be slaved to order flow. What order flow is they have to make markets. And then the other positions conceivably that they maintain. Then therefore would be not out of a directional bias. But out of managing inventory. So. Yeah, I actually don't think that there's a big issue with them doing that. I think the big issue with market makers is the the game that they play with kicking the can around that I think is bullshit. But that's because they're trying to avoid going out and actually buying shares when shares were scarce. So certain that that's is big of a deal is much now. Anyways, thankfully. All right. So we were going through this AMA with Lucy. We had done a bunch of work and then we came across. We came across a lot of research. But specifically that documentary was really cool. We're",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 50,
      "start_timestamp": "00:59:31",
      "start_timestamp_seconds": 3571.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=3571"
    }
  },
  {
    "text": "that that's is big of a deal is much now. Anyways, thankfully. All right. So we were going through this AMA with Lucy. We had done a bunch of work and then we came across. We came across a lot of research. But specifically that documentary was really cool. We're looking at that quite a lot. That's another one that I 100 would love. To continue poking through with you all at some point. But that part of side. Let's finish getting through Lucy's stuff here. I may get our dinner order. Out of here. So that we can stuff our faces. Gab says, what if their hedge fund has a directional bias? Well, that starts to open the pure conflict of interest. But even if their hedge fund has a directional bias, they still are they still are slave to order flow. They can't stop taking order flow because they actually have a requirement to keep their quote machines on. Otherwise, they start to lose different classification and designations. So there is to be clear a massive conflict of interest. I'm not an advocate at all of Citadel having a hedge fund arm and market making arm. Like I think that that's incestuous. However, that being said, it's not like the Citadel market makers can just again like move the price wherever they want it to be because Citadel as an institution might have a specific position in GameStop. They still are overall slaved to broader order flow. There",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 50,
      "start_timestamp": "01:00:59",
      "start_timestamp_seconds": 3659.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=3659"
    }
  },
  {
    "text": "think that that's incestuous. However, that being said, it's not like the Citadel market makers can just again like move the price wherever they want it to be because Citadel as an institution might have a specific position in GameStop. They still are overall slaved to broader order flow. There can be interplay there and I bet you I would completely feel confident betting you that there is and as you all know, I'm not here to spread hyper fodder anything. My goal when I do stuff like this and when I interact with markets is just to look at stuff as objectively as I humanly can. And that's the reality as far as I can see it there. So interplay yes, but total control or something like that. I did. So let's continue now with where Lucy left off. So we're talking about. Okay, so there's a couple more questions. Let's see. In whose interest is it to not have a fair and equitable system. I mean, that's a kind of straightforward question, right? Like whoever stands to benefit, but. It's in the interest of big broker dealers and hedge funds. Which makes sense, right? Cause they they absolutely stand to benefit from it. So I don't think that's any sort of shocking take. I think that makes sense. Mostly given a pass by SEC and other exchanges. Sometimes they get a slap on the wrist, which we've seen slap on the wrist is very common in the slap",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 50,
      "start_timestamp": "01:02:33",
      "start_timestamp_seconds": 3753.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=3753"
    }
  },
  {
    "text": "stand to benefit from it. So I don't think that's any sort of shocking take. I think that makes sense. Mostly given a pass by SEC and other exchanges. Sometimes they get a slap on the wrist, which we've seen slap on the wrist is very common in the slap on the wrist as a joke. It is like these really, really trivial. Finds that are a complete joke relative to the size of the companies. Yep, here you go. Okay. So what's the next question? Just speaking out on topics that involve high profile corruption ever make you fearful. I honestly don't really care about that one. What's this one? Any data or disclosures you've been keeping an eye on to this person runs the data site. Always curious to hear information others find interesting. Okay. So she's just talking about where she gets her information. Jesus, that's a hilarious name. Yeah, so I'm not going to pronounce the name, but this person has said what are the best tools to determine how many shares there are in circulation. That's really this is a great question. It seems that most people thin run nose DTCC they clear shares except they don't clear what goes off clearing, which is through the dark pools off clearing means not through regular clearing house. And where a lot of the dirty stuff goes on DTCC subsidiary subsidiary is the vault that actually holds all the shares stocks people do not have their own",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 50,
      "start_timestamp": "01:04:01",
      "start_timestamp_seconds": 3841.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=3841"
    }
  },
  {
    "text": "they don't clear what goes off clearing, which is through the dark pools off clearing means not through regular clearing house. And where a lot of the dirty stuff goes on DTCC subsidiary subsidiary is the vault that actually holds all the shares stocks people do not have their own shares. Yep, yep, yep. The NSCC do the actual clearing. Nobody, no private person would really know unless you got all the big prime brokers and all the others to do to tell everybody that the shares that they are moving, but I don't think they're okay. Reading your article back in March star struck. Jesus Christ. And especially naked shorting would be effectively prevented. Do you think that's accurate. So they're just talking about the European markets and they're saying that they don't know the problem. The problem with trying to draw the comparison we do this in the states with a lot of stuff and rightfully so it's okay to make comparisons, but the context of the comparisons are really important. Trying to make a comparison between like the US stock market against any any European market or even South Korea. It's you can compare them, but we need to maintain the context. These are tiny, tiny markets. So the entire operation of the markets on a relative basis is just it's completely different. It's not even close. It's completely different. So thrilled you mentioned South Korea because it's interesting. You're a group of retail. They've referred to",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 50,
      "start_timestamp": "01:05:35",
      "start_timestamp_seconds": 3935.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=3935"
    }
  },
  {
    "text": "need to maintain the context. These are tiny, tiny markets. So the entire operation of the markets on a relative basis is just it's completely different. It's not even close. It's completely different. So thrilled you mentioned South Korea because it's interesting. You're a group of retail. They've referred to themselves as ants. Okay. Okay. Have you ever been threatened. Don't care. I don't really care about that. What's your message to the naked short sellers. Well, to the community. Keep doing what you're doing. Looks like Lucy's doing a book. Okay. All right. If reddit goes down pivotal moment, they're talking about where to find people. Yo, first of all, fucking shout out to you all. We literally just got through over 800 pages of due diligence. So we just completed the diamond handbook. Which is literally over 800 pages. Now this is not obviously the end of the road for us because now we have the next. The next series of stuff we need to start looking through, which I will grab. Where is it at? This. And we were going through this in order of date. So we had left off. We got through all these. This is where we got to. That's hilarious. So of this whole list of things. We are. We're here because little do we know one of the things is 800 plus pages here. So next up will be this and down. Down the page will go. We're literally going to go",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 50,
      "start_timestamp": "01:06:57",
      "start_timestamp_seconds": 4017.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=4017"
    }
  },
  {
    "text": "is where we got to. That's hilarious. So of this whole list of things. We are. We're here because little do we know one of the things is 800 plus pages here. So next up will be this and down. Down the page will go. We're literally going to go through all of it starting from the beginning. But very, very cool. So far we got to go through like the the comic style versions, which I enjoyed. There's a lot. The diamond handbook was really informative to me. There are a lot of components to the diamond handbook that I have to say felt. Not. Ultimate. Not super well founded. And that's not to besmirch what's in there because we have to postulate things in order to conceptualize what an answer might be. But of the things that did have rock solid citations. I mean, the re there's really, really good research in there. Maybe we could do a video down the line of like the best research out of the diamond handbook because there were a couple in there. I still have notes on them that really stuck out to me. And I learned like an exceptional amount from. So I'm really stoked actually to continue going through the rest of these. I'm going to click this next one just because I honestly can't help myself. So this one's now 60 pages over these. Jesus. Who is who's this guy that they decided to start meaming the shit",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 50,
      "start_timestamp": "01:08:58",
      "start_timestamp_seconds": 4138.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=4138"
    }
  },
  {
    "text": "from. So I'm really stoked actually to continue going through the rest of these. I'm going to click this next one just because I honestly can't help myself. So this one's now 60 pages over these. Jesus. Who is who's this guy that they decided to start meaming the shit out of. This is absurd. Oh. What the fuck? Right dude. This is fucking hilarious. Alright, I really enjoyed that. Big fan of Mr. Furnow collection shout out to Mr. Furnow. Make sure you guys go check out some of Mr. Furnow's work. We have to figure out how to like effectively figure out where we left off. Bigger short. So what is this? It'll be on three. We have five. Leave off. This third column. Fifth. Third row. Fifth. We got our coordinates for the next one. So you guys want to hit talk about before we wrap up. I'm not in a big rush. I have a couple minutes. If there's anything that you want to want to dive into. If you guys are curious about the positions that I'm managing and how I'm doing that. That's a big thing that I'm trying to make sure I'm sharing with you all. My goal is literally to try to teach other people how to do some of this. Because I think something like the coverage triangle is really probably one of the best possible ways. To try to stop holders to trade GameStop and to trade around their holding",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 50,
      "start_timestamp": "01:10:15",
      "start_timestamp_seconds": 4215.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=4215"
    }
  },
  {
    "text": "with you all. My goal is literally to try to teach other people how to do some of this. Because I think something like the coverage triangle is really probably one of the best possible ways. To try to stop holders to trade GameStop and to trade around their holding positions. That's the broader idea behind that. Ressus Tse was on your radar. Citadel really opening their own exchange with BlackRock. For me, no, I mean, that's, that's nothing that's like significantly. Follow worthy for me. Now the Tse fly for those that is significant for me. I mean, in Africa, you have to be real careful about this bastard. Because they have this disease that they carry that makes you all fucked up. If they, if they bite you. I forgot the. Just like a specific name for the. Here you go. And those some my assists the sleeping sickness. Yeah. So when I was, when I was in Africa, it was all eyes for the fucking TTC fly. Anytime something flew new you flew near you immediately like no TTC fly. Stay away from me. We don't want none of that. So Russ TSE not so much on my radar to the TTC fly heavily on my radar. I'm trying not to get bit by one of those bastards. If I can get through my whole life without getting nailed by a TTC fly, that will be a massive win for me. So hope that answers. Russ says",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 50,
      "start_timestamp": "01:12:43",
      "start_timestamp_seconds": 4363.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=4363"
    }
  },
  {
    "text": "my radar to the TTC fly heavily on my radar. I'm trying not to get bit by one of those bastards. If I can get through my whole life without getting nailed by a TTC fly, that will be a massive win for me. So hope that answers. Russ says Texas stock exchange coming soon. Yeah, I think that overall that'll be good to be honest. I like the idea. And I think continued. I really do think continued competitiveness is just good. The more competition we can get in the broader sphere, the better off we are without a doubt. I definitely think that. Well, while I'm here. I'm going to just see if there's anything else I need to do with it. So 78. Here's another thing I wanted to run by you all actually while we're here while we're. Just bullshitting a little bit. I have a slight proposition. The proposition that I have is trying to. Trading 25k for this is honestly pretty annoying. And I would rather trade more. But the original idea was to trade this in a way that is as representative as possible for like the normal person. So. The question is. Is 25 still okay. I already have a slightly will not a slightly. Quite a bit larger of an allocation that I trade in the broader portfolio. Like the coverage strangles that I share with you guys are just a subset essentially of what I trade in the in the",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 50,
      "start_timestamp": "01:14:08",
      "start_timestamp_seconds": 4448.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=4448"
    }
  },
  {
    "text": "Is 25 still okay. I already have a slightly will not a slightly. Quite a bit larger of an allocation that I trade in the broader portfolio. Like the coverage strangles that I share with you guys are just a subset essentially of what I trade in the in the broader portfolio with some differences because of that right. This is naturally a smaller. A smaller position. So it means I can't trade as many contracts. So that'll have different impacts on the total performance of the position. But I'm trying to get a sense from everybody specifically those that hold game stop. Like. And most of you just hold your shares is that correct. And for those that hold your shares. What stops you from trading options around the shares specifically. I'd rather be skiing says holder. Yeah, so it looks. Overall. So far at least like holders. He says I'm not sure if this audience is the standard as far as what. What would you describe that as. Agro crag says freak a leak to tariffs. Pause Jamie downward bone cone. That's actually a really great question to be. And the tariffs are likely to push the whole market down. So I'm still short futures against the broader long delta that I have. Because the near term expectation is downside play probably that's my guess. And it's because there's going to be some short term. There's going to be some short term pain. I think that will come",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 50,
      "start_timestamp": "01:16:03",
      "start_timestamp_seconds": 4563.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=4563"
    }
  },
  {
    "text": "market down. So I'm still short futures against the broader long delta that I have. Because the near term expectation is downside play probably that's my guess. And it's because there's going to be some short term. There's going to be some short term pain. I think that will come from this. So yeah. Brick and the wall says can't roller strangle in a Roth you can. You absolutely can you just have to modify it a little bit. So I trade in an IRA. I actually just finished my back door. Contribution for the year. So definitely. Definitely trade in there, but you can. So you said the standard GM me holders probably not watching YouTube options traders. I'd imagine I see okay. So. That's actually a good point. So for most people because I imagine most people that watch the stream and are part of my community. You guys are kind of like a. A GM hybrid where you have some level of interest in options, but still. So I'm going to go over with game stop. I presume. This is actually I'm actually genuinely curious. So I'm starting a poll. The poll is live. I'm just curious from the perspective of the people that are on here like who is not interested in options at all. Steve says I came here to learn more about options because I was holding for a long time not doing anything with them. So, aha. So then Steve you're like the",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 50,
      "start_timestamp": "01:17:48",
      "start_timestamp_seconds": 4668.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=4668"
    }
  },
  {
    "text": "from the perspective of the people that are on here like who is not interested in options at all. Steve says I came here to learn more about options because I was holding for a long time not doing anything with them. So, aha. So then Steve you're like the perfect the perfect candidate. So then Steve from the perspective of like your your longer term holdings. Are you have you been following along with like the coverage strangle that I'm sharing on game stop. Actually, I think you by the way Steve for the answers because you're literally like the exact person. That I'm trying to help with. Will stretch is I'm just here because only fans is down that is a bummer. So we'll we'll help you out Joe. That's the best I got for you. It's a little cold. So we can do we can do topless but. It is a little chilly. I'm not going to lie. About is there you go. Joe you're welcome. This is for your viewing pleasure. Tips tips are welcome. Joe says shirtless Eric is back. That's right dog. We've been we've been clothed for far too long they try to keep us down anyways where's the video that I was looking for here. A key. So that's the video that talks about the coverage strangle and game stopper at least introduces it for you. So let me see where Joe. First Steve. So Steve back to you. I'm specifically curious",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 50,
      "start_timestamp": "01:19:44",
      "start_timestamp_seconds": 4784.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=4784"
    }
  },
  {
    "text": "keep us down anyways where's the video that I was looking for here. A key. So that's the video that talks about the coverage strangle and game stopper at least introduces it for you. So let me see where Joe. First Steve. So Steve back to you. I'm specifically curious about your understanding with something like the coverage strangle like do you do you kind of get like the the base concepts of what it is and how it can be used. And reason is because I think game stop is probably one of the ideal candidates for somebody like you literally somebody like you specifically. Steve says I wanted to see your perspective on cheating options with game stop because doing it wanted to make sure I was on the right track. Let's talk about that for a second because there's a handful of ways actually that I see. Let's go here. There's literally only a few ways I see is logical of trading options with game stop. So scenario one is trading option or really just buy it home. scenario two, why is this laggy is I would argue ratio covered calls. So this means we have at least one on one shares. And then we sell calls against those shares. But we always maintain upside. scenario three would be wheel. Which equals cash secured puts. Until assigned. Then it's long equity. Plus covered calls. I don't like this one. Next scenario. Is covered strangle. Which equals long",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 50,
      "start_timestamp": "01:21:20",
      "start_timestamp_seconds": 4880.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=4880"
    }
  },
  {
    "text": "least one on one shares. And then we sell calls against those shares. But we always maintain upside. scenario three would be wheel. Which equals cash secured puts. Until assigned. Then it's long equity. Plus covered calls. I don't like this one. Next scenario. Is covered strangle. Which equals long equity. Ratio covered calls. And cash secured puts. Then scenario five. Would be. Long options. This includes both calls and puts. And I guess you could argue you could do a scenario six. And scenario six would just be short puts. Either naked or cash secured. And now the other way that you can trade this scenario seven. Would be. Long. Strattles slash strangle. That's to play the expansion of volatility. So that's just kind of like a rough rundown literally off the top of my head. And then the other way that you can play the game. And then the other way that you can play the game. Different ways to play game stop with options 123. 125 30. 25. 30. Or if you have a set of options. That you'll typically see me trade it. I have this element. The reason why this element exists is because of an agreement that I made also Joe. Brings up a really great scenario. Thank you. I actually didn't think of this one. But scenario eight would be a ratio. diagonal, which I still would not trade personally, but this is a scenario. So, and I'll explain why. So, by and",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 50,
      "start_timestamp": "01:23:16",
      "start_timestamp_seconds": 4996.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=4996"
    }
  },
  {
    "text": "an agreement that I made also Joe. Brings up a really great scenario. Thank you. I actually didn't think of this one. But scenario eight would be a ratio. diagonal, which I still would not trade personally, but this is a scenario. So, and I'll explain why. So, by and hold, that's part of the broader portfolio. I really don't do just this, but this would be the next stair step for anybody that is doing this. This is like the next natural path. Then I don't do this one. I don't do this one. I do this one. I do this one. And I do this one. The reason why I don't do these, this one, is because they're essentially part of this scenario for. The reason why I don't do ratio call diagonals is because this has short calls, and then it has long options, but there's no current shares. So this becomes really, really dangerous. And the reason why this is dangerous is because short calls can be assigned early. So if you're assigned during a squeeze, that becomes a little bit of a logistical burden if you're covering it with long options. Eljord says, I got an email saying, I have a month trial from you. Month trial for what? And who's the fucking email from? I don't have month trials for anything. You sure it's from who's the email from? Because it's not from me. I don't have that. YouTube sent it to you. Oh,",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 50,
      "start_timestamp": "01:26:11",
      "start_timestamp_seconds": 5171.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=5171"
    }
  },
  {
    "text": "an email saying, I have a month trial from you. Month trial for what? And who's the fucking email from? I don't have month trials for anything. You sure it's from who's the email from? Because it's not from me. I don't have that. YouTube sent it to you. Oh, because somebody gave you a membership earlier. You must have been, you can think I'd rather be skiing. Because was it, I'd rather be skiing? Want to make sure I give props to the right person. Yeah, it was, I'd rather be skiing. So you can say, thank you, Ty, I'd rather be skiing because they hooked you up with YouTube. So really all that is it's a way to support the channel. There's not like a bunch of perks for being a YouTube member. The main thing is I make sure I prioritize your questions, right? Because I can clearly see who you guys are. But in general, I try to enter most people's questions. So the main thing is it's a way to support the channel. That's the main thing. And for the more specific stuff, that's like the Patreon. But that's really more for like more serious options traders for people that are interested in buy and hold learning about GameStop and more casual involved with GameStop. The Patreon wouldn't be for you at all. But if you're interested in like training options, that's where the more serious effort goes. So yeah, that's what we got. So",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 50,
      "start_timestamp": "01:27:55",
      "start_timestamp_seconds": 5275.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=5275"
    }
  },
  {
    "text": "options traders for people that are interested in buy and hold learning about GameStop and more casual involved with GameStop. The Patreon wouldn't be for you at all. But if you're interested in like training options, that's where the more serious effort goes. So yeah, that's what we got. So I'm trying to think if there's anything else here. So yeah, there's pretty significant risk with this one that I think can be avoided by traders. There's this really is designed to trade the expansion and volatility, which happens actually quite a lot. I normally trade these at a ratio, meaning long long calls to short long calls to long calls. WheelStretch is 9 in poll, not here because they're interested in options what they're watching for for GameStop. This is the GameStop stream. So that's what they're watching for. Hey, yo, Lauren's hooking everybody up too. Thank you so much, Lauren. Much appreciated. I'd rather be skiing says I need to get more in a scenario for it. Yeah. So for scenario for, I think again, from from my perspective, I think that's one of the better places for GameStop traders to be. And here's here's what you need. This, these are like the first two videos that are in the series. And then if you look at the GameStop playlist, I literally have an entire playlist for GameStop and meme stocks here. That playlist goes through like the Tuesday, the Tuesday update videos that I'm doing. You can",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 50,
      "start_timestamp": "01:29:06",
      "start_timestamp_seconds": 5346.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=5346"
    }
  },
  {
    "text": "This, these are like the first two videos that are in the series. And then if you look at the GameStop playlist, I literally have an entire playlist for GameStop and meme stocks here. That playlist goes through like the Tuesday, the Tuesday update videos that I'm doing. You can see that in that playlist. And this should be sorted by release. Yeah. Which is perfect. So yeah, you'll be able to check that out there. But I'm essentially showing everybody like what I'm doing with the GameStop holding and then how I'm trading along it. The idea is to give everybody like literally a step by step overview of it. So sweet. All right, gang. That wraps me up. We have the pro market prep live stream tomorrow. You also have a video every Sunday. You will get in every evergreen video from Eric. That means it's more fundamental concepts. The video tomorrow is about trader documentation. So it's about how to build a trading plan and a trading log, specifically a trading log. And it's a step by step process. I literally do it on the stream with you. So you can follow along with that to help build your own trading log so you can make better decisions. As always, if you need anything, hit me up. Drop me an email. Whatever works for you works for me. Be an outlier. Be an ape. You would ever want to be. See you later.",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 50,
      "start_timestamp": "01:30:43",
      "start_timestamp_seconds": 5443.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=5443"
    }
  },
  {
    "text": "build your own trading log so you can make better decisions. As always, if you need anything, hit me up. Drop me an email. Whatever works for you works for me. Be an outlier. Be an ape. You would ever want to be. See you later.",
    "metadata": {
      "video_id": "5G0_P4igVWQ",
      "title": "GME Top Theories Analysis Pt13 | GameStop Analysis Ep31",
      "url": "https://www.youtube.com/watch?v=5G0_P4igVWQ",
      "upload_date": null,
      "duration": 5557.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 50,
      "start_timestamp": "01:32:16",
      "start_timestamp_seconds": 5536.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G0_P4igVWQ&t=5536"
    }
  }
]