[
  {
    "text": "you you you you over Let's now get into and start talking some markets. So I already did a video a little earlier today, because I want to say I wasn't expecting to do this, and walking through my general thoughts towards the broad market. So I'm actually going to skip doing that. I want to give you a really, really, really high level market overview for those that didn't catch that video just yet. And then I want to immediately dive into a focus topic for today. So this funny enough, this is kind of like the main story. Right now everybody is trying to figure out when does the market either make a decision up or down, up or down. Right now it's slowly leading towards down. I don't think that it's necessarily from this. The reason why I don't think it's necessarily from this is because it's been this way, meaning the probability of no change for 29 Jan is been like that for some time now. We can see even as a month ago, it was a 78 probability of no change. If we look at a chart of this, one sec, let me switch my screens over here. If we look at a chart of the SP 500 and we take a peak at what was this a month ago, we were still near all time highs when this was telling you we're not looking at a change. That matters. And it's because all of",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 38,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=0"
    }
  },
  {
    "text": "screens over here. If we look at a chart of the SP 500 and we take a peak at what was this a month ago, we were still near all time highs when this was telling you we're not looking at a change. That matters. And it's because all of the conversation, the focal point on this, being the thing that's driving the market, of course, it will always be a continuing component of it. But right now I think the market is figuring out what stuff is worth and what does this next year look like. And again, if you go through the video earlier today, you notice that we don't have the majority probability of a cut until 18 June. And it's a slight margin, literally 51 and still 48 probability of no change. It's all the way out in 18 June. The market's not expecting a cut and it's not expecting it for some time now. This also very clearly explains the behavior that you've seen in IWM. Because again, if we go back a month in IWM to about the 13th, what do you notice? This is when that probability of no change started to expand a little more rapidly and take a look at what small caps have done since they've taken a break. They've fallen off. So this all wraps up into a pretty clear summary, I think, of what current market expectations are and we're coming into earnings now. So what that means",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 38,
      "start_timestamp": "00:04:34",
      "start_timestamp_seconds": 274.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=274"
    }
  },
  {
    "text": "a little more rapidly and take a look at what small caps have done since they've taken a break. They've fallen off. So this all wraps up into a pretty clear summary, I think, of what current market expectations are and we're coming into earnings now. So what that means is we have to think about how do we want to position coming into earnings, what makes sense for the portfolios? And if we grab a look really quick at the calendar, we have APLD tomorrow. We have banks kicking off Wednesday before the market. So we have BK, CGS, GPM and Wells Fargo who don't worry Wells Fargo will probably do well because they'll open up some accounts for you. They're real, real good at that. And I mean, let's just let's just take a look through a couple of these really fast out of sheer curiosity. I'm going to shrink this down a lot so that we can see this list while I do this. So let's take a look first at BK, just at a curiosity. And I mean, they've been beating to the top side. Their average implied moves about 3.8 average actual 3.2. So this is a decent earnings place. It's not the most liquid choice out there though. Then there's BOK. And these guys have been doing pretty well as of late. Yeah. These also, this is another one that I tend to trade earnings in. My earnings place have come down quite a",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 38,
      "start_timestamp": "00:05:45",
      "start_timestamp_seconds": 345.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=345"
    }
  },
  {
    "text": "is a decent earnings place. It's not the most liquid choice out there though. Then there's BOK. And these guys have been doing pretty well as of late. Yeah. These also, this is another one that I tend to trade earnings in. My earnings place have come down quite a lot just because the total number of stuff that looks attractive has changed. But this has been a pretty consistent one as well from here. But one of the things I'm trying to highlight for you is what is the expected move for this quarter compared to prior quarters. And you can see that there's a little bit more vol right. So 3.3 priced in to be OK. It was a little bit high for BK. Let's take a look at city group. Did a group suck and wind. They need to open up some fake accounts for people. This surprises me to see city group price so low. I actually don't know why that is. That might need to get reprised or they're just being cheap with the ball. Look at Goldman Sach. Look how big this is like really significant. Expect look at this 4.2 expected move averages 3.9. The prior was 3.8 before that 3.2. And then if you go year over year. 3.3. So what I'm showing you is that the banks are pricing in more of all like that's what's that's what this is telling us. And the banks really represent a large portion of",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 38,
      "start_timestamp": "00:07:08",
      "start_timestamp_seconds": 428.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=428"
    }
  },
  {
    "text": "3.9. The prior was 3.8 before that 3.2. And then if you go year over year. 3.3. So what I'm showing you is that the banks are pricing in more of all like that's what's that's what this is telling us. And the banks really represent a large portion of the total market. And it's because banks touch just about everything just like Bill Cosby. So their businesses will interact with just about every other business that exists out there. So the fact that banks are pricing in this kind of all I think is something to pay attention to. Yeah, even JP Morgan. JP Morgan's a little bit more of like a stalwart. That's the right word stalwart stalwart stalwart. Sounds weird when I'm saying it. Why does it sound so weird? Fuck am I trying to say stalwart stalwart stalwart stalwart stalwart stalwart stalwart stalwart. Not the one I'm seeing the word. It's not what I meant anyways. What I meant is like the kill of a ship. So when you take a look at JP Morgan, it tends to be a little more robust compared to the other is just because the business unit is so big. And this look at this 4.5 4.3 3 3.7. This is the same thing. So we're seeing really, really. Just elevated ball on a relative basis, which is absolutely nuts. Interesting. So that's what we have coming up from a market perspective. Now I want to pivot over to our",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 38,
      "start_timestamp": "00:08:07",
      "start_timestamp_seconds": 487.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=487"
    }
  },
  {
    "text": "And this look at this 4.5 4.3 3 3.7. This is the same thing. So we're seeing really, really. Just elevated ball on a relative basis, which is absolutely nuts. Interesting. So that's what we have coming up from a market perspective. Now I want to pivot over to our focus topic. Now we have a few on the list for today. I've had one that's been queued a couple times that's gotten pushed. So I am completely open to what we want to cover from this list. We can also add stuff to this list. I'll give you all a few moments to digest it. Just like when Bill Cosby spikes a drink, it probably takes a few moments for the drugs to be digested before you pass out. That also could be ditty. I think either one of those, but one of them includes a lot of baby oil. One of them probably doesn't. And I don't know what's more disrespectful. But the I actually don't know what's more disrespectful like a ton of baby oil or no baby oil. Because the problem with the ton of baby oil is that you got to get it off at some point. And that's just like really, really annoying. And no baby oil. That's kind of like ripping and tearing. I don't know about that. I probably take the. I probably take the baby oil. Yeah, I know about that. So which of these do we want to take a",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 38,
      "start_timestamp": "00:09:27",
      "start_timestamp_seconds": 567.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=567"
    }
  },
  {
    "text": "some point. And that's just like really, really annoying. And no baby oil. That's kind of like ripping and tearing. I don't know about that. I probably take the. I probably take the baby oil. Yeah, I know about that. So which of these do we want to take a look at? Customizing your trading workspace, self-assessing proficiency, exploring market themes that might be topical for now, managing risk and volatile markets that starting to become topical now, building an efficient process, managing FOMO in missed opportunities. That's a really fun conversation. Risk premiums and scanning for them. How does they focused while you're trading, building trading discipline. You all know your boy is about some discipline. I think that's solid understanding IV. That would be maybe we move this one to be honest. I think understanding IV might be better suited for the outlier options trading basics, which I actually think is coming up soon. Pricing. Is there not one about volatility? Yo, that's not it. That's not it at all. So option pricing is fine. All this stuff is fine, but this absolutely needs to be volatility. So then we'll do volatility impact on options, types and trading. And then I'll figure out your guys's homework. That's crazy. I'm sorry about that. I left y'all out to dry on that. I can't believe that I wouldn't have had a standalone thing for options volatility. That's straight trash. Let's see. Travel says, managing risk. Lauren says volatile market. James",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 38,
      "start_timestamp": "00:10:49",
      "start_timestamp_seconds": 649.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=649"
    }
  },
  {
    "text": "And then I'll figure out your guys's homework. That's crazy. I'm sorry about that. I left y'all out to dry on that. I can't believe that I wouldn't have had a standalone thing for options volatility. That's straight trash. Let's see. Travel says, managing risk. Lauren says volatile market. James says trading m a's moving averages is that mergers and acquisitions. See, this is the thing with questions m a's very different than m and a's. Tommy says anything about risk breaking the wall says, can we go over the quantum stocks based on Nvidia CEO's is not viable for 15 years. Probably not during the stream today because I wanted to get through a focus topic, but we can definitely talk about that one on the Wednesday stream, if you'd like, we'll have like the full hour. But the I mean, overall summary for that is I don't think that's any new news. And I think Zalke even talked a little bit about that on his time on the Rogan podcast. And I don't I don't know. I don't think that that's a shock to anybody. I think people started to dog pile in just because attempting to front run, but anybody that has spent any amount of time taking a look at quantum computing, it definitely is it is literally in its infancy. It's going to take a while before that comes into play. I think it was Jensen that had a really, really, really cool, a really,",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 38,
      "start_timestamp": "00:12:24",
      "start_timestamp_seconds": 744.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=744"
    }
  },
  {
    "text": "run, but anybody that has spent any amount of time taking a look at quantum computing, it definitely is it is literally in its infancy. It's going to take a while before that comes into play. I think it was Jensen that had a really, really, really cool, a really, really cool statement that he made during the keynote speech, which is that that was it a GI. I think he was saying that. Damn, I don't want to mess it up. It was something is about to have its chat GPT moment. I think it might have been robotics like general robotics is about to have its chat GPT moment, which should like that shows really what seems to be the bell of the ball at the moment, which I don't think quantum computing will be the case for a little while. Scott says, bro, if I move to DC, we can't chat anymore. Why not? DC DC still let you on the internet. DC's not like Russia. Be all right. Robotics. Okay, cool. Yeah, thank you guys. That's what I thought because he spent a while talking about robotics. Okay, cool. So it looks like Tommy's anything risk travel says managing risk and Lawrence's volatile market, which is kind of about risk. So I think we do this one. So this will be on 13 Jan and then this will be on YouTube. So let's talk about managing risk and we could talk about it in volatile markets",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 38,
      "start_timestamp": "00:13:43",
      "start_timestamp_seconds": 823.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=823"
    }
  },
  {
    "text": "travel says managing risk and Lawrence's volatile market, which is kind of about risk. So I think we do this one. So this will be on 13 Jan and then this will be on YouTube. So let's talk about managing risk and we could talk about it in volatile markets and then also, you know, just in general, it's not limited to volatile markets. And this is good because I already have a really nice spot to draw and just express myself. I'm really known for being very expressive. It's a big thing about me. I don't know if you guys can tell, but I'm being completely sarcastic. I am the standard kind of dude that will bottle everything up just like Bill Burr talks about, you know, like shove it down on your chest. And then just proudly die of a stroke at like 45. That's probably the case. Okay, so let's take a look at managing risk and whether it's volatile markets or not, this will apply to all of it. And there are a few key things that will apply to everything. So we'll start with the basics, managing risk. So the first thing, the first thing is let's talk about what levers we have to manage risk. The reason why this is important is because we need to know the tools that are at our disposal in order to successfully manage risk. This is literally what will dictate what we do. So I have, as you",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 38,
      "start_timestamp": "00:14:59",
      "start_timestamp_seconds": 899.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=899"
    }
  },
  {
    "text": "is let's talk about what levers we have to manage risk. The reason why this is important is because we need to know the tools that are at our disposal in order to successfully manage risk. This is literally what will dictate what we do. So I have, as you probably would guess, I have a bunch of videos that talk about managing risk. This one, this one, this one, and this one. So literally all of those videos will go much deeper into detail on managing risk. But there are a few things we can do to manage our risk. The very first one, this is the easiest one. You guys should know what this one is. What is the first one? What is the very first way that you can manage risk in a trade portfolio? David has it sizing size matters size matters a lot. And if we think about how impactful size matters, just think of it from the context of Diddy who is very selective with who went to his parties and then who hung out at those parties and it probably had to do it size. So first one sizing. So this is the first one and the most important one is because you can't risk what's not out there. It literally is as simple as that. If I have a hundred thousand dollars and I put on ten dollars of trades, that's it. That's the only that's all I can lose is what",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 38,
      "start_timestamp": "00:16:19",
      "start_timestamp_seconds": 979.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=979"
    }
  },
  {
    "text": "first one and the most important one is because you can't risk what's not out there. It literally is as simple as that. If I have a hundred thousand dollars and I put on ten dollars of trades, that's it. That's the only that's all I can lose is what I throw into the markets. Now, if we have short premium strategies, that's where the risk profile starts to get really, really confusing because it's undefined risk. So sizing in those instances becomes even more important. So this is your this is your first line in the sand. The second line in the sand, what else can we think of if the next one, this isn't necessarily in order from here on out, but sizing hands down the most important one. Now, what's the next one that we can think of here? David says Delta's that's not so much it sector risk getting closer to something I could use here. There's a specific specific series of terms that I think we'd go. Rointitie says define stop loss plan. I love that. I literally love that. So defined exits. The other one that you all are kind of dancing around is correlation. So when we're talking about diversity, when we're talking about event risk, those kinds of things that well, not event risk necessarily that's I'm thinking of it from a broader market perspective, but correlation, the relationship between underlines. So these components here operate at generally portfolio level. And there",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 38,
      "start_timestamp": "00:18:06",
      "start_timestamp_seconds": 1086.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=1086"
    }
  },
  {
    "text": "correlation. So when we're talking about diversity, when we're talking about event risk, those kinds of things that well, not event risk necessarily that's I'm thinking of it from a broader market perspective, but correlation, the relationship between underlines. So these components here operate at generally portfolio level. And there are more that fit into here like you guys are talking about there's things like beta weighted Delta's. As a way to manage risk via controlling sizing and stuff. Now let's talk about it from a position standpoint sizing is still number one from a position perspective. Defined exits is still number two. Play this works is you would have I call them circuit breakers at the portfolio level. If I have a broad drawdown across the portfolio, even if my individual trades are not necessarily hitting their risk exit points, it means I need to start closing things. So this is like a portfolio circuit breaker. This is for individual trades down here. So on an individual trade where should I be getting out that's defined here. The other thing that especially with individual trades and I think you guys already hit it. Yep, event risk that's correct. Which that also applies up here. So we manage event risk is by knowing what's coming up in position the portfolio in a way that can survive the move of the event from a individual trade perspective. We decide what we want to put on when and if it makes sense",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 38,
      "start_timestamp": "00:19:41",
      "start_timestamp_seconds": 1181.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=1181"
    }
  },
  {
    "text": "that also applies up here. So we manage event risk is by knowing what's coming up in position the portfolio in a way that can survive the move of the event from a individual trade perspective. We decide what we want to put on when and if it makes sense to hold something through earnings or not. That's event risk little bit different. So also from an individual ticker to manage risk. Or is impatient night. There's liquidity. Volatility this really impacts options. From an individual trade perspective. I think this covers most of them. What else would I would consider. Oh. So this is the end of the week. The reason why Greeks matter so much here is because you start to create things like. Positive or negative depending on your position. The other thing that matters here is something like gamma. You can start ramping your gammas really really fast. So let's talk about putting all of this together in the symphony. First thing from we start at the portfolio level. And to manage risk at the portfolio level we come up first. With these two evaluations. We need to evaluate the overall economy and then we need to evaluate the stock market. Why do we have to evaluate the economy? That sounds kind of lame. The reason why you have to evaluate the economy is because the economy is literally a direct representation of productivity of businesses. So if the economy for example is contracting. That's you",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 38,
      "start_timestamp": "00:21:45",
      "start_timestamp_seconds": 1305.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=1305"
    }
  },
  {
    "text": "to evaluate the stock market. Why do we have to evaluate the economy? That sounds kind of lame. The reason why you have to evaluate the economy is because the economy is literally a direct representation of productivity of businesses. So if the economy for example is contracting. That's you need to know that. Because that's going to be reflected in the businesses. And just as people that walk into a room with diddy how certain parts of their body might contract. You should probably contract certain elements of your portfolio based on what these two things are doing. So say for example we've been talking about this now. With the current market condition and the way that everything is flowing market breath. The economy how sensitive we are to interest rates. The prevalence of no rate cuts all of those things combined. They lead to a slightly restrictive market. So that's why somebody like me I'm playing it pretty defensive. I don't have a bunch of stuff out right now. I do have a handful of things. But even the things that I have out like for example the leverage coverage triangles. Those are still less than 50 utilized. And it's because of this reason. It's because of at the portfolio level. I am determining how much money should be used. Money used. Then I make sure that the individual positions. Support this objective. So at the trade level. If we know at the portfolio level that we're scaling",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 38,
      "start_timestamp": "00:24:12",
      "start_timestamp_seconds": 1452.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=1452"
    }
  },
  {
    "text": "And it's because of this reason. It's because of at the portfolio level. I am determining how much money should be used. Money used. Then I make sure that the individual positions. Support this objective. So at the trade level. If we know at the portfolio level that we're scaling risk down. This can happen in a few different ways. This can be number of positions. Decreasing. This can be size of positions. Decreasing. This could be stops. Being tighter. And then we also need to become more mindful about correlation. And then from the individual trade level. We're going to have this flow through impact. Meaning we're going to have fewer positions. Using less money. And these right out of the gate. These will get you pretty close. These will get you pretty close to not getting ran over in a market condition. Meaning things start to change pretty rapidly. Now it's all in balance. Because if you go too far, you take off too much risk. Then you can't really make any money. So you have to strike a balance when you're managing portfolio. And then trade level risk. You still have to maintain something. But one of the things that I will remind you of. Is from a trader's perspective. You have some advantages. So let's say. That you're trading something like. He triple cues. And T triple cues is rolling over here. If I'm applying a moving average, which is my typical, I'm not doing it",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 38,
      "start_timestamp": "00:25:25",
      "start_timestamp_seconds": 1525.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=1525"
    }
  },
  {
    "text": "the things that I will remind you of. Is from a trader's perspective. You have some advantages. So let's say. That you're trading something like. He triple cues. And T triple cues is rolling over here. If I'm applying a moving average, which is my typical, I'm not doing it this year. But typically speaking, if we got a close below this 200 a.m.A. I'm out. I'm not going to do it this year because I'm trading something slightly differently with it. And it's also a really small overall allocation and then really small utilization. But let's say that I'm using this 200 a.m.A. as a stop. Well, if we get a big move below the 200 a.m.A. Or as we approach the 200 a.m.A. I definitely would lighten up risk. The other thing that I would do is if I'm using a complete rotation approach. And I get out as it rolls below the 200 a.m.A. That doesn't mean that I can't get back in as it comes back above the 200 a.m.A. So the point is one of the ways that you can save yourself a lot of pain as a trader in markets is side stepping bigger market moves. Now that's one approach. Now if you're applying something, travel says isn't scaling in extra puts basically dollar cost averaging. Yeah, I think you could look at it that way. A little bit different because the probability of being assigned is not 100. So the concept of dollar",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 38,
      "start_timestamp": "00:27:36",
      "start_timestamp_seconds": 1656.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=1656"
    }
  },
  {
    "text": "market moves. Now that's one approach. Now if you're applying something, travel says isn't scaling in extra puts basically dollar cost averaging. Yeah, I think you could look at it that way. A little bit different because the probability of being assigned is not 100. So the concept of dollar cost averaging is that it is a loosely used in the term, but it's a religious purchasing. It's very consistent and it's it's just every single time. So whether it's high or low, it doesn't matter. It's every single time that those underlines, whatever it is being purchased. So with puts it's I wouldn't exactly call it DCAing because you might not get assigned on those puts. And again, that would be contrary to a DCA approach. But in effect, it could be viewed that way for sure. So. There's nothing wrong with dollar cost averaging. There's nothing wrong with value averaging, value averaging combined with dollar cost averaging is actually super, super effective. But one of the big issues people have with dollar cost averaging is they start dollar cost averaging into things that are doing really poorly because they're upset because they don't want to see it do really poorly. That's terrible. That's bad, bad, bad business. Don't do that. But if dollar cost averaging, value averaging or combination thereof is part of your strategy or your approach that's different. It's completely okay. There's nothing wrong, especially in something like teachable cues. It's absolutely nothing wrong with buying",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 38,
      "start_timestamp": "00:28:42",
      "start_timestamp_seconds": 1722.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=1722"
    }
  },
  {
    "text": "really poorly. That's terrible. That's bad, bad, bad business. Don't do that. But if dollar cost averaging, value averaging or combination thereof is part of your strategy or your approach that's different. It's completely okay. There's nothing wrong, especially in something like teachable cues. It's absolutely nothing wrong with buying into it as it goes down understanding that it is very possible it will continue to go down and it will look uglier as it goes down. But if the broader thesis is still intact, meaning you think that this is a strong series of companies and even though it's levered that the underlying sector that it's tied to will eventually recover, then it can still in net network out. So that's the business pitch on managing risk. There are two distinct levels to managing risk at the portfolio level and then at the individual trade level, they should symbiotically support one another. The portfolio level stuff is to guide the decisions you make at the trade level and the trade level needs to be made in the context of the portfolio level. So by creating that symbiotic relationship, portfolio management and risk management becomes honestly pretty easy because as long as you're managing the relationships between things, how different positions behave, you can decrease overall risk in a million different ways. You can add a bunch of different names, you can diversify a lot, you can diversify too much, you can trade different strategies that benefit from different market,",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 38,
      "start_timestamp": "00:29:56",
      "start_timestamp_seconds": 1796.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=1796"
    }
  },
  {
    "text": "long as you're managing the relationships between things, how different positions behave, you can decrease overall risk in a million different ways. You can add a bunch of different names, you can diversify a lot, you can diversify too much, you can trade different strategies that benefit from different market, you can trade different days to expiration. So that in case things start collapsing up front, you can worry about what's collapsing up front and then the stuff that's a little further out in time still has some time to work in case there's a recovery, that kind of stuff. A travel says for sizing for specific underlines, should we use some percentage of trading portfolio, it's a great question. The way that I think about sizing in that way is sizing based off of risk, not sizing based off of amount of portfolio. That will be different if you have a very small portfolio, you have to divvy up the amount of in the portfolio very carefully. So here's what I mean, if we're trading something, let me give rid of all this. And for those that are hanging out now is the perfect time to throw in any questions you want before we wrap up. So for sizing individual trades, I like to size them in the context of the risk. So let's say that we're trading really anything, let's say that we're going to trade city for its upcoming upcoming earnings release. What I do is I",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 38,
      "start_timestamp": "00:31:16",
      "start_timestamp_seconds": 1876.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=1876"
    }
  },
  {
    "text": "questions you want before we wrap up. So for sizing individual trades, I like to size them in the context of the risk. So let's say that we're trading really anything, let's say that we're going to trade city for its upcoming upcoming earnings release. What I do is I would say how much money am I comfortable losing in this individual strategy in this one individual position and that will be based on the performance of the strategy. So you'll come up with whatever that number is, maybe you're comfortable risking half a percent of the portfolio, common for larger portfolios for small portfolios, you might have to look at something like one to 3. Ideally not too much at 3 because you can't you can't deal with too many of those. So from a larger portfolio perspective, if we have a hundred thousand dollars, for example, and on that hundred thousand dollar portfolio, we can decide how much risk we want to have out at a given point in time. And if we say I want to use no more than a percent, it means we can lose up to a thousand dollars. So then I build a position that fits that idea based on the strategy and based on what might happen. So I would figure out what the average move is for earnings and all that kind of stuff give it a nice big padding because you never know when the biggest move is going to",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 38,
      "start_timestamp": "00:32:27",
      "start_timestamp_seconds": 1947.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=1947"
    }
  },
  {
    "text": "position that fits that idea based on the strategy and based on what might happen. So I would figure out what the average move is for earnings and all that kind of stuff give it a nice big padding because you never know when the biggest move is going to happen. And then I would size off of that. So let's figure out where there is like a really big earnings move for context. This looks like a pretty big one. This looks like a bigger one and this looks like a big one. So let's do this. Let's use this one and the stock move from 6357 to 68 five points. So the stock had a five dollar move. So what I can do is I can say, okay, I want to trade earnings. I'm going to come in here. I'm going to sell a strangle. I want my strangle to be 30 delta strangles. Let's find that here here. And then I say to myself, how much, how much, like, how much of my will and a risk? What would make sense here? Well, what I can do is I can say, well, what's a five point move off of this spot price right now is 72. So maybe I forecast an even bigger move. Let's say I price it so that it's at 65. The reason is I'm giving myself a buffer because we never know when a bigger move is likely to happen. This comes in",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 38,
      "start_timestamp": "00:33:40",
      "start_timestamp_seconds": 2020.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=2020"
    }
  },
  {
    "text": "off of this spot price right now is 72. So maybe I forecast an even bigger move. Let's say I price it so that it's at 65. The reason is I'm giving myself a buffer because we never know when a bigger move is likely to happen. This comes in at 459. So then I can say, well, maybe I do two of these that comes in at 919 that's under my 1 risk threshold using a conservative estimation. Now that doesn't mean that this can go above that. This could be a 2,000 loss potentially. So the other thing I have to vet is if there is just a massive move that we've not seen before in the underlying. It's not am I comfortable with it? I'm not comfortable. It would suck. What I survive. So then I would say again, using something like this is a context and let's say the biggest move that we saw over that last time frame. What was what like five points? So what if it moves three times that amount? What if it goes 15 points from 72 and let's say it goes like 55 ish. 3,000 loss. Huge move. Uncomfortable. Don't like it. Would survive on a hundred thousand dollar account. So even considering of really big potential move. This is okay. Again, I wouldn't want a bunch of these. This is too much risk. But we're trading a naked strategy around earnings. We have to prepare for a really big",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 38,
      "start_timestamp": "00:34:45",
      "start_timestamp_seconds": 2085.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=2085"
    }
  },
  {
    "text": "like it. Would survive on a hundred thousand dollar account. So even considering of really big potential move. This is okay. Again, I wouldn't want a bunch of these. This is too much risk. But we're trading a naked strategy around earnings. We have to prepare for a really big move at some point. And we're not preparing for the big move in the context of I'm going to size the trade so that this giant move makes sense because it won't because it's not priced and because it's super rare. But I'm sizing the trade so that I don't have a problem if this happens. Problem being going in solvents or experiencing too big of a drawdown on the individual position. So this is the approach with a larger account. And then you can figure out the number of positions you want to have on and make sure that the risk across the makes sense with the larger account. You really don't worry that much. Honestly about how much of the total portfolio you're using at a given point in time and individual trades because the risk typically is going to be realized. Meaning the risk will be the constraining factor not the amount of money. The inverse for small accounts. So if I have a 5,000 account and I'm looking to eyeball this same strategy in my 5,000 account. I say I can only lose 1. Well, shit. You don't have a lot of money to work with",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 38,
      "start_timestamp": "00:35:59",
      "start_timestamp_seconds": 2159.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=2159"
    }
  },
  {
    "text": "constraining factor not the amount of money. The inverse for small accounts. So if I have a 5,000 account and I'm looking to eyeball this same strategy in my 5,000 account. I say I can only lose 1. Well, shit. You don't have a lot of money to work with here. This clearly ain't happening. Even this first trade, even when it was at a one lot. Clearly ain't happening. So then when you're trading a smaller account, you do have to be judicious about how much money you're using. And a lot of that will reflect more so in the product or the security selection. Meaning you don't get to trade 72 stocks with a 5,000 account unless you use spreads. So you all know I do not advocate for spreads. I don't like them, but they have a purpose. I'm going to pop the door for real quick. Okay. Okay. So if we instead look at a vertical spread here instead of our naked. Strangle and we turn this into an iron condor. So in this trade comparatively, the max we lose is guess what 49 bucks max we make is 51 bucks. So what does that tell us? This fits. So by applying a vertical spread, this trade will fit the portfolio. Now again, you're going to sacrifice a bunch of performance doing this. That's the nature of a small account. You don't get to have everything. The market doesn't care. And it's not going to give",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 38,
      "start_timestamp": "00:37:04",
      "start_timestamp_seconds": 2224.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=2224"
    }
  },
  {
    "text": "us? This fits. So by applying a vertical spread, this trade will fit the portfolio. Now again, you're going to sacrifice a bunch of performance doing this. That's the nature of a small account. You don't get to have everything. The market doesn't care. And it's not going to give you concessions because you're a small account. That's the beautiful thing about the market. It is indifferent. And this is one of the ways that you could make this make sense because now we're within the risk tolerance of that really small portfolio. The other thing is this would use a lot less money. It's going to take again, what 50 bucks. So then you have the ability to put on a lot more trades. That's generally going to serve you better. So for smaller accounts, you have to take into account how much money you're using on individual positions, but then also make sure that it still falls within the risk control parameters. It's a balance between both. It's like the same thing with accounts when you look at percentages versus gross dollar amounts. In smaller accounts, it makes a lot of sense to focus on percentages because if you have a 5,000 account, you have a 10 return. It's a decent return, but it's only 500. It doesn't really mean much. It's not that moving. 500. But as your account grows, if you have a 5,000,000 account, that 10 is now 500,000. That's not bad. So the percentage",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 38,
      "start_timestamp": "00:38:49",
      "start_timestamp_seconds": 2329.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=2329"
    }
  },
  {
    "text": "you have a 5,000 account, you have a 10 return. It's a decent return, but it's only 500. It doesn't really mean much. It's not that moving. 500. But as your account grows, if you have a 5,000,000 account, that 10 is now 500,000. That's not bad. So the percentage and gross numbers matter and they have to be taken contextually because the other thing I can tell you that I don't really care about is if I make a 5,000 return on a trade, but I make 6. Doesn't really fucking matter. So small accounts when it comes to sizing have to keep into context both of those components, how much dollar of the portfolio with the dollar amount is that I'm using, but then also. What's the risk and does it fit in with the broader risk portfolio parameters? That's how I size trades. I don't size trades by saying I should put 5 of my portfolio in each individual trade I size it off of the risk. Now, one of the other ways you can choose to size positions is when you have defined strategies. And this is a completely different methodology when you have defined strategies with defined performance metrics. Then you can use a continuous Kelly sizing, a continuous Kelly sizing sizing formula allows you to apply the Kelly criterion for sizing. Maybe you do half Kelly quarter Kelly, third Kelly, but it's in a continuous outcome system, meaning it's nondiscreet Kelly sizing in general",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 38,
      "start_timestamp": "00:39:55",
      "start_timestamp_seconds": 2395.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=2395"
    }
  },
  {
    "text": "with defined performance metrics. Then you can use a continuous Kelly sizing, a continuous Kelly sizing sizing formula allows you to apply the Kelly criterion for sizing. Maybe you do half Kelly quarter Kelly, third Kelly, but it's in a continuous outcome system, meaning it's nondiscreet Kelly sizing in general is made for sports betting or something like that. You make the money you lose the money or gambling with if you play blackjack you make the money you lose the money. Completely different in trading because there's a range of outcomes and continuous Kelly accounts for that, but continuous Kelly is much better served when you're looking to size individual trades that are part of a broader strategy that you have really good metrics around. That's absolutely another way to consider sizing your positions. Now, the thing to know about Kelly though is Kelly criterion is focused around the optimal growth. That's different than things like consistency and performance or having no losing quarters or whatever other metrics you might care about. If you look at Kelly Kelly criterion for sizing trades only cares about optimal growth. That means that you typically are going to take bet sizes that are super uncomfortable and they do have blowout risk. What Kelly criterion is not super interested in is total consumption of staying power. How likely can you stay in the game? Kelly criterion is optimizing for growth. So it's a slightly different slide. Different formula. Cool. Super fun conversation risk",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 38,
      "start_timestamp": "00:41:09",
      "start_timestamp_seconds": 2469.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=2469"
    }
  },
  {
    "text": "are super uncomfortable and they do have blowout risk. What Kelly criterion is not super interested in is total consumption of staying power. How likely can you stay in the game? Kelly criterion is optimizing for growth. So it's a slightly different slide. Different formula. Cool. Super fun conversation risk risk management and trading is such a a slept on thing that nobody really, really cares or likes because it's the ugly part of trading. But it is one of the most important things you genuinely could consider as a trader in trading is having a solid, solid understanding of managing risk in your portfolio. Because if you don't have that, I tell people all the time that the overwhelming amount of traders focused on the wrong thing, which is how much money did I return, how much money can I make in an exp period of time, which is fine, but it's the wrong focus. The true hallmark of his successful trader is staying power. How long can you be in the game? And you can have people that are flash in the pan that come out of the gate super fast. They have great years, they crush it for two years and then they fucking blow up in their third year. That sucks. So a trader that has a more modest return, but is able to consistently achieve that return time and time and time again year in and year out is going to fare better than the",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 38,
      "start_timestamp": "00:42:37",
      "start_timestamp_seconds": 2557.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=2557"
    }
  },
  {
    "text": "for two years and then they fucking blow up in their third year. That sucks. So a trader that has a more modest return, but is able to consistently achieve that return time and time and time again year in and year out is going to fare better than the trader that has massive crazy up years, but then eventually blows out like literally the quintessential tortoise and the hair. Okay, off of the soap box smile up drones says could you take a look at AMD any possible support levels sure we'll take a quick. Fuck. Done look good. Figure out our dinner order. Well, one is there's no amount of levels or anything that matter right now because that has earnings coming up. But next stop looks to be something down here. And the reason why down here is just because it's where literally I can find any semblance of a reference volume note. Yeah, it's like down here and that yeah, it's literally notice how well that lines up with these broader time frames. But yeah, AMD it really looks like straight trash, which is unfortunate because I think the company is probably fine longer term, but it's really, really important to remember that in the short term. What matters the absolute most is sentiment, whatever sentiment is that's where price is going to go and that can be a really frustrating experience because you know, you can have something that looks to be like really, really",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 38,
      "start_timestamp": "00:43:54",
      "start_timestamp_seconds": 2634.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=2634"
    }
  },
  {
    "text": "it's really, really important to remember that in the short term. What matters the absolute most is sentiment, whatever sentiment is that's where price is going to go and that can be a really frustrating experience because you know, you can have something that looks to be like really, really good company price, you know, unfairly at a given point time or whatever. But overall could look fine. It doesn't really matter because sentiment is still going to be the dominant factor. So we're going to do pizza tonight, but I don't know. I don't know what we're going to get. And then I saw that there was another question we can hit. And then I got to start working on our next video. We have a couple videos in the pipeline. I think the next video on the pipeline for you guys to tell you we have a podcast coming out on Wednesday with Joseph Hogue, who is a buddy of mine. I specifically like Joseph Hogue because he is a former ring. So that part is super cool. I always enjoy being able to connect with other veterans and stuff like that. And so that's one. And then we have some stuff on 13 options trading lies. You've been told. So that'll go through a bunch of stuff. I can guarantee a lot of you will have heard about trading options and that are just straight straight wrong. And then after that. Oh, this one will probably be",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 38,
      "start_timestamp": "00:45:53",
      "start_timestamp_seconds": 2753.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=2753"
    }
  },
  {
    "text": "we have some stuff on 13 options trading lies. You've been told. So that'll go through a bunch of stuff. I can guarantee a lot of you will have heard about trading options and that are just straight straight wrong. And then after that. Oh, this one will probably be kind of fun. So after that, I have a video that's going to go into options trading for small accounts. So I imagine some people will be kind of excited about that one because I hate that topic so much. I still think the best possible things. You know that smaller traders can do is just save and grow the account. But I also know that most of them won't do that and I understand because I definitely wouldn't do that. So Titi says, yeah, what up, Roin, Titi says, when is the video on options trading from a small account? I'm waiting for the editor to get back to me, but that one looks like it should be out this next one's on the 19th. So it should be out the 26th. Let me look at the production schedule really quick. Yeah, that one, that one should be the 26th. And then we have a couple videos to make for that. So yeah, hopefully that's at least helpful. But let me take a look at the last question I saw in here somewhere. James says, how do we have positive expected value is selling credit spread since you lose",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 38,
      "start_timestamp": "00:47:26",
      "start_timestamp_seconds": 2846.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=2846"
    }
  },
  {
    "text": "26th. And then we have a couple videos to make for that. So yeah, hopefully that's at least helpful. But let me take a look at the last question I saw in here somewhere. James says, how do we have positive expected value is selling credit spread since you lose more than you make every trade setting a stop will decrease probability profit. So you can answer that own question because I can tell by the way that you're framing it, you understand some of the elements of it. So you answer it for me. How, how would we do that? How do we take a strategy that loses more than you make on every trade? How do we make that profitable? Any guesses? Because I think you know. James, to help you with the answer, consider the expected return formula. James says, I've been looking at stops, but I don't know what pop would be, but it's lower. Yep, nope, not stops. You're already spreading the trade off. So if you're putting on a vertical spread, for example, there's no reason to put a stop on top of that. Just size the trade the way that you want. Because exactly you're already adding multiple legs extra. That's not a good approach. So what actually matters though is exactly what Joe says. If you have more winning trades than losing trades, even though the losing trades are bigger than the wins, if you have more winning trades, it will be",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 38,
      "start_timestamp": "00:49:02",
      "start_timestamp_seconds": 2942.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=2942"
    }
  },
  {
    "text": "exactly you're already adding multiple legs extra. That's not a good approach. So what actually matters though is exactly what Joe says. If you have more winning trades than losing trades, even though the losing trades are bigger than the wins, if you have more winning trades, it will be profitable. So the way to do this is to be good, be good at picking direction so that then you can size things so that you make money. I think I have. I thought it was in here somewhere. Hold on a second. This is what we want. What is this in I1? Just trying to move it over. So let it's in. We can get rid of. Nope. Here we go. James says so just make sure your max losses like 1 of account. It's up to you. There there's no. There's no set answer. Unfortunately, you are going to be the deliverer and the arbiter of your own truth with respect to what the risk is. What I can tell you is that 1 is generally logical and pretty much anything like 5 or down 5 gets to be a little bit more aggressive. But let's take a look at just a system. I don't care about the win rate just yet. But let's say that the average win is 30 and then the average loss is 70. And we can see what we need for a neutral expected return. I don't know why this is up to.",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 38,
      "start_timestamp": "00:50:23",
      "start_timestamp_seconds": 3023.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=3023"
    }
  },
  {
    "text": "look at just a system. I don't care about the win rate just yet. But let's say that the average win is 30 and then the average loss is 70. And we can see what we need for a neutral expected return. I don't know why this is up to. So let's say that we have. Well winners and losers. You make money. So out of a system of 22 trades with this kind of win rate where it's 54 chance slight edge over it. You can essentially start to make more money over that now some of these are going to be the formulas down here messed up from the from the copy and paste. But the main thing is you can have systems that have larger losing trades in this case significantly larger losing trades that can ultimately make money. So first I need to update this. I think should be a negative and then let's take a look at this. What I'll do is I'll figure out what what the wins need to be in order for us to be profitable. And in this case you could probably make an assumption right based on the win size loss size. But I'm just showing you how you can kind of back your way into the number. So we know 50 is good. We know 40 is good. We know 35 is good. We know 30 is still good. 28 is fine. 25 is fine. 20 is no good.",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 38,
      "start_timestamp": "00:52:28",
      "start_timestamp_seconds": 3148.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=3148"
    }
  },
  {
    "text": "loss size. But I'm just showing you how you can kind of back your way into the number. So we know 50 is good. We know 40 is good. We know 35 is good. We know 30 is still good. 28 is fine. 25 is fine. 20 is no good. 22 is no good. So you need 24. So in this case you would need to have a 70.6 win probability against a 29.4 loss probability in order to have a positively expected system where you're winning 30 on average losing 70. Point is it can be done though. So has to be carefully managed. Otherwise you can set yourself up for transacting a lot because the other thing that this doesn't account for is fees and you're going to have fees. Especially when you're trading verticals you have more legs that you have to manage and you also want to make sure that you're closing out your verticals before going into expiration. So not only do you have the entry component to the trade by also the exit component of the trade that you have to pay attention to. So yeah, it's unfortunate for verticals. It's not ideal at all. But again, that's just the nature of small accounts. What you're doing is suboptimal by design because you have a small account. So that is the method around here. James says sounds like just fiddle around with the profit loss deltas to get a positive EV. It's not so",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 38,
      "start_timestamp": "00:54:09",
      "start_timestamp_seconds": 3249.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=3249"
    }
  },
  {
    "text": "all. But again, that's just the nature of small accounts. What you're doing is suboptimal by design because you have a small account. So that is the method around here. James says sounds like just fiddle around with the profit loss deltas to get a positive EV. It's not so much the deltas. But keep low max loss or risk of ruin is low. Yeah. So keeping max loss that makes sense relative to the portfolio. I wouldn't classify it as low. I would classify it again. I call it positive attribution. I would make sure that I'm correctly identifying what I'm trying to do. So the loss needs to be contextually logical relative to the size of the portfolio. But when it comes to profit and loss amounts and deltas is just using expected return formula. And I have a video on expected return, which is this. So you can check out this video. And then this video is a little bit older, but it still talks about the same thing. So it's still relevant in my opinion. Sweet. All right, gang. That wraps me up. I'll see you guys in the discord. Be an outlier. I'll see you all later. You",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 38,
      "start_timestamp": "00:55:28",
      "start_timestamp_seconds": 3328.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=3328"
    }
  },
  {
    "text": "all later. You",
    "metadata": {
      "video_id": "5G1Swz-y6tU",
      "title": "5G1Swz-y6tU",
      "url": "https://www.youtube.com/watch?v=5G1Swz-y6tU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 38,
      "start_timestamp": "00:56:59",
      "start_timestamp_seconds": 3419.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5G1Swz-y6tU&t=3419"
    }
  }
]