[
  {
    "text": "Let's talk about trading options in low volatility periods. The reason why this is important is because we're kind of in one right now, but also kind of not. And I think a lot of traders get hung up on this exact concept because if you build two unilateral of a skill set meaning maybe you just sell premium only, it can be kind of difficult to pivot and find good opportunities when the market conditions shift. So we're going to talk about two things. How to identify the type of volatility environment so that you know where to look for opportunities, which is the second part. And then at the end of the video, I'm going to show you some of my personal scans that I use to help me find where opportunities are either for long-vol, short-vol opportunities in low volatility markets. What's up everybody? Eric here. Welcome back to the outliers. Shout out to the Patreon family. Let's talk about it. So here we are. Pretty low volatility. So what this is showing you is a frequency chart of VIX closing prices in essentially on the left hand side over here in five dollar increments. And then on the right hand side, we zoom in a little bit more, which is kind of important. And I'll explain to you why the reason being is right now, if we take a look at where volatility is, I'll grab a chart. We'll go to VIX. And you'll see that",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "on the right hand side, we zoom in a little bit more, which is kind of important. And I'll explain to you why the reason being is right now, if we take a look at where volatility is, I'll grab a chart. We'll go to VIX. And you'll see that right now we're at about 13 1292 is where we closed recently. And if I zoom this all the way out, let's go even further. Let's do like a 10 year monthly. You can see that we are kind of at these fairly suppressed levels. We're definitely not what we were enjoying back in 21, 22 and even the beginning of 23. So this begs the question, well, then what kind of volatility environment are we in? And let's take a look. So over on the left hand side, this shows us the frequency of closing prices just as a raw count and then percentage on top from 1990 to 2024, the 24th of May. And you'll see that over 30 of the time, volatility is essentially below 15. And within that breakdown, if I slide myself slightly out of the way so you can see a little bit better, we can see that the vast majority of this sub component of overall sample size is 12 to 14, is where we see essentially 17 of VIX closure sub 15. So what I'm highlighting is that while the current market environment definitely is lower volatility, this is nothing novel, this",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "we can see that the vast majority of this sub component of overall sample size is 12 to 14, is where we see essentially 17 of VIX closure sub 15. So what I'm highlighting is that while the current market environment definitely is lower volatility, this is nothing novel, this is nothing new, and this is nothing extreme. All of that matters because a couple things. A lot of people think that volatility is mean reverting and it definitely is, but we're not even really at in extreme. If it was down below 11, sure, that is definitely an extreme. But volatility being between 12 and 14, it can stay there for some time. So if you're going out loading up on VIX calls, thinking, well, vol is really low and I'm going to load up because it's going to pop anytime soon, maybe, but probably not. Volatility clusters, it can stay in a specific area for quite some time. So what we're identifying here is that yes, volatility is low, not supremely low. The other thing that I want to caution people against is that when we see the VIX, the volatility index, people use that for the volatility across the entire stock market. And I actually think that can be confusing to some people because when we're identifying the period of volatility that we're in, it's first really important to identify whether it's systematic or unsystematic. Systematic meaning if it's kind of across the entire stock market and",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "across the entire stock market. And I actually think that can be confusing to some people because when we're identifying the period of volatility that we're in, it's first really important to identify whether it's systematic or unsystematic. Systematic meaning if it's kind of across the entire stock market and that's actually really useful to identify VIX because the volatility index obviously tied to the SP 500 index, which encompasses all of the large cap stocks or over 500 of them within the US. So it's useful. But notice how I kind of tied that chain together for you, VIX, SPX, SP 500 large cap companies because there's more than just large cap companies in the US. So if we go over here and we go to visualize, you can see that yes, there are obviously a lot of large cap companies. But if we go in here into the Russell, there's a lot more companies. So what I'm trying to highlight to you is that if you're using VIX to then assume if all stocks across the entire stock market are now no longer volatile, you're grossly mistaken. And you're really cutting yourself off from finding a lot of great opportunities. Now unsystematic is whether or not we're looking at an individual product. So you'll definitely find individual products all the time that go into and out of volatility. So the current vol environment as I see it is large caps definitely lower volatility. But there's still volatility to",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "great opportunities. Now unsystematic is whether or not we're looking at an individual product. So you'll definitely find individual products all the time that go into and out of volatility. So the current vol environment as I see it is large caps definitely lower volatility. But there's still volatility to be found. It's not across the entire stock market universe. So let's talk about what we can do to clearly find what kind of volatility environment we're in. Well, I just kind of showed you the start of scanning the indices. So we can see if we look at the primary indices. So SPX, how volatile it is, IV percentile is at 15. So very low. And if you're unfamiliar with IV percentile and why that's a better measure than IV rank. In this case, I'll throw a video in the notes below on that exact thing, but IV percentile in this case matters. So SPX is showing very low vol. Now let's take a look at the right 10, even lower vol, not great NDX also 12. So what we're seeing is kind of across the board low volatility. We're not seeing pockets of elevated volatility across the various indices. Now the other thing we can do to see what kind of volatility environment we're in is look at highs and lows for different sectors and different exchanges. So in this case, we have the NASDAQ here and then the New York Stock Exchange down here. The reason why",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "indices. Now the other thing we can do to see what kind of volatility environment we're in is look at highs and lows for different sectors and different exchanges. So in this case, we have the NASDAQ here and then the New York Stock Exchange down here. The reason why I like using both of these is because they look at slightly different companies, you'll see more kind of tech companies and larger companies in the NASDAQ and then the New York Stock Exchange and Compuses a lot of small caps. So looking across this while it's very, very clear that we're going through kind of a bit of a dampening period without much going on. What I'm seeing here is kind of muted movement and that typically will translate to lower volatility. If we have things that are also flying off the handle to the upside, that also will translate typically to lower overall volatility. Now if we see things accelerating to the downside like this, that tends to higher volatility and for the outlier pro Patreon members, you have access to these things scripts in the Patreon shop so you can go grab one of those if you're so inclined. But if not, there's different permutations of high lows accessible to everybody out there. So the next thing we can do is take a look at the individual sectors. So all I'm doing here is taking a look at different time frames going kind of from further out",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "so inclined. But if not, there's different permutations of high lows accessible to everybody out there. So the next thing we can do is take a look at the individual sectors. So all I'm doing here is taking a look at different time frames going kind of from further out in time, 30-day change in sectors down to the five day into the one day. And I just want to see which one of these are moving all over the place. So a decent example of this would be noticing energy down here at the bottom coming up towards the top in a five day period and then in a one day period. That's not really that advantageous for what we're looking for here. But we can take a look at energy. I would suspect it would have slightly elevated volatility compared to something like financials, which has been essentially towards the center of this group the entire time. So let's take a quick peek at energy which we have up here and the implied volatility percentile for energy right now is 22. And then if we go to financials, that's at 4. So you can kind of see the point. This is the way that we can use the sectors just to eyeball where we might find opportunities. And now if I was so inclined, I could go deeper into energy itself. But there's a couple other things we can do here. So let's take a look now at",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "point. This is the way that we can use the sectors just to eyeball where we might find opportunities. And now if I was so inclined, I could go deeper into energy itself. But there's a couple other things we can do here. So let's take a look now at some really important concepts. The first one is even if it seems like from a broad market perspective, there's not volatility. There's always volatility. We just have to learn what to look for it. So this list of things is kind of just a starting point for you. Things like upcoming earnings, base trial releases from biotechnical companies or even news updates, anything in biotech tends to be more volatile because it's often small companies that are completely predicated around a single product getting FDA approval or advancing towards that. And each one of those trial releases is kind of a big deal. So you'll find volatility there quite a lot. Upcoming economic events, things like FOMC statements, things like GDP, things like anything right now tied to inflation is quite topical. So as we're looking at CPI, PPI, unemployment, all of those kinds of things absolutely are tradable events sector events. So right now kind of to the upside, we're seeing AI, which would be contracting volatility because most things are drifting up due to that. But you can find other instances where entire sectors are being negatively impacted by something that's again, another draw for some volatility. MA",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "sector events. So right now kind of to the upside, we're seeing AI, which would be contracting volatility because most things are drifting up due to that. But you can find other instances where entire sectors are being negatively impacted by something that's again, another draw for some volatility. MA news, large stock price movements. So I'll show you a couple scans to identify that. And then even in commodities, sometimes if you're not finding in equities, you can find volatility over in the commodity space. Now that's if you still just want to trade volatility and mostly to the short side, the contraction thereof, you can also dust off your broader skill set as a trader. You can look into things like directional plays and run things like ratio diagonals. I'll throw a link in the notes below on how I like to go about that. You can still trade pairs trades, variance risk, premium plays, even if volatility is low. Sometimes when volatility is low is the best time to extract VRP from the markets. You can trade the monthly bond rebalancing dividend capture strategy. The point being there are so many things to do out there that you have to broaden your skill set just a little bit so that you don't feel like you get stuck if the market is not doing the one thing you want it to do. So as I look across my own portfolio so far this year, I notice a few",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "you have to broaden your skill set just a little bit so that you don't feel like you get stuck if the market is not doing the one thing you want it to do. So as I look across my own portfolio so far this year, I notice a few things. The vast majority of my returns are actually coming from speculative plays. One of my larger speculative plays right now is using T-Triple Q. So three times leverage ETF. That's another place that you can find volatility. Now there's a lot of risk in that. It's not quite as simple as just go in there and then you have great volatility and everything's flowery, not so much, but there's opportunity there. Zero DTEs, tons of opportunity and they're still earnings plays as I talked about directional plays via diagonals. My poor allocation is only performing at this rate so far because it's gotten most of the portfolios capital, but I've slowly started rotating that not too long ago. So if you add up all of these numbers, the speculative allocation is contributing 10.9 of my overall return so far the year where we're setting, not a great year, but not a slow year. It's kind of right in the middle. It's exactly what I'm looking for. So when I look across this, there are lots of opportunities and now I want to share with you just a few scans to help get you started. So we'll look first at",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "not a slow year. It's kind of right in the middle. It's exactly what I'm looking for. So when I look across this, there are lots of opportunities and now I want to share with you just a few scans to help get you started. So we'll look first at being able to find earnings. Very, very simple. If you go to any sort of stock market calendar, you can filter by earnings. And one of the cool things about earnings is you'll notice it's kind of perpetual. And what that means is if I click through, you'll notice that even though these are new months, it's not really any completely dead months, even this as a slower month still has some opportunities for earnings. So there will be periods where it can be slower and also the reason why this starts to get really sparse is because it's so far out they haven't announced their dates. But what I'm highlighting is that this is a great return source. Now if you're an options trader, you probably will want to have some sort of filter to make sure that what you're trading is optionable. I normally will look for something that has weak lease and you'll see that that naturally limits this a lot, which is okay, it's one return source out of several, but that's essentially you can find upcoming earnings. And then you want to analyze how they're doing for upcoming earnings releases. I have a video on",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "that has weak lease and you'll see that that naturally limits this a lot, which is okay, it's one return source out of several, but that's essentially you can find upcoming earnings. And then you want to analyze how they're doing for upcoming earnings releases. I have a video on trading earnings, which is kind of a variance, premium play. And I'll throw that in the description below as well. Now economic events is pretty simple. You can use any sort of website and see what's coming up this coming week. Now you have to get a little more attached to what is topical to the market. But again, right now interest rates, anything to do with interest rates inflation, it's going to have at least some sort of impact on the market. Now I want to show you just a couple scans, some general scans that can work really well for this stuff. First one about as basic as it gets. I'm looking at all optionable stocks that have weekly explorations. And I'm looking for things that have an implied volatility percentile quick admin note. This is in thinkorswim. So this is actually implied volatility rank. They have it messed up. So just know that there's a difference here. But anyways, I'm looking for things that are at least 40 or higher. And if we take a look at the output, there's 206 names. There's tons of names in here for you to comb through and find what looks",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "messed up. So just know that there's a difference here. But anyways, I'm looking for things that are at least 40 or higher. And if we take a look at the output, there's 206 names. There's tons of names in here for you to comb through and find what looks interesting. So if we grab just kind of a random one here, this first one, XLC, and as of 73 implied volatility percentile. Okay. So you can start taking a look in there and see if anything looks good to you. The point being is again, you now have over 200 names to go take a look at a couple of the things you can look for that I like to check out are a quick implied volatility expansion. So in this case, I'm looking for implied volatility that's blowing up by at least 15 over. You could do whatever previous period today is the Sunday. So that's why I'm using three bars ago to get me into the last trading week. This only has 16. So we can open that up maybe to five bars and see what that pulls up 19. But again, now you have another 19 names to go poke through and see if anything looks interesting to you in here. Now a big part of trading volatility to the short side is trading a lot of sloppy things that have really wide markets that are smaller flow. There's just a lot of opportunity there. So",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "names to go poke through and see if anything looks interesting to you in here. Now a big part of trading volatility to the short side is trading a lot of sloppy things that have really wide markets that are smaller flow. There's just a lot of opportunity there. So you have to be prepared if you're looking for crap to trade high volatility and you're going to find high volatility stuff. Now there's one other scan that I want to show you guys and it's a pretty simple one. But we can use it to trade a couple different things. So what I'm going to look for is something that has a kind of big price but I'm looking for a breakdown. So we can start in all stocks. That doesn't matter so much. But again, we want optionable and let's say that we want to find stuff that's actually kind of fallen off a cliff to the downside. So let's look for stuff that's at least 10 less than when it was 10 days ago and see what we get as a return here. Now here we have another 65 names to go through. Now this one's kind of cool because you can trade things either continue to the downside. So if we take a look at DKNG, it's in a bit of a free fall. This might be a great short opportunity. implied volatility percentiles only 27 but it's still elevated enough at 46 raw volatility that",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  },
  {
    "text": "of cool because you can trade things either continue to the downside. So if we take a look at DKNG, it's in a bit of a free fall. This might be a great short opportunity. implied volatility percentiles only 27 but it's still elevated enough at 46 raw volatility that you can still trade volatility in here very reasonably well. So a bunch of places to go find opportunities. They're there. Your job as a trader is to identify what the market is doing and then to fit what you're doing to what the market is doing. We don't just get to pick one specific thing that we want to see. You can do that but you're going to spend a lot of time sitting on the sidelines unnecessarily. If you have any questions, let me know in the comments. If there's anything you want to add, also throw it in the comments so other people can learn with you. Like, subscribe, share, be an outlier. See you guys later.",
    "metadata": {
      "video_id": "5K0UEOLDP5k",
      "title": "Finding Option Trades in Low Volatility Markets",
      "url": "https://www.youtube.com/watch?v=5K0UEOLDP5k",
      "upload_date": "",
      "duration": 997.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5K0UEOLDP5k&t=0"
    }
  }
]