[
  {
    "text": "What's up to the apes, a humble welcome to the outlier trading channel. Today is promised I'm going to take a look at GameStop. I had a couple questions asking just to look into recent price performance and what not the last time I did a video on this was this weekend. So it's about time just to touch base on things. As you know, I've been doing videos every day. However, it's been a little bit quiet in here. So I'm not doing GameStop every single day. I'm kind of looking through the markets and trying to share different things I'm looking at. I'm going to be talking about GameStop. So quick, Admin note tomorrow, I'm doing a live stream at 1700 Pacific time with Peruvian Bowl. And we're going to look at GameStop together. So there's actually a lot of GameStop content planned for this week because then we also still have getting through the rest of Roaring Kitty's trades. I think this is part five of analyzing all of his old trades. So we should hopefully wrap that up this weekend and continue moving through the rest of the backstory on this thing. So I am eager to see where we go from here. And then if there's anything that you want me to take a look at with Peruvian Bowl, just let me know happy to integrate as much content from you guys as I possibly can so that we're talking about the stuff that you're",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=0"
    }
  },
  {
    "text": "to see where we go from here. And then if there's anything that you want me to take a look at with Peruvian Bowl, just let me know happy to integrate as much content from you guys as I possibly can so that we're talking about the stuff that you're most interested in. That's the whole point. So to level set us here, taking a look at GameStop, it's been, as I already mentioned, it's been really quiet. And that's just kind of what it is. I know it's easy. Well, I know a lot of other people, they really go the route of like trying to pump and, you know, give people a ton of hope about everything. And I'm honestly just much more stoic than that. And that's not that I don't have emotions. It's just the fact that I kind of wait until I see things, right, that are moving. Now one thing you will notice is that I did zoom in to a three month daily. Why would I do that? Because I'm actually trying to get rid of these moves up here so that it fits a little bit better. And I'm actually going to turn off the log scale for the time being. And I want to just see what it's doing in the near term. So we obviously had a bit of a dip after earnings. Then we've had this rally and we've just been rotating a little bit sideways. Now again, we're",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 14,
      "start_timestamp": "00:01:01",
      "start_timestamp_seconds": 61.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=61"
    }
  },
  {
    "text": "turn off the log scale for the time being. And I want to just see what it's doing in the near term. So we obviously had a bit of a dip after earnings. Then we've had this rally and we've just been rotating a little bit sideways. Now again, we're falling below the point of control. And I find this generally noteworthy, mostly from the fact that volume is still very light. And we're kind of falling like a feather as I see it right now, meaning it's not like being sold off super heavy by people coming in and unloading shares. But it's also not being supported by buyers. It's mostly sale volume as it sits now, 91 for today. And I think that that's just something to keep in the back pocket. Now, from a broader macro perspective to keep in mind, GameStop and small caps in general have been struggling. So if we take a quick look at IWM, it's been kind of exhibiting similar behavior. Now previously I was actually very excited because we saw GameStop starting to rally a little bit when small caps were coming down. That's cool to see because that's positive divergence. It shows me strength in something. Now that aside, it's kind of been going the opposite way now where we're seeing IWM continue to contract. We got a little bit of a bite today. But if I look at this compared to GameStop, or I guess try to combine them",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 14,
      "start_timestamp": "00:01:55",
      "start_timestamp_seconds": 115.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=115"
    }
  },
  {
    "text": "It shows me strength in something. Now that aside, it's kind of been going the opposite way now where we're seeing IWM continue to contract. We got a little bit of a bite today. But if I look at this compared to GameStop, or I guess try to combine them into one ticker, but if I look at this compared to GameStop, we've had kind of these two down days here that looks like that divergence has slowed down a little bit. So again, generally noteworthy, I think from a broader perspective, understanding some of the sale pressure that might be coming in here. But yeah, the last thing I have to continue to reiterate because I've had this conversation with a lot of different people about like, oh, this person is able to do really good technical analysis. And that's really cool. Technical analysis is always going to be very unique to the individual. It's kind of like a shoe that happens to fit really well the way you do it and stuff like that. But again, I'm more of a data driven person. So what I've done with something like GameStop is I've taken its entire lifespan of price action. And I've analyzed all standard indicators in a few different formats, but I've used all different oscillators, primary oscillators. So RSI, MacDees, the Castics, that kind of stuff. I've used moving averages, volume profiles, Fibonacci's, volume, volume averages, volatility. Valtzility through ATR, ADR, implied volatility, realized volatility. That's",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 14,
      "start_timestamp": "00:03:05",
      "start_timestamp_seconds": 185.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=185"
    }
  },
  {
    "text": "price action. And I've analyzed all standard indicators in a few different formats, but I've used all different oscillators, primary oscillators. So RSI, MacDees, the Castics, that kind of stuff. I've used moving averages, volume profiles, Fibonacci's, volume, volume averages, volatility. Valtzility through ATR, ADR, implied volatility, realized volatility. That's kind of an overview of the broad buckets that I've looked at. And I analyze the predictive capability of these different tools. I actually have a video that's coming out this Saturday that talks a little bit about the behavior of meme stocks in general and how they tend to move. But what I'm trying to highlight is you can absolutely analyze something like GameStop. That your standard technical analysis that most people use to analyze just price and volume, it will work way differently in something like this. Standard technical analysis does not work well in GameStop. And I'm saying that from a quantitative perspective, I'm not saying that there isn't a way to use technical analysis to come up with ideas. Of course there is. But again, I differentiate the way that I look at these things because it's so easy to give yourself confirmation bias. Like, oh yeah, you know, I knew for sure it was going to do this. And then you see it happen. So then that artifact gets logged. But then when we look at that same indicator over the last X period and it doesn't trigger, we're not actually logging those failed signals.",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 14,
      "start_timestamp": "00:04:06",
      "start_timestamp_seconds": 246.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=246"
    }
  },
  {
    "text": "yeah, you know, I knew for sure it was going to do this. And then you see it happen. So then that artifact gets logged. But then when we look at that same indicator over the last X period and it doesn't trigger, we're not actually logging those failed signals. The only reason why I'm highlighting this to you is because I found in my brief duration, brief, looking at GameStop this closely over the last five months or so that it tends to have very specific behavior that does not coincide with standard technical analysis indicators well at all. So the reason why that is, if you think about the profit mechanism of something like GameStop, we have a couple of them, right? One of them is the business, hopefully, is continuing to innovate and changing direction. That's a long-term process, right? We're talking about years, literally years, for this pivot to happen and then GameStop to consume more and more market share as it expands its business lines. Maybe it gets into collectibles. Maybe it gets into e-gaming. I've heard people come up with all sorts of ideas that sound pretty cool. That's one route, long-term. Short-term are these really erratic price movements. These erratic price movements sometimes squeezes, either general short squeeze, sometimes it's gamma squeezes, sometimes it's other factors that kind of combine into something that causes these movements. These have very specific traits and they behave differently compared to what normal technical analysis is designed",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 14,
      "start_timestamp": "00:05:23",
      "start_timestamp_seconds": 323.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=323"
    }
  },
  {
    "text": "these really erratic price movements. These erratic price movements sometimes squeezes, either general short squeeze, sometimes it's gamma squeezes, sometimes it's other factors that kind of combine into something that causes these movements. These have very specific traits and they behave differently compared to what normal technical analysis is designed to analyze, which is price and volume movements, right? Because the reason being is these are structural constraints that cause these movements. This isn't the accumulation of institutional investors who are now very eager to get into GameStop and they're piling in hand over fist over the course of two days driving up price of multiple of six plus, right? That's not what's happening here. What's happening here is we're having again, some sort of short squeeze where people are being forced to liquidate unwind to cover risk that does not work with standard technical analysis. So, I just encourage people that look at this to try and think about what it exactly is that we're trying to look for and make sure that the indicators that we're doing align with that. The last point I'll make on this is support and resistance, right? Support and resistance tend to work generally well in normal periods. So if I take a look at this three month period, this looks like a very normal chart, right? We've had some pretty big movements, but still we're falling within standard deviation channels, which tracks size of moves, 95 of data will be captured in",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 14,
      "start_timestamp": "00:06:32",
      "start_timestamp_seconds": 392.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=392"
    }
  },
  {
    "text": "generally well in normal periods. So if I take a look at this three month period, this looks like a very normal chart, right? We've had some pretty big movements, but still we're falling within standard deviation channels, which tracks size of moves, 95 of data will be captured in here. Okay, cool. I'm seeing things that are having normal price rotation. I'm seeing consolidation where we get multiple days in a row of these kinds of prices, so not so forth. That's normal in GameStop exhibits normal tendencies until it's not normal. So here you might be looking at all this consolidation, seeing all this stuff going on. And the first thing that I noticed that kind of keys my interest is seeing a spike in volume in something like this. I know spike in volume doesn't always mean something is going to happen, but I do know before something has happened throughout its entire history, it does have a spike in volume. So now I look carefully and I'm thinking, okay, you know, what does this potentially look like? And you can draw all the support and resistance lines you want. Not one of them matters. Not one of them. There's essentially no consolidation here on a relative basis given these kinds of moves in this phase. This defies standard price movement and therefore defies standard technical analysis. You can't apply it here. So I want to be very clear, you can apply technical analysis here, but you",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 14,
      "start_timestamp": "00:07:49",
      "start_timestamp_seconds": 469.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=469"
    }
  },
  {
    "text": "of them. There's essentially no consolidation here on a relative basis given these kinds of moves in this phase. This defies standard price movement and therefore defies standard technical analysis. You can't apply it here. So I want to be very clear, you can apply technical analysis here, but you have to modify what you're looking at and what you're using because standard technical analysis does not work well in GameStop when it's going through its phases. It can this is standard and here completely standard. Nothing offbeat about it, but the interesting stuff about GameStop for the short term price movements via some sort of significant peak. Those break all the standard rules. So a little bit of an interesting conversation I was having with a few folks and somebody actually sent me an email asking about it. So that essential part of this video is from Mike who was just curious about how application of standard technical analysis works with something like GameStop and notice how I'm very particular. I'm not saying technical analysis, I'm saying standard technical analysis because we can still come up with tendencies profiles, things like that that use short squeezes, which again, that's a primary profit mechanism for stuff like this, not limited to GameStop for the short term movements. And again, the video on Saturday will go through that way more in detail so that you have a sense of how to look at this objectively for yourself. Okay, so now let's",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 14,
      "start_timestamp": "00:08:53",
      "start_timestamp_seconds": 533.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=533"
    }
  },
  {
    "text": "a primary profit mechanism for stuff like this, not limited to GameStop for the short term movements. And again, the video on Saturday will go through that way more in detail so that you have a sense of how to look at this objectively for yourself. Okay, so now let's take a look at the options really fast. And it's because there's a few things that stuck out to me. The first thing is we're still well over two times call to puts. I find that interesting and I continue to find that interesting even with today. However, the part that is a little more concerning to me as I think about it is we can see that there's a lot of short calls being offered. And that's people probably who have shares that are selling calls against them. I sell calls against my shares when it's in periods like this because it's a way for me to make some more money while GameStop is moving sideways or rotating over. That's exactly all there is to it. And I know some people get upset about that, which I always find funny because actually if I sell calls, then that requires a market maker to buy shares that hedge the position as it gets close to expiration, especially if my strike is in the money. So really, I thought people would be happy about that. But I get it and I joke because a lot of people just don't want anything",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 14,
      "start_timestamp": "00:10:01",
      "start_timestamp_seconds": 601.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=601"
    }
  },
  {
    "text": "a market maker to buy shares that hedge the position as it gets close to expiration, especially if my strike is in the money. So really, I thought people would be happy about that. But I get it and I joke because a lot of people just don't want anything negative GameStop, which I respect. I understand, but I'm a trader. It's what I do. So I have my shares as I continue to reiterate, but that's more of a participation thing than anything. I'm not actively trying to trade those. And then I trade options around it as it's moving, but really the only options I have right now are short calls against the shares, not covering them. So I have uncapped profit potential. And but I'm not trading directly with options right now just because it's relatively quiet. Now the other thing I want to highlight is looking at the volatility surface. We see a couple anomalies. One of them is here in 17 Jan 25. Notice how high that volatility is relative to everything else that's around it. So that's something I'll keep an eye on because those I do try to trade in here, they tend to work really well for kind of a short term relative value play for volatility. But that's kind of playing it between a couple of explorations. Maybe, you know, like a few weeks if that. So it's a short term thing that's essentially trying to play the relative movement of",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 14,
      "start_timestamp": "00:10:58",
      "start_timestamp_seconds": 658.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=658"
    }
  },
  {
    "text": "to work really well for kind of a short term relative value play for volatility. But that's kind of playing it between a couple of explorations. Maybe, you know, like a few weeks if that. So it's a short term thing that's essentially trying to play the relative movement of this volatility compared to something else. So for example, you could do this and expecting this to expand this to contract stuff like that. So that's that. Now the last thing I want to look at with you is actually just going through unusual whales really quick. And I just want to pop into a few things specifically any interesting order volume that we've gotten. And I mean, Cliff notes is I haven't really seen anything come through, but I'll still take a look at it with you. Let's take a look at what is today the second of October here. So I mean, we're like real real quiet in terms of larger volume, right? So we're even catching stuff that's hundreds of dollars. But very, very quiet today. If we take a look at yesterday, we had one coming in at the 17 Jan 25s. What I'm noticing is these longer term options have been getting hit so much more than they tend to at least based on what I've seen. Because I also know that the 35s got hit out there. So I want to highlight that just from a simple departure from the way that I've seen",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 14,
      "start_timestamp": "00:11:54",
      "start_timestamp_seconds": 714.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=714"
    }
  },
  {
    "text": "these longer term options have been getting hit so much more than they tend to at least based on what I've seen. Because I also know that the 35s got hit out there. So I want to highlight that just from a simple departure from the way that I've seen this typically move where the overwhelming concentration of OI and volume has been in the front expirations. That is genuinely not the case now. It is a bit of a mixed bag. So if we look across the different series right now for oct this coming Friday is, you know, 125 K versus 25 K 11 is 36 versus 13 18 is 269 versus 92. That is relatively new. So what that tells me is things are just a little more quiet here. That's really what this tells me. And out at that 17 Jan expiration, which we've seen hit a few times now is 180 over 96. So that means that we have actually several explorations that are higher than the front expiration, which tends to just mean quiet. But again, the one thing we have to reiterate with something like GameStop is that it is quiet until it's not, it happens fast. So just because it's quiet today doesn't mean it's not quiet tomorrow. You have to really stand your toes. I have again a series of different nets that I use to track movements, not just in GameStop, but in anything for me to trade and anything",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 14,
      "start_timestamp": "00:13:09",
      "start_timestamp_seconds": 789.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=789"
    }
  },
  {
    "text": "not, it happens fast. So just because it's quiet today doesn't mean it's not quiet tomorrow. You have to really stand your toes. I have again a series of different nets that I use to track movements, not just in GameStop, but in anything for me to trade and anything like this, they tend to move really fast. So you have to be ready to pivot quickly, which kind of is what makes them fun. So that's what I'm seeing in GameStop is always anything that you want to take a look at. Let me know anything we should look at in the live stream tomorrow with Proveum Bull. Let me know. And then the same thing for the Saturday, GME live stream, we're typically focusing on roaring kiddie's old trades, but anything else that we should dive into after that goes super far into the weeds. You know, I'm here for it. Do you need anything? Let me know. I'll be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "5YK9YbXMgMM",
      "title": "GME Stock Breakdown: Key Technical Analysis & Options Strategy Insights",
      "url": "https://www.youtube.com/watch?v=5YK9YbXMgMM",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 14,
      "start_timestamp": "00:14:14",
      "start_timestamp_seconds": 854.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=5YK9YbXMgMM&t=854"
    }
  }
]