[
  {
    "text": "What's going on, everybody? So we got my best friend, David Hunter back here again. I say my best friend because every time I talk to you, I learn a ton. So first off, welcome back. I think this is your third time. So it's great to have you again. Yeah, thanks Eric. I'm glad to be back. And so pleasure. So obviously, the, you know, the last few times we spoke, we got a ton of general market context from you, just in terms of how you view things, why you view them that way, those sorts of things. And I figured that today would be really engaging to kind of follow along that same thought pattern. That's actually one of my favorite parts that we've kept this fairly regimented, you know, every three or four months because you get to see how you perceive information as it rolls out. And I think that's actually really informative for people. It's like we were just talking about just about everybody on the internet wants the magic answer. But unfortunately, you know, circumstances continually change. So what I really value in these conversations is you sharing your experience with us and essentially teaching people how they can think about things and come to their own conclusions, you know, again, leveraging your experience. So I'm really looking forward to chat with you. So I figured a great first softball starter question is how do you think the Fed is handling the current",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 34,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=0"
    }
  },
  {
    "text": "essentially teaching people how they can think about things and come to their own conclusions, you know, again, leveraging your experience. So I'm really looking forward to chat with you. So I figured a great first softball starter question is how do you think the Fed is handling the current market? Yeah, that's one that might take the rest of the interview. It's a mixed bag for sure. You know, the Fed's got a tough job on their hands. We had inflation break out in the last year to the levels we haven't seen in 40 years. They kind of slow walked it initially and thought it was transitory. So all of a sudden in January, when I really started heating up, they had to play catch up and they've been playing catch up ever since. You know, I have probably a little bit different view than a lot of people and I've been a thought Fed watcher for all of my 49 year career. And I've seen all the various Fed make ups, you know, through that time and Fed chairman. I, and I've had a mixed review on Paul over his time here in the chair, you know, back in 2018, I was really critical of him. He was fairly early on in that role. And he made some blunders and, you know, the market sold off because of some of that. But more than that, he just, it was showing that he's an experience at that time.",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 34,
      "start_timestamp": "00:01:38",
      "start_timestamp_seconds": 98.68235294117648,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=98"
    }
  },
  {
    "text": "back in 2018, I was really critical of him. He was fairly early on in that role. And he made some blunders and, you know, the market sold off because of some of that. But more than that, he just, it was showing that he's an experience at that time. He'll fast forward to March of 2020 and he stepped right up to the plate. He did the job he had to do to save the system when we're shutting down the entire economy. So I gave him plot it for acting quickly and decisively. You know, you're not going to be perfect when you're in that kind of environment, but he did a good job. And then now, certainly these last few months, I fear he's doing what he has to do in terms of you can't ignore the inflation. You've got to tighten. So I agree with all that. But some of his rhetoric and, you know, they're kind of long runway for tightening and things. I think is showing that he does not really understand the magnitude of the risk that is out there. I feel they are over tightening. And frankly, it's funny to say that because they really are, you know, they've only hiked a few times. They're still way under what the market is in terms of market rates. But the market did the tightening for him and I'm not sure he understands that. So there's, you know, some concerns there. I do think",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 34,
      "start_timestamp": "00:03:17",
      "start_timestamp_seconds": 197.36470588235295,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=197"
    }
  },
  {
    "text": "because they really are, you know, they've only hiked a few times. They're still way under what the market is in terms of market rates. But the market did the tightening for him and I'm not sure he understands that. So there's, you know, some concerns there. I do think they should pivot fairly soon. Whether a pivot means just a cause in the rate hikes after we get through July or whether he's going to, you know, take longer to recognize the needs to pause and the needs to pivot. It's hard to say. But frankly, I think the economy is rolling over. There's a lot of things I look at. It's not that you're going to see it immediately in the GDP number or, you know, every, every economic data point that comes out is going to be negative. But in general, we're seeing the things that lead to a pretty sharp downturn. And I'm not sure again, the Fed is doing enough forward looking. I think there's so caught in looking at the present looking backwards based on looking at data, which is telling you what happened last month. That I think they're going to end up being as they almost always are late in recognizing the needs shift. And so, you know, on that basis, I'd say he's, you know, he's back in my doghouse in terms of still learning on the job. You live up to your continued reputation as a contrarian because I think",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 34,
      "start_timestamp": "00:04:56",
      "start_timestamp_seconds": 296.0470588235295,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=296"
    }
  },
  {
    "text": "being as they almost always are late in recognizing the needs shift. And so, you know, on that basis, I'd say he's, you know, he's back in my doghouse in terms of still learning on the job. You live up to your continued reputation as a contrarian because I think you're the first person. I truly have heard say that you're postulating that they might be over tightening at this point, especially, you know, there's even more conversation about the next rate hike a while. They were talking about 100 basis points. Then they said, nah, that's a little too much. Maybe, you know, 75 basis points. And it seems like your perspective is even that might be too much. But I would be really curious to understand you also mentioned, you know, that the market did some of the tightening, essentially on the behalf of the Fed. So when we think about July and we think about the next quarter, what do you think should happen with rates and more importantly, why do you think that? Yeah. So first of all, the reason I say the bond market has done a lot of the tightening for the Fed and did most of it prior to their first hike back in April is because you had a 200 basis point jump in rates in a very short period of time, just a few months time. So you went from, you know, extremely low rates to, you know, 200 basis points",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 34,
      "start_timestamp": "00:06:34",
      "start_timestamp_seconds": 394.7294117647059,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=394"
    }
  },
  {
    "text": "did most of it prior to their first hike back in April is because you had a 200 basis point jump in rates in a very short period of time, just a few months time. So you went from, you know, extremely low rates to, you know, 200 basis points up on that low base was a huge jump, historic jump. Right. That's already showing up in terms of housing is rolling over. It's showing up in terms of retail sales and the inventory bill that we're seeing in retail. It's showing up in consumer confidence or consumer sentiment. The mission consumer sentiment is the lowest that series has ever been. I think those are all signs that that even though it's still historically low rates, when you have that magnitude of a change in a short time, it's that rate of change in the rate that can have a dramatic impact. I mean, simply put, a mortgage rate that was, you know, two and three quarters is all the sudden, six percent. Right. It's a huge change for home buyers and it really shut down activity. And maybe as important or maybe more important, it shut down, re-fi activity for a long time with rates so low, there was the ability for homeowners to re-fi, pull money out of their home and have spending power that didn't, didn't mean they were building credit card balances up. And because their home price were going up, they said, hey, this is,",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 34,
      "start_timestamp": "00:08:13",
      "start_timestamp_seconds": 493.41176470588243,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=493"
    }
  },
  {
    "text": "for a long time with rates so low, there was the ability for homeowners to re-fi, pull money out of their home and have spending power that didn't, didn't mean they were building credit card balances up. And because their home price were going up, they said, hey, this is, I'm just taking some of the equity out of my helps to do things. And now with rates where they are, there's hardly any, and probably no re-fi activity at all. That's a huge, huge drain of liquidity that had previously helped the economy. So those are the things I mean. And then the other tightening really isn't the bond market. It's the big run up in gasoline crisis and home heating oil prices. So that was another tax on consumers that really, you know, the Fed has to account for because it does take money out of the consumer's pocket and money that might have otherwise gone to going out to dinner, you know, buying, you know, new furniture would have you, people saying, I'm just getting by, I'm doing what I can to get by. And frankly, with the run up in credit card balances of late, I think they're not even getting by, they're finding the app to, you know, they've drained their savings, savings is down at sharply lower levels than it was last couple of years. And now they're turning to their credit cards because it's costing, you know, the cost of living is gone",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 34,
      "start_timestamp": "00:09:52",
      "start_timestamp_seconds": 592.094117647059,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=592"
    }
  },
  {
    "text": "think they're not even getting by, they're finding the app to, you know, they've drained their savings, savings is down at sharply lower levels than it was last couple of years. And now they're turning to their credit cards because it's costing, you know, the cost of living is gone up so fast. So while I understand the Fed's focus on that cost of living and saying we've got to get inflation now, it's hitting the consumer, they also have to realize the other aspects of what that cost of living has done. It's, we're going to see, you know, their whole goal is to basically have demand destruction and then bring inflation down. That's the way the Fed can control inflation or have any impact on inflation. But they have to understand that you're going to see maybe a lot more demand destruction than you're counting on. And by the time you see it, if you wait for that, you've gone way past the time when you can turn this thing back up and have a soft landing. So that's the crux of the problem is I think the Fed is at risk of creating a hard landing here because as I say, they don't really understand the leads and lags to their policy. When you see them operating on the basis of a consumer price index that, you know, jumped up to 9 last week or a couple of weeks ago. And they're making a determination on rates,",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 34,
      "start_timestamp": "00:11:30",
      "start_timestamp_seconds": 690.7764705882353,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=690"
    }
  },
  {
    "text": "because as I say, they don't really understand the leads and lags to their policy. When you see them operating on the basis of a consumer price index that, you know, jumped up to 9 last week or a couple of weeks ago. And they're making a determination on rates, you know, two weeks, three weeks later, based on that number. They're operating on yesterday's news to determine policy for tomorrow's economy. That's not the best way to go. You really, as an economist, should be looking forward. And I'm just not convinced that they do enough of that. And just for a point of my own education, so I guess I always presumed that when the Fed released, you know, different metrics that they would have plenty of daily or even weekly, you know, internal updates leading into the actual release. Do they not have the toolkit to be able to kind of be more sensitive? As you rightly point out, and I think it's important to know, you know, two things. A lot of the indicators that they look at inherently are lagging, but the other component is if they're looking at lagging indicators so intermittently, it seems like they lose a ton of sensitivity when really, obviously, we all think they should gain more sensitivity to be more reactive in the current environment. Do they not just have that toolkit or like, what's the disconnect they're leading to them not getting data quickly enough? Yeah, well, they",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 34,
      "start_timestamp": "00:13:09",
      "start_timestamp_seconds": 789.4588235294118,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=789"
    }
  },
  {
    "text": "like they lose a ton of sensitivity when really, obviously, we all think they should gain more sensitivity to be more reactive in the current environment. Do they not just have that toolkit or like, what's the disconnect they're leading to them not getting data quickly enough? Yeah, well, they have hundreds of economists feeding them data. And those economists certainly are trained to look at leading indicators and understand, you know, how to forecast, et cetera. But I will say that what I see in this current Fed makeup, and again, it's not that unique. We've seen it in past Fed regimes. They're really focused on headline news. I mean, you know, once CPI gets so much attention on CNBC and Bloomberg, the Fed can't help but say, hey, we got to pay attention to this too. So it's not that they're not able to, you know, that they're not being economists or not getting good economic data. I just think their bias is towards what's in the headlines and what's, you know, kind of currently in, you know, at the forefront of the media and they're responding to that. And I just, some of that comes from maybe not being as market savvy a group. I've been a criticism for years that the Fed is more academic oriented. You know, you got academics running it so they're not as tuned into maybe market factors that can be leading indicators. You know, personally, I would like them to focus",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 34,
      "start_timestamp": "00:14:48",
      "start_timestamp_seconds": 888.1411764705883,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=888"
    }
  },
  {
    "text": "not being as market savvy a group. I've been a criticism for years that the Fed is more academic oriented. You know, you got academics running it so they're not as tuned into maybe market factors that can be leading indicators. You know, personally, I would like them to focus more on some of the things that are early indicators that maybe it's time to think, have we finished? You know, should we, should we start looking the other way? When lumber comes down from, you know, 17 and lumber future down from 1700 to 500 and below 500, actually, that's a sign that, you know, you've had a big impact on housing. You've had a big impact on construction. When, you know, when used car sales prices are falling pretty dramatically. It's a sign that maybe inventories, you know, we're finally getting a handle on, new car inventories are getting back in line. So that maybe, you know, that's not an, you know, maybe we need to realize that prices are going to come down as that, you know, as that supply chain situation clears up. When you see a big jump in inventories at Target and Walmart and other retailers to the levels that we've seen that are wavy on anything that's precedent, you need to set up and take notice of that and say, gee, because what a recession really is is an inventory correction. We've got some very big inventories building around the country. So, you",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 34,
      "start_timestamp": "00:16:26",
      "start_timestamp_seconds": 986.8235294117649,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=986"
    }
  },
  {
    "text": "other retailers to the levels that we've seen that are wavy on anything that's precedent, you need to set up and take notice of that and say, gee, because what a recession really is is an inventory correction. We've got some very big inventories building around the country. So, you know, it's just those kind of things that I think it's not that they're not seeing them. I just think they'll be in kind of distracted by the headline inflation numbers. And as I say, you know, there's leads and lags to policy. So you need to be looking, I mean, Greensfield was probably the one Fed German that I saw got this to a degree. And he was notorious early on in his career when he was a private economist. That's not being a very good market person and stuff, but he learned and during his reign as as Fed chairman, he was zicking and zagging earlier than was typical for for a Fed because he understood that if I wait for the, you know, the proof, it's too late. So, and that's kind of what gave us the first elongated cycle we had under his regime. And this one's very long, but that's for different reasons. And interestingly, you already read my mind on the next follow-up question, which is with seeing a lot of commodities coming down as aggressively as they are. Sometimes we could view that as a leading indicator of where inflation might be going.",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 34,
      "start_timestamp": "00:18:05",
      "start_timestamp_seconds": 1085.5058823529414,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=1085"
    }
  },
  {
    "text": "one's very long, but that's for different reasons. And interestingly, you already read my mind on the next follow-up question, which is with seeing a lot of commodities coming down as aggressively as they are. Sometimes we could view that as a leading indicator of where inflation might be going. But with things crashing as hard as they are, I would be interested in your perspective on what is the propensity for a recession as you see it today right now. Yeah, I believe we're in recession right now. We're probably going to get a negative GDP print for the second quarter. So, by definition, the first quarter was negative. Second, that doesn't get revised. You can have two consecutive quarters of negative GDP. That's a recession. But even more than that, it's these other things we're seeing in the economy that suggest if we're not in recession, we're pretty darn close. And my concern is again that what's lining up is that from here, the drop gets a lot more aggressive. So housing is rolling over. I think it rolls over hard in coming months. Autos could roll over hard. You're seeing retail having to correct that historic inventory number. That's going to cause problems. The consumer has tapped out. I mean, he's, you know, would gasoline at 5 now? Yes, it's come down, but it's still high. He just doesn't have discretionary spending. And what I think we are seeing this summer is, the pandemic has also made",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 34,
      "start_timestamp": "00:19:44",
      "start_timestamp_seconds": 1184.188235294118,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=1184"
    }
  },
  {
    "text": "number. That's going to cause problems. The consumer has tapped out. I mean, he's, you know, would gasoline at 5 now? Yes, it's come down, but it's still high. He just doesn't have discretionary spending. And what I think we are seeing this summer is, the pandemic has also made things harder to forecast probably or made it different. What we're seeing this summer, I think, is consumers are switching. They don't have money for both. So they're switching from the material buying that they did during the pandemic. You know, a lot of money spent on the houses and their yards and things like that. Yacht tries equipment, etc. of computers. Now they're switching to experiences. You know, we're going to go on vacation. We haven't done a long vacation a long time. We're, you know, we're going to take a, on air, you know, we're going to, we're going to take an airline and go somewhere. We're seeing a lot more of that. We're going to do a cruise. So they're not, now they're kind of backing off from the expenses on the home and other, you know, material purchases, durable purchases and they're going to, you know, maybe a little more vacation type stuff dining out. What have you, my concern is that's kind of probably more seasonal than anything. It's because of summer and they're saying, hey, we didn't get to take a vacation last two years because of the pandemic and they're doing it. But",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 34,
      "start_timestamp": "00:21:22",
      "start_timestamp_seconds": 1282.8705882352942,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=1282"
    }
  },
  {
    "text": "maybe a little more vacation type stuff dining out. What have you, my concern is that's kind of probably more seasonal than anything. It's because of summer and they're saying, hey, we didn't get to take a vacation last two years because of the pandemic and they're doing it. But they may be kind of extending themselves to do it. When someone gets done, that's gone, but it doesn't mean you flip, flop back to the, you know, the material purchases. So you're still going to be, I think, in a situation where both are gone and there goes the economy, you know, service and other word services and, you know, consumer spending are gone. One of the interesting articles I read not too long ago, it was from one of the banks. I don't remember if it was Goldman, I think it was Goldman, but they were talking about, this was only a few months ago and they were talking about how consumers had unhistorically high savings because of what they were seeing, you know, the stimulus from COVID, they weren't spending a ton on like you were just highlighting a lot of vacations going out, things like that. And it seems like the burn rate for that is much faster than they anticipated or it seems like they might have been messaging that to try to get people to calm down a little bit. But when does the pin drop in your mind when saying, yeah, consumers are",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 34,
      "start_timestamp": "00:23:01",
      "start_timestamp_seconds": 1381.5529411764705,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=1381"
    }
  },
  {
    "text": "And it seems like the burn rate for that is much faster than they anticipated or it seems like they might have been messaging that to try to get people to calm down a little bit. But when does the pin drop in your mind when saying, yeah, consumers are tapped out, they've essentially spent what they could, they don't have money to spend more. When, when does that occur? Like, yeah, when is that occurring your mind? Yeah, I think it's about to occur or is it occurring? So we're there. Frankly, you know, we had a 35 savings rate back in the pandemic because of all the handouts, you know, you have a trillion of money going out to people in terms of the stimulus checks. And we had, I mean, we're not impressive. We never saw money like we've seen come out of the government. It got banked, it got put in savings. That has gone from a 35 rate down to 4.4 rate, which is actually below the pre pandemic levels. That's to have that happen in a matter of months, you know, I think a year is just unbelievable. And it's a sign of two things. One, that the consumer is having trouble keeping up with cost-living. But secondly, and this is the thing that's hard to get a handle on, is there are a lot of people who took that money and said, hey, this is great. I don't have to work. You know,",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 34,
      "start_timestamp": "00:24:40",
      "start_timestamp_seconds": 1480.235294117647,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=1480"
    }
  },
  {
    "text": "things. One, that the consumer is having trouble keeping up with cost-living. But secondly, and this is the thing that's hard to get a handle on, is there are a lot of people who took that money and said, hey, this is great. I don't have to work. You know, I'm staying home. And they, they're at that level now where they used up that savings in many cases. And yeah, there's still jobs out there right now. But that may not be the case six months from now. And, you know, you are seeing, particularly in the technology sector, a lot to big layoffs in companies that never had layoffs. You know, the Tesla is a little world, the Apple's a little world, the Google's a little world, you know, the Facebook's a world. They're starting to have to look at costs and cut costs. And I think that's going to be for them. For the younger generation, you know, a place where it was always a source of jobs may not be anymore. And they, you know, kind of anecdotally, you know, you, you, anywhere you go, restaurants are saying we can't get help. You know, dry cleaners are saying we can't get help. You know, the targets of the world, you know, their, their stores are messier because they don't have the same ability to get, you know, part-time employees to do the work. Or what have you? So I think we have somehow the pandemic has",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 34,
      "start_timestamp": "00:26:18",
      "start_timestamp_seconds": 1578.9176470588236,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=1578"
    }
  },
  {
    "text": "are saying we can't get help. You know, the targets of the world, you know, their, their stores are messier because they don't have the same ability to get, you know, part-time employees to do the work. Or what have you? So I think we have somehow the pandemic has changed, particularly that entry level person, you know, or that crowd of people, who particularly let's say part-time high school help, you know, some are help during your college years, et cetera. We're just not seeing the same flow of people into those jobs. And I, I don't hear anybody talking about that, but I think that is part of the story too. Yeah, that's, it's an interesting perspective because as you were just sharing some of the places that are short of help, even here, you know, you're on the East Coast, I'm on the West Coast, and it's the same exact thing here in San Diego where we're seeing the same exact instances where places are having a hard time finding people. And also to your point, you know, on revising guidance, I don't know if you saw that Apple, you know, they just essentially advised revised guidance a couple days ago. They're coming up on earnings soon. I think this week or next week. And they were saying, you know, hey, we're kind of slowing spending, we're slowing, developmental spending over the next year. We're kind of buckling up here. And I think that shook a lot",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 34,
      "start_timestamp": "00:27:57",
      "start_timestamp_seconds": 1677.6000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=1677"
    }
  },
  {
    "text": "a couple days ago. They're coming up on earnings soon. I think this week or next week. And they were saying, you know, hey, we're kind of slowing spending, we're slowing, developmental spending over the next year. We're kind of buckling up here. And I think that shook a lot of people up because of exactly what you're talking about, you know, everybody looks at Apple. I mean, Apple literally is a cash cow. I'm pretty sure they have like a swimming pool of gold coins that Scrooge McDuck could swim in. But even they're talking about, they want to slow it down. So I think everybody's looking at that as kind of a precursor that, you know, even the big names with a ton and ton of support and resources are starting to slow it down. So I think that, yeah, go. Yeah, I was going to say because I episode, you know, we're talking so much about the near term. But as you know, I have a forecast for the next year of a global bust. So getting from here to there may not be a, you know, complete straight line. We may have a bounce in one of these quarters. But I think what is being overlooked is because I keep hearing among a lot of pundits and elsewhere, a lot of people talking soft landing and saying, well, the market's pretty much discounting that shallow recession. We're not looking for anything, you know, deep. And I",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 34,
      "start_timestamp": "00:29:36",
      "start_timestamp_seconds": 1776.2823529411767,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=1776"
    }
  },
  {
    "text": "of these quarters. But I think what is being overlooked is because I keep hearing among a lot of pundits and elsewhere, a lot of people talking soft landing and saying, well, the market's pretty much discounting that shallow recession. We're not looking for anything, you know, deep. And I feel like everything is lining up for a very deep recession. In fact, what I call the biggest downturn in the past 80 years. And, but it doesn't get there immediately, you know, it kind of gradually gets there. It's, it's like things happen slowly and then all of a sudden they happen fast. And, and I think at least from what my work shows right now, we're probably not going to see that bust much before the end of the year and then it'll dominate 2023. But it's all one thing. People on Twitter will ask me, you know, what happens between your recession and your bust. That goes all one thing. It's all part of the same, you know, Fed tightening cycle. It's all part of the same thing. It just, you know, doesn't necessarily all happen in a very linear way, not the one. And number two, even if it is fairly linear, it takes time to get to that second stage where it's, it's, of what's global and number two, it's very deep. And there's kind of two different avenues I want to discuss off of that. I'll pivot more to just your overall assessment first",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 34,
      "start_timestamp": "00:31:14",
      "start_timestamp_seconds": 1874.9647058823532,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=1874"
    }
  },
  {
    "text": "even if it is fairly linear, it takes time to get to that second stage where it's, it's, of what's global and number two, it's very deep. And there's kind of two different avenues I want to discuss off of that. I'll pivot more to just your overall assessment first because again, everybody would string me up if I didn't dive a little further into what you're expecting. And it's for good reason. You have a very informed opinion. So I know the last time we spoke, we were talking about a meltup leading into a global bust. And I know on Twitter, people are always at your throat, you know, asking, is this to melt up? Is this the melt up? Is that the melt up? And one of the things I am wanting to understand from your perspective is a lot of times we do see that, right? Where there is a pretty profound movement in the broad scale markets before there's a even broader decline that's fairly common throughout the history. But how much does the Fed interjection factor into your decision if it does at all? I'm curious if what they're doing and what kind of impact that has on your assessment of things. Yeah, first, I am still calling for that melt up. And I think, I think the lows are in for this. There's no guarantees. I mean, it's true. It's quite possible that you could undercut the 3650 on the SP and go",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 34,
      "start_timestamp": "00:32:53",
      "start_timestamp_seconds": 1973.6470588235297,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=1973"
    }
  },
  {
    "text": "impact that has on your assessment of things. Yeah, first, I am still calling for that melt up. And I think, I think the lows are in for this. There's no guarantees. I mean, it's true. It's quite possible that you could undercut the 3650 on the SP and go down to 3500. I can't roll that out. That could happen. But I think the more likely scenario is that we saw the lows in June down at 3650, we've been basically spending the last month kind of slowly working our way up from 3650, you know, got up to 39, almost 4,000 today and backed off. I don't know where it is now, but and so, you know, I think we can, you know, there's a pretty good chance that we saw the lows. You know, if I were picking up a scenario and again, it could go any number of different ways, but right now there's a setup where we could go to 41, 4,200 and then back off back to, you know, the 38 or 900, but still stay above the lows so that you can say the bottoms in or the worst of the correction is behind us, but that doesn't mean you're off to the races in the next two weeks. Right. You know, you got the Fed meeting next week, etc. So that's what's confusing. When people say, is the meltup beginning? Well, people might, if I said yes, people might take that to",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 34,
      "start_timestamp": "00:34:32",
      "start_timestamp_seconds": 2072.329411764706,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=2072"
    }
  },
  {
    "text": "behind us, but that doesn't mean you're off to the races in the next two weeks. Right. You know, you got the Fed meeting next week, etc. So that's what's confusing. When people say, is the meltup beginning? Well, people might, if I said yes, people might take that to mean, okay, we're straight up from here. No, it's probably still in a period where it's going to be back and forth trying to sort this out, but I think the lows may may well be in. And I do believe over the course of the next several months, we're going to head towards 6,000, the SP 20,000 on the NASDAQ, you know, 45,000 down. Those are huge historic moves. If they happen as fast as they could, by the end of the year or, you know, it could spill over into next year, that's a very steep move that's almost unprecedented. It's certainly only present. There's a couple times in history. But I think that's what we're probably going to have. People go based on what I just talked with you about Eric in terms of the economy. For a lot of people, that seems like it doesn't jive. You know, how can you be talking about what I'm talking about such awful economy in the next year? And what I think could happen is the Fed can pivot or the Fed can see some of what I'm talking about coming in terms of the economy and say, hey,",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 34,
      "start_timestamp": "00:36:11",
      "start_timestamp_seconds": 2171.011764705883,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=2171"
    }
  },
  {
    "text": "You know, how can you be talking about what I'm talking about such awful economy in the next year? And what I think could happen is the Fed can pivot or the Fed can see some of what I'm talking about coming in terms of the economy and say, hey, maybe we did go too far and they can either just pause or they could even pivot. And the market is so bearish right now and so positioned for the downside that they may have to, first of all, cover shorts and secondly come running back in because they're out of sync with what's going on. I think we can have a very concentrated move. And people say, well, if people see the bad news in the economy, how can they justify buying? What will happen is they'll view this as the tightening cycle is over. The Fed's beginning to have our back is the winds that are back again instead of in our face. We can look over the trough and start seeing better times six months or nine months from now, markets discount six and nine months in advance. Does that mean six or nine months from now things are going to be good? I don't think so. I think they're going to be bad. But that's my expectation. That's my forecast. The street could easily say, okay, the Fed did its job. We're having a soft landing and we can look over the soft landing to better",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 34,
      "start_timestamp": "00:37:49",
      "start_timestamp_seconds": 2269.694117647059,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=2269"
    }
  },
  {
    "text": "things are going to be good? I don't think so. I think they're going to be bad. But that's my expectation. That's my forecast. The street could easily say, okay, the Fed did its job. We're having a soft landing and we can look over the soft landing to better times. And that better times if they've, if inflation starts coming down as I think it will, if the oil prices keep coming down as I think they may, as some of these things show up in inflation numbers, people can start saying, hey, the Fed did its job. Now we have room for the next part of the cycle, or it extends a cycle for a couple of few years. Again, I'm not forecasting that, but that's what street expectation could become that could justify a big run in the market. And what I think is pretty clear is that everybody right now, I should say everybody is certainly a large majority of people expect lower lows, expect a longer tightening cycle. If that changes, if people's expectations change, you will be very, I think people will be very surprised at how fast we go from this negative environment we've had all through this year into a very positive environment. Marked market-wise. Right. Yeah, it's a fascinating perspective and I could see the catalyst in that scenario, especially because you're right. I do think the broad sentiment is everybody's buckling up for a bumpy ride. So if it seemed",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 34,
      "start_timestamp": "00:39:28",
      "start_timestamp_seconds": 2368.376470588236,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=2368"
    }
  },
  {
    "text": "we've had all through this year into a very positive environment. Marked market-wise. Right. Yeah, it's a fascinating perspective and I could see the catalyst in that scenario, especially because you're right. I do think the broad sentiment is everybody's buckling up for a bumpy ride. So if it seemed like the Fed was starting to change or even soft in their tone, I think the market, and they have a couple times the markets react already in some small ways regarding potential rate raises. So that leads me to the next question then, which is if that doesn't happen. So let's say we get to the next FOMC meeting and the Fed says, nope, inflation is still too high. Do you still think that there's a scenario for the melt-up to occur before the bust? And if so, what does that scenario look like? Yeah, I will tell you, and I've said this many times on Twitter, I always say that the bond market leads and the Fed follows. So I'm not in the business of trying to predict what Jay Powell is going to do or what FOMC is going to do on any, you know, at any given time, I could give you a general idea of what I think they might do over time. But how do I know what they're going to do? You know, I don't frankly, my guess is we'll see 75 base points, which is pretty much consensus right now and next",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 34,
      "start_timestamp": "00:41:07",
      "start_timestamp_seconds": 2467.058823529412,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=2467"
    }
  },
  {
    "text": "given time, I could give you a general idea of what I think they might do over time. But how do I know what they're going to do? You know, I don't frankly, my guess is we'll see 75 base points, which is pretty much consensus right now and next week's meeting. But I can't say, it couldn't be a hundred. You know, they're humans. They can make their mind up next week. So I don't play the game of trying to predict exactly what they're going to do in a particularly meeting. And I also don't play the game of saying, okay, I know July's last one and they're not going to hike in September. I have no idea. But what I can do with some predictability is look at the bond market. And I think the bond market is signaling lower rates. So I, you know, whether the Fed is in sync with what the bonds are going to be doing over the next three months, I can't tell you. But I'm pretty sure, you know, at least my confidence is that that in the over the next three months, interest rates are coming down, treasury bond wise, you know, I think 10 years heading for two and a half and maybe two percent by the end of the year, I think the 30 years heading, you know, down from three percent down. Now right now, we're going to a little backup in rates last two days. You",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 34,
      "start_timestamp": "00:42:45",
      "start_timestamp_seconds": 2565.7411764705885,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=2565"
    }
  },
  {
    "text": "you know, I think 10 years heading for two and a half and maybe two percent by the end of the year, I think the 30 years heading, you know, down from three percent down. Now right now, we're going to a little backup in rates last two days. You know, we could go to 320 on the 10 year before we go down. That's, you know, it's currently, you know, three percent are thereabouts. Because the Fed is behind the curve, they can hike. And my, my, my forecast is not dependent on whether they stop after July or whether there's another hike in September. It really doesn't matter as long as bonds are doing what I expect. And I'm pretty confident that we're going to see lower rates, lower inflation. And the Fed will, you know, maybe pause after July or maybe pause after September. I think it's one or the other. And I don't think my scenario, you know, melt-up scenario depends on which it is. So like I said, I just, I can give you my best guess that they pause after July, but I'm not too, I'm not too confident that I can predict what Paul's going to do in the next two months, three months. Yeah. So, so basically my forecast is a melt-up first and haven't changed. Melt-up first to the same targets I've had all year. And then a global bust and 80 percent bear market. So I think there were nowhere",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 34,
      "start_timestamp": "00:44:24",
      "start_timestamp_seconds": 2664.423529411765,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=2664"
    }
  },
  {
    "text": "Paul's going to do in the next two months, three months. Yeah. So, so basically my forecast is a melt-up first and haven't changed. Melt-up first to the same targets I've had all year. And then a global bust and 80 percent bear market. So I think there were nowhere near the end of trouble. I just think there's a respite here that's going to be some, surprisingly strong in terms of how it's reflected in the market. Yeah, that's really helpful context to understand the catalyst specifically for the melt-up, mostly coming from bonds. And whether or not the Fed has, you know, a contributing factor or not, that's less so the focus for you, which is, it's interesting to watch that. So I'm actually really curious to see how that will work out. And then we have, you know, a little less than five minutes left. So I would love to understand what precedes the bust. How do you see the economy looking when we start hitting your targets from the melt-up and what is the economic functions that start leading to the actual bust? I'm assuming it has to come from a global scale. So there's probably external factors as well. But yeah, love your thoughts. Yeah, so it's, there's a lot of different aspects of this because it is a global bust. I think some of the trouble is going to be, the triggers are going to come from overseas. Whereas, you know, in 2008-09, it",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 34,
      "start_timestamp": "00:46:03",
      "start_timestamp_seconds": 2763.105882352941,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=2763"
    }
  },
  {
    "text": "external factors as well. But yeah, love your thoughts. Yeah, so it's, there's a lot of different aspects of this because it is a global bust. I think some of the trouble is going to be, the triggers are going to come from overseas. Whereas, you know, in 2008-09, it was our subprime problem, was the primary trigger. This time around, I think, Europe's in more trouble than we are. Obviously, you know, everything going on in Ukraine and going on with natural gas. Those are all things that are putting, you know, if we're in trouble, Europe's really in trouble, right? I mean, they don't know whether they're going to have energy to, to heat homes next winter to the degree they need. So, and inflation is really breaking out there as it is here. And they still are in, on the short end, still in negative rate territory. And so they have to hike, you know, tomorrow the ECB decides what they're going to do. There's, you know, talk of a 50-based point hike. We don't know what they're going to do. You know, it's going to be a hike, I think, pretty definitely whether it's quarter or 50, I don't know. But those are the kind of things that I think could be part of where the bus comes from as well is they have to, they may be hiking into a very weak environment, even more so than we are. And they may not have as",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 34,
      "start_timestamp": "00:47:41",
      "start_timestamp_seconds": 2861.788235294118,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=2861"
    }
  },
  {
    "text": "50, I don't know. But those are the kind of things that I think could be part of where the bus comes from as well is they have to, they may be hiking into a very weak environment, even more so than we are. And they may not have as much staying power as we did during this period of higher rates, you know, that we had some resilience built in that they don't have. So, you know, all of that you've got a more leverage financial system over in Europe this time around. You've got, you know, weaker, you know, I think, hollow or economies for a number of reasons. The ECB, you know, you've got different countries in different places so their policy can really hit some of the country's hard and harder than others. And your strong points, you know, particularly Germany is facing some pretty dire situation. So, there's lots of reasons to point to Europe as a problem. I think Australia and Canada, if, if, you know, commodities start coming down here, that's going to impact them. Canada's housing is where we were in 2008-09. They're much more leveraged than than we are today. Australia's real estate is straight up for, you know, a long time. So, they're very vulnerable. And, you know, we have Asia that's having to deal with a very strong dollar. That's, you know, that's an unknown in terms of when are we going to have some accidents come about because,",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 34,
      "start_timestamp": "00:49:20",
      "start_timestamp_seconds": 2960.470588235294,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=2960"
    }
  },
  {
    "text": "real estate is straight up for, you know, a long time. So, they're very vulnerable. And, you know, we have Asia that's having to deal with a very strong dollar. That's, you know, that's an unknown in terms of when are we going to have some accidents come about because, you know, a lot of these, these particularly emerging countries, fund the debt in dollar terms, you know, or a dollar, then I'll be at debt. And now you've got a dollar through the roof, and they have to, they have to use those dollars to pay to service their debt. Some market will make it. So, there's, those things are all working. They're all there. They can come at any time. I'm betting that we're going to see the Fed recognize some of those problems and put some pressure on the, you know, in 20 minutes, I expect maybe July's the last hike for a little while. And, you know, it will impact the dollar on the in terms of pushing it back down something. So, there's, there's lots of, you know, moving parts here, but I think generally what that's all pointing to is, you know, maybe we've done all we can do on the downside here in the short run, and that way, maybe we have a respite of three to six months where, you know, markets can, can see the glasses have full. Man, it is no shortage of drama out there. It's, it really is",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 34,
      "start_timestamp": "00:50:59",
      "start_timestamp_seconds": 3059.152941176471,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=3059"
    }
  },
  {
    "text": "done all we can do on the downside here in the short run, and that way, maybe we have a respite of three to six months where, you know, markets can, can see the glasses have full. Man, it is no shortage of drama out there. It's, it really is interesting just understanding the broader scale because a lot of times I feel like from the US side, we think about the US, but we do forget, especially as retail traders in my opinion, you know, from my community that there is a lot of interconnectedness and a lot of that has profound impacts of scale. So, I appreciate you walking us through just a little bit of the broader landscape. We are up at time here. So, I want to make sure we get you out the door on time. For anybody that wants to find you, I know that you're on Twitter at Dave H. Contrarian. I'll throw that link in the video description below for anybody who wants to find you there. And then there are plenty of people that impersonate you. So, I will be very explicit about the right accounts of follow-ups so that folks can find you. But thanks, Ahton, you know, for hanging out for a little bit, sharing your thoughts, sharing the information you've amassed over a really long career in the markets. It's extremely beneficial to us. So, thank you. Yeah, thanks, Eric. Enjoy the last thing I'll say is we",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 34,
      "start_timestamp": "00:52:37",
      "start_timestamp_seconds": 3157.835294117647,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=3157"
    }
  },
  {
    "text": "can find you. But thanks, Ahton, you know, for hanging out for a little bit, sharing your thoughts, sharing the information you've amassed over a really long career in the markets. It's extremely beneficial to us. So, thank you. Yeah, thanks, Eric. Enjoy the last thing I'll say is we didn't talk about it in specific terms, but really, psychology is a big part of markets. And that's what people have to understand is don't just focus on what's the economy doing, what's the Fed doing, also understand what's already discounted. And where is psychology at? Right now, psychology is very bearish. And that usually indicates that you're pretty close to a turn in the other direction. We will soon find out. Thank you so much for your time, David. Really appreciate it. Okay, thanks, Eric. Take care.",
    "metadata": {
      "video_id": "6-MMToTqJAE",
      "title": "Market Melt up into a 80% Global Bust with David Hunter | Money Talks",
      "url": "https://www.youtube.com/watch?v=6-MMToTqJAE",
      "upload_date": "",
      "duration": 2538.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 34,
      "start_timestamp": "00:54:16",
      "start_timestamp_seconds": 3256.517647058824,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6-MMToTqJAE&t=3256"
    }
  }
]