[
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "you you you you you you you you you you you you you you you you you what's up, Alars? happy Friday, happy things giving i hope everybody is having a super fun to me have some issues which had future trade in close for hanging out and i see rain we got Michael good to see everybody i see Kirk awesome to have the gang and today and a many series kickoff which will be in twenty-six and this many series was not holistic but designed to tackle a lot of very basic concepts with respect to trading into shino lens on them so things like how to take an idea that you might have and turn it into a trade things like how to actually create things like that and i think a little more broadly when we think about trading most of what we do falls into a couple broad process categories and what i want to talk about is what some of those broad processes are and how we actually get better at them you will have heard me talk about a lot this idea of like focusing more so on the process versus the outcome of individual trades and obviously like i am such a firm believer of that this session today we have three things on the docket we're going to go over this little quiz that i have up on the screen for you this is just pulling together some broader concepts that",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 458.0,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "of individual trades and obviously like i am such a firm believer of that this session today we have three things on the docket we're going to go over this little quiz that i have up on the screen for you this is just pulling together some broader concepts that we've talked about at again like a really simple level like nothing in here is too crazy but design just to get the brain working a little bit then after that i want to talk about like where i think it makes sense for people to go next in terms of like what to focus on and then at the end we have time for just a generalized open Q&A so the purpose for that is i try to set time aside for us to have like up-router conversation whether it's pertaining to some of the stuff that we covered in the course, whether it's stuff not in the course, whether your curious will kind of books might be good to read, whether you want to explore different methodologies to creating wealth that isn't relegated to trading it's kind of open ended in that way so here we go the first thing here it says if you want to buy a call that's most important we have implied volatility is option A price movement is option B and time is option C so throw in the chat which letter you think is the correct answer is it A, B or",
    "start_timestamp_seconds": 438.0,
    "end_timestamp_seconds": 532.0,
    "start_timestamp": "07:18",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=438",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "first thing here it says if you want to buy a call that's most important we have implied volatility is option A price movement is option B and time is option C so throw in the chat which letter you think is the correct answer is it A, B or C ICB, ICB again ICB Lawrence has all but B okay so i don't think i trick anybody here this is good the reason why i threw this question in is because a lot of times you will hear things like don't buy options if volatility is high or don't buy options if implied volatility per is high. And in a nutshell, that is entirely wrong. And it's because we can find instances where something might actually have a high IV, you buy a high IV, and then you end up getting a subsequent move that you want. So let's explore that concept really, really quick. Let's just find some stuff that has a pretty high IV. We'll go into the platform really quick. Just be a little easier to find stuff with high IV in here. All I'm going to do is, again, look for stuff. That one's VRP, which is okay. Let's take a look at implied volatility for Senn'sile. All I'm doing here is I'm looking for stuff that has high implied volatility percentile. And we're looking at stuff that has weekly options. Most of these have earnings of some sort. IAU. This is great. This has",
    "start_timestamp_seconds": 510.0,
    "end_timestamp_seconds": 624.8,
    "start_timestamp": "08:30",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=510",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "which is okay. Let's take a look at implied volatility for Senn'sile. All I'm doing here is I'm looking for stuff that has high implied volatility percentile. And we're looking at stuff that has weekly options. Most of these have earnings of some sort. IAU. This is great. This has an 87% implied volatility percentile. IAU here, which is a gold ETF. And if we take a look at what the volatility in here looks like in IAU. And we just chart out super quick what the percentile's look like for these longer duration, midterm duration options. And I see stuff in here that's like from the 20th, 30 day options were at the 80% implied volatility percentile. 80%. So it means implied volatility was high. Let's take a look at what the rawval was on the 20th. On the 20th, rawval was 21. And it dipped down to a low of 1988. So it dipped down two points. Here's what you've been told that if you see something like this that has high implied volatility percentile, you shouldn't buy options in here. The other thing that you're told in systematically over-emphasize is trying to get cheap ball and not paying enough attention to the direction. So let's take a look at what happened here. In this scenario, volatility declined by like two points. Let me get eight so that we can track this. To actually know, we'll just use let's instead use this. What I want to do is",
    "start_timestamp_seconds": 604.88,
    "end_timestamp_seconds": 723.76,
    "start_timestamp": "10:04",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=604",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "paying enough attention to the direction. So let's take a look at what happened here. In this scenario, volatility declined by like two points. Let me get eight so that we can track this. To actually know, we'll just use let's instead use this. What I want to do is literally track some of this with you so that we can take a look at the scenario. So here implied ball in the beginning was like 21.6% or something and then it dropped to 19.8% or so. So in terms of what volatility is done, volatility is declined by like 1.8%. However, this corresponds to like an 80% implied volatility percentile. Now let's take a look at what price has done over this corresponding time frame. And all I'm doing is again, I'm using the price movement from that corresponds with this move involved and I'll get rid of the extra stuff so you can see what I'm doing. I'm starting when fall was kind of high like a few days ago. Let's go here when it was 23% on the 19th. So on the 19th, it was 23%. And then if we take a look on the low, here is like 196 on the 25th. So then if we go 25, no. It was like 196. So this is what fall did over that time frame. And let's take a look at what price did. What I want you to pay attention to is the difference in what you've",
    "start_timestamp_seconds": 709.52,
    "end_timestamp_seconds": 828.0,
    "start_timestamp": "11:49",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=709",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "is like 196 on the 25th. So then if we go 25, no. It was like 196. So this is what fall did over that time frame. And let's take a look at what price did. What I want you to pay attention to is the difference in what you've been told. Again, what you've been told is you shouldn't buy this ball because implied volatility percentile is high. And I want to be clear that in and of itself isn't a bad general way to think about it. You don't want to overpay for stuff especially systemically. It just stacks the cards against you. But let's say that for whatever reason in here, you had some sort of stronger directional pieces. So let's take a look. So on the 19th price was, I'll take the midpoint. So it was like 77. So spot price was 77. And then let's take a look on the 25th. The midpoint was 77.90. Ish something like that? 77.90. So here you got a point nine point move against a 3.4% move in terms of fall. Now depending on what kind of options you had, this could either be a profitable move or it could be a completely not profitable move. It's really because this thing hasn't moved a whole lot. Yet if we take a look at what damage this did, it really depends on what options you chose. Now again, we're using 30 day options for this example. So let's take a",
    "start_timestamp_seconds": 794.32,
    "end_timestamp_seconds": 932.0,
    "start_timestamp": "13:14",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=794",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "could be a completely not profitable move. It's really because this thing hasn't moved a whole lot. Yet if we take a look at what damage this did, it really depends on what options you chose. Now again, we're using 30 day options for this example. So let's take a look at what 30 day options look like right now. And we just want to get a sense of what the general fall might be that we're dealing with. So we'll go here to 28 days. We'll go to something that's at the money. Your Vega here is 0.087. So let's go back to our document. Your Vega is 0.087. And your delta there was 0.53. Let's see what happened here. We moved 90 cents. So what that means is you don't get this whole delta move, but you get some of it. In terms of delta, you got 48 cents in terms of your P&O. Here we moved 3.4 points. In terms of your Vega, you got effectively 30 cents of Vega moving against you. So with that 30 day at the money option, modeling off of current price, even though volatility declined and even though it certainly did not go in your favor, you still are in the scenario where the trade itself is improposable. That is probably one of the most overlooked aspects when we're looking at pricing. And when we're looking at what kind of options we may or may not want to select. So the",
    "start_timestamp_seconds": 906.16,
    "end_timestamp_seconds": 1051.2,
    "start_timestamp": "15:06",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=906",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "not go in your favor, you still are in the scenario where the trade itself is improposable. That is probably one of the most overlooked aspects when we're looking at pricing. And when we're looking at what kind of options we may or may not want to select. So the main thing to pay attention to here is that just because you see volatility is elevated that does not mean that you can't buy options and that you can't make some sort of profit on your options. Okay, any questions on this first question, which is if you want to buy a call, what's most important? What ends up being most important for the long call scenario is if the underlying moves in the direction you want, that's ultimately what matters and what matters most. Let me see what you guys get. So looks like everybody is on the same page with me. I see shouldn't it be delta? No, it doesn't have to be delta. So price movement is what matters. Delta is just a measurement. I wouldn't get those two confused. Delta tells us the rate of change of premium for a point move in the underlying. That isn't the same as what the underlying is actually doing itself. So you can have something that's a 50 delta or you can have something that has some sort of delta, but that doesn't mean that the underlying moves. Now I understand the the inference that making, but it's a",
    "start_timestamp_seconds": 1015.92,
    "end_timestamp_seconds": 1134.8,
    "start_timestamp": "16:55",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=1015",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "isn't the same as what the underlying is actually doing itself. So you can have something that's a 50 delta or you can have something that has some sort of delta, but that doesn't mean that the underlying moves. Now I understand the the inference that making, but it's a little bit different. And then black mom says why not gildy? I literally just ran a scan to see what had high ball and picked something that had high implied volatility per cent. I'm going to give you guys a couple seconds. I'm going to grab a drink really quick, but I want you to answer number two in the chat. So number two says if you sell a straddle, price remains relatively flat. I V contracts slightly, but you still lose money. What might be the reason? So take your best guess and then I will join back into the second. All right, let's see what we got. I see black mom says if the loss from the price is larger than the profit you made from time passing theta and a drop-in-vol Vega, the position will show a net loss. Good. Kirk says R.D. greater than IV. Good. Recess realized over implied good. Black mom says a short straddle creates a tent shaped profit zone. Yep, so you're talking about a risk profile. It makes money from time decay in dropping ball. Good. That's all really, really good. You guys did a good job. Brains says gamma not",
    "start_timestamp_seconds": 1121.36,
    "end_timestamp_seconds": 1295.76,
    "start_timestamp": "18:41",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=1121",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "Recess realized over implied good. Black mom says a short straddle creates a tent shaped profit zone. Yep, so you're talking about a risk profile. It makes money from time decay in dropping ball. Good. That's all really, really good. You guys did a good job. Brains says gamma not quite. Genesis says realizable plus friction. So free fees, which is also fair. The thing that I wanted to explain here is the way that price moves has a really, really important impact on the way that your position behaves even if you think things haven't done a lot. It still can be enough to move, evolve and I'm going to grab paint and I'm going to draw you guys in air exposure. So let's take a look. Here's what I'm talking about. If we have a stock chart and if price is relatively flat, right, let's just say that it's kind of oscillating sideways in this consolidation. Just because price is oscillating sideways, it doesn't mean that the pricing between IV and realized ball is profitable. You certainly can all be it unlikely. Have this scenario where price oscillates sideways and your move here is enough for realizable to exceed what was originally implied. Now there's a massive caveat to this question. And I'm curious who will be able to understand this caveat. Let's say that the option at this point here, let's say halfway through the life cycle. Let's say that's where the scenario we just looked at",
    "start_timestamp_seconds": 1272.88,
    "end_timestamp_seconds": 1410.48,
    "start_timestamp": "21:12",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=1272",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "exceed what was originally implied. Now there's a massive caveat to this question. And I'm curious who will be able to understand this caveat. Let's say that the option at this point here, let's say halfway through the life cycle. Let's say that's where the scenario we just looked at came to fruition. So this is about like 50% throughout the life cycle of the option. And let's say that your upper strike is here and your lower strike is here just to pick something random. Now here you can see an unrealized loss. If this unjulation motion is enough to cause an imbalance between the implied expectation and realized. Where things get interesting is who can answer this follow on a question. If we get to expiration at this point, would your option be profitable? Be for profitable or L for loss. Would you make or lose money? Just throw in the chat a P if you think it would be profitable and throw in an L if you think it would be a loss. This is I think easy, but some people can kind of psych themselves out with what we're looking at. Okay, so everybody says profitable good. That highlights a really really important relationship, a really important relationship because at the end of the day, if spot price falls between your short call and your short put regardless of how it looked along the way, it's still profitable. Period. Even if it had a net loss,",
    "start_timestamp_seconds": 1387.84,
    "end_timestamp_seconds": 1508.64,
    "start_timestamp": "23:07",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=1387",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "good. That highlights a really really important relationship, a really important relationship because at the end of the day, if spot price falls between your short call and your short put regardless of how it looked along the way, it's still profitable. Period. Even if it had a net loss, this concept again pretty clear, but is really really important to understand because let's say for example, we get rid of this scenario and instead let's say that you're trading a short call. So you want to sell a call. Well again, somebody might tell you, well hey, you only should do this if fall is high. And why would they say that? Well because you collect more premium. And a lot of times they're also playing the intent for IV to contract. Yet let's say that this short call is a covered call, meaning you have long shares that this thing is being sold against. Why does that makes it too big difference? Because in terms of the premium you collect short, you would prefer to have more premium than less premium. But you already have the long stock position. So if you already have the long stock position and if the premium is low, that might not mean that you just don't sell the premium because the premiums low. It might mean that you might not make as much on your premium, but you still have the long shares. So you have a choice between collecting a lower",
    "start_timestamp_seconds": 1483.44,
    "end_timestamp_seconds": 1598.24,
    "start_timestamp": "24:43",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=1483",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "and if the premium is low, that might not mean that you just don't sell the premium because the premiums low. It might mean that you might not make as much on your premium, but you still have the long shares. So you have a choice between collecting a lower premium or collecting no premium. Except if you choose not to sell, you get nothing. That's the first thing. The second thing is even if let's say implied volatility expands. So if fall is low, the fear is that implied volatility might expand. Well that just goes back to the example we were just looking at. If we're in here and let's say our short call is here and let's say you sell at this point right here. And then let's say after this point price starts to move up a lot. Well, this will cause an unrealized loss, but if price stays below here and we get to expiration, you still need money, even though this scenario occurred. The other scenario is let's say that for whatever reason, the pretend that this chart now is no longer price. Pretend that this chart is actually volatility. So I'm going to plot volatility. The difference is even if volatility skyrockets and you're experiencing an unrealized loss is long as price stays below this level, you still at expiration have a profit. This is really important because what you will find is very regularly, traders will over-optimize for the wrong stuff. They",
    "start_timestamp_seconds": 1581.04,
    "end_timestamp_seconds": 1701.2,
    "start_timestamp": "26:21",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=1581",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "plot volatility. The difference is even if volatility skyrockets and you're experiencing an unrealized loss is long as price stays below this level, you still at expiration have a profit. This is really important because what you will find is very regularly, traders will over-optimize for the wrong stuff. They won't sell the call. If they think fall is too low, meanwhile, if you don't sell the call, you get no premium. The other thing is that a lot of times they're not paying enough attention to the total life cycle of the position as it pertains to their broader position. So that is going off of this idea and this relationship between intermittent changes involved impact to your P&L and understanding how to use that information to make better decisions about your own trades. Black Mama says the probability for profit more important than high-iv to determine a premium worth it. I would fully disagree. I don't think the probability of profit actually matters effectively much at all and it's because the probability of profit is looking at a bit of a different scenario. For example, you can have some sort of probability of profit metric that would be what you're looking for. Let's say that you want a 70% profit and you sell that option at a 70% probability of profit. I would argue in the context of a covered call that's actually also optimizing for the wrong thing. I would argue that the dominant force in a",
    "start_timestamp_seconds": 1667.12,
    "end_timestamp_seconds": 1792.88,
    "start_timestamp": "27:47",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=1667",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "what you're looking for. Let's say that you want a 70% profit and you sell that option at a 70% probability of profit. I would argue in the context of a covered call that's actually also optimizing for the wrong thing. I would argue that the dominant force in a covered call first comes down to your inventory preference. That I think is super, super important because like you said in your second comment there, scale the highest probability. Well, if we wanted to sell a call with the highest probability of profits since we're here in IAU, we're going to be out here. We're going to be out as far out of the money as you can go. That's where your probability of profit is the highest. The issue with that is you don't collect really any money for it. So then, sure, you'll win the majority of instances, but you're not really getting anything to do it, which is exactly why more often than not when we're trying to collect some sort of credit for our long shares. We would look for something that's at a balance between our inventory preference, which means the probability that we get challenged where the option falls in the money against how much money we're making. And there's a bit of a delicate balance in that. This I'm also realizing for some reason is missing a ton of names. Why is that? Open interest. That is super weird. Does this is missing",
    "start_timestamp_seconds": 1779.44,
    "end_timestamp_seconds": 1895.84,
    "start_timestamp": "29:39",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=1779",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "challenged where the option falls in the money against how much money we're making. And there's a bit of a delicate balance in that. This I'm also realizing for some reason is missing a ton of names. Why is that? Open interest. That is super weird. Does this is missing a ton of names in this scan? I just realized, hey, what's up, goofy? Good to see you. Let me take a look at one other version. Does this kind of problematic? It shouldn't be that limited. I can't tell if it's this IV percentile. Let's take a look at option. See, so I see a five ball. I don't see an IV rank. Let's drop this really quick. Let's get rid of this range filter. I'll probably this gives us a bigger list. There we go. Wait, better. Okay, cool. So it's just that other tool that trading range filter does a bit of a different function. So yeah, okay, good. This is, this is better. This is what I would expect to see. And I see a bunch of individual names. All right. The other thing is the implied volatility percentile here differs from the look back period here a little bit, which is a little bit annoying. But again, that's the the nature of using this platform for stuff like this kind of annoying to be honest. But the other way to look for stuff in here in case you're wondering is just to use their standard",
    "start_timestamp_seconds": 1861.2,
    "end_timestamp_seconds": 2017.28,
    "start_timestamp": "31:01",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=1861",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "here a little bit, which is a little bit annoying. But again, that's the the nature of using this platform for stuff like this kind of annoying to be honest. But the other way to look for stuff in here in case you're wondering is just to use their standard implied volatility. The problem with their implied volatility rank is their IV rank has a series of issues. And it's because their implied volatility percentile is actually IV rank. So if you use that just make sure you're aware of that. So for example, if we grab IV percentile and we want stuff that's at least 30% IVP up to 100. And we run this scan for it. You're going to get a bit of a mixed bag. And the reason why you're going to get a mixed bag is because a lot of these things will have a different implied volatility percentile versus IV rank. And let's just take a quick look at an example so that you understand what I'm saying. So we have WU LF. So let's go to WU LF. If we look in here, you can see that the implied volatility percentile is actually 32% whereas the implied volatility rank is all the way up at 60. This is a really commonly messed up metric between these two tools. And think or swam unfortunately gets this like pretty wrong, which is again, it's unfortunate because in general, we would much prefer to use some sort",
    "start_timestamp_seconds": 2000.72,
    "end_timestamp_seconds": 2108.64,
    "start_timestamp": "33:20",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=2000",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "whereas the implied volatility rank is all the way up at 60. This is a really commonly messed up metric between these two tools. And think or swam unfortunately gets this like pretty wrong, which is again, it's unfortunate because in general, we would much prefer to use some sort of like actual implied volatility percentile metric versus using standard implied volatility rank. Imply volatility percentile is way more accurate. Now quick clip notes. If I were to actually trade some sort of vault, I wouldn't be looking up to 100%. I would be somewhere in kind of like this middle zone. And that's because that's where the vault edge tends to be the best for the selling side of the equation. In case you didn't know, that is again, a really commonly mistaken piece. And I'm actually really curious, I'm going to have chatchipykey build a column for us really quick. So create in, oh, I think is this custom already? I wanted to show you the difference between implied volatility. Yeah, so this is implied volatility rank, which is incorrect. So create a column for think or swim watch list that calculates the implied volatility percentile. So I'll show you really really quick. We got to find a blank custom. We have any left. We're like on our last one. Not. All I'm doing right now is having think or swim make a quick script. This is good. This looks, this looks a little excessive. But I'll show",
    "start_timestamp_seconds": 2086.56,
    "end_timestamp_seconds": 2230.56,
    "start_timestamp": "34:46",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=2086",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "show you really really quick. We got to find a blank custom. We have any left. We're like on our last one. Not. All I'm doing right now is having think or swim make a quick script. This is good. This looks, this looks a little excessive. But I'll show you guys what it came up with. So it really doesn't need this stuff. We don't need an actual plot. And let's just drop this in really quick. I just want to compare these so that you can see the difference between calculated implied volatility percentile. So these look the same. So this is using the built-in implied volatility percentile versus actually calculating it. So the way that we would fix that is simple. What we would do is grab the calculation for implied volatility percentile for here and essentially say use this. But I won't waste your guys' time going through all that. I just wanted you to at least understand a little bit of the difference between implied volatility percentile and implied volatility rank. And unfortunately, the fact that a lot of platforms mess them up. All right, let's get back to the quiz. The next question is, if you want to go along an underlying, how do you choose between buying a call, buying stock versus going synthetic law? So in the chat, I want you to just overview how you would make the decision between putting on these different positions. What would make you lean between",
    "start_timestamp_seconds": 2196.48,
    "end_timestamp_seconds": 2331.6,
    "start_timestamp": "36:36",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=2196",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "if you want to go along an underlying, how do you choose between buying a call, buying stock versus going synthetic law? So in the chat, I want you to just overview how you would make the decision between putting on these different positions. What would make you lean between these? Kirk says time horizon leverage cost, that's solid. I think that's a really really good way to think of it. Lawrence's depends on portfolio and risk tolerance. I agree. I think that one's a little too open to get credit. But I think that's a fair overall concept for sure. Resets depends duration severity. Sort of. Again, I actually think Kirk has a really good answer. Brain says IV. That's a good guess. I absolutely would consider that to be part of the equation. Mom says capital efficiency, risk tolerance, implied fall. I think of those risk tolerance, again, would inherently apply to kind of all of them in terms of like you can make them the same amount of risk if you were so inclined. So I think your answer of leverage in IV is correct. Goofy says I like going for some leverage if I'm optimistic for the next 18 months. Leaps are better than equity for my risk. Well, I wouldn't think of it necessarily that way either, just because you start to silo yourself in a little bit more than necessary. I wouldn't just kind of say like cart blanche leaps are better for my",
    "start_timestamp_seconds": 2306.48,
    "end_timestamp_seconds": 2412.16,
    "start_timestamp": "38:26",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=2306",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "the next 18 months. Leaps are better than equity for my risk. Well, I wouldn't think of it necessarily that way either, just because you start to silo yourself in a little bit more than necessary. I wouldn't just kind of say like cart blanche leaps are better for my risk. I would think of it more so in terms of like what fits your the the opportunity that you're looking at the best. So let's think about it. Okay, so I don't know to say that. Okinawa. Okinawa says liquidity of options versus underlying. That's a massively important input. If we think about the differences between these positions. Right. Buying stock is expensive. But if you buy stock, you do not have to worry about some sort of exploration. That doesn't matter too much because if you have like a solid P&L management plan, the exploration factor is generally secondary. But that's really the main benefit to holding the equity. And exactly as wheel stretch, yo points out, if there is a dividend, you collect the dividend, which is also a completely viable point. If we buy a call, there's a lot of things we can do to decrease the impact from things like fall. We can decrease the impact from things like theta decay. But there's still an element of those. The other thing is you can set these up to have very very different risk reward profiles based on what you expect to see. The purpose of",
    "start_timestamp_seconds": 2400.64,
    "end_timestamp_seconds": 2501.84,
    "start_timestamp": "40:00",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=2400",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "the impact from things like fall. We can decrease the impact from things like theta decay. But there's still an element of those. The other thing is you can set these up to have very very different risk reward profiles based on what you expect to see. The purpose of a synthetic loan is effectively to take a levered stock position. Like that's kind of it because what you're attempting to accomplish with a synthetic loan is to neutralize the Greeks. And you wouldn't want the Greeks themselves to devrail a position if you don't have some sort of opinion on things like implied volatility because like I was saying before in the cover call example in the straddle. Volatility absolutely has an impact and it doesn't necessarily mean that it's the primary part of the decision cycle. But it does mean that you have to still incorporate some sort of opinion with respect to the wall. So let's hold on let me get caught up on them on the chat. Brain says intention of the strategy I think that's completely fair. Mamba says synthetic loan best one implied volatility is high by selling the put you finance the call. I actually disagree. I wouldn't again I wouldn't look at it that way because just like we talked about in this scenario it really comes down to price movement. So with the levered long position you decrease how much money you actually can make. Let's take a look at an",
    "start_timestamp_seconds": 2483.92,
    "end_timestamp_seconds": 2603.76,
    "start_timestamp": "41:23",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=2483",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "I actually disagree. I wouldn't again I wouldn't look at it that way because just like we talked about in this scenario it really comes down to price movement. So with the levered long position you decrease how much money you actually can make. Let's take a look at an example here at Wolf. And let's take a look at going a synthetic loan at 50 days out. It does have high vol. So we should expect to collect a small credit because of putski we do we get a 41 cent credit which is actually nice. This is your risk profile. Let's take a look comparatively at a couple options positions. Let's take a look at just getting the call and then let's take a look at getting an out of the money call like a 20 delta and then let's take a look at one more and look at a 30 delta. Okay so let's take look at these different scenarios and I'm going to grab this so that we can track them together. So we're looking at a plus 5% a 10% 15% and we'll do like a 25% move. So this is what we're going to track. And we're going to do this for a few underlines. Also in this infreagues so that you can see better. We're going to do this for long stock a synthetic loan. We'll do this for a 50 delta call and we'll do this for a 20 delta. And I'm",
    "start_timestamp_seconds": 2588.0,
    "end_timestamp_seconds": 2700.32,
    "start_timestamp": "43:08",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=2588",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "track. And we're going to do this for a few underlines. Also in this infreagues so that you can see better. We're going to do this for long stock a synthetic loan. We'll do this for a 50 delta call and we'll do this for a 20 delta. And I'm going to move this off to the side so that I can fill it in a little bit quicker. What I want to do is again give you context and I'm just focusing on the upside in this scenario because it's a little bit quicker. So the long stock if you get your favorable move you get 77 bucks if you get your 10% move you make 154 bucks if you get your 15% move you get 232. I'm just going to stop at 15% because I think the point will be clear within these ranges. Now let's take a look at our synthetic loan. A synthetic loan is 77. 10% is 155 and then 233. The 50 delta call I have too many I got tripped up. So it's 50 delta okay because we did a 30 delta as well. So I'll add the 30 delta to a 30. Okay. So our 50 delta call you're going to make 39 86 138. Your 30 delta call and again we're going to have to add a margin requirement part to this as well. Is that's really where you're going to see the leverage expressed. So let me add a call",
    "start_timestamp_seconds": 2670.72,
    "end_timestamp_seconds": 2816.72,
    "start_timestamp": "44:30",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=2670",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "Okay. So our 50 delta call you're going to make 39 86 138. Your 30 delta call and again we're going to have to add a margin requirement part to this as well. Is that's really where you're going to see the leverage expressed. So let me add a call or margin wreck. Okay. So for the stock position you're buying a hundred shares at 1552 so you're going to put up 50. This synthetic loan you're going to put up 1600. This is in a contributory IRA account. So it means that that put these cash secured. If the put wasn't cash secured if you guys can let me know what the short put requirement would be then I can figure out what the margin would be for like a regular for a wreck T account. So if one of you guys could take a look at what the 16 Jan 16 put is 16 strike put is in terms of margin requirement I can update that but right now it's cash secured. Next we have the 50 delta. The 50 delta is 260 bucks. Next we have the 30 delta call our 30 delta call is here. So this is going to be 94 bucks in a 5% move you're going to make 23 52 and 85. And then the last one the 20 delta call should be at the 22 strike. Those are going to be 64 bucks and you're going to make 15 37 63. Okay.",
    "start_timestamp_seconds": 2790.8,
    "end_timestamp_seconds": 2930.0,
    "start_timestamp": "46:30",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=2790",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "this is going to be 94 bucks in a 5% move you're going to make 23 52 and 85. And then the last one the 20 delta call should be at the 22 strike. Those are going to be 64 bucks and you're going to make 15 37 63. Okay. So we have a Kirk says 1356. Thank you very much. That's for margin account. So 1356. Thank you very much. I appreciate that. So let's take a look at what these do. So you can see a difference in the gross amount obviously and it's because in order to put up this account or this amount of money you're having to tie up quite a bit more. So all I'm going to do now is take these and turn these into percent returns so that you can analyze and normalize what the return on invested capital is. Why is that putting the dollar sign after? What is that? We're to shit. ZAR. Anyways, let's continue our little plot. Now you can make a logical comparison. The way you make a logical comparison between these is we get a sense of where the greatest return on invested capital is and to no big surprise you can kind of clearly see where that lives. So going back to the point that started this whole thing talking about a synthetic long, the issue with the synthetic long when vall is high is you're optimizing for the wrong thing. It's because more of",
    "start_timestamp_seconds": 2910.96,
    "end_timestamp_seconds": 3040.72,
    "start_timestamp": "48:30",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=2910",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "to no big surprise you can kind of clearly see where that lives. So going back to the point that started this whole thing talking about a synthetic long, the issue with the synthetic long when vall is high is you're optimizing for the wrong thing. It's because more of the decision should come down to what is your expectation versus what you think is going to happen. Black Honda says so it's riskier. Minutes holding the stop when it's going down there's a huge but we were credit or zero if so that's your only bet. Yeah, again the issue with it is that it's just the broader point that I'm making is that it's optimizing for the wrong thing. Because the original statement that you mean was like if fall is high default or choose lean towards whatever a synthetic long. My argument is that while that's a a completely viable consideration to make, if you get the move that you think or depending on what the move is that you think you're going to get, it really should be based more on what is the risk profile that you want to extract. So even if the marginal requirement for this wasn't 1356, I'll take a look really quick in an example of portfolio margin account. I'll tell you what it is in a portfolio margin account. I'm just using my phone to grab that super fast. And by super fast, I mean this slow is really possible.",
    "start_timestamp_seconds": 3016.16,
    "end_timestamp_seconds": 3123.44,
    "start_timestamp": "50:16",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=3016",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "requirement for this wasn't 1356, I'll take a look really quick in an example of portfolio margin account. I'll tell you what it is in a portfolio margin account. I'm just using my phone to grab that super fast. And by super fast, I mean this slow is really possible. All right, let's go to both. In both, if I go out to 16 Jan and I look at the what we're talking about the 16 put and I sell that in a portfolio margin account, it's 244 bucks. So let's say your margin requirement is there. That can massively, massively change things. But again, one of the important factors is that for the same price for these, you can put on multiple of these other ones. So the reason why that matters is depending on what the pricing is that you can get if you're in a regulation T account, it's really nothing that nothing that magical. Mom says at the end of the day, it depends on the move and how it looks. Yeah, that's exactly correct. So in I think that that's the most important point, right, is that it actually doesn't really come down to volatility. And because if volatility is high, but you still get a big enough move, you can still make way more money with the long calls. If you get the move, which is, that's the big end, right, do you get the move. The other thing to keep in mind is",
    "start_timestamp_seconds": 3103.44,
    "end_timestamp_seconds": 3212.56,
    "start_timestamp": "51:43",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=3103",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "And because if volatility is high, but you still get a big enough move, you can still make way more money with the long calls. If you get the move, which is, that's the big end, right, do you get the move. The other thing to keep in mind is that you're actually going to have less risk on the long calls. The reason why you're going to have less risk is because you're taking on more types of risk. You're taking on theta now, but the total risk that you're putting up is definitely going to be decrease. And that's because if the things starts moving against you, your delta's are going to contract. So then you're losing less per dollar of move and obviously it will continue to slow. So really, really good scenario to work through together and leads into a beautiful follow-up, which you guys should definitely know the answer after what we just went through, which is which option provides you more leverage of 15 delta call A or an 80 delta call B. So you just throw on the chat. If you think 15 delta for 80 delta A or B respectively. So I see three A's so far. Okay, does anybody think B? I see no. So my guess is you guys inherently know Lauren, you think B is that correct? Brain says maybe B. Okay, so Lauren, can you explain to me why you think it's B? Let's explore what that scenario",
    "start_timestamp_seconds": 3192.4,
    "end_timestamp_seconds": 3311.2,
    "start_timestamp": "53:12",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=3192",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "see three A's so far. Okay, does anybody think B? I see no. So my guess is you guys inherently know Lauren, you think B is that correct? Brain says maybe B. Okay, so Lauren, can you explain to me why you think it's B? Let's explore what that scenario might look like. Let's use wolf as an example. And let's grab an 80 delta call. So the 80 delta call we're going to get that for 430. And you're going to get that for 430. And I'm going to move these so that we can make a quick work at how that 80 delta call B. So 5% may be get 60. 126. 6. And I'll bring this back over. So let me just can see. Let's take one. All right. So Lauren, I don't see. Lauren, I don't see. You're logic in case you threw it in just in case I wanted to give you a chance to share what you were thinking so that we can explore the idea. But the answer is A. The out of the money option provides you more leverage. This has everything to do with convexity. So if we're comparing an 80 delta, I'm just going to use 20 delta here because it's close enough. You can see that the return on an invested capital is more for the 20 delta effectively across the entire board. And it's also much cheaper. So what's going on here with these options that are out",
    "start_timestamp_seconds": 3270.8,
    "end_timestamp_seconds": 3464.72,
    "start_timestamp": "54:30",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=3270",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "delta, I'm just going to use 20 delta here because it's close enough. You can see that the return on an invested capital is more for the 20 delta effectively across the entire board. And it's also much cheaper. So what's going on here with these options that are out of the money is you're really playing the expansion of delta which is tracked via gamma. Here's the way to think about it. If we take a look at the options chain and let's just take a look at what your delta might become as the underlying moves. Because remember, once you have a delta of one, you move $ for dollar with the underlying. So if you have an 80 delta option and let's draw a plot of its delta. And let's say that this is where 80 is. And let's say that this is underlying going up. Your 80 delta option can effectively go up to a one delta or 100 delta. This is the compounding distance that effectively you get before your option is simply behaving like a levered law and position moving one for one. Whereas if you have that 15 delta option and let's say 15 delta is down here and again let's say that your one delta is up here. In this scenario, again if price goes up, you have a completely different compounding profile. So your compounding window increases to this. So you can see this total distance compared to this total distance.",
    "start_timestamp_seconds": 3448.0,
    "end_timestamp_seconds": 3581.84,
    "start_timestamp": "57:28",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=3448",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "15 delta is down here and again let's say that your one delta is up here. In this scenario, again if price goes up, you have a completely different compounding profile. So your compounding window increases to this. So you can see this total distance compared to this total distance. This is exactly why your 15 delta option provides you way more leverage. It's because this 15 delta option has a significantly further runway for its delta to grow in compound. There is exactly why there's more leverage here than here. Now there's a trade off. Just as Laque Mamba says that 15 delta has a lower has higher leverage but a lower probability profit which is actually fundamentally inaccurate. What he's referring to is at expiration, which again is one of the things that's super important to understand the difference especially as more nuanced traders to be able to decipher the difference between something that's before expiration versus at expiration. Because in Black Mamba's defense, it's exactly correct at expiration. However, it's not necessarily the case prioritize expiration. Perhaps as the 80 delta is better leverage in slower drift moves because as its leverage relative to cost but doesn't have the extrinsic value to K. I wouldn't confuse those curve. That doesn't mean it has better leverage. It doesn't have better leverage. Again, in your defense and in the example that you're using, it does most certainly mean that it might behave better and I think that that's okay.",
    "start_timestamp_seconds": 3551.68,
    "end_timestamp_seconds": 3688.32,
    "start_timestamp": "59:11",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=3551",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "have the extrinsic value to K. I wouldn't confuse those curve. That doesn't mean it has better leverage. It doesn't have better leverage. Again, in your defense and in the example that you're using, it does most certainly mean that it might behave better and I think that that's okay. It might be a better position in that scenario. I think that's okay to say. But very, very different. Black Mamba says yeah, we're referred to at expiration. Yeah, and that's kind of the trick, right? Because when we're talking about probability of profit, basing the decision or basing the analysis of the expiration is a really common mistake. And it's because the option obviously looks different before expiration. So if we made our positioning decisions off of at expiration, especially if we have some sort of management plan that would lead us to manage before expiration, then we're kind of making a completely lopsided analysis that in general we would want to avoid. Kirk says better as in more profitable relative to 15 delta in slower drift moves. Yeah, yep. So we're definitely on the same page in terms of the potential profitability. I think the new one series that I'm just correcting the use of leverage, just because it's more profitable doesn't mean it has more leverage. Another great example of this is we could just replace the 80 delta option with long stock. If the underlying moves up one dollar but 20 days pass, the long stock",
    "start_timestamp_seconds": 3669.52,
    "end_timestamp_seconds": 3764.88,
    "start_timestamp": "01:01:09",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=3669",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "that I'm just correcting the use of leverage, just because it's more profitable doesn't mean it has more leverage. Another great example of this is we could just replace the 80 delta option with long stock. If the underlying moves up one dollar but 20 days pass, the long stock on a quivocally would make more money than the 20 delta call. However, that does not mean that the long stock has more leverage. Most certainly doesn't. And again, the reason why that point is really important to consider is because when you're building a portfolio, understanding the relationship of your positions and how they behave is really, really important so that you can build something that ultimately reflects what you're thinking of. So, rain says delta times spot divided by option gives you your leverage factor more or less. I think I wouldn't do it that way but there's like that's close enough. I don't think that that's inherently wrong but I think it misses and probably is confusing the point again in terms of like what leverage is. Black Mama says this delta that we see on chain reflects the real-time probability of expiring in the money. It's a great question. And the reality is the short answer is it genuinely does depend. It's a really, really common commonly confused topic. So, I'm going to link to a video for you to check out of Black Mama, this video is for you and that explores the relationship of",
    "start_timestamp_seconds": 3746.08,
    "end_timestamp_seconds": 3870.96,
    "start_timestamp": "01:02:26",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=3746",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "a great question. And the reality is the short answer is it genuinely does depend. It's a really, really common commonly confused topic. So, I'm going to link to a video for you to check out of Black Mama, this video is for you and that explores the relationship of delta as a probability measure versus the actual calculation for a probability measure. The short answer is it's not. The long answer is there are circumstances where delta performs absolutely fine as a probabilistic calculation. That said, there's a lot of nuance in terms of you need to use if you use it in that way. It has to be done with options that have lower volatility meaning the underlying is lower volatility and it needs to be done closer in time. So, let's take a look at an example. This right here, this is a 48 delta. If we use this 48 delta, that would lead us believe that this 48 delta option has a 48% probability of expiring in the money. If we look at the actual probability calculation, it's only 34%. So, you literally have a 14% variance between using delta and the actual probability calculation. That is everything to do with volatility and it has everything to do with duration. So, because this popped up in a high volatility scan, that's why you see that so far off for this distance. Let's take a look at spy really quick. If we look at spy, same expiration",
    "start_timestamp_seconds": 3846.8,
    "end_timestamp_seconds": 3964.96,
    "start_timestamp": "01:04:06",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=3846",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "is everything to do with volatility and it has everything to do with duration. So, because this popped up in a high volatility scan, that's why you see that so far off for this distance. Let's take a look at spy really quick. If we look at spy, same expiration will get close to if we have a fit, well, let's use this 46 delta that's closer. So, this is a 46 delta, we would infer 46% probability of expiring in the money and it's 44 and a half. So, call it 45. That's pretty damn close. That's because we're not too far out in time and we're looking in spy, which is much lower of all. So, the way to think about it is in general, you're just way better off using the actual probability calculation. There's no real reason to use delta. If you're in some sort of scenario where you have to use like a back of an app can and you have to use delta or you have access to delta for your calculation like you can get a buy because all you need to do is add like a mental deflator to it. But other than it being a really lame party trick, there's really no use to like using delta versus the actual probability calculation. So, to summarize all of that, I would absolutely just use the probability calculations. Because the other stuff that gets messed up is the probability of a touch where",
    "start_timestamp_seconds": 3942.16,
    "end_timestamp_seconds": 4032.88,
    "start_timestamp": "01:05:42",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=3942",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "than it being a really lame party trick, there's really no use to like using delta versus the actual probability calculation. So, to summarize all of that, I would absolutely just use the probability calculations. Because the other stuff that gets messed up is the probability of a touch where people would infer that it's two times delta, which that also breaks down quite a bit. So, it's a great question. I hope that that helps if you have any follow-ups. Let me know. Okay, last quiz question. What is the most important aspect of a strategy to get right? Your day-to-day expiration, which is A, the option structure that you use in order to monetize the idea, which is B, or your profit mechanism, which is C. What do you guys think the answer is A, B, or C? I see one vote for C, two votes for C. Any other votes? I see another one for C. Good. Does anybody think something other than C? C? Kirk says B. Kirk, can you explain B? Why do you think it's B? Mom doesn't say C. Good. So, the answer here by far is C. The most important aspect of a strategy is the profit mechanism. But I want to explore with Kirk what he was thinking behind B. Kirk says, Devil's Advocate, you can get the profit mechanism right, but use the wrong options to profit from it. Yep, definitely. The more important factor, though, is that you can",
    "start_timestamp_seconds": 4011.84,
    "end_timestamp_seconds": 4133.76,
    "start_timestamp": "01:06:51",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=4011",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "a strategy is the profit mechanism. But I want to explore with Kirk what he was thinking behind B. Kirk says, Devil's Advocate, you can get the profit mechanism right, but use the wrong options to profit from it. Yep, definitely. The more important factor, though, is that you can use the correct option structure for the wrong profit mechanism and lose money. So, the same logic that's being applied to C in that scenario would apply to B. It's not wrong, but like your original answer of B, the reason why option structure is incorrect in this scenario and profit mechanism is correct. Is actually for the same reason, but inverted. Let's take a look at a scenario where we think this stock is going to go up. Let's say that it just had a breakout here and let's say that it was on strong volume compared to the other days. We think it's going to go up. So, we have a upward bias. For the subward bias, it doesn't really matter if we go synthetic long, if we go long equity, if we go some sort of long call with some duration, you can buy a long call that loses money. So, the strategy or the option structure still matters. It's not like which one of these doesn't matter. They all matter, but it's what matters the most because if you understand the profit mechanism here of a breakout, and you understand the profile of a breakout, which",
    "start_timestamp_seconds": 4106.16,
    "end_timestamp_seconds": 4242.24,
    "start_timestamp": "01:08:26",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=4106",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "that loses money. So, the strategy or the option structure still matters. It's not like which one of these doesn't matter. They all matter, but it's what matters the most because if you understand the profit mechanism here of a breakout, and you understand the profile of a breakout, which is over the next six days, you expect it to move at least two times the prior reference period. So, let's say that the consolidation period itself was a total range of 6%. So, over the next six days, you expect it to move at least 12%. These details help you pick the structure that best fits this idea inherently. And most importantly, is that if your profit mechanism is cracked, you still would make money in effectively all of these scenarios, it just becomes a game of like how much money. So, this is why profit mechanism is such a critical component of the strategy. It's literally the base of any strategy. And that is because if you get your profit mechanism correct, you can literally get everything else correct. So, if we look at the outlier strategy process, your very first step is to create a profile for your profit mechanism. This is when we're talking about in option strategy. Notice how the concept of structures doesn't even come into plancil step three. It doesn't even get into the equation until here. And it's because you have to understand the profit mechanism quite deeply, which is actually a",
    "start_timestamp_seconds": 4215.68,
    "end_timestamp_seconds": 4340.4,
    "start_timestamp": "01:10:15",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=4215",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "your profit mechanism. This is when we're talking about in option strategy. Notice how the concept of structures doesn't even come into plancil step three. It doesn't even get into the equation until here. And it's because you have to understand the profit mechanism quite deeply, which is actually a beautiful preamble to the second thing that I said that we were going to cover on the stream tonight, which is where to go from here. I'm working on a new video that's going to come out hopefully in the next, well, it's not going to come out for a little while because I have the backlog of videos, but I'm hopefully going to make it in the next couple of weeks. And the the concept of the video is to take pretty much all of the primary trading processes and to list them out so that we have a comprehensive understanding of what all of the major processes are that go into trading. The way that I would think about devising your next steps depending on where you're at in your path is the first thing I would do is focus on outlining what you believe the major processes are that you need to nail down as a trader. So let's just spit all some of them. One of those processes, for sure, is fundamental knowledge, funds knowledge. And the purpose of this is to build your baseline understanding of the tools that you're using. So a great part",
    "start_timestamp_seconds": 4312.0,
    "end_timestamp_seconds": 4427.2,
    "start_timestamp": "01:11:52",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=4312",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "are that you need to nail down as a trader. So let's just spit all some of them. One of those processes, for sure, is fundamental knowledge, funds knowledge. And the purpose of this is to build your baseline understanding of the tools that you're using. So a great part of this process is literally attending the Friday dinner series, right? Like that is a way to hone your fundamental knowledge. The other stuff that applies here are things like creating a feedback loop for your learning. So let's say that you dedicate five hours a week to fundamental knowledge education of markets via a split between books, podcasts, YouTube videos, whatever. And then once a week you have AI quiz you that's a great way to build a quick and easy but very usable fundamental knowledge process. Another process that you know that you need to come up with is a strategy process. And I already have a video that talks about this. We just looked at the outline for the video. But this is how you actually build stuff. Now there's a really big, granted step in the strategy process, which is the profit mechanism profiling. You have to develop a process to profile profit mechanisms. You have to have a process for this. The reason is it's very easy to get completely misled when you're looking at stuff. So for example, if you're looking for a new strategy and your approach to finding a new strategy, resolve",
    "start_timestamp_seconds": 4392.72,
    "end_timestamp_seconds": 4526.16,
    "start_timestamp": "01:13:12",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=4392",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "to develop a process to profile profit mechanisms. You have to have a process for this. The reason is it's very easy to get completely misled when you're looking at stuff. So for example, if you're looking for a new strategy and your approach to finding a new strategy, resolve revolves around like going on YouTube and typing in like option strategy. That's not going to work well. That's just the reality of it. You're not going to find a ton of gold there. The stuff that I share are things that are robust, but I'm not sharing like any of my like really detailed nuanced stuff on fucking YouTube. And why would I? The stuff that I'm sharing on YouTube are like the base concepts that work well that are in things that are, again, well known. So I'm not sacrificing any of my edge by explaining different ways to trade a coverage triangle in index ETFs. That doesn't eat any of my lunch at all. But some of the more advanced stuff that I do, a great example of this is a trade that I made a couple of years ago, which was the absolute most profitable trade on the account as a percentage basis in my tire trading career. And it took place over two days. There's no content out there about that trade. And there won't be any content out there about that trade because I'm not going to share it because I'm still looking for",
    "start_timestamp_seconds": 4502.48,
    "end_timestamp_seconds": 4602.48,
    "start_timestamp": "01:15:02",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=4502",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "on the account as a percentage basis in my tire trading career. And it took place over two days. There's no content out there about that trade. And there won't be any content out there about that trade because I'm not going to share it because I'm still looking for it. What I'm trying to impress upon you is that you have to develop a methodology to research profit mechanisms. And if your methodology revolves around just like going on YouTube and seeing what you can find there, there's a huge, huge gap in that process. And you need to take the time to iron it in. Or you guys iron it out. This is the first step of your next steps after this series is to outline the different processes that you think you need to develop in order to support your broader trading. After that, the next hands down most important thing is to find a way to get external audits. The reason for the external audits is when you're learning something, you absolutely do not know what you do not know. So if your approach is going to be based on you thinking, you know, you'll be able to do what you want and then magically make money doing it. And you're not going to slip up or have different mistakes along the way. You really are in a heavily disadvantaged position. Because again, the probability of you being able to identify all of the different gaps",
    "start_timestamp_seconds": 4582.72,
    "end_timestamp_seconds": 4693.92,
    "start_timestamp": "01:16:22",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=4582",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "able to do what you want and then magically make money doing it. And you're not going to slip up or have different mistakes along the way. You really are in a heavily disadvantaged position. Because again, the probability of you being able to identify all of the different gaps in what you're doing is very low. It's super, super low. So the last thing to think about is how do you develop a methodology to have an audit? This can be meeting a friend from one of these streams that you sync up with once a week. And you explain what you've been working on and you try to poke holes in what you're doing and so on and so forth. These I think are the definite like near-term focus steps for everybody in this series. This one is most important, which is outlining the different processes that you need to and then beyond that, it's creating some sort of methodology for auditing. And you have to have an audit process. That can again, that can be done via chatchipyte, right? Like you can absolutely use whatever is at your disposal and you should. So the trick there is it needs to be something that can catch up on spots. Okay, so we're now going to pivot the last 15 minutes or so into just an open dialogue. But before we pivot into an open dialogue, I just want to check to see if there's any questions on anything",
    "start_timestamp_seconds": 4669.76,
    "end_timestamp_seconds": 4792.48,
    "start_timestamp": "01:17:49",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=4669",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "it needs to be something that can catch up on spots. Okay, so we're now going to pivot the last 15 minutes or so into just an open dialogue. But before we pivot into an open dialogue, I just want to check to see if there's any questions on anything that we went over, at least in the session today. So anything from the quiz or anything from what you should be focusing on for your next steps. Anything in there. And if so, knows the perfect time to throw that in. If not, now is the perfect time to share any broader topics that you want to talk about. We can cover anything that you think is relevant. So it can be stuff related to trading. It can be stuff not trading related. Whatever you want to explore, there's a couple of things that are on the top of my mind, depending on what you guys bring up. I actually want to give you an opportunity to bring up stuff first. But I have a few things that I want to discuss broadly anyways. Fire away if you have anything. The things that I think at least at this point that would make a lot of sense for you guys to be thinking through is like, when you make this approach and you move into attempting to trade for a living, there's a lot that goes into that. And I think most people don't really go through the planning",
    "start_timestamp_seconds": 4767.44,
    "end_timestamp_seconds": 4876.88,
    "start_timestamp": "01:19:27",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=4767",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "point that would make a lot of sense for you guys to be thinking through is like, when you make this approach and you move into attempting to trade for a living, there's a lot that goes into that. And I think most people don't really go through the planning process well enough. So I want to talk about that. Let me see. For instance, I placed a double diagonal on Boba for earnings for a $2.45 credit upfront. I closed at the next day for a 23 debit 93% gain of no idea how it worked. What were the explorations for the diagonal? Where did you have the long and short legs relative to one another? Because realistically speaking, there's probably two big things that went down in that scenario for you. The first thing, obviously, is the earnings move. The second thing is any sort of follow-up price behavior. So if you take a look at Boba, Boba kind of just sat. So the biggest thing that you had there working in your favor is the fact that volatility contracted is much as it did. If you didn't get that kind of fall contraction, then you really wouldn't have much to show for it. That's the biggest reason. Why you saw something go down there. Let's talk anything else on that frame before we look at anything else. Brain says, front-exprie, expire that week, long strikes December, monthly expected move like. So the reason why is because of",
    "start_timestamp_seconds": 4850.64,
    "end_timestamp_seconds": 5000.08,
    "start_timestamp": "01:20:50",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=4850",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "have much to show for it. That's the biggest reason. Why you saw something go down there. Let's talk anything else on that frame before we look at anything else. Brain says, front-exprie, expire that week, long strikes December, monthly expected move like. So the reason why is because of fall. The long strikes out in December didn't really realize much of a change involved because they're so far out. The majority of that profit came from the short options in the front, effectively, expiring and by being within range. So yeah, that's exactly what you had going on there. Those kinds of trades are also interesting. I think in general, those kinds of trades can work really, really well. But I also think in general, those are not necessarily getting you the direct exposure that you want to the effect. Yeah, but that's exactly why you saw that move that you did there. Anything else that you guys want to work through? I want to talk a little bit about planning. And again, like feel free to throw in anything as we go through this. But before you start going super far down the rabbit hole of like trading, I think it makes a lot of sense to conduct a general planning process. And the purpose of the planning process is to give you some sort of frameworks to work off of as you're learning. So we just explained a bunch of different things that you have to outline",
    "start_timestamp_seconds": 4957.68,
    "end_timestamp_seconds": 5115.36,
    "start_timestamp": "01:22:37",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=4957",
    "chunk_index": 46,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "I think it makes a lot of sense to conduct a general planning process. And the purpose of the planning process is to give you some sort of frameworks to work off of as you're learning. So we just explained a bunch of different things that you have to outline through your homework next. And as you're doing that, I highly recommend sharing it in the discord. It's free for everybody to join. And most importantly, it's a good place to get feedback from people and to share ideas. The main idea here is you have to balance a few things. You have to learn. So this is a one-sided item that you have to do. The next thing along learning, you have to figure out your execution approach. The way that you're going to execute will evolve as your learning. And then your execution needs to be based on your goals. So before you get too far into learning and before you get too far into the execution phase, you have to develop solid goals. And I'll explain that in a second. Blackelam says, Eric, when do you prefer leaps? I got leaps this dip in meta in Tesla. I'm diversifying stocks. It's easier to sell the leaps than good stocks. So leaps for me typically are when I want to have some sort of levered position in an underlying. I actually am trading leaps way less than I used to. And it's because a lot of my trading",
    "start_timestamp_seconds": 5101.2,
    "end_timestamp_seconds": 5223.28,
    "start_timestamp": "01:25:01",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=5101",
    "chunk_index": 47,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "I'm diversifying stocks. It's easier to sell the leaps than good stocks. So leaps for me typically are when I want to have some sort of levered position in an underlying. I actually am trading leaps way less than I used to. And it's because a lot of my trading methodology has come in in time quite a lot. And the duration that I'm holding these trades is quite a bit lower. So my need to go out and to get leaps is decreased. And it's also a liquidity factor. So if we take a look for example in Baba and we just eyeball what the liquidity looks like across these different timeframes. If we go out let's say like 80, 90 days, summer and here, you're about 50 cents wide for at the money. And then if we go out let's say to 15 Jan 27, you can see that you're like $2.15 wide at the money. That liquidity factor becomes a bit of an issue, especially when you're trading at size. So I find in general I don't actually like to go into leaps quite as much because most of the stuff that I'm trading. I'm not holding into perpetuity and you sacrifice a lot of the liquidity for options that you can scrub away. Things like theta impact more easily. So that's the base. Base thought process at least towards leaps. I would prefer like most of my lungs based on my trading approach. Like if I'm",
    "start_timestamp_seconds": 5201.04,
    "end_timestamp_seconds": 5329.6,
    "start_timestamp": "01:26:41",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=5201",
    "chunk_index": 48,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "into perpetuity and you sacrifice a lot of the liquidity for options that you can scrub away. Things like theta impact more easily. So that's the base. Base thought process at least towards leaps. I would prefer like most of my lungs based on my trading approach. Like if I'm trading ratio called Agnals or stuff to the upside that way, bore up in the knot, I'm like 60 to 120 days out, something like that. Reses Pareto principle. My gains have come from core holdings. Basically when trading just the chart, my results are meant. So I've been leading more into investor like who likes options. That's okay. And I think in your scenario, one of the things to consider there is like probably a gap in your profit mechanism research. Because if you're trading based on the chart that isn't inherently bad, but it does require research to figure out how you want to trade the chart in what makes sense. And from that lens, if you do a good amount of research, you can trade absolutely successfully that general way. But if you don't do the corresponding research, it's really, really difficult to trade that kind of methodology with any conviction. So if you find that it's more effective for you to invest and use options for leverage or whatever, like I think that's completely fine. The main note there is I would write off options or you know that trading methodology that you're doing until you've",
    "start_timestamp_seconds": 5306.8,
    "end_timestamp_seconds": 5420.72,
    "start_timestamp": "01:28:26",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=5306",
    "chunk_index": 49,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "methodology with any conviction. So if you find that it's more effective for you to invest and use options for leverage or whatever, like I think that's completely fine. The main note there is I would write off options or you know that trading methodology that you're doing until you've done enough research to then objectively say like whether or not it should be exonerated. Like one says, I want the shares. So I did a huge hit. I will exercise the shares kind of the opposite of Casacir put, like, what? I want the shares. So I'd get a huge hit. If wait, I will exercise the shares. Well, the thing is, like, if you have leaps, you don't want to exercise them. Like that, I hope you already know because you're going to give up and insane amount of extrinsic value. You will be light years better off just if I get a huge hit. Oh, I see. I want the shares. So if I get a huge hit, I will exercise the shares. That's a massive mistake. The reason is regardless of how big of a hit is that you get, you still are giving up a ton of extrinsic value that you otherwise can capture by literally just selling the options and then buying the shares. There's absolutely no benefit to exercising your call early. Other than, like the vanity metric of liking the basis that you see better, but you're not giving up any profit",
    "start_timestamp_seconds": 5400.72,
    "end_timestamp_seconds": 5499.52,
    "start_timestamp": "01:30:00",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=5400",
    "chunk_index": 50,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "ton of extrinsic value that you otherwise can capture by literally just selling the options and then buying the shares. There's absolutely no benefit to exercising your call early. Other than, like the vanity metric of liking the basis that you see better, but you're not giving up any profit because you're realizing that profit that you would have on the basis otherwise. So here's effectively how that would work. If we look at another scenario here, and let's take a look at a deep in the money option. We're just in Boba, so I'll stay here. And let's go to 15 Jan 27 and let's say that you have the 100's and let's say that you got them for 65 10. It doesn't matter what the price is. So 65 10 is your 100 strike calls. The underlying right now is at 15730. If we look at this scenario, we can easily see how far in the money, your option is so we can break down your value. So you'll have intrinsic and then you'll have extrinsic value in this option. Your intrinsic value is simply how far in the money, your option is. So in this case, your option is 57 points in the money. We don't want a percentage here. We want a dollar. So that's your intrinsic value. I think I flipped them. Sorry. Oh no, it's just that the multiplied out. Your extrinsic value is the remainder. So this minus this, that's how far in",
    "start_timestamp_seconds": 5475.44,
    "end_timestamp_seconds": 5611.92,
    "start_timestamp": "01:31:15",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=5475",
    "chunk_index": 51,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "option is 57 points in the money. We don't want a percentage here. We want a dollar. So that's your intrinsic value. I think I flipped them. Sorry. Oh no, it's just that the multiplied out. Your extrinsic value is the remainder. So this minus this, that's how far in the money you are, which is 50 730 and then your difference here is your extrinsic, which is 70 to 5 inches ahead of the split. The issue is if I exercise my option, let's say the 100, what happens? It means I'm going to buy to open 100 shares at 100 dollars. So the total amount of money that I'm going to have to put out is 10 grand and the current unrealized P&L here is literally just your intrinsic value. So it's how far in the money you are times your size. That's your unrealized P&L. Let's take a look at what happens if instead you sell your option. Again, depending on whatever you bought your option for P&L, we don't know yet. But if you sell to clothes, your option, what you're doing is you're getting 6515. Notice the difference in the P&L here. If I literally sell to clothes my option, I'm getting 6515. If I exercise my option, I'm switching to an unrealized gain of 5730 and I'm getting rid of all of my intrinsic value. So if I really wanted the shares for some reason, I would be light years better off, literally selling",
    "start_timestamp_seconds": 5585.92,
    "end_timestamp_seconds": 5726.32,
    "start_timestamp": "01:33:05",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=5585",
    "chunk_index": 52,
    "word_count": 250,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "sell to clothes my option, I'm getting 6515. If I exercise my option, I'm switching to an unrealized gain of 5730 and I'm getting rid of all of my intrinsic value. So if I really wanted the shares for some reason, I would be light years better off, literally selling to clothes the option and then buying to open the shares at spot price, whatever that is. And it's because of the intrinsic value. When you exercise early, you get rid of this, which you do not want to do. There's just no good reason to get rid of the extrinsic, it's literally just throwing it away. There's no benefit to doing it whatsoever, which is exactly why early exercise is so rare. You just don't see it that much. So that is why that's typically not a good reason. All right, gang. Absolutely awesome. Hang in out. I hope you guys enjoyed the mini series. If you did, please feel free to share it with folks that are going through their learning process. I try to do these to help folks. So you guys can help me do that by doing that. And I will be traveling tomorrow, so not doing any streams and then we'll be back on schedule program comes on day. So enjoy the rest of your weekend. Be an outlier. Take a closer look.",
    "start_timestamp_seconds": 5704.56,
    "end_timestamp_seconds": 5795.04,
    "start_timestamp": "01:35:04",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=5704",
    "chunk_index": 53,
    "word_count": 229,
    "upload_date": null,
    "duration": 5802.0
  },
  {
    "video_id": "6c3CUMAVF04",
    "title": "Final Exam, Path Forward, Q&A | Outlier Options Trading Basics Ep6",
    "text": "not doing any streams and then we'll be back on schedule program comes on day. So enjoy the rest of your weekend. Be an outlier. Take a closer look.",
    "start_timestamp_seconds": 5788.48,
    "end_timestamp_seconds": 5795.04,
    "start_timestamp": "01:36:28",
    "video_url": "https://www.youtube.com/watch?v=6c3CUMAVF04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=6c3CUMAVF04&t=5788",
    "chunk_index": 54,
    "word_count": 29,
    "upload_date": null,
    "duration": 5802.0
  }
]