[
  {
    "text": "We're back again with the new update, naturally reshooting this video because Rory and Kitty literally just released his updated position answering a lot of questions. So a couple quick admin notes first off, shout out to the apes. Again, I'm having a blast learning about what's going on here with you guys and it looks like unfortunately the option side of the equation might have just been removed, which will get into sport fully in just a second. But funny enough today was supposed to be the game stop shareholders meeting and because so many of you were feverishly trying to join they literally couldn't support it so they had a postponate, which was interesting. All right, let's get into now the new position. So this is essentially what I was talking about in the video I'm reshooting right now, what could have all happened here and all of this summarizes to my hypothesis at the time was that he was pairing this down and moving into equity and the reason why I thought that is because when I look at the options chains, which can tell us a lot. I know Rory and Kitty is aggressive, but I also don't think that he's quite to the point where he's just lighting money on fire. I think he's trying to be purposeful about what he's doing to increase his impact. And if we take a look at the positions here, I noticed way more volume today again in his",
    "metadata": {
      "video_id": "6CGcvPIONZs",
      "title": "EXITED Options Roaring Kitty GME Position Update",
      "url": "https://www.youtube.com/watch?v=6CGcvPIONZs",
      "upload_date": "",
      "duration": 276.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 5,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6CGcvPIONZs&t=0"
    }
  },
  {
    "text": "also don't think that he's quite to the point where he's just lighting money on fire. I think he's trying to be purposeful about what he's doing to increase his impact. And if we take a look at the positions here, I noticed way more volume today again in his 20 strike previously. And then if we take a look at the 14 June's, there's a ton of new new volume here, but this doesn't seem like his M.O. And the reason being is because this expires so short with the position that size, it would really be difficult for him to manage essentially what he's trying to do or what I think he's trying to do. So what do we end up seeing? Well, this is what it is as of like 10 minutes ago. As we can see, his entire call position is now taken down and he's essentially moved from 5 million shares to 9 million and 1000 shares, which if I'm not mistaken is the same amount that Ryan Cohen has interestingly enough. And I think that goes back to a little bit of what we saw on that Mimi did a couple days ago from the office, you know, with GameStop on the one dude's chest and then the little cat and Michael Scott's chest. Now the price he paid you could tell, obviously he was bit up a little bit and it's also very clear that he actually didn't exercise these options. In this",
    "metadata": {
      "video_id": "6CGcvPIONZs",
      "title": "EXITED Options Roaring Kitty GME Position Update",
      "url": "https://www.youtube.com/watch?v=6CGcvPIONZs",
      "upload_date": "",
      "duration": 276.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 5,
      "start_timestamp": "00:01:24",
      "start_timestamp_seconds": 84.24000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6CGcvPIONZs&t=84"
    }
  },
  {
    "text": "the office, you know, with GameStop on the one dude's chest and then the little cat and Michael Scott's chest. Now the price he paid you could tell, obviously he was bit up a little bit and it's also very clear that he actually didn't exercise these options. In this case, these 20s, they still had over 25 cents of time value, which isn't a ton to be clear, but when you're talking about 12 million shares, that's actually a lot of money, like 3 million. So he wasn't just going to throw that away. I think he simply liquidated this position over the last few days, which we can see represented in the volume like 90 something thousand volume yesterday and then today it's another 40 something thousand, which again, that would pretty much clear him right out. And it looks like he used those proceeds and rotated into this. The other thing is take a look at the cash reserves. They've come down a lot. They were 29.4 million. Now they're at 6.3 million. The other thing that this tells me very clearly. This is clearly not a mistake. It's not happenstance because notice the number he selected again. I that's very purposeful and you can tell just by the way he's placing these positions. So what's next? Well, we have to see because the expiration next week and the expiration tomorrow actually get really interesting now because if we take a look at the implied volatility for",
    "metadata": {
      "video_id": "6CGcvPIONZs",
      "title": "EXITED Options Roaring Kitty GME Position Update",
      "url": "https://www.youtube.com/watch?v=6CGcvPIONZs",
      "upload_date": "",
      "duration": 276.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 5,
      "start_timestamp": "00:02:48",
      "start_timestamp_seconds": 168.48000000000002,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6CGcvPIONZs&t=168"
    }
  },
  {
    "text": "again. I that's very purposeful and you can tell just by the way he's placing these positions. So what's next? Well, we have to see because the expiration next week and the expiration tomorrow actually get really interesting now because if we take a look at the implied volatility for both of them, they're so jacked compared to everything else that we see 384 to 281. There's still a lot of options out there, but with his liquidation, you're going to see the call, oh, I come down a bit again, but there's been so much feverish new entry on this side. I'm also curious how updated the screenshot is because it wouldn't be outside the realm of possibility for this to never mind. I just corrected myself. I realized this is at the close because it closed at 29.12. So never mind. We'll see if you potentially rotates back into options, I would love that as you can tell because that's that's my side of the business here and I have a blast following along with that, but so far, this is where it looks like he has your shares now. And we'll see where we go. I'm going to you really be following along with you guys at this point because I can't help but be fascinated. But most of the questions now are answered. We are out of options into shares. If you have any questions or anything I can help with, let me know. I'll see",
    "metadata": {
      "video_id": "6CGcvPIONZs",
      "title": "EXITED Options Roaring Kitty GME Position Update",
      "url": "https://www.youtube.com/watch?v=6CGcvPIONZs",
      "upload_date": "",
      "duration": 276.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 5,
      "start_timestamp": "00:04:12",
      "start_timestamp_seconds": 252.71999999999997,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6CGcvPIONZs&t=252"
    }
  },
  {
    "text": "to you really be following along with you guys at this point because I can't help but be fascinated. But most of the questions now are answered. We are out of options into shares. If you have any questions or anything I can help with, let me know. I'll see you guys later.",
    "metadata": {
      "video_id": "6CGcvPIONZs",
      "title": "EXITED Options Roaring Kitty GME Position Update",
      "url": "https://www.youtube.com/watch?v=6CGcvPIONZs",
      "upload_date": "",
      "duration": 276.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 5,
      "start_timestamp": "00:05:36",
      "start_timestamp_seconds": 336.96000000000004,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6CGcvPIONZs&t=336"
    }
  }
]