[
  {
    "text": "Boom, we're back. Let's talk about scanning for trades because this should not be a haphazard approach. It should be pretty systematic and it's for a few main reasons, but it all boils down to efficiency. So I'm gonna walk you through the three primary steps I take when I'm scanning for trades and then give you some examples at the end of the video. So make sure you stay tuned to check those out. Welcome back to the outliers, shout out to the Patreon family. You guys make content like this possible for everybody else. And if what I do helps you consider signing up, otherwise let's get straight into this idea of scanning for trades. The very first thing we're gonna start with is a portfolio review. This is because you have to understand how something does or doesn't fit into your portfolio. You can come across the greatest opportunity on planet Earth, but if there's no room in your portfolio to logically take on that risk, it doesn't have a place. So we start here and we look at three things. The first thing is utilization. How much money am I currently using? Is it enough or is it too much? What I'm asking here is, is it enough, meaning do I have enough risk out in order to continue moving me towards my monthly and annual performance targets? Or after I conduct a review of my portfolio, do I have too much risk out at which",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=0"
    }
  },
  {
    "text": "is it too much? What I'm asking here is, is it enough, meaning do I have enough risk out in order to continue moving me towards my monthly and annual performance targets? Or after I conduct a review of my portfolio, do I have too much risk out at which point? I'm not scanning for trades anymore. I am going to be managing the portfolio. Now the reason why monthly and annual performance targets is also on here is because if I am way ahead of where I'm supposed to be for my annual performance, I am going to be super selective, very, very selective, extremely high threshold for trades to go on because there is no reason for me to force anything whatsoever. If I am on par for my annual performance, okay, then I need to look for good trades still, but I'm not gonna be quite as selective. And if I'm behind pace for the year and let's say that I need to open up my acceptable limits slightly, but at no point does it become just put everything on? There can be instances where you're behind your annual performance and it's just because of the way that the markets are moving and that is what it is. So this isn't kind of a sliding scale to where you just start accepting garbage. But the main difference is if you were well ahead of pace, you should become super selective. Now risk assessment, this is pretty simple.",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 14,
      "start_timestamp": "00:01:35",
      "start_timestamp_seconds": 95.57142857142857,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=95"
    }
  },
  {
    "text": "that the markets are moving and that is what it is. So this isn't kind of a sliding scale to where you just start accepting garbage. But the main difference is if you were well ahead of pace, you should become super selective. Now risk assessment, this is pretty simple. I'm gonna run through these different things within the portfolio for each individual position and then for the portfolio at large. So what are my beta-weighted delta for the whole portfolio? That's kind of part of utilization, but then for the individual positions and I'm gonna run through all these different things. The reason why this is all included in a video on scanning for trades because all of these inputs give me information that what I will integrate into my scans, for example. If I have a bunch of trades that are coming up on expiration and I know that I'm going to be very light in my near term section of my portfolio, now I kind of know one of my preferences might be shorter duration positions to fill the gap that's about to be there. Same thing if I notice that I have no bar DTE opportunities or risk on at a given point in time, I might start looking for some longer duration thesises so that I can then fill that space. Having expiration, diversification is important. Same thing kind of for the rest of these. Now, the last thing here is portfolio fit. So once",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 14,
      "start_timestamp": "00:03:11",
      "start_timestamp_seconds": 191.14285714285714,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=191"
    }
  },
  {
    "text": "or risk on at a given point in time, I might start looking for some longer duration thesises so that I can then fill that space. Having expiration, diversification is important. Same thing kind of for the rest of these. Now, the last thing here is portfolio fit. So once I go through all of these different things, I'm going to come out with an output. What risk do I need or what risk do I want? And we'll get into how that kind of feeds into the broader process when we get into the examples. Now, next thing, the actual scanning. Now that we've gone through our portfolio, we have an idea of what we're looking for. Now we get to start looking. Now notice how I have these two different buckets right out of the gate. Portfolio driven versus opportunity driven scanning. These are two very, very different things. When I'm looking at the end of my portfolio review and I now have a portfolio driven need, I know exactly what I need. So in this case, let's say you go through this portfolio process and you realize that you are actually not using enough money and you need to add short-term risk and let's say that after your market analysis, you want more bullish deltas. I've just given myself a bunch of criteria that I know what I'm looking for. Whereas sometimes if I'm just looking for opportunity, let's say that I'm not using enough money, but",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 14,
      "start_timestamp": "00:04:46",
      "start_timestamp_seconds": 286.7142857142857,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=286"
    }
  },
  {
    "text": "need to add short-term risk and let's say that after your market analysis, you want more bullish deltas. I've just given myself a bunch of criteria that I know what I'm looking for. Whereas sometimes if I'm just looking for opportunity, let's say that I'm not using enough money, but I don't have any particular portfolio needs. I just need to use more money. Well, now I'm going to go searching for opportunity. What looks good out there? That's what's going to drive the difference between portfolio and opportunity driven scanning. So again, for the portfolio, we'll define the need in this step, then we'll look for the criteria to scan for that need and then conduct the scan. And then for the opportunity driven, this is when we're looking again, same exact kind of idea we're going to scan, analyze whatever the output is and then see if it fits within the broader portfolio. All right, let's talk about the last part here, which is structuring the trade. I'm going to fly through this because this part is kind of a whole different series, but it is still a piece of my scanning process because based on how I'm loosely structuring the trade mentally, we'll inform how I scan for things. And then the output of my scan will also inform what kind of trade structures make sense. It's all a symbiotic relationship that I'll kind of bring together for you in a neat package when we get to",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 14,
      "start_timestamp": "00:06:22",
      "start_timestamp_seconds": 382.2857142857143,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=382"
    }
  },
  {
    "text": "loosely structuring the trade mentally, we'll inform how I scan for things. And then the output of my scan will also inform what kind of trade structures make sense. It's all a symbiotic relationship that I'll kind of bring together for you in a neat package when we get to the examples right after this section. So the disposition that I have for a few things is really important for the market and the individual product. Because again, let's say we look at the portfolio, we're not using enough money in this example and we are very bearish. But once we look at our beta weighted deltas and we realize that we have a bunch of negative beta weighted deltas to the spy, well, how bearish are we? Maybe even though we're bearish, we might need to add some long deltas despite us being negatively viewing the entire market and having a negative disposition. That's why this whole thing pulls together in different layers to inform us. By the time I get to the end of this flow, I almost have the decision made for me. It makes it much simpler for me to arrive at good trades. So I'm gonna start with the market disposition and then again, if it's an opportunity driven trade, I'm gonna review the product nice and early. Once I get through this scanning phase, I'm always gonna make a short list of things that make sense and then I will kind of structure trades",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 14,
      "start_timestamp": "00:07:57",
      "start_timestamp_seconds": 477.8571428571429,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=477"
    }
  },
  {
    "text": "gonna start with the market disposition and then again, if it's an opportunity driven trade, I'm gonna review the product nice and early. Once I get through this scanning phase, I'm always gonna make a short list of things that make sense and then I will kind of structure trades and then make a final decision based on what best fits the overall portfolio. Now, inventory, this is an important feedback into the broader portfolio fit. Do I want to hold shares or not? What exposure duration do I need? And then based on those inputs, what strategy fits the best? Okay, so now let's get into some examples where we get a chance to bring all of this together for you. Let's say we went through those first steps and we come up with some sort of short deltas. We're not using enough money in the portfolio, we need short deltas. So what does this process look like? Well, the first thing I'm gonna figure out is how many short deltas do I need? I'm going to then allocate money to a perspective trade based on how it fits into the portfolio. Notice how I haven't scanned for anything yet. These are all things that are done before I even start looking. Then I'm gonna define my market disposition again. We need short deltas. So we think that with the market might be rolling over here, for example, then we go through the product preferences. This can be anything",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 14,
      "start_timestamp": "00:09:33",
      "start_timestamp_seconds": 573.4285714285714,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=573"
    }
  },
  {
    "text": "yet. These are all things that are done before I even start looking. Then I'm gonna define my market disposition again. We need short deltas. So we think that with the market might be rolling over here, for example, then we go through the product preferences. This can be anything from do I want to fade a specific stock? Do I want to fade a sector? Do I have anything that I'm leaning towards right now based on current market conditions? We already know we need to define what exposure duration we're looking for. So in this example, let's say we're gonna give it a trade 20,000 market disposition is bearish. Product preference, singular sector, I'm open to either exposure duration, anything greater than two weeks. Management inputs, I don't care if I'm gonna be managing it a lot or a little, but again, this does impact what strategy we end up selecting, what kind of products we can trade strategies in. Management inputs is how frequently can you interact with this position? Then we conduct our scan. So to scan for this need, I'm gonna conduct a sector review first. So let's do that. I'm looking for short dealtlets. First, I'm gonna look at six month rundown of the various sectors and see what names are in the bottom four. In this case, I see healthcare real estate staples utilities. Now I'm gonna zoom this into a three month look. And again, I see materials, industrials, staples real estate.",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 14,
      "start_timestamp": "00:11:09",
      "start_timestamp_seconds": 669.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=669"
    }
  },
  {
    "text": "First, I'm gonna look at six month rundown of the various sectors and see what names are in the bottom four. In this case, I see healthcare real estate staples utilities. Now I'm gonna zoom this into a three month look. And again, I see materials, industrials, staples real estate. So these two are repeats down here. Utilities isn't that far off. So I would still consider this on the table. And then I'm gonna bring this in closer to the duration hypothesis that I have one month. I see energy, healthcare discretionary services. So we can see staples in the really short term is actually rallying. Same thing with utilities. This is why looking at different time frames is so important because I'm trying to find something that's really sickly, something that is just not doing well. So when I get to the end of this view, healthcare has appeared quite a few times. So I'll click in a healthcare and I'll see, okay, life sciences, tools and services, healthcare equipment and supplies, pharmaceuticals. These are all leading the sector down. The reason why I want this sector alignment to the downside is because I want as many factors stacked in my favor. Does this mean that individual sectors within utilities might be dragging? In this case, they're not, but that could still be happening. But I don't want the overall sector that I'm gonna be fading to do well. I'm gonna look for robust weakness. So in this",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 14,
      "start_timestamp": "00:12:44",
      "start_timestamp_seconds": 764.5714285714286,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=764"
    }
  },
  {
    "text": "stacked in my favor. Does this mean that individual sectors within utilities might be dragging? In this case, they're not, but that could still be happening. But I don't want the overall sector that I'm gonna be fading to do well. I'm gonna look for robust weakness. So in this case, I'll start with the sector review and then I'm looking for the bottom sub-sectors and then the just laggards within those sub-sectors. And then now, finally, is when I overlay my TA inputs. So let's take a look at what that looks like. So there are tons of different ways to set up your scans. This is a very, very, very simple example on how, in my opinion, you can set up a pretty reasonable scan. You're joking about that, right? You're joking, right? So what we have here, I'm just using moving averages. And the way I set this up is purposefully to give me a really big window that I can then close in. This gives me more things to look at. Now, if you want to spend less time looking at stuff, you can make this very strict. But again, going back to the original trade hypothesis here, I just need short deltas. I don't really care what it is. So this means if I look at the portfolio and I say, oh, well, I want to have a defined risk trade or an undefined risk trade, that can be determined ahead of time. In this",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 14,
      "start_timestamp": "00:14:20",
      "start_timestamp_seconds": 860.1428571428572,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=860"
    }
  },
  {
    "text": "hypothesis here, I just need short deltas. I don't really care what it is. So this means if I look at the portfolio and I say, oh, well, I want to have a defined risk trade or an undefined risk trade, that can be determined ahead of time. In this case, I don't care. So in this case, what I'm looking at is by sector, I'm looking at things where price is a little bit below which 2250 and 150 day moving averages. That's it. So in this case, really, I care mostly about the shorter term moving averages because we're looking at something that's greater than two weeks probably less than 90 days, something like that. And I'm going to look for where I can find weakness. So here we know, if you'll recall, that the health sector has not been performing well. So I see things like NVRO, ALGN, TIDOC, and you can see all of their charts are bad. SRPT, VKTX, all of these are not doing well. mRNA, BNY. So what I'm doing here is creating a short list. So as I go through those different products, I apply, in this case, primarily technical inputs. If this say, for example, was a really long duration bullish thesis, I would overlay quite a few fundamental components, but in this case, it's mostly TA. And then I'm applying the short list. Once they get through that short list, I will then start structuring trades. So what you can",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 14,
      "start_timestamp": "00:15:55",
      "start_timestamp_seconds": 955.7142857142858,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=955"
    }
  },
  {
    "text": "this say, for example, was a really long duration bullish thesis, I would overlay quite a few fundamental components, but in this case, it's mostly TA. And then I'm applying the short list. Once they get through that short list, I will then start structuring trades. So what you can see here is overall, I'm looking to have a very, very systematic approach looking for things. And once I get through those list of names that I was rattling off, I run through kind of a more in-depth analysis of each. I will pull up the charts. I will look at some of their earnings to see if they've been beating or if they're contracting. And I'm looking for the most sickly looking things of the bunch. Again, this is all for this one specific need for short deltas. If this was an inverse scenario where I'm looking for bullish, kind of the same thing, but now I'm looking for the top sectors, the top performing sub-sectors, instead of looking for bearish TA and fundamental inputs I'm looking for bullish TA fundamental inputs. Same exact process, just different direction. Now, in another scenario, let's say that, instead of starting with a portfolio need, I come across an opportunity, and a great example of this is the VIX trade that I recently made a video on when I was talking about ratio put diagonals. So if we come over here to the VIX, and when the VIX dipped below 13 here,",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 14,
      "start_timestamp": "00:17:31",
      "start_timestamp_seconds": 1051.2857142857142,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=1051"
    }
  },
  {
    "text": "a portfolio need, I come across an opportunity, and a great example of this is the VIX trade that I recently made a video on when I was talking about ratio put diagonals. So if we come over here to the VIX, and when the VIX dipped below 13 here, that was an opportunity driven trade for me. So I saw this opportunity just based on how I typically observed markets, this drew my interest. I then thought, does a bullish trade and VIX bearish market trade fit into my portfolio? The answer was yes. So then from there, it kind of short circuits this part, because I've already found what I'm interested in for whatever reason. So then I apply the analysis for whatever I'm interested in, then apply the more in depth analysis and then structure a trade around it. But you can see that overall, I'm following the same blueprint, I'm just skipping at least this part of the scan because it doesn't apply in this scenario, but all of these other things matter to me. When I'm structuring the position again, even for an opportunity compared to a portfolio, the main difference is how this scanning section works, where this one, I don't really know what I'm looking for, and I'm looking for things to find opportunities. In this case, I already know what I'm interested in for whatever reason. So let me know if you have any questions on this process, if there's anything that",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 14,
      "start_timestamp": "00:19:06",
      "start_timestamp_seconds": 1146.857142857143,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=1146"
    }
  },
  {
    "text": "section works, where this one, I don't really know what I'm looking for, and I'm looking for things to find opportunities. In this case, I already know what I'm interested in for whatever reason. So let me know if you have any questions on this process, if there's anything that didn't make sense, or if there was something you learned, I would love to know about that, so I can dive a little bit further into detail on those things, maybe in future videos. Like, subscribe, share, be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "6ecVwRkN4hw",
      "title": "The Ultimate Guide to Scanning for Profitable Options Trades",
      "url": "https://www.youtube.com/watch?v=6ecVwRkN4hw",
      "upload_date": "",
      "duration": 877.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 14,
      "start_timestamp": "00:20:42",
      "start_timestamp_seconds": 1242.4285714285716,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6ecVwRkN4hw&t=1242"
    }
  }
]