[
  {
    "text": "What's up outliers, no live stream today, just a quick market update. I have two things on the agenda. I'm going to talk quickly about Tesla and a recent trade that I discussed in TSL. And then we have a lot to get into with GameStop. So we're going to cover all of that pretty quickly. The quick reason for no stream in the slightly intermittent cadence is because this dude here, the guy that really got me into investing trading and really just sent me down a completely different path of life is in the hospital. Long story, but it is taking a bit of my time and I'm actually heading to New York to go see him. So just working around that stuff all that aside, let's take a look at the markets broadly quickly. And a couple things really still stick out to me that are worth mentioning. One of them is volatility still remains suppressed even on the move that we saw today. And we can see across the sectors, we're starting to see some clear trends emerge. And that is, if you'll notice, most of the standard deviation lines on these three-month charts are actually slightly positive sloping for most of them. Now you will see things like tech still lagging against comm services. That's an important relationship to pay attention to. You can also see that staples is still hovering sideways while discretionary is in the resumption of this broader rally. So interesting market",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=0"
    }
  },
  {
    "text": "slightly positive sloping for most of them. Now you will see things like tech still lagging against comm services. That's an important relationship to pay attention to. You can also see that staples is still hovering sideways while discretionary is in the resumption of this broader rally. So interesting market interplay here. I don't want to get bogged down on this because we have a lot to get into. So let's pivot now quickly to Tesla. And Tesla has been in a really interesting phase. I had talked about this on a couple live streams, not that long ago, about how from a podod's perspective, Tesla down here after it posted this bottom looked interesting to me to an upside style play. So I ended up choosing to run it with TSLL. I'll show you the trades in a second. But if we take a look at the primary news impacting Tesla right now, a lot of it has to do with the tariffs that were recently launched. But the interesting thing for Tesla is most of the Tesla's are built in Texas. So the impact of the automotive tariffs really are unlikely to nail Tesla as hard as it will. Other companies like Ford and GM, which again, we knew that this was coming down the pike. So this broader rally that you see going on here still seems really tenuous to me. We captured the 200 day MA and then rolled right back over. So normally when I'm",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 16,
      "start_timestamp": "00:01:08",
      "start_timestamp_seconds": 68.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=68"
    }
  },
  {
    "text": "will. Other companies like Ford and GM, which again, we knew that this was coming down the pike. So this broader rally that you see going on here still seems really tenuous to me. We captured the 200 day MA and then rolled right back over. So normally when I'm using any sort of MA, I'm not in this case, but typically I'll use a percent band around it because this kind of behavior is relatively normal. But I think Tesla is getting wrapped up in a lot of near term bad sentiment and press. There are a lot of people that are very upset with Elon. What he's doing with Doge, you can see this obviously represented in people with these crazy Tesla stickers. Like before I knew Elon was not and literally vandalizing other people's Tesla, which is absolutely absurd to do that to somebody else. And also vandalizing Tesla buildings. It's I think all of that is captured in here. Now Tesla historically is super volatile and we can see that, right? Like just the way that it moves. This is not highly anomalous to see it moving how it is. It's always been very volatile. One big note though is this really persistent downside pressure also coalesced with the rest of the broader market. And sooner or later people do start to step in and say, do I think Tesla or whatever company we're looking at is really at a point where it should be price",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 16,
      "start_timestamp": "00:02:29",
      "start_timestamp_seconds": 149.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=149"
    }
  },
  {
    "text": "big note though is this really persistent downside pressure also coalesced with the rest of the broader market. And sooner or later people do start to step in and say, do I think Tesla or whatever company we're looking at is really at a point where it should be price where it is relative to where it was. And it still has a very high multiple. There is no way around that when we look at where Tesla sits. So I think in the near term, shorter term ideas is mostly playing the volatility longer term ideas is probably playing the longer term appreciation of the company. Now the shorter term ideas I discussed for me was via TSL. And this is for a few different reasons. It's just the right product for what I was doing. And what I ultimately chose was once I saw this double bottom here, it kind of rotated up and around approach bottom again, but then it rallied up a little bit. This is where I started slowly building a position very, very early. And then I had terminated meaning built the final position on the 21st. And then I ultimately unwound the position. I took some of it down on the 24th of really small amounts. And then I put the remaining of it down as it fell through the close from the prior day in here on the 25th. So I'll show you those trades really quick so that just so you",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 16,
      "start_timestamp": "00:03:36",
      "start_timestamp_seconds": 216.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=216"
    }
  },
  {
    "text": "I took some of it down on the 24th of really small amounts. And then I put the remaining of it down as it fell through the close from the prior day in here on the 25th. So I'll show you those trades really quick so that just so you can get a sense of what they were. And I actually want to show you how they behave differently. So I had two different explorations. I had the 17 April 25 in the 16 Jan 26. So if you take a look at the options chain, it's 22 days expiration and 51. So why would I do that? Why am I in these, I'm sorry, 16 Jan 26, sorry, not the May this one here. So this was 296 days. So why would I do that? Well, it's the same thing you've heard me talk about before where if I'm trying to play something for gamma, I will use near term options that are typically further out of the money I refer to these as kicker options. They're much more likely to lose money. But if I do get an accommodating move, they can print pretty heavily relative to their cost, which you'll see. Then this is the base position, the position that I had out in 16 Jan 26. This is to give the idea of much more time to work if it needed it. And in this case, it didn't. That doesn't mean that I think the idea",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 16,
      "start_timestamp": "00:04:45",
      "start_timestamp_seconds": 285.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=285"
    }
  },
  {
    "text": "cost, which you'll see. Then this is the base position, the position that I had out in 16 Jan 26. This is to give the idea of much more time to work if it needed it. And in this case, it didn't. That doesn't mean that I think the idea is done. I actually don't. But it is there's no reason for me to roll it right at back through this rollover section versus just reentering if conditions look favorable again. So let's take a look at the difference between these two trades. I had 100 of the 17 April 25 15 calls. And again, I kind of phased over to these in several days. The average cost for the position was around 12 cents. So these were very cheap options, very likely to expire worthless. And you can see the cost to get into the position is trivial, right? So the entire premise behind this is pretty straightforward. This is a 1,200 position as it relates to the portfolio. This is a fraction. It's literally less than a percent way less than a percent. And it's either going to work or it's not going to work. So the way that the risk is defined on that leg is literally by the size of the trade. So those go on for 1,200 and you can see when Tesla, when I first started phasing out, you can see that it was here and here. The overall average price was just right",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 16,
      "start_timestamp": "00:05:44",
      "start_timestamp_seconds": 344.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=344"
    }
  },
  {
    "text": "that the risk is defined on that leg is literally by the size of the trade. So those go on for 1,200 and you can see when Tesla, when I first started phasing out, you can see that it was here and here. The overall average price was just right around 11. So that's what I'm using for the analysis here is using 1110. So you can see these were bought for 1,200 and they ended up returning 3,200. So a pretty significant return relative to the cost that went in. Now again, it's not a big sum of money, but this is just playing the pot odds on a speculative trade. Now take a look at this other position where average price was about 1,48. This was a 25 lot in total and take a look at the difference here. So this is obviously a bit more of an expensive trade to put on relative. It was like 3,700 and this ended up returning about 4,500. So a larger gross total return, but a lower return on invested capital. Still overall really solid between the two of these. And again, the broad idea here was playing this short term pop. And if it continued, I would have still been in them, but we'll see if we phase back in, but it's a little early to tell. Okay, now over to GameStop. What's going on here? Well, first of all, we had earnings and earnings came out after the close.",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 16,
      "start_timestamp": "00:06:53",
      "start_timestamp_seconds": 413.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=413"
    }
  },
  {
    "text": "pop. And if it continued, I would have still been in them, but we'll see if we phase back in, but it's a little early to tell. Okay, now over to GameStop. What's going on here? Well, first of all, we had earnings and earnings came out after the close. We can see here, there was estimated at nine pennies and it came in at 30 cents. That is a massive EPS surprise, technically called a surprise. And it's a massive EPS beat. So that coupled with this move typically opens us up to a fantastic thing called post earnings announcement drift. If we take a look through how we actually performed, we can see that net sales came down a little bit compared to Q4 year over year. That is not a great look. We don't actually care for that. We want to see sales expanding, but right now the company is absolutely going through pivot, which leads into part of the Bitcoin news that came out from the earnings. And then also today, which we'll talk about, you can see that cash that they're sitting on is 4.775 billion at the close of the quarter. And you can see that they divested Italy and winding down operations in Germany. So looking at the total year of 2024, sales really were very soft. 24 compared to 23. Again, this is a broader trend that we have to pay attention to because the company is in a great spot to",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 16,
      "start_timestamp": "00:08:07",
      "start_timestamp_seconds": 487.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=487"
    }
  },
  {
    "text": "see that they divested Italy and winding down operations in Germany. So looking at the total year of 2024, sales really were very soft. 24 compared to 23. Again, this is a broader trend that we have to pay attention to because the company is in a great spot to pivot and innovate, but it does have to do something. And it's starting to do something which again, we'll talk about, but contracting sales at this scale is not good. Now, a lot of people are really honed in on this net income of 131 mill, again, 6.7 mill. The net income here is good, but again, when too much of it comes from holding cash and earning interest, that is not sustainable, especially if inflationary pressures come back, this is good for now. It's good scenario, but the net income is more of a byproduct of what it's holding from really advantageous offerings. Sales needs to go up. Now, that leads us into the following announcement from yesterday that says that the board approved an update to investment policy to add Bitcoin as a treasury reserve asset. Very interesting choice, something that we've seen clues about for quite a while now, the picture with Sailor, some of the conversations that Cohen has had with Bitcoin magazine, and I forgot the name of the actual company, but he was replying in a thread saying that he heard from them, which it was another cryptocurrency organization. And so this move, I",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 16,
      "start_timestamp": "00:09:34",
      "start_timestamp_seconds": 574.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=574"
    }
  },
  {
    "text": "while now, the picture with Sailor, some of the conversations that Cohen has had with Bitcoin magazine, and I forgot the name of the actual company, but he was replying in a thread saying that he heard from them, which it was another cryptocurrency organization. And so this move, I don't think shocks anybody. Now, the way that the move is happening is actually very interesting. And here's what's going on. They're using a very smart approach here. What they're doing is effectively using convertible senior notes. This is a debt instrument. So they're looking to raise 1.3 up to 1.5 billion dollars. The convertible notes, they mature on 1 April in 2030, unless they are chosen to be converted earlier. This is the really interesting part of the notes that we see here. The first one is that they do not yield any regular interest. And the principle does not change. So the first question we ask ourselves is, why would somebody buy these if there's obviously no yield on them? Well, you buy because you think it's going to go up. You buy because you can get it cheaper now and you expect to be able to convert these at some point in the future and make money on the conversion. That's the idea here. So this is actually starting to tie in very interesting parties from an institutional level, which I find interesting. Next thing I see here is a broad misunderstanding of the settlement of these",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 16,
      "start_timestamp": "00:11:04",
      "start_timestamp_seconds": 664.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=664"
    }
  },
  {
    "text": "these at some point in the future and make money on the conversion. That's the idea here. So this is actually starting to tie in very interesting parties from an institutional level, which I find interesting. Next thing I see here is a broad misunderstanding of the settlement of these notes. There are effectively four paths GameStop can go. The first one is they can settle them with cash. The second is they can issue new shares. So what this does is at the time of offering of the notes, there's no dilution. But there can be dilution. If in the future GameStop chooses to issue new shares to cover the conversion of these when they do begin converting, they can use a mix of these different approaches or they can leverage treasury shares if they want to just sell their own shares versus bringing new shares onto the market, which I don't think they have any. You would know better than me. So I definitely would lean on you all to let me know in the comments if they do have treasury shares. But I don't think that they do based on looking at their cash assets and equivalents. So then this opens the follow on question of, well, why Bitcoin? How does adding Bitcoin help GameStop here? Well, it's a really interesting thing because right now GameStop is doing well holding cash. However, if you can raise money using other people's money without diluting the stock up front",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 16,
      "start_timestamp": "00:12:27",
      "start_timestamp_seconds": 747.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=747"
    }
  },
  {
    "text": "So then this opens the follow on question of, well, why Bitcoin? How does adding Bitcoin help GameStop here? Well, it's a really interesting thing because right now GameStop is doing well holding cash. However, if you can raise money using other people's money without diluting the stock up front with the expectation of increasing the value of the stock so that those people can get paid back, then you can add to the balance sheet without drawing down your cash. It is a massive branding opportunity for GameStop to show that it's doing things different, that it's adopting cryptocurrency, potentially using it for even different that we're not even thinking about now, business operations or opportunities in the future. So I think that there's a big part of this that literally comes from a branding perspective because the institutional story for people that are going to be interested in buying these convertible senior notes is important. Now, the other thing is if you compare cash against Bitcoin, Bitcoin is super volatile. So you can also tell that's why they're not putting a ton of money in Bitcoin. The other thing to note about Bitcoin is that it does offer appreciation opportunity. So if this trend continues with other institutions and other companies starting to add Bitcoin to the balance sheet, it actually starts to push the price of Bitcoin up as it becomes largely sponsored. So this could be GameStop actually speculating a little bit with an investment. Now,",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 16,
      "start_timestamp": "00:13:43",
      "start_timestamp_seconds": 823.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=823"
    }
  },
  {
    "text": "appreciation opportunity. So if this trend continues with other institutions and other companies starting to add Bitcoin to the balance sheet, it actually starts to push the price of Bitcoin up as it becomes largely sponsored. So this could be GameStop actually speculating a little bit with an investment. Now, again, when it comes to the broader business, I don't really care about this one way or the other. I don't think it's a bad move. I think it's completely fine. But for the business side of things, we need profitability. We need sales. We need revenue. This, I think, is starting to hint at a pivot that the company might be taking in the future, which we will have to see how that pans out. So I am really, really excited to see this happening. Now GameStop is trading lower after the close today. We can see right now it's at 2675 after hours. It was at 28, so really, really great run. But it'll be returning back down pretty considerably down to this handle somewhere in here. And this doesn't surprise me just because Bitcoin, I'm sorry, GameStop, now holding Bitcoin, just moves a lot. So there's no big shock here. Now, I do have a couple of position updates and stuff like that, but we can go into those that a future point of people are interested. If so, great. Happy to, if not, no problem. But before we do that, let's take a quick look at",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 16,
      "start_timestamp": "00:15:04",
      "start_timestamp_seconds": 904.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=904"
    }
  },
  {
    "text": "big shock here. Now, I do have a couple of position updates and stuff like that, but we can go into those that a future point of people are interested. If so, great. Happy to, if not, no problem. But before we do that, let's take a quick look at the options chain and see if anything sticks out to us here. And you can see that the options chain is actually very, very quiet on a relative level. There's only 690,000 calls against 209,000 puts. So for something like GameStop, this is actually very quiet. Now, another thing that is different is that the front expiration concentration is still there. But you can see that there's actually a lot more dispersion into some of the further term, less near term expiration. So this is more positional style trading. There were a lot of calls traded today on the ask side, but still, again, nothing massive as far as I'm concerned. I took a look through on our friends over at unusual whales, just to see if anything was jumping out at me and not really. So if we take a look over the last 14 days, we can see that the call premiums absolutely jacked today on a relative basis. So really, really high call premiums on a relative basis. But this is on a relative basis because things have been absolutely silent. So a lot of this, I think, is from following the earnings announcement. And then we",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 16,
      "start_timestamp": "00:16:18",
      "start_timestamp_seconds": 978.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=978"
    }
  },
  {
    "text": "that the call premiums absolutely jacked today on a relative basis. So really, really high call premiums on a relative basis. But this is on a relative basis because things have been absolutely silent. So a lot of this, I think, is from following the earnings announcement. And then we will see how this trends tomorrow. But I think that this is a lot of people probably playing the next quarter for GameStop based on its prior earnings release. But again, like the overall size here isn't too crazy. 10 million total premiums. That's again, for the context of GameStop, it's not, it's not huge. It's not insignificant, not worth noting. But if we take a look at the largest trade today, it was 1.1 million. And you can see that the rest are like sub 500,000. So this isn't like huge positioning yet. But it looks really positive for GameStop. I love to see the pivot that it's making with cryptocurrency, adding a little bit of Bitcoin. And I'm more interested to see what adding the Bitcoin means to the company in terms of its future and its future plans to generate sales and revenue. As always, if you have any questions, let me know anything I should look at. Let me know via an outlier. See you later.",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 16,
      "start_timestamp": "00:17:30",
      "start_timestamp_seconds": 1050.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=1050"
    }
  },
  {
    "text": "have any questions, let me know anything I should look at. Let me know via an outlier. See you later.",
    "metadata": {
      "video_id": "6epupAYLkYc",
      "title": "Market Analysis: GameStop Earnings, Bitcoin Purchase + Trading Tesla with TSLL",
      "url": "https://www.youtube.com/watch?v=6epupAYLkYc",
      "upload_date": "",
      "duration": 1133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 16,
      "start_timestamp": "00:18:46",
      "start_timestamp_seconds": 1126.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6epupAYLkYc&t=1126"
    }
  }
]