[
  {
    "text": "What's up, outliers? Today, I'm going to show you exactly how I analyze the stock market to come up with a disposition. So this informs everything that I do to make sure that the individual positions I'm putting on make sense relative to what I think is going on in the big picture. So we're going to walk through three different levels that I like to look at. And then I'm going to give you specific tools that you can use to analyze the specific data points that I like to look at. So what's up, everyone? Eric here. We'll come back to the outliers. Let's get right in. So the first thing we're going to start with is kind of this approach to analyzing the stock market. You see that there's there's three levels. At the very top level, I need to understand a little bit about the economy, whether I'm trading really, really short time frames or much longer time frames. I still want to know what's going on. Now to be clear for shorter term time frames, I kind of care less about the much larger picture, but my trading typically spans multiple time frames. So I'm going to start with the economy. Then I'm going to rotate over to the stock market. This is where I'm looking at things at a bit of a higher level. And then I'll get down into individual stocks. So let's start with what this process looks like. How do we",
    "metadata": {
      "video_id": "6Ifus0KfJYQ",
      "title": "How I Analyze the Stock Market to Build Ideas",
      "url": "https://www.youtube.com/watch?v=6Ifus0KfJYQ",
      "upload_date": "",
      "duration": 563.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6Ifus0KfJYQ&t=0"
    }
  },
  {
    "text": "going to start with the economy. Then I'm going to rotate over to the stock market. This is where I'm looking at things at a bit of a higher level. And then I'll get down into individual stocks. So let's start with what this process looks like. How do we start with the economy? Well, I'm going to look at general production and productive indicators, both for the economy writ large, but for then individual contributors, us as consumers and as producers. So I'm going to look at things like GDP, which kind of summarizes a lot of that for us. Inflation metrics like CPI and PPI. I'm going to look at unemployment, FOMC stances on things FOMC right now is a lot more topical than it is sometimes. It's not always invoked and not all of these things matter the same over different periods of time. But I'm kind of starting zoomed out and then clicking in because knowing if we're in expanding or contracting economy, that's really important. Understanding the direction of inflation, so on and so forth. So I'm zooming you down into different metrics that kind of matter, but in descending order almost. So then after we get through kind of the broader government stuff, I want to start looking at production, so things like manufacturing and then also consumers. How are the consumers doing because they're going to consume what's been manufactured? They're going to be massive participants in things like the housing market. So",
    "metadata": {
      "video_id": "6Ifus0KfJYQ",
      "title": "How I Analyze the Stock Market to Build Ideas",
      "url": "https://www.youtube.com/watch?v=6Ifus0KfJYQ",
      "upload_date": "",
      "duration": 563.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 10,
      "start_timestamp": "00:01:28",
      "start_timestamp_seconds": 88.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6Ifus0KfJYQ&t=88"
    }
  },
  {
    "text": "we get through kind of the broader government stuff, I want to start looking at production, so things like manufacturing and then also consumers. How are the consumers doing because they're going to consume what's been manufactured? They're going to be massive participants in things like the housing market. So this is how I visualize the broad market by starting with the economy. So how can we see all these different things? Well, there's a few tools at your disposal and most of them are free. So the first one I'll show you is from Fred. And this is a really great website that you can set up your own dashboards that look at the specific metrics you're interested in. So here I'm looking at the federal funds rate here. I'm looking at the consumers. So I'm looking at the linkancy rate on credit cards. I want to see single family residential mortgage chargeoffs or delinquency rates. Then I can look at chargeoffs based on businesses because people aren't paying their bills. I can look at personal savings consumption. Literally, whatever you want is in here. I look at broad sales. As you can tell, I look at things like GDP, unemployment, all of those metrics matter to me. You literally can build your own dashboard right here in Fred. It's completely free. So that's the first resource I would put in front of you for economic data. The other resource is also very cool. Within think or swim, you",
    "metadata": {
      "video_id": "6Ifus0KfJYQ",
      "title": "How I Analyze the Stock Market to Build Ideas",
      "url": "https://www.youtube.com/watch?v=6Ifus0KfJYQ",
      "upload_date": "",
      "duration": 563.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 10,
      "start_timestamp": "00:02:56",
      "start_timestamp_seconds": 176.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6Ifus0KfJYQ&t=176"
    }
  },
  {
    "text": "GDP, unemployment, all of those metrics matter to me. You literally can build your own dashboard right here in Fred. It's completely free. So that's the first resource I would put in front of you for economic data. The other resource is also very cool. Within think or swim, you can come up here to the analyze tab, go to economic data, and they have a ton of stuff. A lot funny enough, they pull in from Fred. So you can come in here, you can look at the monetary data and you can say, well, I'm curious what M1 looks like. It'll give you all different kinds of variations to be clear. A lot of them are discontinued. So you have to pay attention to that, but a lot of them aren't. So you can see, okay, well, what's M1? Here it is. You can look at it across different time frames. So this right now is the max, but I could look over at the last five years, which wonder where COVID was. And you can tinker with this in a bunch of different ways, just like you can with the rest of your charge. So this is another really favorite place that I feel like is generally underutilized in think or swim. So next up, we have the stock market. How do I look at the stock market? There's a couple big steps. And again, it's in the same thought process as what I was sharing before.",
    "metadata": {
      "video_id": "6Ifus0KfJYQ",
      "title": "How I Analyze the Stock Market to Build Ideas",
      "url": "https://www.youtube.com/watch?v=6Ifus0KfJYQ",
      "upload_date": "",
      "duration": 563.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 10,
      "start_timestamp": "00:04:25",
      "start_timestamp_seconds": 265.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6Ifus0KfJYQ&t=265"
    }
  },
  {
    "text": "another really favorite place that I feel like is generally underutilized in think or swim. So next up, we have the stock market. How do I look at the stock market? There's a couple big steps. And again, it's in the same thought process as what I was sharing before. I'm going to look at the performance of the indices relative to one another. I'm going to look at breadth indicators like net highs lows, tick trend. Then I want to look at individual sectors and see how they're performing. I want to understand what earnings trends are going on. What does volatility look like? And then I want to even get down into the correlations and broader themes that I see happening in the stock market. So today, some of the bigger themes I see going on are we care a lot about inflation, which is highly impacted by all of these different kinds of production metrics and efficiency metrics, how well we're doing as an economy. That's in laser focus right now. From a stock market perspective, I like to start by looking at a grid of charts. So here, you've seen this before in my videos. And this is where I just take a look at the broad indices. So this is looking at spy cues, I WM. A lot of times I like to use the futures, but a lot of people resonate with these more. So I just leave them up, because they're equally easy",
    "metadata": {
      "video_id": "6Ifus0KfJYQ",
      "title": "How I Analyze the Stock Market to Build Ideas",
      "url": "https://www.youtube.com/watch?v=6Ifus0KfJYQ",
      "upload_date": "",
      "duration": 563.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 10,
      "start_timestamp": "00:05:53",
      "start_timestamp_seconds": 353.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6Ifus0KfJYQ&t=353"
    }
  },
  {
    "text": "this is where I just take a look at the broad indices. So this is looking at spy cues, I WM. A lot of times I like to use the futures, but a lot of people resonate with these more. So I just leave them up, because they're equally easy to look at. So the spy is SP 500. The cues is technically not just tech, but it's very tech dominated. I WM is 2000 plus small cap stocks. Then I have other breadth indicators like this is the percentage of SP 500 stocks above their 50 period moving average. Here I have bonds. Sometimes this will switch between bonds and crypto currencies. And then here, I have volatility. So when I'm looking at this, I'm looking at all sorts of things. I want to know how they look in relation to one another. Like, for example, I WM had a really outsized move today, but it's been lagging compared to both the cues and spy spy is knocking right at the door of near term highs, whereas cues still has some ways to go. So tech is lagging a little bit. Then other tools I like to use are net highs lows. So this one down here is for the New York Stock Exchange kind of broader. This over here is for the NASDAQ Exchange. Again, you'll get a little more tech skew in here. So I use all of these tools starting from the top economy, then clicking",
    "metadata": {
      "video_id": "6Ifus0KfJYQ",
      "title": "How I Analyze the Stock Market to Build Ideas",
      "url": "https://www.youtube.com/watch?v=6Ifus0KfJYQ",
      "upload_date": "",
      "duration": 563.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 10,
      "start_timestamp": "00:07:22",
      "start_timestamp_seconds": 442.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6Ifus0KfJYQ&t=442"
    }
  },
  {
    "text": "net highs lows. So this one down here is for the New York Stock Exchange kind of broader. This over here is for the NASDAQ Exchange. Again, you'll get a little more tech skew in here. So I use all of these tools starting from the top economy, then clicking down into the individual indices themselves. See how they're moving by themselves, but then also in relation to one another. So this is a three month chart. I also like to zoom these out. Take a look at a six month chart and see what the overall trend has been, especially if I see all the trends are aligned. Sometimes I'll click in a little bit and say, okay, well, how has this actually looked over a long term time frame like this right here? Notice that difference. On a six month time frame, the standard deviation channels are negative sloping. But then if I click into a three month time frame, I actually see them ascending. So it tells me that there's a level of recovery going on right now. So by tinkering with different time frames, it gives me different visualizations. The other thing I like to look at is volume. And there's also an average volume line here that's for the past 20 trading days last month, essentially. And I want to see is volume picking up on the down moves is volume picking up on the up moves is volume expanding, contracting all of these different",
    "metadata": {
      "video_id": "6Ifus0KfJYQ",
      "title": "How I Analyze the Stock Market to Build Ideas",
      "url": "https://www.youtube.com/watch?v=6Ifus0KfJYQ",
      "upload_date": "",
      "duration": 563.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 10,
      "start_timestamp": "00:08:50",
      "start_timestamp_seconds": 530.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6Ifus0KfJYQ&t=530"
    }
  },
  {
    "text": "at is volume. And there's also an average volume line here that's for the past 20 trading days last month, essentially. And I want to see is volume picking up on the down moves is volume picking up on the up moves is volume expanding, contracting all of these different data points feed in to what I'm looking at. Then I can use other tools like this next grid, which lets me look at all of the individual sectors within the SP 500. So I can see how the SP 500 is doing here by itself. And then I can take a look at all of the component sectors and see what sectors are doing well, what sectors are not doing well. So like in this case, I can see XLK, which is technology is actually running negative compared to a lot of other things. And XLB kind of builders, they're running about sideways, but real estate has been on a tear over the last three months. And then again, sometimes I will come in here and change the time frame to be slightly longer term for me. Three months is about my sweet spot for what I tend to trade and care about, but giving you some ideas on what to look like. The other thing that I want to bring up is using other tools to summarize stuff like what's going on with current earnings are companies beating or they not beating chat GPT is great for this.",
    "metadata": {
      "video_id": "6Ifus0KfJYQ",
      "title": "How I Analyze the Stock Market to Build Ideas",
      "url": "https://www.youtube.com/watch?v=6Ifus0KfJYQ",
      "upload_date": "",
      "duration": 563.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 10,
      "start_timestamp": "00:10:19",
      "start_timestamp_seconds": 619.3599999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6Ifus0KfJYQ&t=619"
    }
  },
  {
    "text": "trade and care about, but giving you some ideas on what to look like. The other thing that I want to bring up is using other tools to summarize stuff like what's going on with current earnings are companies beating or they not beating chat GPT is great for this. And then themes and trends, this is what lets me kind of come up with broader ideas like for example, one of the themes I see right now is real estate is been on a tear relative to tech. And tech has been slowing down. So that's just a theme. And maybe when I'm coming up with different trade ideas that will feed into what I'm looking for. And then the last part of analyzing the stock market we come down to the individual stocks, which is super simple looking at technical analysis and fundamental analysis. I have a video down below that goes into technical analysis for stocks. It runs through them in detail. But if you guys are interested in another video that walks through analyzing stocks specifically happy to do it. Just let me know in the comments. As always, any questions? Let me know be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "6Ifus0KfJYQ",
      "title": "How I Analyze the Stock Market to Build Ideas",
      "url": "https://www.youtube.com/watch?v=6Ifus0KfJYQ",
      "upload_date": "",
      "duration": 563.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 10,
      "start_timestamp": "00:11:47",
      "start_timestamp_seconds": 707.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6Ifus0KfJYQ&t=707"
    }
  },
  {
    "text": "outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "6Ifus0KfJYQ",
      "title": "How I Analyze the Stock Market to Build Ideas",
      "url": "https://www.youtube.com/watch?v=6Ifus0KfJYQ",
      "upload_date": "",
      "duration": 563.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 10,
      "start_timestamp": "00:13:16",
      "start_timestamp_seconds": 796.3199999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6Ifus0KfJYQ&t=796"
    }
  }
]