[
  {
    "text": "I'm going to walk you through literally a step-by-step process on how to logically use stops when trading options. This is not going to be a generalization. This is going to give you the exact framework that I use so that you're not just setting random stops because you probably have heard bullshit like you can't go broke taking profits. Yes, you can because sooner or later risk will be realized. And if you're not taking enough big wins to compensate for the losing trades, you have a negatively expected approach. So we're going to talk about how to actually define this for yourself. So it's not random. You're not doing things like, oh, I think I should manage risk at X percent of the portfolio. And you're going to say, I actually need to define risk for this specific strategy at this specific spot because this is optimal. So what's up, everyone? Eric here. Welcome back to the outliers. Let's talk about using stops in trading options. We have a bit of a framework that we're going to work through together. And the very first thing I want to focus on here is stops. They are literally designed to manage risk in a trade. They can't be random. Now you can have some general portfolio guidelines like I don't want to risk more than five percent of the portfolio on an individual trade. If you have a really small account, you have a bigger account. Maybe it's half a",
    "metadata": {
      "video_id": "6lIx0wSsN7Y",
      "title": "The Ultimate Guide for Using Stops in Options Trading",
      "url": "https://www.youtube.com/watch?v=6lIx0wSsN7Y",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6lIx0wSsN7Y&t=0"
    }
  },
  {
    "text": "manage risk in a trade. They can't be random. Now you can have some general portfolio guidelines like I don't want to risk more than five percent of the portfolio on an individual trade. If you have a really small account, you have a bigger account. Maybe it's half a percent of the portfolio or whatever it is that you set. You can set general guidelines like that to manage risk at a, you know, overarching level. However, from an individual strategy level, you can't default to stuff like that because the way we use stops to manage risk has to be reflective of the strategy itself, which in a few moments, you'll understand a little bit more about what that means. At the end of the video, I'm going to walk you through a actual example for a live trade that's on as of right now. Okay, so let's talk about a few things. There are a couple kinds of stops that I use. There's a resting stop and a mental stop. A mental stop is kind of what it sounds like. It's not anything that's sitting in the market. It's a spot that's predetermined before I enter the trade where I'm going to take a good hard look at what I'm doing and see if it makes sense. A resting stop is actually an order that's submitted, sitting there, ready to be triggered. Now, resting stops, the only type that makes sense for that is a market order.",
    "metadata": {
      "video_id": "6lIx0wSsN7Y",
      "title": "The Ultimate Guide for Using Stops in Options Trading",
      "url": "https://www.youtube.com/watch?v=6lIx0wSsN7Y",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6lIx0wSsN7Y&t=0"
    }
  },
  {
    "text": "trade where I'm going to take a good hard look at what I'm doing and see if it makes sense. A resting stop is actually an order that's submitted, sitting there, ready to be triggered. Now, resting stops, the only type that makes sense for that is a market order. Now, you have to understand the nuances of this. Intentate orders can have a lot of slippage, meaning if things are going down really fast and you get a fill, you can get filled at a really bad price. You have to bake that into the way you choose your stop points to account for that slippage. Why not something like a stop limit order? The problem with the stop limit versus the stop market is a stop limit might not get triggered. It's the exact you need to manage risk. It's the whole point of a stop. Let's say that you wanted to get out at 100, but you're being cheap and you said a stop limit so that you want to get filled at 100, but you're the lowest that you're willing to go as 98. Well, what if it goes down to 96, then 90, then 85, then 80, meanwhile, you should have gotten out way higher above to manage the risk. That's the problem here. Now, when it comes to picking a stop, there are two elements that go into this equation. We need to define where we are wrong and your ego is going to",
    "metadata": {
      "video_id": "6lIx0wSsN7Y",
      "title": "The Ultimate Guide for Using Stops in Options Trading",
      "url": "https://www.youtube.com/watch?v=6lIx0wSsN7Y",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6lIx0wSsN7Y&t=0"
    }
  },
  {
    "text": "then 80, meanwhile, you should have gotten out way higher above to manage the risk. That's the problem here. Now, when it comes to picking a stop, there are two elements that go into this equation. We need to define where we are wrong and your ego is going to have a big problem with this. Most people don't do this at the onset of the trade is because we don't want to think about the scenario where we're wrong, but you got to get over that. As a trader, learning to be a better loser of positions will ultimately make you more money. That's the first thing. We got to define based on the strategy, where are we wrong? For example, if you're selling something like an iron condor, there's a clear spot that we're wrong in the trade. So for example, I'm using Bill because this is the example we're going to use for the other scenario. And right now, I'm just looking at the 20D's, 9583 iron condor. That's short. Well, you can see where the break even is, which is here and here, is that where you're wrong? Maybe. It depends on the strategy as you've outlined. But the important thing is what I can tell you is if we're trading, say, for example, on iron condor, and we sold it when it was down here, well, there's a spot that you're wrong. This spot is wherever you define, but this has obviously shot up to",
    "metadata": {
      "video_id": "6lIx0wSsN7Y",
      "title": "The Ultimate Guide for Using Stops in Options Trading",
      "url": "https://www.youtube.com/watch?v=6lIx0wSsN7Y",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6lIx0wSsN7Y&t=0"
    }
  },
  {
    "text": "outlined. But the important thing is what I can tell you is if we're trading, say, for example, on iron condor, and we sold it when it was down here, well, there's a spot that you're wrong. This spot is wherever you define, but this has obviously shot up to the moon. So you have to be thoughtful about the way that your strategies work. Now the funny thing about iron condors and stuff like that is a lot of times if you're trading risk premiums, you don't want to use a stop. So then you have to be really careful about this part of the equation, which is confirming the risk at your loss point. So what that means is when you finally figure out where you're wrong, you have to make sure that the amount of money that you were prospectively lose at that spot is satisfactory, which we'll go through an example in a minute. Let's talk about some best practices. And then I'm going to walk you through literally the step-by-step process to build your own. So the first thing is we have to deemphasize individual trades. What this means is when we're deciding where we pick stops, we have to think of the stops in the context of a system of trades that's going to be ran over time. We're not so worried about individual positions. This is really, really important because if you overemphasize individual trades, you tend to break rules and you tend",
    "metadata": {
      "video_id": "6lIx0wSsN7Y",
      "title": "The Ultimate Guide for Using Stops in Options Trading",
      "url": "https://www.youtube.com/watch?v=6lIx0wSsN7Y",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6lIx0wSsN7Y&t=0"
    }
  },
  {
    "text": "pick stops, we have to think of the stops in the context of a system of trades that's going to be ran over time. We're not so worried about individual positions. This is really, really important because if you overemphasize individual trades, you tend to break rules and you tend to build something that might not be scalable over duration. We have to be thoughtful about that. The next thing is we're worried about the long run performance, right? So we're not worried about the performance today tomorrow, but we're literally worried about the performance over years. And again, I already talked to you about this. You can go broke taking profits. This is bad advice. It's meant in good faith, but it doesn't make sense. All right, let's go through this step-by-step process. And then I want to walk you through the example. So at the strategy level, how do we define what stop makes sense? Well, we're going to start by building a profit mechanism. This is based on my outlier strategy process, outlier trade process. I'll throw links to both of those in the notes below for you. But that's the first step. The reason why this is the first step is because we have to understand the way of the strategy that we're trying to trade performs. Again, this is where we have to be specific. So we're going to identify the profit mechanism. So for example, the way that I'm going to set stops on",
    "metadata": {
      "video_id": "6lIx0wSsN7Y",
      "title": "The Ultimate Guide for Using Stops in Options Trading",
      "url": "https://www.youtube.com/watch?v=6lIx0wSsN7Y",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6lIx0wSsN7Y&t=0"
    }
  },
  {
    "text": "is the first step is because we have to understand the way of the strategy that we're trying to trade performs. Again, this is where we have to be specific. So we're going to identify the profit mechanism. So for example, the way that I'm going to set stops on something that's based on a breakout style approach is different than the way I'm going to set stops based on a variance-risk premium trading approach, which is exactly why we have to structure this. Now, the signals, they just help us to identify this where we are wrong. So again, for a breakout style approach, maybe we use standard technical analysis and based on our technical analysis, we'd be able to pinpoint a spot where we are wrong. Yeah, we got to define that. Quantify exactly where we're wrong. And then we set where we think we're going to manage both profit and lost targets. Stopps can be used both to manage risk, but then also to secure profits once we're in profit. We have to track our win rate and loss rate. The reason why these matter is because we have to make sure that the stops that we're using guarantee positive long term expected return, which again, the example will go through all of this. Now at the individual trade level, once we have this built for the strategy at the trade level, we're going to find an opportunity based on our scanning, based on portfolio needs, all",
    "metadata": {
      "video_id": "6lIx0wSsN7Y",
      "title": "The Ultimate Guide for Using Stops in Options Trading",
      "url": "https://www.youtube.com/watch?v=6lIx0wSsN7Y",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6lIx0wSsN7Y&t=0"
    }
  },
  {
    "text": "using guarantee positive long term expected return, which again, the example will go through all of this. Now at the individual trade level, once we have this built for the strategy at the trade level, we're going to find an opportunity based on our scanning, based on portfolio needs, all that stuff. We're going to start structuring a trade. So we're going to lay out something that we think we like. We're going to look at where our profit and lost targets would be. Then we were going to take a look at the risk profile for this individual trade. We're going to then size it based on the risk profile balancing where we think we're going to take profit and losses. Stopps go in place. Now we leave the stops alone unless we're capturing profit in which case, I actually move the stops up all the time. So it helps me let a trade continue to work, but still manage the risk and still make sure that I'm maintaining positively expected return, which I'll explain in a second. So this is the process. Now let's take a look at an example. We're going to use price direction up for the profit mechanism for the subtype. We're going to look at breakouts. The reason why this is important is again, because depending on the strategy, it's going to inform what risk profile makes sense. Now the signals that we're going to use for this are technical analysis. I'm not going",
    "metadata": {
      "video_id": "6lIx0wSsN7Y",
      "title": "The Ultimate Guide for Using Stops in Options Trading",
      "url": "https://www.youtube.com/watch?v=6lIx0wSsN7Y",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6lIx0wSsN7Y&t=0"
    }
  },
  {
    "text": "the profit mechanism for the subtype. We're going to look at breakouts. The reason why this is important is again, because depending on the strategy, it's going to inform what risk profile makes sense. Now the signals that we're going to use for this are technical analysis. I'm not going to spend too much time on that. I just want to give you the strategy performance in the example. So we have a strategy where the average P and L portrayed is positive 2650. The average one size is 7850. The win rate is 60. The average losses 5,140. The loss rate is 40. The expected return for the strategy again is down here. It's the average P and L in this context. Wonderful. So now let's actually look at an example that we have. If we take a look at BILL and I'm trading a breakout strategy in it, I entered on this day. What I need to do is figure out where I'm wrong. In this trade, the where I'm wrong is super simple. It's below the consolidation period as it sits here. So pretty much below 8318, I am wrong. What strategy makes sense? In this case, it would be a ratio call diagonal with long options. I'm not going to go super far into detail why that you can check out my ratio call diagonal playlist for those details, but I just want to talk about the trade itself. So when I look at the trade,",
    "metadata": {
      "video_id": "6lIx0wSsN7Y",
      "title": "The Ultimate Guide for Using Stops in Options Trading",
      "url": "https://www.youtube.com/watch?v=6lIx0wSsN7Y",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6lIx0wSsN7Y&t=0"
    }
  },
  {
    "text": "it would be a ratio call diagonal with long options. I'm not going to go super far into detail why that you can check out my ratio call diagonal playlist for those details, but I just want to talk about the trade itself. So when I look at the trade, I'm going to eyeball what I think I want to get. And in this case, I have the 21 feb 85 calls. These are about two months out in time. So let's say that I get into these for 1150, maybe a little bit cheaper for the example. And I'm starting to eyeball 25 of them. Why 25? I'm just starting with something. It doesn't mean this necessarily. So I started by defining that my risk where I'm wrong is defined when the stock is below 8318. So I'm going to go in here. I'm going to see what is this worth when we're at 8318, which is down here. Well, the trade shows a 7500 loss. It's maybe a little bit less 7400 loss. So then given the average loss of this system being 5140, is that 7000 loss satisfactory. It could be, but I would prefer it to be closer to the average loss. So that means based on my eyeball size, it's too big. I have to take some of this trade down so that the size at 8318 reflects closer to my average losing trade, which is around 55 ish. So if we come down to",
    "metadata": {
      "video_id": "6lIx0wSsN7Y",
      "title": "The Ultimate Guide for Using Stops in Options Trading",
      "url": "https://www.youtube.com/watch?v=6lIx0wSsN7Y",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6lIx0wSsN7Y&t=0"
    }
  },
  {
    "text": "be closer to the average loss. So that means based on my eyeball size, it's too big. I have to take some of this trade down so that the size at 8318 reflects closer to my average losing trade, which is around 55 ish. So if we come down to 18 lots, that gives us a 5486 loss against the 5100. So maybe a little bit lower. 17, 17 lots at the defined risk point takes me to a 5181 loss. This fits perfectly. So how do I arrive at these metrics? This is by tracking the performance of the system. If you don't have these metrics yet, you should track. But if you're interested in figuring out what the required win rate for something is, you can take what the average loss is, divide that by the average win, plus the average loss. And this will give you the percentage. Let's use this example for that. If we pop back over to the platform and we say, okay, based on my technical analysis, I think the stock is going to go to 92. I'm just picking a number. And let's say that you make 4050, 4,050. We already know at our loss point at 51.81, or our loss point at 83.18, we lose 51.81. So if you take 51.81 as an absolute number, you don't have to include the negative, but 51.81. If you divide that by our 40.50, plus 51.81, that gives you 55.6. So that means you",
    "metadata": {
      "video_id": "6lIx0wSsN7Y",
      "title": "The Ultimate Guide for Using Stops in Options Trading",
      "url": "https://www.youtube.com/watch?v=6lIx0wSsN7Y",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6lIx0wSsN7Y&t=0"
    }
  },
  {
    "text": "at our loss point at 51.81, or our loss point at 83.18, we lose 51.81. So if you take 51.81 as an absolute number, you don't have to include the negative, but 51.81. If you divide that by our 40.50, plus 51.81, that gives you 55.6. So that means you need to return, you have to have wins that comprise 55 plus of your approach. Well, notice that our average win rate based on this approach is 60. So it makes sense. This is the way that you get very specific with this. It cannot be random. As always, if you have any questions, let me know. But there's one last thing I have to show you, the way we use to capture profits. And a good example for this is actually an APP. If we take a look down here, we can see that I actually got in here. And I've been trading this up along the way. I have another video that has talked about some of these stop points. But essentially what I'm doing is as I'm in profit, once I get to my initial profit target, I don't just take the trade down, I could scale out of some of it, which I often do. But then I just set stops below the new consolidation phases. And then as it breaks, it makes a new consolidation phase. I'll move the stop up. Now again, this cannot be random. This is specific to this specific strategy that",
    "metadata": {
      "video_id": "6lIx0wSsN7Y",
      "title": "The Ultimate Guide for Using Stops in Options Trading",
      "url": "https://www.youtube.com/watch?v=6lIx0wSsN7Y",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6lIx0wSsN7Y&t=0"
    }
  },
  {
    "text": "out of some of it, which I often do. But then I just set stops below the new consolidation phases. And then as it breaks, it makes a new consolidation phase. I'll move the stop up. Now again, this cannot be random. This is specific to this specific strategy that I have that I've built and created an approach around. You cannot just lift and shift this over because if you're trading something like this, for example, that is based on a large number of occurrences high turn. This is one way that will work. Another kind of approach that might be leveraged and you're really trying to hit a small number of trades, but be correct on a bunch of them. That means that your overall profile might look a little bit different. You have to build this specific to what you're doing. So let me know if you have any questions. As always, be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "6lIx0wSsN7Y",
      "title": "The Ultimate Guide for Using Stops in Options Trading",
      "url": "https://www.youtube.com/watch?v=6lIx0wSsN7Y",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6lIx0wSsN7Y&t=0"
    }
  }
]