[
  {
    "text": "Hey, what's up, outliers? A little bit of an unplanned stream. I was actually not going to stream today. There was a couple other things I was going to work on. And then I started getting some texts and then this hit on X. So I actually want to talk, I want to talk about this next stage of escalation. So this just came from Donald Trump, truth social. And this is saying we have completed our very successful attack on three nuclear sites and Iran, including Fordo, Nate, I don't know how to say that one. Natanz and Esh Fahan all planes outside the airspace, which is very standard fare before making a post like this. Congratulations to the American warriors, not another military in the world could have done this time for peace. Thank you for your attention of this matter. So we are off to the races. Now there is a lot to unpack here. And one of the things I want to everybody to pay attention to is the tradable side of this. That's the reality. There's a nasty part of this. And there's the part of conflict. That is a whole other bag. There is a series of things that literally are going to be profitable tomorrow based on this. And we have to see what the rest of it looks like. So first, let's take a look at where we sit in the broader conflict. And then what that likely means is to occur",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 39,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=0"
    }
  },
  {
    "text": "a series of things that literally are going to be profitable tomorrow based on this. And we have to see what the rest of it looks like. So first, let's take a look at where we sit in the broader conflict. And then what that likely means is to occur going forward. So we saw earlier, I think we can use this one. So we saw earlier where there is a couple of B2 bombers heading to Guam. For those that don't know, B2 bombers are some of the coolest fucking planes on Earth because they are, I mean, they're just an engineering feat. It's not quite the same as like a B1 Lancer, which those are also super cool. But B2s, they're stealth bombers. They essentially, they can operate in ways and minimize their detection significantly. They have a really expansive payload suite. So the fact that we knew that these were being moved is interesting. And it's because it starts with, well, this could just be prepositioning, moving things, display of power. That's a very common thing, especially when essentially, you're trying to drag people to the discussion table to make deals that they don't want to make. Now, we are in one of the weirdest times that I could think of right now with the, if there was no Ukraine, Russia happening right now, this would have a completely different tenor. But the fact that that's also going on right now, this, it puts this in a,",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 39,
      "start_timestamp": "00:01:39",
      "start_timestamp_seconds": 99.0153846153846,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=99"
    }
  },
  {
    "text": "Now, we are in one of the weirdest times that I could think of right now with the, if there was no Ukraine, Russia happening right now, this would have a completely different tenor. But the fact that that's also going on right now, this, it puts this in a, in a weird, in a weird light. So when we saw this happening, we didn't know whether or not this was going to be prepositioning forces, again, a display or actually to be used. And we still technically don't know if these were used, although it's a good guess, because we just know that it was bombers that hit three different sites and are now RTV returning to base. So a couple of things that have drawn my attention with this so far, when the conflict first started, the market sold off actually really hard. And I thought that was really strange, because in my initial view, I genuinely thought that the conflict would be pretty brief because for those that don't know, if you go back through the history of Iran and Israel, this thing has been going on for decades, a long time where there will be a escalation, then de-escalation escalated. It's just how it's been for a really long time. So the fact that this started to pop off and the market moved is heavy as it did was interesting to me. Now, like last time the market's closed, which is suboptimal, because the best time",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 39,
      "start_timestamp": "00:03:18",
      "start_timestamp_seconds": 198.0307692307692,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=198"
    }
  },
  {
    "text": "escalation, then de-escalation escalated. It's just how it's been for a really long time. So the fact that this started to pop off and the market moved is heavy as it did was interesting to me. Now, like last time the market's closed, which is suboptimal, because the best time to trade this would have been literally right now as the news came out, because right now there's actually not like information asymmetry, that's not true. But you stand a much better shot as a retail trader getting in on the early side now, because one of the things that we can be pretty confident what's going to happen tomorrow is the market's going to open lower. At 1,500 Pacific time futures are going to open and they're going to start dropping. Now, it's very difficult to trade that initial kind of move, and it's because it will be very gappy. As everybody's resting their orders, there's going to be a bunch of resting market orders literally to just play that initial surge that will lead to near-term covering that will recover price, and then it will get pushed down again. How far it goes really depends on the rest of the news that comes out over the next 24 hours effectively, little less. The news that we need to pay attention to, the first one, well, there's kind of like two big buckets, I guess I would assign here. There's escalation of which there's a lot of potential, and",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 39,
      "start_timestamp": "00:04:57",
      "start_timestamp_seconds": 297.04615384615386,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=297"
    }
  },
  {
    "text": "of the news that comes out over the next 24 hours effectively, little less. The news that we need to pay attention to, the first one, well, there's kind of like two big buckets, I guess I would assign here. There's escalation of which there's a lot of potential, and then there's D escalation. Now, based on Trump's truth, which is just don't like that is the name of like a post. Trump's post. You can see the part that he ended with was pretty clear. Now is the time for peace. So this to me still leads a little closer towards a display of power, and this is essentially saying, okay, you didn't want to capitulate and talk earlier, then now we will escalate the scenario. Now do you want to talk because we're not we're not playing games. This is always a strange and difficult path to peace in my opinion, but one of the important things for all of us that do this kind of thing where we're analyzing geopolitical events like this, we know such a small subset of what's actually going on. And I always remind myself of my own ignorance, and I pay closer to attention to this stuff than probably like the average person with my you know, involvement in the military. But there's definitely a strategy here in like comments like this is interesting to me because I understand the sentiment, but there actually is power in this. Now the way that",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 39,
      "start_timestamp": "00:06:36",
      "start_timestamp_seconds": 396.0615384615384,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=396"
    }
  },
  {
    "text": "to attention to this stuff than probably like the average person with my you know, involvement in the military. But there's definitely a strategy here in like comments like this is interesting to me because I understand the sentiment, but there actually is power in this. Now the way that this and this the reason why this is actually a really important line is it shows that Trump isn't necessarily looking to take this into a large scale conflict. And again, as a betting man, I still have to assume that we're not going to go into some sort of large scale direct boots on the ground conflict with Iran. I just don't see it as beneficial. Now the US does have the potential to do this kind of thing, which is we have power projection across the entire globe. And we can do something that's relatively low touch to us. Those pilots that drop those bombs, they've done that a million times with inert bombs. And they just go fly their plane in a circle at an altitude that they can't even really be seen. And they just cruise on with their day. So what I'm saying is even though the concept of bombing is kind of heavy, in terms of actual like implementation, it's not that heavy. It's actually kind of a light lift. Now there's the political side of it, which obviously is not as light of a lift. So this to me is still really, really,",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 39,
      "start_timestamp": "00:08:15",
      "start_timestamp_seconds": 495.07692307692304,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=495"
    }
  },
  {
    "text": "though the concept of bombing is kind of heavy, in terms of actual like implementation, it's not that heavy. It's actually kind of a light lift. Now there's the political side of it, which obviously is not as light of a lift. So this to me is still really, really, really early stages. And I think the main thing I'm waiting to see is, is there significant outcry from Iran allies? Because that's how this escalates massively. If there is some sort of huge escalation based on Iranian allies, then this whole, this is for peace. Now it's the time for peace. That goes right out the fucking window. That's gone. Now if Iran sees this and they say, okay, this not really what we expect it to happen, we don't feel like escalating this significantly. Let's see if we can talk about it. That sends this down a completely different path. And the impact on the market tomorrow will be completely different. There's a couple assets that you have to keep in the back of your mind. It's well few. The first grouping is all of the indices. You're going to see movement. The next is volatility. You're going to see movement. Next is crude oil. You're going to see movement. So all of these will move to some degree tomorrow. But again, depending on how this ends up flowing over the next few hours, that will less than 24 hours, then we'll have a better, a better sense.",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 39,
      "start_timestamp": "00:09:54",
      "start_timestamp_seconds": 594.0923076923077,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=594"
    }
  },
  {
    "text": "to see movement. Next is crude oil. You're going to see movement. So all of these will move to some degree tomorrow. But again, depending on how this ends up flowing over the next few hours, that will less than 24 hours, then we'll have a better, a better sense. So in this idea of de-escalation, this is the first seemingly strange, but this is the first component to it, saying now is the time for peace. Now if there is a actual movement towards de-escalation, then you'll see that via a response from Iran relatively soon. What's likely to happen is Iran will prefer to posture themselves via power. So the thing is compared to Israel, Iran can do that a little more successfully. I Iran really can't do that very well with the US. So they can't kind of do the old big dick to you in this context. Against Israel, it's kind of like siblings are fighting. This is a different scale now. So Iranian response at this point is what I am super, super, super interested in. Let's see if anything new has come out. I don't see anything yet. Sneheal says, can't we just stop fighting? I tell you what, the idea of not fighting is really idealistic, but honestly to me, it shows it's idealistic. I personally do not ever see a world where conflict is gone. And I call it the veneer of civilization. We as people, we as humans, we think that",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 39,
      "start_timestamp": "00:11:33",
      "start_timestamp_seconds": 693.1076923076923,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=693"
    }
  },
  {
    "text": "fighting? I tell you what, the idea of not fighting is really idealistic, but honestly to me, it shows it's idealistic. I personally do not ever see a world where conflict is gone. And I call it the veneer of civilization. We as people, we as humans, we think that we're so evolved and that word, you know, so thoughtful. Yet at the base of everything, we literally are animals. And if you look at the animal kingdom, there is no lack of conflict. Actually, it's even more intense than what we see. And humans, even though we like to eat with silverware, we still have those same tendencies. So any living being still, there's going to be conflict. It's never going to go away. Now, ideally, we wouldn't have to have wars, wars suck, wars suck. And there's very rarely a really, really, I mean, there's never really a great output. Even I was literally reading a really great book just about the, hold on a second. So this is so another truth says, Fordo is gone. Yeah. So I mean, that doesn't surprise me. So now it looks like Trump is going to address the nation at 10 p.m. Eastern. So I will be watching that like a hawk. We might stream that one too. We'll kind of see, we'll see how it goes. Let me get caught up with you guys. We'll stretch us this time to fill up and gas tank. That's actually a really important,",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 39,
      "start_timestamp": "00:13:12",
      "start_timestamp_seconds": 792.1230769230768,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=792"
    }
  },
  {
    "text": "p.m. Eastern. So I will be watching that like a hawk. We might stream that one too. We'll kind of see, we'll see how it goes. Let me get caught up with you guys. We'll stretch us this time to fill up and gas tank. That's actually a really important, that's actually a really important point because there's a couple things to keep in mind. Again, taking it back to markets. The first thing is we get zero oil for my ran. So it's not like any sort of big direct impact for my Iranian oil. However, there is a massive impact, potential, funny enough, that a lot of people are relatively unfamiliar. So the first thing we're watching for is, is there some sort of actual militaristic reaction from my ran? And I have to be honest, I would be shocked if there were. Because this is the inequity of the world where the US chose to strike. And if Iran chooses to strike something of the US is back, then that's when things go parabolic fast. The US does not respond well to that. And again, I say this as a military member and somebody that's in the US. So the point there is it's still not fair. The way that that flows is not fair, but it is what it is. It's the law of the jungle. So the reason why I'm saying that is because a lot of people will say like, oh, well, you know,",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 39,
      "start_timestamp": "00:14:51",
      "start_timestamp_seconds": 891.1384615384616,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=891"
    }
  },
  {
    "text": "US. So the point there is it's still not fair. The way that that flows is not fair, but it is what it is. It's the law of the jungle. So the reason why I'm saying that is because a lot of people will say like, oh, well, you know, if Iran strikes back, then the US should be ready to talk peace. And again, like that's nice in a idealistic sense. It doesn't reflect reality in the in the slightest. That's not how it would go. So I think Iran would be very hard pressed to directly strike any like any US assets. But let's see if anything. I ran needs to agree to end this conflict. Doesn't surprise me. So it still just looks like I haven't seen on a couple other computers. I'm watching different news sources to see any response for my ran. We just don't have that yet. Now going back though to markets and potential impact, there's an underlying thing again that a lot of people are unfamiliar with. And I'll show you on Google Maps. It's this bad Larry right here, the straight of Hormuz. You zoom out the straight of Hormuz. Who do you notice? He is right next to it. I ran. So one of the issues and one of the things I ran can do to turn up the heat more holistically, even though the US does not deal with Iranian oil directly, we do deal with Saudi oil, UAE",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 39,
      "start_timestamp": "00:16:30",
      "start_timestamp_seconds": 990.1538461538461,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=990"
    }
  },
  {
    "text": "do you notice? He is right next to it. I ran. So one of the issues and one of the things I ran can do to turn up the heat more holistically, even though the US does not deal with Iranian oil directly, we do deal with Saudi oil, UAE oil. We do deal with oil from like all of these places pretty heavily. And oil from a lot of these places goes through this straight right here, bordered by Iran. So the way that you would see some sort of escalation on the oil front will overwhelmingly likely come from any restriction here. And the other thing again is that if there is any sort of restriction there, the US is going to take that very seriously and you're going to see things scale very, very quickly. So the issue at Act Shot says Iran can blow up the global economy if it blocks the straight of Hormuz. This is dangerous move from the US bombing Iran. Yeah, that's exactly right. That's and that's exactly right. Now again, the reality of them actually being able to do that unlikely. And more importantly than that, it's an efficiency thing. Even if the straight of Hormuz becomes completely blocked, you can still ship oil. It just becomes more expensive to do so. So that's another really important thing to keep in the back of your mind. If the straight of Hormuz becomes super conflict bound, things aren't being able to move",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 39,
      "start_timestamp": "00:18:09",
      "start_timestamp_seconds": 1089.1692307692308,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=1089"
    }
  },
  {
    "text": "if the straight of Hormuz becomes completely blocked, you can still ship oil. It just becomes more expensive to do so. So that's another really important thing to keep in the back of your mind. If the straight of Hormuz becomes super conflict bound, things aren't being able to move through there freely. First, you'll start to see US military vessels show up there quick fast and in a hurry. That adds a completely different flavor to the things getting attacked. The thing next thing beyond that oil does not have to go through here. It's just more efficient to put it on tankers. But you can still airlift. You can still move it by rail. It's just way less efficient. Still move it by trucks. And then you can drop it in the ocean somewhere else. There's other accessible ports. The main thing to keep in mind is it's not like this is truly a single point of failure. It's just an efficient point of failure. So that part of side, if there this is the main thing I'm paying really close attention to is how Iran chooses to respond. And then if there's any dialogue around the straight of Hormuz because if there is without a doubt, there will be a pretty significant impact. So now talking a little bit more about the way that this is likely to impact market tomorrow. So when futures open, let me get caught up. Tommy says is the US net exporter.",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 39,
      "start_timestamp": "00:19:48",
      "start_timestamp_seconds": 1188.1846153846154,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=1188"
    }
  },
  {
    "text": "of Hormuz because if there is without a doubt, there will be a pretty significant impact. So now talking a little bit more about the way that this is likely to impact market tomorrow. So when futures open, let me get caught up. Tommy says is the US net exporter. They go back and forth. I don't know what they are right now today is the US currently a net exporter of oil. The US always has the potential. It's really just a cost thing. So I don't know if they are today. I'll tell you right now. But the US, it has the capacity it can choose to. It's just whether or not it wants to. So yeah, it's still it's still the same same. So no change. Net exporter. Oxshot says is this plan for the US to isolate China as China gets its oil from Iran and now other counter parties will be buying oil from the US. I don't I don't think so because I don't see a world yet where the US is inclined to get any sort of direct or indirect escalation with China. It just doesn't benefit anybody. Our two economies are so intertwined that there's a lot of positioning going on by China because they tend to think much longer term than the US does. I think at least and I don't think that this is attempting to diminish China's oil supply because you can also tell by the things that we're",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 39,
      "start_timestamp": "00:21:27",
      "start_timestamp_seconds": 1287.1999999999998,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=1287"
    }
  },
  {
    "text": "intertwined that there's a lot of positioning going on by China because they tend to think much longer term than the US does. I think at least and I don't think that this is attempting to diminish China's oil supply because you can also tell by the things that we're choosing to attack right. We're not attacking oil production or just base infrastructure. The things that are being attacked are so far reported as things that aid in the proliferation of nuclear weapons which the US again not saying it's fair. But the US and other key countries have decided that we get to have the toy but nobody else. So you don't get to have it which is yeah, it kind of sucks but again it is what it is. So what that means in this context is I haven't seen anything in the strikes yet that lead me to believe that that's the way they're trying to play it. I do think that they're trying to get a resolution to what you see with Iran in Israel. That's so cool. I don't care about this. I don't care about this. I don't see any new. I don't see any new info. So we'll see more a little bit later. The biggest thing is if there is some sort of retaliation but this is the main near term effect is how does this be impacted? Now the impact here is why you're going to see overwhelmingly likely oil is",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 39,
      "start_timestamp": "00:23:06",
      "start_timestamp_seconds": 1386.2153846153847,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=1386"
    }
  },
  {
    "text": "any new info. So we'll see more a little bit later. The biggest thing is if there is some sort of retaliation but this is the main near term effect is how does this be impacted? Now the impact here is why you're going to see overwhelmingly likely oil is going to absolutely skyrocket. And there's a couple ways that you can check this even when the market is closed. So let's take a look. One of the things you can use is any sort of backing. So backing of positions changes super quickly. And it's because that's not tied to the market being open right now. So let's take a look at crude oil futures. Margin requirement. So it. Oh, that's funny. Elizabeth. Elizabeth says Shrey made note that ice increased margin requirements on oil futures by 24. There we go. Yeah. So you can you can find small artifacts stuff like that through here. So the reason why you'll see oil likely trade higher tomorrow. It doesn't come from the direct impact. It comes from the uncertainty around this because again, remember what oil futures are. It guarantees a transaction price. It's used to hedge. So in this kind of context, if you don't know, if there can if there might be some sort of massive large scale escalation of this conflict, if you don't know that, you can literally purchase oil futures to lock in the price of your oil for whatever the defined period is, so",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 39,
      "start_timestamp": "00:24:45",
      "start_timestamp_seconds": 1485.2307692307693,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=1485"
    }
  },
  {
    "text": "kind of context, if you don't know, if there can if there might be some sort of massive large scale escalation of this conflict, if you don't know that, you can literally purchase oil futures to lock in the price of your oil for whatever the defined period is, so that this way you remove that price sensitivity. Now there will be absolutely no shortage. Of people like me that on futures open tomorrow, I will be speculating for sure. Without a doubt. And it's because there's going to be movement. The only way that we don't see movement is if there's essentially a piece deal struck very quickly, which I still just don't see that. I don't see that in the cards right now. Let's see if anything else popped up from here. No. No. So this says American B2 bombers using the weekend operation. I don't know if this is I still don't know if this is accurate. If it was actually B2s, I mean, it's a fair assumption. I don't think there's anything wrong with taking that as the assumption. I just don't see anything that actually confirms that yet. And so this is 45 minutes ago. It says prefers diplomatic option towards Iran, but only if Iran makes significant concessions, which I think we know that they're not inclined to do. 90 minutes ago, US citizens evacuated from Israel on flights to Greece. Yeah. So I mean, this is. This is one of those things where",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 39,
      "start_timestamp": "00:26:24",
      "start_timestamp_seconds": 1584.2461538461537,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=1584"
    }
  },
  {
    "text": "It says prefers diplomatic option towards Iran, but only if Iran makes significant concessions, which I think we know that they're not inclined to do. 90 minutes ago, US citizens evacuated from Israel on flights to Greece. Yeah. So I mean, this is. This is one of those things where there is a really, really solid chance that it's like the way to think about the outcome of this thing is pretty high severity, but in very different directions. So if I were to think of like a plot and this is, I guess we'll just do a plot like this. And this is just a scale of severity. And then we have a decision point here on the different directions that this can go. If we end up deescalating, then that has a severe impact, but in a completely different direction. And if this starts to escalate, that has a slightly higher severity, still pretty damn severe compared to the other, but in a slightly different direction. So if there's deescalation, that leads to volatility contracting massively tomorrow, you'll see equities probably rise, oil will come down. Gold probably will come down as well as capital will flow into risk assets tomorrow. If that doesn't happen more likely than not, as I've already said, you'll probably see indices go down, you'll see things like gold probably go up, crude up, vix up, the dollar, I mean, the dollar would be a little bit decoupled from this bonds will go",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 39,
      "start_timestamp": "00:28:03",
      "start_timestamp_seconds": 1683.2615384615385,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=1683"
    }
  },
  {
    "text": "risk assets tomorrow. If that doesn't happen more likely than not, as I've already said, you'll probably see indices go down, you'll see things like gold probably go up, crude up, vix up, the dollar, I mean, the dollar would be a little bit decoupled from this bonds will go up. So you'll see a pretty profound impact across the entire market, I think. Sneheal says, I don't believe a piece deal, I don't believe a piece deal, despite from saying it's time for peace. I mean, I think I do think that's what he would want, but the thing is, he obviously would want it on his terms. So the way to think about peace in this context is it's kind of like Spanish for submission, which makes it a different thing if you actually can, for the people I can read in between the lines and see what this actually is. When you see peace in this context, it doesn't mean peace, it means submission. We want you to do what we want. And you either do what we want or we will bomb you. Again, one of the big differences is the way that the US is very, very fortunate in the way that we are geographically located is that Iran is surrounded by things we have easy access to from a US military perspective. We have bases literally all through, literally all through the entire continent. We have Navy and we have all sorts of water-based",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 39,
      "start_timestamp": "00:29:42",
      "start_timestamp_seconds": 1782.2769230769231,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=1782"
    }
  },
  {
    "text": "very, very fortunate in the way that we are geographically located is that Iran is surrounded by things we have easy access to from a US military perspective. We have bases literally all through, literally all through the entire continent. We have Navy and we have all sorts of water-based access through the Arabian Sea. So we have essentially unfettered access to Iran. It's a littoral state. If they're lamblocked, that's a different story because it makes accessing for like a large-scale military invasion if that were to occur, which again, I really don't think that is on the table right now, at least. But it makes a complete difference if you can access through lands and sea or has to be via just land because then you have to come up with deals with all the countries you're going to have to drive all your shit through. And a lot of places don't like that, rightfully so because you kind of indirectly get dragged into shit. So Iran is highly accessible. The US is really not that accessible to Iran. That doesn't mean inaccessible, just a completely different kind of accessibility. And like through some sort of large-scale escalation, again, it wouldn't be pretty. It's not what we would want, but Iran doesn't stand a great chance there. So they're not in an awesome position, unfortunately, which I say unfortunate because people when their backs are against the wall, it's always a more, it becomes more vicious. Oxhot says",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 39,
      "start_timestamp": "00:31:21",
      "start_timestamp_seconds": 1881.2923076923075,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=1881"
    }
  },
  {
    "text": "again, it wouldn't be pretty. It's not what we would want, but Iran doesn't stand a great chance there. So they're not in an awesome position, unfortunately, which I say unfortunate because people when their backs are against the wall, it's always a more, it becomes more vicious. Oxhot says Iran can attack US bases in the region. They don't need to bomb the US, definitely. Yeah, yeah. And they can, they will absolutely. If they choose to escalate, they'll do their best. The point that I'm making is that that's a completely different context in a completely different scale in terms of total access. It's just not equitable, right? That's my broader point. To your point, which I agree with, Iran absolutely is within reach of things that we would not want struck. Absolutely. The US has unfettered access to the entire continent and specifically the entire country of Iran. So it's one of those things where things escalate enough than that matters. That data point matters a lot. But yeah, bombing of military bases nearby, that's why they're there. Most of them, well, and that's part of the way that the US operates, right, with just total power projection and the ability to essentially touch a lot of things essentially across the entire globe. Uh, Sneel says if they retaliate, it's not going to be good despite that being the most realistic outcome from an emotion standpoint. Yeah, that's exactly correct. And I think they know that I",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 39,
      "start_timestamp": "00:33:00",
      "start_timestamp_seconds": 1980.3076923076922,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=1980"
    }
  },
  {
    "text": "projection and the ability to essentially touch a lot of things essentially across the entire globe. Uh, Sneel says if they retaliate, it's not going to be good despite that being the most realistic outcome from an emotion standpoint. Yeah, that's exactly correct. And I think they know that I don't think that like there might be some sort of pride-based retaliation of some sort. Because again, we have to remember in this context, it's the idea of like peace equals submission. And Iran is a proud country, just like most countries are. They don't want to submit to another entity. Nobody does. But that's the unfortunate point of conflict is that it escalates to a point where then submission happens. You have no choice. So it really just depends on how far along that continuum we go. And the range we go on that continuum just negatively impacts literally everything. But it's like the same thing in martial arts. If you're, if you have two guys who are really confident, really strong, and they both are supremely like decided that they are going to win, they will both go into the fight with full force under the context that they're going to win. But by, you know, third, fourth rounds, you'll start to notice that one of them might start very clearly pulling ahead if they have better cardio or something like that. It's kind of like the equivalent. And then this conflict, that looked really equitable at the",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 39,
      "start_timestamp": "00:34:39",
      "start_timestamp_seconds": 2079.3230769230768,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=2079"
    }
  },
  {
    "text": "they're going to win. But by, you know, third, fourth rounds, you'll start to notice that one of them might start very clearly pulling ahead if they have better cardio or something like that. It's kind of like the equivalent. And then this conflict, that looked really equitable at the beginning, all of a sudden does not look equitable. There's, uh, near says you don't think the conflict ends this week. Probably market seems to think it's done before next weekend. I think it could be. Yeah, I definitely think it could be. I think what this just did is add to the severity. I'm not so sure about the timeline because I ran will likely like right now they're in the process of making some really, really big decisions. But let's take a look at, uh, polymarket. And 4-0 nuclear facility destroyed before July. Oh, damn. A bunch of people just got paid. Will I ran close the straight of Hormuz before July so we can see that is no. I wonder. And this is, there's still pricing this at 40, 48 chance. The thing to remember is like this is you can't really use this too well because it's such a small amount of money that it there's just not much in here. And I wonder what close means. All sorts of severely restricts. International maritime traffic through the straight of Hormuz. Oh, man, that's tricky. The primary resolution source for this market will be official government information.",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 39,
      "start_timestamp": "00:36:18",
      "start_timestamp_seconds": 2178.3384615384616,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=2178"
    }
  },
  {
    "text": "it's such a small amount of money that it there's just not much in here. And I wonder what close means. All sorts of severely restricts. International maritime traffic through the straight of Hormuz. Oh, man, that's tricky. The primary resolution source for this market will be official government information. However, consensus of regrettable reporting will also be used. I am so curious. I am so curious. That's, I'm thinking of it just from a execution standpoint. Like this is still to esoteric to me. I wouldn't like that bet. Steele says this is also just degenerate gambling. So very opinion-based. I wouldn't, I wouldn't actually chalk it up to that because I've worked with a couple of friends that are actually working on cross exchange arbitrage in these kinds of things. And there's also absolutely a use case to this in terms of even a sophisticated portfolio that might use this to reduce some short-term risk. You can do that in a few different ways with something like this. So yeah, I agree with you that probably a lot of it is people just kind of guessing shit, which I do agree with. But you will have some level of informed participants here. It's just not enough. That's the problem. It's just not enough. You need more. Let's see. See, this is interesting. This says, US, I read nuclear deal in 25, 41 chance. So the issue with that is, I don't see another stop to the conflict here.",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 39,
      "start_timestamp": "00:37:57",
      "start_timestamp_seconds": 2277.353846153846,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=2277"
    }
  },
  {
    "text": "of informed participants here. It's just not enough. That's the problem. It's just not enough. You need more. Let's see. See, this is interesting. This says, US, I read nuclear deal in 25, 41 chance. So the issue with that is, I don't see another stop to the conflict here. Maybe they're thinking like just to cease fire. But I think sans the nuclear deal, like that's the main thing that Trump is after. So sans that deal, I don't see this slowing down. Nothing here. Let's see if anything news come out. All right. So now we're getting some stuff from the Iranian state media. Let's see if we can pick anything up from there. I'm going, I'm trying to see if I can get to the actual webpage. I don't see anything on their x-page. I don't see anything on i24. Yeah, I'm not seeing anything directly from them yet. Um, Arjun says seems like it might have been ground attack, not really air attack at all. I highly doubt that. I highly doubt that. It could have been, but if the US is involved, I would feel very confident, saying with near certainty. That it would have been by air. Yeah, I just don't see. I don't see it being orchestrated via land personally. The logistics of it would be very difficult, I think, to like palette. I just don't think it would make a lot of sense. And again, especially like we were talking about in",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 39,
      "start_timestamp": "00:39:36",
      "start_timestamp_seconds": 2376.369230769231,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=2376"
    }
  },
  {
    "text": "been by air. Yeah, I just don't see. I don't see it being orchestrated via land personally. The logistics of it would be very difficult, I think, to like palette. I just don't think it would make a lot of sense. And again, especially like we were talking about in the beginning, in terms of ease of being able to contact and like touch things, that like that's one of the things that the US continues to have in its pocket is just overall air superiority. And it's very likely that they will continue using that, especially in a, especially in a conflict like this. I don't see any. I don't see any like other big news on this yet. I'm surprised that we haven't heard anything from them yet. I thought by about now, we would come across something, but apparently not yet. So, a snail says, Trump said they dropped a payload of bombs. And to me, that seems like the most probable. Yeah. Most dobs says they're awfully quiet for getting hit by three bombs. It was probably more than three. It's just three locations, but yeah, I'm just surprised that there's like, it's just nothing yet, which is interesting. Yeah. That part is strange to me. Nears says regarding the polymarket, you can determine based on Israel attack on Iran, and then you can see other percentages dropped by the dates. Oh, yeah. I think now with the US involvement, that's a completely different scale now.",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 39,
      "start_timestamp": "00:41:15",
      "start_timestamp_seconds": 2475.3846153846157,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=2475"
    }
  },
  {
    "text": "which is interesting. Yeah. That part is strange to me. Nears says regarding the polymarket, you can determine based on Israel attack on Iran, and then you can see other percentages dropped by the dates. Oh, yeah. I think now with the US involvement, that's a completely different scale now. Because in terms of like the conflict ending by the end of the week, I think now with the US involved, you essentially need to have some sort of defined deal. And the main thing that the US is looking for, like we were talking about before, is an explicit deal about nuclear weapons, which Iran is going to be highly, highly, highly resistant to capitulating to. Because for them, that's actually kind of a big deal to be able to be able to proliferate, because then it puts them in a completely different context, right? Because like this shit couldn't happen. If they had nuclear weapons, this strike doesn't happen. And it's because you risk a potential of nuke getting launched, and that's what scales everything so differently. Yeah. Has there been any evacuation orders for military bases in the middle of Middle East? No, I don't. You're not going to see evacuation orders come out from a military base. One, it's because it gives you way too much strategic information. That doesn't mean that they might not be repositioning people, but you probably wouldn't know about it until a little bit like a pretty significant lag. Yeah. US",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 39,
      "start_timestamp": "00:42:54",
      "start_timestamp_seconds": 2574.3999999999996,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=2574"
    }
  },
  {
    "text": "going to see evacuation orders come out from a military base. One, it's because it gives you way too much strategic information. That doesn't mean that they might not be repositioning people, but you probably wouldn't know about it until a little bit like a pretty significant lag. Yeah. US government knows Iran has no nuke. They will say they will say they don't have them anymore. Well, we don't, yeah, we don't think they have nuke. That's the whole point of this entire thing is that we don't want them to get them. So that's part of like the broader US angle on the quote unquote deal is they want Iran essentially to stop attempting to proliferate. So, Sneo says time in Iran is 4 AM really thought we'd see some update at least from their site. Yeah, I definitely think so. Like I felt the same like anything, anything coming from them. Yeah, I'm surprised that it's followed so far by absolutely nothing. This is all the same shit. I are in a no official source inside Iran is yet confirmed or denied the attacks on the 4.0 facility. Yeah, so where is that? F-O-R-D-O-W. Let's see. Let's see if we can check this out. That's awesome. The fact that it is literally on Google, this is hilarious. Oxhot says 4.0 is under the mountains. Yeah, well, it's like anything, right? You still need access, which it looks like this might be part of the access, like you",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 39,
      "start_timestamp": "00:44:33",
      "start_timestamp_seconds": 2673.4153846153845,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=2673"
    }
  },
  {
    "text": "see if we can check this out. That's awesome. The fact that it is literally on Google, this is hilarious. Oxhot says 4.0 is under the mountains. Yeah, well, it's like anything, right? You still need access, which it looks like this might be part of the access, like you can see these tunnels. These are literally tunnels. Another series of tunnels. And then what is this thing? I don't know what that is. It looks like just some sort of building. I wonder what kind of bomb they used. Man, they were flying through there for a while. Joe says, Trump called them nuclear sites. Yeah, it's nuclear. It's enrichment. So when they say nuclear sites, he's just talking about locations that are specifically used to try to develop nuclear weapons. In case you guys are wondering what that red light is, I have a little massage gun going because your boys' legs are trash right now. So yeah, he'll, that's why you hear him referring to them is that. Because that's the more difficult part of this process for them is finding a way. What's the curious? Yeah, okay. It's about what you would expect. Looks like, oh, this looks pretty close. Let's see if we can go to this one. Yeah, so just straight mountains. So you're going to have fucking the Google car driving right up, right up to this. Being says without being insensitive, how does this affect markets specifically tech stocks? We talked about",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 39,
      "start_timestamp": "00:46:12",
      "start_timestamp_seconds": 2772.4307692307693,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=2772"
    }
  },
  {
    "text": "this looks pretty close. Let's see if we can go to this one. Yeah, so just straight mountains. So you're going to have fucking the Google car driving right up, right up to this. Being says without being insensitive, how does this affect markets specifically tech stocks? We talked about that a little bit earlier. Tech stocks is interesting because I think still across the board tech is seen as more or less like big tech scene is more like the safe haven. So I don't think that you'll see some sort of massive impact yet on tech stocks. You'll probably see some level of inflows out of more speculative names. But yeah, I don't think you'll see like a like a huge change in tech yet. Most of the move that I think we're going to see tomorrow is based on initial prep like positioning and people reacting to what might happen. That's why the next stage, that's why the next stage of the conflict is really, really important in terms of does this escalate or does it stall because that will have an impact on the initial reaction of the volatility. That's why like tomorrow I'll pay attention to what's going on the rest of the day. And then tomorrow I'll like log on probably 90 minutes earlier. So get caught up on everything to have a pretty good idea. A good way to trade tomorrow is actually using like different kinds of pairs. That's probably what I'll",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 39,
      "start_timestamp": "00:47:51",
      "start_timestamp_seconds": 2871.4461538461537,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=2871"
    }
  },
  {
    "text": "to what's going on the rest of the day. And then tomorrow I'll like log on probably 90 minutes earlier. So get caught up on everything to have a pretty good idea. A good way to trade tomorrow is actually using like different kinds of pairs. That's probably what I'll do. But I'll have to wait and see. Too early to know. Sneheals says Iranian official fuel ships will not pass to Europe through the straight of Hormuz. Yeah, we'll see like if if if that's the case, if that came out, then I'm trying to see where that came from. Let's go through. What's this one? No. I'm trying to see Sneheal where you saw that. Because if if that's the first thing they said, that would be wild. So I see these. So I see old news about them threatening to close. I see a post from somebody that I don't notice saying Iran will attempt to close the straight of Hormuz, but like that stuff, like none of that's Iran saying what they're doing. It's again, like if Iran does it. But Joe says according to Bloomberg, tweet, citing Iran, the three sites had been evacuated. Yeah, that's I think that's smart. The US probably would have preempted it a little bit to them. It wouldn't surprise me. So here it says Iran warned that it could shut off the straight of Hormuz, one of the world's most critical oil choke points in retaliation for US involvement",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 39,
      "start_timestamp": "00:49:30",
      "start_timestamp_seconds": 2970.4615384615386,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=2970"
    }
  },
  {
    "text": "that's I think that's smart. The US probably would have preempted it a little bit to them. It wouldn't surprise me. So here it says Iran warned that it could shut off the straight of Hormuz, one of the world's most critical oil choke points in retaliation for US involvement in its conflict with Israel, which we're just talking about. That's the thing if again, like if that happens, then this thing escalates like massively. There's no doubt. And then it looks like a senior Iranian lawmaker, if the US officially and operationally enters the war in support of the Zionists, the legitimate right of Iran in view of pressuring the US and Western countries to disrupt their oil trades, ease of transit. Yeah. We will see. Oxhot says I doubt there is enough thought given to the repercussions of today's action. The government is all one man show and that one man is just delusional. I mean, I just wholeheartedly disagree with you. It's not even like about Trump or another entity. It's like you can take Trump out of the decision seat. The US, like any president, regardless of who they are, has a series of advisors, a lot of them. And it's not like any president. Again, just remove Trump from the comments. Any president isn't just sitting there by themselves seeing what they can learn about what's going on on X and then making a decision to bomb another country. Like, that's not how it goes.",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 39,
      "start_timestamp": "00:51:09",
      "start_timestamp_seconds": 3069.476923076923,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=3069"
    }
  },
  {
    "text": "lot of them. And it's not like any president. Again, just remove Trump from the comments. Any president isn't just sitting there by themselves seeing what they can learn about what's going on on X and then making a decision to bomb another country. Like, that's not how it goes. So yeah, I mean, everybody can have their opinion about like the different actors totally get that. But I think all of these things, regardless of who is in power, it's probably very well thought out. I don't think it's like this half-hearted thing that they just decided to do today. It's the same thing with most of the decision cycles. There's a lot of people involved. A lot of information is provided. So I think it's okay to not agree with it. I have an opinion on it. Like all that stuff's important. But yeah, I just, I wouldn't chalk it up to that. I think it's a common mistake people make when they're analyzing things in general, even in trading. Somebody will just assume that like the other side of the trade is dumb. And it's like, that's not so much the case, man. It's like, you don't really know what the other side of the trade is doing or why. So I think it's just, it's a mistake to underestimate like the thought process of other entities. I would say at least. Being says, I ran retaliation would be on trade routes. Yeah, primarily. Like if they",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 39,
      "start_timestamp": "00:52:48",
      "start_timestamp_seconds": 3168.4923076923073,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=3168"
    }
  },
  {
    "text": "really know what the other side of the trade is doing or why. So I think it's just, it's a mistake to underestimate like the thought process of other entities. I would say at least. Being says, I ran retaliation would be on trade routes. Yeah, primarily. Like if they wanted to escalate this, they would go after the straight-ahormous. That's kind of like the main, that's really the main thing they have access to. Beyond that again, like they could try some limited strikes on US bases. They could try to intensify with Israel. But I mean, neither one of those would really deter the US in a significant way. So the big thing, and again, notice how they phrase it here, disrupt their oil trades ease of transit, right? It's not like fully disrupt the oil trade. It doesn't stop the oil trade. It just, it does just make it more annoying to move it. Ambience says, would it be bad for a trader? Oh, I missed it. Steele says, wow, I just seen Twitter people notice the beetos take off 11 hours ago. Yeah, well, they watch them depart. That's one of the, one of the interesting things about media now is that they catch a lot of this stuff. The thing is, is they, you never really know what they're doing though. And that's kind of still part of the overall, the overall game. Okay, so it looks like a minute ago, it says, officially Iranian",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 39,
      "start_timestamp": "00:54:27",
      "start_timestamp_seconds": 3267.507692307692,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=3267"
    }
  },
  {
    "text": "things about media now is that they catch a lot of this stuff. The thing is, is they, you never really know what they're doing though. And that's kind of still part of the overall, the overall game. Okay, so it looks like a minute ago, it says, officially Iranian state media quoted the crisis management official in quam province. I ran saying the Fordo nuclear facility was bombed by the US. Okay, so it looks like they're starting to talk about it from Bloomberg. I see confirms that part of Fordo nuclear site was attacked by enemy air strikes. Yeah, got it. So this, yeah, this does seem at least like we're starting to hear from them. I'm curious what direction. I think everybody is. It's very curious what direction that Iran is going to try to take this. I still just do not see a world where this just turns into a negotiation without at least a follow on level of back and forth. I'm personally just curious like how involved the back and forth will be. Ambience, there would be a logical decision for a trader to trade based on this event, for example, buying all the futures on market oil, expected oil, skyrocket. Yeah, so we actually talked about that a few times during the stream so far. And I think you're looking at it the right way. There's a bunch of different ways to trade it. Now, as we were talking about a little bit",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 39,
      "start_timestamp": "00:56:06",
      "start_timestamp_seconds": 3366.523076923077,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=3366"
    }
  },
  {
    "text": "futures on market oil, expected oil, skyrocket. Yeah, so we actually talked about that a few times during the stream so far. And I think you're looking at it the right way. There's a bunch of different ways to trade it. Now, as we were talking about a little bit early though, you can't, you can't oversimplify it, right? Because there's going to be a lot of people looking to do the same thing. So what that means is on futures open, you're very likely to see a pretty dramatic response. But then you're also very likely to see a decent amount of overall whipsaw because there will be quite a few, quite a few people just trading that initial move itself. That's it. And when you trade like that initial move and then you're happy with it and then you want to get out, you're going to have a bit of a different bit of a different play in mind, which is going to have an impact on the price on the opening. So yeah, that's like a good job on you, Amiens, by like thinking about a catalyst and trying to turn it into a trade idea. It obviously doesn't mean that it's going to work. We have to, there's still a lot of time between today and tomorrow. And in terms of like when futures open, how this whole thing ends up actually going, like we still don't really know that. We just know the pieces of",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 39,
      "start_timestamp": "00:57:45",
      "start_timestamp_seconds": 3465.5384615384614,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=3465"
    }
  },
  {
    "text": "obviously doesn't mean that it's going to work. We have to, there's still a lot of time between today and tomorrow. And in terms of like when futures open, how this whole thing ends up actually going, like we still don't really know that. We just know the pieces of information we have thus far. So it's a little bit, a little bit early to tell. Slipy says thoughts on whether Russia or China would step in since their trade partners with Iran. I don't think so. I think China will likely condemn it as well as Russia. Russia is, Russia is not really in a position to step in, be honest. Russia is busy. So if Russia wanted to step in, it would be in a very limited way. Maybe sanctions or something like that, but that that whole thing's already going on. So yeah, I don't see Russia, like Russia has their plate pretty full. I don't see them doing the standard mistake of opening up conflict on too many fronts simultaneously. China, I still don't think is interested in a direct conflict in the US is equally disinterested. So they might support in directly, provide support to Iran, but I don't think much beyond that personally. Again, it's all, it's always subject to change, right? Like this stuff is literally happening right now. So it's super hard to tell. I ran an official cited by Fars news agency. I witnessed the tax near is Fahan in Nottens",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 39,
      "start_timestamp": "00:59:24",
      "start_timestamp_seconds": 3564.5538461538463,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=3564"
    }
  },
  {
    "text": "Iran, but I don't think much beyond that personally. Again, it's all, it's always subject to change, right? Like this stuff is literally happening right now. So it's super hard to tell. I ran an official cited by Fars news agency. I witnessed the tax near is Fahan in Nottens nuclear facilities. Okay. Another thing here, it says the US military is now briefing troops at the strike and Iran expected to trigger counter attacks on American bases, exactly as we talked about and facilities across the Middle East could also activate Iran backed in other foreign terrorist organization sells abroad, definitely. All right. US reached out to Iran diplomatically Saturday to say that the strikes are all the US plans and that the regime change efforts are not planned. So this is kind of a big, a couple big pieces of information. Let's see. Two massive bombs reportedly struck the entrances of the photo facility alone. Over 30 tons of explosives used in that strike. I wonder how they're confirming this. I definitely want to know this. We're used. We still don't know what kind of bombs they used either. We do know the US has like pretty specific munitions to be able to attack underground. We're reinforced places. So my assumption is that there would be some variant of that, like a bunker buster, but I don't know. I haven't seen anything. So it looks like Israel is going under quasi-martial law. House Intelligence Committee member says the",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 39,
      "start_timestamp": "01:01:03",
      "start_timestamp_seconds": 3663.5692307692307,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=3663"
    }
  },
  {
    "text": "munitions to be able to attack underground. We're reinforced places. So my assumption is that there would be some variant of that, like a bunker buster, but I don't know. I haven't seen anything. So it looks like Israel is going under quasi-martial law. House Intelligence Committee member says the decision to strike without approval is unconstitutional. So now there's also going to be the internal politics side of this. This is interesting. So I'm curious thoughts on how Iran will respond. I'm super curious. All right. I'm going to hop off for a bit. I'll probably jump back on a little bit later. We'll see how everything goes. Otherwise in the discord, I'll definitely keep my eye on and let you guys know if I see anything popping up. But I'm going to go chill, go for a walk. You guys need anything? Let me know. Be an outlier. See you guys later.",
    "metadata": {
      "video_id": "6UzoviSHtbk",
      "title": "US Strikes Iran - Stock Market Update | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6UzoviSHtbk",
      "upload_date": "",
      "duration": 3893.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 39,
      "start_timestamp": "01:02:42",
      "start_timestamp_seconds": 3762.584615384615,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6UzoviSHtbk&t=3762"
    }
  }
]