[
  {
    "text": "What's up everybody? Welcome back to the outlier podcast where we talk all things abnormal. I got you and Sinclair back again. We're actually just talking a little bit about the whole tactical ETF, which is ticker HTUS. And you are kind of running down some interesting stuff that I want to jump back into. But first I just want to welcome you back. Thanks for hanging out for a little bit. Yeah, thanks for inviting me. I don't know if I have anything you to say, but it's always nice to chat. I'm always able to find and actually I have an interesting at least for me, probably not for you, but the, you know, from a selfish perspective, I have a couple interesting things that I want to dive into you. So and it will be relatively new, I think at least for us. But I'll save that for a couple of minutes later. I do want to get back over to the ETF. So talk to me a little bit about HTUS, kind of, you know, what you guys are looking to do with it and how it's generally ran right now. Okay, so the HTUS is designed to be a replacement for a passive stock investment like, like SPY. It's based on the SP index. But as most of your listeners will know, there are certain things that help you outperform the stock market. And these things are not in any way secrets. There are papers",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 41,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=0"
    }
  },
  {
    "text": "designed to be a replacement for a passive stock investment like, like SPY. It's based on the SP index. But as most of your listeners will know, there are certain things that help you outperform the stock market. And these things are not in any way secrets. There are papers written on them. If you go and look up things like equity anomalies, you'll find all these things like the January effect, the end of the month effect, various seasonalities around elections, momentum, mean reversion, all of these things. They're all out there, but they're not as big as a lot of people would like them to be. You can't just trade one of these things. But if you find 20 of these things, you can put them all together using the best possible portfolio construction management techniques you can think of, then you can beat the spools. And that's what we're trying to do. We're trying to do essentially a portfolio of market timing strategies, which we're overlaying with a couple of volatility strategies as well. So it's meant to be literally a replacement for SPY. I don't own any SPY in my managed accounts. I do own HTUS because this is literally all the stuff that I used to do in SPY. So I designed the volatility bits of it. So given that this is literally the best that I could do for this kind of product, and we do it all systematically, could you do it yourself?",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 41,
      "start_timestamp": "00:00:59",
      "start_timestamp_seconds": 59.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=59"
    }
  },
  {
    "text": "because this is literally all the stuff that I used to do in SPY. So I designed the volatility bits of it. So given that this is literally the best that I could do for this kind of product, and we do it all systematically, could you do it yourself? Probably, but could you do it as well as us? Probably not. I'm going to say, and if you underperform us by 2, then you're back, you may as well just support the SPY. Can you talk a little bit more about the volatility inclusion and how you've added that into the ETF? And one quick ad been note for everybody, this isn't sponsored in any way. Like we were literally just talking about this. And I had a podcast yesterday with Michael Guyad, you're probably not familiar with them, but he runs a couple ETFs. And I'm always just interested in learning about them. I just want it to be clear for the listeners that it's not sponsored in any way. So anyways, can you talk a little bit about the volatility inclusion component, though, to the... Yeah, I like the way that light is coming over my shoulder. It sort of makes me look angelic. You do? Yeah. You won't mean that. I'm not sure I can do anything about it. I can't see where it's coming from. Anyway, let's, if it gets worse, we'll do so. It's going to only last for a few minutes. Anyway, so",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 41,
      "start_timestamp": "00:02:12",
      "start_timestamp_seconds": 132.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=132"
    }
  },
  {
    "text": "It sort of makes me look angelic. You do? Yeah. You won't mean that. I'm not sure I can do anything about it. I can't see where it's coming from. Anyway, let's, if it gets worse, we'll do so. It's going to only last for a few minutes. Anyway, so as you probably know, I've always been interested in sort of retail-ish trading. So I'm not coming up with things that are low touch, easier to use, that kind of thing. And an ETF, it kind of has to be like that as well. Like we do charge a management fee, but it's not a hedge fund-like management fee. So everything's got to be systematic and cheap to run. So the two things we've got in there right now is volatility, which we call volatility overlays. There's a risk reversal strategy that we use risk reversals to replace some of the dumpsters. And we've written a paper about that. You can find it on SSRM. Peer of... All the papers we've done, they're not white papers, they're peer-reviewed papers. So they all make sense. They've all been hacked to pieces by other finance professionals. And then we do short-dated volatility selling as well to collect the variance premium. That's an adjunct to the main thing. The main thing is this market timing model. The risk reversal replaces about 10 to 15 percent of that. And we put a very small short volatility allocation on top of that. But it's active.",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 41,
      "start_timestamp": "00:03:18",
      "start_timestamp_seconds": 198.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=198"
    }
  },
  {
    "text": "selling as well to collect the variance premium. That's an adjunct to the main thing. The main thing is this market timing model. The risk reversal replaces about 10 to 15 percent of that. And we put a very small short volatility allocation on top of that. But it's active. We're not just going to come and implynally do that all the time. We have rules. There are sometimes theoretically we could go long. We haven't yet, but it's possible. So that's what we're trying to do. Yeah, so given the constraints of the fund, this is literally what I would invest in as a long-term equity thing. I mean, it literally is. Like I don't like I say it. I don't own spy. I do own this. So... Yeah. And one of the things you mentioned when I first pulled this up on TD Ameritrade's website, I was looking at the dividend yield and it looked low. And you were explaining why that's the case. I think it's just kind of an important note when you look at this. Do you want to run through that again real quick? Yeah, I think this is one of the problems we've had is when you just look at YAHU finance or something, it shows you the price appreciation, not the total return. And last year was a weird year because there was a fund reorganization on the legal side and we changed management firms who were doing the admin for the",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 41,
      "start_timestamp": "00:04:32",
      "start_timestamp_seconds": 272.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=272"
    }
  },
  {
    "text": "had is when you just look at YAHU finance or something, it shows you the price appreciation, not the total return. And last year was a weird year because there was a fund reorganization on the legal side and we changed management firms who were doing the admin for the fund. So the dividend was paid out last year was very small. Most years our dividend is absolutely enormous because active funds, active ETFs have to pay out all of their short-term trading profits as a dividend. So if you just look at YAHU finance and overlay us with SPY, we're going to look like we massively underperform. But we've actually beaten SPY over the last year, one year, one year, two year and three year, both return and sharp. So it's going well. And like I said, I know that your listeners understand this stuff and I'm not saying you can't do it yourself. I hope given that I've taught people they can do it themselves. But I also think sometimes it's better to just say I know this works, I'll pay someone else one percent to do it. That's what I'm doing. I wouldn't run this myself in my own accounts. And how does it fare specifically like based on the SPY, but you guys have some volatility inclusion in it. So it obviously begs the question, how does it fare during market downturn? And how does that typically look? Obviously if you're up over the past, I",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 41,
      "start_timestamp": "00:05:49",
      "start_timestamp_seconds": 349.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=349"
    }
  },
  {
    "text": "my own accounts. And how does it fare specifically like based on the SPY, but you guys have some volatility inclusion in it. So it obviously begs the question, how does it fare during market downturn? And how does that typically look? Obviously if you're up over the past, I think you said three years that would include 2022 when we had that down year. But what about something like a 2020? How do you guys do? Honestly, I couldn't really give you any guarantees on that because we haven't had it. There are mean reversion elements in our model. So people often think risk reversal, right? Your short puts, that's going to be risky because if your short puts in the market goes to zero, you lose a lot of money. You know what? If your short stocks in the market goes to zero, you lose a lot of money too. And people don't seem to think being long stocks is crazy at all. So we're literally using that as a stock overlay, a replacement. And yeah, there's convexity, but we actually want that convexity because there's mean reversion in the models. So if the market goes down, we actually want generally, because all these things are correlated, generally we want to get longer. And being short, the risk reversal makes you longer. So I think, and we're also generally long vega because of the strikes we choose in the risk reversal. So I can make no guarantees on",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 41,
      "start_timestamp": "00:07:01",
      "start_timestamp_seconds": 421.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=421"
    }
  },
  {
    "text": "actually want generally, because all these things are correlated, generally we want to get longer. And being short, the risk reversal makes you longer. So I think, and we're also generally long vega because of the strikes we choose in the risk reversal. So I can make no guarantees on that, but I think we should be finding a crash. I wouldn't wouldn't be surprised if we outperformed the spiders. I don't think we're drastically underperform them. But like I said, you never know. And the thing about crashes, they're all different. You know, it's like everyone always plans for the last war, right? So it's very difficult to know how you'll perform in any completely singular event like that. And specifically for the short risk reversal is out of curiosity. When you guys are setting that up to be slightly long vega, why is that? Is that it because it fits better with the broader portfolio that way or is there another reason? It just happens if you look at the risk reversal in a portfolio sense, once you've combined it with all the other stuff we've got, that just gave us the best risk reward. If you go to the risk reversal paper, we did. There's some explanation about that, but that paper is only including the risk reversal with a passive allocation in the index. And we have an active allocation in the index. So it's a bit different. But typically, we have an unbalanced risk reversal",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 41,
      "start_timestamp": "00:08:01",
      "start_timestamp_seconds": 481.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=481"
    }
  },
  {
    "text": "to the risk reversal paper, we did. There's some explanation about that, but that paper is only including the risk reversal with a passive allocation in the index. And we have an active allocation in the index. So it's a bit different. But typically, we have an unbalanced risk reversal on. We'll be short like 15 delta puts and long like 25 delta calls. So this is the way it's the best for what we were trying to do. I see. That's a pre-print version of it. It was published in the Journal of Trading Strategies, Investment Strategies. I think. Yeah. I'll see you. And we did the typical thing where the famous person gets the first authorship even though, and I love the guy, I think he changed two words in the entire paper. Is that how it works? And then is that also how many stars do you get? How do we go about get more stars? That just down the bottom here somewhere, there's like going to be, it just links to a little mini bio for each of us. I see. He might be first, but you have more asterisks, which actually, I would take them more at. I think you're doing okay. But actually also means I'm the corresponding author, which means I have to answer any questions that come up. I bet you love that. Anyway, well, for anybody interested in checking this out, I'll throw a link to the notes in it below,",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 41,
      "start_timestamp": "00:09:20",
      "start_timestamp_seconds": 560.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=560"
    }
  },
  {
    "text": "more at. I think you're doing okay. But actually also means I'm the corresponding author, which means I have to answer any questions that come up. I bet you love that. Anyway, well, for anybody interested in checking this out, I'll throw a link to the notes in it below, which funny enough, I'm actually rereading. I'm sure you familiar with the book, Expected Returns, and it talks about the risk of reversal in there as well. So if you were to give like a cliff notes version of this study, what would that look like? Of this study? Of this one. A Delta Hedge risk reversal has significant alpha. So if you don't Delta Hedge it, you can replace a long stock position with a risk reversal and essentially get an extra boost from that premium. It's not the same as the variance premium. It's a skewness premium. And be careful, there's got nothing to do with the skew of the underlying. It's an implied skewness premium. So yeah, on its own, it has edge. And it has edge that nicely combines in a directional equity strategy. Yeah. I think one of the interesting parts specifically for the risk reversal, especially as you're outlining it is, it's kind of like an overlay to the rest of the portfolio. So when you guys are structuring the rest of the ETF, what's the long term roadmap for it? Is it to stay spy and that's what's built in and that's the",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 41,
      "start_timestamp": "00:10:48",
      "start_timestamp_seconds": 648.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=648"
    }
  },
  {
    "text": "reversal, especially as you're outlining it is, it's kind of like an overlay to the rest of the portfolio. So when you guys are structuring the rest of the ETF, what's the long term roadmap for it? Is it to stay spy and that's what's built in and that's the expectation going forward? One of the reasons why I ask is if you look at any sort of discretionary inclusions where if it had a higher tech concentration, obviously overfitting, but tech's been crushing it for a while. Is there anything like that? No, and we don't want to do that. We want to be very honest with people like this is what we do. If this fits in your portfolio, this is what you should use. Because style drift is a real problem. Like if the cues, right, let's say tech's not outperforming. Let's say eggs are outperforming. Well, you know, cocoa. And the cues are like the manager of that's like, oh man, we've got to get into eggs. And so suddenly here replaces all of the text stocks with wheat futures. You can't, as an investor, you can't plan that. Even if tech's underperforming, I want you to stick with it so that I can use that as a building block in my portfolio. And that was why I was annoyed with SVIX, the inverse VIX ETF, because they started hedging. And there's nothing wrong with hedging. In fact, I encourage people to hedge. They do it",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 41,
      "start_timestamp": "00:12:00",
      "start_timestamp_seconds": 720.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=720"
    }
  },
  {
    "text": "to stick with it so that I can use that as a building block in my portfolio. And that was why I was annoyed with SVIX, the inverse VIX ETF, because they started hedging. And there's nothing wrong with hedging. In fact, I encourage people to hedge. They do it properly. But I don't want them to do the hedging, because I want them to give me the cleanest product possible. I'll put it in my portfolio. And then I'll decide what I need to hedge. But basically giving me a hedge that I'm paying for that I might not need. Which is, and it's sort of a bit of a black boxy hedge. So I don't really know what's going on. I rather they just kept it clean, very simple. And I could either buy it or not up to me. That's actually another interesting question though, from a fund management perspective, why did they choose to do that? And to add on to that question and be an obnoxious question, that's too long. I'm also curious how different funds choose whether or not they're going to be a pure fund, like you're talking about, or more of an adaptive fund that then the investor may or may not know how this could look five years from now to integrated to their portfolio. But I've seen both versions of that. Yeah, I'm not really sure. I think a lot of people kind of do whatever they think sells. Okay.",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 41,
      "start_timestamp": "00:13:15",
      "start_timestamp_seconds": 795.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=795"
    }
  },
  {
    "text": "adaptive fund that then the investor may or may not know how this could look five years from now to integrated to their portfolio. But I've seen both versions of that. Yeah, I'm not really sure. I think a lot of people kind of do whatever they think sells. Okay. And to be honest, there are so many VIX ETFs and ETFs. I think isvix probably should have done this from the get go and differentiated themselves from other people. And then it makes sense. But I wouldn't have gone involved then. So it wouldn't make sense to me, but as a product, you want to be differentiated from other people. So I think it's just like anything else. If you're making shoes, you want to make the best shoes you can. But if that means they're exactly the same as Nike's, that's no good. Because then you've got to differentiate yourself as well. In terms of the active stuff, it's a bit of a trade off, isn't it? Because I would never say that what we're doing here is like a museum exhibit. Like if the world changes enough, I think we should change. Because if the world changes enough, no one's going to want to have any interest in this. But I think it should be a very slow process. If you're changing every six months, because the market's doing something that's people can't rely on you at that point, you're just not a trustworthy piece of a",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 41,
      "start_timestamp": "00:14:28",
      "start_timestamp_seconds": 868.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=868"
    }
  },
  {
    "text": "enough, no one's going to want to have any interest in this. But I think it should be a very slow process. If you're changing every six months, because the market's doing something that's people can't rely on you at that point, you're just not a trustworthy piece of a portfolio. I see. So when you guys look at the performance of the fund, it sounds like you're talking before about pursuing about a beta of one. Is there a world where that changes or is that the ultimate target that you guys are looking to run moving forward? We don't have a beta target, but we do, because we have a timing model. We've calibrated that to be on average a beta of one. But it could go lower, it could go higher depending on what the model is saying. Like we can be technically 50 short, 200 long. I mean, we never have been, but we're trying to make returns risk adjusted returns, rather than target the specific beta. I see. That makes total sense. Speaking of funds, I actually had a question I wanted to ask you not knowing that we were going to start like this anyways, but it ties in well, which is what are your thoughts on the rise of these different zero DTE funds? Like iSPI, QQQY. What do you think about them? Zero DTE is a tricky, right? Because there's a huge amount of age in them. There really is. For lots",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 41,
      "start_timestamp": "00:15:36",
      "start_timestamp_seconds": 936.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=936"
    }
  },
  {
    "text": "anyways, but it ties in well, which is what are your thoughts on the rise of these different zero DTE funds? Like iSPI, QQQY. What do you think about them? Zero DTE is a tricky, right? Because there's a huge amount of age in them. There really is. For lots of reasons, but that edges and volatility terms always with options that's volatility. But the costs are in dollars. So given how cheap zero DTE options are in dollar terms, those trading costs are really big relative to your age. So people think that the easiest things to trade, they're astonishingly hard to trade. And there are enough people who've made, I've made tons of money in the last six months. Blah blah blah. I'm sure. I'm sure you have. But really that's a matter of luck, right? If you bought calls, if you've done anything involving being long over the last six months, you would have made money. So that's not the zero DTE and your brilliance. That's the fact you were long deltas. So I'm a bit dubious that these funds can beat the transaction costs. Maybe they can, but that is a very difficult thing to do. We spend a lot of time working on transaction optimizations. A lot of funds, as you know, don't spend any time on it. And they'll just enter either during the closing auction or they'll just blast stuff every day at the same time. And I can't see that working long",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 41,
      "start_timestamp": "00:16:56",
      "start_timestamp_seconds": 1016.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=1016"
    }
  },
  {
    "text": "We spend a lot of time working on transaction optimizations. A lot of funds, as you know, don't spend any time on it. And they'll just enter either during the closing auction or they'll just blast stuff every day at the same time. And I can't see that working long term. And who is the customer base that's demanding? I want to pay someone to blast zero DTE, zero DTE, strangles for me. It just seems very odd. I mean, I wouldn't go near them at all, personally. It just seems crazy to me. Yeah, one of, I was doing a YouTube live session. One of the viewers is the one that introduced me to QQQ likes I stumbled across him yet. And we just did like a cursory review of the product itself. And funny enough, that's one of the very first things I noticed is that the transaction cost on it is pretty awful. And we don't even see the half of it, which I know it's in the process of as they're getting their, their fills and whatnot. And I believe the management fees are high as two for what they do. They're not great. And what I noticed more than that, especially specifically with something like QQQY, is it begs the question, will this outperform by and hold QQQ in any capacity over meaningful timeframes? And yeah, I do not want to speak ill of anyone else's fund. That's not why I'm here. It just strikes",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 41,
      "start_timestamp": "00:18:24",
      "start_timestamp_seconds": 1104.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=1104"
    }
  },
  {
    "text": "I noticed more than that, especially specifically with something like QQQY, is it begs the question, will this outperform by and hold QQQ in any capacity over meaningful timeframes? And yeah, I do not want to speak ill of anyone else's fund. That's not why I'm here. It just strikes me as something that zero DTE is a very fashionable. And once you've got a bunch of ETFs up, it isn't a huge hurdle to list another one. So in the same way that the CBOE will list a Vex on, I don't know, apples or whatever, at the drop of a hat, because they've done it before, I think a lot of ETF issuers say zero DTEs, man, that's crazy. Let's issue of make a ETF on zero DTEs. So I don't know, it just doesn't appeal to me, I guess it's the way I would say it. And the other thing I would be careful with is the way they obviously they're not doing anything illegal. But be careful because they'll say things like the fund has this percentage of income, whereas what that means is they're selling that percentage of option premium, which is not the same as income. It might be, but it's also might be a stonking huge loss. So just be careful, that's not a dividend to that paying. That's part of the risk in the trading strategy. Right. When you look at funds like this, one of the questions it rises to me,",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 41,
      "start_timestamp": "00:19:44",
      "start_timestamp_seconds": 1184.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=1184"
    }
  },
  {
    "text": "as income. It might be, but it's also might be a stonking huge loss. So just be careful, that's not a dividend to that paying. That's part of the risk in the trading strategy. Right. When you look at funds like this, one of the questions it rises to me, and I don't know what their AUM is, I don't think that they're very large. Okay, larger than I thought, but still not that big, there are three three hundred ten million for QQQY, and they were launched back in September 14th last year, looks like. So relatively new, this, yeah, September 13th. And I'm curious with funds like this, trading things like zero DTE, from a market structure perspective, I'm not going to go down the world of, you know, volmageddon and fun and all that. I'm not looking to do that, but I am curious with that kind of churn, what does that do to market structure when there are funds that have, you know, X hundreds of millions of dollars in our management that they're selling zero DTE options against to the open market, specifically to like the market makers and their perspective if they're the counter side of those trades. Well, it's probably not the market makers. Market makers will obviously be on the counter the opposite side of that trade, but that's because most of the retail flow, market makers do that because they're facilitating that particular trade, right? But most of the retail flows",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 41,
      "start_timestamp": "00:21:00",
      "start_timestamp_seconds": 1260.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=1260"
    }
  },
  {
    "text": "side of those trades. Well, it's probably not the market makers. Market makers will obviously be on the counter the opposite side of that trade, but that's because most of the retail flow, market makers do that because they're facilitating that particular trade, right? But most of the retail flows on the buying side, so market makers have plenty of opportunities to get short. So market makers love this stuff because it's their one opportunity to cover a big chunk. And also, if these guys are doing it the way I think they would, it's pretty easy for the market makers to tailor their responses around it because it's a timed thing if it is. So I don't know, the volmageddon thing, you got to remember with derivatives for every buyer there's a seller. So it's not just that there's a huge short interest. It's more who blinks first, the shorts or the logs, are the shorts, I mean, you got to remember, we know that shorts are DTEs, but what are they long behind it? You know, they might be long a ton of two month options, they might kill it in the crash, in which case they're not going to worry about the front bit of the curve at all. And the other great thing about zero DTEs is even if you lose money, they're gone that night. So they're actually from a risk management perspective, pretty easy to deal with. So they, I don't know, at a",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 41,
      "start_timestamp": "00:22:30",
      "start_timestamp_seconds": 1350.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=1350"
    }
  },
  {
    "text": "going to worry about the front bit of the curve at all. And the other great thing about zero DTEs is even if you lose money, they're gone that night. So they're actually from a risk management perspective, pretty easy to deal with. So they, I don't know, at a certain point, everything worries you, but they don't worry me necessarily more than a lot of other things. I mean, that zero DTE in the market, I wouldn't lose any sleep over that. What is just cool? Got to ask then, what's the thing that you would lose sleep over for a reference benchmark? I mean, the only thing that really, it would be really difficult to deal with is a flash crash. And that's because that is a feedback loop that happens very quickly for absolutely no reason. And there's this idea that market crashes come out of nowhere, but they usually don't. Market crashes usually come out after the market's gone up, but then it's stabilized and started to come off and then that drop accelerates. So it's very rare that a bubble immediately bursts and crashes all the way down. A flash crash could come out of nowhere, though, because it's literally driven by someone who's made a mistake. Like, I think the one, the original one was some firm in Kansas City had a fat finger or something, and all their program went wrong. The amount of lack of execution controls at some trading firms is",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 41,
      "start_timestamp": "00:23:37",
      "start_timestamp_seconds": 1417.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=1417"
    }
  },
  {
    "text": "nowhere, though, because it's literally driven by someone who's made a mistake. Like, I think the one, the original one was some firm in Kansas City had a fat finger or something, and all their program went wrong. The amount of lack of execution controls at some trading firms is a bit worrying. So yeah, that would be the thing that would make me most nervous, because things can go so wrong, so quickly you might not have a chance to adapt, which is one of the reasons people, people should be very careful about managing their risk on the basis of if that happens, I'll do this, because you might not have a chance, because it might all happen so quickly, or the market might just get locked up and you might not be able to trade, or maybe it's your brokerage firm that's having that disaster and no one can trade through that firm. So that's the sort of thing that would make me nervous. Got it. And for anybody wondering the flash crash that you're referencing, it's from 2010, and it was really, really interesting. What was it? It was like 36 minutes long. I don't remember all the details. I'll see if I can find a link to throw on the notes, but it is an interesting case study on something like that. I actually missed about half of it, because I went to the kitchen to make some coffee, and I was talking to someone",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 41,
      "start_timestamp": "00:24:54",
      "start_timestamp_seconds": 1494.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=1494"
    }
  },
  {
    "text": "all the details. I'll see if I can find a link to throw on the notes, but it is an interesting case study on something like that. I actually missed about half of it, because I went to the kitchen to make some coffee, and I was talking to someone for a few minutes, and then I went back to my desk, and I was like, what the hell has just happened? Then I looked at the charts, and I was like, I missed half of the action. I wasn't trading actively at the time, so it wasn't a disaster for me, but that's how quickly it happened. Like if I go to get lunch, I might have missed the whole thing. Yeah, I think what was it? I think, um, I got what was the magnitude? It wasn't like too crazy though. Wasn't it like less than 10 or around 10. I can't remember. I do remember obviously the velocity is, seven, eight percent, something like that. But it was just in the middle of a day when nothing else was happening. And of course, when it was happening, you don't know, you don't know why it's happening. So you're like, yeah, at that point, you're like, okay, it's a nuclear bomb going off somewhere, because this doesn't happen for no reason, but apparently, it did happen for no reason. Yeah. Going back to the Zura DTE stuff, from a retail trading perspective, how do you think that that",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 41,
      "start_timestamp": "00:26:13",
      "start_timestamp_seconds": 1573.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=1573"
    }
  },
  {
    "text": "you're like, yeah, at that point, you're like, okay, it's a nuclear bomb going off somewhere, because this doesn't happen for no reason, but apparently, it did happen for no reason. Yeah. Going back to the Zura DTE stuff, from a retail trading perspective, how do you think that that fits into their portfolio? They shouldn't do it. Why not? The costs are too big. I'll throw it back to you. Why should they do it? They've got a lot of options to choose from, right? Just because zero DTs are there doesn't mean you have to get involved. Um, if you can trade zero DTs profitably, you can trade one week options profitably as well. And the costs couldn't doing that are way lower. So I really can't see any great reason that a retail person should trade them. And I also think most brokerages with most retail accounts don't let you do a bunch of stuff with them. Like, can you go naked short with any account? Can anyone do that? No, I think you have to have certain options permissions, but most people, you can just lie literally and get tier three. Um, and that allows naked short positions. No problem. The margin requirements are tough, but if you get something like portfolio margin, which you don't have to have a lot of money, I think it's like 125 or 150,000 dollars. And once you're there and above, you can have portfolio margin. Well, that's the other",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 41,
      "start_timestamp": "00:27:12",
      "start_timestamp_seconds": 1632.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=1632"
    }
  },
  {
    "text": "short positions. No problem. The margin requirements are tough, but if you get something like portfolio margin, which you don't have to have a lot of money, I think it's like 125 or 150,000 dollars. And once you're there and above, you can have portfolio margin. Well, that's the other thing. The margin return on margin. If you're paying margin, you got to remember a few years ago, no one paid margin for intraday stuff. That was amazing. Just just to clarify, it's not paying as just a margin requirement. Oh, yeah, you're trading with margin, not on margin in that scenario. Um, I think now there are a lot of brokers actually charge you a margin specifically for that trade. That's whereas I think certainly when I was trading weaklies maybe six years ago, they didn't, and you could blast any size you liked. It was great. Um, that's interesting. Yeah. Haven't said all that. If you have a profitable strategy for trading options, it will do just fine in weaklies. Hell, it will do just fine in monthlies. They're all the same. Um, I just can't see any reason why you would willingly choose to pay all of those transaction costs, put the same trade on essentially five times a week. Why don't you just do one weekly? It's a lot cheaper. And transaction costs says you know I harp on about them. It's like termites eating at your house. You don't see them at all. And then",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 41,
      "start_timestamp": "00:28:34",
      "start_timestamp_seconds": 1714.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=1714"
    }
  },
  {
    "text": "those transaction costs, put the same trade on essentially five times a week. Why don't you just do one weekly? It's a lot cheaper. And transaction costs says you know I harp on about them. It's like termites eating at your house. You don't see them at all. And then you'll look at your trends and look at your account at the end of the year. See how much money you've paid away in costs? Um, costs, if you can improve costs, it's the best way to improve your results. Absolutely without a doubt. No one wants to do that though, right? Because developing a strategy is fun. Research is fun. Reducing transaction costs is kind of a grind and a battle. Um, and it's more important for retail than anyone else because their transaction costs are higher. So they should be working at it more and I tend to find they work at least. Yeah, well, I think from the retail trader perspective, at least most of them, they probably just don't feel like they have much of a like to stand on. Because I noticed realistically, until my account size just grew enough, like the broker didn't give up fine fuck about it. They still probably don't for being honest, but the brokers will never care. Yeah, it's up to you. And the only way you can reliably reduce your costs is by trading less. Like I don't know if you play poker. I don't, I don't really,",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 41,
      "start_timestamp": "00:29:50",
      "start_timestamp_seconds": 1790.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=1790"
    }
  },
  {
    "text": "up fine fuck about it. They still probably don't for being honest, but the brokers will never care. Yeah, it's up to you. And the only way you can reliably reduce your costs is by trading less. Like I don't know if you play poker. I don't, I don't really, but I know a few people who do seriously. A lot of the art of playing poker is not playing poker. It's just waiting. The single best thing most traders could do to improve is by trading less. Um, and it's, I mean, is that counterintuitive? I don't know. It's just the way it is. Because there aren't edges every second. So you don't have to trade every second. You can wait. You know, if you don't see a good, I don't know what kind of set up or whatever you're looking for. If you don't see a good opportunity, don't, don't dabble. Because all that dabbling, it adds up. Yeah. And that makes sense, especially for a lot of like short term strategies. Two notes, though, and I'm curious your thoughts on these. One of the benefits to your DTE, as I've seen at least, is you have the ability to leverage the account. Because the margin requirement can be derived from existing positions. So if you're long shares, whatever the case, you can then still trade your zero DTE options. That it's slightly efficient. I'm, it's nothing that I would really lean on as, you know, a base",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 41,
      "start_timestamp": "00:30:59",
      "start_timestamp_seconds": 1859.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=1859"
    }
  },
  {
    "text": "ability to leverage the account. Because the margin requirement can be derived from existing positions. So if you're long shares, whatever the case, you can then still trade your zero DTE options. That it's slightly efficient. I'm, it's nothing that I would really lean on as, you know, a base of the argument. But I think the broader draw for most people at least, because to be clear, I do trade zero DTE options, but it's a small part of my book. And that's for a bunch of different reasons. But I think one of the most commonly used arguments in their favor, which I can absolutely see is the risk is off. You come the end of the day, the risk is off. And I think we know, at least from analyzing most market movements, a lot of the bigger moves occur during off-market hours via gap. I would, I would disagree with that second part. I mean, there was a study a few years ago, which I don't entirely agree with, but I agree broadly with it that short options made money overnight. And long options actually did slightly better during the day. Now, that's one of those studies you can't really trade on, because no one's going to flip their entire portfolio twice a day. Please don't do that. But I do believe that you get paid for the overnight risk premium. Being short options overnight is scary. So people will pay to take that fear away.",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 41,
      "start_timestamp": "00:32:10",
      "start_timestamp_seconds": 1930.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=1930"
    }
  },
  {
    "text": "studies you can't really trade on, because no one's going to flip their entire portfolio twice a day. Please don't do that. But I do believe that you get paid for the overnight risk premium. Being short options overnight is scary. So people will pay to take that fear away. That's where risk premiums from. So I don't, I agree with you. It's gone away thing. I would just say, maybe you should be doing strategies where you don't want it to go away. You know, I, like you don't take off your entire, you know, retirement account every night, which you could, I don't know, the mechanics, but, you know, long term stock position, you don't liquidate that every night, because you're going to be like, I know I'm going to do better staying in the market longer. And so I would say anything you can do with a zero DTE, look for really, if it's entirely the only thing you're trading is a move that only happens during that day. And you've looked and you've really looked and it doesn't work if you use two day options or three day or weekly or whatever. Go for it. I'm not saying don't. What I am saying is be very clear that you're trading something that only happens at that time scale. And don't just do it because you want to get a quick fix every day. That's the danger. People, I don't know, people like to gamble, right? And",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 41,
      "start_timestamp": "00:33:27",
      "start_timestamp_seconds": 2007.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2007"
    }
  },
  {
    "text": "not saying don't. What I am saying is be very clear that you're trading something that only happens at that time scale. And don't just do it because you want to get a quick fix every day. That's the danger. People, I don't know, people like to gamble, right? And yeah, that's great. And I'm a big proponent of working with that tendency rather than just sort of like there's no way if you have an addiction, you can cure the addiction by saying I'm just not going to do that, right? That it doesn't work like that. You've got to replace it with something else. So if you know you're going to gamble in short term options, okay, treat it like a learning experience, document the hell out of everything you're doing. So you're actually, I think you'll lose money, but at least it genuinely is tuition. If you, if you learn something from all of your losing trades, at least it's not a total loss. And there's this bullshit, right? That people are always, well, I lost money my first four years paying tuition. Well, you weren't. I mean, you were losing money because you were doing something dumb. That's not the same as actual tuition, where if you've got the records, you can look at them and say, ah, that was a mistake. Shouldn't have done that. You're only learning has to be active. Losing money isn't learning, you know, but doing small trades and tracking the",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 41,
      "start_timestamp": "00:34:40",
      "start_timestamp_seconds": 2080.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2080"
    }
  },
  {
    "text": "dumb. That's not the same as actual tuition, where if you've got the records, you can look at them and say, ah, that was a mistake. Shouldn't have done that. You're only learning has to be active. Losing money isn't learning, you know, but doing small trades and tracking the results, that could be learning. So if you're sitting in front of the screens all day and you're really trying to get better, then maybe trade a one lot of zero dTs. But seriously, if it's just for learning, a one lot's going to teach you as much as a hundred lot. And given I'm pretty sure you'll lose money, why not lose less money? Right. Well, in two points there, the first one I couldn't agree more on the the tuition comma, I find people they try to just justify shitty behavior with what they think is a smart explanation. And it's just laziness. But going back to the zero dTE thing real quick, I think one of the return points I would offer to you specifically with respect to the risk with zero dTE, at least from a retail trader perspective, a lot of retail accounts are smaller. So to your point, I agree with you that in the aggregate in the long run, you would probably do better inclusion of costs using slightly longer term timeframes. But I think for smaller accounts, a reality that they face this severity. So if there's a big enough overnight move,",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 41,
      "start_timestamp": "00:35:55",
      "start_timestamp_seconds": 2155.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2155"
    }
  },
  {
    "text": "So to your point, I agree with you that in the aggregate in the long run, you would probably do better inclusion of costs using slightly longer term timeframes. But I think for smaller accounts, a reality that they face this severity. So if there's a big enough overnight move, even on a one lot in SPX, that can start to hamper their account. So then would your position on something like that be if you're in that camp, then probably not a strategy that fits in your account because of sizing? Yeah, I am generally of the opinion that if your account is too small to do something safely, you probably are just too small to do that thing. So you should never be in a situation where you're forced to do something because of your capital limitations. You should work within those capital limitations, not say I want to trade options, but the only way I can do that is with zero dTEs. That's a bad justification. You're justifying bad behavior to get around something else. Keep at it, work more, get your account bigger, and then trade the thing you really want to trade. So don't half-ass it by trading something that you know isn't ideal because it's the only thing you can trade. Like that's like that old story about again, the poker player who's playing it a game and his friend comes over and goes, you know, that's a crooked game. And he's like, yeah,",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 41,
      "start_timestamp": "00:37:04",
      "start_timestamp_seconds": 2224.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2224"
    }
  },
  {
    "text": "it by trading something that you know isn't ideal because it's the only thing you can trade. Like that's like that old story about again, the poker player who's playing it a game and his friend comes over and goes, you know, that's a crooked game. And he's like, yeah, sure I know, but it's the only game in town. You know, that's not the way a professional plays, that's the way an addict plays. So don't do that. Although I'm going to be very clear here, I trade zero dTEs all the downtime, but I trade them only for specific effects that only happen in today. And I mean, I've probably done more work on it than most people. So and even then, I don't make that much money from them. So the longer-dated options, way more profitable. It's just that if you can automate all these things, then sure, I trade zero dTEs, but they'll weigh down the end of my list. And if I had to chop something, that'd be fairly high up the list of things I'd chop. They make money, but it's not, it's not astonishing. Right. Yeah, I definitely agree with that. I know we're coming up on time to get you out of here. And I definitely need to get to the other question I have for you, which is one of the super sleuths in my community showed a tweet that you put out that I actually also came across that talked",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 41,
      "start_timestamp": "00:38:20",
      "start_timestamp_seconds": 2300.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2300"
    }
  },
  {
    "text": "we're coming up on time to get you out of here. And I definitely need to get to the other question I have for you, which is one of the super sleuths in my community showed a tweet that you put out that I actually also came across that talked about sports betting and how you have learned a bit from sports betting with respect to trading. I would love to tap into that a little bit, because you've mentioned sports betting a few times in our conversations. And I have to be honest from my perspective, I've always thought sports betting is the same thing as options, slightly different market, but slightly different rules to the tools. But I live in California, and there are a lot of rules on what you can wage your own. So I'm just curious from your perspective, a little more the background behind that, your relationship with sports betting, and specifically how that parallels to trading. It's always dangerous to be like trading is like this, because those are like trading is just like poker trading is just like chess, because the only people who ever say that are people who happen to be experts in one of those in chess. So right, and you're an expert in anything. There are probably lessons you can apply to anything else, right, because you've gone through a process you've learned something. So you know, like let's say you're a great tennis player. You can probably",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 41,
      "start_timestamp": "00:39:31",
      "start_timestamp_seconds": 2371.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2371"
    }
  },
  {
    "text": "be experts in one of those in chess. So right, and you're an expert in anything. There are probably lessons you can apply to anything else, right, because you've gone through a process you've learned something. So you know, like let's say you're a great tennis player. You can probably apply the process you weren't through to become a great tennis player to being a chef. So I think at a very high level a lot of things are transferable. I used to gamble on baseball in the early 2000s. Pretty moneyable. So I kind of got into it by accident, and I just had the idea baseball is a very sequential game. So picture pitches, hitter does something, he either runs the first base or he goes, sits down, everything then happens again. There's another hit, this guy goes over to the next base, so forth, so forth. So it's actually very easy to simulate a game in advance. So I had nothing else to do at this point, like literally I was sitting around work, nothing to do. So I simulated baseball games and started gambling on that. Just out of interest. And then I stopped. Basically that market got much, much harder after money ball came out. And after it became easier to get data in an automated form of by web scraping and stuff. So I stopped doing it. But I kind of liked, I still dabbled in sports betting. I've learned some specific stuff that's",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 41,
      "start_timestamp": "00:40:38",
      "start_timestamp_seconds": 2438.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2438"
    }
  },
  {
    "text": "market got much, much harder after money ball came out. And after it became easier to get data in an automated form of by web scraping and stuff. So I stopped doing it. But I kind of liked, I still dabbled in sports betting. I've learned some specific stuff that's helpful in terms of Bayesian analysis, empirical Bayes. For example, I found useful. But it's more that I've talked with sports gamblers, really good ones. And you just kind of pick stuff up. I mean, someone, I thought it was a pretty dumb reply. You know, I don't know the guy. So maybe it wasn't, maybe it was just a anyway. He said, I said something like, I've learned a lot over the last five years and he said, what have you learned? And I'm like, dude, it was five years. I learned a lot in five years. I can't rip that out in a hundred words. So I just was thinking about it, especially talking to a couple of the people on Twitter. I have just learned a lot of little things here and there. And the longer you do one thing, the harder it is to learn new things entirely from within that ecosystem. Like it's very difficult for me to learn a completely new thing about options trading. I can learn, I learn all the time, but it's always incremental now. Whereas with sports gambling, someone can say something and I'll be like, whoa, that's amazing. Never",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 41,
      "start_timestamp": "00:41:50",
      "start_timestamp_seconds": 2510.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2510"
    }
  },
  {
    "text": "things entirely from within that ecosystem. Like it's very difficult for me to learn a completely new thing about options trading. I can learn, I learn all the time, but it's always incremental now. Whereas with sports gambling, someone can say something and I'll be like, whoa, that's amazing. Never thought of that. One of the other things about sports gambling is it's the way to do it is very orthogonal from the way people think you should do it. Like very few professional gamblers bet by predicting the outcome of games. Like you're not going to predict that the 49ers will beat the packets. What you're going to predict is given that the first quarter spread is seven and the total is 41, what should the total game spread be? So you're looking for all these relative value trades and it doesn't really matter what the game is. That trying to think there's always there. And I think that applies a bit in trading as well. Very few, very few traders make money over the long run by predicting if a price is available to you at any time of the day on your smartphone, it's very unlikely you're going to make a living by out predicting that market. So in the same way, you're not going to make a living betting on NBA games, but you might make a living betting on the little props that you put 50 bucks into, bet on 200 of them every day,",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 41,
      "start_timestamp": "00:43:02",
      "start_timestamp_seconds": 2582.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2582"
    }
  },
  {
    "text": "going to make a living by out predicting that market. So in the same way, you're not going to make a living betting on NBA games, but you might make a living betting on the little props that you put 50 bucks into, bet on 200 of them every day, that's where you make the money. So when I bet on games now, I do it completely the wrong way. Like I try and bet on games because I want to see if I can predict the winner. But okay, here's another reason. What do you want to know? I bet on rugby games because I like watching rugby and I watch tons of games every weekend. So why not bet on second division for entropy or whatever. And I've got a mole. Now my model has edge. If I just bet what Kelly tells me to every week at the same bookie, so I'm betting 284 here, 27 there, massively changing my bets and betting on every game, I'm going to get kicked out because it's very clear to the bookie that I'm not just a recreational player. I'm not just getting lucky. I'm doing something involving what I think is edge. So a bookie at that point will kick you out even if you're not making money. Because I'll be like, look, this guy is clearly trying to do something smart. We don't need to deal with that hassle. So they won't even wait for you to make",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 41,
      "start_timestamp": "00:44:26",
      "start_timestamp_seconds": 2666.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2666"
    }
  },
  {
    "text": "think is edge. So a bookie at that point will kick you out even if you're not making money. Because I'll be like, look, this guy is clearly trying to do something smart. We don't need to deal with that hassle. So they won't even wait for you to make money. I'll just kick you out. So what I got, I've got this from a book by Ed Miller who's written a couple of books on sports gambling. You want to take any opportunity you can that doesn't cost you money to look like an idiot. So instead of putting in one bet, people often say parlays are a bad bet because they can pound negative edge. But if you have positive edge, they can pound that as well. So if you have edge, a parlay is a good bet. So instead of me betting on five individual games, I will parlay every single combination of those games and bet 10 bucks on each one. And that makes me look like a complete clown, right? Because that's the sort of thing an absolute idiot does. But because I have edge, it actually is a good thing for me. And a while back, I hit an eight-way parlay by doing all this. And it was a huge win. If I won that amount of money by betting like just separately on every game, I would have got kicked out. But in this case, the book he called me and gave me",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 41,
      "start_timestamp": "00:45:26",
      "start_timestamp_seconds": 2726.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2726"
    }
  },
  {
    "text": "while back, I hit an eight-way parlay by doing all this. And it was a huge win. If I won that amount of money by betting like just separately on every game, I would have got kicked out. But in this case, the book he called me and gave me a full-time, concierge service because they were like so convinced I was an idiot that they're like, we've got to keep this guy around. That's amazing. So that kind of thing, and that actually works with trading as well. Like there are sometimes things you, it doesn't cost you any edge, but it might act as like a diversifier or it could act as a hedging trade. And if you can get things down to the point where there's no edge that you're giving away, it gives you a lot more options of things to do. So that was sort of a little aha moment for me. And if you pushed me, I probably wouldn't have known that anyway. But sometimes getting things from a different angle is really helpful. And I've just talked to smart people, like I said, and I've talked to some baseball guys on the Sabermetric side. And it's always fun to talk to smart people. Definitely. And it's also cool to just learn. I think it's also really cool to learn another craft, right? Because it's again, like you're highlighting, there are some similarities, a lot of differences, but overall, that's, that's really really cool.",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 41,
      "start_timestamp": "00:46:38",
      "start_timestamp_seconds": 2798.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2798"
    }
  },
  {
    "text": "side. And it's always fun to talk to smart people. Definitely. And it's also cool to just learn. I think it's also really cool to learn another craft, right? Because it's again, like you're highlighting, there are some similarities, a lot of differences, but overall, that's, that's really really cool. I'm glad to hear you talk about that. That would be something I'd love to chat with you more about, but we are at time. We've got to get you out of here. You have a hard stop. So I'm not going to let you run over. Before you run off, though, is there anywhere that you want to direct people? Do you want me to go check out the whole website? Anything like that? We've got two websites because of the way the cut-cheap structure. I think if you just Google whole tactical, you'll come to us eventually. If anyone, this is, now, see, I'm always terrified of compliance, right? So I don't want to come on here and say something that I'm going to get in trouble with compliance. But obviously, we have FAQs and stuff on there. So if anyone wants to, they can find all the information they need. Just remember, it's total return, which may not show up in price appreciation, or on Yahoo Finance. If anyone wants to put a hundred million bucks in, you don't have to do it through the open market. We can get your block trade. I'll tell you that.",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 41,
      "start_timestamp": "00:47:50",
      "start_timestamp_seconds": 2870.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2870"
    }
  },
  {
    "text": "information they need. Just remember, it's total return, which may not show up in price appreciation, or on Yahoo Finance. If anyone wants to put a hundred million bucks in, you don't have to do it through the open market. We can get your block trade. I'll tell you that. Perfect. Yeah, great. For a lot of this. And I'll throw a link to the website, though, so that people can find it. But you and as always, absolutely pleasure, man. Thanks for hanging out for a little bit. And then I'm sure I'll check you down, ask you some more silly questions. But I'll enjoy hearing your perspective and learning from you. So thank you for hanging out. Yeah, thanks. It was fun. Awesome.",
    "metadata": {
      "video_id": "6vQeTS9cyk0",
      "title": "0DTE Options & Sports Betting w/ Euan Sinclair | The Outlier Podcast Ep62",
      "url": "https://www.youtube.com/watch?v=6vQeTS9cyk0",
      "upload_date": null,
      "duration": 2973.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 41,
      "start_timestamp": "00:48:52",
      "start_timestamp_seconds": 2932.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6vQeTS9cyk0&t=2932"
    }
  }
]