[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you playing long-term price appreciation, but sometimes you don't want to deal with near-term price shocks. So more often than not, you will see those kinds of holders buying puts. It's a cost of doing business. It's a cost to take some risk off through the earnings release. The fact that you're seeing this much directional speculative volume in a large cap stock that typically exhibits the opposite behavior is a pretty strong indicator. I got to say, I agree with that. I agree with what that guy just said. And I was evaluating as if I was evaluating anybody else talking. That was actually kind of funny, but that's exactly correct. It sounds like something I would say. So the funny thing is, and the reason why I'm sharing that with you is because so far, take a look at what's happening in video. They're right now trading at 141 where they closed at 134. This is one of those instances where it's always a crap shoot. The last thing I want somebody to ever take away from a clip like that is like, oh, Eric knew this was going to happen. The fuck I did, I have no idea what's going to happen. I have no idea what I'm going to have for",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 41,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=0"
    }
  },
  {
    "text": "a crap shoot. The last thing I want somebody to ever take away from a clip like that is like, oh, Eric knew this was going to happen. The fuck I did, I have no idea what's going to happen. I have no idea what I'm going to have for dinner, let alone what a stock is going to do. I have no idea, but I'm the worst guy to have an idea. But what I can do is look for clues on probabilistic outcomes and make a guess. That's effectively what that is. That's not me knowing what's going to happen. Nobody knows. However, I can look at different things, different analytical inputs. Then I can arrive at something that's like, hmm, it seems like X scenario is more probable than Y scenario. Then my job as a degenerate trader is to trade my half-baked idea. That's effectively what this game is. Now, joking aside, the main thing that I really do want to drive home from that is that seriously. Nobody knows. Whenever you get people that make a call and then they go back and they say, oh, yeah, I knew that was going to happen. Fuck that person. It's bullshit. They don't know. Nobody knows. That doesn't mean that you can't say, I think X is more likely than Y and it's a tradable event for whatever reason. There's a fine difference between those. When I look at this coming earnings release, this is what I",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 41,
      "start_timestamp": "00:09:26",
      "start_timestamp_seconds": 566.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=566"
    }
  },
  {
    "text": "that person. It's bullshit. They don't know. Nobody knows. That doesn't mean that you can't say, I think X is more likely than Y and it's a tradable event for whatever reason. There's a fine difference between those. When I look at this coming earnings release, this is what I expected to see. This is not anything that I knew to be the case. A big part of that absolutely comes down to literally that exact point. It really is worth reiterating. It's like, it's very pertinent here. Most of the time when big large cap stocks that are widely held go through an earnings cycle, they more often than not will see put side hedging. It's simply because those people are not looking to speculate on direction through earnings. They just don't want to have a ton of risk through earnings. To see that much directional positioning is quite telling. Among other things, that was just a clip of the pro stream that we did yesterday where we go in a little bit more in detail on stuff like this. We go on and look at the other earnings and stuff like that. None of that matters. The main thing that I thought was interesting is that the options markets did give us some ideas as to what this could look like. Far, it does look like they're having a pretty solid earnings. Now, the other thing to pay attention to is who knows where this is going to",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 41,
      "start_timestamp": "00:10:42",
      "start_timestamp_seconds": 642.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=642"
    }
  },
  {
    "text": "thing that I thought was interesting is that the options markets did give us some ideas as to what this could look like. Far, it does look like they're having a pretty solid earnings. Now, the other thing to pay attention to is who knows where this is going to open tomorrow. That's a whole other bag. Right? Right now it's trading down at 140, 84. It's already trickling down a little bit. There's nothing that says that this can't run down more. Who knows? No idea. But anyways, let's see what they're talking about. That's the last person I want to watch. To be honest with you, I just want to see like an overview of here. We can start with this. Business booming. We know that they reported 44 Billy in revenue for its fiscal quarter. Yo, when you have companies that are out here just reporting billions over quarters, we are firmly in monopoly money. Like this is all fake. That's an insane. Could you imagine? What is the visual of that amount of money? I'm going to ask, we need a comparison. Give me a reference visual for 44 billion dollars in 100 dollar bills. Just visually how many trucks it would take up? There we go. So 44 billion is 440 pallets, which is essentially an entire warehouse. That's a pretty good one. Pallets is decent. I don't know that that many people would like refer to pallets. But I feel like most people know",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 41,
      "start_timestamp": "00:11:59",
      "start_timestamp_seconds": 719.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=719"
    }
  },
  {
    "text": "visually how many trucks it would take up? There we go. So 44 billion is 440 pallets, which is essentially an entire warehouse. That's a pretty good one. Pallets is decent. I don't know that that many people would like refer to pallets. But I feel like most people know what a fucking palette looks like. So 440 of those bastards. That's just a ton of money. Okay. Let's see includes chips, other components, a computing system. Yes, yes, revenue up 73 your your markets happy. Futures are up. I actually am long futures right now. And that's literally just because the my near term expectation is that we will see this kind of bleed through. Like I absolutely think we'll continue to see this kind of bleed through from the from the news. So yeah, that absolutely I think is likely to continue at least for a little bit. Now there's a breadth of data, by the way, that can analyze the frequency of reversals of big earnings beats and stuff like that. But this does look poised for post earnings announcement drift, even though that typically doesn't impact large cap stocks quite as much anymore. Something like this probably something to keep an eyeball on. Let's see what else anything else sticks out to us. Okay, the data center business includes chips and other components using AI computing system revenues surge 73 your over year to 39.1 billion just below the 39.36 billion expected by analysts. So this",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 41,
      "start_timestamp": "00:13:28",
      "start_timestamp_seconds": 808.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=808"
    }
  },
  {
    "text": "probably something to keep an eyeball on. Let's see what else anything else sticks out to us. Okay, the data center business includes chips and other components using AI computing system revenues surge 73 your over year to 39.1 billion just below the 39.36 billion expected by analysts. So this is really interesting because this is still a slight miss technically right they were expecting even more aggressive metrics. So that's actually kind of interesting that it's still reacting this this nicely. Dark Mark says another way to help wrap our heads around the difference between million and billion is oh, I've heard this put in time before. One million seconds is 11 days one billion seconds is 31 years. I've heard that one before as a really great way. And I think that's an even better comparison than pallets. So now we need to know what 44 44 billion seconds is in years. I'm gonna multiply that by 44 we're all dead and then some that's much certified fine. What are these little crowns y'all have? What the fuck does that mean? I've not seen those before those are cool. Certified finance says why don't you sell credit spreads? That's a great question. It's not that I don't it's that I rarely do and it's because when we look at a vertical spread they tend to cannibalize themselves. I mean that's really the whole point of a vertical spread is to decrease the total risk in the trade both",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 41,
      "start_timestamp": "00:14:58",
      "start_timestamp_seconds": 898.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=898"
    }
  },
  {
    "text": "That's a great question. It's not that I don't it's that I rarely do and it's because when we look at a vertical spread they tend to cannibalize themselves. I mean that's really the whole point of a vertical spread is to decrease the total risk in the trade both felt by the Greeks but as part of that decreasing of risk you are decreasing opportunity. So I think I think a few things but I think there's a time and place for them in general it's not part of what I do. There are absolutely instances where it is part of what I do specifically through things that are like earnings releases and I'm trading a short strangle in tech and tech can fly. So in stuff like that I'll add a cap I'll add a wing to the call side I typically wouldn't do it on the put side I just take the risk. So the short answer is a lot of times you give up too much to take the risk off and our job as traders is to take risk it's how we make money. So it's mostly for those reasons and again it's nothing that I would say like I don't do them I pretty much avoid those kinds of platitudes but I definitely rarely do them has to be a very specific use case for them because otherwise you're given up too much at least in my opinion it's a good question. Lauren says",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 41,
      "start_timestamp": "00:16:22",
      "start_timestamp_seconds": 982.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=982"
    }
  },
  {
    "text": "I would say like I don't do them I pretty much avoid those kinds of platitudes but I definitely rarely do them has to be a very specific use case for them because otherwise you're given up too much at least in my opinion it's a good question. Lauren says you can't get a copyright on your own video that's solid that's good to know I'm still waiting fucking YouTube probably turn my shit down. Ricky says Eric can read the future see that's the shit that I'm talking about I cannot neither can anybody else I literally still don't even know what I'm having for dinner tonight let alone what anything else is going to happen is crazy. Lauren says she that she Google how to turn it off it was distracting her that's kind of what I didn't even know that you could turn it on if there is a way for me to force turn it on for you again I would have done that because it's kind of fun. Ricky says market seems like it's looking for reasons to recover funny how last earnings beat expectations as well but it sold off ah but very very different and that is a really important differentiation because when we're talking about earnings this is a perfect time for a handy dandy Eric original in case you guys are interested I'll you know start turning these into NFTs because are those still a thing do people do NFTs though",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 41,
      "start_timestamp": "00:17:38",
      "start_timestamp_seconds": 1058.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=1058"
    }
  },
  {
    "text": "different and that is a really important differentiation because when we're talking about earnings this is a perfect time for a handy dandy Eric original in case you guys are interested I'll you know start turning these into NFTs because are those still a thing do people do NFTs though because these are clearly just gold drawings and it wouldn't surprise me if somebody was like yo I need that on my wall I don't blame you I might feel that way too so if we're talking about earnings we have two big differences a big part of earnings is rehashing what happened in the past it's looking at things like sales revenue all these kinds of things right all the fundamentals of stuff and as you can see they are pretty damn good at forecasting what stuff is going to be especially for highly traded names there's way too much information continuously available that allows pretty damn good estimates to be made so you can see that they were expected year over year to 39 39.36 they came in at 39.1 that's year over year that's a long time frame to make that kind of guess and they were damn close so when we're talking about past effects this is kind of just like recounting what happened and a lot of this stuff is way more the case of as long as it's pretty close or around what we thought it should be then it passes if it's something",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 41,
      "start_timestamp": "00:18:39",
      "start_timestamp_seconds": 1119.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=1119"
    }
  },
  {
    "text": "damn close so when we're talking about past effects this is kind of just like recounting what happened and a lot of this stuff is way more the case of as long as it's pretty close or around what we thought it should be then it passes if it's something let's say for example that revenue fell it didn't gross fast as expected for some sort of thing then all of a sudden then that doesn't pass that creates a problem now the larger component that's more important during an earnings release barring these kinds of big changes based off of expectations is forward guidance this is where we're actually getting a first look at how the company is expecting things to happen in the future which this is net new information this is stuff that we don't know we can guess what forward guidance might look like but that's way more of a crap shoot than tracking things like sales revenue buying of new warehouses all that kind of stuff so the reason why in the last earnings release and this isn't specific to Nvidia this is in general the reason why you'll see that kind of behavior is not because EPS or some sort of financial metric doesn't necessarily you know scratch the itch but a lot of it has to do with the forward guidance and what is captured in that forward guidance and if we go back to the end of February of this year and",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 41,
      "start_timestamp": "00:20:19",
      "start_timestamp_seconds": 1219.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=1219"
    }
  },
  {
    "text": "not because EPS or some sort of financial metric doesn't necessarily you know scratch the itch but a lot of it has to do with the forward guidance and what is captured in that forward guidance and if we go back to the end of February of this year and we think about what that forward guidance looked like you know all this tariff ship was going on stuff that directly impacts in video is going on and Nvidia is absolutely super susceptible to supply chain shocks in that way they're not like some of these other companies that have actually pivoted really heavily away from some of the primary places that would be targeted so that's a big big difference and it's a good observation it's a really good observation but the context of those two windows is super important for us to to acknowledge and understand one more making the comparison all right let's see what else came out here net income 1988 9 billion up 31 percent the announced that new rules from the Trump administration no longer allow the chips to be exported to China like that kind of thing absolutely impact stuff adjusted earnings diluted don't care okay so for the current quarter and video projected revenue 45 billion up or down to percent inless view was 45.92 it includes 8 billion in loss revenue due to the H2O ban which again that's going to be baked into the price yeah so I mean overall",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 41,
      "start_timestamp": "00:21:44",
      "start_timestamp_seconds": 1304.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=1304"
    }
  },
  {
    "text": "don't care okay so for the current quarter and video projected revenue 45 billion up or down to percent inless view was 45.92 it includes 8 billion in loss revenue due to the H2O ban which again that's going to be baked into the price yeah so I mean overall this looks like a just a pretty solid earnings release that's what I'm seeing let's see let's see what this guy says by almost 4 percent about 30 minutes into the conference called sascohanna senior analyst Chris Rowland is here to give his reaction to the results Chris great to have you with us and I'm just reading through some of the the comments that are coming across right now specifically about the China market which of course is a big part of Nvidia's quarter here the CFO saying the company is still evaluating limited options to serve the Chinese market and losing access to the Chinese market of material adverse impact on Nvidia's business how should we view if the tariff that if the export controls remain in place how should we view the China market and what it will be to Nvidia in a couple years yeah so I think the big revelation about Q2 is that they were planning on shipping 8 billion probably almost twice as much as we were anticipating they would actually ship you know this guy told so China in the second quarter so this was turning out to be a very large",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 41,
      "start_timestamp": "00:23:03",
      "start_timestamp_seconds": 1383.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=1383"
    }
  },
  {
    "text": "I think the big revelation about Q2 is that they were planning on shipping 8 billion probably almost twice as much as we were anticipating they would actually ship you know this guy told so China in the second quarter so this was turning out to be a very large blockbuster product for them it is sorry can't can't do it and there's no way for me to speed them up I fucking hate stuff like this where I'm just trying to synthesize information just talk fast so I can get the information faster that's so damn slow okay so let's see anything else that sticks out to us here did it it a roller coaster yep yep yep yep so literally this dude was just talking about the longer term outlook in China okay so let's talk about tariffs for a second and what this is likely to look like it going forward a big part of this is a big part of this is trying to synthesize and war game what's happening broader and what the conversations are and why they are what they are without going super deep into detail on all that stuff we can if you would like but without diving straight into that I think the safest assumption here is that the way tariffs have been going are likely to be the way that they will continue to go so what that means is a lot of conversations and a lot of reconciliation about",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 41,
      "start_timestamp": "00:24:23",
      "start_timestamp_seconds": 1463.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=1463"
    }
  },
  {
    "text": "you would like but without diving straight into that I think the safest assumption here is that the way tariffs have been going are likely to be the way that they will continue to go so what that means is a lot of conversations and a lot of reconciliation about finding ways to avoid these really large tariffs on everything and a big reason for that is because the tariffs literally negatively impact literally everyone so because of that there's not like some sort of massive incentive to keep them in place so when Nvidia is trying to forecast its future business it does have to take that stuff into account but again is a as a betting man which I am as a trader I have to assume that and it seems like the market supports this assumption that we're going to continue seeing tariffs going the way that they've been until there's a material change which at some point there could be but right now Nvidia is back up to 141 the options market looked really actually aggressive today and again this is some follow up from what we saw yesterday but I still think it's worth talking about because this kind of positioning is noteworthy so we saw this bullish call positioning yesterday and then towards the close today which is really important you can see a bunch of the call buying activity which is speculative positioning and then you can see put buying activity going up",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 41,
      "start_timestamp": "00:25:39",
      "start_timestamp_seconds": 1539.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=1539"
    }
  },
  {
    "text": "about because this kind of positioning is noteworthy so we saw this bullish call positioning yesterday and then towards the close today which is really important you can see a bunch of the call buying activity which is speculative positioning and then you can see put buying activity going up that put buying activity is mostly people hedging they don't want to overpay they don't want to grab the put super early because you don't need to but you want to just cover the risk for the event itself and this represents more so of those longer term holders of the equity that don't really want to take a bet on earnings that I've referred to previously then that's a completely different group than the people that are speculating to the upside that we absolutely saw come through in force so Nvidia earnings here looks pretty solid so far full expectation is that the market will like that tomorrow now let's take a quick look at Tesla and Tesla is in a little bit of a different boat here Tesla has almost near schizophrenic positioning with options going on and it's been absolutely insane insane stock to watch so a couple notes here is where we're seeing this activity which will take a look in a second where the current OI is but then also the way that the stock is behaving because just like Nvidia when Nvidia first had this larger sell off one of my broader ideas that",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 41,
      "start_timestamp": "00:26:57",
      "start_timestamp_seconds": 1617.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=1617"
    }
  },
  {
    "text": "couple notes here is where we're seeing this activity which will take a look in a second where the current OI is but then also the way that the stock is behaving because just like Nvidia when Nvidia first had this larger sell off one of my broader ideas that I share with people is that especially for long term investors this was all a gift it really is because the periodicity that you're going to see companies like this at these levels going forward in my opinion would be love and the reason is especially something like Nvidia that's going to be at the epicenter of AI adoption they have a completely new untapped growth source that is going to literally fuel them for some time hold on I just got a breaking thing for Trump what do you say you never know what this dude is going to say so um oh this doesn't look like anything yeah okay does this anything and for those that don't know there's also the current court ruling regarding the tariffs from Trump which I was waiting to see how long it was going to take for the courts to get involved let's see if we can find an article on that uh court ruling Trump tariffs so let's see let's see um we'll start here that record Wednesday blocked the sweeping tariffs under the emergency powers law okay the ruling from a three judge panel at the New York base court",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 41,
      "start_timestamp": "00:28:29",
      "start_timestamp_seconds": 1709.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=1709"
    }
  },
  {
    "text": "let's see if we can find an article on that uh court ruling Trump tariffs so let's see let's see um we'll start here that record Wednesday blocked the sweeping tariffs under the emergency powers law okay the ruling from a three judge panel at the New York base court of international trade came after several lawsuits are you being Trump exceeded his authority from repeatedly said the tariffs would force manufacturers bring on shore yeah yeah um but for now Trump might not have the threat of import taxes to exact so this will be kind of interesting the ruling mounted to a categorical rejection of legal underpinnings is some signature most controversial actions supreme court will almost certainly be called upon to lend a final answer but it casts a sharp blow which is completely correct uh tariffs must be typically approved by Congress said he is the power to act to address the deficits he calls national emergency they you'll notice that they do a lot of this BT Dubs not just Trump any president they'll do the national emergency thing which just allows them to circumvent some normal normal processes that it's one of the cool things about just the American process in general is I actually like again completely disparate and detached from the tariffs the way they're going all that kind of shit I just like the fact that there's another body out there that can at least step in and say let's take",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 41,
      "start_timestamp": "00:30:02",
      "start_timestamp_seconds": 1802.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=1802"
    }
  },
  {
    "text": "things about just the American process in general is I actually like again completely disparate and detached from the tariffs the way they're going all that kind of shit I just like the fact that there's another body out there that can at least step in and say let's take another look at this I don't know if we agree with it I like that I think that's a good thing um dozen states filed suit led by Oregon which makes sense because I mean especially like this here including why wine wine importer boss selections owners says tariffs have major impact the company might survive like that that's a really pertinent point especially for companies that aren't as inflation resistance and I know that might be like well tariffs inflation was I have to do with stuff I'm just talking about prices in general just general price inflation and there are a lot of places that don't have the same capacity to tolerate it so yeah I think that's that's a hilarious picture by the way I love it when you can always tell like what a news agency when they like or don't like someone because they'll do shit like this so my guess is CMBC I don't know what certainty but my guess is CMBC not a big fan this is a hilarious picture um yeah okay so same same so that's another thing that you're seeing baked into the futures here beyond the tech earnings because",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 41,
      "start_timestamp": "00:31:47",
      "start_timestamp_seconds": 1907.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=1907"
    }
  },
  {
    "text": "shit like this so my guess is CMBC I don't know what certainty but my guess is CMBC not a big fan this is a hilarious picture um yeah okay so same same so that's another thing that you're seeing baked into the futures here beyond the tech earnings because believe or not Nvidia earnings is a massive part of this that has a huge say in what the market does Nvidia is such a massive company all right so let's get back to Tesla though and we have a scratching thing at the door all right all right we have our news analyst what do you have to say to the people okay I don't know if you guys are catching all that he does like to talk fast you are getting a little bit of a sniff what do you think of this he seems to like it he seems to like the mic too okay so now that we got our analyst locked in let's get back looking at Tesla so Tesla here has had an absolutely wild move it continues to be a crazy source of vault trading actually believe it or not there's a ton to do in Tesla and even with the moves that you see it does continue to provide really solid risk premiums because just the overall volume here is so high right now raw vol is 71.76 which still places implied volatility percentile at 71 this is also a really really",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 41,
      "start_timestamp": "00:32:57",
      "start_timestamp_seconds": 1977.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=1977"
    }
  },
  {
    "text": "to do in Tesla and even with the moves that you see it does continue to provide really solid risk premiums because just the overall volume here is so high right now raw vol is 71.76 which still places implied volatility percentile at 71 this is also a really really great reminder of the difference between implied volatility percentile and implied volatility rank if you're using implied volatility rank that would currently lead you to believe that vol is low vol is objectively not low vol is actually quite high so the reason for that is because the way that these two are calculated makes a big difference and I actually have a video that discusses the difference between implied volatility percentile and rank and why they're different but anyways Thor leave that alone you freak you literally just asked to come in here and then he goes over to the door and he's like stuffing his nose under the door snorting the dudes of crackhead so let's take a look at what's happening in here still long still long call volume compared to put let's take a look what I'm most interested in is actually how this breaks out and let's take a look here so all I'm doing is eyeballing premiums which is still very call heavy really call heavy and this is all the out into 2027 so really really call heavy which I mean I dig it huge huge putt build out at the 395 and",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 41,
      "start_timestamp": "00:34:39",
      "start_timestamp_seconds": 2079.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=2079"
    }
  },
  {
    "text": "and let's take a look here so all I'm doing is eyeballing premiums which is still very call heavy really call heavy and this is all the out into 2027 so really really call heavy which I mean I dig it huge huge putt build out at the 395 and it looks like a pretty short position being built here in June okay um and we want here oh interesting it's actually kind of mellowing out overall volume is actually slowing down not sure I would have taken it for that and I mean there's still pretty large trading activity pretty curious so from a general positioning standpoint right now it looks like there's a bit of a short pocket in the near term for Tesla but then longer term still very very much bullish still very much bullish skew bullish skew is as far as I could tell still generally ranked on the buy side this I have to be honest I don't think it matters in insane amount it do like to pay attention to it but yeah I like I don't think that this is the the end all be all I do like to see simply because it can give us a sense of what the market is generally expecting but it's mixed near term definitely looks to be a little more bearish and then longer term looks to be a little bit more um a little bit more bullish that's what I see if we",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 41,
      "start_timestamp": "00:36:23",
      "start_timestamp_seconds": 2183.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=2183"
    }
  },
  {
    "text": "because it can give us a sense of what the market is generally expecting but it's mixed near term definitely looks to be a little more bearish and then longer term looks to be a little bit more um a little bit more bullish that's what I see if we take a look at total ally so big expansion here and most of the ally I mean the majority as far as changes let's take a look at total ally still centered in the front so people are really playing the the front end of this which stuff like this again you you pretty much see that all the time with more volatile names the risk premiums in here have been insane so this reminds me of a trade that I recently reviewed with the with the pro folks good old prta so this one was one I forgot exactly when I entered but this was just short puts and it literally moved against me almost 40 and despite a 40 move against me the trade was still profitable from the change in fall so when we look at Tesla it still maintains really aggressive risk premiums even though on average we've been getting larger moves than expected last thing I want to take a look at here is a term structure let's see so so there's a bit of a peak that's kind of interesting because this is obviously wildly low relative 23 days what expiration is the 815",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 41,
      "start_timestamp": "00:39:09",
      "start_timestamp_seconds": 2349.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=2349"
    }
  },
  {
    "text": "average we've been getting larger moves than expected last thing I want to take a look at here is a term structure let's see so so there's a bit of a peak that's kind of interesting because this is obviously wildly low relative 23 days what expiration is the 815 okay wow that is low that's real low so like this inversion is abnormal and then the tail side still heavier on the on the tails for the put side but not tremendously so okay synopsis what do we see in general looks like near term downside expectation longer term bullish expectation kind of the the gist okay and the last thing I wanted to take a look at before I open it up to whatever you want to look at so if there's specific stocks questions anything you want to talk about please start throwing in the chat now is the perfect time to start throwing that stuff in but I want to talk about this two things so for game stop we saw a couple really interesting things that as always I think game stop is a great general learning vector for markets and it is everything to do with the way that game stop behaves some of what it shows us and some of the anomalies that it also exhibits so one of the things that I'm noticing here is it obviously recently announced its conclusion of what was it 500 million so it did not use",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 41,
      "start_timestamp": "00:41:08",
      "start_timestamp_seconds": 2468.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=2468"
    }
  },
  {
    "text": "do with the way that game stop behaves some of what it shows us and some of the anomalies that it also exhibits so one of the things that I'm noticing here is it obviously recently announced its conclusion of what was it 500 million so it did not use the total capital it had allocated yet to purchase Bitcoin but it is absolutely building out its Bitcoin position now this big of a sell off is a little bit heavy but it does seem like the pricing for the Bitcoin transactions doesn't really look ideal so here you go you can see the the recent release it I want to get the right number of how much it was so it bought 4710 which it released obviously that that message today and the interesting thing about this is like not like top-ticking but it's definitely not getting Bitcoin at a discount like this is pretty damn high so the guess would obviously have to be that it was being phased in over the you know the last month or two I think the way that logically would flow so they really got in like pretty high and I am pleased to see that they didn't over expose themselves with Bitcoin price where it is right now that actually makes me happy and they've obviously given themselves a little bit of room to maneuver here which I think is really really important at this point and a big part of",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 41,
      "start_timestamp": "00:43:57",
      "start_timestamp_seconds": 2637.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=2637"
    }
  },
  {
    "text": "pleased to see that they didn't over expose themselves with Bitcoin price where it is right now that actually makes me happy and they've obviously given themselves a little bit of room to maneuver here which I think is really really important at this point and a big part of that is to give them just a little bit more flexibility I think by them having more flexibility with their positioning it gives them just a better opportunity to take advantage of things as they're moving along uh Jonathan says does the documents say exactly when no it doesn't say when we could take a look at the statement itself we'll see it in a little bit when they actually report but game stop Bitcoin investment who's right now everybody's trying to figure out how much they got it for let's see what this says this says 513 mil oh it says it's worth 513 million right and that is a purposeful framing because they don't know what the actual basis is so we'll see when earnings comes acquired 4710 let me see what the filing is let's see a bit coin uh gm e bit coin filing yep there she goes all of your questions answered in one spot yeah so the it says he and says they spend under 513 mil which is under 10 cash reserves could qualify for non material amount well it's again it's we don't we don't we don't know what they spend and",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 41,
      "start_timestamp": "00:45:36",
      "start_timestamp_seconds": 2736.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=2736"
    }
  },
  {
    "text": "she goes all of your questions answered in one spot yeah so the it says he and says they spend under 513 mil which is under 10 cash reserves could qualify for non material amount well it's again it's we don't we don't we don't know what they spend and it's just because it's like what this is saying is that it's worth this amount right now based on spot when this was written this doesn't mean that they got it at or below this it could have been above this actually during that most recent peak like again the way that I would generally speculate it is they probably built a position of 4710 likely over like a several week period versus just uh you know in outright bulk by but I think it's a what they got in my opinion it represents a good amount meaning not a good amount in that like it's a lot I don't mean it that way I mean a good amount in terms of like what this represents for game stop getting pretty good exposure but again not overexposing it and it gives them still more room to play now again the the other thing is I'm not personally super jazzed about them starting to load up on Bitcoin I don't think it's bad I don't think there's anything wrong with it but they they still are a brick and mortar company so they still need to do their their job and",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 41,
      "start_timestamp": "00:47:29",
      "start_timestamp_seconds": 2849.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=2849"
    }
  },
  {
    "text": "the other thing is I'm not personally super jazzed about them starting to load up on Bitcoin I don't think it's bad I don't think there's anything wrong with it but they they still are a brick and mortar company so they still need to do their their job and they still need to effectively continue doing what they're doing so if I'm not mistaken there was a recent release with uh recent interview let me see that I haven't seen yet at the Bitcoin conference all right so for this one I am going to keep the audio off because this one has a pretty high probability of killing us and we'll just watch the close captions but we are going to have to go faster okay okay innovative corporate strategies pioneering from a dying business thrive in business this is cool oh this is I'm gonna play the some of the audio existious looks cool I like what he's saying the company was a piece of crap and losing a lot of money the company um was under a lot of pressure moving from physical games to digital downloads so you have to cut costs yeah the cut costs uh very aggressively and bring in physical discipline I mean that's like literally so pertinent well let's see what he says and we can speed this up more hopefully you guys can read fast because I can um talks about the headwinds comfy being under pressure especially in the",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 41,
      "start_timestamp": "00:49:03",
      "start_timestamp_seconds": 2943.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=2943"
    }
  },
  {
    "text": "costs uh very aggressively and bring in physical discipline I mean that's like literally so pertinent well let's see what he says and we can speed this up more hopefully you guys can read fast because I can um talks about the headwinds comfy being under pressure especially in the industry need to cut costs why does it keep saying the same thing here we go we had to move from physical games to down those costs under control shift the business from being so relying on games to collectibles so that's actually a pretty big peak by the way the fact that they're talking about like a bigger emphasis on collectibles because I think for a lot of us that actually seemed a little bit like a side quest but this actually starts to make it look less like a side quest and way more like a primary um a like primary focus for them which I think is actually highly relevant big focus on trading cards grading the company is profitable in the US gotten cost under control can I speed this up more you can only go to two times damn damn Daniel I mean so far really nothing has been said which is a little frustrating because this is like a really short interview I would much much much prefer to see like much better qualitative input because effectively it's that we had to change the business these some of the things we did which is",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 41,
      "start_timestamp": "00:51:04",
      "start_timestamp_seconds": 3064.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=3064"
    }
  },
  {
    "text": "really nothing has been said which is a little frustrating because this is like a really short interview I would much much much prefer to see like much better qualitative input because effectively it's that we had to change the business these some of the things we did which is good like those are good points but it's just so rare to hear from him that I would love to get some substance so hopefully so now they're talking about the Bitcoin so he's saying that they bought Bitcoin he's saying that they own 4710 here you go ah smart this is a great way this is such a smart way to frame it where he's essentially saying that he's not using it for direct speculation but more for a hedge which I actually like this talking about storage in direct comparison to gold which is interesting and then he goes into asymmetric upside here we go so to no no surprise he essentially is saying we're not gonna we're not gonna say what we're doing ahead of time as they typically don't okay man damn it just feel like we could have got some better stuff out of that what a missed opportunity damn it so the summary from that essentially confirms the presence of Bitcoin it to me alludes to future purchase of Bitcoin likely because I think in general if they weren't going to buy more likely would have said it right but they didn't so my",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 41,
      "start_timestamp": "00:53:06",
      "start_timestamp_seconds": 3186.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=3186"
    }
  },
  {
    "text": "what a missed opportunity damn it so the summary from that essentially confirms the presence of Bitcoin it to me alludes to future purchase of Bitcoin likely because I think in general if they weren't going to buy more likely would have said it right but they didn't so my guess is that just gently alludes to the fact that they're probably gonna buy more um I would have loved to know more about the broader integration strategy for Bitcoin because he is effectively framed it in two things he framed it as a currency hedge and compared it against gold and then the second thing he talked about was potential asymmetric upside but the way that you position for those two things and the way that you manage the holding is actually quite different so I would have been like that would have been a great follow up if possible but understanding limited time and you know it is what it is that I'm sure the interviewer did did what he could but those are just some lingering questions I would have following that now the other thing I wanted to talk really quick about with GameStop before I just go to the chat for QA is we did see them confirm their earnings and funny enough this is one of those names where we had a hint that something was off with respect to when earnings was thought to have been versus when it actually was and we",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 41,
      "start_timestamp": "00:55:14",
      "start_timestamp_seconds": 3314.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=3314"
    }
  },
  {
    "text": "just go to the chat for QA is we did see them confirm their earnings and funny enough this is one of those names where we had a hint that something was off with respect to when earnings was thought to have been versus when it actually was and we talked about it actually a while ago and the options chain in terms of vol is pretty good at telling us where things are expected to be so now we can see that the overall earning or the the options chain itself has generally normalized at this point so I think we can effectively just apply standard options trading and specifically earnings training trading analysis and as it gets closer it's just too far out right now with it earnings at the 10th after the close so it'll be in the 13 June cycle here cool all right so what do we got? Ian says super curious about GameStop 4.5 million position the holder of the 530 36 calls expiring in two days is still holding can you verify slash heavier thoughts yeah let's take a look at it there's a couple things that have to be noted though is again we don't know and we don't know that that's one person we we really and it's unfair to make the assumption that it is now it's okay to you know speculate but it's a bit different and it's important to recognize those differences so this 30 may 36 calls",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 41,
      "start_timestamp": "00:56:37",
      "start_timestamp_seconds": 3397.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=3397"
    }
  },
  {
    "text": "again we don't know and we don't know that that's one person we we really and it's unfair to make the assumption that it is now it's okay to you know speculate but it's a bit different and it's important to recognize those differences so this 30 may 36 calls so the 36 calls huge purchasing actually this is the change in OI so let's take a look yeah so same thing there and it looks like it's across a few strikes because we can see that the 30s the 30 may also have the 41s going the 40s the 46s so they actually have a pretty big position across these and then the same thing with all the 30 mays here with people selling out or closing out of 39s 32s 33s and 30s so this looks like just of a lot of playing the front expiration and if you take a look at the volume for the front expiration cycle the volume shows a pretty big downside which is people closing stuff out current premium is at 23.3 mil well let's take a look at the I want to take a look at that expiration cycle the 30 may you let's take a look at those let's find those 36s you what the fuck oh let's just go into the I was curious if we could see any like sort of the the larger trades coming through but not so much so let's go back into here and",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 41,
      "start_timestamp": "00:58:00",
      "start_timestamp_seconds": 3480.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=3480"
    }
  },
  {
    "text": "may you let's take a look at those let's find those 36s you what the fuck oh let's just go into the I was curious if we could see any like sort of the the larger trades coming through but not so much so let's go back into here and let's just go into the option chain itself and let's take a look at what is this thing? Tabs alt all right let's find these 36s so OIs at 37, 85, 8 so the position got built here and that's where that 4.16 is talking about and it looks like there's been some sell-off and some of this sell-off absolutely represents larger than what the buys look like so some of these would be net net outflows and my guess here is that you'll probably see those come alive a little bit soon because I mean that's just the decent amount of money that's not looking great is what that boils down to the 36s so they would have got smashed today on that news literally trading for 24 25 cents at this point whereas the average fill here was at a dollar two so right now their trade is just looking their trade is looking awful they got absolutely smashed yeah the ass-side was 42 853 so just assuming most of that is one person whatever it is or whatever that entity is they just got smashed so yeah that's a pretty big that's a pretty big rollover for",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 41,
      "start_timestamp": "01:00:15",
      "start_timestamp_seconds": 3615.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=3615"
    }
  },
  {
    "text": "just looking their trade is looking awful they got absolutely smashed yeah the ass-side was 42 853 so just assuming most of that is one person whatever it is or whatever that entity is they just got smashed so yeah that's a pretty big that's a pretty big rollover for them which sucks okay Joseph, what up Joseph Joseph says must on attention deficit and Mr. Market reaction to his CEO responsibility and that of his political attention yeah that one's interesting because the market the market is very very interested in how Elon is spending his time I think that's actually more of a talking point than anything else and a lot of that has to do with the fact that Tesla itself is still broadly doing fine right like on a longer term time frame Tesla is still completely healthy here so I think that's become a bit of a talking point actually to try and get people to be concerned about Elon and how he's spending his time but he's always spent his time on a million different things so people that try to make it as if like the stuff that he's spending in doge is now directly coming out of just Tesla I actually think that's a pretty big mistake because that time is going to be spent on a bunch of different things right he's in and runs a lot of different companies so my guess more so is that it's something that's generally",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 41,
      "start_timestamp": "01:03:03",
      "start_timestamp_seconds": 3783.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=3783"
    }
  },
  {
    "text": "now directly coming out of just Tesla I actually think that's a pretty big mistake because that time is going to be spent on a bunch of different things right he's in and runs a lot of different companies so my guess more so is that it's something that's generally spread load so yeah I think it's more of a talking point than anything that the company itself still continues to do well and I actually think the company is insanely well positioned longer term especially for things like advanced robotics probably being the first actual full self driving car that's mainly adopted that kind of stuff and then the second from Joseph is GameStop Bitcoin as well as SBET and ETH that sentiment gaming and digital assets they don't follow that one I don't follow that one Lauren says you see the RC interview today oh that's funny yeah so so there we are um Joseph says also Kim F F I E let's see are you ready are you looking at the right thing are you referring to the reek here I mean I assume this isn't it because this this ain't got shit going on yeah assume this is not assume this is not the right thing let me try F F I E if F I E has no options I remember notices so not sure about those are Lauren says can you take a look at rocket lab for sure or KLB um um Joseph",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 41,
      "start_timestamp": "01:04:48",
      "start_timestamp_seconds": 3888.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=3888"
    }
  },
  {
    "text": "this is not assume this is not the right thing let me try F F I E if F I E has no options I remember notices so not sure about those are Lauren says can you take a look at rocket lab for sure or KLB um um Joseph says I was just citing some dude I don't know I have no idea who that is but F F I E doesn't have an option chain and that re has literally nothing going on so yeah I don't think at least for the reek that we were able to Kim K I M there is nothing there and then F F I E literally doesn't have options um okay back to rocket lab rocket lab rocket lab actually looks good with this break here I like this so this is kind of through the next larger volume node that it was able to crack through which I mean that's solid like that's a solid break above that so this generally looks like a pretty decent recovery rally well at least what I would consider to be like a pretty decent recovery rally um give me one sec my robot my robot is stuck one sec BRB all right we good um so yeah this looks good let's take a look at the options chain and let's see what's been going on all right start here I wish you could change the default on that would be way better get",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 41,
      "start_timestamp": "01:06:38",
      "start_timestamp_seconds": 3998.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=3998"
    }
  },
  {
    "text": "my robot is stuck one sec BRB all right we good um so yeah this looks good let's take a look at the options chain and let's see what's been going on all right start here I wish you could change the default on that would be way better get this looks like people that positioned pretty long calls but then it looks like a bunch of those are getting sold off it looks like this is actually pretty short cycle looks like this has happened quite a few times actually so this is pretty heavy unwind it looks like um rickie says my robot is stuck oh I have like a little robot vacuum so it's it's doing the lords work right now of vacuuming stuff uh Joseph says that dude is a legend gain 60 million on 4x yeah I have no idea I don't know anything about that dude um but yeah I mean like I said those two names you know object like the first name Kim literally has less than 6000 total options and then ffe literally doesn't have options so if there was a comment something about that for um ffe with anything related to options there are no options so there's nothing yeah there's nothing there might they might have just miss spoke or something maybe miss wrote the ticker maybe you didn't read the right ticker or something I don't know but oh Joseph says Kim keep in mind oh so then",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 41,
      "start_timestamp": "01:08:25",
      "start_timestamp_seconds": 4105.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=4105"
    }
  },
  {
    "text": "to options there are no options so there's nothing yeah there's nothing there might they might have just miss spoke or something maybe miss wrote the ticker maybe you didn't read the right ticker or something I don't know but oh Joseph says Kim keep in mind oh so then you are talking about ffe what I don't I don't really don't see options is it just is it an error with the platform? no yeah it's I am I'm confounded yeah my guess is we're we're missing something here because like there yeah there literally there's nothing we got we got nada all right back to right alive okay so near term we're seeing this cycle again of like buying calls selling them buying I'm selling them so that's playing the the short term price movement I think that's pretty clear let's take a look at where we're seeing oh man look at that I mean overall pretty heavy callscue across strikes with one peak at the seven puts and from oh I pretty heavy upside bias at least in terms of number of options let's take a look at premiums upside upside upside yeah I mean overall it would be cool if there was a way to do like a composite total call versus put premium let me see if there's a thing for that in here because that would be that's effectively what I'm doing with my eyes there usual whales have a view where you can",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 41,
      "start_timestamp": "01:10:28",
      "start_timestamp_seconds": 4228.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=4228"
    }
  },
  {
    "text": "would be cool if there was a way to do like a composite total call versus put premium let me see if there's a thing for that in here because that would be that's effectively what I'm doing with my eyes there usual whales have a view where you can see the total all input premium based on why because you can do it by expiration cycles but I wonder if there's a spot to do it all one that I just don't know about net premium oh that's cool where's that uh show me where that's at where is net premium oh is it talking on that main graph that main graph isn't that's not it you let's see it there not there net flow picker flow page is it interval flow net flow oh here we go this is great yeah cool this would be honestly really useful on that main page they should do that so let's see interesting now what I would have expected I mean those are like really heavy downside spikes 1.3 and 254 that huh I wouldn't have expected that that's a little more aggressive than I otherwise was seeing or killed be let's take a look at ball kind of flat to the upside kind of really flat to the upside and then let's just take a look at altas that's interesting so so there's a pretty decent amount of ball coming through on like the right out of the money calls",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 41,
      "start_timestamp": "01:13:01",
      "start_timestamp_seconds": 4381.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=4381"
    }
  },
  {
    "text": "let's take a look at ball kind of flat to the upside kind of really flat to the upside and then let's just take a look at altas that's interesting so so there's a pretty decent amount of ball coming through on like the right out of the money calls but it still puts you with respect to ball which we can see from that other the difference that's interesting here is that the call implied ball is like very flat I mean there's just not much of a difference here as you you have it's not until you get like out pretty far that you start to see it which is kind of interesting so it to me it looks like there's some pretty big short positions but in general it looks like it's a little bit more bullish positioned from like a technical perspective it's like this is a good consolidation this is a good breakout this is a good breakout so it does look like it's on a leg up I think I mean really the next place to be right is all time highs because it's already playing in this next volume node and there's already clearly an appetite because volume is expanding so the fact that there's a bit of sale volume today that can be from a million different things but there's definitely an appetite to transact here so yeah I mean it looks like it's in the middle of a like pretty decent",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 41,
      "start_timestamp": "01:16:10",
      "start_timestamp_seconds": 4570.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=4570"
    }
  },
  {
    "text": "clearly an appetite because volume is expanding so the fact that there's a bit of sale volume today that can be from a million different things but there's definitely an appetite to transact here so yeah I mean it looks like it's in the middle of a like pretty decent recovery rally that's more less what I see cool all right gang as always great catching up I'll see you all in the outlier community you could join cool free get around being all right see you guys later",
    "metadata": {
      "video_id": "6WloCMY-aTw",
      "title": "NVDA Earnings, TSLA Volatility, GME Earnings - Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=6WloCMY-aTw",
      "upload_date": "",
      "duration": 4730.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 41,
      "start_timestamp": "01:18:09",
      "start_timestamp_seconds": 4689.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=6WloCMY-aTw&t=4689"
    }
  }
]