[
  {
    "text": "What's up, outliers, two pieces for the market update today. I want to talk a little bit about the broad markets because there was a bit of a shakeup today. A lot of that has to do with Jackson Hole and some of the Fed comments we're seeing. Then the second thing is, you know, we're going to take a look at GameStop and see what's going on in there. Starting off with the broad market, bit of a down day, bit of a heavy down day. When I look across the various indices, you can see in the top left here, the SP 500, had a pretty moderate down day. It's essentially still just shy of where we were hitting previous highs. This has made the best relative recovery and starting to reject back down, but cues is still worse off. We can see cues about made it maybe 80 of the way, ish, back up to near term highs before it started rejecting down today. Then same thing for IWM, about maybe 60 of recovery back up to near term highs and another down day. So what I'm highlighting here first and foremost is that it was down across the board. Everybody was down today. If I were to peg where I saw relative weakness, it was in tech. You can see that by the sides of this candle compared to the others. You can also see that there's very little WIC. This was kind of a one-sided",
    "metadata": {
      "video_id": "78EjRKsvDQA",
      "title": "Market Reaction to Economic Data & GME Analysis",
      "url": "https://www.youtube.com/watch?v=78EjRKsvDQA",
      "upload_date": "",
      "duration": 581.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=78EjRKsvDQA&t=0"
    }
  },
  {
    "text": "across the board. Everybody was down today. If I were to peg where I saw relative weakness, it was in tech. You can see that by the sides of this candle compared to the others. You can also see that there's very little WIC. This was kind of a one-sided move. You can see that represented also in the volume that you see here today. IWM, a little bit more of a two-sided action with these little baby wicks on both sides. Then spy actually has a bigger tailwick to the downside and then a little baby one to the upside. So all I'm highlighting with talking about the WICs is simply that from a movement perspective, what we saw today in the cues was more decisive and one directional. Interestingly, net highs lows doesn't look bad. So net highs lows definitely contracted pretty meaningfully today in the cues. Yesterday, it was hovering around 112 net highs lows and today's about cut half to 62. So big drop there and for the New York stock exchange, it's kind of still cruising right along. It actually expanded net highs today. Sorry, misspoke. It didn't move much. Yesterday was 142 net highs and today was 136. So not really caring that much and it was gross lows. That stayed peg that 17. So the New York stock exchange right now is still pretty resilient, which is interesting to see small caps continue to be so troubled here. We also saw a down-tick",
    "metadata": {
      "video_id": "78EjRKsvDQA",
      "title": "Market Reaction to Economic Data & GME Analysis",
      "url": "https://www.youtube.com/watch?v=78EjRKsvDQA",
      "upload_date": "",
      "duration": 581.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=78EjRKsvDQA&t=0"
    }
  },
  {
    "text": "and today was 136. So not really caring that much and it was gross lows. That stayed peg that 17. So the New York stock exchange right now is still pretty resilient, which is interesting to see small caps continue to be so troubled here. We also saw a down-tick in bonds, which was really interesting. That came down to 1204 and VIX is up ever so slightly. So we're now starting to crack above 17 and a half. Again, I've talked to you guys about some of the way that I like to fade the VIX. Too early for me, I actually have a slightly long VIX position on right now in VIX futures. And it's literally just to offset some of the other index stuff I have on. And it'll probably come down pretty quick. I'm not really expecting volatility to start accelerating overly meaningfully here. Now, the other thing today is there's a bunch, a bunch of economic data and news that came out that I think we should take a quick look at together. So we can see jobless claims came in right on top of consensus. We can see that global manufacturing PMI came in a little bit light and services came in a little bit over expectations. So as I'm looking through this, it's a bit of a mix back today. And tomorrow we have Powell speaking, which will be really, really informative. I think the market is a little bit pensive here with",
    "metadata": {
      "video_id": "78EjRKsvDQA",
      "title": "Market Reaction to Economic Data & GME Analysis",
      "url": "https://www.youtube.com/watch?v=78EjRKsvDQA",
      "upload_date": "",
      "duration": 581.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=78EjRKsvDQA&t=0"
    }
  },
  {
    "text": "a little bit light and services came in a little bit over expectations. So as I'm looking through this, it's a bit of a mix back today. And tomorrow we have Powell speaking, which will be really, really informative. I think the market is a little bit pensive here with respect to how the economy is doing. We're continuing to see some mixed signals flowing in. And I think everybody is kind of waiting to see what this cut picture ultimately ends up looking like. So if I take a look at the Fed watch tool, surprisingly, the probability of a 25 basis point cut actually increased pretty massively, which I have to be honest with you, I didn't expect this. So for a while, we were trending a little heavier on the probability of a 50 basis point cut. And it's slowing down and it's moving further in favor of a 25 base point cut, which I imagine is kind of a little bit better news. I guess technically speaking, because it means that things aren't coming crashing down and we need to start, you know, reversing policy super fast, but it still surprises me just a little bit. So the next thing we got to take a look at, you already know it is the crowd favorite. GME volume, man, it's just not here. We are just not seeing volume yet. Volume today was 3.3 million. By volume was 150,000. Just sale volume is 3.2 million. So the",
    "metadata": {
      "video_id": "78EjRKsvDQA",
      "title": "Market Reaction to Economic Data & GME Analysis",
      "url": "https://www.youtube.com/watch?v=78EjRKsvDQA",
      "upload_date": "",
      "duration": 581.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=78EjRKsvDQA&t=0"
    }
  },
  {
    "text": "So the next thing we got to take a look at, you already know it is the crowd favorite. GME volume, man, it's just not here. We are just not seeing volume yet. Volume today was 3.3 million. By volume was 150,000. Just sale volume is 3.2 million. So the overwhelming majority of volume today was to the sales side. And that's not overly surprising, right? It is a fairly non-trivial down day for the market. One of the bigger down days we've seen year to date. So again, for context, if I grab IWM and I show you this candle today, it's to be clear, it's had plenty of big down days. But on a near term basis, this has been one of the larger down days that we've seen. And as I look across, it's especially IWM has had quite a few actually of these bigger down days. So maybe I'm thinking more so. Let me check Spy really quick. That's more so what I'm thinking because you can see Spy has definitely had a few of them here, here, here, here, that this day aligns with more, but it's probably like the top wind tile, like top 10 or so. Whereas IWM has been getting beat up a little bit more here, unfortunately, but it is consolidating. So that part's good. There wasn't some massive rejection today. Markets go two directions. And we've had this really aggressive move up and out a little less aggressive in something",
    "metadata": {
      "video_id": "78EjRKsvDQA",
      "title": "Market Reaction to Economic Data & GME Analysis",
      "url": "https://www.youtube.com/watch?v=78EjRKsvDQA",
      "upload_date": "",
      "duration": 581.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=78EjRKsvDQA&t=0"
    }
  },
  {
    "text": "10 or so. Whereas IWM has been getting beat up a little bit more here, unfortunately, but it is consolidating. So that part's good. There wasn't some massive rejection today. Markets go two directions. And we've had this really aggressive move up and out a little less aggressive in something like IWM. But all I'm saying in this context is we see some downward pressure, right? Take a look at the at the money, put call ratio 3.4 to one. So people really are kind of positioning very specifically in the product, at least for the front expiration or for the next primary expiration. Sorry. But when I look at something like GME, it's down today unsurprising 1.9, but that's not the end of the world considering the broader landscape of what's moving. So GME continues to consolidate. As long as I see it maintaining this consolidation movement, I really don't dislike that for it, because it's at least not getting rejected down to new lows. We're starting to arrive at a new consensus value for where people think this thing is a good buy at, which you can see coming through, like tons of people have been transacting in this 22 handle. So a quick stroll over to the options. And volume today was super light yet again. 65,000 calls against 15,000 puts still calls you, but just very light. This is again, very, very light for what we typically see in GameStop. And I'll continue to reiterate a",
    "metadata": {
      "video_id": "78EjRKsvDQA",
      "title": "Market Reaction to Economic Data & GME Analysis",
      "url": "https://www.youtube.com/watch?v=78EjRKsvDQA",
      "upload_date": "",
      "duration": 581.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=78EjRKsvDQA&t=0"
    }
  },
  {
    "text": "this 22 handle. So a quick stroll over to the options. And volume today was super light yet again. 65,000 calls against 15,000 puts still calls you, but just very light. This is again, very, very light for what we typically see in GameStop. And I'll continue to reiterate a few important points because when I see them change, that will be important. So you'll hear me say some of the same stuff, such as right now, I see the expiration all over the place, meaning current call input ally is scattered. For the put ally, there's a little bit of a drift to further and future explorations. Whereas so here you can see on the put side, the largest tranches are in 17, June 25. We see 18 oct 24. That's kind of the next biggest one here. We see 20 set. That's kind of the only 20 set you see out here. So for the put side, it's mostly kicked out into the future on the call side. It's a mixed bag, a little bit of all over the place. The other thing I told you, I'm continuing to keep an eyeball on, is this right here and this trade has actually been coming in nicely for me now on a really small scale, because it's not doing a whole lot. But I've been talking to you about this six step expectation that that wall will continue to increase the first time I was looking at it was",
    "metadata": {
      "video_id": "78EjRKsvDQA",
      "title": "Market Reaction to Economic Data & GME Analysis",
      "url": "https://www.youtube.com/watch?v=78EjRKsvDQA",
      "upload_date": "",
      "duration": 581.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=78EjRKsvDQA&t=0"
    }
  },
  {
    "text": "this trade has actually been coming in nicely for me now on a really small scale, because it's not doing a whole lot. But I've been talking to you about this six step expectation that that wall will continue to increase the first time I was looking at it was like mid 70s, trade out up to 78 79 now to 83, which is what I expect to see. I still expect to see the six step expiration cycle volatility continue to expand because that's right now when earnings is and I would expect to see the earnings cycle not necessarily to be like massively volatile, but much more than the others. And then this also popped up on my radar as a pure anomaly. You can see, Vol in what is this, the 27 set. Yeah, 27 set goes from 80.91 percent to four October 41.28 percent. So cut in half. And then 18 oct back up to 88 and a half. So that's another mispricing. I think that I'm waiting to see if it's literally just a print error or something that's a little more persistent tomorrow than I can trade. But just another volatility anomaly. So in this case, you could tell a lot of what I'm doing is trading vol in the product. And it's just because the delta, meaning directional movement of it, it's just not showing up in any significant force for the time being. So that's what I got for today. As always,",
    "metadata": {
      "video_id": "78EjRKsvDQA",
      "title": "Market Reaction to Economic Data & GME Analysis",
      "url": "https://www.youtube.com/watch?v=78EjRKsvDQA",
      "upload_date": "",
      "duration": 581.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=78EjRKsvDQA&t=0"
    }
  },
  {
    "text": "this case, you could tell a lot of what I'm doing is trading vol in the product. And it's just because the delta, meaning directional movement of it, it's just not showing up in any significant force for the time being. So that's what I got for today. As always, anything you want me to take a look at, let me know. There was a couple, um, people, couple things, people email to me. So I'm going to try to hit those in the live session later today at five PM Pacific time. So come hang out then if you're so inclined to talk a little bit more about the market specifically. But in the meantime, be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "78EjRKsvDQA",
      "title": "Market Reaction to Economic Data & GME Analysis",
      "url": "https://www.youtube.com/watch?v=78EjRKsvDQA",
      "upload_date": "",
      "duration": 581.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=78EjRKsvDQA&t=0"
    }
  }
]