[
  {
    "text": "What's up everybody welcome back to the outliers we are onto our next I forgot wrong camera I think we're over here. We're on the next options trading for beginner series and as you can tell I do have my crappy camera because these typically run 60 90 minutes ish there's no time frame necessarily it's whatever it is. But I have this so that I can stand up and sit down and stuff like that. So here's the rough agenda for what we have in store for us today. It will be a pretty heavy dose of analyzing options chains and then it will be a slightly lighter dose of building trades but I want to immediately start that process with you guys because there's a really important transition that happens with trading and really markets in general where there's a lot of theoretical learning that happens and we need to immediately as soon as possible make the pivot from theory to practical application. I actually think that's one of the reasons why I've been able to kind of create the success that I have with trading is because I never got to hung up on the theoretical side it's something that I learned in parallel with everything else and I want to be super clear what I mean by all of this it doesn't mean start trading real money. I actually think it's a giant mistake for the vast majority of options traders. I think the best possible",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 90,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=0"
    }
  },
  {
    "text": "it's something that I learned in parallel with everything else and I want to be super clear what I mean by all of this it doesn't mean start trading real money. I actually think it's a giant mistake for the vast majority of options traders. I think the best possible thing you could do and if I was giving advice to myself would be to start with paper trading. It's a super super unsexy answer and that's probably how you could tell it's the right one because most of the things that lead to positive outcomes tend not to be what we would rather do to get there. There's a lot of effort that goes into it and especially for kind of beginner options traders really would have boils down to is it's so easy to make a ton of dumb mistakes that we can avoid. So I actually think I have a video on kind of like a trade checklist. Let me see if I can find that real quick before I forget. Yeah, right here. So that video there is kind of like a options trading checklist. Yeah, I think that one's probably decent at least to give you guys something to start off with. I think making a checklist in the beginning is really useful and we'll kind of talk a little bit about that as we go through. So let's see who we got in the chat. It looks like we got Elongs. Elongs songs. I",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 90,
      "start_timestamp": "00:01:16",
      "start_timestamp_seconds": 76.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=76"
    }
  },
  {
    "text": "you guys something to start off with. I think making a checklist in the beginning is really useful and we'll kind of talk a little bit about that as we go through. So let's see who we got in the chat. It looks like we got Elongs. Elongs songs. I don't know if it's Elongs songs or Elongs songs. I'm going to go with long songs and not add an additional S that may or may not be there. I think it's a great way to see you and it looks like they made their way through part one and part two. That's perfect. That is the goal. And we're going to pick right up on part three for those that might have missed any of the other episodes. You can actually check the description to this and I'm linking them all together to make it easier and easier to find them. One of the things that I kind of pride myself in is organization. I very, very much prefer to be organized. So that is why you essentially will be able to find these things as we move along. So all of that aside, let's start talking a little bit about options. I want to first start with any specific questions that you guys have from specifically the previous sessions. So if there's anything that we talked about in one of our last episodes, one of the last two workshops, and there's something that you want to take a",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 90,
      "start_timestamp": "00:02:20",
      "start_timestamp_seconds": 140.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=140"
    }
  },
  {
    "text": "bit about options. I want to first start with any specific questions that you guys have from specifically the previous sessions. So if there's anything that we talked about in one of our last episodes, one of the last two workshops, and there's something that you want to take a look at. Let me know. Let's start there by clearing out any existing questions you can throw them in the chat. Obviously, I will take a look and the other kind of just general rules for the road is feel free to chat in at any point. There's some people actually that were giving me some flak for taking too many questions during the sessions, but honestly, like I don't care. That's why I'm doing it during a YouTube live session is to interact with you guys. I have a video coming out. I think sometimes next month that's I forgot how long it is. It's like an hour or 90 minutes that I just shot straight all the way through on like an introduction to options trading. So for the people that really prefer a more end to end discrete process that's coming out next month, I have an old video as well that I can throw in here in the meantime. It's just a old video. It's not bad. The content at least. I always make that differentiation is because even the old stuff that I have, I think, has generally good content, but it's the, you know,",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 90,
      "start_timestamp": "00:03:24",
      "start_timestamp_seconds": 204.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=204"
    }
  },
  {
    "text": "old video as well that I can throw in here in the meantime. It's just a old video. It's not bad. The content at least. I always make that differentiation is because even the old stuff that I have, I think, has generally good content, but it's the, you know, the old production cycle is not great. It's still not great. I'm not a YouTuber, man. Like I'm here to share information. That's my that's my get up and my get down. All right. Let's see who else we got in the chat. We got J. Hey, that's a familiar name. Good to see you. Shrej. I'm more familiar name, same thing with wise owl. Another familiar name. I just spent my day battling the degenerate gambler, me, SMCI is so sexy for some quick thrills. Yeah, that's probably true. And I also think if we take a look real quick at SMCI, I had a couple alerts set in here. I actually need to re institute this one. Because I do like SMCI a lot. And for kind of a general trading thing, right, to we'll start right off on the practical side of things as I was alluding to before. This is a really common and effective pattern to trade where a booming stock goes through typically a really strong drawn out up move 30 to 60 price appreciation generally along in there. There's a catalyst of some sort, some sort of really hot earnings like this one,",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 90,
      "start_timestamp": "00:04:26",
      "start_timestamp_seconds": 266.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=266"
    }
  },
  {
    "text": "to before. This is a really common and effective pattern to trade where a booming stock goes through typically a really strong drawn out up move 30 to 60 price appreciation generally along in there. There's a catalyst of some sort, some sort of really hot earnings like this one, as you could tell. And then the stock will trend sideways anywhere from two to 12 weeks. And you kind of just follow it while it's going through this sideways trending thing, keeping a really close eye on how consolidated it gets. If we're starting to see higher relative lows and how many times we're touching near-term resistance, all that kind of stuff. And for me, this is a quintessential momentum breakout candidate. And I would bet dollars to donuts, it will break out to the upside. Nobody knows. I want to be super clear because I know there's beginners in here. You have to be really careful when people pontificate about what they think or what they know is going to happen. Nobody knows. So whenever I say probabilities and stuff like that, very probable that's in my probabilistic assessment of things to be abundantly clear. Don't listen to anybody says about what they think is going to happen. The only opinion that matters is your own. Okay. That aside, I think it's going to go up. The punchline to that, especially with this earnings coming up, which is interesting. But yeah, SMCI looks really good. Employee volatility percentile",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 90,
      "start_timestamp": "00:05:38",
      "start_timestamp_seconds": 338.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=338"
    }
  },
  {
    "text": "anybody says about what they think is going to happen. The only opinion that matters is your own. Okay. That aside, I think it's going to go up. The punchline to that, especially with this earnings coming up, which is interesting. But yeah, SMCI looks really good. Employee volatility percentile is nice and jacked up over 65. This is another great learning point for you all. We covered this a little bit, I think, previously. The difference between implied volatility percentile and implied volatility rank. But these are just different ways to plot the relative volatility of a product against itself, which is a really important process. Because you can have something like, let's look at GE. GE has 30 volatility. So not a ton, but take a look at the implied volatility percentile. It's 70. So what this means is on a relative basis, it's quite volatile relative to itself. But if we go back to SMCI, this has 82 volatility so much higher volatility yet as a lower volatility percentile. So again, that's why the conversation of relative volatility becomes super important, which again, we'll talk a little bit about before. We also have cricket core, cricket core, cool name. It looks like they just joined the discord in the pro. That's awesome. Welcome in. Let me see if we got you. We do. Let me make sure that you are all set up in here. And then we also have, there we go. Abdulaz says, hey, is",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 90,
      "start_timestamp": "00:06:49",
      "start_timestamp_seconds": 409.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=409"
    }
  },
  {
    "text": "cool name. It looks like they just joined the discord in the pro. That's awesome. Welcome in. Let me see if we got you. We do. Let me make sure that you are all set up in here. And then we also have, there we go. Abdulaz says, hey, is high higher IV better? That's literally a fantastic question. And the answer to most of the things you're going to hear me talk about with respect to trading in general is it depends. It heavily depends. So most things in trading are not inherently good or bad. It depends on what side you are of the effect and what your overall disposition is. So here's the way to think about it. High implied volatility or just implied volatility in general, I would completely detach it from the ideas of good and bad. And I would qualify implied volatility by itself. And then there are different strategies that will benefit from it. There are different strategies that will hurt from it. Right? So then that good and bad becomes qualitative based on what you're doing. So what does high implied volatility tell us? Very, very simple. Volatility is a financial term of variance. What we're looking at is the dispersion from some sort of mean that's time bound. That's what creates this volatility thing that we're looking at. So when you see things that have high volatility, it means that we're expecting to see greater dispersion from a mean of some",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 90,
      "start_timestamp": "00:08:08",
      "start_timestamp_seconds": 488.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=488"
    }
  },
  {
    "text": "of variance. What we're looking at is the dispersion from some sort of mean that's time bound. That's what creates this volatility thing that we're looking at. So when you see things that have high volatility, it means that we're expecting to see greater dispersion from a mean of some sort. So let's take a look at a example right now. If we take a look at SMCI and we look at these, these are called linear regression channels. It essentially waits the sizes of the moves so that 50 and 100 of the moves will fall within these bands. You can kind of loosely use them as standard deviation channels. The reason why I like these is because they're not arbitrary. They're built off of existing price as it is. So if you overlay something like standard deviation channels with linear regression channels, a lot of times they'll line up very, very close. Sometimes they'll be very disparate. So I prefer linear regression channels for those reasons. Now if we look at something like SMCI, you'll see that again, really high implied volatility, 82. So if I take a look at 275, which was the low, and then it hit high of 1229, the massive move, volatility is an indication of how much we think something is going to move. Now volatility has different forms. I actually think I have this, let me see real quick, just for a quick recap. I have the old presentation that I gave",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 90,
      "start_timestamp": "00:09:40",
      "start_timestamp_seconds": 580.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=580"
    }
  },
  {
    "text": "hit high of 1229, the massive move, volatility is an indication of how much we think something is going to move. Now volatility has different forms. I actually think I have this, let me see real quick, just for a quick recap. I have the old presentation that I gave you guys this one. Because I also added something to it, which is a great segue because one of the things I want to talk to you guys about is funny enough. I gave you guys a couple thought exercises in here because I want to start highlighting a lot of the flaws with the standard person's way of thinking compared to what it needs to be for trading. So you can forecast volatility, which is forward looking. Most retail traders are not doing this carte launch. And the reason for that is because there's a lot that goes into forecasting volatility accurately. Anybody can forecast it. You literally can look at previous price moves and come up with a guess of where you think the range might be going forward. But the entire name of the game is how accurate is it? So retail traders in general aren't super worried about forecast volatility, but you should know it exists because the people who do forecast volatility market makers, folks like that, they implant that essentially into pricing models. That's how they determine what they're going to offer options premiums at. And we on the retail side observe it through",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 90,
      "start_timestamp": "00:10:50",
      "start_timestamp_seconds": 650.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=650"
    }
  },
  {
    "text": "worried about forecast volatility, but you should know it exists because the people who do forecast volatility market makers, folks like that, they implant that essentially into pricing models. That's how they determine what they're going to offer options premiums at. And we on the retail side observe it through implied volatility. This is the volatility that is implied through the options pricing. You can use something like the Black Sholes Merton model to pull out what the forecasted volatility is by whoever forecasted it to see what it is. So in this case, when we're looking at this specifically implied volatility, that's what this is. It's looking at whatever the market consensus is for forecast volatility for this product, which is forward looking forward looking volatility. The standard is 30 days. It changes kind of all the time. Charlie, welcome to outlier bronze. Great to have you. So essentially what this means is going forward. How much do we think something is going to move? That's pretty much it. So going all the way back to your original question of is high volatility good or bad? Well, in general for options traders, whether you're buying or selling, we typically prefer more volatility because that's you need things to move. Even if you're buying volatility and it's expensive, which means on a relative basis, you're overpaying for the exposure that you're getting, you still want the product to move. So you might be overpaying in terms of vols priced into",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 90,
      "start_timestamp": "00:12:02",
      "start_timestamp_seconds": 722.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=722"
    }
  },
  {
    "text": "prefer more volatility because that's you need things to move. Even if you're buying volatility and it's expensive, which means on a relative basis, you're overpaying for the exposure that you're getting, you still want the product to move. So you might be overpaying in terms of vols priced into the premiums, but if you get really big moves, you can make a lot of money. Now it's not always the case though, because some of the best times to sell volatility, selling options to capture volatility is actually when volatility is low. Because a lot of people will hear kind of the tasty trade methodology of if volatility is high, you sell premium. And it's not bad. There's it's an okay way to think about it and it'll get you there most of the time. But the reason why it's not ideal is because don't worry about the white line so much here. Take a look at these two yellow lines. These are two different term volatilities. The darkest 30 days, the seven I think right now, let me confirm for you. I think it's two days. Yes, two day vol. So in this case, you'll find that there are periods where implied volatility might be high on a relative basis. It's elevated here. But if the realized move is even higher, you still lose money selling vol. So when implied volatility is high, the reason why they use that generality of if volatiles sell premium is because the",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 90,
      "start_timestamp": "00:13:14",
      "start_timestamp_seconds": 794.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=794"
    }
  },
  {
    "text": "are periods where implied volatility might be high on a relative basis. It's elevated here. But if the realized move is even higher, you still lose money selling vol. So when implied volatility is high, the reason why they use that generality of if volatiles sell premium is because the in the long run in total, typically when implied volatility trends over realized volatility, that relationship can get even more skewed if implied volatility is high. But there's a danger. If you sell volatility when volatility is high, it means whatever you're trading is probably going to move a lot. And that can hurt if it happens to move in a trending direction one way or the other and you're on the wrong side of it. So it's like most of this stuff, a bit of a long winded and nuanced answer, but that's because I'm not trying to give you guys the easy answers. The easy answer to that would have been yes, we want volatility high because stuff moves. That's the short succinct answer. But as you can tell from that entire thing I went through, there is a lot of subsequent detail that goes into actually arriving at what I would consider to be a legitimately accurate answer, which is what I can't just care to share with you guys. We also have Charlie McMichael. That's a hilarious last name to be honest that joined outlier bronze great to have you as well. Carlos says easy answer",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 90,
      "start_timestamp": "00:14:27",
      "start_timestamp_seconds": 867.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=867"
    }
  },
  {
    "text": "at what I would consider to be a legitimately accurate answer, which is what I can't just care to share with you guys. We also have Charlie McMichael. That's a hilarious last name to be honest that joined outlier bronze great to have you as well. Carlos says easy answer is yellow all of your money at high volatility. That is an easy answer. Yeah, I think if I were to think about trying to break down the world of options trading into the simplest simplest thing, I think that's probably right. You like where your head's out there. Okay. There was another question up here that I don't want to miss. So C. Lee, that's a cool name. Are there any signs between all the Greeks that can give insight when an option is priced in our favor? I get Delta and theta but have trouble incorporating Vega and gamma. That's hilarious. You know, you do know why that's so hilarious because look what I have is the first thing that we're going to talk about. You guys are getting a little too good at essentially creating the segues for us. But that's actually exactly what I want to talk about. Now in terms of option pricing in your favor, there can be instances again, depending on what you're trying to do. And again, it's a very nuanced answer. So what I would prefer to do instead is talk about these different aspects of an options price. And what",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 90,
      "start_timestamp": "00:15:39",
      "start_timestamp_seconds": 939.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=939"
    }
  },
  {
    "text": "talk about. Now in terms of option pricing in your favor, there can be instances again, depending on what you're trying to do. And again, it's a very nuanced answer. So what I would prefer to do instead is talk about these different aspects of an options price. And what I would love to do is actually spend a little bit of time talking about how to think about them. And the reason why I want to spend the time thinking about them is so that you understand how to wait the decisions you're making because here's the deal. Whenever you're looking to buy a stock, for example, let's say SMCI because we have SMCI up and you say, I want to buy this stock. I think it's going up to really simple analysis. You go through your technical, fundamental analysis and then you say, I'm going to buy the stock. That's it. You have one thing to buy and it's done. Options add a lot of complexity. There's a trade off of the complexity. You can make money from different market forces. You can make money even if things go slightly against you. You gain access to leverage. You can trade on margin or with margin, not on margin. So there's a lot of benefits with options, but they do add complexity. So if we take a look now at this idea of buying SMCI and we pop over here and now we're looking at the world of options.",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 90,
      "start_timestamp": "00:16:44",
      "start_timestamp_seconds": 1004.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1004"
    }
  },
  {
    "text": "can trade on margin or with margin, not on margin. So there's a lot of benefits with options, but they do add complexity. So if we take a look now at this idea of buying SMCI and we pop over here and now we're looking at the world of options. That's the first thing. Well, first we have to figure out what expiration cycle we're going to pick. You don't have to pick that with stock. With stock, you just come up here and you say, okay, the offer right now is 898.75. I'm chill with that and you buy it and then you're done and you move on. There's literally, we have to do a bunch more steps with options. And that's actually the goal of walking through these is I want to walk you through a really loose framework on how you can think about all of these and make an efficient decision. And really all we need to do for that is understand the trade offs that come with each of these. This is the beautiful part and the difficult part with options. It's difficult because there's more things we have to think about. But the beautiful part is rather than trading a stock that when I put that trade on, it's going to go up or go down and I have a one for one move with the underlying itself. I have the opportunity to structure something that behaves exactly how I want, exactly how I",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 90,
      "start_timestamp": "00:17:55",
      "start_timestamp_seconds": 1075.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1075"
    }
  },
  {
    "text": "part is rather than trading a stock that when I put that trade on, it's going to go up or go down and I have a one for one move with the underlying itself. I have the opportunity to structure something that behaves exactly how I want, exactly how I want. You can't do that with stock. So let's start with this idea of days to expiration and also Carlos, my man, big to everybody knows they're supposed to hit the like button. That's what actually helps us emerge from the depths of the YouTube algorithm, which is one of my goals to try and bring this information to more people. So thank you, Carlos. All right, so days to expiration. What's the trade off here? Let's take a look. If we think about and actually one, sorry, one more quick admin note on this, I just recently made a video on buying call options smarter, which I'm going to drop that in here for you guys. It's just a reference and that walks through really more from the call buying perspective a little bit about this. And it's probably a good reference for you guys on the idea of how to think about some of these criteria. We're going to go a little bit more in detail here, though. All right. So days to expiration, we have zero all the way out to 574 in this case. The very first thing to think about is how does time impact",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 90,
      "start_timestamp": "00:19:04",
      "start_timestamp_seconds": 1144.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1144"
    }
  },
  {
    "text": "how to think about some of these criteria. We're going to go a little bit more in detail here, though. All right. So days to expiration, we have zero all the way out to 574 in this case. The very first thing to think about is how does time impact these contracts? And if you know some of the ways that time impacts these contracts, throw it in the chat as I go through it. Kind of a way to assess your own understanding. And then I'll take a look at what you guys think. So the very first thing near term, explorations, they expire faster. Yep. No shit Sherlock needs to be said the further out and time you go, the longer your positions have to work. That could be a good thing or that could be a bad thing. If you're trying to play a short term move, going super far out in time, it not makes sense. So again, it has to be in the context of whatever you're attempting to structure as your position, but there are components to DTE that remain the same no matter what you're trying to do like that one right there. If you go further out in time, the position will have longer to work. So then you have to determine what's the amount of right amount of time for your position. The next thing, the further out in time you go, the more X-transic value an option is going to",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 90,
      "start_timestamp": "00:20:10",
      "start_timestamp_seconds": 1210.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1210"
    }
  },
  {
    "text": "If you go further out in time, the position will have longer to work. So then you have to determine what's the amount of right amount of time for your position. The next thing, the further out in time you go, the more X-transic value an option is going to have. Why is that? Well, because if you'll recall, in options premium has two components. It has intrinsic, if it's in the money, and it has extrinsic, which is all time value. We know that all options expire. So sooner or later, all of the extrinsic value is going to go away, all of it. So if you go further out in time, these options will have way more X-transic value because the contract spans a longer duration. As we get closer and closer to expiration, X-transic value declines, and it starts to decline precipitously within 60 DTE. And again, for a quick refresh on this, you guys can take a look at that. So as you can see, data decay, this is for at the money options. If we take a look, once we start crossing within 60 days to expiration, the amount of X-transic value starts declining massively. That's theta decay. That is, all of the X-transic value starting to bleed out of the options super fast because going back to what we were just talking about, all options expire. And if it's coming up on expiration, whether it's in the money or out of the money, it",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 90,
      "start_timestamp": "00:21:15",
      "start_timestamp_seconds": 1275.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1275"
    }
  },
  {
    "text": "That's theta decay. That is, all of the X-transic value starting to bleed out of the options super fast because going back to what we were just talking about, all options expire. And if it's coming up on expiration, whether it's in the money or out of the money, it doesn't matter, all of the X-transic value has to go away. Because there's no more time left in the contract. So the other component to think about here is how expensive the option is. So you can probably reason your way through this component. If you have a contract that spans a longer time frame, those options probably will be worth a little bit more on a relative basis. And we can prove this out. I'm going to move us away from SMCI into spy. Just because I want to use something that's a little bit cheaper so that it's easier to see. Because with SMCI, as you were noticing in the option chain, the numbers were really compressed because it's a big product. There's a lot of numbers. So if we look at spy and let's look at a 30 delta and be clear, these will still, after today, these will have no X-transic value at all. It's just because we're coming up on expiration. But the 31 delta has 10 cents. It's bid at 10 offered at 11. So 10 and a half technically, you can't trade at that though. As an options trader, you can only go",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 90,
      "start_timestamp": "00:22:39",
      "start_timestamp_seconds": 1359.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1359"
    }
  },
  {
    "text": "these will have no X-transic value at all. It's just because we're coming up on expiration. But the 31 delta has 10 cents. It's bid at 10 offered at 11. So 10 and a half technically, you can't trade at that though. As an options trader, you can only go out to two digits. So let's go out now a week. And let's find that 30 delta again, same 30 delta. Now they have 144. 1.44, remember options work in 100 lot contracts. For 100 share contracts, redact that last thing. That's super wrong. A lot, one lot represents 100 shares. You want to be super clear there. Try not to steer anybody in the wrong direction. But notice how much more these are worth at the same delta because there's way more time. And just to drive the point home further, let's go out 364 days. Let's find us again, that 30 delta ish. These have 13.15, 16 cents, something like that. So way more X-transic value because these have way more time. That's your first trade off. That's the very first thing you need to look at as an options trader is what days, expiration makes sense. And I just gave you a list of the primary trade offs. We now will have to integrate some of these other Greeks to see how they behave with respect to delta because this is also going to be part of the conversation. All right, let's see what the guesses are",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 90,
      "start_timestamp": "00:23:42",
      "start_timestamp_seconds": 1422.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1422"
    }
  },
  {
    "text": "I just gave you a list of the primary trade offs. We now will have to integrate some of these other Greeks to see how they behave with respect to delta because this is also going to be part of the conversation. All right, let's see what the guesses are so far. In your comments, Carlos says, not going to lie, don't know much about the Greeks, but I love trading options. So I'm here to learn how's perfect, man. This is exactly what this is all about. The Greeks, they sound way, well, one, fun fact, they're not even all Greek letters. We just call them Greeks, which I find entertaining. Second thing is it sounds complex and it's a little bit different, but it's like anything else. Once you understand the general rules, it's really, really not that bad. And for those wondering, we got two beverages tonight. The first one we're rocking with is a spin drift raspberry lime. This one's pretty good. I like the orange one way better. And then we have a good old croaker watermelon, celtzer water, ready to rock and roll in reserve. So we are, we're here. We're here with everything we could possibly need, essentially to last in eternity, talking about some options. Jay says increased DTE means more extrinsic value that's perfect. Data will tend to be lower. That's also perfect. But because there's more time, vaults, it will be higher and so will row. Literally perfect. Jay, if",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 90,
      "start_timestamp": "00:25:02",
      "start_timestamp_seconds": 1502.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1502"
    }
  },
  {
    "text": "we could possibly need, essentially to last in eternity, talking about some options. Jay says increased DTE means more extrinsic value that's perfect. Data will tend to be lower. That's also perfect. But because there's more time, vaults, it will be higher and so will row. Literally perfect. Jay, if I'm not mistaken, you're relatively new to options, aren't you? Because so far, like that's literally perfect. We got to take the socks off because it's getting warm in the office. That's what that little maneuver was. But that's literally perfect. Jay, that's exactly correct. Jay says he started a few weeks ago. That's awesome. Like that's, I'm really, really happy with that answer. And anybody in here, Ty, being one of them, like Ty went through a couple, like options traders for beginner series with me where I did like smaller groups with like just a handful of people. And anybody that knows the way I trade or even talk about options is I'm real, real picky about the details. And it's because I genuinely believe that's where a lot of money is to be made in markets is in the details. So I like that answer. Jayden says I feel like as a new trader options, those shorter term explorations seem so much more lucrative considering the cost. It's a great, great, great, great, great question. Flash statement, I guess I should say. Because you're not wrong. In terms of the percent return capable, it's very different. So",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 90,
      "start_timestamp": "00:26:11",
      "start_timestamp_seconds": 1571.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1571"
    }
  },
  {
    "text": "I feel like as a new trader options, those shorter term explorations seem so much more lucrative considering the cost. It's a great, great, great, great, great question. Flash statement, I guess I should say. Because you're not wrong. In terms of the percent return capable, it's very different. So like, let's say, for example, we got seven days in spy and let's say that we go to like a 20 delta something like this. And let's say that you buy these 84 delta options. You're only paying 84 bucks, which is, you're paying 84 to control 21 shares of spy, which is at 544. And I'm not good at math for Marines. So again, you're paying 84 dollars to control 24 shares of something that's at 544, 51, 13,068 bucks. That's your notional exposure in this position. So you're controlling 13,000 dollars. You literally put up 80. So yeah, that's massive leverage. And if you get a big move in your favor in these compound a lot, you're also absolutely correct. You can make quite a lot of money here. There are a couple of big problems though, which we'll talk about. I guess we can skip to it because it's on here. It's just a little further down. So we're going to go from DTE to theta, kind of falls into the rest of these realistically. So this will be our first stand up of the session. We are rising up. So let's take a look at what",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 90,
      "start_timestamp": "00:27:27",
      "start_timestamp_seconds": 1647.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1647"
    }
  },
  {
    "text": "because it's on here. It's just a little further down. So we're going to go from DTE to theta, kind of falls into the rest of these realistically. So this will be our first stand up of the session. We are rising up. So let's take a look at what this looks like then. If we know that these kind of closer to expiration options look really, really lucrative, you can make a bunch of money pretty quick. Who doesn't want to make a bunch of money pretty quick? I know I do. And here is the trick. I want you to look at this column here. This column is called theta. And this is the amount of time value, extrinsic value, that's going to bleed out of these options after the passage of one day. Now a common question people ask is, is this like a discrete figure? Meaning does this work all at once? Or is this something that, you know, it's kind of a continual movement? And it is continual, which is really, really important to know. The reason why it's so important to know is because with something like this that is continual, there's not a massive opportunity to put on a trade and capture, you know, days worth of theta decay. It doesn't quite work as discreetly as that. So the way to think about theta decay is it's perpetual. This is just showing you how much it will lose over the course of that",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 90,
      "start_timestamp": "00:28:48",
      "start_timestamp_seconds": 1728.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1728"
    }
  },
  {
    "text": "massive opportunity to put on a trade and capture, you know, days worth of theta decay. It doesn't quite work as discreetly as that. So the way to think about theta decay is it's perpetual. This is just showing you how much it will lose over the course of that time frame of that entire window. Now seven days to expiration, we already know now that options have to make a big choice as they get closer to expiration and get ready to expire. They're either going to be in the money or out of the money. We'll talk about delta in a second. But what does that mean in terms of the remaining theta decay? It's got to go away. So if I look at something like this here, 21 delta, and the reason why I use delta is it's just a way to kind of pick a common language to look at these different products. So looking at this 21 delta, that you paid 84 cents for on a daily basis, it's going to lose 18. So again, a little bit of math for Marines here. Let's take a look at 18 divided by 84, which is the total cost of the position. So on a, as one day passes, this seven DTE option is going to bleed 21.4 of its options premium gone. It's going to bleed off. So 24 of the premium you paid is going to be gone. Seteris parabas, meaning everything else remaining the",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 90,
      "start_timestamp": "00:30:02",
      "start_timestamp_seconds": 1802.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1802"
    }
  },
  {
    "text": "total cost of the position. So on a, as one day passes, this seven DTE option is going to bleed 21.4 of its options premium gone. It's going to bleed off. So 24 of the premium you paid is going to be gone. Seteris parabas, meaning everything else remaining the same after one day passes. So that's the tricky part about how lucrative they may or may not be because while they're cheap, they decay super, super fast. So let's go further out in time. Let's take a look at these 90 DTEs and we used a 21 delta before, right? So let's use, we'll even use a slightly higher delta, which will have a higher theta decay technically. And we take a look at the theta decay here. It's seven cents and that's like, well, okay, that's actually kind of not that far off from what we saw in here at 70 T, 70 T, 21. It was 18 cents here. It's again less than half, but it's still not cheap 7 every single day. Let's look at how much time value is left in these options. Let's call it 3.86. So if you take the 7 that you're going to bleed off every day, you divide that by 386 ish, that comes out to 1.8 of the options premium is going to bleed off in these 21 DTE calls as well, 23. And again, this would be even higher technically because it's slightly closer to the money. Which",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 90,
      "start_timestamp": "00:31:10",
      "start_timestamp_seconds": 1870.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1870"
    }
  },
  {
    "text": "going to bleed off every day, you divide that by 386 ish, that comes out to 1.8 of the options premium is going to bleed off in these 21 DTE calls as well, 23. And again, this would be even higher technically because it's slightly closer to the money. Which 21 DTE's if they were offered would be probably 0.6 as my guess. So even lower still. But the main point I'm highlighting is even something with a higher delta will decay less quickly. Really, really important to understand these kinds of concepts when it comes to options. Because now we have a second input into our decision model. First input is how long do we want to give the option to work and how much do we want to pay for it the further out in time ago, the more expensive it is. Now we have a second input the further out in time we go, we know that theta decay as a percentage of the premium is less. The other thing to keep in mind, however, is when we're looking at something like this, you have way more total principle at risk. Because again, coming all the way back into these 70 DTEs, you're buying these options for 84 cents. That's the amount of money you're putting out. That's your total risk if you buy these calls. If we go all the way out here to 91 DTE and again, we get close to that 20 delta, you're",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 90,
      "start_timestamp": "00:32:27",
      "start_timestamp_seconds": 1947.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=1947"
    }
  },
  {
    "text": "back into these 70 DTEs, you're buying these options for 84 cents. That's the amount of money you're putting out. That's your total risk if you buy these calls. If we go all the way out here to 91 DTE and again, we get close to that 20 delta, you're paying now 386 cents. So these are more expensive. You have more value at risk. Again, that doesn't mean that you're going to lose it all. And that's one of the things that I think people run into a giant mistake when it comes to trading options. Because they essentially establish these positions and then they just expect to just let them go and come all the way to expiration, which I actually think is a massive mistake. I'm going to open my door real quick. One of the funny things about dogs is that they're exceedingly patient. So my dog was just sitting there doing like one little paw scratch on the door, just one at a time like that. So another thing we have to know about theta is it is highest for at the money options. Again, we talked about this, I think in part two. So I'm not going to go through this in as much detail as I did in the other video because we already kind of talked about some of this stuff. But just know quick recap, theta is highest for at the money options across all expiration cycles. As you go deeper",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 90,
      "start_timestamp": "00:33:41",
      "start_timestamp_seconds": 2021.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2021"
    }
  },
  {
    "text": "I'm not going to go through this in as much detail as I did in the other video because we already kind of talked about some of this stuff. But just know quick recap, theta is highest for at the money options across all expiration cycles. As you go deeper in the money, there's less extrinsic value at entry. And as you go further out of the money, there's less extrinsic value at entry. The reason why at entry is so important is because let's say for example, you buy these really deep in the money calls and let's say you pay 7,350 bucks for them, something like that. You might be like, okay, well, there's only 1.84, 184 of that 7,300 bucks that can decay away. So I don't care so much about the decay. I'm okay with that. That's not that much to control that large of a position for that long. The downside here is if for whatever reason, these options start to fall out of the money. Now you can go from your 184 of extrinsic value to 1,700 of extrinsic value. That not only includes the overall premium of your options decreasing, but that also includes then the entire remaining premium potentially decaying away. Have to again, find the right balance here. One of the things I want to remind people is that once you place an option's trade, you're not stuck. Also, yeah, you're not stuck at all. You can trade in and out",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 90,
      "start_timestamp": "00:34:52",
      "start_timestamp_seconds": 2092.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2092"
    }
  },
  {
    "text": "includes then the entire remaining premium potentially decaying away. Have to again, find the right balance here. One of the things I want to remind people is that once you place an option's trade, you're not stuck. Also, yeah, you're not stuck at all. You can trade in and out depending on what the underlying does, which I think is again, really important for people to know as you look at these things. All right. We talked about DTE. We talked about theta. I'll take a pause there for questions and I'm jumping in the chat to see what we're looking at. Pollo says, can and should you use the Greeks to decide when to exit a position? It should absolutely be part of it. The Greeks help us understand how our remaining position is going to behave. That's not inherently the deciding factor in my opinion. The price action and what you expect to happen in the underlying is way more important. For example, if I'm looking at something like spy and I put on a bullish position, the primary reason why I may get or get out of the trade or add more or do whatever is depending on what the price does compared to my assessment. If I put on a bullish position, I think it's going to go up and it goes down, then it doesn't really matter what the Greeks are. My thesis is wrong. What I thought was going to happen is wrong. That",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 90,
      "start_timestamp": "00:36:02",
      "start_timestamp_seconds": 2162.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2162"
    }
  },
  {
    "text": "on what the price does compared to my assessment. If I put on a bullish position, I think it's going to go up and it goes down, then it doesn't really matter what the Greeks are. My thesis is wrong. What I thought was going to happen is wrong. That right there is probably the most important thing to start with. To help with that, let me grab another video for you guys that I did recently that talks about this exact thing. I'm going to drop this in the chat for you all. That video is essentially about how to create a consistently profitable option strategy and the entire premise of that entire video is making sure that you have good alignment. We're going to talk about that a little bit later in this video as well in terms of building a strategy and managing a strategy around and underlying. It's a great question. Ryan says, does theta decay only happen each day or also in today? It happens 24-7. Theta decay is perpetual. The options markets don't always show the movement itself, but it's perpetual. The other thing people don't understand is the way that market makers will structure their trades, it's very, very thoughtful. One of the things that they're looking for is, say, for example, we're coming up on a weekend. Things can move over a weekend. Let's say that theta decay does decay over a weekend, for sure. If things weren't accounted for by market",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 90,
      "start_timestamp": "00:37:12",
      "start_timestamp_seconds": 2232.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2232"
    }
  },
  {
    "text": "structure their trades, it's very, very thoughtful. One of the things that they're looking for is, say, for example, we're coming up on a weekend. Things can move over a weekend. Let's say that theta decay does decay over a weekend, for sure. If things weren't accounted for by market makers, think of a great trade. Markets don't move that much over weekends in general. There's a lot of studies on that. I've shared some of those with the Patreon folks. If you look at the close on Friday, you get near the close on Friday, you could say, oh, well, I'm just going to sell premium and then I'll buy it back on Monday right at the open and I'll collect the theta decay over the weekend. The makers are smart. They accelerate the weekly theta decay right into the weekend to account for the lower volatility period. So baked into the pricing models, not that anybody asks about that, but I just think it's important for you guys to be aware of it. Paul Andrew says, question for you, I have 20 of the 16 Jan 26. I don't know which, I assume you mean GameStop. I assume this is GameStop. If for whatever reason there is a squeeze and the stock is worth 50, what will be my market value? That's a great question. I actually love that question. There's a bunch of different ways you can answer that question. The first one is you actually can",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 90,
      "start_timestamp": "00:38:24",
      "start_timestamp_seconds": 2304.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2304"
    }
  },
  {
    "text": "this is GameStop. If for whatever reason there is a squeeze and the stock is worth 50, what will be my market value? That's a great question. I actually love that question. There's a bunch of different ways you can answer that question. The first one is you actually can use the black sholes, Martin model, right? So first, Paul, the first question I have for you is, what did you buy those options for? How much did you pay? And we can do a few different things to figure out at least what the intrinsic value would be, right? That's easy. We can answer that right out of the gate. If the stock goes up to 50 and you got in at 20, you would have 30 of intrinsic value right out of the gate. So that means that whatever your current premium is that you paid, you can add 30 to that. That's how much it would be worth at a minimum that's not accounting for the resulting time value that's left in those options. But that's also why it's kind of important to understand what the original payment was because that will inform a couple of other things, meaning how much time value is in those options and how much we think might be left. Now another thing that you can do that's even easier, in my opinion, is to use platforms. A lot of platforms have really cool tools now. And again, I'm assuming it's GameStop.",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 90,
      "start_timestamp": "00:39:37",
      "start_timestamp_seconds": 2377.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2377"
    }
  },
  {
    "text": "things, meaning how much time value is in those options and how much we think might be left. Now another thing that you can do that's even easier, in my opinion, is to use platforms. A lot of platforms have really cool tools now. And again, I'm assuming it's GameStop. You left me high and dry here and I'm just making a bunch of guesses because you haven't let me know if it's GameStop or what your premium was. It's actually getting a little lonely up here. But I might keep going anyways and we'll see how right I am making a bunch of guesses like a fool. So going out to the 26, okay, so that lines up. It does have that expiration. So I believe that my thesis might be correct. The 20s are in the money, which is a great purchase if you bought them and the money I love that. Also assuming that this is what you actually bought. Again, I'm just making guesses because you've now ghosted me entirely. Sick. Now if we look at the intrinsic versus extrinsic value, these are about 4 in the money. So 4 of this premium is intrinsic value. That doesn't decay. The rest of that is extrinsic value. So it's about eight bucks ish of extrinsic value. And you can see again, the back of the napkin way to do this is just look at the corresponding out of the money put or call depending on which side",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 90,
      "start_timestamp": "00:40:45",
      "start_timestamp_seconds": 2445.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2445"
    }
  },
  {
    "text": "That doesn't decay. The rest of that is extrinsic value. So it's about eight bucks ish of extrinsic value. And you can see again, the back of the napkin way to do this is just look at the corresponding out of the money put or call depending on which side you're looking at. And that will give you a pretty close estimate of how much intrinsic or extrinsic value is left in the options. But you can also just do the math, right? So for an in the money option, we need to remove the intrinsic value, which is simply how far in the money it is. Again, the stock is just called 24. The strike is 20. So that's 4. You would take 4 out of this. And then that will give you the remaining extrinsic value for the option. There's oh, damn, this is not carless. Damn, Carlos, I got, I really got my hopes up because I thought that Paul Andrew hooked me up with the rest of the details I was hoping for. I'm not going to lie, I'm still happy you chimed in Carlos, to be honest, but it's just I still have been ghosted. So yeah, that's a little bit of a little bit of a bummer, but still great. Ah, there's Paul. Sorry, I'm driving. What do you mean driving? If you're driving, you should be texting like I live in California, that's what everybody does. I almost I'm almost pretty sure that",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 90,
      "start_timestamp": "00:41:50",
      "start_timestamp_seconds": 2510.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2510"
    }
  },
  {
    "text": "So yeah, that's a little bit of a little bit of a bummer, but still great. Ah, there's Paul. Sorry, I'm driving. What do you mean driving? If you're driving, you should be texting like I live in California, that's what everybody does. I almost I'm almost pretty sure that like driving is the time that most Californians catch up on their texts. So yeah. Yeah. Yes. Is GMME my cost is way way over a hundred. Ah, that's shitty. Yeah, we don't like that. That's terrible news. Let's take a look at the scenario now for you. Yeah, that's terrible news. Don't like that. But we'll look at a scenario. So let's just say that your cost was a hundred. Ah, man, really don't like that. When you say a hundred, do you mean 100 in premium or just 100? Because that's also different. I don't know if I'm being if you're catfishing me now, because if you paid 10, which was 100, that's okay. I love that for you. If you're saying that you paid 100 in premium, which is a completely different position, that would be terrible news for us. So I'm going to go off maybe that you got them at ten bucks. Because that would mean you probably bought them at the money and I would assume that you would have bought them somewhere back here maybe. And like, may total cost was 103. Yeah, okay. Change is everything. Love this trade for you. So",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 90,
      "start_timestamp": "00:42:48",
      "start_timestamp_seconds": 2568.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2568"
    }
  },
  {
    "text": "that you got them at ten bucks. Because that would mean you probably bought them at the money and I would assume that you would have bought them somewhere back here maybe. And like, may total cost was 103. Yeah, okay. Change is everything. Love this trade for you. So when he's saying total cost, the reason why I caught that is because it's completely different if he's giving me the premium of the option that he paid or the total cost. Because when you look at the total cost, that means the premium he paid was not a hundred. It was 1.3. So that means that this is like really low. That actually confuses me. I would have guessed it would have been like ten bucks. All right. Well, now you got my head in the blender like Rory and Kitty has had me in the last few days, but we'll just roll with it that you got these. When would you have gotten these for a dollar? Okay. Now we got to do a little investigative work. Sorry. Quick, quick, segue to see when these would have possibly been trading for a dollar. And it looks like, yes, so it looks like my original guess might be one of these trading for a dollar. So what I'm doing right now so you guys can follow along is I'm just going way back in time to see if these were trading for a dollar. Because if his total cost",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 90,
      "start_timestamp": "00:44:06",
      "start_timestamp_seconds": 2646.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2646"
    }
  },
  {
    "text": "so it looks like my original guess might be one of these trading for a dollar. So what I'm doing right now so you guys can follow along is I'm just going way back in time to see if these were trading for a dollar. Because if his total cost was 103, that means that he bought them for a dollar three. And I don't think that these traded for a dollar three. At least not going back six months. Maybe you got them like a really long time ago. Still, I don't think they were trading for a dollar three. They're pegged at nine, nine, 80 or something. And this is going back to the offering. Yeah. So I can tell you that he didn't get them for a dollar three. Sorry. Don't mean to put you on blast, Paul, but I also do mean to put you on blast because you straight up ghosted me. So now my feelings were hurt. I have a chance to vindicate myself. And yeah, here we are because I these did not trade for that. I would bet my left nut. That's my guess. My left nut that these did not trade for a dollar. So again, what I'm doing here is I'm just seeing what the option traded at. They could have technically. I'm kind of obviously making some jokes here. But if he got these for super, super cheap way out of the money. And he got in when GameStop",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 90,
      "start_timestamp": "00:45:06",
      "start_timestamp_seconds": 2706.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2706"
    }
  },
  {
    "text": "for a dollar. So again, what I'm doing here is I'm just seeing what the option traded at. They could have technically. I'm kind of obviously making some jokes here. But if he got these for super, super cheap way out of the money. And he got in when GameStop was trading for pennies, then sure, it might have happened. But the other thing that I can tell as I look at this entire bit, it looks like it looks like overall. I'm seeing the cheapest it got was like seven, 91. Something something like that. So what I'll do to get an even better look at this is this. Come in here, look at a bigger chart, quick chart, take a little pixie. So what I can do now is I can see when these were offered. So if I go back to the max, they were offered for the first time on 9 allow shit. Oh shit, these are some Taliban options. Not damn. So the furthest back these go is 9 11. Damn, that's kind of funny timing, huh? And I can look at where the low was the cheapest these ever traded was two and a quarter. So these weren't these were in bought for a dollar three. So not only did you go speed, but you straight up fucking catfished me brutal, unbelievable. Here I am hanging out with you guys on a Friday evening, talking to you about some shit that I've known about",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 90,
      "start_timestamp": "00:46:21",
      "start_timestamp_seconds": 2781.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2781"
    }
  },
  {
    "text": "quarter. So these weren't these were in bought for a dollar three. So not only did you go speed, but you straight up fucking catfished me brutal, unbelievable. Here I am hanging out with you guys on a Friday evening, talking to you about some shit that I've known about for a decade and a half. And I'm getting some bum scoop. I can't even get straight information. This is unbelievable. I would make an assessment that these might have been bought for 10 and three something like that. And it might have been a thousand and three dollars simplest explanation here might be we forgot a zero something like that. So if we take a look at this, let's say you got them for 10 and three cents. Now before we take a look at the correct answer, again, we can make some assumptions. The first assumption is there's about 8 of extrinsic value. So we would add eight. The other thing we can tell us how far in the money it would be if it goes up to 50, which would be then 30 in the money. So that's 30 of intrinsic value, about 8 of extrinsic value. So with no changes in volatility that takes us about 38, something like that. So let's let's take a look. We can go into the profile here and say at 50, they would be making 2,25, 95, something like that. The reason why the numbers would be different is because",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 90,
      "start_timestamp": "00:47:39",
      "start_timestamp_seconds": 2859.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2859"
    }
  },
  {
    "text": "So with no changes in volatility that takes us about 38, something like that. So let's let's take a look. We can go into the profile here and say at 50, they would be making 2,25, 95, something like that. The reason why the numbers would be different is because they obviously would be a passage of time for sure. But yeah, it's not super far off. It's a little bit off, but not super far off. That's essentially you could tell what they would be trading at. This is the easiest to use the platform, but you have to account for some of the changes involved and stuff like that. So damn it, Paul. Damn it. Damn it all the hell. Unbelievable. And I get let's see blender. So I'm putting my socks back on because as I'm standing here, my dog likes to fight with my feet, which I'm fighting with him, but he has he's a small dog and he has these little sharp teeth. Why is that says those GME 20 Jane calls were actually 115 on April 22nd. Let me double check that absolutely could be the case. So let me see. Send. Winfo send me location. I don't think so, man. So here's the other thing. I don't know what you're looking at, but there's a difference between what the market was offered at and where any transactions occurred. So I'm looking at the entire options chain from its origin from the I guess",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 90,
      "start_timestamp": "00:48:54",
      "start_timestamp_seconds": 2934.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=2934"
    }
  },
  {
    "text": "me location. I don't think so, man. So here's the other thing. I don't know what you're looking at, but there's a difference between what the market was offered at and where any transactions occurred. So I'm looking at the entire options chain from its origin from the I guess the terrorists that made this. And I can like you can you can see the same thing I'm looking at the low is 2.25. That means that this option, this is the lowest that this option transacted at was 2.25 right there. So I don't know where we're getting the 1.15, but that's not what I'm seeing. That is that's my follow up response. All right. Let's see what you guys got. Lender says what would be good IV when you buy an option one year out? What percentages are normal versus abnormal IV like GME? Yeah, that's a really, really great question. So the way to think about it is when IV is high, you're paying more for the exposure. That's really the simplest way to consider it. Carlos says I would bet money didn't catch the absolute bottom. Again, like he didn't these didn't trade there. He's speaking of AMC literally looking at the next guy. Paul like the first clarifying question I asked was the damn ticker we're looking at. Damn it. Paul unbelievable. All right, well, we could do the cliff notes version of this then for Paul because now we're in it. Now we're in",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 90,
      "start_timestamp": "00:50:12",
      "start_timestamp_seconds": 3012.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3012"
    }
  },
  {
    "text": "of AMC literally looking at the next guy. Paul like the first clarifying question I asked was the damn ticker we're looking at. Damn it. Paul unbelievable. All right, well, we could do the cliff notes version of this then for Paul because now we're in it. Now we're in it for the long haul. Now we got to go all the way out here and we got to find the 20s. Ah, this is what Paul did. He bought the super cheap far out of the money options. Everything I said in the beginning about picking a good picking a good expiration. All that's gone. It's all gone. There's not there's not a good pick at all whatsoever, which we'll actually talk about. Let's use this as an example. So the 20s if AMC goes to 50, the first thing we know again is you can add 30. That would be the intrinsic value and then it would be about 60 70 cents maybe something like that. So like 30 70 ish. So let's take a quick look and see how close that is. And let's say that we get this up to 50, which I could tell somebody has big dreams. So it's like 35. Yeah. So. And it would be 2,900 at expiration. So yeah, we're right on the money there. So that's just kind of inferring. The answer to you, Paul is 35 54 is what they would be worth. Now the reason why I hate",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 90,
      "start_timestamp": "00:51:42",
      "start_timestamp_seconds": 3102.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3102"
    }
  },
  {
    "text": "has big dreams. So it's like 35. Yeah. So. And it would be 2,900 at expiration. So yeah, we're right on the money there. So that's just kind of inferring. The answer to you, Paul is 35 54 is what they would be worth. Now the reason why I hate that trade and the reason why it's not really worth much at all. Again, this is why when we're trading options, it's so important to balance two different things. There's the gross dollar amount of things and then there's a percent return. Because in that example, let's say that those options would be trading again, what did I say like 30? They would be trading at like 35 something like that. So and he might have got them. He said he got them for like 103. So he got them for a dollar and three cents. So that would be literally a 3,298 percent return, crazy return, right? But that's turning 100 into four grand ish. Three grand actually. I grossly over swagged there. So it's not a lot of money, right? It's a fantastic return on the outlay, but in a gross dollar amount, it's just not that much money. And why is that? Especially if he got in this scenario that we're looking at, if you got like a 45 price accommodation, why is he only making that much? Well, it's because of the next thing that we'll talk about on this list. I guess the two things",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 90,
      "start_timestamp": "00:53:07",
      "start_timestamp_seconds": 3187.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3187"
    }
  },
  {
    "text": "money. And why is that? Especially if he got in this scenario that we're looking at, if you got like a 45 price accommodation, why is he only making that much? Well, it's because of the next thing that we'll talk about on this list. I guess the two things actually, so we hit Fade. Now this is great. We're hitting all these Delta and Gamma are the next ones on this list. And those are the two reasons why he's not making a lot of money. Because the Delta for these further out of the money options is 32. So that means that for every 1 move he gets in AMC, he's going to see his premium appreciate by 32 cents, Cedarus Parabus. Now the other problem with this is these have crazy low gamma. So that means if we get that dollar move, this 32 Delta will grow into a 38 Delta Delta adding this six cents here. And that would be the new Delta for the position for when he gets another dollar move and then so on and so forth. This is the problem with options that are further out in time at a low Delta is the Gamma is very low. They don't change that much. And it sucks because you lose that compounding effect. Whereas if instead we're at something like a 5060 T and you take a look at again, something that's like a 30 Delta, something around where he's at. Notice how",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 90,
      "start_timestamp": "00:54:23",
      "start_timestamp_seconds": 3263.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3263"
    }
  },
  {
    "text": "is the Gamma is very low. They don't change that much. And it sucks because you lose that compounding effect. Whereas if instead we're at something like a 5060 T and you take a look at again, something that's like a 30 Delta, something around where he's at. Notice how fast these would start to grow even at 5060 T. If he's at that 35 Delta ish 30 Delta ish, he gets a dollar move. He's going to see 11 cents essentially double what he's seeing in the other scenario. So then that 31 will become a 42, which would look like this. Then if he gets another dollar in that case, he gets another 15 cents on top of that. So now he's of 56 Delta, something like that or whatever it was, 57 Delta and then so on and so forth. So then if he gets a third dollar move, he's going to gain another 18 Delta's. So when you go super far out in time and far out of the money, you have a low Delta. So you get a low dollar for dollar move and you have a low Gamma so you don't gain a bunch of Delta's until you get a just massive move in your favor, which is exactly why in that video I shared earlier about buying call options smarter. I talk about trying to think about different ways to strike a balance and also shout out to you guys because it looks",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 90,
      "start_timestamp": "00:55:32",
      "start_timestamp_seconds": 3332.26,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3332"
    }
  },
  {
    "text": "of Delta's until you get a just massive move in your favor, which is exactly why in that video I shared earlier about buying call options smarter. I talk about trying to think about different ways to strike a balance and also shout out to you guys because it looks like there's like 50 of you in here, which is awesome. I love that. So but that's exactly what that means in the scenario is going super far out in time gives a trade time to work. But in that scenario, if I had that position, my position would be something in the money. And the reason for that is you still don't have that many Delta's, but I will get a much better dollar for dollar move. So in this case, if I had this 77 Delta, the four and a half here or whatever, and I get a dollar move in the underlying, I see 77 cents of that dollar. So it'd be 100 price appreciation. This is 77. Whereas it's literally double and then some now this is the trade off. These are more expensive. So if you're expecting a really big move in something, you can make a better compounded return going further out of the money, but you'll still make more money here. So let's take a look at the scenario. If we instead buy this one and let's analyze it and we have his trade here as well, the four and a halfs. Let's",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 90,
      "start_timestamp": "00:56:29",
      "start_timestamp_seconds": 3389.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3389"
    }
  },
  {
    "text": "make a better compounded return going further out of the money, but you'll still make more money here. So let's take a look at the scenario. If we instead buy this one and let's analyze it and we have his trade here as well, the four and a halfs. Let's go all the way out to that 50 Delta to prove this point or the 50, don't relying at 50. So these four and a halfs at 50, as we already talked about, they make four grand something like, oh, I'm sorry, wrong one. The 20s, my bad, my bad. So the 50s, these make 3,500 at that 50. And if we take a look at the higher Delta that are in the, oh, wait, hold on, I'm all sorts of twisted, my bad, my bad, my bad. I completely twisted it. So in this scenario, and I think it's because, yeah, these are flipped. Okay. We do skip the last lip over to here. We start from scratch. If he gets his move up to 50s, the in the money options would return 4,300, yeah, 4,400 bucks, something like that. The out of the money is that he would get, they would return 3,500. So you can see you make more money with the in the money options. Why is that? It's super simple. It's because they have a higher Delta. So for each dollar for dollar move that AMC is moving, this is seeing way more of an",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 90,
      "start_timestamp": "00:57:36",
      "start_timestamp_seconds": 3456.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3456"
    }
  },
  {
    "text": "get, they would return 3,500. So you can see you make more money with the in the money options. Why is that? It's super simple. It's because they have a higher Delta. So for each dollar for dollar move that AMC is moving, this is seeing way more of an appreciation per dollar move than these do all the way out here. But they're more expensive. So that's the nature of Delta is the higher your Delta, the more expensive the options are, but the better dollar for dollar move you're going to get with the underlying. You'll make more money as a gross dollar amount if you get your move. That's they won't provide the same compounded return that a far out of the money option. So Ryan says, once your Delta increase as you get in the money, absolutely, up until it hits a one. Once you get to a one Delta, that's it. You're at the top. So in that example, essentially what's happening is he's gaining Delta until you get again like a 10 move or something like that. And these become a one Delta. So then you're just moving dollar for dollar with the underlying. So they would cap out at one. All right. Now getting back up to the top here. Carlos says, do you think 115 for GME 628 was a good buy? Again, I wouldn't worry so much about the premium and those kinds of trades because if the thesis of those",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 90,
      "start_timestamp": "00:58:48",
      "start_timestamp_seconds": 3528.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3528"
    }
  },
  {
    "text": "So they would cap out at one. All right. Now getting back up to the top here. Carlos says, do you think 115 for GME 628 was a good buy? Again, I wouldn't worry so much about the premium and those kinds of trades because if the thesis of those trades is a big move, the cost that you get in at is less important than potentially what you can make. So for example, what I personally would care way, way more about in this scenario is what strike, what Delta, not so much the cost. The cost is part of the equation obviously, but that's not really the most important point. And it's another thing with trading is that you're not really trying to bargain by. It's not a great way to make money in trading. Strike is 628. That's super confusing, Mr. Carlos, because that would be an expiration cycle. 628 or you're, I'm confused now. What is this? What's the strike? 628, I'm assuming, yeah, the expiration cycle is 28 June. And we need a strike, which is this little guy in the middle. The strike price is what the options contract pertains to. Let's see if we can figure out what this strike price is. Yeah, so you see R4 T5, which is kind of like R2 T2. They have a strike. I mean, 25 strike. There we go. I don't hate that. The 25 strike here is not terrible. Again, it wouldn't be my pick.",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 90,
      "start_timestamp": "00:59:59",
      "start_timestamp_seconds": 3599.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3599"
    }
  },
  {
    "text": "we can figure out what this strike price is. Yeah, so you see R4 T5, which is kind of like R2 T2. They have a strike. I mean, 25 strike. There we go. I don't hate that. The 25 strike here is not terrible. Again, it wouldn't be my pick. I would want to be at the money or in the money. But the big problem you're going to have with this is again, unless you get a big accommodating move, you're going to bleed out like a stuck pig into expiration. So what this looks like for you is again, let's say that we got in at like 125, you're losing 13 cents a day in extrinsic value. So literally 10 of the options value is gone after the passage of one day and then so on and so forth. So that's the problem. And again, that video that I shared earlier, you really should watch that one specifically for you, Carlos, because the idea is to structure trades that avoid this exact problem. Because think of it this way. Even if you get a dollar move in your favor, you're still going to be out of the money. You'll be right at the money, but you're still going to be out of the money. You will see a 44 cent appreciation, less the 13 cents that you saw. So you're kind of eating away at that massively. If you get a big move, these can compound really well.",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 90,
      "start_timestamp": "01:01:18",
      "start_timestamp_seconds": 3678.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3678"
    }
  },
  {
    "text": "You'll be right at the money, but you're still going to be out of the money. You will see a 44 cent appreciation, less the 13 cents that you saw. So you're kind of eating away at that massively. If you get a big move, these can compound really well. If you can get a big move, but even if you get that dollar move, 2 move, you're still going to be losing a ton of faded K. So that's the problem with these super short term. They're going to bleed so, so fast. So yeah, there wouldn't be my go to. All right. Back up getting caught up on the chats. Oh, damn, Steve, you did me dirty. I was about to talk about yours, but then you moved it. You confused me, all right? Let me see. Nicholas says, how do I beat the Algos trading ATM calls and puts spy? You're playing a different game than the Algos. The Algos don't even care about you. The Algos are looking for mispricing on a volatility surface and repricing them. You're not going to beat them, first of all. The other thing is you're comparing yourself against the entire wrong entity. The Algos don't care about you and you guys are playing quite literally completely different games. So in my opinion, I would like straight up just drop that thought process whatsoever. There's nothing really for you to do there. Benjamin says, would you show how to set a",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 90,
      "start_timestamp": "01:02:35",
      "start_timestamp_seconds": 3755.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3755"
    }
  },
  {
    "text": "wrong entity. The Algos don't care about you and you guys are playing quite literally completely different games. So in my opinion, I would like straight up just drop that thought process whatsoever. There's nothing really for you to do there. Benjamin says, would you show how to set a stop loss and take profit on think or swim? Yeah, you sure. It depends on, are you talking about like an option on an option? It will, it would have to be on an existing position. So I don't have an existing position on here, but essentially you would just do the reverse order for whatever you have on and then you can set a stop limit. So think or swim has a really cool education thing in here. You can go into the learning center and you can pop through essentially how to kind of complete those different kinds of orders. So this will walk you through exactly how to do it. But essentially if you want to do some sort of take profit, you would do an OCO order cancels others. So like this here, you would trigger OCO and that essentially would say, okay, I want to take profit at this point or if I lose this much, I want to get out and then it would cancel the other orders. So it starts with an OCO and then you set up whatever order type you want based on what you're trying to do. Like the overview",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 90,
      "start_timestamp": "01:03:49",
      "start_timestamp_seconds": 3829.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3829"
    }
  },
  {
    "text": "take profit at this point or if I lose this much, I want to get out and then it would cancel the other orders. So it starts with an OCO and then you set up whatever order type you want based on what you're trying to do. Like the overview cliff notes version. Paulo says, how about using diagonals to bet on big moves? Yeah, you definitely can use diagonals. That's as you know, a go to strategy of mine is ratio call diagonals for stuff like that and you can make a ton of money with them. I have a video out. I think I did. Let me see. Yeah. So this one here. I don't think this was like a big. I don't think this was a big return, anything special to be honest, but I think it is a simpler. Yeah, it's like a simple, a simple display of the ratio diagonals. Essentially what they're talking about and like my preferred strategy for directional stuff is ratio diagonals. I like to go a little further like 60 plus days, typically around like 90 something like that. And then you can sell options depending on if you're doing caller put side call for upside put for downside, you can sell options against it that are closer in time, but they don't necessarily, they're like designed to amplify the returns. So again, what's most important there is actually this part right here defining the profit mechanism and then structuring",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 90,
      "start_timestamp": "01:05:03",
      "start_timestamp_seconds": 3903.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3903"
    }
  },
  {
    "text": "caller put side call for upside put for downside, you can sell options against it that are closer in time, but they don't necessarily, they're like designed to amplify the returns. So again, what's most important there is actually this part right here defining the profit mechanism and then structuring a trade that makes sense for it. So what that means in this context is let's say you find something that you think is going to go up. The most important part of this equation is doing the due diligence and being good enough at determining direction to then trade something that is going to move a lot. From there, it's a matter of optimizing the strategy that you're using to extract as much profit from the scenario. If that's the total objective, sometimes it's too extract as much profit while reducing risk. Again, that's the cool part with options is you can overlay a lot of different things that you are trying to that you're trying to emphasize. So yeah. John Cox, why is everyone buying way out of the money calls on short dates and not in the money a few weeks out or a month off cheaper? That's the thing. It comes down to it is way cheaper. And if you get a big move, you can get a really big percent return. Which again, that's a big percent return in options. In my opinion, is literally useless. It's focusing on the wrong thing. That's an ego",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 90,
      "start_timestamp": "01:06:12",
      "start_timestamp_seconds": 3972.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=3972"
    }
  },
  {
    "text": "That's the thing. It comes down to it is way cheaper. And if you get a big move, you can get a really big percent return. Which again, that's a big percent return in options. In my opinion, is literally useless. It's focusing on the wrong thing. That's an ego satiating metric to be able to put on an option and be like, oh my God, I made a thousand percent on this call compounding. Sure. If you're one penny option, compounds a thousand percent, literally nobody cares. You've made a hundred bucks, right? Well, whatever it is, a thousand bucks. It's such an insignificant amount of money that it doesn't actually matter. It just sounds really, really cool to be like, oh, I had this percent return. So it's important to keep things in context, right? Percent return still matter, but gross returns also matter quite a lot. So yeah, that's the main reason why people go super short in time is it's cheap and it offers a really big compounding opportunity. But it's primarily the cheapness. Let's see. How much trail are you limited to strategy as a beginner with only a level two options trading approval? I got to be honest, I don't actually remember what the levels are. There might be a level three, I guess level three, if there's level three, that means uncovered. Level two might be like, verticals and shit. If there's three levels, I'm just guessing. If there's three levels, no spreads",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 90,
      "start_timestamp": "01:07:22",
      "start_timestamp_seconds": 4042.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=4042"
    }
  },
  {
    "text": "got to be honest, I don't actually remember what the levels are. There might be a level three, I guess level three, if there's level three, that means uncovered. Level two might be like, verticals and shit. If there's three levels, I'm just guessing. If there's three levels, no spreads for level two. Yeah, okay, there we go. Yeah, so then inherently you would be limited in some sort of strategies if you don't have full options approval. I guess is the easiest way to think about it. Lenders says there was a dude who made 90,000 with 3000 on his year DTE cheap calls on an eight dollar move. Yeah, yeah, you can definitely do that. I try to remind people specifically is that even short term gains, they're short term, right? Like that guy that made 90,000 with that one trade, that's awesome. And I genuinely am one of those people that is stoked when other people make money. Like genuinely, I want to see other people do well. It's literally why I'm spending my Friday night with you guys teaching you this stuff is because I want to see people do well. This stuff literally has changed my life. I was talking to my mom yesterday, she lives in New York and she has to get some dental work done and stuff like that. And like being able to just be like just literally get whatever you want done we can pay for it. Like it's no",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 90,
      "start_timestamp": "01:08:34",
      "start_timestamp_seconds": 4114.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=4114"
    }
  },
  {
    "text": "my life. I was talking to my mom yesterday, she lives in New York and she has to get some dental work done and stuff like that. And like being able to just be like just literally get whatever you want done we can pay for it. Like it's no problem. That's super cool. So this kind of stuff is wildly, wildly life changing. Now when you try to think about the prospect of trading long term is short term gains, don't really fucking matter. Even that 90,000 what you get like three years of super cheap living if you're exceedingly frugal. It doesn't matter, right? What I try to remind people is that the hallmark of a trader is somebody who stands the test of time. It's not even like a year thing, a five year thing, a 10 year thing. Like literally if you think about the entire depth of how long it takes to be a successful trader, it's like 20 years, 40 years, long, long runs of time. A great example of this is our boy Jesse Livermore. And let's take a look at that. Crypt, crypto holy shit. Dude, thank you so much. That's awesome. I appreciate that. Crypt, crypto donated 50 bucks. I really, really appreciate that. Thank you very much. And they said, thanks. I mean, absolutely new love your videos. Thanks for helping us all out. That's awesome, man. Thank you so much. I appreciate it. I love doing this stuff. Let's",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 90,
      "start_timestamp": "01:09:47",
      "start_timestamp_seconds": 4187.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=4187"
    }
  },
  {
    "text": "I appreciate that. Crypt, crypto donated 50 bucks. I really, really appreciate that. Thank you very much. And they said, thanks. I mean, absolutely new love your videos. Thanks for helping us all out. That's awesome, man. Thank you so much. I appreciate it. I love doing this stuff. Let's take a quick look at Jesse Livermore. I got to pin that. Tell you, thanks, man. So looking at Jesse Livermore, there you go, Moody Blues is right on it. So he made hundreds of millions of dollars. I literally think he made, and this is back in like the 40s, right? So the current dollar equivalent of this is crazy. And the dude, he made tons of money trading, tons of money trading. But then like this right here, he made a million dollars in a single day, right? Massive amount of money. Paul says Jesse's mental health was always wildly sure. But that's not that's not so much the point, right? It's the fact that he's a perfect example of somebody that's done an incredible job getting really good at making money. Objectively. He did a terrible job keeping the money. Whether or not he killed himself, I actually don't care at all about, right? That's kind of a decoupled from this scenario. The point is is that he was literally phenomenal at making money. But take a look at, he went bankrupt after essentially covering his losses. 1915 filed bankruptcy again. In this case, he made 10",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 90,
      "start_timestamp": "01:11:17",
      "start_timestamp_seconds": 4277.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=4277"
    }
  },
  {
    "text": "actually don't care at all about, right? That's kind of a decoupled from this scenario. The point is is that he was literally phenomenal at making money. But take a look at, he went bankrupt after essentially covering his losses. 1915 filed bankruptcy again. In this case, he made 10 million dollars in this scenario. What I'm trying to highlight is that this is a dude in 1929. He made a hundred million dollars. The problem is he ended up losing his money, right? That's the problem. So somebody that I will never even, I can't even stand in the man shadow. But he couldn't keep his money. So when I hear people talk about like short term streaky wins and stuff like that, again, I'm very, very happy for them. Anytime you can get a break, it's awesome. But this is a long, long road. And if you don't take the long road approach to this and keep trading, it is a massive, massive problem. Policis, his biography is reminiscent of a stock operator. Yeah, just and a lot of people confuse that book. They think that he wrote it and he didn't. Another dude wrote it about him. I can show you the book. I have it in Kindle, obviously, which is this one right here. This guy. So Edward Lafer or whatever left, left fever. I can't say Edwin Lafer, that guy. But it's all about Jesse Livermore, which is a fantastic book. And he is a",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 90,
      "start_timestamp": "01:12:36",
      "start_timestamp_seconds": 4356.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=4356"
    }
  },
  {
    "text": "I can show you the book. I have it in Kindle, obviously, which is this one right here. This guy. So Edward Lafer or whatever left, left fever. I can't say Edwin Lafer, that guy. But it's all about Jesse Livermore, which is a fantastic book. And he is a crazy, crazy, crazy, good trader. So that is again, it's just a case study that you guys should be aware of. That's really important to be aware of. This is a long game. That's what it all comes down to. All right. Back up here, Marquette. What was about calls versus puts, what's your ratio or what was your ratio when you started out? I assume you're talking to a fram. So I will skip over that one. Unless that one's for me, then I can try to decipher what you mean. Trey J says, given away gold, that's the goal, bro. Also great to see you, Shreyter. Hound says completely agree, Eric talks like this is picking a cake. Yeah, that's kind of the way that I think about trading, to be honest, is that once you define the process and the inputs, it really is kind of a function of modulating different inputs to find the right thing for you. So I actually think it's a great analogy, TBH. Paul says, do you ever use stop loss, take profits, orders on your positions? Definitely. I use stop losses all the time, either arresting or a mental. They are",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 90,
      "start_timestamp": "01:13:54",
      "start_timestamp_seconds": 4434.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=4434"
    }
  },
  {
    "text": "function of modulating different inputs to find the right thing for you. So I actually think it's a great analogy, TBH. Paul says, do you ever use stop loss, take profits, orders on your positions? Definitely. I use stop losses all the time, either arresting or a mental. They are kind of a non-negotiable for every single position that you put on. Here's, here's a hack. They're, first of all, in trading, anytime you hear a hack, here's a hack is probably bullshit. There are very few hacks, but the counteract that exact thing, this one is actually a hack that can completely change your trading with this one simple tip, right? There's your clickbait video title. What it is though, is defining before you place every single trade from now on going forward forever your profit and loss targets, where you will exit the trade, either in profit or at loss, where that occurs. If you define that now before every single trade going forward forever, your trading will be far better. Literally, there's no debate about it. So that is, every single trade has a stop loss of some sort, whether it's resting or not is different, but it will be defined for no doubt. I... Let me see. Paula said, oh, whoa. I didn't realize that there's five levels. That's crazy. Where are there five levels? I didn't realize that there's five levels to options, because when I first started with like think or swim or whatever,",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 90,
      "start_timestamp": "01:15:11",
      "start_timestamp_seconds": 4511.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=4511"
    }
  },
  {
    "text": "it will be defined for no doubt. I... Let me see. Paula said, oh, whoa. I didn't realize that there's five levels. That's crazy. Where are there five levels? I didn't realize that there's five levels to options, because when I first started with like think or swim or whatever, I thought I was like two or three. That's crazy. Jay says, do you account for a missed opportunity cost when analyzing your trades and returns now? Absolutely not. It's definitely part of my assessment, meaning if I'm comparing the efficacy of two different strategies, say for example, we want to trade TSM. And you want to trade it to the upside. And I selected a defined profit strategy. So let's say that I chose to use some sort of breakout strategy where at or above this level, let me grab a price level here, where at or above this level, I was going to buy. And let's say that I bought here. I absolutely need to have a thought process on if I'm selling puts or buying calls, for example, if I'm going to the upside, right? If there's something I'm really bullish or bearish, I'm trading something with a heavy direction, I'm not going to sell premium. Because in this case, you can sell that put, you could collect your 200, but who cares? It moved from 147.73 to 185. Your 2 don't matter at all. If you compare that to buying a call, for example, that might",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 90,
      "start_timestamp": "01:16:20",
      "start_timestamp_seconds": 4580.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=4580"
    }
  },
  {
    "text": "a heavy direction, I'm not going to sell premium. Because in this case, you can sell that put, you could collect your 200, but who cares? It moved from 147.73 to 185. Your 2 don't matter at all. If you compare that to buying a call, for example, that might be 90 days out slightly in the money, you would make a ton of money in this scenario. So in this case, again, it's really a function of what is the hypothesis. That's why this, if you take your time really thinking through defining the profit mechanism, it can take you so far, because it will naturally limit what things make sense. So for example, if I'm trading something like GameStop, and I'm trading it to the upside, what's the primary profit mechanism? Hopefully, a really big parabolic move to the upside. Would I rather sell a put because IV is really high or buy a call? I probably would buy the call, might even do both of them, sell the put to subsidize the cost of buying the call. Something like that, synthetic long stock, but the point is, if you really take the time to define the profit mechanism, it naturally backs you into the exact thing that you're trying to do more often than not, once you define your toolkit, which is really important. So that's that one. Moody Blue says, how long did it take you to grow your account to be able to make five",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 90,
      "start_timestamp": "01:17:50",
      "start_timestamp_seconds": 4670.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=4670"
    }
  },
  {
    "text": "mechanism, it naturally backs you into the exact thing that you're trying to do more often than not, once you define your toolkit, which is really important. So that's that one. Moody Blue says, how long did it take you to grow your account to be able to make five figures selling contracts? Five figures, let's see. The way I'm gonna answer this is just by looking at my annual returns and looking at where the account essentially was exceeding five figures in terms of gain. So it looks like one, two, three, four, four, four or five years. Yeah, four or five years. Wise Al says, can you imagine if Roryn Kitty began his Yolo trading from a Roth IRA with 53, he would still have over 20 years before he could touch his gains with Uncle Sam Slappin and Zess. Sort of. It's a funny thing, but there's actually a lot of ways to crack into an IRA that's penalty free. That starts getting obviously into kind of a really nuanced conversation. So I'm gonna say, it starts getting obviously into kind of a really nuanced conversation about structure and all that kind of stuff, but you should just know what to think. You're actually not super, super handcuffed. A frame is role option better or you will lose money when doing great question. Every time you roll an option, you are realizing the profit and loss from a trade. Whether it's a profitable role or rolling a",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 90,
      "start_timestamp": "01:19:10",
      "start_timestamp_seconds": 4750.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=4750"
    }
  },
  {
    "text": "just know what to think. You're actually not super, super handcuffed. A frame is role option better or you will lose money when doing great question. Every time you roll an option, you are realizing the profit and loss from a trade. Whether it's a profitable role or rolling a position when it's moving against you, which is most commonly, when we use this is up for debate. Here you go. I have a bunch of videos out on it. Here's another one. Those are two videos on rolling. The first one is an old one, but it talks about why a lot of people get it wrong because they're not actually tracking accounting well at all. And then the second video is just a little bit more about rolling options and how to think about it. But the simplest way to think about it is you're closing a position and opening a new one. Let's literally let's use an example. So I'll go back into on demand and we'll take a look at what, TSM and we'll go back to, let's go back to the 13th of May. So boom, we're going back in time, come with me on a journey. We will be 13th of May right here. Let's take a look. Okay. So let's say that I wanted to trade this to the upside. I actually did trade this to the upside on one of its breakouts. It has popped up on a bunch of my scans.",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 90,
      "start_timestamp": "01:20:40",
      "start_timestamp_seconds": 4840.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=4840"
    }
  },
  {
    "text": "a journey. We will be 13th of May right here. Let's take a look. Okay. So let's say that I wanted to trade this to the upside. I actually did trade this to the upside on one of its breakouts. It has popped up on a bunch of my scans. I'm waiting just to say another reason I'm kind of sitting here quietly is this pre-buffering needs to go away before really we can do anything. So let's say we structure a bullish trade. And again, to be very clear, this is hindsight being 2020, right? We know it's going to go up. So it's really easy to structure stuff that looks great when you know it's going to happen. But let's just follow the standard protocols here. I would be looking at something again that's greater than 60, typically 90 plus maybe 180. Expiration liquidity is another thing that I try to keep track of. But I would probably go at least to the, at least to the 74 Delta trying to get closer to this 81 Delta. And there's decent open interest, but there's not a lot of volume. The markets are all pretty wide, not crazy. So in this case, let's say that we buy, and what is this 2000? So what we want to put on maybe 10, 10 of them, right? So get like a 20, 20 K position, something like that. Yeah, 21 K, that's cool. So we'll launch that. That's out the door.",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 90,
      "start_timestamp": "01:21:43",
      "start_timestamp_seconds": 4903.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=4903"
    }
  },
  {
    "text": "in this case, let's say that we buy, and what is this 2000? So what we want to put on maybe 10, 10 of them, right? So get like a 20, 20 K position, something like that. Yeah, 21 K, that's cool. So we'll launch that. That's out the door. And now let's say that we want to sell some options against it. I would come into like the 18 25 somewhere in there. Maybe this maybe maybe 18 maybe 18s. I don't know if earnings is coming up. We'll go to 18s. And let's say we want to sell some options against this. I'll come up here to the 52 and a half are fine. I like the normal strikes better, not like the halves because they tend to have a little bit more liquidity. So I'll probably come here to the 26s. And if we have 10, I might sell like three against it, something like that. And this will be the example for rolling options. So we got a nice, beautiful, completely unrealistic paper fill. And now let's fast forward a week because we know it should be up a bit. Yeah. And what were my shorts at the 155s? So let's wait until it gets up above 155. So we'll go to the end of this week. There we go. So these are now in the money. The short call specifically. So what's happening in the straight right now? Well, the first thing is I'm essentially",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 90,
      "start_timestamp": "01:23:05",
      "start_timestamp_seconds": 4985.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=4985"
    }
  },
  {
    "text": "at the 155s? So let's wait until it gets up above 155. So we'll go to the end of this week. There we go. So these are now in the money. The short call specifically. So what's happening in the straight right now? Well, the first thing is I'm essentially using these long calls. This is called a ratio called diagonal, by the way. I'll give you a video on ratio diagonals, which is kind of like a go to go to structure for me. Actually, I have a whole playlist on them. Let me find that super fast. This is the way that I think about building option strategies is there's only a few things that I do. But I've taken the time to get really, really in depth and calculated with how I do just a few things. It allows me honestly to make way more money than trying to do a bunch of random bullshit. That's very difficult to do. So as you can see, the trade is making a bunch of money. So we put on the position for 20 grand. We're making 10 grand right now, including the loss that we have on the short calls. We collected a credit on these, but it moved against us, which is against being relative, right? It moved against the short calls, but it actually moved in the favor of the long calls, which is the base of the position. And I can actually switch us back to",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 90,
      "start_timestamp": "01:24:16",
      "start_timestamp_seconds": 5056.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5056"
    }
  },
  {
    "text": "calls. We collected a credit on these, but it moved against us, which is against being relative, right? It moved against the short calls, but it actually moved in the favor of the long calls, which is the base of the position. And I can actually switch us back to this camera now. Cool. And so this is where we might choose to roll. What's gonna happen in this position? I would have sold these to open for 1.57. When I'm rolling this trade, I'm buying them back for 5.43. And I'm realizing the PL for that trade. I sold them for 1.57. I'm buying them back at 5.43. I'm closing this trade. That's the first part of the role. So whenever you roll a trade, you literally are realizing the PL on your position. That's the first thing you have to know is you are realizing the PL on the position. So that's the first step here. Now, before I would roll these personally, there's a bunch of different things I would take a look at that we could go into detail on, but it's kind of nuanced. So I'm not sure if you guys would want to, but let's just say I would look at what I could roll to. That's an easy place to start. So in this case, if these are trading for 5.45, I would round it up to make sure that I'm not putting myself in a bad spot on the roll. And then",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 90,
      "start_timestamp": "01:25:17",
      "start_timestamp_seconds": 5117.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5117"
    }
  },
  {
    "text": "let's just say I would look at what I could roll to. That's an easy place to start. So in this case, if these are trading for 5.45, I would round it up to make sure that I'm not putting myself in a bad spot on the roll. And then I would go out maybe a couple of weeks. I want to go out as little in time as possible. I need to get 5.45. So I can move from the 1.55, I can go out two weeks, and I can actually improve my basis from 1.55 up to 1.57. And then Tommy says, can you move yourself? Yeah, for sure. Let me change to this. Boom, bleed out of the way. So now what I can do is see about if I want to roll out in time and give the trade more time to work, if I want to roll out in up, the vast majority of the time, if I'm rolling an option, it's to adjust my basis. And that's because in this case, if I'm long calls in TSM, it means I want it to go up. It's starting to go up. I don't want my calls to get in the way of the profit of the primary profit mechanism of the trade, which is long calls, which means I want it to go up. So all that is to say when I'm looking at the adjustment, I'm heavily personally going to favor, going as little",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 90,
      "start_timestamp": "01:26:32",
      "start_timestamp_seconds": 5192.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5192"
    }
  },
  {
    "text": "calls to get in the way of the profit of the primary profit mechanism of the trade, which is long calls, which means I want it to go up. So all that is to say when I'm looking at the adjustment, I'm heavily personally going to favor, going as little out in time as I can and being able to adjust up. So if I go out one week from the seven days to the 14 days, if I go out one week, then you can see that I can roll to the 155s, but I'm unable to roll up to the 157 and a halves and still get a credit. Now, again, the story goes really deep. I don't want to confuse people too early, but there's always nuances to this. You can roll for a slight debit if you want, but again, keeping it a little more simple. If I go out two weeks, I know I can get to the 57 and a halves, give myself two and a half dollars of upside change, which is really important because that gives me greater capital gains, profit, potential, and I would collect a small credit. So I would close these out for 5.45. I would open the same number of these three. I would sell them right here at the 57 and a half, which again, we can go through it to see how this whole thing goes. So let's pretend I don't know if it'll let me",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 90,
      "start_timestamp": "01:27:41",
      "start_timestamp_seconds": 5261.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5261"
    }
  },
  {
    "text": "close these out for 5.45. I would open the same number of these three. I would sell them right here at the 57 and a half, which again, we can go through it to see how this whole thing goes. So let's pretend I don't know if it'll let me get a fill that we're probably would. Let's see. Yeah, perfect. So we got a fill at 5.45. It improved us to 5.43, but yeah. So now let's sell three of these again. And let's see, we get the mid at 5.90. Sweet. Now let's fast forward. We'll go forward what? Like two weeks, you guys think something like that? What is this? The 24th, 31st, 7th. And then you see guys, no, I'm still good on time. My dinner's not here yet. So I'll hang out for a bit longer. If there are questions that you guys want to hit, start throwing them in now, those, so that I can try to take a look at these. I don't want to end up dropping off last second. And you guys have a bunch of questions. You didn't get a chance to ask. Now is a perfect time to start asking. Shreys says, what would prompt you to roll out in time, but no change in strike? That would mostly be the primary motivation for that would be if I like the strike. And I just want to give the trade a little bit more time to work. There are",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 90,
      "start_timestamp": "01:28:47",
      "start_timestamp_seconds": 5327.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5327"
    }
  },
  {
    "text": "asking. Shreys says, what would prompt you to roll out in time, but no change in strike? That would mostly be the primary motivation for that would be if I like the strike. And I just want to give the trade a little bit more time to work. There are scenarios. Or if something is so far in the money, and I am unable to roll out in up, and you essentially just have to roll out and see, if you get a slight price accommodation, that's another scenario. Those are probably the most common ones, I think. So now looking at this trade, the 5.90, sorry, the 1.57 and a half that I sold for 5.90, they're now trading for 7.10-ish. So we are back falling deeper in the money. So now if I wanted to roll these again, I would see what I can get out of them for. So let's call it 7.10. Maybe I go out again two weeks. I try to go out as little in time as possible, maintain expiration liquidity as much as I can. I'm at 5.57 and a half. Can I get to the 160s? I can. So in this case, it would be another simple solution of close these. Again, these would be maybe 7.10. It probably price improved me to the mid maybe. Yeah, it does. It all, it actually takes you to the mid, which is OK. And then I would sell these. The 160s get three of",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 90,
      "start_timestamp": "01:29:54",
      "start_timestamp_seconds": 5394.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5394"
    }
  },
  {
    "text": "it would be another simple solution of close these. Again, these would be maybe 7.10. It probably price improved me to the mid maybe. Yeah, it does. It all, it actually takes you to the mid, which is OK. And then I would sell these. The 160s get three of them out there. We need to make more than 7.10, which in this case, we can get like 7.32. Perfect. So now over the course of both of these rolls, here's what's happened. I realized a loss on this trade of 1,200. I realized a loss on this trade of 3.50. So I'm realizing losses. That means that the available cash and sweep in my account is going down as we're going through this. Then eventually, you have to make a choice. Either we allow these to roll off. And what I personally would do in this scenario is sell the longs to cover the shorts. Or you close them for a loss, eat the loss, and then just let the trade continue to roll. Again, that's going to be super, super dependent on what you choose to do as a trader. The other thing that you have to keep in mind when you're rolling options like this is how much time value you're buying back that would otherwise decay out versus how much it's moving. Always a trade off. Here's the trade off here. We had the 57.50 and a half. I bought them back for 7.10. If nothing",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 90,
      "start_timestamp": "01:31:07",
      "start_timestamp_seconds": 5467.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5467"
    }
  },
  {
    "text": "in mind when you're rolling options like this is how much time value you're buying back that would otherwise decay out versus how much it's moving. Always a trade off. Here's the trade off here. We had the 57.50 and a half. I bought them back for 7.10. If nothing changed, an entire dollar would bleed out of those. So rather than getting them back for 7.10, I could have bought them back for 6.10, something like that. And another slick trick that you can do is just use the near term expiration for the same strike to see what they look like. So in this case, the 157.50, I know about a dollar would come out. But let's take a look at what they actually look like. The 157.50 they're trading for 6.10, shocker. It's almost like there's a little bit of method to the madness. So that's if nothing changed. Here's where the analysis part of the equation is really important. Because if you think this is going to keep flying off the handle to the upside, what ends up happening is your options can get so far in the money, like sure, you're not buying back any extrinsic value. But you actually then are buying a ton of intrinsic value, which you then cannot, that doesn't decay out of your options. So that becomes a massive problem. Crypteto says, dinner's on me. Thanks again. Thank you, brother. I really appreciate that. Thank you so much for that.",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 90,
      "start_timestamp": "01:32:22",
      "start_timestamp_seconds": 5542.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5542"
    }
  },
  {
    "text": "extrinsic value. But you actually then are buying a ton of intrinsic value, which you then cannot, that doesn't decay out of your options. So that becomes a massive problem. Crypteto says, dinner's on me. Thanks again. Thank you, brother. I really appreciate that. Thank you so much for that. And if there's anything I could do to help you out, feel free to shoot me an email. Because I genuinely, generally appreciate that. Now looking at this scenario here, if we end up falling too far in the money, you will have less extrinsic value that you're buying back. But there's way more intrinsic value. The options get more expensive. It becomes way more difficult to roll out and up. So it's a qualitative assessment. How much extrinsic value are you willing to buy back to avoid that happening? And it's all going to be based completely upon your analysis. That's literally what it boils down to. So let's finish this scenario out while we're looking at it really quick. And let's say that we fast forward what, two weeks again, or we're running out of what this will let us go to, unfortunately, that's kind of a bummer. We might not be able to finish this through all the way to the conclusion. I just want to see what these would be trading for. Ooh, ugly. Yeah. So now these are, this is actually a great example, though, of options that are super, super far in the money.",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 90,
      "start_timestamp": "01:33:27",
      "start_timestamp_seconds": 5607.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5607"
    }
  },
  {
    "text": "We might not be able to finish this through all the way to the conclusion. I just want to see what these would be trading for. Ooh, ugly. Yeah. So now these are, this is actually a great example, though, of options that are super, super far in the money. So these are out in 28 June. They're in here. And we have these. This is a great example. So these do not have a lot of extrinsic value, right? It's like 30 cents, something like that. There's not a ton of extrinsic value, but these are now super expensive. So they're trading for 1970. So now if I try to go out two weeks and see where I can get 1970, it's here and notice what just happened. It's at the same strike. They're now so far in the money that I cannot roll out the same time and still be able to improve my basis like I was able to the last two times. So now we have to go further out, let's say another week and see where we can get that 1970. Can we get it here and get up five bucks? No, just shy. So now we have to go out another week where we should be able to get 1970, which we can. But notice what happened in this scenario, we can no longer go out just two weeks. We had to go out an entire month. This becomes problematic if you continue to",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 90,
      "start_timestamp": "01:34:37",
      "start_timestamp_seconds": 5677.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5677"
    }
  },
  {
    "text": "now we have to go out another week where we should be able to get 1970, which we can. But notice what happened in this scenario, we can no longer go out just two weeks. We had to go out an entire month. This becomes problematic if you continue to do this because let's say you make this adjustment and now your options expire 3070 to eat and let's say over the next couple of days, TSM flies even further off the handle. Well now you don't even have the ability to just roll out a couple weeks. Now you're going from 37, maybe 30 days out to 58 to 93. You run out of expiration liquidity. So this is how you can get caught off sides doing this. Now again, this is all not bad because if you take a look at your PL, you're making money. Even though you're realizing losses on these calls trying to manage them, you're still making money. But the downside when you're making these transactions in something like a ratio call diagonal versus a covered call is you really can't take them to expiration. You still have to buy these back in order to then sell the calls against it so you can still net out positive. Again, it's not the end of the world. You're fighting a part of the position that's not really working in your favor. But in this case, you would have improved your basis by 5 and that",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 90,
      "start_timestamp": "01:35:45",
      "start_timestamp_seconds": 5745.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5745"
    }
  },
  {
    "text": "to then sell the calls against it so you can still net out positive. Again, it's not the end of the world. You're fighting a part of the position that's not really working in your favor. But in this case, you would have improved your basis by 5 and that lets these calls make a lot more money. Then if you had to close these for a loss, you take these down now for 3,700. In total, you would have a loss that you made 3,754, 11.58, but you made 30,000 on the stock or really on the long options in this area. These still come out profitable. You're just trying to manipulate this losing position that's been difficult. Ryan says do you have a video on TA? Yeah, definitely. Let me, I actually think I might have a playlist on analysis if I'm not mistaken. Yeah, this one. Here you go. So in that playlist, it has a bunch of different tools, but I think it will be right up your alley. Like technical analysis, fundamental analysis, stuff like that. Cool. And yeah, so I think that's a good spot to start. Yeah, you got it, Ryan. Crypteto says I'm in the discord now. Oh, perfect. Yeah, that's great. If you guys aren't in there, it's completely free to join. You guys are obviously welcome to pop in. And then for the Patreon folks, there's the paid side to it. That's kind of where I share a little bit",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 90,
      "start_timestamp": "01:36:56",
      "start_timestamp_seconds": 5816.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5816"
    }
  },
  {
    "text": "I'm in the discord now. Oh, perfect. Yeah, that's great. If you guys aren't in there, it's completely free to join. You guys are obviously welcome to pop in. And then for the Patreon folks, there's the paid side to it. That's kind of where I share a little bit more of my active thought, wear and trade updates and stuff like that. But if you do join that, just make sure that you link the Patreon account to discord. So it grants you access. It's a bot that does it because I'm too dumb. Yeah, that's kind of what that boils down to. All right, let's see. Ian says, do you ever trade some of the long calls, the clothe of the short calls if call offsides? Yeah, absolutely. That's literally exactly what I do, like straight up to a T. So in that, I think in that playlist, I share to above about ratio diagonals. It'll walk through that exact process because it's exactly how I do this. So let's say, for example, after that first role, I didn't want to continue rolling. I wanted to just kind of eat the trade and really enjoy the upside potential that I think might be there. What I would end up doing is, I mean, let's go back in time. Well, we don't even have to. We could just take a look. So I closed those for 7.10 and there was three of them. So here's what I would do.",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 90,
      "start_timestamp": "01:38:14",
      "start_timestamp_seconds": 5894.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5894"
    }
  },
  {
    "text": "that I think might be there. What I would end up doing is, I mean, let's go back in time. Well, we don't even have to. We could just take a look. So I closed those for 7.10 and there was three of them. So here's what I would do. I would say, and I would include the previous role as well. You have to track your basis. It's really important to track your basis and this stuff. Well, let's say I lost 11.58 on the first role and then I lost 354 when I was getting ready to close the other trade. So it's 15.12. I lost. So then what I would do is take a look at the long calls and I would say, okay, how many of these do I need to sell in order to cover that cost? So in this case, they're trading for 15.95 again, it's kind of, you know, mistiming, but I'm just showing you the muscle movements I would take. So the 15.95 less the 21.53. That means on a per long option basis, I'm making 2,942 per. So in this scenario, literally all I would do is close all these short calls for a loss and then sell one, maybe two, of the long calls to cover that loss and then to realize a little bit again on top and then you can just leave the rest on. So yeah, that is literally exactly what I do. M goops, there's no",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 90,
      "start_timestamp": "01:39:26",
      "start_timestamp_seconds": 5966.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=5966"
    }
  },
  {
    "text": "calls for a loss and then sell one, maybe two, of the long calls to cover that loss and then to realize a little bit again on top and then you can just leave the rest on. So yeah, that is literally exactly what I do. M goops, there's no going to have to finish the education videos you put out. So I was trying to figure out profits on a call this AM. Yeah, so profits on a call are really simple. It's essentially, if there's intrinsic value, it's how much intrinsic value it has plus whatever remaining extrinsic value there is. And then beyond that, if it's not necessarily in the money, but you get a price appreciation, you would make money and you can use Delta essentially for that to see how much of a move give or take. Cool, all right, let's see if there's anything else. We won't have time to dive deep into this stuff. Maybe that's what we'll do on the next one. I'll make a note for myself on part four and for part four of the series, we can talk about stuff like analyzing options chains and stuff like that. I think that might be fun. What do you guys think? Part four, analyzing option options. I don't know which one I would use options. Option chains. I don't know which one of those I would use if I was you guys. But that's what we'll cover in the next one.",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 90,
      "start_timestamp": "01:40:24",
      "start_timestamp_seconds": 6024.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=6024"
    }
  },
  {
    "text": "think that might be fun. What do you guys think? Part four, analyzing option options. I don't know which one I would use options. Option chains. I don't know which one of those I would use if I was you guys. But that's what we'll cover in the next one. Analyzing options chains. You go with S and S options chains. Yeah, that sounds comfortable to me. That feels right. Cool. And then somebody asked before what are next steps? So next steps for sure are to join the next one of these. I'll do it next week. I don't have like a, as you can tell, I'm kind of figuring out who's joining and what we're talking about as we go and I'm filling in gaps as we move along. I'm not set on ending these after a month, two months. Like I don't have a timeline. My guess is I'll probably make it about six weeks. So that means give or take three more sessions. At least is what I have in mind first. And another thing is if for anybody watching the video now or anybody that's watching the recording, please let me know what kind of gaps there are in your understanding. Like what are the things you want to learn how to do? And then I can bake it in. The way I envision this going forward right now is looking through this exact stuff, thinking about things getting a better relationship with stuff like",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 90,
      "start_timestamp": "01:41:38",
      "start_timestamp_seconds": 6098.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=6098"
    }
  },
  {
    "text": "gaps there are in your understanding. Like what are the things you want to learn how to do? And then I can bake it in. The way I envision this going forward right now is looking through this exact stuff, thinking about things getting a better relationship with stuff like volatility, talking about analyzing options chains. As you can tell in all of these sessions going forward, we're going to be talking about the actual practical application of trading, right? We looked at a couple examples today in TSM of structuring a long trade and essentially running it through after we understand some of these being what different inputs there are that influence the decision and how that impacts how our position will perform. So from there, I think it gets into a little bit more of developing a better relationship with this specifically defining profit mechanisms and measuring them even in a simplistic way. If you're not super into things like Python, buying data and whatnot, I mean, that's how I do this stuff. I take a very, very in-depth approach. So anybody that's familiar with the content that I do, it's very data-driven, I buy data, I scrub it, I put it in a interface like Python or even now something as simple as Jupyter, which is web-based even easier to use to look at ideas. But I share a lot of that with you guys to try to help because I know not everybody is in a",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 90,
      "start_timestamp": "01:42:53",
      "start_timestamp_seconds": 6173.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=6173"
    }
  },
  {
    "text": "it, I put it in a interface like Python or even now something as simple as Jupyter, which is web-based even easier to use to look at ideas. But I share a lot of that with you guys to try to help because I know not everybody is in a place to do that. So anyways, next session I'm thinking more about analyzing options with trading, different trading stuff in there. I give examples of live trades and stuff like that that's again, mostly what I do for like the pro livestreams on like Wednesdays and the market stuff on Sundays, but I also put out standalone videos and I have a playlist on like active trades and stuff that you can take a look at. So that gives you an idea of how I deal with different kinds of structures and positions, but I can also bring some comparisons, case studies for us to take a look at. If you guys let me know what kind of trades we're wanting to spend some time on, for me, the beginning trades I would be focusing on if I were a new trader starting again, would be things like ratio diagonals would probably be the biggest thing. The covered strangle would be the next biggest thing. Strattles and strangles would be the next one. And then that's pretty much it. That's kind of mostly all of what I do. Give or take the number of legs, trading the individual legs separately",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 90,
      "start_timestamp": "01:44:07",
      "start_timestamp_seconds": 6247.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=6247"
    }
  },
  {
    "text": "would probably be the biggest thing. The covered strangle would be the next biggest thing. Strattles and strangles would be the next one. And then that's pretty much it. That's kind of mostly all of what I do. Give or take the number of legs, trading the individual legs separately or kind of layering things on, but that is the vast majority of what I do. So that's where I would start personally. And then from there, I think we should talk a little bit about kind of trading plans, trading logs. It's really the unsexy stuff that I imagine most people won't enjoy too much, but as I look across what I've been able to achieve, the vast majority of that literally stems from exactly that. I made a post in here, and I'll show you. This is from the discord, but I posted this in like the beginner section of the discord and I did it mostly just to highlight what this is looking like, but my trading plan now is like over 400 pages long. It's something that I've built out over the last 16 years. And the reason why I bring that up is having a document for stuff I think is unequivocally, it's just non-negotiable in my opinion. So Elon Song says, I appreciate you sharing your organization and trading plans and logs yet. And again, for the folks that I'm Patreon, there's stuff in the shop that give you like simple templates to start",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 90,
      "start_timestamp": "01:45:10",
      "start_timestamp_seconds": 6310.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=6310"
    }
  },
  {
    "text": "document for stuff I think is unequivocally, it's just non-negotiable in my opinion. So Elon Song says, I appreciate you sharing your organization and trading plans and logs yet. And again, for the folks that I'm Patreon, there's stuff in the shop that give you like simple templates to start with. I'm very against handing people like a developed trade log or a developed trading plan. It defeats the entire purpose, which is building it yourself. So I won't do it, but I will give people starting points. And if you're not in the Patreon, that's totally cool. I have videos on both of them. So literally you could just follow along, put the video open up a document, and then go back and forth as we go through. That's also available to you guys. So I try to make as much of this stuff easily accessible to as many people as I can for the people that are in the Patreon. I always like to say thank you and maybe make it a little easier, but the stuff in general is there. Paul says I would like to learn about defending positions. Yeah, we can do that. If you let me know what kind of positions, literally if you let me know now, I will grab your comment here and I will throw it into this so that I do not forget and I can build some stuff for around you. You just gotta let me know kind of",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 90,
      "start_timestamp": "01:46:19",
      "start_timestamp_seconds": 6379.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=6379"
    }
  },
  {
    "text": "let me know what kind of positions, literally if you let me know now, I will grab your comment here and I will throw it into this so that I do not forget and I can build some stuff for around you. You just gotta let me know kind of what that means to you. So we have analyzing options, chains, and then for Apollo, we want to look at defending positions. I'll throw that in here as well. Here we go. We will defend. Cool. All right, you guys. That's all I got as always hit me up in the discord. Let me know whatever else you want to talk about. I'm here for it.",
    "metadata": {
      "video_id": "7_bIW3YqY78",
      "title": "Picking a Strategy & Placing a Trade | Options Trading for Beginners Pt3",
      "url": "https://www.youtube.com/watch?v=7_bIW3YqY78",
      "upload_date": "",
      "duration": 6515.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 90,
      "start_timestamp": "01:47:21",
      "start_timestamp_seconds": 6441.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7_bIW3YqY78&t=6441"
    }
  }
]