[
  {
    "text": "What's up outliers? Today we're going to talk about trading meme stocks with options. The whole goal of this video is to hopefully change the way we think about using options, because I know for a lot of traders they think it's kind of fast easy money to get leverage, but the problem is most of us are structuring trades probably the exact wrong way. So what I'm guessing is the majority of you that have tried this have probably bought some sort of fairly near term dated option that's pretty far out of the money and you kind of just watch your money evaporate in front of your eyes. So the goal is to not do that. So let's dive straight in and get into the details. So first off I'm going to give you some general concepts to keep in mind about trading directionally with options and then we'll get into the specifics about meme stocks as an example. So when we're trading directionally with options there's a few things that need to be nailed down before we even start. The first one is the profit mechanism. So a lot of people will start just picking different option structures not paying attention to the fact that if you pick the wrong option structure then you know you may or may not make money it's hard to tell. But what I can guarantee you is that if you don't have a defined profit mechanism doesn't matter what option structure",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "structures not paying attention to the fact that if you pick the wrong option structure then you know you may or may not make money it's hard to tell. But what I can guarantee you is that if you don't have a defined profit mechanism doesn't matter what option structure you pick you won't make money. So we have to figure out how things make money first and here are a couple examples. So we have things like price movement changes in volatility, yields if something pays a dividend if there's correlation so on and so forth. So when we're talking about meme stocks there's some very specific traits that come with them but the main thing that we're trading when we're looking at stuff like meme stocks is actually these two right here price movement and volatility which we'll talk more about. So once we understand the profit mechanisms we need to measure them. We need to understand how they work. What are the in-sign outs of when it happens which I have a prime example for you that we're going to get into looking at five different meme stocks from GameStop, Cost, Siri, Lunar to give you some ideas on how to look at this. But we need to not just understand the profit mechanism but we need to measure it and then figure out corresponding signals that help us find it. Now we get to use options. We get to look at what structures make the most",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "ideas on how to look at this. But we need to not just understand the profit mechanism but we need to measure it and then figure out corresponding signals that help us find it. Now we get to use options. We get to look at what structures make the most sense or what we're trying to accomplish because as you'll know when we go through an example in a minute there are trade-offs to every single options structure and that's the beautiful part is you get a chance to fit things so that it makes sense based on your specific thesis. So if we have things that are expected to move a whole bunch well we probably don't want to sell premium because then we're going to miss out on a lot of profit. You'll learn more about that in a moment. The last thing is to tie all of this together. So now we understand the profit mechanism. We've measured it. We know how it behaves. We've identified signals that help us find it. We've compared different structures and we understand what structures make the most sense based on how this thing moves and our ability to detect it. So now we codify what we're doing so that we can continually do it over time consistently and that allows us to optimize our approach and ultimately make more money which is the name of the game. So if we think about this process it's actually pretty straightforward and we'll",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "So now we codify what we're doing so that we can continually do it over time consistently and that allows us to optimize our approach and ultimately make more money which is the name of the game. So if we think about this process it's actually pretty straightforward and we'll look at an example together. So we're going to start by looking at a profit mechanism. Then we're going to start figuring out what strategy makes the most sense. I follow kind of a three step process where I'm going to look at what is my general thoughts towards the economy, the market, that kind of stuff. Look at the portfolio. See if there's any specific needs and then the position itself. Then I'm going to build a trade and for this example we're actually going to look at meme stocks. So let's start with what we just talked about. What's the profit mechanism? Well the profit mechanism here as I've already outlined is going to be price movement up or down and volatility changes up or down. So then what are some of the traits that we can think of when we look at meme stocks? Well let's eyeball it really fast. If we hop over to the platform you'll see a few things right out of the gate. So I'm right now looking at GameStop. One of the things I notice about the profit mechanisms here is that they're pretty severe. All that means is I can find",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "it really fast. If we hop over to the platform you'll see a few things right out of the gate. So I'm right now looking at GameStop. One of the things I notice about the profit mechanisms here is that they're pretty severe. All that means is I can find plenty of periods of time where things are kind of really really quiet and then all of a sudden they get really not quiet. That's very very important to identify. And again if I look at something like Siri I see the same thing. It'll go through periods of time where it trends a little bit, trends again then takes another trend and then it'll go through these explosive periods up or down. So what I'm doing here is identifying the traits of this profit mechanism. So I can obviously see that it's very high volatility and I can see that it moves very quickly. Now this is just an eyeball test. I'm looking at the charts coming up with some ideas and you'll see in a second that we can get one click into detail and actually qualify and quantify both profit mechanism behavior and then signals. Because again signals are how do we determine when this stuff starts to happen. So again when I look through this and just eyeball it there's one thing I can tell you clear as day. When I see price starting to go crazy I see volume go crazy across the board in",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "signals are how do we determine when this stuff starts to happen. So again when I look through this and just eyeball it there's one thing I can tell you clear as day. When I see price starting to go crazy I see volume go crazy across the board in every single circumstance. So here we can see prices kind of like trending but notice how volume although comparatively to here it looks way less it still is much higher than what it was in here. So that gives me some ideas on what might matter. I also can see clear relationships between prices relationship to moving averages or even things like oscillators. So then what I do is I take those ideas and I say okay well let me take a look at some different indicators and let me find a correlation between certain size price moves and what that indicator is showing me. And in this case you can see a bunch of different indicators but what jumps out at me is that the five day average volume across all of these different stocks which is this redline here is highly highly correlated with price movement of greater than 10. So then that gives me one thing I need to pay attention to. Okay I now know average volume in relation to current volume is actually pretty informative. I can also tell you something using like an RSI with a five day moving average is not very correlated.",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "than 10. So then that gives me one thing I need to pay attention to. Okay I now know average volume in relation to current volume is actually pretty informative. I can also tell you something using like an RSI with a five day moving average is not very correlated. So that might be one I spend less time focusing on and I spend more time focusing on these other tools. Volume is a massive massive indicator. So then I also want to qualify and quantify those movements I was talking about. Okay so now if I see any of these stocks move greater than 15 once it moves 15 how much higher above it does it typically go and we can see that in these bars for costs series so if I lunar in GME then I can also say okay how long does it stay above that threshold that's what the redline is and I can tell you that it's really short duration for most of them after those moves. So all of this information directly feeds into how I think about building positions which we're going to get into right now. So I can tell you in terms of timing that there are two different elements to this. One if I'm trying to time it really really well and catch the majority of the move I'm going to have to have some sort of longer term position in here because by the time you start to see",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "terms of timing that there are two different elements to this. One if I'm trying to time it really really well and catch the majority of the move I'm going to have to have some sort of longer term position in here because by the time you start to see volume expanding it's already starting its move. Now my preference is actually to follow the latter part of the move more than anything but if you're trying to capture the whole move you have to be very thoughtful about what duration you choose to pick. So for something like GameStop right now as if I was trying to trade some sort of what I expect to be upward movement well it's really quiet. There's nothing for me to do right now. So I'm probably going to favor a mix of long term and short term durations so that the long term can keep me exposed if the thing happens before I can pick up on it but then when I start to see some of these signals occurring then maybe I can add some short term trades as well the capitalize on the movement when they start to move. The other thing I can tell you is that I have a bunch of other visuals here but the overall move severity meaning how far it tends to move the vast majority of the case sits not much but then sometimes it will have a smaller subset of these really big",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "other thing I can tell you is that I have a bunch of other visuals here but the overall move severity meaning how far it tends to move the vast majority of the case sits not much but then sometimes it will have a smaller subset of these really big parabolic moves. So then it tells me the majority of the time I'm going to be playing it it's actually for less than these massive moves that we might see and then that tells me that every once in a while I'll see a really big move. So then that leads me to a few strategies that I think make the most sense. Trading it to the upside I'm probably going to use something like ratio call diagonals or just regular diagonals and I would add kicker options. I have a video that I'll link to in the notes below that goes through this more in detail we'll look at a quick model together and then the way that I can trade it to the downside because I know that it doesn't stay above the threshold for that long is by trading something like long puts. So why do I favor long premium strategies? Because as we've talked about I want the structure to fit the thesis and if I'm talking about things that are moving a lot I actually don't want to have capped profit potential so I can capture those moves when they happen. The other thing is",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "favor long premium strategies? Because as we've talked about I want the structure to fit the thesis and if I'm talking about things that are moving a lot I actually don't want to have capped profit potential so I can capture those moves when they happen. The other thing is if I'm trading some sort of short premium against it it can be really painful to go through these really big moves and it can be problematic. So let's talk about this idea of building these trades now. So when I'm going through and I'm deciding let's just start with ratio call diagonals. This is a really simple structure. Essentially what I'm going to do is select the product that I want to trade and then I'm going to figure out where I think it might go to. Some of us might think it's Moas. Some of us might think it could be another run up above 45 whatever your profit target is. Then I'm going to start modeling trades off of that. The important part of defining a profit target is so that you don't do this where let's say we get in when GameStop is down here at 10 bucks it goes up to 64 and then it comes back down and then we're just still in it. Not saying get out not saying completely move away but what I am saying is that if you do this you showed a massive profit that then went away and",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "10 bucks it goes up to 64 and then it comes back down and then we're just still in it. Not saying get out not saying completely move away but what I am saying is that if you do this you showed a massive profit that then went away and again if it's some sort of long term buy and whole trade for you that's a completely different strategy. This is talking about trading these movements. So you need a way to get out when it's at a favorable price or even reverse the position to take it to the other side. So what I tend to do is look at a few different choices but the very first thing we have to decide on when buying call options is how far out in time do we want to go because if you are too close in time a to decay is very very high. So I try to balance a few things because if you'll notice that they did a kicker of here it really starts to accelerate once we get within 30 days to expiration. I don't necessarily want that. The other problem is gamma. Gamma is the rate of change of delta and if we're buying options we want gamma. It's how our options start to compound. So the way that I think about it is if I want to maintain a position in GameStop I'm going to use options that are slightly further out in time.",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "rate of change of delta and if we're buying options we want gamma. It's how our options start to compound. So the way that I think about it is if I want to maintain a position in GameStop I'm going to use options that are slightly further out in time. I'm going to use options that are actually slightly in the money. Why do I do this? Because they have a higher delta. So they're going to move better dollar for dollar with the underlying. These are going to be more expensive. So I have to account for that upfront but I can always add what I like to call kicker options which would be combining it if movement starts to happen. So let's say I established that position now because I think it's at an overall good price level right then if it starts to show volume exceeding the five day average and it's starting to look bullish. Well then in that case I can come back in and I could say well maybe I'll go out like 30 days or 20 days and then I'll pick up some options that are maybe like a 30 delta something like that. Now what's the problem with just grabbing these? They're way cheaper. They look awesome. There was a problem. Notice how high the theta decay is. It's three cents which might not sound like a ton three dollars but as a percentage of the remaining premium it's actually quite massive.",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "that. Now what's the problem with just grabbing these? They're way cheaper. They look awesome. There was a problem. Notice how high the theta decay is. It's three cents which might not sound like a ton three dollars but as a percentage of the remaining premium it's actually quite massive. So this is why if we take a look at an example here this is looking at that one single in the money option and let's say we get that move up to 45 up here. If we get that we make twenty two hundred bucks. Not bad we're putting up four hundred and eighty dollars to make that. That's great. We would make way more money if we buy the twenty seven September twenty one and a half calls so slightly out of the money for forty nine cents because they're so cheap we essentially can get ten of those for the price we get one of the other ones and then if we get that move to forty five well now we make twenty three thousand dollars that sounds pretty damn good doesn't it but again there's a problem. Here's the problem. Watch as I fast forward time just a little bit. If I go forward let's say to the twenty fifth of September notice what happens to my options they essentially start decaying away to nothing and then they have to have a much bigger move in order to make the same amount of money and then",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "just a little bit. If I go forward let's say to the twenty fifth of September notice what happens to my options they essentially start decaying away to nothing and then they have to have a much bigger move in order to make the same amount of money and then as we talked about before there's an overwhelming probability of instances where we don't actually get the big move so then if you continue buying these cheap out of the money options you're going to cycle through them repeatedly until hopefully sooner or later it hits but how much will have been lost in that process which is exactly why I prefer to trade something like this. It doesn't make as much money but it doesn't lose anywhere near as much money as time passes and I make more money off of smaller moves that allow me to slowly build my account versus eroding it and then when I see interesting conditions I can add those kicker options so the way to think about picking an expiration is the more time you give yourself the better off you're going to be in terms of letting the trade work but it's going to be more expensive. The other thing you do is when you go further out in time you might be incentivized or think it's better or maybe I'll go further on time but get these cheap options. Well the problem with the cheap options is they will have lower",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "going to be more expensive. The other thing you do is when you go further out in time you might be incentivized or think it's better or maybe I'll go further on time but get these cheap options. Well the problem with the cheap options is they will have lower gamma being further out in time so if I show you gamma this is showing you two different explorations this is showing you 10 DTE versus 30 DTE and if you go to like 60 it's even further down here. So the problem is if gamma is too low and you have a low delta so let's take a look at these 30 force for example. If GameStop goes up by a dollar my options will appreciate by 30 cents and then my delta will gain by three so this will go from 30 to 33. It's not bad but compare that to these 18s that I was modeling in the other trade. In this case if GameStop goes up by a dollar the premium will change by 70 cents or 70 dollars and then I'll gain four gamma so I'll get a little bit more gamma and on a dollar for dollar move I'll make more but here's the tradeoff it's more money upfront your money is not going to compound as much compare that to the inverse if you buy further out of the money options no matter if it's closer far they're going to decay more quickly",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "dollar for dollar move I'll make more but here's the tradeoff it's more money upfront your money is not going to compound as much compare that to the inverse if you buy further out of the money options no matter if it's closer far they're going to decay more quickly and if it's a lower delta in further out in time they're less sensitive to price movements so then you stand to make less overall. This is the beauty of trading options and for me the answer for something like this is pretty simple I would essentially structure long calls via something further out in time I would probably sell some near term short calls against it to help subsidize the cost and I would do it at a ratio this is what makes it a ratio call diagonal so for example if I add these calls against my longs but instead of just having one let's say I put on five of them and then I sell two calls against it so now I have a leveraged long position I'm collecting some theta from these short calls and then when the move eventually starts to happen then I can come in closer in time again maybe this 2431 dte and then add some kicker options that are further out of the money higher probability of losing the investment but if I do get the move then they make a bunch of money make sure you have a system to",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "come in closer in time again maybe this 2431 dte and then add some kicker options that are further out of the money higher probability of losing the investment but if I do get the move then they make a bunch of money make sure you have a system to capture it because again it doesn't do you any good the hold options that are decaying assets have them show a really great profit and then watch the profit go away not saying you have to book a full win every single time there is an entire world around managing partial parts of your trade setting stop losses but the name of the game is to do something and if we're interested in learning more about that let me know we can do a follow on video now the last thing that we have to cover is how do we manage the downside because options are decaying assets so for me I typically will set price levels that if something starts dropping below them then I will either start pairing my position down or I'll flatten it entirely and just say I'm directionally wrong if you are using longer term options you can give yourself a much wider window but sooner or later you have to do something with the options because otherwise they will decay away into nothing so taking them all the way to expiration typically is not a great idea so the simplest approach for me like",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  },
  {
    "text": "options you can give yourself a much wider window but sooner or later you have to do something with the options because otherwise they will decay away into nothing so taking them all the way to expiration typically is not a great idea so the simplest approach for me like I said is literally just setting alerts like this and if I get alert to the upside or the downside then I'll move a stop up and continue to track the profits like that and if it's on the lost side I'll set a defined period that I will get out and then if it starts going back up I'll get right back in but what I don't want to do is hold the asset as it's decaying because then it makes it more and more difficult to make money until next time be an outlier I'll see you all later",
    "metadata": {
      "video_id": "7UFLVoQVRIY",
      "title": "HOW to Trade Meme Stocks with Options",
      "url": "https://www.youtube.com/watch?v=7UFLVoQVRIY",
      "upload_date": "",
      "duration": 1041.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7UFLVoQVRIY&t=0"
    }
  }
]