[
  {
    "text": "I have a question for you. Do you know how you actually make money in trading? I asked this because I had a conversation in my discord a couple days ago that really reminded me that a lot of people have kind of these different notions about where and how they make money but they really don't understand at a base level the function that leads to making money and I'm going to walk you through three ways to actually make money in the stock market and know one of the ways to make money isn't day trading. You can lose money day trading so what I hope to do is to get us to a better understanding of the actual functions that lead to making money so that you can spend more time focusing on developing those functions so that you can make more money. What's up everybody? Eric here. Welcome back to all the outliers and a shout out to the Patreon family. You guys make content like this possible so that my video editor can make these fun for all of us to watch and yeah so you guys are paying him so he thanks you. Let's take a look at what I'm talking about here. I want to start with some level setting. This was from the discord. Now I blanked out the dude's name because this isn't meant to drag anybody. This is literally meant to have a conversation because my guess is the vast",
    "metadata": {
      "video_id": "7wMdBbbfWZg",
      "title": "How to ACTUALLY Make Money Trading Options - 3 Profit Mechanisms",
      "url": "https://www.youtube.com/watch?v=7wMdBbbfWZg",
      "upload_date": "",
      "duration": 759.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7wMdBbbfWZg&t=0"
    }
  },
  {
    "text": "take a look at what I'm talking about here. I want to start with some level setting. This was from the discord. Now I blanked out the dude's name because this isn't meant to drag anybody. This is literally meant to have a conversation because my guess is the vast majority of people would answer this the same way. So here I ask him what are ways that you can conceive of that a trader can make money in the market two to three is fine. Now to be clear, three is not an exhaust a list. There's plenty of ways to make money in the stock market but I'm going to talk about three broad functions and I wanted to see if I could get this person even close to any of them because a couple of them are pretty common ones. And their response was many things day trading futures, swing trading options, buy and hold stocks. Now when I read this I immediately saw what was going on. They were completely disconnected from what actually makes money versus activities. You can buy and hold a stock that goes down. You don't make money. You can swing trade options and not make money. You can day trade futures and not make money. These the specific futures options stocks. Those are just products. Buy and hold is a strategy. Swing trading is a type of strategy. Day trading is a type of strategy. None of those inherently lead to",
    "metadata": {
      "video_id": "7wMdBbbfWZg",
      "title": "How to ACTUALLY Make Money Trading Options - 3 Profit Mechanisms",
      "url": "https://www.youtube.com/watch?v=7wMdBbbfWZg",
      "upload_date": "",
      "duration": 759.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 13,
      "start_timestamp": "00:01:34",
      "start_timestamp_seconds": 94.92307692307693,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7wMdBbbfWZg&t=94"
    }
  },
  {
    "text": "options and not make money. You can day trade futures and not make money. These the specific futures options stocks. Those are just products. Buy and hold is a strategy. Swing trading is a type of strategy. Day trading is a type of strategy. None of those inherently lead to making money. So again my hope is to get people to a closer understanding of what functions actually make money because in this example, if I were to ask this trader, how do you make more money? They might say, well, you need to day trade futures more. That probably actually is the worst thing they could possibly do. The worst idea I ever heard. But they view that as a way to make money. So let's get to the heart and soul of what's happening here. I ask what are the actual functions that lead to making money and they responded with trading by and sell, which is kind of reiterating this slightly different. And then I kind of pointed out what I just pointed out to you that none of these essentially inherently lead to making money. Another thing I saw in the option subreddit was this. I've built together this option strategy. It seems to guarantee a profit. Let's just completely pretend that guarantee at least was spelled correct in the context of talking about something that automatically makes a profit in option trading. Now, to be clear, if you was trading long box spreads in a",
    "metadata": {
      "video_id": "7wMdBbbfWZg",
      "title": "How to ACTUALLY Make Money Trading Options - 3 Profit Mechanisms",
      "url": "https://www.youtube.com/watch?v=7wMdBbbfWZg",
      "upload_date": "",
      "duration": 759.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 13,
      "start_timestamp": "00:03:09",
      "start_timestamp_seconds": 189.84615384615387,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7wMdBbbfWZg&t=189"
    }
  },
  {
    "text": "built together this option strategy. It seems to guarantee a profit. Let's just completely pretend that guarantee at least was spelled correct in the context of talking about something that automatically makes a profit in option trading. Now, to be clear, if you was trading long box spreads in a European style cash settled index like SPX, technically that does guarantee a profit. But then the second sentence quickly tells us that's not what he's talking about. So anyways, the point being is this also doesn't guarantee anything. So what are some other commonly cited ways to make money in the stock market that are incorrect? Well, faded decay. That's not you can lose money while you are gaining faded decay. So no, that's not one. Stelling options and buying options, neither of though inherently leads to profit being long gamma that does not inherently lead to making profit. The point being is that these are all different measures of how things behave or these are different strategies. These are different products. But this isn't how money is made. There is a giant disconnect for people between these two things. And I continue to beat this point to death because I think it is so important for traders to be able to clearly articulate simply how they're making money so that you can make more money. You can optimize whatever that thing is. But if we can't even identify the thing that we need to optimize, then what do we",
    "metadata": {
      "video_id": "7wMdBbbfWZg",
      "title": "How to ACTUALLY Make Money Trading Options - 3 Profit Mechanisms",
      "url": "https://www.youtube.com/watch?v=7wMdBbbfWZg",
      "upload_date": "",
      "duration": 759.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 13,
      "start_timestamp": "00:04:44",
      "start_timestamp_seconds": 284.7692307692308,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7wMdBbbfWZg&t=284"
    }
  },
  {
    "text": "I think it is so important for traders to be able to clearly articulate simply how they're making money so that you can make more money. You can optimize whatever that thing is. But if we can't even identify the thing that we need to optimize, then what do we even do in here? So now let's talk about these three methods. The first one, direction. This is a really common approach to trading stocks, for example. You can look at something like the Kanslin method where they create a system that structured around very careful timing so that they can buy things that what they consider to be a low risk entry and then buy low sell high. That is absolutely a way to make money. You can also short stocks selling high and buying low. You can also do this with volatility. If you think volatility is overpriced or underpriced, you could buy or sell it. But direction is one of the oldest tricks in the book. And being directionally correct is absolutely a function that can lead to making money trading. Now notice how I have a couple bullet points here, though. And I think these are important to call out because you can be good at determining direction in a bunch of different capacities. You can have a very high win rate, but a low average win and moderate losses that in aggregate is positively expected. You could have another scenario where you actually have a",
    "metadata": {
      "video_id": "7wMdBbbfWZg",
      "title": "How to ACTUALLY Make Money Trading Options - 3 Profit Mechanisms",
      "url": "https://www.youtube.com/watch?v=7wMdBbbfWZg",
      "upload_date": "",
      "duration": 759.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 13,
      "start_timestamp": "00:06:19",
      "start_timestamp_seconds": 379.69230769230774,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7wMdBbbfWZg&t=379"
    }
  },
  {
    "text": "important to call out because you can be good at determining direction in a bunch of different capacities. You can have a very high win rate, but a low average win and moderate losses that in aggregate is positively expected. You could have another scenario where you actually have a very low win rate. You could be right 25 of the time. But if your winning trades are big enough, you can still make money. So this is why I believe in this scenario, there's two things that we really need to focus on is getting good at determining direction in some capacity, but then also intertwining managing money effectively, being able to follow winning trades. If that's your style, being able to capture a certain win amount if you're trying to hit a higher win rate, but directional trading is a really common one. The next one we have is risk assumption. So this is kind of also known as structural alpha. And this is where we assume other people's risk. This is the very commonly cited risk premia in option trading. Now there are other ways you can assume risk for people. There are other kinds of structural alpha that just risk premiums is one of them. And this is essentially the force where if we take a look at spy here, we go 29 days out, just picking an expiration and we look at the 443 puts that's oh I'm sorry, let's look at the 445s. The",
    "metadata": {
      "video_id": "7wMdBbbfWZg",
      "title": "How to ACTUALLY Make Money Trading Options - 3 Profit Mechanisms",
      "url": "https://www.youtube.com/watch?v=7wMdBbbfWZg",
      "upload_date": "",
      "duration": 759.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 13,
      "start_timestamp": "00:07:54",
      "start_timestamp_seconds": 474.61538461538464,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7wMdBbbfWZg&t=474"
    }
  },
  {
    "text": "alpha that just risk premiums is one of them. And this is essentially the force where if we take a look at spy here, we go 29 days out, just picking an expiration and we look at the 443 puts that's oh I'm sorry, let's look at the 445s. The 445s are a 34 delta. And those are trading for 3.84 for the 445s, 34 delta. Now if we look at the corresponding 34 delta calls, same expiration, those are only trading for 297. So why is there an extra dollar essentially on these puts that's puts queue? That is structural alpha. This is showing us that the theoretical understanding of options pricing is not what happens in the markets because people are willingly overpaying for puts. And that's for a bunch of different reasons. This is why things like this do exist because a lot of the times when we talk about the stock market, we talk about it in the context of a theoretical vacuum where everything's perfect, everybody's a rational actor, but we know markets are not rational. And we also know that there are a lot of players that have a bunch of rules they have to follow. If you're a pension fund manager and you want to keep your job next quarter, you can't have big draw downs. So they would rather overpay for downside protection so that they can keep their job and sacrifice some profit potential knowing that they're inefficiently buying that protection.",
    "metadata": {
      "video_id": "7wMdBbbfWZg",
      "title": "How to ACTUALLY Make Money Trading Options - 3 Profit Mechanisms",
      "url": "https://www.youtube.com/watch?v=7wMdBbbfWZg",
      "upload_date": "",
      "duration": 759.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 13,
      "start_timestamp": "00:09:29",
      "start_timestamp_seconds": 569.5384615384615,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7wMdBbbfWZg&t=569"
    }
  },
  {
    "text": "to follow. If you're a pension fund manager and you want to keep your job next quarter, you can't have big draw downs. So they would rather overpay for downside protection so that they can keep their job and sacrifice some profit potential knowing that they're inefficiently buying that protection. They don't care. So this is a way for retail traders to make money. Is you can assume that risk for other people? One example, this right here, selling cash-secured puts. We know in general, there are variance risk premiums baked into put options because of put skew and also implied volatility tends to be priced over realized volatility. So both of those put together can lead to a way to make money. So how can you make money doing this? We have to study this idea of risk premium. Then you have to figure out how you want to capture it and then you have to optimize it. But this is the second method. Let's take a look at the third method. We have inefficiencies. Now this one's interesting because some here are more available to traders than others. So for example, something like mispricing. This could be a market maker turns on their quote machine and literally it has the wrong price. That is insanely improbable. It's not frequent at all and your capacity want to spot it fast enough to then trade it is essentially zero. It's not impossible entirely. But it's so insanely unlikely. There are",
    "metadata": {
      "video_id": "7wMdBbbfWZg",
      "title": "How to ACTUALLY Make Money Trading Options - 3 Profit Mechanisms",
      "url": "https://www.youtube.com/watch?v=7wMdBbbfWZg",
      "upload_date": "",
      "duration": 759.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 13,
      "start_timestamp": "00:11:04",
      "start_timestamp_seconds": 664.4615384615385,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7wMdBbbfWZg&t=664"
    }
  },
  {
    "text": "market maker turns on their quote machine and literally it has the wrong price. That is insanely improbable. It's not frequent at all and your capacity want to spot it fast enough to then trade it is essentially zero. It's not impossible entirely. But it's so insanely unlikely. There are literally algos that are looking for stuff like that. And if you think about really these kind of two styles of trading assuming risk or looking for structural alpha or looking for inefficiencies, you're kind of providing a service in all of these circumstances. Because here the service you're providing is taking somebody else's risk. Here, let's say if you could catch one of these mispricings, you are then normalizing prices to what they should be in a set marketplace. Then there's things like cross exchange arbitrage. This is where you find something on one exchange that might be trading expensive and you sell it and you buy it on another exchange where it's trading cheaply. Here you are normalizing prices, but you are also providing liquidity. That's another service you're providing. Value dissonance is interesting. Because this is kind of when we can clearly see and have a system to assess when a move is overdone. And there is a break from the current price of something and whatever you perceive the value to be. Because again, going back to periods of mania like GameStop where that was a short squeeze that turned into a bit of a pump",
    "metadata": {
      "video_id": "7wMdBbbfWZg",
      "title": "How to ACTUALLY Make Money Trading Options - 3 Profit Mechanisms",
      "url": "https://www.youtube.com/watch?v=7wMdBbbfWZg",
      "upload_date": "",
      "duration": 759.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 13,
      "start_timestamp": "00:12:39",
      "start_timestamp_seconds": 759.3846153846155,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7wMdBbbfWZg&t=759"
    }
  },
  {
    "text": "to assess when a move is overdone. And there is a break from the current price of something and whatever you perceive the value to be. Because again, going back to periods of mania like GameStop where that was a short squeeze that turned into a bit of a pump and dump where people are still waiting for the mother of all squeezes to come up and there are different forces that happen there. But during that squeeze there's value dissonance that starts to occur where nobody looks at that and says GameStop is worth this. Nobody thinks that. But because of structural forces in the markets and artificial manipulation we saw this giant moving price and you could have either rode it to the upside or taken the short to the downside when it eventually did collapse. But you can find ways to look for value that's just completely out of whack and to place a trade on it. There's also things like Pied and no this is not what you do with your boyfriend in the bathtub on the weekends. This is positive earnings announcement drift. This is a really well studied force where after an earnings release if something is a really great release and a giant beat to the upside there's certain parameters that have to be met and there are studies that you can find on SSRN on this exact thing that over the next quarter they tend to go on and have outsized returns.",
    "metadata": {
      "video_id": "7wMdBbbfWZg",
      "title": "How to ACTUALLY Make Money Trading Options - 3 Profit Mechanisms",
      "url": "https://www.youtube.com/watch?v=7wMdBbbfWZg",
      "upload_date": "",
      "duration": 759.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 13,
      "start_timestamp": "00:14:14",
      "start_timestamp_seconds": 854.3076923076923,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7wMdBbbfWZg&t=854"
    }
  },
  {
    "text": "if something is a really great release and a giant beat to the upside there's certain parameters that have to be met and there are studies that you can find on SSRN on this exact thing that over the next quarter they tend to go on and have outsized returns. That's because the market is not efficient enough to price in that new information quickly enough and it takes time for it to be digested that's exactly what leads to this. That is a potential way for you to make money as a trader. The point here is every single one of these things is tied to a way discreetly to make money. If you are directionally correct if you are able to price and take risk for other people providing a service or if you can find different types of these efficiencies. There's all different kinds of these and then if you have any questions on how do you build a strategy around this well I have a video that I'll throw in the link in the notes below on this exact thing that really goes into building an option strategy in depth. However this is the general flow that you're going to take so let's say that your profit mechanism is being directionally correct. Your hypothesis is one of two things one of three things you could pick whatever your hypothesis is but let's just say your hypothesis is that you can use technical analysis whatever indicators you",
    "metadata": {
      "video_id": "7wMdBbbfWZg",
      "title": "How to ACTUALLY Make Money Trading Options - 3 Profit Mechanisms",
      "url": "https://www.youtube.com/watch?v=7wMdBbbfWZg",
      "upload_date": "",
      "duration": 759.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 13,
      "start_timestamp": "00:15:49",
      "start_timestamp_seconds": 949.2307692307693,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7wMdBbbfWZg&t=949"
    }
  },
  {
    "text": "that you're going to take so let's say that your profit mechanism is being directionally correct. Your hypothesis is one of two things one of three things you could pick whatever your hypothesis is but let's just say your hypothesis is that you can use technical analysis whatever indicators you choose to be correct 51 of the time. That would lead to a profitable outcome provided that you manage your money effectively. So then you can test that hypothesis you can test those tools you can test your money management you can test other tools other management other alternatives to see what actually works best. Then you figure out which one of those combinations offers the greatest opportunity then you can live test that track the results and optimize. None of this is easy. Trading is not supposed to be easy that's why there's an opportunity here. The barrier to entry is so low anybody can start. Imagine if it was so easy to make money. There would be nothing left to pick up off the ground. You have to look in the difficult places you have to spend the time thinking through these things so that you can outsmart other participants because it is a competitive landscape. This is exactly the art of trading. You have to get used to it. So these are three ways you can actually make money trading. Like I said there's plenty more but I wanted to give you something you can bite on",
    "metadata": {
      "video_id": "7wMdBbbfWZg",
      "title": "How to ACTUALLY Make Money Trading Options - 3 Profit Mechanisms",
      "url": "https://www.youtube.com/watch?v=7wMdBbbfWZg",
      "upload_date": "",
      "duration": 759.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 13,
      "start_timestamp": "00:17:24",
      "start_timestamp_seconds": 1044.1538461538462,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7wMdBbbfWZg&t=1044"
    }
  },
  {
    "text": "other participants because it is a competitive landscape. This is exactly the art of trading. You have to get used to it. So these are three ways you can actually make money trading. Like I said there's plenty more but I wanted to give you something you can bite on to that most people could probably wrap their head around fairly reasonably but it's always if you have any questions let me know don't forget like subscribe share be an outlier. See you guys later.",
    "metadata": {
      "video_id": "7wMdBbbfWZg",
      "title": "How to ACTUALLY Make Money Trading Options - 3 Profit Mechanisms",
      "url": "https://www.youtube.com/watch?v=7wMdBbbfWZg",
      "upload_date": "",
      "duration": 759.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 13,
      "start_timestamp": "00:18:59",
      "start_timestamp_seconds": 1139.076923076923,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7wMdBbbfWZg&t=1139"
    }
  }
]