[
  {
    "text": "What's up everybody? Eric here. Welcome back to the outlier podcast. I got my friends from Duneberg back on my favorite green chicken. I think maybe the only green chicken that I'm aware of, but welcome back to the podcast. Great to have you. Eric, great to be back with you. So it's been about a quarter since we've spoken last and maybe like a lot has happened also not. I guess there's always a lot happening, but I thought it would be cool to start with looking back at 2023 and from your purview as a whole, two things. First, what stood out to you in two? How did things progress against expectations for you? Great questions. And first of all, great to be back with you. I always enjoy our conversations and it's going to be a fun one today. The thing that jumps out to us in 2023, first and foremost, is the lack of a recession in the US. I think the consensus view heading into the year was the Fed couldn't raise rates at the speed with which they were attending to without destroying the economy. They're going to raise until they break something was the common knowledge on Fin Twit and in much of the punitive class of which were a charter member. So that's meant not as a derogatory term. And also I think there was consistent or sort of as an auxiliary observation to that, there was this view which we held",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 55,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=0"
    }
  },
  {
    "text": "the common knowledge on Fin Twit and in much of the punitive class of which were a charter member. So that's meant not as a derogatory term. And also I think there was consistent or sort of as an auxiliary observation to that, there was this view which we held up that the US was probably reaching its capacity to produce hydrocarbons and the shell patch would roll over. And the big aha for us during the year is neither of those materialized. The US kept producing record-breaking month after record-breaking month of oil and NGLs and natural gas and even exported a record volume or value of coal. And also the US did not slip into a recession. And as an analyst, when you get something raw, what matters most is what you learn from it. And the difference between an analyst and an advocate is an analyst seeks to understand, as opposed to an advocate seeks to be proven right. And we pride ourselves on trying our best to be analyst. Look every time you make a call, you'd like to be right. But when you're not right, that's a really amazing opportunity to learn. And one of the rare big sort of aha's in the second half of 2023 was connecting those two dots. The US did not go into recession precisely because it is a hydrocarbon-producing powerhouse. The shell revolution has added 2.5 Saudi Arabia's to the US energy mix. The vast majority of which is",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 55,
      "start_timestamp": "00:01:07",
      "start_timestamp_seconds": 67.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=67"
    }
  },
  {
    "text": "the rare big sort of aha's in the second half of 2023 was connecting those two dots. The US did not go into recession precisely because it is a hydrocarbon-producing powerhouse. The shell revolution has added 2.5 Saudi Arabia's to the US energy mix. The vast majority of which is trapped and or used here, which feeds a pretty decent manufacturing sector unlike other petrol states who just have the commodities to rely on. The US has all manner of downstream manufacturing chemicals and other motives and fertilizers and you name it. And today at 1.65 from the UNB2 natural gas, natural gas is selling in the US for the energy equivalent price of 10 a barrel oil. And if you plug 2.5 Saudi Arabia's into a manufacturing sector, it's unlikely even at 5 interest rates that that economy is going to suddenly go into a recession. And I think that was a big aha for us. I still think the vast majority of analysts don't really understand the critical role that energy plays in the economy. The view energy is just another input into the economy. We have a different view. And that was the big story of 2023. The US kept smashing. I mean smashing production records for natural gas and oil and petroleum with record refinery runs. Cheap coal. You mix all those things in with elite universities, all of the deep water ports and river systems and fertile farmland and all of the other inherited damages",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 55,
      "start_timestamp": "00:02:18",
      "start_timestamp_seconds": 138.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=138"
    }
  },
  {
    "text": "The US kept smashing. I mean smashing production records for natural gas and oil and petroleum with record refinery runs. Cheap coal. You mix all those things in with elite universities, all of the deep water ports and river systems and fertile farmland and all of the other inherited damages that Peter Zahane will tell you makes America great. That's pretty tough, pretty tough to overcome if you're in the recession camp, which we were in. And so having gotten both calls wrong, we decided to try to understand why. And so that was the big sort of second half saga for us. Yeah, I have one of your posts pulled up over here. It's called Atlas Won't Shrug. And there's a section here that follows the thread that you're literally just talking about. And it says, quote, energy is not an input into the economy. It is the economy. Can you expand on that? Yeah, if you go on to read the rest of that post, it says humanity organizes its economic activities to ensure a steady growth in the extraction and exploitation of primary energy. Because energy is life. Standards of living are defined by how much energy is available to be exploited. And most importantly, all humans ever are perpetually seeking a higher standard of living. And when you, the introduction of that piece, we catalog a parade of catastrophes that have occurred since the 1970s. Nixon took us off the gold standard. And the Shah of",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 55,
      "start_timestamp": "00:03:24",
      "start_timestamp_seconds": 204.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=204"
    }
  },
  {
    "text": "is available to be exploited. And most importantly, all humans ever are perpetually seeking a higher standard of living. And when you, the introduction of that piece, we catalog a parade of catastrophes that have occurred since the 1970s. Nixon took us off the gold standard. And the Shah of Iran was overthrown. We had the young people war in between. And the embargo against the West Biopakken. The 1980s brought the war between Iran and Iraq. And then of course, Saddam Hussein evaded Kuwait. And we had a million troops in the Middle East in short order. We had the Asian financial crisis. We had the rubble default in the late 90s. We had the connected long-term capital management collapse as a consequence of the rubble default. Not 11 happened. The war on terrorism. We destabilized Syria. We destabilized Libya. All manner of negative consequences. Afghanistan collapsed. We had COVID. All of these things happened in the last 50 years since Nixon took the US off the gold standard. And yet, as we showed in the piece, the total primary energy consumed by humans grows in an upwardly sloping gentle sine wave. And it's because all humans ever want a higher standard of living. The human endeavor requires an ever-increasing amount of primary energy. And so it shall be. And this is our big aha. The further we were grass from that primary energy upward sloping sine wave, the quicker we'll snap back to it. And this of course",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 55,
      "start_timestamp": "00:04:41",
      "start_timestamp_seconds": 281.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=281"
    }
  },
  {
    "text": "a higher standard of living. The human endeavor requires an ever-increasing amount of primary energy. And so it shall be. And this is our big aha. The further we were grass from that primary energy upward sloping sine wave, the quicker we'll snap back to it. And this of course was a response to a series of pieces that we've had when we wrote a piece that we thought was kind of a throwaway piece called Pichipo's Amit late last year that it stirred up this ordinance nest of angry response like we were kind of shocked. Like those people who have tied their entire life identities to this concept. And we come at this problem from an above ground chemical background with 20 years experience in the industry. And this concept of Pichipo, I mean, it's just, you know, these are ultimately technopesimists who underestimate the human potential for ingenuity. I feel bad for such people because they've literally tied their livelihoods to it. It's not coming. It's not going to happen. We'll figure it away. We always have and we always will. One question I have for you on that energy consumption thread is you're saying that it's tied to standard of living. Have you analyzed or thought about the tie to an expanding population versus standard of living or vice versa? Oh, sure. So you could do these very famous charts and we've done them where you plot energy use per capita versus GDP per capita. There",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 55,
      "start_timestamp": "00:06:01",
      "start_timestamp_seconds": 361.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=361"
    }
  },
  {
    "text": "tied to standard of living. Have you analyzed or thought about the tie to an expanding population versus standard of living or vice versa? Oh, sure. So you could do these very famous charts and we've done them where you plot energy use per capita versus GDP per capita. There are no rich countries that are energy poor. And in fact, ultimately energy is the economy as we say in the piece. And look, the human endeavor is a constant, unrelenting struggle against the forces of entropy, disorder is spontaneous. Right angles do not appear naturally in the environment. In order to have a high standard of living, you need to impose order on your local environment and it by the law of thermodynamics necessitates that you must harness primary energy and ultimately waste heat. You can't like to balance the energy equations in order to have order, you need to waste heat. And the economy is basically one giant heat wasting machine. You know, abandon your house for a year and you get a sense of the forces of entropy. Your home requires constant maintenance. Check the roofs, make sure like no animals are getting into it and cut back the shrubbery and all of the things that go into running your home. Painting the exterior, all of this stuff. You do these things because left on its own your house would eventually devolve into a chaotic mass. Whereas order is the opposite of chaos and to create and",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 55,
      "start_timestamp": "00:07:14",
      "start_timestamp_seconds": 434.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=434"
    }
  },
  {
    "text": "back the shrubbery and all of the things that go into running your home. Painting the exterior, all of this stuff. You do these things because left on its own your house would eventually devolve into a chaotic mass. Whereas order is the opposite of chaos and to create and maintain order requires a constant stream of primary energy. And if you look at the global south and you ponder the fortified billion people currently living at seventh, sixth or fifth of the energy that we use here in the west, all of those people would love nothing more than to be able to waste as much energy as we do. And I mean waste in the most neutral sense. You can't have order without wasting heat. And who are we to deny them? This prospect that the world is just going to do without, I think, is fundamentally anti-human. How do you decipher the relationship between energy as a contributor to standard of living versus something like technology or is energy a feat to technology in your perspective here? You can't have technology without energy. What's powering the server rooms, like what's powering the data rooms? Who is literally providing the food to the brilliant entrepreneurs and programmers and startup founders and so on that are creating all of this amazing technology? That's why energy is different. Energy is different than labor because you can't have labor without energy. The people working need to eat food is the derivative",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 55,
      "start_timestamp": "00:08:29",
      "start_timestamp_seconds": 509.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=509"
    }
  },
  {
    "text": "providing the food to the brilliant entrepreneurs and programmers and startup founders and so on that are creating all of this amazing technology? That's why energy is different. Energy is different than labor because you can't have labor without energy. The people working need to eat food is the derivative of energy. Clean water is a derivative of energy. And so during times of energy abundance, we have excess energy. Energy can be reasonably well modeled as an input into the economy like all the others. But during times of energy crises is where this, you know, where there's a shortage of energy. And look, if you just take a step back, we know that if all goes to 200 a barrel, what happens? We trigger recession. We know that Germany screwed up its energy policy. It's deindustrializing. It's in the middle of a recession. The UK doesn't produce hardly any of its own energy. There's a victim of the energy crisis. It's in a recession. If the lack of energy is a catalyst for economic malaise, what does it mean in the US to have added to an a half Saudi Arabia since 2010 to it mostly its domestic energy mix? Have you been to Saudi Arabia? Like the sidewalks are paved and cold. When you are in energy superpower, you're wealthy. And then when you're in energy superpower, who has forward integrated world-class manufacturing base to feed that advantageous energy to all the homes in the US that",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 55,
      "start_timestamp": "00:09:45",
      "start_timestamp_seconds": 585.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=585"
    }
  },
  {
    "text": "energy mix? Have you been to Saudi Arabia? Like the sidewalks are paved and cold. When you are in energy superpower, you're wealthy. And then when you're in energy superpower, who has forward integrated world-class manufacturing base to feed that advantageous energy to all the homes in the US that are heated with natural gas or heating their homes at unbelievably cheap prices today, all of the cogeneration facilities that are heavy manufacturing centers across the US are experiencing windfall cost reductions compared to their global competitors. You plug two and a half Saudi Arabia into a pretty strong manufacturing sector with all of the other geo advantages that we described earlier. It's very hard to imagine why it would be that a recession would suddenly inspauntany some materialize. And we got it wrong. Let's understand why we got it wrong. I think we have a pretty good theory. I think the interesting part of that theory though, at least to me, is you guys have a lot of expertise. You guys have a fair-sized team. I don't know how big your team is obviously, but you have a lot of smart people as the punchline. And it's interesting to me that you guys seem to come across this last year as compared to the some other time when you guys were analyzing the prospects of recession. What do you think led you guys to coming up to this concept last year versus some other period in time? Look, the",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 55,
      "start_timestamp": "00:10:55",
      "start_timestamp_seconds": 655.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=655"
    }
  },
  {
    "text": "me that you guys seem to come across this last year as compared to the some other time when you guys were analyzing the prospects of recession. What do you think led you guys to coming up to this concept last year versus some other period in time? Look, the Fed raised rates from 0 to 5 in the snap of a finger and nothing broke. And I could tell you that if you were to ask us that in 2022, we would have said things would break. They didn't. So I think as an analyst, if you're a content creator in the finance energy world, and you produce that the volume and cadence that we do, you're going to get some things right. We've got a lot of things right. I'm proud of the things we've got right. We got the sanctions right, for example, from the earliest days. I think that's one of our best calls. But you're going to get some things wrong. And how you react to the things you got wrong is the defining characteristic of your team. We intend to be doing this for decades. So what happened in late 2023 and even now as GDP prints came in hot and jobs reports came in hot. The people that were in the recession camp many of them found ever creative ways to try to figure out how this data was wrong or fraudulent. And to me, that that reeks of advocacy, not analysis. I",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 55,
      "start_timestamp": "00:12:03",
      "start_timestamp_seconds": 723.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=723"
    }
  },
  {
    "text": "as GDP prints came in hot and jobs reports came in hot. The people that were in the recession camp many of them found ever creative ways to try to figure out how this data was wrong or fraudulent. And to me, that that reeks of advocacy, not analysis. I mean, at some point you have to trust some data, does the government massage the data for political reasons sure? But like there is a manufacturing construction boom going on in the US. And in the next two job prints, we're going to see ever increasing manufacturing jobs as those construction projects wrap up. And the people who are going to work in those factories, you know, start checking in. If you get something wrong, you have to try to understand why. And that's how you get better. And if you're stuck on insisting that every jobs report is made up. Oh, look at the part-time versus the full-time or look at the seasonal adjustments and so on and so on and so on. I think you can very quickly, you know, lose the chance to learn something. And so we're always more than willing to be wrong as long as we learn. We have a philosophy here. And we're putting out a piece a couple of days from after we're recording this called Lucense where you know every 30 to 40 pieces related to look back at what we wrote and see what we got right and what we",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 55,
      "start_timestamp": "00:13:03",
      "start_timestamp_seconds": 783.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=783"
    }
  },
  {
    "text": "as we learn. We have a philosophy here. And we're putting out a piece a couple of days from after we're recording this called Lucense where you know every 30 to 40 pieces related to look back at what we wrote and see what we got right and what we got wrong and admit our mistakes and explain to our subscribers why we made them and what we learned from them. I think this is very healthy. You know, we intend to be in this business for decades. And the only thing worse than being wrong is having no view. So long as you are willing to show your homework and to authentically embrace why it is that you got something wrong so that you can implement that mindset of continuous improvement. And that is one of our brand ambitions. Our long-term subscribers know this is always how we have behaved and how we intend to continue to behave. And I think it's pretty healthy. It's a great way to be because that way you don't need to worry about what if I got something wrong. Because if I got something wrong, it's just going to be an opportunity for me to explain to our subscribers what it is we got wrong why and what if we learn from it. So our mistake management philosophy has four parts. Mistakes shall be rare admitted to corrected and learned from. It's just that simple. Yeah and that makes a lot of sense",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 55,
      "start_timestamp": "00:14:12",
      "start_timestamp_seconds": 852.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=852"
    }
  },
  {
    "text": "me to explain to our subscribers what it is we got wrong why and what if we learn from it. So our mistake management philosophy has four parts. Mistakes shall be rare admitted to corrected and learned from. It's just that simple. Yeah and that makes a lot of sense to be clear. I'm not harping on whether the any call is right or wrong to be honest from from my perspective the idea of judging the merit of something based on right or wrong is at least in this context with economic systems that are like wildly complex. That's less interesting to me. The part that I was really honing in on there was what do you think led to you guys coming across this change last year compared to another point in time. And it sounds like the summary of that was the rate change environment was very unique. And that's that was the catalyst for the assessment there. The lack of a follow-through of a recession once the rates were hiked so violently. Right. So you see you know Powell takes it from zero to five. And if you look at the GDP prints like show me on the chart where Powell you know raised the rates you can't find it. And so one interpretation is the data is all made up. That's fine. Another interpretation is wow something is fundamentally different here what's going on. And then we realized sort of an aha moment as the",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 55,
      "start_timestamp": "00:15:08",
      "start_timestamp_seconds": 908.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=908"
    }
  },
  {
    "text": "on the chart where Powell you know raised the rates you can't find it. And so one interpretation is the data is all made up. That's fine. Another interpretation is wow something is fundamentally different here what's going on. And then we realized sort of an aha moment as the US shell patch kept producing record print after record print that maybe these two things were connected. You can't on the one hand understand why it is that Germany is de-industrializing because they have totally screwed the pooch on their energy policy. And then look at the US producing 20 million barrels of oil in petroleum products a day 105 BCF of natural gas a day more cold than it burns all the nuclear fleet humming along at 9 capacity factors. And say to yourself this is an environment that is conducive to a recession. Just isn't. So it isn't like that there was staring in a face and look we were we got it wrong. And when we told our subscribers when we came and the big realization for us came in November to give you a bit more detail. So every month we have a pro tier who in addition to our articles they get a monthly doom zoom which is usually a 40 slide presentation from us but can also be a similarly land public or a presentation from an expert in a field like this month we're going to record hopefully tomorrow a uranium supply chain",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 55,
      "start_timestamp": "00:16:14",
      "start_timestamp_seconds": 974.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=974"
    }
  },
  {
    "text": "in addition to our articles they get a monthly doom zoom which is usually a 40 slide presentation from us but can also be a similarly land public or a presentation from an expert in a field like this month we're going to record hopefully tomorrow a uranium supply chain expert talking to us about the journey from or to fuel and all the nuances in between. So we do that once a month and in November we decided to do a deep dive on the global natural gas market and it was called simple molecule complex markets. And after doing the research for that we went all around the world like we not physically but you know we looked at Qatar we looked at Saudi Arabia we looked at Europe we looked at North America we looked at Australia and Russia and South America and we came to the conclusion that there was a lot of natural gas coming and that the world had pivoted from energy scarcity to energy abundance. And we often say from the beginning of Dumber the most important question and analysts must ask themselves about an economy is is that economy currently in a state of energy abundance or energy and by the way the very pondering of that question implies two possible answers and we came to prominence during an energy crisis. So for the vast majority of time that Dumber has been a thing the world was short energy. It's an elongated",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 55,
      "start_timestamp": "00:17:20",
      "start_timestamp_seconds": 1040.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1040"
    }
  },
  {
    "text": "state of energy abundance or energy and by the way the very pondering of that question implies two possible answers and we came to prominence during an energy crisis. So for the vast majority of time that Dumber has been a thing the world was short energy. It's an elongated short energy we came to that conclusion in November that was a profound one for us and so we did the doomsom for our pro tier then we wrote a full article called liquefied natural glad and then because this was a significant change in our view we sent to all of our paying subscribers for free a copy of that November doomsom and then we've since followed it up with several pieces like slick landing which explains why the US has not fall fall into a recession and so on like if we have a change in view we want our subscribers to know it but really the turning point for us was in November we had seen these hot GDP prints we'd seen the hot job prints and then concurrently we were starting the natural gas market for our pro tier and we came to utilization like wait a minute natural gas is 25 of global primary energy and we're swimming in it we're not short energy anymore and what does that mean well that that might explain why the US didn't fall into a recession for example I see so the first thing is I have to",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 55,
      "start_timestamp": "00:18:24",
      "start_timestamp_seconds": 1104.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1104"
    }
  },
  {
    "text": "a minute natural gas is 25 of global primary energy and we're swimming in it we're not short energy anymore and what does that mean well that that might explain why the US didn't fall into a recession for example I see so the first thing is I have to give a shout out to doomsom it's just so great I love the branding on that I love that um you also as you were talking about this you reminded me of a quote one of my mentors used to say to me which was a wise man changes his opinion a fool never does so it seems to be a pro here now going back to this idea of a recession so it sounds like at least as of thus far you're of the opinion that we've successfully avoided a recession do you view it still as on the table or do you view it as something that is probably been averted I think the odds of a recession before the election which was the time frame that we had constrained our analysis to is very low um Biden is a political animal or at least the people around him who still have access to their full mental capacities are political animals and they understand somebody on that team understands commodities which is why the SPR draining gambit worked out so well ahead of the midterms and I think this move to put a pause on energy exports which",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 55,
      "start_timestamp": "00:19:25",
      "start_timestamp_seconds": 1165.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1165"
    }
  },
  {
    "text": "him who still have access to their full mental capacities are political animals and they understand somebody on that team understands commodities which is why the SPR draining gambit worked out so well ahead of the midterms and I think this move to put a pause on energy exports which will signal to the US market that you know a glut might be coming and has really dampened at least contributed to the dampening of of a drawdown in the natural gas curve futures curve here in the US by the way we originally interpreted that incorrectly and that would be the lead um point that we make in the piece that we publish later this week about grading ourselves on the past 30 to 40 pieces um they understand that cheap natural gas is good for the economy and they want to do everything it can for the US to avoid a recession ahead of the midterms or sorry ahead of the president's election this time and so I think they will be successful and look this is not a partisan statement if you hate Biden and you think Trump you know was done wrong in the last election and you hope that he wins this time you have to be cognizant of the fact that somebody on the Biden team has made a sure move first in draining the SPR for raw political purposes and now in keeping the world's largest source and cheapest source of hydrocarbons stuck",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 55,
      "start_timestamp": "00:20:31",
      "start_timestamp_seconds": 1231.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1231"
    }
  },
  {
    "text": "and you hope that he wins this time you have to be cognizant of the fact that somebody on the Biden team has made a sure move first in draining the SPR for raw political purposes and now in keeping the world's largest source and cheapest source of hydrocarbons stuck in the US um somebody understands what's going on um when Joe had full access to his mental capabilities um I remember interacting with senator Biden back in the day when I was in industry and he always had a visceral understanding for the price of gasoline at the pump and what it meant for national political figures and and so I think it's dangerous to underestimate your political opponents assuming that you know perhaps most of your listeners would fall on the conservative side um I think the fact that the election has the the recession has a materialized is is a net tailwind for the incumbents if Republicans were in office and no recession materialized when one was expected that would be bullish for them as well um the incumbents have home field advantage and they are doing whatever they can to avoid a recession and I think you need to factor that into your models um period whatever it makes you feel about the outcome like this is reality that needs to be uh properly incorporated and how you think about things if you were to steal man the argument for a recession to then come back",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 55,
      "start_timestamp": "00:21:43",
      "start_timestamp_seconds": 1303.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1303"
    }
  },
  {
    "text": "you need to factor that into your models um period whatever it makes you feel about the outcome like this is reality that needs to be uh properly incorporated and how you think about things if you were to steal man the argument for a recession to then come back on the table what would that look like oh you could imagine that the property collapse in China and the de-industrialization of Europe and um you know um uh uh uh political um polarity in the U.S leading to societal disruptions I mean I don't think that we're free and clear of of any possible downside I'd say like all things being equal plugging two and a half-satellar rabies into a manufacturing base is not an environment that's conducive to a recession but there's all kinds of ways we can screw up from here and if we do our prediction that we probably won't before the election will have been wrong which is fine because we have a protocol to manage those things um but I think you know a total collapse of China which is possible um and you know our export partners and import trading partners struggling as much as they are like the U.S. is an island right now of economic strength um but that's you can imagine scenarios where despite the energy tailwinds we still manage to find ourselves in a recession yeah definitely so thinking of those kinds of scenarios what would you oscillate as",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 55,
      "start_timestamp": "00:22:52",
      "start_timestamp_seconds": 1372.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1372"
    }
  },
  {
    "text": "much as they are like the U.S. is an island right now of economic strength um but that's you can imagine scenarios where despite the energy tailwinds we still manage to find ourselves in a recession yeah definitely so thinking of those kinds of scenarios what would you oscillate as the most viable if it were to occur again in a steel man context and for those that might not be familiar with that we're just we're playing the other side of the argument just they always infer yeah always infer and so um I think the the most likely is um a sort of upheaval in China I mean I do think that Xi Jinping runs a sort of Stalin-esque form of government where nobody tells them the truth and history teaches us that such systems tend to be very meta-stable and can collapse rather quickly and the the property situation the stock market gyrations in China um you know they're there's such a huge part of the global economy right now that a sudden sort of crisis in China could be a catalyst now it should be said that people have been predicting this since uh 60 minutes first expose the ghost cities a decade ago uh I remember being in China entering a ghost city and thinking oh my god this is all a facade that's going to collapse that was a long time ago and nothing has collapsed um it it's the the functionally equivalent of",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 55,
      "start_timestamp": "00:23:58",
      "start_timestamp_seconds": 1438.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1438"
    }
  },
  {
    "text": "first expose the ghost cities a decade ago uh I remember being in China entering a ghost city and thinking oh my god this is all a facade that's going to collapse that was a long time ago and nothing has collapsed um it it's the the functionally equivalent of arguing about the um you know the in the the pyramid scheme that is so security yes we all know it is but yet the checks keep going out every year um the yes the US is is a cesspool of waste and mismanagement and huge deficits and the fiscal cliff and all of these things and yet treasury auctions keep going off you know at reasonable terms so in you know um until it happens it won't happen and if it does happen it would be catastrophic I do think we're keeping close eye in China it and the problem with China is it is impossible for a Western analyst to make any sense of the data um we have lots of friends in China but even they or hesitant to like send you anything meaningful over reach out because they know they're being you know monitored all this other stuff and so um China is a giant Ponzi scheme but if there's one thing we've learned from the 2008 crisis and the European you know uh foreign or the government bond crisis is that Ponzi schemes with the full support of the government can go on for a",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 55,
      "start_timestamp": "00:25:23",
      "start_timestamp_seconds": 1523.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1523"
    }
  },
  {
    "text": "other stuff and so um China is a giant Ponzi scheme but if there's one thing we've learned from the 2008 crisis and the European you know uh foreign or the government bond crisis is that Ponzi schemes with the full support of the government can go on for a very long time and so you know if you push just everybody knows Europe is a basket case and that's priced in but China is a black box and so if you're looking for areas of potential surprise for deviations from what the sort of consensus view is I think China is probably a decent place to start interesting would you outline a little bit more I know it's a potentially really deep objects so I'm not looking to to put you through that but just to understand a little bit better your assessment of China's a Ponzi scheme can you explain that a bit more? the the the the entire engine nothing entire a major source of the engine of economic growth in China for the past 20 years has been a speculative bubble in construction mostly of residential apartments but entire city infrastructures there was this need to keep that bubble blowing and also a thought that there would need to be homes for hundreds of millions of people who eventually came in from the countryside and and were sort of not migrant laborers but became part of the middle and professional class in China and you know",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 55,
      "start_timestamp": "00:26:31",
      "start_timestamp_seconds": 1591.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1591"
    }
  },
  {
    "text": "keep that bubble blowing and also a thought that there would need to be homes for hundreds of millions of people who eventually came in from the countryside and and were sort of not migrant laborers but became part of the middle and professional class in China and you know when I when I hear people talking about the demographics of China and they they should have due top-down looks I always try to remember that the number that matters most in China is the size of its middle class and is that growing? and the middle class can be joined by by any age group you know as soon as a ascending economic ladder so I wouldn't underestimate China but there are thousands of large empty apartment buildings for whom speculation on the level of what we saw in the US housing market before they collapsed like 2006 2007 you know a huge amount of individual savings i.e household net worth in China is tied to what I believe to be air pockets yes you own claim to apartment 281 of building x26 in ghost city a 14 nobody wants that and you haven't marked in your books at a million bucks and then you just sold it to somebody else for 1.1 Ponzi schemes require ever fresh sources of capital before they ultimately collapse and this one that is perhaps the greatest in the history people have been warning about it for as long as we've been paying",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 55,
      "start_timestamp": "00:27:45",
      "start_timestamp_seconds": 1665.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1665"
    }
  },
  {
    "text": "a million bucks and then you just sold it to somebody else for 1.1 Ponzi schemes require ever fresh sources of capital before they ultimately collapse and this one that is perhaps the greatest in the history people have been warning about it for as long as we've been paying attention to China and so it's one of those chicken little type situations but it is real like I've seen them I've been there and it's awe inspired it's jaw dropping when you see an entire city designed centrally planned from scratch built a modern specifications the copper and the concrete and the wood and the finished carpentry and the plumbing all of it built for nothing just sits there and then it becomes a vehicle for speculation and the speculation is rampant and then all of those asset values are marked to market and perhaps use this collateral for debt and so when you look at the stock market collapse in China and you look at the collapse of the various you know construction companies and so on it's it's pretty hard to imagine how the CCP keeps a handle on things now they have the full weight of government behind them and the military behind them and the desire to keep extending and pretending and so maybe this isn't the year but it it seems clear that at the heart of all of this is very little in the way of fundamental economic you know these investments aren't",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 55,
      "start_timestamp": "00:29:22",
      "start_timestamp_seconds": 1762.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1762"
    }
  },
  {
    "text": "government behind them and the military behind them and the desire to keep extending and pretending and so maybe this isn't the year but it it seems clear that at the heart of all of this is very little in the way of fundamental economic you know these investments aren't in producing assets they're in assets that are basically then become vehicles for speculation and it is staggering like in the years where I was traveling to China you could see the change and like it's important to like go to these places people making fun of Tucker Carlson because it was tripped to Moscow and you know how impressed he was with the subway and the grocery stores and a beautiful Moscow is the city I would say most of the people making fun of Tucker have never actually traveled to these major cities and as you do travel around the world you see the differences and you get a you get a sense of course some of it is managed and yes you know western business people get treated differently then the locals and all of that stuff but there is still something very visible traveling there and one of the ways this manifests for me is and we've written about this from the earliest days there's techno arrogance that we have in the west that the Chinese and the Indians and the Russians were would be unable to keep the Russian energy complex going in the face",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 55,
      "start_timestamp": "00:30:43",
      "start_timestamp_seconds": 1843.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1843"
    }
  },
  {
    "text": "one of the ways this manifests for me is and we've written about this from the earliest days there's techno arrogance that we have in the west that the Chinese and the Indians and the Russians were would be unable to keep the Russian energy complex going in the face of western sanctions it's just it's just redevignaments I I toured the major universities in India and China and lectured at some of them and and you see the army of petroleum engineers the China is putting out every year and how difficult it is to get into IIT the IT school system in India and how everybody ever met in my life who had a degree from Moscow state was just a genius we used to call it the genius school we underestimate these people at our own peril and by the way let's take a look at the US University System in comparison like who are we kidding so you know until you go there and you see it and you live it you feel that you touch a you eat with the people you you stay with the people my friend Nate Hagen's who you know probably has different views than we do great youtuber and thinker just spent I think a six or seven weeks in India and then his response to having been there for the first time resonated with me because I've been to India many times and and I I have sympathy for",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 55,
      "start_timestamp": "00:31:52",
      "start_timestamp_seconds": 1912.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1912"
    }
  },
  {
    "text": "has different views than we do great youtuber and thinker just spent I think a six or seven weeks in India and then his response to having been there for the first time resonated with me because I've been to India many times and and I I have sympathy for him or not sympathy I can understand how he can be so blown away by actually going and visiting and and if you don't go and you don't visit you don't know you just don't and so like you can make fun of Tucker all you want at least he had the you know what to go and he scored an interview with Putin and I watched it and sorted a billion other people and it was interesting to me I think Putin got a lot of stuff wrong but I wanted to hear it and and and kudos to Tucker for having done it definitely on that exact threat I actually think that that's one of the coolest things about people that join the military is because it gives them a chance to at least see some other places because I do find Americans in general and I'm a red blooded American I'm a patriot but I do think a lot of Americans are very close-minded and we don't have a respect or other places what other places value how other places behave and we use our value system for them all that kind of stuff gets really interesting",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 55,
      "start_timestamp": "00:32:47",
      "start_timestamp_seconds": 1967.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=1967"
    }
  },
  {
    "text": "red blooded American I'm a patriot but I do think a lot of Americans are very close-minded and we don't have a respect or other places what other places value how other places behave and we use our value system for them all that kind of stuff gets really interesting to me yeah I would say a very important follow on to that which is because nobody's gone anywhere and nobody's served in the military we have a very loose relationship with war and and I think we we would do well to have a little bit of higher bar to have picking fights with powerful people around the world you know you you go into a bar today and there's a guy there and he's got a cut off gene jacket on he's ripped six four looks like he was tied in for a D1 school and he's got tattoos up and down his arms and he's looking around and saying if anybody sits in this stool next to me I'm going to punch him in the face so you're just going to go sit in that stool now give it a little bit of wide birth you know like we live in a dangerous world with people who could do violence to us and the exact same mental processing you do when you walk into a bar or you walk into a public situation where you're gut instinct your spotty sense tells you that you know something might",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 55,
      "start_timestamp": "00:33:37",
      "start_timestamp_seconds": 2017.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2017"
    }
  },
  {
    "text": "like we live in a dangerous world with people who could do violence to us and the exact same mental processing you do when you walk into a bar or you walk into a public situation where you're gut instinct your spotty sense tells you that you know something might go down here and I'm going to like keep my back to the wall and keep an eye on the exit we ought to have that in our foreign policy and I think too many of the people in DC have too low regard for the cost of war because they're not the ones paying you know cash in those checks and and have too little appreciation for the other cultures of the world and here we are world war three basically and we sleepwalked into it and and that's I think significant challenge. Talk to me about the world war three comment well I mean I often wonder when everybody sort of in the US for example thought world war two began and I think they would all probably say when Pearl Harbor started but if you go back in history you'll see world war two actually really began when Japan invaded China in the 30s and everything that followed from that led to the dominoes that became world war two and I wonder when historians will look back at this time and say world war three started we have a proxy war between Ukraine and Russia which is",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 55,
      "start_timestamp": "00:34:44",
      "start_timestamp_seconds": 2084.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2084"
    }
  },
  {
    "text": "when Japan invaded China in the 30s and everything that followed from that led to the dominoes that became world war two and I wonder when historians will look back at this time and say world war three started we have a proxy war between Ukraine and Russia which is essentially a war between NATO and Russia which is essentially a war between the US and Russia that's a hot war I've spent the last couple of months going down the rabbit hole of these these mappers were chronicling the day-to-day ebbs and flows of the line of contact between Russia and Ukraine and it probably won't write about it but it's interesting to me and because of the connections to the energy markets is how I sort of got into this because Russia shuts an important you know the energy exporter and then when you compare what you can learn just from open source from people that you sort of categorize people into their sort of Russia focus or Ukraine bent or some people that try to be down the middle and then you could be two three weeks ahead of the mainstream media and then you see how things are characterized in the media totally inconsistent with reality on the ground you begin to question of course you know what you're being fed we're in world war three like we have that conflict in Ukraine which by the way when I watch those videos you see that Putin",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 55,
      "start_timestamp": "00:35:51",
      "start_timestamp_seconds": 2151.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2151"
    }
  },
  {
    "text": "things are characterized in the media totally inconsistent with reality on the ground you begin to question of course you know what you're being fed we're in world war three like we have that conflict in Ukraine which by the way when I watch those videos you see that Putin is just leveling these towns in these villages right I mean step one is they carpet bomb them step two is they they they sent in the stormtroopers and then step three is they occupied them and raised the Russian flag and they're just doing it over and over and over again and they've got complete domination of the air and I think one of the under appreciated catalysts say or blacks one events for 2024 is is a rapid collapse of Ukraine and so lensky being ousted in a coup I think that's real I think that's possible as being totally downplayed in the west and market participants need to have that on the radar now we have a kinetic conflict in the middle east and where the ones are being Israel um and much of the rest of the least is uniting against the west it's not being reported at all how we are being pummeled at the United Nations both in the security council then I think eventually uh at the floor of the general assembly the world is lining up against our support for Israel whatever your views on the war are like I get again",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 55,
      "start_timestamp": "00:36:53",
      "start_timestamp_seconds": 2213.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2213"
    }
  },
  {
    "text": "reported at all how we are being pummeled at the United Nations both in the security council then I think eventually uh at the floor of the general assembly the world is lining up against our support for Israel whatever your views on the war are like I get again it's a controversial topic I spend a lot of time studying Israel um and its history and um but just agnastically as an analyst we're losing the public relations war um here and then you have the tensions with China and by the way if China is that blacks one event with the property collapse and so on the CCP will create a war that's what that's what you know dictators do and so we have this strange cyber attack last week which kind of caught our eye you know like literally as I'm talking to you trending on on x which I still use as a as a news following sources of World War III um and I think we're a lot close to World War look we have the houthis shutting down the red sea we have the war in Gaza we have potential spread to the north we have a potential direct connect conflict with with Iran and by the way over the weekend I'm watching and this is not reported in the US at all I'm watching um you know geolocated videos of ten thousand dollar drones tracking billion dollar patriot missile systems and guiding cheap",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 55,
      "start_timestamp": "00:37:52",
      "start_timestamp_seconds": 2272.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2272"
    }
  },
  {
    "text": "we have a potential direct connect conflict with with Iran and by the way over the weekend I'm watching and this is not reported in the US at all I'm watching um you know geolocated videos of ten thousand dollar drones tracking billion dollar patriot missile systems and guiding cheap missiles to destroy them I've seen three such videos in the past week these run a billion dollars upon and cheap drone warfare is changing the battlefield have we caught up to this as congress debates sixty billion dollars to send into that you know in front of it may be that that's what we should do I'm not making a case either way but I'm watching billion dollar patriot missiles being destroyed by weaponry that I personally could afford to buy I'm of course I would have never you know I'm not an engage in an arms dealing but I could afford to destroy a billion dollar patriotism today and that's profound and I don't think a bureaucracy has cut up to this and a big ahaha for us is the same architects of our insane sanctions policy and Europe's crazy energy policy are the political force behind the military strategy and they look as you probably know a military is only as good as its political leaders like the troops can be well trained but they're told what to do and if those decisions are terrible the troops suffer and if you have very bad political issue I",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 55,
      "start_timestamp": "00:39:08",
      "start_timestamp_seconds": 2348.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2348"
    }
  },
  {
    "text": "military strategy and they look as you probably know a military is only as good as its political leaders like the troops can be well trained but they're told what to do and if those decisions are terrible the troops suffer and if you have very bad political issue I don't care how good the military is that military is in trouble assuming they follow orders and so it's pretty we're at a very dangerous point here in the west we have the president who I think objectively is is not all there and who is insisting on sleepwalking us into the major war with at least one and potentially two you know nuclear superpowers and I'm old enough to remember when wars required of other Congress so it's scary times based on that I can follow a lot of your train of thought how do you define wool war three like how do you define a wool war because me there's a slight disconnect there at least in terms of the way that you're laying out the timeline meet before when you were singing maybe I misheard but before I'm saying that we're in war three look what's going on right now is or at least the third time in the past 100 years Russia is marching from east to west and raising the lands as they moved towards western Europe that war is being funded by the US so in the prior two times that this has happened",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 55,
      "start_timestamp": "00:40:26",
      "start_timestamp_seconds": 2426.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2426"
    }
  },
  {
    "text": "on right now is or at least the third time in the past 100 years Russia is marching from east to west and raising the lands as they moved towards western Europe that war is being funded by the US so in the prior two times that this has happened in the past 100 years we were allies with them and the opponent was Germany now we're allied with Germany and we're funding basically Ukrainian resistance and if you doubt that you can just see how quickly Ukrainian resistance has been falling as weapons supply has dried up from the west and of course that makes total sense we are funding and providing the weapons for is Israel's war in the Middle East again whatever think of October 7th whatever you've used our on Palestinians right to self determination and all those things forget about all that there is a hot war going on in the Middle East and we are supplying weapons or one side which means we're at war with the other side we're not supplying weapons for the Palestinians or go the US is at war with the Palestinians I mean I think it's we should just say it and we should debate whether that's the right thing to do but that is what we're doing and then we're gearing up for a confrontation with China, vis-a-vis Taiwan so it feels to me like 1941 before Pearl Harbor we were supporting the UK you know land lease",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 55,
      "start_timestamp": "00:41:42",
      "start_timestamp_seconds": 2502.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2502"
    }
  },
  {
    "text": "say it and we should debate whether that's the right thing to do but that is what we're doing and then we're gearing up for a confrontation with China, vis-a-vis Taiwan so it feels to me like 1941 before Pearl Harbor we were supporting the UK you know land lease the whole nine yards we were supporting certain parts of a European war which means we're effectively at war with the other side we were supporting the Russians in their war with Germany and we were supporting China in their war with Japan and then when the Japanese attack Pearl Harbor we became officially part of the war but if all of that is true then World War 2 actually started when Japan first invaded China in the early 30s and Hitler came to power in 33 and in all of those events that sort of led to what we now call World War 2 I see the echoes of that pattern here today I see yeah I from my ignorant perspective I think that that suffers a little bit from hindsight because then if you look back at any conflict between two countries that then didn't have the rest of the war and then we've had a hundred degrees that if we end up having a hot war with China then the collective action of the past three years was probably in hindsight we'll be labeled as war war through I mean I would agree that that's a catalyst",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 55,
      "start_timestamp": "00:42:55",
      "start_timestamp_seconds": 2575.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2575"
    }
  },
  {
    "text": "of the war and then we've had a hundred degrees that if we end up having a hot war with China then the collective action of the past three years was probably in hindsight we'll be labeled as war war through I mean I would agree that that's a catalyst for the world war but I wouldn't consider that war war because so let me give you a different view 110,000 people died of fentanyl overdose last year in the US China makes all the precursors for that and if you look over the fentanyl deaths are it's basically the US in Canada how is that not a chemical warfare act by China on the US it's a piece we've pondered writing we haven't written it yet we've done some studying of it they know where the precursor factories are they know how to shut nothing happens in China without the CCP's approval drugs finding their way to directly into the US and through Mexico are at least with a knowingly deadly poison that is killing a hundred thousand military age people a year I mean just because it's not tanks in artillery and planes doesn't mean we're not a war just this week we've got another balloon flying over the US I don't know what any of that means but like cyber attack last week like there are the modern embodiment of war between superpowers need not necessarily be a traditional game of acts you know like it it",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 55,
      "start_timestamp": "00:44:17",
      "start_timestamp_seconds": 2657.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2657"
    }
  },
  {
    "text": "war just this week we've got another balloon flying over the US I don't know what any of that means but like cyber attack last week like there are the modern embodiment of war between superpowers need not necessarily be a traditional game of acts you know like it it it a hundred thousand people died last year from something that China is doing on purpose to the American Peter are we at war with China I would say no or not yeah I would say perhaps we should ponder whether we are because they might be at war with us and we don't know it or yeah and I think we're in direct competition to your point I think with places like that we continually fraud one another to find weaknesses but again just from my layman's perspective war is a defined thing how do you think the CCP would react if we were doing something that we knew we're killing a hundred thousand of their citizens a year I'm not convinced that we're not yeah well it's fair enough there you go even more proof yeah I don't know my view is in 10 years and 20 years time we will look back at 2022 2023 and 2024 and characterize this time period as the beginning of World War III I hope I'm wrong by the way yeah because I have you know draft eligible children yeah I mean it's it really is a fascinating perspective and I",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 55,
      "start_timestamp": "00:45:29",
      "start_timestamp_seconds": 2729.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2729"
    }
  },
  {
    "text": "time we will look back at 2022 2023 and 2024 and characterize this time period as the beginning of World War III I hope I'm wrong by the way yeah because I have you know draft eligible children yeah I mean it's it really is a fascinating perspective and I enjoy you sharing it with me because it just it continues to elucidate how complex of an environment that we're in we're even you and I we're talking about a specific term just a term yeah and meanwhile behind what we're talking about we're just massive pieces moving and to your point I do fully agree with you that this this time could absolutely be a precursor when you look at the relationship between the US Russia and China kind of that trio what comes to mind I think a tragedy of missed opportunities comes to mind I think in a world where the three great powers behave in a manner that sort of prioritized mutual respect things could have evolved quite differently but they didn't and things have evolved the way they have I think for example in a piece we wrote eight last year I believe the Western hemisphere did not even mess around with Europe or the Middle East or China we have so much here that we could just do you know I'm old enough to remember when the the Department of Defense was meant to defend the US like let's start there you know what",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 55,
      "start_timestamp": "00:46:41",
      "start_timestamp_seconds": 2801.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2801"
    }
  },
  {
    "text": "hemisphere did not even mess around with Europe or the Middle East or China we have so much here that we could just do you know I'm old enough to remember when the the Department of Defense was meant to defend the US like let's start there you know what what are we doing all over the world and defending you know shipping lanes in a release so that China could have access to energy let China let China's Navy take care of the Middle East and they don't have one well they best start best start build one you know like it what are we doing you let's say we're doing that out of the kindness of our hearts no I I do think there is a very strong look I think Eisenhower is right I think the military industrial complex in the US is is extremely strong and greedy and is pillaging the US treasury spending blood that's not theirs I think our bar to going to war should be much higher I think Lindsey Graham is one of the most reprehensible figures in modern politics I I see him on Fox news demanding we start carpet bombing and raining refineries like get in the plane you do it like what what what are we doing like you first you know like that by the way are you ready for the counter punch you know walk up to that guy at the bar in the sleeveless gene jacket",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 55,
      "start_timestamp": "00:48:18",
      "start_timestamp_seconds": 2898.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2898"
    }
  },
  {
    "text": "and raining refineries like get in the plane you do it like what what what are we doing like you first you know like that by the way are you ready for the counter punch you know walk up to that guy at the bar in the sleeveless gene jacket with the with the you know rip muscles in the tattoos and sit on that stool next to him and put your finger in his face I mean go ahead let's see how it goes it's insane like we we have this view that we're the dominant superpower we could do whatever we want and I just don't think that is conducive to world peace or economic development or human prosperity and I think it risks nuclear war like can we have a vote in congress please I it's mind boggling to me the flippant way in which major US politicians like Lindsey Graham think war is in our kid game and all they got to do is put more quarters in the machine and they could keep playing like we have vulnerabilities one of the reasons you don't go to war as you might lose it and and lord knows our track record in this regard in the past few decades is not been a glorious one I remember people hanging on to us air force jets as they flew out of SKS tank not that long ago like what did we do and the sacrifice of the countless",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 55,
      "start_timestamp": "00:49:25",
      "start_timestamp_seconds": 2965.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=2965"
    }
  },
  {
    "text": "knows our track record in this regard in the past few decades is not been a glorious one I remember people hanging on to us air force jets as they flew out of SKS tank not that long ago like what did we do and the sacrifice of the countless men and women and largely American soldiers who died there during that war what was it for and how tragic is that same thing with Iraq same thing with Libya what are we doing like can we take a beat can we take a pause can we have a national conversation about the neocons and whether we need to be the world's police how about we start being the US's police I don't know what do your thoughts on the concept of like a defense and death the big thing from military doctrine I'm curious what your thoughts are on it I'm unfamiliar with the terms so maybe you can yeah not served in the military which is why I perhaps have a lot of respect for people who have from from a defensive position like if if my notebook is this is the border this is where we are and then this is where the enemy is defense and depth is a concept where we don't want our first lines of defense to be here we want it to be here here and here here here I get that where does it end how much is enough and by",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 55,
      "start_timestamp": "00:50:44",
      "start_timestamp_seconds": 3044.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=3044"
    }
  },
  {
    "text": "and then this is where the enemy is defense and depth is a concept where we don't want our first lines of defense to be here we want it to be here here and here here here I get that where does it end how much is enough and by the way like let's start with our border where you know we have 10 million people crossing the border to I've flown into the US countless times and stood in customs and immigration lines and make sure that you have make sure that you have your papers in order and and all these other things and we have 10 million people crossing the border many of whom are military age men again are we in World War how many of them are from China how many of them are from Iran or their proxies how many of them are from the drug cartels I saw a story last week where gangs of people that have come over the border are rating rich neighborhoods in Detroit and bringing their loot back down to Texas like this is coming like 10 million people is a lot and the disparity between what you and I do taking your shoes off at TSA and all of that security theater standing in line for an hour at a time at Lagardia or pick your favorite airport at land and all here meanwhile people just scrolling across the border and like where where is national defense",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 55,
      "start_timestamp": "00:51:59",
      "start_timestamp_seconds": 3119.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=3119"
    }
  },
  {
    "text": "and I do taking your shoes off at TSA and all of that security theater standing in line for an hour at a time at Lagardia or pick your favorite airport at land and all here meanwhile people just scrolling across the border and like where where is national defense is that literally not the definition of national defense the book that you just held up the binding of that book is that not like does not begin with the US border and somehow approximately when you crane matters more than the border between Mexico and Texas I think one one thing I would offer to that at least from my perspective is I I think we when we when people talk about these things we fall into kind of like binary positions and I'm not sure that I've seen anywhere somebody say or even in the way that we behave that one is discreetly more important than the other now I get probably your point based on where the money is flowing the amount of money the actions were taking those kinds of things so on that on that thread though what would you suggest for the border out of curiosity I just think having interacted with US immigration for a fair part of my life and always try to do so legally that like we have laws for reason and they should either be enforced or not and anybody who's cross bridged to Canada or you know flown",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 55,
      "start_timestamp": "00:53:09",
      "start_timestamp_seconds": 3189.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=3189"
    }
  },
  {
    "text": "of curiosity I just think having interacted with US immigration for a fair part of my life and always try to do so legally that like we have laws for reason and they should either be enforced or not and anybody who's cross bridged to Canada or you know flown in from overseas and I flown all over the world and in every country I've landed I have to produce my passport they ask me what I'm doing there I fill out forms I am a privileged guest of that government while I'm in their country which is their national territory there's sovereign territory and I think a country without borders that it complies as no country at all and I understand that there's humanitarian issues and all that but we used to handle those in the you know we had we the US has always been a country of immigrants and the assimilation of immigrants into the country is part of the fabric the tapestry of what makes this country great I'm very much for a vibrant legal immigration system and even the people that are desperate to get here you know they do have rights and we should treat them with dignity and respect because of humans but there has to be law and order there has to be a system it can't just be people you know hordes of people crawling over barbed wires most of whom are desperate to just get here and to live the",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 55,
      "start_timestamp": "00:54:20",
      "start_timestamp_seconds": 3260.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=3260"
    }
  },
  {
    "text": "treat them with dignity and respect because of humans but there has to be law and order there has to be a system it can't just be people you know hordes of people crawling over barbed wires most of whom are desperate to just get here and to live the American dream I am not casting a white net on the composition of the people that are coming here but it doesn't take many we're bad apples the whole point of customs and border control is to prevent bad apples from getting into your country like that the post 9-11 world is one we've all submitted to because we were afraid of a reoccurrence of what happened on 9-11 so we agree that an uncontrolled border situation is conducive to 13 people figuring out how to get flying lessons and blowing up a bunch of buildings in the US like so if that was if it was worth it for us to give up so many freedoms and to spend so much money and to frankly lose the wars that we have lost how is it not worth it now because we don't know what the next threat is going to be and so I think it all starts with control at the border and if you don't have that then do you really have a country and so I have deep sympathy and visceral sympathy for the people that are desperate to get the US because the US is",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 55,
      "start_timestamp": "00:55:34",
      "start_timestamp_seconds": 3334.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=3334"
    }
  },
  {
    "text": "to be and so I think it all starts with control at the border and if you don't have that then do you really have a country and so I have deep sympathy and visceral sympathy for the people that are desperate to get the US because the US is look the direction of flow is in one the arrow is in one way right it's coming here because this is a great place I understand that and I have deep sympathy for it but we have to have rules we have to have controls and we have to have processes that make sure that we eliminate or identify the people on terrorist watch list for example who are slipping through the border today or M13 gang members who are slipping through the border today or you know various other cartel members that are slipping through the border today and they are and it's just not an eyeball that they are like there will be victims in the US because of that and this is a failure of government and it's most primary duty which is to defend the nation's borders as it exists and the citizens within it that's what actually the Department of Court defense is is meant to do you have always thought a big contributing factor is that we have so many holes like once somebody is in US they're kind of there it's very difficult to manage that because I in the reason why I",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 55,
      "start_timestamp": "00:56:33",
      "start_timestamp_seconds": 3393.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=3393"
    }
  },
  {
    "text": "what actually the Department of Court defense is is meant to do you have always thought a big contributing factor is that we have so many holes like once somebody is in US they're kind of there it's very difficult to manage that because I in the reason why I said question is I agree in terms of needing to control a border needing to have a defined process I think fully in page I think one of the tricky parts is I consider the problem is like we know it's not solved and I'm to be clear I'm not against a physical barrier I think a physical barrier is good I think something like that doesn't solve it though not that difficult to circumnavigate something like that so to me it seems like there needs to be some sort of structural adjustment within the country yeah I think the first thing we need is an agreement that such things are necessary and that doesn't exist to one side with for whatever reason thinks that in open borders amateurs to that and so that's like the biggest political issue is an honest open discussion about what does it mean to be a country like again having stood in line for as many hours as I have like it's it's profound to me that we've just decided in this particular instance the rules don't count so then why do I have to stand on the line of TSA right I mean",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 55,
      "start_timestamp": "00:57:28",
      "start_timestamp_seconds": 3448.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=3448"
    }
  },
  {
    "text": "be a country like again having stood in line for as many hours as I have like it's it's profound to me that we've just decided in this particular instance the rules don't count so then why do I have to stand on the line of TSA right I mean why am I taking my shoes off I'm not the shoe bomber the the government knows who I am I've done the TSA pre-check they know all about my internet search history they know about my bank accounts they know about my but they know everything about me I'm no threat right but still I take off my shoes and oops I have an iPad on top of a computer so my bag gets searched because it looks funny on the screen and we all pretend like this is making anybody safer on a plane when they know I'm not a threat right they have the systems to know I'm not a threat believe me if the government wanted to get rid of me that have no shortage of reasons to do so like this is this is the world we live it and yet we all submit to this computer of security when we have a completely open border you know both in North and South by the way like people getting into Canada then coming in from North same thing I've been on the Canadian border in a car and interrogated and randomly selected for a full search",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 55,
      "start_timestamp": "00:58:48",
      "start_timestamp_seconds": 3528.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=3528"
    }
  },
  {
    "text": "computer of security when we have a completely open border you know both in North and South by the way like people getting into Canada then coming in from North same thing I've been on the Canadian border in a car and interrogated and randomly selected for a full search and they basically take tools and take apart your car looking for you know I don't know grandma marijuana or whatever like how is this making either side safer I don't know I just stand by and let them because I know there's nothing in my car and so on but they treat us that way and yet we have this situation that just seems very incongruent there's something deep and malicious about what's going on that I don't understand that's my visceral response to your question yeah interesting really interesting I know that we're we're up at time here I had one last question for you is you're looking out over 2024 what's most interesting to you in life I think the thing that's most interesting to me is weather and how fast the in a great situation resolves because I think again many in the west have their heads in the sand as to what's actually going on on the ground and it is readily accessible to anybody who's willing to look and invest the time to have a pretty good understanding of what's going on on the ground and the contrast between what you can learn on",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 55,
      "start_timestamp": "00:59:51",
      "start_timestamp_seconds": 3591.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=3591"
    }
  },
  {
    "text": "heads in the sand as to what's actually going on on the ground and it is readily accessible to anybody who's willing to look and invest the time to have a pretty good understanding of what's going on on the ground and the contrast between what you can learn on your own and how it's portrayed in the major western media outlets would shock people if they actually took the time to do it it would really make them ponder who it is that works at these organizations and what is their real agenda and I actually think part of the success of Duneberg is we are just authentically ourselves we right what we believe we're not afraid to be wrong and we're not beholden to some you know messaging that the government would like to put out there and so the that story wraps everything that is interesting to us it's connected to energy it's connected to the ever changing role of the media and the in particular the emergence of sort of micro sources of news where people begin to trust one outlet over another for their own reasons and instead of having three news anchors that dominate the narrative you have five six hundred major sources of news that people select into their news flow and in our own small way for the two hundred and ten thousand people that subscribe to Duneberg hopefully we've been able to carve out a bit of a an interesting source",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 55,
      "start_timestamp": "01:01:04",
      "start_timestamp_seconds": 3664.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=3664"
    }
  },
  {
    "text": "the narrative you have five six hundred major sources of news that people select into their news flow and in our own small way for the two hundred and ten thousand people that subscribe to Duneberg hopefully we've been able to carve out a bit of a an interesting source for them but I think the biggest disconnect on the board today is how the western media is portraying the situation in Ukraine and and what we or I happen to think is coming interesting time will tell but yeah absolutely awesome chatting with you I enjoy the dialogue I enjoy your perspectives I always have an opportunity to learn a lot and so does the audience so thank you for hanging out I will throw links to your sub stack in the notes below but is there anywhere else that you want to send people to that's that's where we are duneberg dot subsac dot com we're about to embark on a potential rebrand as we we're able to eject a squatter from duneberg dot com so now we now own that domain name and we might do a little rebrand there we'll see in the coming weeks and months ahead but for now everything we do is at duneberg dot subsac dot com and look you know I I think this conversation probably went in a different direction and we were planning but I very much enjoyed it and I appreciated the opportunity to talk about a few",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 55,
      "start_timestamp": "01:02:18",
      "start_timestamp_seconds": 3738.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=3738"
    }
  },
  {
    "text": "months ahead but for now everything we do is at duneberg dot subsac dot com and look you know I I think this conversation probably went in a different direction and we were planning but I very much enjoyed it and I appreciated the opportunity to talk about a few things that we probably won't have a read about yeah yeah I had a blast I really enjoy these and it's a great wave for other people to hear different perspectives conversations about complex things so thank you very much for your time back to you soon thank you",
    "metadata": {
      "video_id": "7XyTZoId-Aw",
      "title": "Economic Recession Avoided? w/ Doomberg | The Outlier Podcast Ep60",
      "url": "https://www.youtube.com/watch?v=7XyTZoId-Aw",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 55,
      "start_timestamp": "01:03:24",
      "start_timestamp_seconds": 3804.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7XyTZoId-Aw&t=3804"
    }
  }
]