[
  {
    "text": "GME, OpEx, and there wasn't a whole lot going on here except this really interesting number. We close today at 2497. Strange, a strange number I think, especially when you consider that maximum pain was 25. Hmm, weird. The topic of the video is actually going to be maximum pain because I want to level set on what it is, give everybody a quick overview and how it can impact options because for those that follow GME, this product is actually ripe for maximum pain and it's not just from manipulation, although that is very likely a component of it. So let's take a quick look at the options chains. We get a poor one out for the homies because there's over 300,000 options contracts that have expired out of the money worthless gone forever. Shout out to the homies. That value is gone. Now, what am I seeing? A couple of things. The first thing is volatility is cratering. This was above 200 than the high 100s and this is no joke. We are looking at something that has contracted meaningfully. This doesn't surprise me because it's been generally quiet and the market writ large has had a hard few days that's also weighing on GameStop. It's not just GameStop going down as of this moment. The entire market really in a broad sense is rotating over. You can kind of see this. If we take a look at net highs and lows down here, it just turned negative",
    "metadata": {
      "video_id": "7YJRaNJjh00",
      "title": "GME Options Max Pain",
      "url": "https://www.youtube.com/watch?v=7YJRaNJjh00",
      "upload_date": "",
      "duration": 708.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7YJRaNJjh00&t=0"
    }
  },
  {
    "text": "few days that's also weighing on GameStop. It's not just GameStop going down as of this moment. The entire market really in a broad sense is rotating over. You can kind of see this. If we take a look at net highs and lows down here, it just turned negative for the first time in a hot minute and the net lows gross lows. I'm sorry is expanding. So net highs is essentially zeroed out and gross highs is moved massively over the last couple days. Right now on the 19th at sitting at 55 yesterday was at 24 in the day before that at 361. It's crater. So this is a broad rotation that we're seeing where things are coming out of the top performing products and moving into some light to equity things. So things like Bitcoin are up, VIX is up. There's secular strength that you can find, but it's really, really isolated. UNG is up. Stuff like IHI medical devices was up. But right now if you scroll through the markets, the vast majority of this is just, yeah, it's coming down. So that weighs on something like GameStop, which is good to be aware of. So if we take a look now at this idea of Max Payne, let's talk about this. What is it? Well, in a nutshell, it's this right here. It's when there's an options expiration coming up, it's the market force where price tends to move towards the strike where the",
    "metadata": {
      "video_id": "7YJRaNJjh00",
      "title": "GME Options Max Pain",
      "url": "https://www.youtube.com/watch?v=7YJRaNJjh00",
      "upload_date": "",
      "duration": 708.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 11,
      "start_timestamp": "00:01:18",
      "start_timestamp_seconds": 78.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7YJRaNJjh00&t=78"
    }
  },
  {
    "text": "So if we take a look now at this idea of Max Payne, let's talk about this. What is it? Well, in a nutshell, it's this right here. It's when there's an options expiration coming up, it's the market force where price tends to move towards the strike where the greatest value of options in that cycle would expire worthless. So there's a couple of assumptions that this has that market makers are the opposite side of these trades net sellers and they're hedging their positions. That's an important assumption and I agree with the assumption is broadly true. This also assumes that market makers then are incentivized to manipulate the stock such that this would happen. And that also is a viable estimation. Because when options expire in the money, a market maker has some work to do because into expiration, they need to hold the shares for what's going to expire in the money so that they can then deliver options that expire in the money and are exercised. That means that they have to hold shares. It increases their risk profile. They would much prefer options to expire worthless. So, yep, that also checks out. Now, there is a natural behaviour that is not just from manipulating stock, the stock price, but also from the natural practice of hedging that moves price a bit. And it's important to know that again, I think it's important to be as objective as possible. If we look at things and",
    "metadata": {
      "video_id": "7YJRaNJjh00",
      "title": "GME Options Max Pain",
      "url": "https://www.youtube.com/watch?v=7YJRaNJjh00",
      "upload_date": "",
      "duration": 708.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 11,
      "start_timestamp": "00:02:37",
      "start_timestamp_seconds": 157.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7YJRaNJjh00&t=157"
    }
  },
  {
    "text": "is a natural behaviour that is not just from manipulating stock, the stock price, but also from the natural practice of hedging that moves price a bit. And it's important to know that again, I think it's important to be as objective as possible. If we look at things and we just immediately say, yes, it's all completely rigged, there's nothing to be done here. It kind of loses some of its value if you dismiss everything in that way. Although, sometimes it can feel like that. And it's the same thing to the people that say, everything's price perfect, it's all great. There's nothing going on. That's also not so much true. It's kind of our job to be able to identify these gray areas. So, one of the things is their natural hedging behaviour can move price. Now, does that mean that they wouldn't be incentivized to move price or that they wouldn't? They are incentivized to move price. So, I don't actually view those two things as completely separate from one another. So, how do I identify Max Payne? Well, the cool thing is there are some websites that do this for you. Let me find one. This guy right here. I had a look around on all my screens, but there it is. So, this website called MaximumPain.com not affiliated with them in any way, but they do it for you. And they show you where MaximumPain is, where the highest OI strike is, where the",
    "metadata": {
      "video_id": "7YJRaNJjh00",
      "title": "GME Options Max Pain",
      "url": "https://www.youtube.com/watch?v=7YJRaNJjh00",
      "upload_date": "",
      "duration": 708.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 11,
      "start_timestamp": "00:03:55",
      "start_timestamp_seconds": 235.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7YJRaNJjh00&t=235"
    }
  },
  {
    "text": "This guy right here. I had a look around on all my screens, but there it is. So, this website called MaximumPain.com not affiliated with them in any way, but they do it for you. And they show you where MaximumPain is, where the highest OI strike is, where the highest put OI strike is, where the amounts are. And yeah, it is a pretty clean description of where you can find it. In something like this, think or swim, it also helps us with it, where you can look at the intrinsic value. So, if the options with the most intrinsic value are said to expire worthless, this where MaximumPain is, and you can see it's right where the bottom of this thing is. Right at this dip, which is 25. So, you can look at it for different series. It's going to pertain primarily to the front expiration cycle. Now, the other thing to keep in mind is it moves. MaximumPain is not a static figure. Why is that? Well, as people trade their contracts, this is naturally going to move around. So, an example of this is just from earlier this week. This is looking at GameStop on the 17th of July, right after the open. And I'm showing you where MaximumPain was then. It was like 29. Or 28. Looks like 29 to me. Something like that. So, this was just a couple days ago. So, what I'm highlighting to you is that the figure is",
    "metadata": {
      "video_id": "7YJRaNJjh00",
      "title": "GME Options Max Pain",
      "url": "https://www.youtube.com/watch?v=7YJRaNJjh00",
      "upload_date": "",
      "duration": 708.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 11,
      "start_timestamp": "00:04:57",
      "start_timestamp_seconds": 297.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7YJRaNJjh00&t=297"
    }
  },
  {
    "text": "on the 17th of July, right after the open. And I'm showing you where MaximumPain was then. It was like 29. Or 28. Looks like 29 to me. Something like that. So, this was just a couple days ago. So, what I'm highlighting to you is that the figure is not static. And if you're going to use the figure, you're best off really focusing on it on the day of expiration. That's where you'll kind of have the best idea on where this is. A couple other things to be aware of that this effect is most prominent in smaller, more liquid stocks. GameStop falls right into that bucket. It's because price is easier to manipulate in products like that. If you want to manipulate the price in something like Spy, it would take such a massive amount of money because it's such a big market. If you have a smaller market, it's much easier to move price. And again, to keep it objective, there's mixed evidence out there. I'm going to show you this study, which I really, really like. And this leans in the favor of asserting it exists and it's statistically significant, meaning it's something we should pay attention to. I like this study. I also agree with this study broadly. This study helps us become a little more nuanced in our understanding. Now, for those that are interested in learning more about Max Payne, I have a video that goes into the topic in depth.",
    "metadata": {
      "video_id": "7YJRaNJjh00",
      "title": "GME Options Max Pain",
      "url": "https://www.youtube.com/watch?v=7YJRaNJjh00",
      "upload_date": "",
      "duration": 708.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 11,
      "start_timestamp": "00:06:03",
      "start_timestamp_seconds": 363.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7YJRaNJjh00&t=363"
    }
  },
  {
    "text": "should pay attention to. I like this study. I also agree with this study broadly. This study helps us become a little more nuanced in our understanding. Now, for those that are interested in learning more about Max Payne, I have a video that goes into the topic in depth. I'll link to that in the notes below. This is more designed to be kind of an overview to help us get familiar with the concept. But let me grab that study for us so that we can review it together. It's this one right here. And I highlighted some sections. This is just from the abstract. If you're not familiar with reading papers like this, it's really easy. You can go on to SSRN and grab them. And really, what you want to do is understand the strengths and limitations of the studies. None of them are perfect. They all use assumptions and things like that. But what I like to do is collude between different studies and kind of compare an aggregate output so that I have a good idea across studies, what seems to be the case. So you can say, see here that they say we construct a measure of maximum pain, gain loss. These sort stocks according to that. And they find that a spread portfolio that buys high Max Payne stocks and sells low Max Payne stocks generates large, positive and statistically significant returns in Alphas. That matters. So you can play Max Payne",
    "metadata": {
      "video_id": "7YJRaNJjh00",
      "title": "GME Options Max Pain",
      "url": "https://www.youtube.com/watch?v=7YJRaNJjh00",
      "upload_date": "",
      "duration": 708.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 11,
      "start_timestamp": "00:07:16",
      "start_timestamp_seconds": 436.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7YJRaNJjh00&t=436"
    }
  },
  {
    "text": "construct a measure of maximum pain, gain loss. These sort stocks according to that. And they find that a spread portfolio that buys high Max Payne stocks and sells low Max Payne stocks generates large, positive and statistically significant returns in Alphas. That matters. So you can play Max Payne in two different directions. You can play prices, capacity to trend towards or away from it, depending on where it is relative to current price, which is actually pretty interesting. The other things that are important here. It says our results provide strong evidence of market return predictability at the expiration of options. And that they find the returns reverse after expiration week, also important. And that all consistent with stock manipulation on the part of market participants with short options positions. And the last piece here is especially strong for relatively small, a liquid stocks. So I highly, highly, highly recommend that you read through this become familiar with the concepts. You can look at the way that they calculate Max Payne so that you understand how to do it. You can throw it in Excel yourself. It's really not that difficult. It's a little bit annoying, not going to lie because you essentially have to go through and look at each of these individual strike prices and you have to multiply the strike price by the OI. That would tell you the intrinsic value at expiration. Now you can eyeball it. And you can do that by looking",
    "metadata": {
      "video_id": "7YJRaNJjh00",
      "title": "GME Options Max Pain",
      "url": "https://www.youtube.com/watch?v=7YJRaNJjh00",
      "upload_date": "",
      "duration": 708.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 11,
      "start_timestamp": "00:08:15",
      "start_timestamp_seconds": 495.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7YJRaNJjh00&t=495"
    }
  },
  {
    "text": "to lie because you essentially have to go through and look at each of these individual strike prices and you have to multiply the strike price by the OI. That would tell you the intrinsic value at expiration. Now you can eyeball it. And you can do that by looking at where OI open interest is the greatest. And that'll give you a good starting point. But it's not perfect because say, for example, the 30s here that have 65,000, let's say that they had 72,000 OI. That would be the most open interest. That would be more than the 70,000 that's out here. But where would Max Payne be in that scenario? Do you know? Go down in the comments. I'll answer you now. If this was at 72,000, you would take 72,000 times 30. And then you would have to take 70,000 times 125. It's much greater out here. So even though this would have a larger OI, Max Payne is still out here. So it's relative. Now again, in general, you could go to where the highest ally is and narrow it down pretty quickly to the top three. And then reason through it pretty fast or you could do the math or you can check out some of these different platforms that really help us understand it inherently. But this to me looks like something weird happened. That's the best I can say about it. This looks too convenient from an expiration perspective for this thing",
    "metadata": {
      "video_id": "7YJRaNJjh00",
      "title": "GME Options Max Pain",
      "url": "https://www.youtube.com/watch?v=7YJRaNJjh00",
      "upload_date": "",
      "duration": 708.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 11,
      "start_timestamp": "00:09:25",
      "start_timestamp_seconds": 565.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7YJRaNJjh00&t=565"
    }
  },
  {
    "text": "you could do the math or you can check out some of these different platforms that really help us understand it inherently. But this to me looks like something weird happened. That's the best I can say about it. This looks too convenient from an expiration perspective for this thing to be kind of just dumped off very, very slowly into the close today. Does that mean that I'm full tinfoil hat saying that GameStop is perpetually always in forever manipulated? Probably to be honest because of the way that this thing moves. But jokes aside, I want to be clear though that it's product specific. There's a lot of nuance is what I'm trying to emphasize there. So make sure that you don't get too wrapped up in one thought process and you stay open to how individual things move. But GameStop is kind of kind of interesting to me to say the least. So I think that wraps up Max Payne writ large if you have any questions on it let me know if there's anything else you want me to take a look at let me know in the comments. And then I will see you on the live stream tomorrow with my boy Newton. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "7YJRaNJjh00",
      "title": "GME Options Max Pain",
      "url": "https://www.youtube.com/watch?v=7YJRaNJjh00",
      "upload_date": "",
      "duration": 708.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 11,
      "start_timestamp": "00:10:36",
      "start_timestamp_seconds": 636.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7YJRaNJjh00&t=636"
    }
  },
  {
    "text": "the live stream tomorrow with my boy Newton. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "7YJRaNJjh00",
      "title": "GME Options Max Pain",
      "url": "https://www.youtube.com/watch?v=7YJRaNJjh00",
      "upload_date": "",
      "duration": 708.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 11,
      "start_timestamp": "00:11:39",
      "start_timestamp_seconds": 699.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=7YJRaNJjh00&t=699"
    }
  }
]