[
  {
    "text": "What's up, everybody? Eric here. I am back with Matt Kruzel from I think is your platform actually like the whole thing called Kruzel insights or is that just the newsletter that we share? That's the whole thing. Yeah. Yeah. Good. Well, it's a great thing. Thanks. Yeah. And I mean, if somebody has real insight, that's probably you not me. So I think at least yours is pretty damn authentic. Thanks, Eric. How's your year going, dude? You know what? To be honest, it's quiet. Like, you know, markets are not cooperative. Like I'm more of a trend trader and we're just kind of stuck in this range. So my aim in these kind of markets is to not get into trouble. That's my go-to strategy at the moment. So trying to avoid that bad chop. You get stuck in one of those kind of trendless markets and you force it and that's never good for anyone. So it's been quite. But you know, it's great because it gives me a chance to kind of focus on other things. Like, obviously, always market related, but rather than the in and outs. And which is a change for me, though. You know, it's funny as you know, you go through your career and you do different things and I day trade it for a year. So it's kind of your glue to the action. Now, it's kind of almost nice to kind of like spread out to other things a",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "You know, it's funny as you know, you go through your career and you do different things and I day trade it for a year. So it's kind of your glue to the action. Now, it's kind of almost nice to kind of like spread out to other things a little bit. But how's your year going so far? Really good. So for me, I'm one of the fortunate people that the chop is good for volatility, right? So like, I'm sure during the the bull market, you know, before the COVID crash, you were probably killing it. And then that's when I was sitting there, I mean, I was looking under rocks for volatility. So this is, this has actually been like my exact market. It's not too frequent that we get kind of this sort of sustained market over the past. I don't want what year and a half now where it's been pretty similar to this last year, you know, more trending to the downside, but still enough volatility to trade really effectively. And this market so far has just been fantastic. Big fan. You know, it's funny. I started trading on the desk back in the day. I was younger and we were almost all equity guys, but there's a few option guys. I wouldn't really mix too much kind of later on different sides of the desk, you know, but I remember talking to my manager, became close. I said, you know, I had the",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "day. I was younger and we were almost all equity guys, but there's a few option guys. I wouldn't really mix too much kind of later on different sides of the desk, you know, but I remember talking to my manager, became close. I said, you know, I had the options guys doing is like, I'm bull markets. They don't really make any much money. He's like, but for the department, the great head, he's like, when things go bad and any equity guys take a beating, they make like a huge multiple of like their normal returns. He's like, so for us, it's more of like a diversifier returns. I know I never, never thought of it that way. But so I guess, you know, the certain kind of truisms of the market all these years later, it means true with your option style too. So it's just a way of the market. Yeah. And I, to be honest, it's one of the reasons why I really like that's, you know, everybody thinks retail traders are perpetually disadvantaged and there are innumerable disadvantages for retail traders to be super clear. But there are some benefits and it's kind of what you're talking about is, you know, not that I could ever trade trends as effectively as you can. You've essentially dedicated a lot of your life to that approach. But I do have the luxury of saying, okay, this strategy set is working well in this market. Now it's",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "what you're talking about is, you know, not that I could ever trade trends as effectively as you can. You've essentially dedicated a lot of your life to that approach. But I do have the luxury of saying, okay, this strategy set is working well in this market. Now it's not working. I need to do something else. And that's actually why I kind of structure my options trading to not just be one thing. I don't just trade volatility because there are extended periods where it's not there. Whereas, you know, like the dudes on the desk that you're talking about, they essentially, you know, they have a more limited scope on what they're doing because they're part of a bigger picture, which is I say that for the retail traders because retail just likes to bitch and moan that, you know, everything stacked against us. And it is in general, but there are some benefits and being able to pivot pretty quickly is actually kind of a nice thing, even what you're doing now, right, in your strategies, because you're saying that you're just trying to not get in trouble. So what does that look like for you? Are you mostly in cash now? Yeah, but mostly in cash for probably the past month or so. And, you know, like I said, for someone who's looking for trend, even if it's a swing trade, or whatever, I mean, it's just been, you know, it's one of those markets",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "Are you mostly in cash now? Yeah, but mostly in cash for probably the past month or so. And, you know, like I said, for someone who's looking for trend, even if it's a swing trade, or whatever, I mean, it's just been, you know, it's one of those markets that's deceiving for anyone who's trying to play direction because just as something looks good, it fails, when something looks awful, then it comes back. It's really the reversion to the mean guy. It's the only guy that makes money in this market. So, so knowing kind of went to like, oh, this is time for me to back away and having the tools for that as like a big advantage. Because I mean, this is the kind of market in the past where you know, you go into drawdown, which sucks. And then just you're fighting just to make back your drawdown in good times before you can actually get ahead. And I think for some people who are they, you know, trading for a living is not their their their their main business to say, oh, well, I'll make it back. Whatever, but if you're trading for a living, you build that big hole. It's a big mountain to climb. So you you learn to want to avoid that that loss as much as possible. So it's quiet. That's it's fine for me. You know, for someone who's who used to have, you know, 500 open orders at",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "living, you build that big hole. It's a big mountain to climb. So you you learn to want to avoid that that loss as much as possible. So it's quiet. That's it's fine for me. You know, for someone who's who used to have, you know, 500 open orders at once and have to run to the washroom and run back to not get the too many fills. Sometimes a bit of quiet. It's not a bad thing. Yeah. And actually one of the dudes from my discord, he pulled in a tweet that you put that I think you were I didn't catch it myself, but I think you were referencing one of Mark's tweets essentially about cash. And I actually love that conversation because sometimes I think people do forget that cash is a position like and there is decay, right? You don't want to stay in cash for too long. And some people do I think fall into the trap of, okay, I feel uncomfortable or I know this isn't right for me. I'm going to move to cash. But then all of a sudden they have a hard time redeploying because the conditions are then never right again, right? It's never perfect. There's always concessions. I want to know how you kind of overcome that because I think that's a common problem for people. You know, that's a really good point. I remember when I, again, when I first started trying to turn the desk and",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "right again, right? It's never perfect. There's always concessions. I want to know how you kind of overcome that because I think that's a common problem for people. You know, that's a really good point. I remember when I, again, when I first started trying to turn the desk and I didn't want to at first. I asked you know, like cocky 20-year-old, you started being some good money and I was training futures and wow, I want to work anywhere, you know, but it just will happen. My wife had a different job in the bank, but happened to be next to the trading desk and so she like introduced me and said, okay, I'll give it a shot. But I learned a lot of lessons, which was great and retrospective. Happy I did it. But I remember I saw I was like the youngest guy on the desk. I was seeing next to the oldest guy on the desk and at one point I hit a drawdown. I forget when it was. It wasn't terrible. But like I was kind of just like, you know, confused and you know, you get those points where you say, you look at the market and everything just looks like like the same thing. You don't know how to read anything anymore. It's like you've gone blind. And he's like, Matt, whatever you do is like, I don't care if you own 100 shares of stock. He's like, whatever, always be trading.",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "at the market and everything just looks like like the same thing. You don't know how to read anything anymore. It's like you've gone blind. And he's like, Matt, whatever you do is like, I don't care if you own 100 shares of stock. He's like, whatever, always be trading. He's like, are you lose your feel? You lose your touch. And he had a super point and that helped me a lot over the years. Now I've kind of adjusted a little bit. So I have some tools where it's like when the green sign comes in, I force myself to do some buying. Because if you don't have some kind of rule or some kind of method that's going to force you to buy, you totally lose your touch. And you kind of forget why you got into it in the first place. By the time you come back as you see a headline, the best moves have taken off without you. So like for those who don't have, I think the discipline to kind of stay away, but then force yourself back in. I would almost say it sounds, you know, maybe countertuitive, but yeah, you should always be trading. If you don't know when to kind of force yourself back in because losing that touch is an expensive mistake to make. So a good point to Eric. Yeah, no, and I'm glad that you you kind of give people two different tools because I actually typically",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "always be trading. If you don't know when to kind of force yourself back in because losing that touch is an expensive mistake to make. So a good point to Eric. Yeah, no, and I'm glad that you you kind of give people two different tools because I actually typically fall into that first camp where I almost always have some sort of exposure, almost always. There was a couple periods over the last what two years, where I went completely to cash zero percent utilization. But that was like super short term. And then I immediately looked for any excuse to put something on because I've been there before, man, where it's like I moved to cash and it's like you see everything else just lighting up on fire around you and you're like, wow, this is actually like pretty good. I'm not losing anything here. And then it's I just remember, man, I'm like looking at the markets like, oh, well, this could happen. Or that could happen on all of a sudden. It's like another four days and there's nothing out there. I'm like, all right, dude, I got to put something on. So what stuff has been working for you so far this year in terms of even the those shorter term trades, not necessarily like the big, big trends that you're looking for. But like maybe some of the shorter term stuff that you're looking just for some exposure. Yeah, so January worked out really",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "been working for you so far this year in terms of even the those shorter term trades, not necessarily like the big, big trends that you're looking for. But like maybe some of the shorter term stuff that you're looking just for some exposure. Yeah, so January worked out really well. And we came in and again, some like my main tools kind of said, you know, things are conducive. And it's really odd. One of my main tools is looking for like more 52 week highs and 52 week lows. And so although like January markets were lower than where they are now, let's say, you know, especially than the NASDAQ, QQQ, like we we had really strong internals signs. So that worked great. Then after kind of February into March, got the chop in April, I've been cash because it's just been this and like looking back for someone looking for trend when you're a flatline that's like a worst case type of market. So I think like looking back, it's really just kind of at least the tools really did their job. You know, again, like I never fully trust a tool. Like I'm always like, scary that okay, at a certain points and the stop working. And there's like endless stories of like systems that were great and then just stopped and people couldn't recognize it. So I'm always kind of like, if the tool has given me a signal, like I want to like verify",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "that okay, at a certain points and the stop working. And there's like endless stories of like systems that were great and then just stopped and people couldn't recognize it. So I'm always kind of like, if the tool has given me a signal, like I want to like verify that it's this really is representing environment properly. But I think for now, like sometimes just knowing when to get aggressive, when not to aggressive, like the biggest, I think the hardest thing for me to learn over the years was to assess environments. You know, like there's that time to really get really like you pick. You want to like, yeah, as aggressive as you can other times, you know, mediocre and sometimes not much. But kind of like you, I almost always have a position. There's probably like five times I can count in my career, I didn't. I mean, even on my honeymoon, I had positions. Although it's the positions cost me more than my honeymoon did, which is like the other problem having positions when you shouldn't. But yeah, you know, so that's pretty much it. I think just, you know, recognizing the tools are working well, keeping you safe. And they're just waiting for like that fat pitch. So I agree to interview with Drostani Juck and Miller recently where he was saying kind of similar, you know, tough environment for positions. He's like, and you want to wait for that fat pitch to knock",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "well, keeping you safe. And they're just waiting for like that fat pitch. So I agree to interview with Drostani Juck and Miller recently where he was saying kind of similar, you know, tough environment for positions. He's like, and you want to wait for that fat pitch to knock it out of the park, you know, so that's really where my focus is. Yeah. Another question I wanted to ask you was, as you're looking at the markets right now, it sounds like there aren't any strong sector leaders that you're king into. But I'm curious how you're monitoring that slash. If there's anything at least you're kind of waiting to see starting to make a breakout or do you think it'll be a while before we actually see that kind of strength. So I do see sector leaders. So that's the thing, you know, and it takes like that discipline, because I see stuff that looks good, but that, but those rotations sometimes can be fleeting. So I kind of in a good market will looks good and really expands and man, does it pay, you know, but like in these choppy markets, you can get violent rotations. But I think the key themes coming out, like I think AI is going to be huge. Like I ate a lot of stuff as hype. So I'm not someone that usually I think one of the problems I face is that I'm sure you know you've been trading for",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "But I think the key themes coming out, like I think AI is going to be huge. Like I ate a lot of stuff as hype. So I'm not someone that usually I think one of the problems I face is that I'm sure you know you've been trading for a while too. So like, you know, most professional traders, I know are cynical people because you see so much, you know, crap over the years of CEO's promising this and this trend and then it all ends up like you look back five years later and this stuff's down 90. So you stop believing like at anything that could be great. But I have some experience with AI. I had a consulting company I'd work with a few years back, although it's like AI is really balloon since, you know, but I think that will be big. And I think that's what's really pushing Nvidia. Nvidia is kind of like the guy selling the shovels to the gold miners of like of AI. So you're seeing a play through that. There's just not a lot of direct plays right now. So I think that's one kind of going beyond that, which I think everyone is like staring at. So it's probably like a late plate, a late trade in the short term is I think you can see like kind of more like affordable dining. I think if you look at Chipotle, Mexican grill, wingstop, some of these stocks",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "that, which I think everyone is like staring at. So it's probably like a late plate, a late trade in the short term is I think you can see like kind of more like affordable dining. I think if you look at Chipotle, Mexican grill, wingstop, some of these stocks are doing great. And I think you know what, obviously with inflation the past few years, you know, for a lot of people it's more affordable to go to lower end diners and you know, they do a good job at their price point. So that's been another strong trend. It's interesting. Another strong trend I found is housing and building, which I have a hard time understanding why given the higher rates, you were thought with higher rates, they'd be getting crushed, but that's been strong. But I don't fully, I don't fully get that move. There's just one stock FND, which is floor and decker that they have a great kind of growth plan coming through FN as in the Nicholas growth plan. So they've been kind of building, but everything's like everything's stuck sideways since February. It's like flat lines and these are some of the stocks that are, you know, you could see with your channel lines coming up, like I mean, it's generally in an uptrend, but it's so like there's such large flat periods. If you don't cash those like fleeting moments of uptrend, like you just stuck with a lot of noise. So",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "that are, you know, you could see with your channel lines coming up, like I mean, it's generally in an uptrend, but it's so like there's such large flat periods. If you don't cash those like fleeting moments of uptrend, like you just stuck with a lot of noise. So it's, it's really interesting you point that out, right? Because yeah, down here it's trading at 69 and then from December to the end of, you know, your, it makes its run to 100 and then it's just from there on, it's flat man, that's a good point. Yeah, so you look at this and say, oh, that's easy, but then in real time, they get a factor of the stock that kind of failed and this and that. So it's kind of, you know, I kind of just realized when the environment's kind of like soft, I prefer to kind of slow myself down. So I always usually have some trades. I had one recently IOT, which was doing great, actually Stanley Druckermill has a position, this is kind of a recent IPO. And so I was positioning in there like in, you know, tail end of March right off those key averages and it's like went to break higher and as it was breaking out, I'm like, I don't know, whenever something breaks out of this market, it instantly fails. So I had a break even stop, it just kind of like rolled over instantly. So that's kind",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "off those key averages and it's like went to break higher and as it was breaking out, I'm like, I don't know, whenever something breaks out of this market, it instantly fails. So I had a break even stop, it just kind of like rolled over instantly. So that's kind of summarizes a lot of that. I think the big opportunity really was that like early January to February, ever since then it's been just like chop for like three months. It's just been sideways. There's been kind of tough for a trend this is pretty impressive though. This down move here. Yeah. Like what this surprises me. Like I assume this is catalyst driven of some sort like not at all, not at all. This is this is really an environment like of positioning whenever people get like to position one way this such little trend that like it just gets rammed the other way back down and this is totally just a break out that was pushed lower but by short term short term algal or machines or whoever big traders that that's nothing nothing news driven for that. So yeah, because I'm checking out the news and it says that it was moved to a hold and yeah, I mean nothing awful right? Like no, no. That's that's interesting especially yeah, those kind of moves because and it's always one of the favorite thing like one of my favorite things about talking to you is you always",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "it says that it was moved to a hold and yeah, I mean nothing awful right? Like no, no. That's that's interesting especially yeah, those kind of moves because and it's always one of the favorite thing like one of my favorite things about talking to you is you always introduce me to new tickers because you definitely look at like a very different side of the market than I tend to. So it's always fun to yeah, to take a peek at some of these because most of this stuff it's funny. I look at this chart but most of what I'm looking at this year is actually I care about this chart which is just implied versus historic volatility and that I'm just looking for variance risk premiums essentially. So it's it's interesting because when I look at something like this, there is definitely like good variance risk premiums here at least on a short term. So even though it might not be something I would typically trade if the options are not super gross which they're not they're not great but they're not bad. Who knows man, we might might add it to the watch list. So something like this, are you just looking to really fade like the whole differences or how would you are you are you bringing in trend or direction anyway? Like how would you how would you approach a simple case? I know it's very different very different styles. It's a great",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "something like this, are you just looking to really fade like the whole differences or how would you are you are you bringing in trend or direction anyway? Like how would you how would you approach a simple case? I know it's very different very different styles. It's a great question. If if we were kind of more in this sideways trending section then I would be way more pure volatility voiced but with something that makes this kind of down move, you know from what 22 down to 17 18 that's pretty significant move for product this size. I can't ignore direction. So I either need to structure the volatility capture to account for some sort of expected continuation and trends. So like for example, you know who knows maybe there's some semblance of support forming somewhere in here right and maybe I wait to see how it hangs out around this level before maybe it drops down here but the point being is this is not where I would place a directionally neutral volatility capture strategy just yeah I need to wait and see how this thing moves a little bit more because I mean this is six big consecutive down days. So it's you know the volatility expansion especially for this kind of move if we're being honest it's not that impressive. Like typically with this kind of big down move I would expect implied volatility to be increasing kind of like what you see back here",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "big consecutive down days. So it's you know the volatility expansion especially for this kind of move if we're being honest it's not that impressive. Like typically with this kind of big down move I would expect implied volatility to be increasing kind of like what you see back here like way more and it's not. So it also tells me that this is just a typically more volatile product it runs at a higher baseline which is also seen in the numbers. So yeah with higher volatility is good it gives me just higher propensity to catch larger discrepancies but option traders I think sometimes get too focused on higher volatility forgetting that higher volatility means shit moves. So with something like this man it's easy to get ran over on some sort of directionally neutral trade which actually happened to me in FRC which this has been a fantastic trade. I have been pulling volatility out of this thing for two weeks now and then in what the last week I was attempting to do the same thing I've been doing for a while now I've been positioning pretty small because I see a insane amount of risk in this product and I mean whether it's halt because I mean one of the days I was trading it I had to get out via between halts and that's oh you know how that goes. Yeah yeah. Like in order log that has to get ran through so you're",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "in this product and I mean whether it's halt because I mean one of the days I was trading it I had to get out via between halts and that's oh you know how that goes. Yeah yeah. Like in order log that has to get ran through so you're just hoping to get a fill even out of market order. So but this is like a prime time example of something where you know I was kind of trading that capture strategy but then all of a sudden we started moving from 15 down to 11 10 and even that move was enough to trigger those halts and then the volatility if we pull this up the realized volatility was just spiking. So I was getting out essentially at small losses as soon as it started to happen instead of letting it run some of them actually would have been actually decent profits but I don't I do not like to play with that especially in something like this is like when I was playing uh playing game stop in AMC I fully acknowledge that I am playing with fucking fire. So I am real quick to you know get the position on that I think makes sense but then as soon as it starts even remotely not working I'm getting the fuck out immediately. Yeah yeah no I uh and I've I've played with those like that maybe not FRC but I've played with the very volatile names",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "get the position on that I think makes sense but then as soon as it starts even remotely not working I'm getting the fuck out immediately. Yeah yeah no I uh and I've I've played with those like that maybe not FRC but I've played with the very volatile names like earlier in my career so I I know the vibe I think you know positions a big part of it you have to just know like the right size to put on. Yeah you know you always have like that that buffer I used to I mean I used to build into it like you know because usually you know the high ball you're taking out like huge returns once work in your way so you do it enough where you say okay I have enough profit even if I raise my size worst case I'm just giving back my profit and and I don't get hurt too bad and and you size and you have to know the point where you can't get too greedy or else eventually you will get test nagged you but um yeah let's do like kind of like merger our type stuff and yet just have to be careful during that wrong environment where like you know it would fail a knuckle through what you know like you're picking up pennies in front of a steam roller you gotta be very careful very nimble you don't want to get run over so yeah",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "yet just have to be careful during that wrong environment where like you know it would fail a knuckle through what you know like you're picking up pennies in front of a steam roller you gotta be very careful very nimble you don't want to get run over so yeah I try those. It's so like I literally love the way that you just kind of phrase that because options traders will say the thing like picking up pennies in front of a steam roller and I always remind them I was like well just remember like steam rollers they move pretty fucking slow so if you're just like you said right if you're nimble you can get the hell out of the way which is kind of a whole name of the game um and it's also I think super-septic that you brought up sizing because in the discord you know every once in a while I'll drop in some of the stuff I'm working on and somebody was just like oh man you know how are you handling FRC you know because I told them that I'm essentially waiting to get out because of the halls and I was just like I just I'm literally just waiting there's nothing for me to do and the trade is strategically sized that even if we have another 15 gap down I don't want it to but it's not gonna break the bank like it's specifically sized because I acknowledge what",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "was just like I just I'm literally just waiting there's nothing for me to do and the trade is strategically sized that even if we have another 15 gap down I don't want it to but it's not gonna break the bank like it's specifically sized because I acknowledge what I'm trading and I think sometimes people forget being able to flex strategies and sizing based on that and it's kind of like what you were talking about before right the idea of being more greedy when it's time to be greedy but then knowing when to back off on that same strategy um so when you're looking at the rest of this year are you expecting kind of stronger trends so that you can start kind of sizing in a little bit more or writing more or are you expecting kind of this chop throughout the rest of the year? No I mean chop no no trend ever lasts like even chop will last you know uh I I mean I think really one or two things are gonna end up working like this way like either the inflation inflation is gonna fall more than we thought and the Fed can back off or it stays the way it is and the economy starts to break down and then the Fed gets scared and it backs off like either way so you know in my experience even when I was day trade even I was doing kind of the",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "Fed can back off or it stays the way it is and the economy starts to break down and then the Fed gets scared and it backs off like either way so you know in my experience even when I was day trade even I was doing kind of the stuff like you were doing so even I would like day trade and was taking like small trades I always made like by far my most amount of money when I still cut a trend because the way my mind works like I always play the long side even I was day trading even in all eight my first year with the financial crisis I made money just trading long all year I just I would wait I would change like the parameters as to how oversold something had to be before I would test the waters but I even as a day trader I always play the long side um but for me it's like whenever I have a strong conviction trade and I'd be day trading that direction but keeping kind of a core and building and always putting on like more position more size that was right those are always the years of fireworks so and I've noticed just maybe this is just my own personal you know character but I've always made like big chunks of money like in three four months like in all the the trends is like there's that kind of like that",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "those are always the years of fireworks so and I've noticed just maybe this is just my own personal you know character but I've always made like big chunks of money like in three four months like in all the the trends is like there's that kind of like that perfect point where you hit the heater where it's just like there's like that ultimate move and if you're positioned right and you and you get it right if you can move your account like you know triple digit returns like really fast and hard and then you need to know when to back off so for me and you know it's interesting listen to drunken miller because although he's like a global macro guy and I don't really trade that way I think the way he views the world and the way he thinks is really like I align a lot with him and he was saying something similar to he's like you know I don't see a fat pitch he's like but the fed's gonna fold they're gonna do something and we're gonna you're gonna get those windows of opportunity you know I mean his basis is that we're kind of like in a decade like the 70s like a lost decade but within those you get those one year two year bull markets where they're sizable money and that's like the fractal nature of the market to even in one year could be a one year of",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "we're kind of like in a decade like the 70s like a lost decade but within those you get those one year two year bull markets where they're sizable money and that's like the fractal nature of the market to even in one year could be a one year of junk but if you're patient you don't grind yourself down you're gonna get that you don't need more than three or four if you get a four-month trend your position properly like that's fireworks you don't need more than that if you're if you're an adaptive flexible aggressive trader but like this past year and a half spend abnormal I mean we broke we we topped in in late 21 growth top in like February 21 if you look at the dot com crash which was you're kind of also very long but you had some serious rallies like coming out of like the tail end level one you had like a 50 NASDAQ rally off the lows like it was big like countert this has kind of been like drop in chop which is really kind of like you're looking back over decades there's like a handful of these kind of markets so it is odd but it's okay I mean like that the market always you know send you something that gives you a curve while if there's no out a dodged but the opportunities are gonna come they always come whenever I thought I've missed something you",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "kind of markets so it is odd but it's okay I mean like that the market always you know send you something that gives you a curve while if there's no out a dodged but the opportunities are gonna come they always come whenever I thought I've missed something you wait enough time and you just patient the markets in another opportunity so yeah it's and it's interesting and I think that's actually one of the other things that I find so impressive about you honestly is that you go through those cycles where you'll have like triple digits three months return like I've never I literally have never seen that my entire career so it's like it's to me that's such a cool concept and again so different than the way that I typically perceive the markets I've always been more of throughout the year I don't have anything stellar but I almost know with certainty where I'm gonna end at the end of the year almost every single year and that I think the way that I've used that to grow was sizing right is once once I've you know built that return over like six seven years I was like okay I've hit this seven years consecutively in kind of various markets I'm okay to start sizing up here and for a period I was even going leveraged and stuff like that to really accelerate but how did you develop the discipline to sit and kind of",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "I was like okay I've hit this seven years consecutively in kind of various markets I'm okay to start sizing up here and for a period I was even going leveraged and stuff like that to really accelerate but how did you develop the discipline to sit and kind of watch things keeping smaller positions from time to time but then and being able to successfully making that transition from looking at the markets and then saying okay now it's time to start scaling in is there kind of like a more rigorous checklist that you look to see in the markets in terms of the internals and whatnot to provide the support that you think you need for that trend I'm fascinated by that approach so I'm really curious to understand how you make that transition mentally you know so for the longest time I always ran kind of multiple strategies so I kind of I always had day trading going on because I started as a market maker so I was like my starting point and so it's that kind of thing with you like I knew almost every month like a cash register like you just like you take X amount out maybe summer months would be a quieter but during the year it was fairly consistent and it was more when I was running it that way it was more a little bit of you would get a vibe build it was kind of like the",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "you take X amount out maybe summer months would be a quieter but during the year it was fairly consistent and it was more when I was running it that way it was more a little bit of you would get a vibe build it was kind of like the trader instinct you know like Jesse Levermum Street right like reminiscent of stock operator and like you would just feel I mean like you know I always love economic history macro trends so I would get a like a thesis like this market should explode and you they would act differently and that's something like people don't get like the same bicycles that will work in a really good market would be garbage in other markets and so when you're when you're new you're like I don't understand I made money for nine months more money that I thought I was ever going to make and now I can't make a penny it's the environment that's changed so it's so originally it was kind of like a vibe and you would see things moving and then you would press the bet at a certain point it's like I mean I'm not sure with with yourself but like the niche kind of day trading strategy I was putting like I was getting too sizeable for for what I for to be able to grow so I said you know what I have enough capital where I did the analysis like you",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "not sure with with yourself but like the niche kind of day trading strategy I was putting like I was getting too sizeable for for what I for to be able to grow so I said you know what I have enough capital where I did the analysis like you know like I always tell people that this is a business we're running you know like so what if what if we hit one year period where markets suck because I started no eight so it's not as if I was like unaware of bad market periods and so I got to a point where I said like I have enough capital worst case I'm fine it's not a big deal I'm sure I'll bake something or whatever I'll make extra the year after and so I built all the tools to make sure that would never get off guard and misadmitted trend that one so I think there's one hedge fund manager Jim Ropel yeah pop around YouTube and everything and and he he talks with like the idea of guard rails you know he's like you know you want to have these guard rails to make sure you don't kind of you know it's like it's like the guard rails won't guide your cars your driving but like they make sure you don't fall off a cliff so like I've kind of built guard rails into my system where one you don't get demolished by a trade but",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "don't kind of you know it's like it's like the guard rails won't guide your cars your driving but like they make sure you don't fall off a cliff so like I've kind of built guard rails into my system where one you don't get demolished by a trade but also two you never miss a major trend like when I was when I was younger I don't feel Ralph Accompora one of the co-founders at the anti association yeah he used to come to Montreal a lot where I was running the chapter and then I ran the national technical analysis organization here and I remember him talking saying that you know the biggest mistake you can make in this business because I was young I was like 21 and he was already like the godfather technical analysis and he's super nice guy and he told me the biggest mistake you could make is like get on the wrong side of a major trend like never ever get on the wrong side of a major trend so I always kind of took that to heart so I've made these like guideline rules where just like you know to kind of full circle from our talk before even if I'm out or I'm trading light I have these rules that will force me to okay I have to find something to buy or I have to build exposure because my risk is you stay you stay on the outside lines",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "of full circle from our talk before even if I'm out or I'm trading light I have these rules that will force me to okay I have to find something to buy or I have to build exposure because my risk is you stay you stay on the outside lines you got comfortable maybe get a little bit lazy and you miss out on the opportunity been waiting for so I always have these like strong technical guidelines to keep me looking in the right areas. Got it and so for like a lay trader we don't have to go super far in the detail on your guidelines but what are some of the things that they could start to look at to help them with that. So you can look at different ways you can look at you can have just like you know general trend rules like you know above key averages or you know that's like really simplified I think there's I think there's drawbacks to that because it's kind of whipsaws like I know Ray Dahlie originally his original systems had moving averages and things and he eventually moved away from that because of the drawbacks and I've seen some of those two so I prefer market breadth because especially like the way I trade like there's those three four month environments where things rock and roll where you really want to be exposed and there's a certain kind of kind of construction to what those",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "and I've seen some of those two so I prefer market breadth because especially like the way I trade like there's those three four month environments where things rock and roll where you really want to be exposed and there's a certain kind of kind of construction to what those environments look like you know similar like similar to like a financial price like a banking panic you know you just had in March if you look at the action in March if you look at like COVID drop like even bad markets have a certain character to them so these kind of like great environments have a certain character for me market breadth like the internals the way they're acting whether accelerating or decelerating above key thresholds to me that's a better indication is the overall participation so like I like to focus on growth growth tends to be on the speculative spectrum like that the jumpier stocks like outy so those do well when there's confidence so when a lot of stocks are participating those start to participate as well but they go vertical when people are unsure kind of like now large cap work you know so that's why you're seeing like you know the biggest names like Microsoft Dominique you're not going to get firework returns because it's things of two trillion dollar company but it'll edge higher if you're looking at the index indexes you feel bad just say hey look the NASAS moving up",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "that's why you're seeing like you know the biggest names like Microsoft Dominique you're not going to get firework returns because it's things of two trillion dollar company but it'll edge higher if you're looking at the index indexes you feel bad just say hey look the NASAS moving up but it's like five mega stocks pushing it higher whereas most stocks are getting killed so for me to kind of give myself like a realistic benchmark I use market breadth and like key thresholds to know when the participation is rising yeah I love that and it's actually one of the things that I started trading it's like you I started in oh seven and the only reason why I didn't blow up is because I was just starting and I was too scared to like put a bunch of money out but I started looking at kind of a father's sector rotation strategy and I think that got me not necessarily to the same degree of sophistication that you have you know with your market breadth analysis but we do look at a lot of similar things I think because you've talked about things like net highs lows within you know what in exchange or whatever I look at that I don't know if you use like tick and trend do you use either of those no I never got into them I never I never really kind of called out to me yeah because I I started",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "within you know what in exchange or whatever I look at that I don't know if you use like tick and trend do you use either of those no I never got into them I never I never really kind of called out to me yeah because I I started using tick trend and then like an average weighted trend and then kind of made like a composite indicator with both of them combined which is yeah it's almost like a it's almost like a MACD for moving averages just using tick and trend but what other like decent breadth indicators do you talk about that people can find out or do you think people should look into so I try and like like you know with my study of like technical analysis like I'm a charter market technician so I study so many tools a lot of them become redundant you know like I remember like it's kind of like the elixir you come and you think like I have enough lines on my chart I get enough information but so I got that a point we're kind of like I'm sure like with your military background like you'll appreciate it's like you know every everything I'm using needs a specific purpose like I need to know why it's there like I don't want to carry around extra bulk for no reason like you want to be efficient so I have like so there are many breadth tools you",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "appreciate it's like you know every everything I'm using needs a specific purpose like I need to know why it's there like I don't want to carry around extra bulk for no reason like you want to be efficient so I have like so there are many breadth tools you can use even there's a different like you know that you call them like breadth thrusts you know where there's like massive and so there's like variation upon variation and so early on I think when most people start they kind of feel like well the more I have the more signals the more powerful the signal but not necessarily it probably you end up with like analysis paralysis where you just can make a decision so I really kind of so I know of more tools I've studied more but I really keep kind of net highs net lows and I also look at the advanced decline line I use them really for different things so advanced decline I kind of look for a longer term divergences this kind of tell where I am in the cycle of the market you know so early on you'll see a lot of participation and as like the the market gets older and a little more tired it starts to kind of break down so it's kind of like a bigger picture of you and the net highs and lows are kind of more my intermediate type of view yeah I love",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "of participation and as like the the market gets older and a little more tired it starts to kind of break down so it's kind of like a bigger picture of you and the net highs and lows are kind of more my intermediate type of view yeah I love that and I think using both of them in concert makes a lot of sense and your comment there reminds me of one of my favorite quotes I tell people which is simplicity is the ultimate sophistication in order to eventually said that and I talk about that a lot with traders because I feel like we all go through this parabolic curve where we don't know anything we don't know to use anything then we find everything we try to use everything and then we scrap most of it and use a few things that we probably saw the first few days that we started as you know I feel like that exists in a lot of disciplines like I mean I play guitar and like so when you start you want like a million guitar pedals and effects and then after you look at like these legendary guitarists and all we want is like a 1968 Fender Stratocaster with a clean amp and they play and you're like how does it sound so good and then you have like you're doing a tap dance with like guitar pedal so I feel like I feel something of like just",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "and all we want is like a 1968 Fender Stratocaster with a clean amp and they play and you're like how does it sound so good and then you have like you're doing a tap dance with like guitar pedal so I feel like I feel something of like just like of like learning in general like like everything you know anyone was great at something I find they'll say like oh it's simple but it's almost like you have to learn all the complexities before you can get back to simplicity and that's kind of like the I think the way of life almost for a lot of stuff dude I literally could not agree more with you I think going through that phase of throwing everything at the wall seeing what's sticking because especially in trading specifically but then also on like basketball or I know jack shit about guitar but my best friend place so I listen to him sometimes but I agree with you we're like everybody has their slight nuance for like what works sense for them or like what makes sense for them what works for them what kind of mentally clicks so I think that makes a like a ton of sense especially with complex systems because if you leave them to be too complex for too long they're kind of really difficult to manage speaking of the the bank movements that we're talking about before what do you make of the new",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "think that makes a like a ton of sense especially with complex systems because if you leave them to be too complex for too long they're kind of really difficult to manage speaking of the the bank movements that we're talking about before what do you make of the new stuff that we're seeing with FRC do you foresee kind of this credit crunch expanding or do you think that they're doing their best to kind of localize it as much as they can so that it doesn't become a bigger problem well I think that's trying to localize it but there's an inherent like structural problem the Fed has made with the market where like by raising rates so fast and banks are not raising their deposit rates it's just in everyone's interest to pull their money out of their checking account and go put it into like a money market fund or a brokerage account that's paying higher rate like why would you stay with 1 when you can get five you know so it's like you're you're just like giving everyone and you know it's like Charlie Munger would say like show me the incentive and I'll show you what people will do so like the longer you keep the song people talk say like you're getting 1 like put in some money market fund you can pull it out tomorrow you're not locked in but you get like five or four and a half or whatever",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "show you what people will do so like the longer you keep the song people talk say like you're getting 1 like put in some money market fund you can pull it out tomorrow you're not locked in but you get like five or four and a half or whatever it is at the time you know so I think the Fed's kind of hoping that they can kind of beat inflation fast enough so that then they can kind of they can go back lower to kind of stop this in balance but that's where a lot of this is coming from and a lot of banks have sure are concerned that you know the longer there's a disbalance like you know that deposit money you know it's kind of you know banks do so much at the end of the day the majority of their businesses like banking 101 they're trying to expand for more profit but like the bulk core of what they do is banking 101 so but this industry environment is causing a breakdown of that normal system it's kind of forcing away these easy deposits from from the positives to these money market funds where where banks institutions don't make as much money with with this and they can with re-learning out the positive so I don't know it's just a it's a really kind of wild scenario it's like kind of like and it's kind of scary in a sense because they're kind",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "where where banks institutions don't make as much money with with this and they can with re-learning out the positive so I don't know it's just a it's a really kind of wild scenario it's like kind of like and it's kind of scary in a sense because they're kind of putting a patch on top of a patch on top of a patch to fix a problem but at a certain point they better get to a solution or you know things get calm again complexity the more complex the scenario the more likelihood of breakdown so we want this to kind resolve itself sooner rather than later dude I was a little surprised I expected regional banks to be under pressure after like I felt like that was like a good canary in the coal mine bad bad practices right like their risk management department completely shit the bad fine you know that happens but I did see that happening I was like that's kind of interesting and then what's going on with FRC that makes me a little more concerned for just kind of these smaller regional banks because I imagine what's happening to them is probably happening elsewhere is there a tradable opportunity there on the rebound from that kind of sector for you or do you prefer to wait until there's established strength across the full sector before you start dabbling so you know it's not really like a specialty of mine it's to kind",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "happening elsewhere is there a tradable opportunity there on the rebound from that kind of sector for you or do you prefer to wait until there's established strength across the full sector before you start dabbling so you know it's not really like a specialty of mine it's to kind of play those but like I even when I was day trading I always kind of tried to kind of move away from these specialty situations because all this like news to come out and it's like whenever you get into these really you know unique situations this these are what you know it's kind of like the specialist versus the generalist type of you know discussion and and these are the scenarios where the specialist really gets ahead like it's rare it's like you know it's like you're a specialist in financial services and it's like you could be stuck in the wilderness for like 10 years like waiting for like some real juice to come into your sector and then when it does like okay then it's really your opportunity to deliver alpha but for someone on the outside where it's like there's all these kind of like my new differences it's like a hard place to kind of swim so for me it's more a matter of like I don't really care what happens with with regional banks you know I just you know as honest not systemic and everything else kind of like improves that'll bring",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "my new differences it's like a hard place to kind of swim so for me it's more a matter of like I don't really care what happens with with regional banks you know I just you know as honest not systemic and everything else kind of like improves that'll bring you know risk on elsewhere and then that kind of opens up the gates for big profits elsewhere but like to kind of swoop in and try and find like the undervalued regional bank it's not really my like four-day got it yeah that makes it's on a sense and I was always curious with something like this if there was at least based on your your studies like a large return to a mean post you know the catalyst coming to a conclusion because I feel like as I look at the the financial sector right now most people are like okay how bad is this and then at least from a volatility perspective the way that I would view that is volatility will be high until we come to a conclusion till we know the answer and then volatility will naturally contract because now we have the answer and I didn't know if that was a tradable event for your kind of style but it makes it some a sense too because I've been talking a lot about that too where it does feel like it's I call it an emotional market doesn't really mean anything right there's",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "and I didn't know if that was a tradable event for your kind of style but it makes it some a sense too because I've been talking a lot about that too where it does feel like it's I call it an emotional market doesn't really mean anything right there's a fuck of words but it does feel like every different headline I see there's people pitching a fit about something and I'm wondering you know when we're looking at the broad landscape talking about inflation a second ago my underlying hypothesis is that it will probably be around for a bit that's my guess I again I'm just a fucking idiot sit in my house so what do I know not much but I am like from your perspective are you seeing inflation being something that once we go through the rate hike perceivably in what a couple days then we'll kind of whatever happens with rates throughout the rest of the year but are you expecting inflation to kind of stay leveled out for most of this year then maybe coming down next like how do you view the inflation picture because for me it just it doesn't seem like it's responding super aggressively to what's been done even so far you know inflation is that one of those interesting things like especially with finance like now there's financial engineering and they try and turn into a science when it comes down to things like money and inflation",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "seem like it's responding super aggressively to what's been done even so far you know inflation is that one of those interesting things like especially with finance like now there's financial engineering and they try and turn into a science when it comes down to things like money and inflation like if you there's like these geniuses like Ludwig von Mises like like the Austrian school economics like like just like they were like brilliant in terms of like they had like full of soft reviews of money and all of this but like when it comes down to like again all this fluff like with banking all they tried this and that when it comes like banking 101 is inflation is just confidence in the currency and the amount of you know supply versus demand and so if people start to believe that inflation will stick around that's that alone will make inflation stick around you ask for a raise and you ask for a raise and the products go up so they ask for another raise so it's really in the Fed's interest everyone's interest to really destroy inflation before it becomes entrenched so like they're looking at like you know estimates like people like forward you know they do polls like forward expectations for inflation this and that it seems anchored so that's what I think the economists are concerned about but economists just sometimes get it really wrong like the polls just don't really adequately explain",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "like you know estimates like people like forward you know they do polls like forward expectations for inflation this and that it seems anchored so that's what I think the economists are concerned about but economists just sometimes get it really wrong like the polls just don't really adequately explain what people are feeling so they better get under control because the other side of that is then like a very deep deeper longer recession because you have to go really aggressive with rates so I'm not sure like again like this Powell like back off the second you see a recession kind of coming or if the market starts to break down to be back off right away does inflation surprise and finally really drop off like core core numbers have been sticking so core like X food and energy you know like the Fed doesn't really care about food and they figure look it's out of our control like what the rain is and whether there's like a country invading other can't really control food and energy but like the rest the core is critical and that has stopped coming down which I think a big concern for everyone so they're gonna go up another quarter I think what makes this cycle really different than like other ones at the past when you kind of look at the 70s early 80s even 1990 is debt levels now are so much higher than before in the past so you",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "everyone so they're gonna go up another quarter I think what makes this cycle really different than like other ones at the past when you kind of look at the 70s early 80s even 1990 is debt levels now are so much higher than before in the past so you know going from zero to five is astronomically right interested more now than it was 30 years ago and I mean back then there weren't even like you know mortgage products and all the the same way you know what credit cards are the way they are now so we'll have to see I think it's really I would it's better that the Fed you know we take our medicine and the market is not great for a bit but we get back to normalcy then if inflation gets entrenched it ends up being a long-term problem which is bad for everyone yeah and it's the the thing I find so curious about it all is it seems like that we're already starting to see things break right and from what we're seeing from the Fed like I think most people agree like we have more to go in order to get this thing on a wrap so it's it almost feels like how how well can we keep things strapped together until we do get things high enough right high enough to control inflation which leads me to the to the last thing I want to wrap up with",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "to get this thing on a wrap so it's it almost feels like how how well can we keep things strapped together until we do get things high enough right high enough to control inflation which leads me to the to the last thing I want to wrap up with here because I know you're going to run in a second earning so far what are your general thoughts impressed not impressed in line with expectations outside of expectations how do you feel about them yeah I think I think what's the good part is they're not terrible like there's some good some bad kind of mixed I think like the bigger the company the more pricing power like the better the company is doing so and you're seeing and again typical of the economic cycle right like in not great times big companies do better because Apple has more pricing power than you know John's you know John's bike shop you know like obviously like Apple people really want an Apple phone so I kind of in line but nothing great but it's early you know like like this whole inflation higher interest rates like I don't think it's so much going from zero to five which that is a huge what's staying at five like if the Fed stays at five for longer like think about every time the longer we stay here every month that goes by that's more people who's you know Carlyce has come you",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "so much going from zero to five which that is a huge what's staying at five like if the Fed stays at five for longer like think about every time the longer we stay here every month that goes by that's more people who's you know Carlyce has come you and now they have to make the decision that you know rates that were 0.99 or maybe 7.99 you know or or people's mortgages come you so the longer you stay here the more interest rate debt products kind of reset themselves at higher rates and the kind of like the way everything becomes amplified so I think it's a bit early because they just really jacked up rates like at the tail in the last year so maybe you know companies can get still get by it would be really interesting to see if this kind of persists so a lot on the Fed I don't think we go much higher if you look even in the 80s it's when Volker basically took rates above the inflation rate that inflation was killed and so we're basically there if you look at cores let's say 4.6 or whatever so it rates at 5 you're basically there how long do we stay here how would the economy gets you know how quick all these rates reset it's like big questions man it's hard to tell that I find you know sometimes we try to know what's going to happen next sometimes",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "rates at 5 you're basically there how long do we stay here how would the economy gets you know how quick all these rates reset it's like big questions man it's hard to tell that I find you know sometimes we try to know what's going to happen next sometimes it's like unknowable I mean if you look at the Fed they have like 30,000 people working for them best data in the world and Powell will say well I don't know what's going to happen next we'll have to see what the data is so you know the kind of like like you said like being your basement say like I know exactly what's going to happen I think that's kind of like you know being a little bit over the top you know so I that's why I kind of when times are really unsure like I always try to have a strong view but one times are really unsure I default to my tools and and it's kind of like you know most of the time you're flying a plane you're looking out you know the window to see what's going on but if it's a bad storm just I can't have no visibility I go back to my my indicators and that's kind of what I do in this environment it's proven well so I can't complain too much yeah it makes a ton of sense and it's funny I always think that there's a delicate",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "storm just I can't have no visibility I go back to my my indicators and that's kind of what I do in this environment it's proven well so I can't complain too much yeah it makes a ton of sense and it's funny I always think that there's a delicate balance because for me I'm naturally interested in markets and economics I think the way that the systems work are fascinating but I couldn't agree more with you on the point that there's a difference between that general interest and trading and I always tell people like if you are more concerned about being right in a prediction than having like positive expectancy you're gonna it's gonna be real tough fucking go man it's difficult to be right in the markets um the very last question I lied to you the very last question because you said something super interested um based on the homework you've done before to me it seems like we raised rates pretty quickly in a relatively compressed time frame very famous do you have any indication on what the unwind might look like do you think that it would be a parabolic drop because to me that sounds dangerous just by severity but I haven't done that much homework to be honest with you unlike the the actual coming downside so I'd love your thoughts there well it usually does start to happen pretty quick and if you look at like historical precedent that's how",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "me that sounds dangerous just by severity but I haven't done that much homework to be honest with you unlike the the actual coming downside so I'd love your thoughts there well it usually does start to happen pretty quick and if you look at like historical precedent that's how it happens because like if you look at what the Fed is but like I said and he's right Powell I have to say at least he's right you know the the the risk of doing too little is worse than doing too much because like the the fed's point of view is like if things get bad we could always just drop a ton of money in everybody's lap and everything's fixed but if inflation expectations get unhinged then like I said that that's a long process to break so I think they naturally even if they won't articulate it and you know three quarters of the Fed is trying to understand what they're really saying but they would rather kind of push things too far and start to break things so and after when they see oh stuff's breaking now it's quick quick let's like throw the kitchen sink at it so typically push it to a point where it gets pretty rough and then they have to get aggressive to fix it but that usually does work to fix things but um you know it's like again complexity the the Fed because of this this way that",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "sink at it so typically push it to a point where it gets pretty rough and then they have to get aggressive to fix it but that usually does work to fix things but um you know it's like again complexity the the Fed because of this this way that they've been working they keep taking a bigger and bigger role in the economy and when they first started 1913 it was supposed to be just lender of last resort like you know like FRC for example rata money okay here's some money you've gone from that to like controlling the entire economy different that you know you have you have QE buying bonds and controlling banking and repo and and so like their hands are everywhere and and I I suggest everyone read the book the Lords of Finance um which is basically like a recount of like the the the Federal Reserve and different that bankers in the I forget the era was now I was like the early 1900s and where we kind of always feel looking at these these people talk like oh they know what's going on and then 2021's a perfect example where inflation which to some great investors was so obvious I mean you guys like drunken miller tutor Jones like the same names like we're say like look inflation is coming and it's like these other guys who are supposed to have all the data all the people totally blindsided by like",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "which to some great investors was so obvious I mean you guys like drunken miller tutor Jones like the same names like we're say like look inflation is coming and it's like these other guys who are supposed to have all the data all the people totally blindsided by like the worst inflation in like 40 years so it's it's kind of like to think that they know exactly like you know people like like to have this false sense of confidence makes them feel good that like oh don't worry we're under control um but the the Fed doesn't always really know quite what's right I mean I think 2021 they're they're transitory inflation college like was historically bad um like they're kind of going along and what what I think is extra tough is like they definitely have like ivory tower syndrome where like they're disconnected from what the average person's going through so they're looking at their models and this and that and sometimes boots on the ground is like just the only way you can get a sense of stuff especially in complicated periods and the fact that their role keeps getting more and more complex with more like I mean like look you know because they have like they've affected rates and they have the repo market that now affected FRC you know because of you know this this spread between money markets and and so it's like you're having all these second third order",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "with more like I mean like look you know because they have like they've affected rates and they have the repo market that now affected FRC you know because of you know this this spread between money markets and and so it's like you're having all these second third order effects like it's so complicated that like I don't envy to like the feds position gets gets like tougher and and look and it's like I always say you know like you know the United States is like like the like the best historical experiment ever of like free markets and capitalism but like since the federal reserve like there's this like small central planner who was like at the core of it that like made his way in where he's trying to control the price of money and interest rates which is you know like that's why central planning and Soviet Union failed is because it's an inferior system but yet the feds taking a bigger bigger enroll trying to like the central planner and it's tough job tough job yeah yeah man dude huge information I can't thank you enough especially for that last part because that's that's some homework I have to do like I literally I haven't studied the unwind nearly as much as I've studied the ramping because typically the unwind is tradable at least based on what I've seen in my limited experience um so I gotta check out some some more start precedent",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "some homework I have to do like I literally I haven't studied the unwind nearly as much as I've studied the ramping because typically the unwind is tradable at least based on what I've seen in my limited experience um so I gotta check out some some more start precedent on the unwind and see yeah just kind of see what kind of trade these as we can come up with but thank you so much for jumping on the uh the outlier podcast brother it's it's honestly it's great to chat with you I love hearing your thoughts in the markets what you're looking at and then for people that want to get a hold of you I'll drop your Twitter in the notes below along with your website is there anywhere else that they should look for you yeah I started putting some you if it is on YouTube as well so if they're watching this on YouTube yeah they got perusal insights and try to do something as markets are quieter I say you know let me do like the odd film and this and that different educational things so they can check me on YouTube as well wait I'll make sure that's in the notes and until next time we'll catch everybody later thanks",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  },
  {
    "text": "well wait I'll make sure that's in the notes and until next time we'll catch everybody later thanks",
    "metadata": {
      "video_id": "8d2PprSIK2g",
      "title": "Inflation & Trend Following with Matt Caruso - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=8d2PprSIK2g",
      "upload_date": "",
      "duration": 2947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8d2PprSIK2g&t=0"
    }
  }
]