[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you are mic quote, average person can do again, like you're literally on the outlier trading channel. And the entire premise for this entire conversation is that you have to, if even if you're in this stream, you have to think about shit differently. If we try to build something that the average person can do, well, never, never even don't even bother talking about investing, the average person can't even save enough to have an emergency expense for like a 500 expense that pops up over the course of a month. Like that's average. So the context of realistic, I think is super relative because I completely agree with you. The idea of like, well, the average person do that, absolutely not. But the average person also makes an insane number of very poor decisions that generally lead them to where they are. Circumstance has a role for sure, no doubt about it. But even with circumstance, there are decisions people can make to navigate a slightly different direction. But even to your point, I actually would also argue to in your favor that 20 a year, that's very hard to do. And I fully agree with you there. So and that's actually part of the scenario that I want to review today. So let's move",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "slightly different direction. But even to your point, I actually would also argue to in your favor that 20 a year, that's very hard to do. And I fully agree with you there. So and that's actually part of the scenario that I want to review today. So let's move over to the main screen and let's just kind of war game this a little bit to preamble this conversation. And for those that don't know, the conversation today again is just a deep dive into like my actual trading approach. So if we say 20 a year is difficult, which I fully would agree wasn't even my target. What I wanted to do is try to find something that can outpace slightly. So maybe we'll do like 15 because that's what I used. And you'll notice that puts you at 1.3 mil. So you still cross the threshold, but this puts us a little deeper than what we might want, meaning 20 years is a hot minute. So that leads us to the other components to the equation that we can modify. And there's really only two. There's our contributions. And then there's a time span. Well, we know we don't want longer. Longer is not the direction we're trying to move this thing. So we know we want shorter. So we know if we shorten this, we're going to have less money. So then where does that put us in this one? You need to save more. The",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "we don't want longer. Longer is not the direction we're trying to move this thing. So we know we want shorter. So we know if we shorten this, we're going to have less money. So then where does that put us in this one? You need to save more. The only choice. It's the only choice. Now you might be able to achieve a higher return than this. I've been really fortunate over my trading career and I absolutely have. But that being said, trying to think about what's normal and abnormal is important here. Because when we think about the idea of achieving a higher return, a really big part of that is luck. And I'm the first one to admit it. Now do I think my return is luck overall? Absolutely not. I know that I work super hard for it and I can quantify what I do. However, there is something to be said and to acknowledge about the alignment, just the happenstance of where a trader is at in their trading career. What does the market happen to do during that time frame? And how well is that trader able to capitalize it good or bad? So when I'm talking about luck, I don't mean luck in terms of making money. That's not luck at all. And I know that's not luck. I'm super confident in saying that is skill and I know it's skill because of being able to achieve positive returns when the market's",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "So when I'm talking about luck, I don't mean luck in terms of making money. That's not luck at all. And I know that's not luck. I'm super confident in saying that is skill and I know it's skill because of being able to achieve positive returns when the market's in down and stuff like that. That's skill, confident. But what I'm talking about is this range here. The difference if we plot this for an example between a 15 return over this time frame and a 28 return, watch what happens to this number skyrocket. It goes parabolic. So do I think that this is realistic? Do I even think that knowing what I know now that I'm going to maintain this going forward? No. So I certainly don't think so. The only reason why my compound annual growth rate is that high is because my last two trading years were so unbelievably anomalous as far as the rest of the sample is it skewed everything to the upside. Realistically, my compound annual growth rate tends to be the low 20s. And I fully expect my compound annual growth rate here to trickle back down into that range. So what am I highlighting here and what does this have to do with my strategies? What I'm highlighting is that the way that you start this game is really important and it's going to inform what you try to do from there because as I just told you, this was",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "what am I highlighting here and what does this have to do with my strategies? What I'm highlighting is that the way that you start this game is really important and it's going to inform what you try to do from there because as I just told you, this was not my starting goal. This was not my starting goal. My starting goal was something that what I consider to be slightly better than this, which was 15. So in the pursuit of 15 over the last 18 years, I find myself at this number right now, but that's not what I was targeting. So there was a deviation along the path and I'll explain why a little bit later. This part is super important because when we talk about my approach to trading, my approach to trading was built trying to achieve this. How do I get to this number? And the way that I thought about it was like this. If I build you a time series and let's say, I'll do it down here so there's more space. Let's say that this is year 20 and this is year zero. I keep forgetting to update the space on the driver for this thing so I can use the bottom of my screen. This is year zero. So the way that this works in my opinion is in the beginning few years, you're going to have to bounce around. It's going to take a while to figure out",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "on the driver for this thing so I can use the bottom of my screen. This is year zero. So the way that this works in my opinion is in the beginning few years, you're going to have to bounce around. It's going to take a while to figure out what you're trying to do. So in these beginning years, I think it's way more impactful to focus on building your process and getting this number up, whatever you have to do. For me, it was a mix of things. I've always worked a bunch of random side stuff to find more ways to make money. You guys have heard this stuff a million times. It's stuff like in college, I used to buy in some motorcycles. I used to shovel for pe... It's like all that kind of bullshit. It just found ways to make money. Then I made a mistake in that my first two years were negative. Those two trading years, both of them were single digit negative so it wasn't that bad but nonetheless my first two years were negative. So that actually moved me backwards, right? Lost money. I lost money in a point of time where I was really like, I gained very little from that experience. That's the frustrating part is when people say like, oh, you got to use live money. And it's like there's nothing like sure. There's nothing that replaced live money. But what I can tell you is that",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "time where I was really like, I gained very little from that experience. That's the frustrating part is when people say like, oh, you got to use live money. And it's like there's nothing like sure. There's nothing that replaced live money. But what I can tell you is that the shit that I learned in the first couple years could have been done without live money, without a doubt. It did not need to be the case. I was impatient as fuck. And a big source of that impatience, I realize is also what is led to me being able to do this. That impatience is led to... The reason why I'm impatient is not because I want what I want right now. It's because the starting point is uncomfortable enough that it is a significant motivating factor to try to find ways to make that not... To make that not the case. So my entire focus was on building something that was repeatable that I could consistently land around this number. That was my entire idea. It's very different than what a lot of people pursue. The reason why this matters so much is because if I were to pursue top line performance, I would be able to maintain and get the best possible return I could. I genuinely would take a different approach. So as I talked to you about my trading approach, it's very important for you to know that context. Because the stuff that we're",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "to pursue top line performance, I would be able to maintain and get the best possible return I could. I genuinely would take a different approach. So as I talked to you about my trading approach, it's very important for you to know that context. Because the stuff that we're going to be talking about is stuff that's optimized for robustness. It's not stuff that's optimized to get the best possible return right now. And it's because I viewed it as a genuine no-fail scenario. And you guys all know the context behind that. Not going to waste your time. But that is absolutely why that was my focus. It's because for me, it was a no-fail proposition. It wasn't something that I could just risk the money and if I lost it, I could just make it back sure. It has cascading impacts that I cared more about. So that consistency is an ultimate driver of what you're about to learn, which is how I generally trade. Okay, cool. So let me trash all this. And I want to just go through a broad overview. And I'm not going to spend a ton of time deep diving each individual piece because this is a beginner series. And I want you to focus more on the core concepts that we're going to discuss. And then I'm already working on an offshoot of this to go a little bit deeper. I'll probably do that on like the Thursday skill development streams",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "piece because this is a beginner series. And I want you to focus more on the core concepts that we're going to discuss. And then I'm already working on an offshoot of this to go a little bit deeper. I'll probably do that on like the Thursday skill development streams so that we can like hone in on individual pieces. But that stuff doesn't matter as much as the main stuff that we're about to review, which is this isor of a slide. So the left hand side, you could see how I trade. I'm not really going to spend a ton of time on that upfront. I want to spend more time on the right hand side. And it's specifically number four and number five. So when we think about building a trading approach, you all at this point, hopefully are familiar with what I refer to as the outlier strategy process in the outlier trade process. And it's just a framework for thinking. But the strategy process begins with a profit mechanism. It does not begin with a strategy. It does not begin with a structure. It begins with understanding profit mechanisms. And there's a lot of ways we can do that. And I will show you one of them right now together. So I'm going to move this out of the way for just a few moments. And let's take a look at. Palantir, Palantir is fine. It's already up. Okay. So if we take a look",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "we can do that. And I will show you one of them right now together. So I'm going to move this out of the way for just a few moments. And let's take a look at. Palantir, Palantir is fine. It's already up. Okay. So if we take a look at Palantir and I just zoom out and I'm going to zoom this into that we can cycle through it. But I want you to focus a little bit on the earnings release and then the move following the earnings release until the next earnings. So in this case, it's too early to tell. We can't tell. So let's scroll back and we have an earnings release here. And then leading into the following earnings release here. This is up. Right. We can see that. So that's one. Next let's scroll back. Let's take a look at this earnings. Let's take a look at this earnings. This is up over the course of that earnings. That's two for two. Next. Let's take a look at this one. This earnings. This earnings three for three. I'm literally just looking at price direction. Next, we'll scroll back. Look at this earnings. This is after. After the close here. So then this is where it would have opened post earnings here. And to the following earnings, which this one is after the close. So it would have closed here. So that's still up. Four for four. Next. Take a look at this one.",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "is after. After the close here. So then this is where it would have opened post earnings here. And to the following earnings, which this one is after the close. So it would have closed here. So that's still up. Four for four. Next. Take a look at this one. After the market here. Here five for five. And we'll do one more. Take a look at this is before the market. I knew that one of these was squarely. So this is prior to earnings. This is on earnings. We'll just use on earnings. And we'll run that across. And it opened here and closed here. So I would call that five for six. That's one ticker. What did I just show you? I just showed you a profit mechanism. That profit mechanism is very well known. It's super well researched. It's called post earnings announcement drift. There are certain criteria that go into narrowing it down and making it stronger in some instances versus others. But this is something that becomes relatively predictable. Not purely predictable, relatively predictable. But I'm trying to explain to you here is the importance of not worrying about if I should use MACD or RSI. Not worrying about if I should sell my option at 45 days versus 40 days. Not if it should be at a 35 delta versus a 30 delta. All of that stuff is secondary. Not saying it doesn't matter, but it's secondary. And I always use the example",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "or RSI. Not worrying about if I should sell my option at 45 days versus 40 days. Not if it should be at a 35 delta versus a 30 delta. All of that stuff is secondary. Not saying it doesn't matter, but it's secondary. And I always use the example of a high class problem. If I sell a 30 delta and I say to myself, shit, I could have made more money with the 35 delta. Primarily a river about it with the money you just made, right? High class problem, get over it. But what I can tell you is that it doesn't matter if I sell a 30 delta put or a 35 delta put and the underlying goes down. I lose. And then it's a low class problem. It's a function of how much do I lose? The point that I'm making sure is abundantly clear is that your sole focus when building strategies has got to be on profit mechanisms. It's the only thing that matters. After profit mechanisms, then you can get into the nuance. Joe says at the end of the day, it's always about price change. Very close. I actually fully agree with part of that for sure. And it's a really important point. So I'm glad you mentioned that. Joe, it's very, very close. Now for those that are listening, why do I say it's very close instead of saying I fully agree with that or that's completely correct? Because there's",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "with part of that for sure. And it's a really important point. So I'm glad you mentioned that. Joe, it's very, very close. Now for those that are listening, why do I say it's very close instead of saying I fully agree with that or that's completely correct? Because there's an important caveat here, especially for option traders. Anybody guess what that is? Why do I say mostly? Mostly correct. There you go. Reese has it. Because if we think about profit mechanisms, they all fall under just a few umbrellas. There's not that many of them. There's stuff that deals with price, direction. There's stuff that deals with volatility. And then you can argue that there's some structural profit mechanisms that very often are subsets of these. Not always, but very often. I'm not going to go into things like pricing, discrepancies and stuff like that, but they do exist sometimes. So the reason why Joe is very close but not fully on target is because when we think about profit mechanisms, there's two bucket. And for example, if I'm trading vol and I buy a straddle, in the process of buying the straddle and let's say that I gammahedge, I guess I'll call it gammah scalp because we're long. I want to cover that cost. And then I'm going to gammah scalp and delta hedge, which is same same essentially in this context. What I'm doing is I'm actually muting my susceptibility to this. I'm isolating a different",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "gammahedge, I guess I'll call it gammah scalp because we're long. I want to cover that cost. And then I'm going to gammah scalp and delta hedge, which is same same essentially in this context. What I'm doing is I'm actually muting my susceptibility to this. I'm isolating a different profit mechanism, not price, but volatility. So those are the two starting points that you have. That's the beautiful part about this. And this is the beautiful part, especially for those that are on the stream right now. Is if you ask most traders this kind of question, they will have no idea how to even start tackling this sort of thing. And it's because most people don't think like this. It's not because I'm super unique. It's just because I've looked at this shit long enough that I've found ways to categorize stuff in my mind. That structure adds so much efficiency to what I'm doing. And this is why, again, looking back at what I've been able to return, why I've been able to return those kind of metrics is because while tons and tons of people are looking at and trying to solve the exact wrong questions, not due to being stupid, but due to their own ignorance about the topic and not getting structured enough. So when we're thinking about profit mechanisms, this is effectively how I break it down. There's price direction, there's volatility. And then again, there are some other things that would be",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "not due to being stupid, but due to their own ignorance about the topic and not getting structured enough. So when we're thinking about profit mechanisms, this is effectively how I break it down. There's price direction, there's volatility. And then again, there are some other things that would be good for another stream. They're not really relevant right now, but there's maybe three others plus three plus in this bucket down here. So if we then click into these, we can start finding some really good ideas. EHODGE says price can't change without volume in a direction. So what categorized each differently? That's not volume, that's volatility. So that's in it's a great question. I'm glad that you asked it because people who are used to trading stock will see vol and they'll see volume. Options traders, when we see vol, we see volatility. So this is volatility. Not volume, good question though. So then if we think within price direction, again, there are different things that I can even see just by eyeballing a chart. This isn't trying to like overfit and look for patterns. This is literally just eyeballing shit. One of those things I literally just showed you for price direction. I just showed you post earnings announcement drift in this case to the upside. That's a price directional trend that we can see. We can quantify it. We can literally measure what the average move is for a basket of stocks that have certain criteria",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "showed you for price direction. I just showed you post earnings announcement drift in this case to the upside. That's a price directional trend that we can see. We can quantify it. We can literally measure what the average move is for a basket of stocks that have certain criteria and see what the average move is post earnings. One of the easiest places to start. Then we can think of other kinds of ideas that go into price direction. So another one, you guys will know this name. Good old APP. So I think this is about right. Yeah, so let's zoom this in. One of the cool things thinkerswim did is they fixed this so now we can actually get like pretty specific and granular. Okay, this is what I want. It's adding a couple more data points to the sample. We need to go back a little bit longer once you do a three year. Do the same thing. Okay. So I want you to look at something. So this is a trade that I took last year and a bunch of the discord members and people that have been attending the streams. You guys will know about this one because I spent a while talking about it. This is one of the wildest trades that I've caught. And I remembered distinctly this was my entry September 11th. So notice how earnings is back here. And I did not play the post earnings move and it was",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "about this one because I spent a while talking about it. This is one of the wildest trades that I've caught. And I remembered distinctly this was my entry September 11th. So notice how earnings is back here. And I did not play the post earnings move and it was for a couple reasons, but one of them is it didn't actually fit the criteria that I use. So that doesn't mean that it can't exhibit drift. It doesn't mean that it can't go up. It just means it doesn't fit the criteria for that specific strategy. So then price goes sideways. This is already on my watch list for a series of reasons that has to do with the volatility, price direction, all that kind of stuff. And then we roll sideways and then we come into this day. So this day has massive volume. There was a strong catalyst in terms of news that sent price rising. So leading into this no position, this fits what I call a breakout. Breakout has certain conditions and criteria that I've set for my version of a breakout and this fit most of them. So I enter a long trade here, it was with calls, doesn't matter for the sake of the conversation. And then we start fast forwarding time. And I just want you to look at this move from entry points. So not the whole day I didn't get in at the bottom entry point until it starts consolidating",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "it was with calls, doesn't matter for the sake of the conversation. And then we start fast forwarding time. And I just want you to look at this move from entry points. So not the whole day I didn't get in at the bottom entry point until it starts consolidating sideways. This is a 57 move and this is over a month. So a breakout has very specific criteria and a breakout can turn into other kinds of trades momentum, namely exhibiting some level of drift. And that's mostly what this did, right? The breakout occurred and then it had a couple follow through days. In my world, the breakout stops in this time frame. And then if it continues, then it starts leaning more into momentum. So now notice this here. And then for those that were on the stream yesterday, there was a stock we looked at. I was T. Good, good reminder gang. Thank you. T. It was somebody that one of the members was looking at. What do you notice about T? Well, let's take a look at this earnings move. Let's just call this a breakout and let's measure this breakout until it started consolidating sideways. This is over 30 days and this moved 14.5 not a bad move. But what do you notice the difference here? This is 10 extra days and 35 less return. What I'm showing you is that the criteria in my approach for a breakout is specific. I still you",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "sideways. This is over 30 days and this moved 14.5 not a bad move. But what do you notice the difference here? This is 10 extra days and 35 less return. What I'm showing you is that the criteria in my approach for a breakout is specific. I still you could still call this a breakout. You could call it post earnings announcement drift. It doesn't matter. You can call it a fucking potato called shit, whatever you feel like. The main point is that this doesn't fit the general criteria that I use. So even though this might have fit for that reason, this wouldn't have been a candidate in my world for a breakout play. Okay. So at this point, you should have a pretty good idea of at least this concept of what a profit mechanism actually is. And I've given you a couple examples and you should have at least a loose idea on how to find them. Now one of the reasons why it's so easy for me to talk about these is that the fucking know them, right? So I am fully aware that if you don't know and we stop there, then the question is like, well, fuck, how do I find something else? It's a great question and we should take a look at it. One of the first things that I would do personally if I wanted to try and solve for this is I would start by flipping through big",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "question is like, well, fuck, how do I find something else? It's a great question and we should take a look at it. One of the first things that I would do personally if I wanted to try and solve for this is I would start by flipping through big amounts of charts. It's exactly what I did. I used to look at thousands of them. I'm not looking at the charts to try to identify candlestick patterns. I don't really care. When I'm looking at charts, I'm looking at price and volume because we know ultimately that's what moves price. And if we're exploring some sort of price driven strategy, we need to understand price and volume. So what I do is I say, oh, that's kind of interesting. If I look at T, some shit happened on 25 November of last year. Volume went up massively. Volume was at 64.7 million, whereas the five day average was 33 and the 20 day average was also 33. So it effectively doubled why. And then what I would do is I would literally go back and I would see what happened. Why did it do that? What I'm saying is you start to get an understanding of the kinds of pieces of information that move stocks and the kinds of information that might not move stocks or the kind of information that sometimes you see it moves stocks, sometimes you see it doesn't move the stock. The important part here",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "you start to get an understanding of the kinds of pieces of information that move stocks and the kinds of information that might not move stocks or the kind of information that sometimes you see it moves stocks, sometimes you see it doesn't move the stock. The important part here is that we're not actually looking for some sort of magical chart pattern. We're looking to build a really important contextual understanding about how things move because again, we haven't even talked about strategies yet, we're half hour in, that's on purpose is because they don't matter that much and I'll show you why. If we go into T and I actually want you to answer in the chat, if you were to build an option strategy to trade this move right here, you don't have to be super detailed, but what trade would you put on? What trade would you place in order to play this 12.6 move? Knowing what happens. What do you guys think? Recess ratio called diagonal, any other guesses? What else would you guys do? Let's take a look. So this move started on 27 Jam and it goes to 7 March. Joe says long calls, Ricky says out of the money calls, Shrey says plus one reads without short calls, okay? Now there's an important element here for us. What exploration would you guys pick? Pick your exploration. So for Reese, pick an exploration, Joe, pick an exploration, Ricky, Shrey, all of you guys",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "calls, Ricky says out of the money calls, Shrey says plus one reads without short calls, okay? Now there's an important element here for us. What exploration would you guys pick? Pick your exploration. So for Reese, pick an exploration, Joe, pick an exploration, Ricky, Shrey, all of you guys pick an exploration. And while you're picking an exploration, give me Deltas. All right. So let's grab our workbook, get rid of all this, cheat, and let's learn about some profit mechanism. This is all going to be on 27 Jam. I don't remember how many of you came up with something, but it was a few. Not price right now, 24. I'm just going to default to a one lot for everybody because that doesn't matter. Okay, so let's see the expirations. TriForce says 60 day at the money calls, all right? So 60 DTE that puts us closest to 60 DTE is 21 March. And it's at the money will find closest to 50 Delta. I'm going to slide this out of the way so I can actually take a peak real fast. That puts us up to 24's. So 24's and that's 55 Delta. For premium here, I'm going to just take it at the offer. So 0.75. And then this is kind of annoying. All the math is broken. That's the worst equals me once. We'll figure it out. So we have our we have our one lot here. 75 cents. All right, what else did",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "I'm going to just take it at the offer. So 0.75. And then this is kind of annoying. All the math is broken. That's the worst equals me once. We'll figure it out. So we have our we have our one lot here. 75 cents. All right, what else did we get? Lauren says 1 to 2 months out 40 Delta. Okay, so we'll look for 30 days. This is to 30 days is this 28 Feb. Let's grab the 28 Feb. I'm going to move this over a little bit more. And you set a 40 Delta, which we can absolutely accommodate. Let's find us a 40 Delta. It's right here, the 24 and a half. This would be 28 Feb. That'll put us at the 24.5 Delta here is 0.39. And premium here will be 0.33. Okay, next. James says 15 days 15 Delta. Okay, James is going to have a problem, but that's okay. The move we're looking at is over this duration, but that's okay. It'll still be a good example. So closest to 15 days is 14 Feb. And use 15 Delta, 25, which gives us an 18 Delta. That's the closest. And then we get those for a dime. Okay, and we'll do one more. We'll do two more. H says 60 days out 70 Delta long. Let's do this one. Like this one, because it's in actual diagonal. So this one will also be 21 March. And you say 70 Delta long. Okay.",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "get those for a dime. Okay, and we'll do one more. We'll do two more. H says 60 days out 70 Delta long. Let's do this one. Like this one, because it's in actual diagonal. So this one will also be 21 March. And you say 70 Delta long. Okay. That puts us at this one 23. That puts us at 0.77. Premium for those 148. Again, I'm just using the offer for all of them. And then here we're going to be short. And then all of these will have a C next to it. Okay. And then you said 30 days out, that puts us at the 28 Feb. And then you said 15 Delta. That puts us here at the 25 5. And then you're going to collect 7 cents on that. Oops, my bad. The 14 Delta. And you're going to collect 7 cents. Okay. So I'm going to break this one out so that it's its own thing. And then there was one more from Shrey that I saw. 20 June 25. 20 June 25. 40 to 35 Delta. That's funny. None of those are available. So I'm going to go with the 25 for you. 25 call. Delta is a 0.43. It's the closest. And we're getting those for 89 cents. Sick. Okay. So now, let's fast forward time. And as we discussed, we're going to 7 March. So we're going to have to take a stop on the way for a couple of",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "you. 25 call. Delta is a 0.43. It's the closest. And we're getting those for 89 cents. Sick. Okay. So now, let's fast forward time. And as we discussed, we're going to 7 March. So we're going to have to take a stop on the way for a couple of these that are before that. We need to stop on the 14th of Feb. That's the first stop. The 14th of Feb, we have the 25 calls at an 18 Delta. And we got those for a dime. So let's go to 14 Feb X-Berry. Right now the stock price is loading. So that puts us at 25 86. So the closing price we're going to get for the 14 Feb 25 calls is 85 cents. Cool. I'm just updating the signs on these. Second. Okay. And then we have to stop on 28 Feb. For our next choice. What I'm going to do at the end of this is show you what. The PL looks like. For these positions. And we have two that we're going to check out on 8 on 28 Feb. We have the. 24 and a half call 39 Delta. We got those for 33 cents. And then the second one is just closing out the short call segment of this ratio call diagonal. So we're going to go to 21 March. We only have two stops left on our on our trip together. We only have one stop because we're just going to flatten",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "cents. And then the second one is just closing out the short call segment of this ratio call diagonal. So we're going to go to 21 March. We only have two stops left on our on our trip together. We only have one stop because we're just going to flatten everything here. Now we're at seven March. And it's at 27.1. And we need to close. We need to close some trades. So we need to close our 21 March. 24. We're going to close those for 3 10. We need to close. We need to close our 25 calls that are in 20 June. Those are 279. And we need to close our 21 March. 23s. Those are 4 10. So now. Let's see. Let's see how we did. Is this. Accurate. It looks close enough. We need to close. These need to be times 100. That's for sure. Oh no, I already did the math correctly. Great. Good, good, good. So let's see. Let's see how we did. Don't worry about the signs. The signs don't really matter right now. First things first. Let's just eyeball. Which of these strategies. Gave us. The best return in terms of piano. And then we need to divide this by our cost. So this is one of the. So this is the cost. The percent returns here. So this trade boils down to this one. So what do you guys notice. Well, I notice a few things. I notice the 28",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "piano. And then we need to divide this by our cost. So this is one of the. So this is the cost. The percent returns here. So this trade boils down to this one. So what do you guys notice. Well, I notice a few things. I notice the 28 February 24 and a half. The 40 delta. Give us 231 bucks. I noticed that the 21 March 24 call the 55 delta. 18 delta. Give us 75 bucks. So there's a couple really important points here that go back into the idea of figuring out how to build a strategy around a profit mechanism. Is that if we take a look at this scenario and we see how all these trades played out, we can see that there are some that performed very well compared to the others. We can see a middle of the pack. And then we can see the bottom of the pack. Great. Now, if we take the same exercise, we're not going to go through it. But if we take that same concept of an exercise. And then we apply it. This move in a pp. And we apply it from the move from here. 442. We would probably change some things about the trades we put on. Yes. I assume that will be unanimous. What I'm showing you. Is that rather than worrying. So much about what's option strategy you want to try to build. If you spend more time. Analyzing the profit",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "here. 442. We would probably change some things about the trades we put on. Yes. I assume that will be unanimous. What I'm showing you. Is that rather than worrying. So much about what's option strategy you want to try to build. If you spend more time. Analyzing the profit mechanism. You literally start to answer the question for yourself. So in this scenario. We probably know that we would want to put on something that compounds better. We know that not using flat one lot across the entire scenario. We know that there are certain strategies, certain option structures that will perform way better than the others. Because again, if we go back to this scenario, not all those two are created relatively equal in terms of P and L. Take a look at the return on capital. They're not the same return on capital. So if I were to scale these to not be one lots, but to actually be the same size, this one actually would have two. And this one would smash this one. Right. So the point that I'm making here. Is that I normalized all of these based on a one lot. But really what matters in this context is actually this number. And we can see that this one did really well. We can see that this one did insanely well. Again, if we were to scale this one to be the same as the others in terms of total size. Then this",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "what matters in this context is actually this number. And we can see that this one did really well. We can see that this one did insanely well. Again, if we were to scale this one to be the same as the others in terms of total size. Then this one beats everything. And it's because this was a lower delta. The lower delta did super, super well. And it's because we knew in that scenario, we cherry picked that the thing would move a lot. But what we're looking at here. Or a mix of people in my opinion that are just defaulting to an approach. Because it's the default approach. We're not taking the time to think about the scenario and to fit something to that scenario. Now, all that being said, this is a hypothetical. We're looking back in time. But the point is everybody should be able to build an extremely well performing strategy. If we know what happens, then the game is trying to figure out. What are we able to accurately predict reliably to some degree of consistency. And then to build something that generally allows you to capture that. So I'm in no way saying that this is the best choice. It's most certainly not. But what I'm showing you is an important skill of taking the time to one, understand profit mechanisms. And then two, taking the time to deeply learn options in how they behave. Because if you do those two",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "way saying that this is the best choice. It's most certainly not. But what I'm showing you is an important skill of taking the time to one, understand profit mechanisms. And then two, taking the time to deeply learn options in how they behave. Because if you do those two things in this scenario, you would know that there are even better versions than everything that's here. Then everything that's here. There are strategies, simple strategies. That would make more money than all of these. None of these are optimal. And that's okay. It's not about picking, quote unquote, optimal. It's about this understanding of how things behave. So the point to take away from that entire segment is that. Based on our idea, what we build will look. Super different. It will look very, very different depending on what our idea is. So now. To go back to this quickly and then we'll get into some QA because I got a couple questions ahead of time that are pretty good. I want you to just take a second to take a look at what's on here. And I want to talk to you about the way that I mentally implement all of these. Because it's not about what the strategy is itself or the structure in this case. It's about what the profit mechanism is. And then finding something that fits that profit mechanism. Give me one second. So. So. When I look at what my goal was. And",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "implement all of these. Because it's not about what the strategy is itself or the structure in this case. It's about what the profit mechanism is. And then finding something that fits that profit mechanism. Give me one second. So. So. When I look at what my goal was. And if you recall, my goal is consistency. Okay. So let's deconstruct this. If I'm trying to make a consistent 15 and I buy an index. And what depends on the timeframe for this. Because if we take a look. And I forgot what you just do it in here. If we take a look over the last 10 years. And spy. And I'm going to talk about monthly chart by the way. You'll notice that there are very clear periods where things roll over. That's okay. I don't necessarily mind that. But if I do this for a long enough period of time. Well, then this can become pretty powerful. If I'm able to get 15 each year. And I'm going to do a lot of generational goal. Not what happened at all. My I didn't even crack this for several years. So. That tells me that if I want to do something that's like really basic. It's not going to work. Meaning just buy and hold an index. It's not going to work. Because the market. And then we're going to go down the years. If we take a look at 22. Here. Into 23. This was a quasi",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "to do something that's like really basic. It's not going to work. Meaning just buy and hold an index. It's not going to work. Because the market. And then we're going to go down the years. If we take a look at 22. Here. Into 23. This was a quasi bear market. Just shy bear market. It didn't end the year in a bear market. End of the year like down like 19. So. That gives us important feedback. So if we go back. We now know definitively that the answer to that. But. If I go back to the same example that I just gave you guys looking at the last 10 years. What do I notice about most of these 10 years. Notice most of them are up. Most of them are positive. So for those that understand the way that I build out my portfolio. This should completely logically make sense. And hopefully close the loop. Most. Of the time. Up. So what does that mean? This is the birth of a core allocation. This is the birth of a coverage strangle in an index ETF. Because most of the time this will get me damn close. Most of the time. Now. For those that have been following along with the recent coverage strangle example that I've been working with you guys. You will notice that there's a way. To amplify this. This is the way to. A leverage manner benefit from as much of this as",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "Most of the time. Now. For those that have been following along with the recent coverage strangle example that I've been working with you guys. You will notice that there's a way. To amplify this. This is the way to. A leverage manner benefit from as much of this as we can. But decrease our downside. Participation. to at least conceptually build something that can outperform the market relatively consistently. And again, it's because the market most of the time goes up. And then as long as when things are going down, you're not asleep at the wheel and you have a good approach, well, now you can easily rotate out, but there's an important difference here. If I'm trading the coverage triangle, the stock's going up and then things start going down. And let's say that I get cut out here. Okay, cool. Let's say at this point on the year, I'm up 8 wherever the year started. Let's see the year started like there's. Well, this is not this. This means that I need other tools in the toolkit to be able to use. In order to make money when this is not doing what I needed to do most of the time this will do the job. But there will be periods where this doesn't do the job. And I can't just sit and wait out those periods otherwise this goal doesn't happen. So then I need a speculative toolkit. This is where I implement strategies that",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "do most of the time this will do the job. But there will be periods where this doesn't do the job. And I can't just sit and wait out those periods otherwise this goal doesn't happen. So then I need a speculative toolkit. This is where I implement strategies that allow me to create either inversely correlated returns non correlated returns. And to have other things to do when this isn't working. But if that's working and doing what I needed to do, there's no reason to not. To not lean into that with most of the accounts what I do. In the speculative allocation. You guys already know a lot of the things that exist in here. So in the speculative allocation that's trading things like pivots flow breakouts breakdowns. Maybe some sort of momentum depending on the timeframe I would call it that for sure. It's pretty much all of the volatility suite that I trade. But all of these things are literally designed to give me something that I can trade in effectively every single market condition without exception. And this is my broad approach to trading. This is what I do. This is when the market is having a year like it is now. This is a great example so far what we've seen this year is a great example. If we plot year to date, what do you guys notice? That shit is flat. That is super flat. And for all of the guys that",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "is having a year like it is now. This is a great example so far what we've seen this year is a great example. If we plot year to date, what do you guys notice? That shit is flat. That is super flat. And for all of the guys that are on the stream, which will be most of us. You guys know without a doubt. That. Plump. Round. Is better. But in this case, just get rid of some of the round. Gotta be more of like a diagonal. So. If I were to take this idea. Of 15 consistent. And you guys already know how I do this. Begin with the end in mind. The Marine Corps version of this is just reverse plan. So what I need to do is I need to figure out. I need to break this 15 out. I can't just wait until the end of the year and be like. Am I at 15? I'm not a fuck. I missed it. That's not going to work. So what I do is I build milestones monthly. Quarterly. And what I do is if I'm supposed to make 15 over the course of the year. I know again that if I plot a time series. January to December. I know that it's not going to be linear like this. Not how markets work. But what I need to make sure is the case. Is that if I break this out over quarters. That even",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "year. I know again that if I plot a time series. January to December. I know that it's not going to be linear like this. Not how markets work. But what I need to make sure is the case. Is that if I break this out over quarters. That even if over q one I'm up and then I go back down. And then here like this is still success. Because even though this might be plus 2 over that first quarter. So behind pace. But still in the correct direction. And then next month we try to bump that up and so on. So that's why my account is up so much. So far this year. Is because. Even as the market is doing this. I'm not just leaning in with the core allocation. And then just kind of like waiting and seeing how it shakes out doesn't work like that. I use the core allocation over this time frame. The core allocation still fortunately makes money. And it has everything to do with the beautiful component of options. Being able to sell premium as things were rotating sideways and index ETF is still good. However, in some sort of leverity TF. This is also a slow death if it does this for too long. So can't just do that forever. That's when you guys saw me rotate into short puts. And I've been in short puts mostly sense. And it's simply because the market has been oscillating sideways.",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "of leverity TF. This is also a slow death if it does this for too long. So can't just do that forever. That's when you guys saw me rotate into short puts. And I've been in short puts mostly sense. And it's simply because the market has been oscillating sideways. This is not a good period to be into a bunch of long levered ETFs. Would it be the worst thing on earth? Something that you can't navigate longer term? No, it's okay as long as you have a long enough time frame, but it's not what I do. Okay. So I want to summarize with a couple things. And then we can get into QA with whatever you would like to talk about. The most important stuff that you could possibly take away from what we talked about today. Is not the individual strategies that I use anywhere. That's really not what matters. What matters is the process we spent the beginning half of the stream focusing on, which is your best possible bet to build something that works for you. Is to invest the time in understanding profit mechanisms. And then it's to invest the time into deeply understanding options, how they work. And if you do both of those, then you will arrive at many of the same conclusions that I have here. There's nothing novel and what I do whatsoever. There's literally nothing novel and what I do. And it's because it's based on pure market",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "understanding options, how they work. And if you do both of those, then you will arrive at many of the same conclusions that I have here. There's nothing novel and what I do whatsoever. There's literally nothing novel and what I do. And it's because it's based on pure market fundamentals. That's literally it. That's literally it. So when I'm trading stuff like breakouts, break downs versus pivots versus flow, there are different ways I set up those trades based on my forward expectations, based on how I know those things behave. And again, I have another slide that I started to build that will go into detail on those with some recent examples for all of them on the Thursday stream. However, the main thing to pay attention to here is that for direction, if I'm trying to trade something that's bearish, it doesn't matter if I sell calls or buy puts. If the thing goes down, they both make money. It's now a high class problem of which one makes more money based on how this thing happened to go down. What is unacceptable is if I put on long puts expecting something to go down or short calls, expecting something to go down, and then it goes up. I'm wrong. I'm wrong in either case. I've lost money in either case again. Then it's a low class problem of how much did I lose? What's unacceptable is that if I'm not able to find an approach to",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "calls, expecting something to go down, and then it goes up. I'm wrong. I'm wrong in either case. I've lost money in either case again. Then it's a low class problem of how much did I lose? What's unacceptable is that if I'm not able to find an approach to differentiate enough to create positive expected return. Because it's completely unrealistic to and I'll give you a recent example we talked about this on this past Thursday stream because I think it's super important to talk about losing trades. And speaking of bearish place, I had not that I had this I had S a T s and I had short calls. Now, this is a deeper part of the position I had been trading this to the downside for some time. My short calls were like way up here at like the 24 handle or something. And I took the trade off at a small loss in here. I forgot which day specifically, but in here. And the reason is because it found a bite rallied fell back down found the same bite on like the same general volume node rallied. And even though that it would have been better off today, it doesn't ultimately matter to me because while I was in this trade, it wasn't doing what I thought it was going to do. And that's OK. That will happen so frequently. Take the trade down at a small loss, move on. The idea here is still",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "better off today, it doesn't ultimately matter to me because while I was in this trade, it wasn't doing what I thought it was going to do. And that's OK. That will happen so frequently. Take the trade down at a small loss, move on. The idea here is still completely valid. But what I care about is how does it behave in this region? And for the strategy that I had on and for the idea that I built this trade around this wasn't doing that. Would the short call still be fine? Yeah, of course, got plenty of room. But it didn't align with the idea that I had. So it's really, really important to define the idea. So then it becomes super easy to manage a trade because all the questions of like, should I do something? They go away because it's literally a function of is this thing doing what I thought it should do? Yes or no? No, it is time to get out. Regardless of what the PNL is, it doesn't matter. It's not doing what it was expected to do. And then if you find yourself in too many of those cases where shit continues to do stuff that you're not expecting it to do, that tells you that you don't understand the profit mechanism well enough. It literally is giving you all of the feedback you could possibly need to build a better strategy if you listen to it. All right, that's",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "shit continues to do stuff that you're not expecting it to do, that tells you that you don't understand the profit mechanism well enough. It literally is giving you all of the feedback you could possibly need to build a better strategy if you listen to it. All right, that's enough of Eric soapbox as you guys can tell the like, especially this topic I'm deeply passionate about because this is ultimately what trading comes down to and notice how most of the stream today wasn't about like my specific strategies because it doesn't it doesn't ultimately matter. That's not what matters here. What matters here is this stuff we spent the bulk of the stream talking about now that being said, I'm happy to talk about individual strategies. If there's ones you guys want to talk about happy to let's do that, but I want to make sure that we're not wasting time me telling you how I trade a ratio called diagonal because that doesn't matter for somebody else. It's not going to translate what's going to translate is the research process that I shared with you now that being said, there were a couple questions that I got from the discord before and then I happy to open it up to anything else. But one of them was from the boy Dan who says curious to know more about when you look at fundamentals in which ones and when you don't care. It's a great question. So",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "got from the discord before and then I happy to open it up to anything else. But one of them was from the boy Dan who says curious to know more about when you look at fundamentals in which ones and when you don't care. It's a great question. So the way to think about fundamental and technical analysis is this. If we go to strategy process, it matters here. This is when I start looking at fundamentals. So effectively when I'm looking at profit mechanisms, I'm just looking at something that moves in some way that I think it can monetize. Then I need to understand it deeply and that's where I do all the research and understanding going back to post earnings announcement trip that's fundamentals. And understanding what criteria is important for something to on average exhibit post earnings announcement drift is literally quantifiable. You can do the research. You can find out just like I did. It's not that difficult. All I do is take a look at a few thousand stocks over the last 10 years. And I analyze the conditions around their earnings releases. And what the follow on price performance not only over the next quarter, I actually do like the next day three days five days, 10 days, 20 days, 60 days, that kind of thing. And measure and see what it looks like. So the way that I use fundamentals is twofold. The first way that I use fundamentals is general",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "the next quarter, I actually do like the next day three days five days, 10 days, 20 days, 60 days, that kind of thing. And measure and see what it looks like. So the way that I use fundamentals is twofold. The first way that I use fundamentals is general understanding of things context. So there are a lot of instances where I will have fundamental knowledge, but it's not necessarily a big part of the trade decision. It's just something that I'm generally keeping an eye out for. That's one scenario. Then the next scenario is if I'm trading something that fundamentals matter for my idea. Here's the way to think about that. And then we'll get into what fundamentals because it does matter and it actually changes based on timeframe fun fact. So if I was trading let's say, let's say that I wanted to trade S a T S, but let's say I wanted to trade their earnings release itself. I was going to trade volatility for their earnings release. Do I care about the fundamentals? No, I don't. It doesn't matter to me. I don't care about the difference. I care about vol in that instance way more than anything. So I might look at the fundamentals for context, but I don't really care. Let's take a look at another scenario. You guys know that I have a position on and Palantir. This is a much longer term idea. The position I have on and Palantir",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "way more than anything. So I might look at the fundamentals for context, but I don't really care. Let's take a look at another scenario. You guys know that I have a position on and Palantir. This is a much longer term idea. The position I have on and Palantir is like all the way out into 2027. So I'm going to take a look at the fundamentals. Clearly, a completely different expectation here. So fundamentals do matter. And fun fact, you can deconstruct what fundamentals matter over what time frames. And there's a really easy way to think about this. Palantir. And we take a look at their financials. There's a couple things that matter to me. Pretty much more than anything. Really on things like the multiple actually do matter, but not that much. Things that matter a lot. If you think about again, you can always do yourself a favor. If you go back to the basics, what is it? What does a company do? They sell something. This is what a company does. They can sell service. They can sell a product. But they sell something. How is that working? How is that going? So the very first series of metrics that matter the absolute most to me are sales. That's what the company is meant to do. Sell. It's got to sell something. So that's the first thing I care most about. Then after that, it starts getting more nuanced based on the holding duration",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "very first series of metrics that matter the absolute most to me are sales. That's what the company is meant to do. Sell. It's got to sell something. So that's the first thing I care most about. Then after that, it starts getting more nuanced based on the holding duration and what I think matters the most. But revenue. How much is it able to keep? I care about things like operating efficiency metrics. How well does it manage the money that they have? I care about things like debt. How much debt do they maintain? Debt matters a lot because it can absolutely tear a company down. If they misuse debt, it's not good. So what I can do is get a sense and literally take a closer look at how things are going in terms of our sales going. How much of that are we able to keep? How well are we growing assets compared to our liabilities? I also care about solvency. So that thing, that's things like quick ratio. That matters. Those kinds of debt metrics. So the period where that kind of stuff matters the most for me is actually when it's a longer term idea. Short term ideas. I don't really care. Post earnings announcement drift is anomalous in that it's a shorter term idea that I still do care. But it's because it's literally the premise of the profit. So fundamentals matter. It's ultimately what moves the company. Even things that I'm trading",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "idea. Short term ideas. I don't really care. Post earnings announcement drift is anomalous in that it's a shorter term idea that I still do care. But it's because it's literally the premise of the profit. So fundamentals matter. It's ultimately what moves the company. Even things that I'm trading loosely. I'll generally have an idea, but there's an equal number of instances where I have no idea. There's I use this example yesterday. It's completely true. There are times where I'll trade things that I literally don't even know what the company does. I have absolutely no idea because some of the things I'm trading, it doesn't matter. If I'm trading volatility in something, I don't really care. I just care about what vol is priced at. What I think might be an opportunity for where vol might be better placed at. Not saying that it's too expensive or too cheap because who am I to say that? And then that can become an idea. But that doesn't matter so much. It's not really based on fundamentals at all. So that is from my boy Dan. I know if Dan is in the stream, but I'll let him know. Talked about this at like our 10. And then another one was from Elizabeth, which is how you practically incorporate Greeks into the strategies. This is one of like the greatest possible questions. And you guys actually got an example of it here. The way that I incorporate the Greeks",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "Talked about this at like our 10. And then another one was from Elizabeth, which is how you practically incorporate Greeks into the strategies. This is one of like the greatest possible questions. And you guys actually got an example of it here. The way that I incorporate the Greeks is by once I understand how the profit mechanism works. And I'm thinking about how I want to capture the profit mechanism. The Greeks or what tell me what makes the most sense. Like I said, in the scenario here, none of these are optimal. I know that because I know the Greeks. So the way that I use the Greeks in any strategy is using it as an input against what my expectation is. And then what actual position best reflects that. So again, using. S a T s because we were just on let's use Palantirks were on Palantir. Do I want to sell puts in Palantir? Obviously not. It's a longer term idea. Okay. So I know that this is something that I want to play the long term drift in. So then what do the Greeks help me nail down? Well, I could play the shorter term time ranges and still maintain perpetual exposure. So what I could do is buy options that are 60 days out. And then as it comes further in time, roll those 60 days out, maintain a consistent 60 day exposure. I could do that. That's an idea. But that has",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "term time ranges and still maintain perpetual exposure. So what I could do is buy options that are 60 days out. And then as it comes further in time, roll those 60 days out, maintain a consistent 60 day exposure. I could do that. That's an idea. But that has implications. I'm going to have more cycles. And I could be moving this at a period where it's suboptimal based on where price happens to be in the 60 day window. So then if I go further out in time. To the 15 Jan 27th. If I pick some sort of strike that's super far out of the money, I can do that. One of the problems there though is I know gamma is pretty much non existent this far out. So it means that if I'm building something around the idea of gamma providing most of my PNL, I'm going to be sadly, I'm just going to be super sad. When I get a move, but then I don't make the money that I think makes sense here. Because if I go super far out in time, I know what theta does. There's going to be more theta, but there's going to be a lower theta decay as a percentage of the total premium. There can be more gross theta decay. If you go super far out in time, because what ends up happening is if you're super close in time, you literally start running out of extrinsic value",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "there's going to be a lower theta decay as a percentage of the total premium. There can be more gross theta decay. If you go super far out in time, because what ends up happening is if you're super close in time, you literally start running out of extrinsic value in the options. So if I take a look at this five delta. Theta decay and the five delta here is eight cents. Then it goes to six cents at the three delta. Back out here. And we take a look at our theta. Our theta is like four cents across the board. So you can see that there actually are instances where the seven day options will have less gross theta coming out of them. But it's because theta as a percentage of premium there is massively different. Does that make sense to everybody? If not, please tell me and then I'll literally show you. But if it does make sense to everybody that's cool, I'm happy to keep plugging along. The reason why this is an important point is this goes directly to the heart and soul of the question of when do we use the Greeks and how well we use the Greeks and literally all of them because there's no reason not to. And we use all of them to better understand what options and what combination of options makes the most sense for the idea that we have another great example of this is when",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "how well we use the Greeks and literally all of them because there's no reason not to. And we use all of them to better understand what options and what combination of options makes the most sense for the idea that we have another great example of this is when I'm trading earnings. If I'm trading earnings, I know that the expiration that contains earnings is most important to me. So the reason why I know that is because of the way options behave. It's by understanding that those near term options are going to have the largest impact to their volatility. Now this one confuses people a lot because people confuse Vega with term impacts, which is worth talking about for just a second. So if we take a look at 15 Jan 27 in Palantir, just because we're here. And we look at Vega for the at the money's the Vega is 62 cents. Okay, that's pretty high. Let's go to this is on for aug. So let's go to 15 aug this expiration cycle has earnings in it. Let's take a look at Vega Vega here is 23 cents. That's kind of interesting, right? Which one of these is going to experience a larger change in volatility? Following earnings. Is it this expiration that has a lower Vega? Or is it the longer term expiration that has a higher Vega? The longer term expiration has a higher Vega. So that would tell us that. It seems like",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "these is going to experience a larger change in volatility? Following earnings. Is it this expiration that has a lower Vega? Or is it the longer term expiration that has a higher Vega? The longer term expiration has a higher Vega. So that would tell us that. It seems like that would move more based on vol. But we know that's not the case. And it's because of the volatility surface. It's because black sholes, Merton model makes simplifying assumptions, one of which is flat vol. Well, we know that there's a volatility surface. So if I plot the volatility surface for you. We can see that funny enough if I plot 20 June against 18 July, what do you notice? The 20 June, the purple line is actually higher. If I do 18 July against 15 aug. Let me do the next primary to set. Well, we can see that on the put side, it's higher, but then on the call side, it inverts. So there's a relationship in the surface relative to time. I do 19, 17, 17, we can see 19, 17, it tends to be higher. This is the normal relationship where near term options actually often will have higher vol. So even though further out in time options can have more Vega. They very frequently will experience less of a total volatility impact because volatility doesn't hit the end of the expiration cycle is heavy as the front as the exp of the expiration cycle.",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "often will have higher vol. So even though further out in time options can have more Vega. They very frequently will experience less of a total volatility impact because volatility doesn't hit the end of the expiration cycle is heavy as the front as the exp of the expiration cycle. This is also why when you're trading stuff like volatility, you have to be really, really careful because somebody might say, OK, I'm going to go into VIX. And let's say when the VIX was down here in the 15 handle or even down here, even better, it's in the 13 handle. We know at some point VIX is going to go up. We know at some point it will go up. So then we say to ourselves, OK, great. I know it's going to go up at some point. I don't really know when. So I'm going to go far out in time. I'm going to go to the 21 Jan 26, 21 days because I think at some point over the next 21 days, 21 days, Vol will be higher. Well, what's the problem? The problem is if Vol is higher, let's say here, right? So let's say we got in in the beginning of December, couple days go by, couple weeks, I should say. And then mid December, we get this peak involved. That's great. We're sitting there saying like, oh, shit, our position should be crushing it right now. Well, what's the problem? VIX is 30",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "we got in in the beginning of December, couple days go by, couple weeks, I should say. And then mid December, we get this peak involved. That's great. We're sitting there saying like, oh, shit, our position should be crushing it right now. Well, what's the problem? VIX is 30 day Vol. Yes, 30 day Vol has absolutely gone up, but your options that are out, 221 days aren't tied to 30 day Vol. They're tied to Vol that's 221 days out. So even though 30 day Vol moved, your options might not actually move that much. And it's for the same exact reason. OK. We have a few minutes left. We have a couple questions in the chat. So if you had a question that I missed, please throw it back in so I can take a look at it before we wrap up. I hope the session's useful for you guys. The goal behind doing this is to do my absolute best to put you on to what ultimately matters to us as traders and what matters much less. And unequivocally, what matters much less is what the individual structure used or the individual strategy used. Those are minute details again that do matter a lot, but they only matter a lot once the first pieces are in place. So the first pieces being things like understanding profit mechanisms. If you understand profit mechanisms more deeply. And then options more deeply the rest of this realistically becomes pretty",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "minute details again that do matter a lot, but they only matter a lot once the first pieces are in place. So the first pieces being things like understanding profit mechanisms. If you understand profit mechanisms more deeply. And then options more deeply the rest of this realistically becomes pretty damn simple. But that's where most of the work is done. And it just says I had a strangle on and crude that got stopped out at two times max loss. Should I put on a new one or is undefined risk a bad idea? That's up to you. You're still defining the list. The risk at two times max loss. So I wouldn't say that it's inherently a bad idea, but what would be a bad idea is to put the trade on. Unless you have some sort of directional. Unless you have some sort of directional idea, right? So like if the ideas crude oil is going to oscillate sideways here. That's an idea. You can have that idea. But again, the context that makes that a good idea is based on what you are trying to accomplish. And what the profit mechanism is. Because for me, this actually starts to look really extended to the upside with downside pressure. So for me, I would be more prone to trade something like this directionally, but that's my approach. Right? Your idea might be this thing is in the 70 low 70 handle. And you think it's going to",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "actually starts to look really extended to the upside with downside pressure. So for me, I would be more prone to trade something like this directionally, but that's my approach. Right? Your idea might be this thing is in the 70 low 70 handle. And you think it's going to exist in the low 70 handle for whatever duration you choose to run your strangle for. So in that scenario, the strangle can make completely fine sense. It's all based on your idea, I would say. And then he says, in the example of T, you said none of those were optimal. Was there one that is there one that was or just that the best one captures the profit mechanism? Yeah, it's the it's the ladder of those. So what I can tell you is based on that kind of thing lower delta at bigger size is going to make more money. And it's going to have way more efficiency in the production of that money. So and again, this is because we're we're cherry picking. We looked at a scenario where we knew something moved at least 10. Now you can't go too far out of the money because if you go too far out of the money, then your options can actually expire out of the money. Well, that's not good. So there is a too far, but there's a point that becomes optimal because of the compounding effect. So in T. Let's just take a look",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "because if you go too far out of the money, then your options can actually expire out of the money. Well, that's not good. So there is a too far, but there's a point that becomes optimal because of the compounding effect. So in T. Let's just take a look at an actual scenario. So we'll go back to 27 Jan. And then we know it hits the 27 handle on seven March. We'll do this spot here instead. We'll do this spot. We'll do the third of March. So let's go to 27 Jan to the third of March. 27 Jan. And let's let that bad boy love. And then in the meantime, I need to. Copy this over. I mean, one set. Okay, so this looks like it's at least copying over the base. The base components which we're looking for. So we'll use this log just because it'll be a little, it'll be a little bit better. So this the day that we're using here. Is 27 Jan. And then we'll do this. Picker is T. Not ticker is T. And then I'm going to squish this thing down so that we can move it. Stock price 24. Now what I'm going to do is size these comparatively, but I'll do it after the fact. So we're going to do this. So we're going to do this. So we're going to do this. And then we know again, this is cherry picking. So we know. The third",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "24. Now what I'm going to do is size these comparatively, but I'll do it after the fact. So we're going to do this. So we're going to do this. So we're going to do this. And then we know again, this is cherry picking. So we know. The third of March is where it peaks. So we're going to trade around third of March. So here's the first thing. I can tell you that 14 all of these feb are suboptimal. The reason why all the febs are suboptimals because you're not maximizing the move. So that's the thing that's close to three March is where you're going to get the most for your move. So that puts us in seven March. Okay. So now we know that it's going to land around 27. So then let's literally look at a few different deltas. I'm going to show you 75 delta. A 50 delta. A 25 delta. And then I'll show you a further out as well. Let's do like a 15 delta or 10 delta, which it doesn't look like it has one. So we'll just do the 22 delta. That's as far as we can go. Oh, no, the delta's are all fucked up. I was wondering why this is so weird. So we'll do 25 delta. We'll do the 20 delta. And then we'll do this one. What is this at probabilities at 16? There's no way this is just because of the expiration and stuff.",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "no, the delta's are all fucked up. I was wondering why this is so weird. So we'll do 25 delta. We'll do the 20 delta. And then we'll do this one. What is this at probabilities at 16? There's no way this is just because of the expiration and stuff. Let's see if this one has better delta's for us to go off of. Yeah. Okay. So the 30 delta is like point zero and change. So we'll call the 30 delta here. Sorry, the 30 strike. We'll just call this like 0.02. So super, super low. So this will be 30. The 20 delta is way up here. Actually, so this will be 25.5. The 25.5 is a 13 delta. 0.13. Then the next closest we have is the 25 strike, which is a 29 delta. The closest we have to 50 delta is here, 24. This is a 57 delta. And then let's go to the 75 delta here, 23. And this is a point eight delta. So let's add our cost for all of these really fast. 23 again, I'm just going to hit them all at the offer. So 1.39. 1.39. The 24.65. The 25.25. The 25.5. 0.14. The 30. There's no way. So I would put that maybe like three cents. I'm just guessing. But there's no way that it's a dollar 40. So I don't want to mess up the example that much. OK. So we have all of our long calls. So the",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "25.5. 0.14. The 30. There's no way. So I would put that maybe like three cents. I'm just guessing. But there's no way that it's a dollar 40. So I don't want to mess up the example that much. OK. So we have all of our long calls. So the next thing we need to do, wait, where's my fucking. What the fuck just happened? This is not right. What did I do? I don't know what that is. OK, it just copied and weird. So now let's go to three March. And I'm just going to pause it. At wherever we're at, we'll take a look at the expiration. We'll see where everything sits. We'll see what we're going to do. We'll see what we're going to do. Reese says gamma, gamma factor into your strike selection. Not in this example. This is more just a. Showing you, but the gamma is obviously going to be wrapped into the delta, right? So like we know this. At the money has the most gamma. As you go further in or out less gamma. That whole thing. So this is at 2772. So this is the stock up 15. 15 and a half points. And today's now three March in the hypothetical. And let's take a look at what these are trading for now. So let's look at the 23. You get 480. The. 24. You're at 380. 25. 279. 255. 242. The 30. So now let's actually size these appropriately.",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "a half points. And today's now three March in the hypothetical. And let's take a look at what these are trading for now. So let's look at the 23. You get 480. The. 24. You're at 380. 25. 279. 255. 242. The 30. So now let's actually size these appropriately. So I'm just going to size them all off of this largest one. So 1.39. So all I'm going to do. Is take. This divided by. Or. Divided by this. And then we just have to round down. So this one you get a two lot. Five lot nine lot. 46 lot. So if we take a look. At the PNL. For all of these, you'll notice a super clear trend. The super super clear trend. The trend that you see. Is that the lower delta you get. If you're sizing everything the same is optimal. So in this case, what ultimately ends up becoming optimal is the 27 strike. Whatever that was. And in bother picking it doesn't matter. You can. You can see it from here. Like this still is very much the case. Now I realized I did all of this wrong. So we'll have to double check. Really fast with these end up being. Oh no, I think it. Yeah, okay. So it's still doing it correctly. I have it doing like the absolute value. Yeah. So this one would have lost money though. Anyways, the broader point is that breakdown. In the delta. The broader",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "check. Really fast with these end up being. Oh no, I think it. Yeah, okay. So it's still doing it correctly. I have it doing like the absolute value. Yeah. So this one would have lost money though. Anyways, the broader point is that breakdown. In the delta. The broader point is that breakdown. In the delta selection. For this very cherry picked idea. And again, the way that you get to this is by having a deep understanding of options. If you understand options deeply, like this is as clear as day. What works best here. Not like a. A hypothetical at all. And. The beautiful part about that is that level of understanding of options is literally accessible to everybody. But too many traders get too wrapped in to trying to figure out. What strategy what structure is the best and as I mentioned before, like genuinely. That's attempting to answer the wrong question. If you focus on answering the right question, you will make so much more money, which is getting much, much better. And then you will have more. Detail in depth with respect to profit mechanisms. Way better question. Way, way, way, way better question way more worth your time. Cool. Any other questions that you guys have anything else that you want to hit before. We wrap this bad Larry up. And then if not, I need your help with two things. The first thing I need your help with is letting me know",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "way more worth your time. Cool. Any other questions that you guys have anything else that you want to hit before. We wrap this bad Larry up. And then if not, I need your help with two things. The first thing I need your help with is letting me know if you have a preference. For the next upcoming skill development segment on Wednesday. And then also for the beginner stream next Friday. I need your help with both of those. The other thing that I need your guys is help with is I have my feedback forms going around right now. I'm building the one for the general outlier trading community. I did the pro one first. But I'm going to have the other feedback form coming out. And that'll be available on the discord. And that helps me figure out where to spend time. What's most useful to you guys. So if you have a few minutes, please fill that out. It's really for your own benefit. Because it'll make it easier for me to prioritize for you. So. Awesome hanging out tomorrow. We will have our meme stock watch Sunday. We have our trading prep. And then for those that are in the outlier pro plus program. We have our first workshop slated for 29 June at 1500 Pacific time. So that will be a live zoom call with me. And whoever else is able to make it. And then we'll work through like a bunch of",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  },
  {
    "text": "for those that are in the outlier pro plus program. We have our first workshop slated for 29 June at 1500 Pacific time. So that will be a live zoom call with me. And whoever else is able to make it. And then we'll work through like a bunch of case studies. I have in mind. Some goal setting and stuff like that. So looking forward to an awesome session with you guys for that. In the meantime, if you guys need anything, as always, let your boy know, be in outlier. See you guys later.",
    "metadata": {
      "video_id": "8MTeMe1qln8",
      "title": "Inside my Option Trading Strategies | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=8MTeMe1qln8",
      "upload_date": "",
      "duration": 6449.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8MTeMe1qln8&t=0"
    }
  }
]