[
  {
    "text": "And no point have I expected in my life, I would be attempting to decipher a series of emojis that then try to infer potential trades by an online kind of Robin Hood joker juxtaposition our boy, Roy and Kitty, obviously, to see what moves might be happening. It's absurd and I love it. It's hilarious. Now, I want to be clear, as I've said a bunch of times, I don't have the lore or the background that you guys do. I'm not going to pretend to. I'm actually going to spend very little time on this. I want to spend way more time looking at theory and I'm going to focus more on what I do, which is looking at the options markets and looking at the underlying itself. But this stuff is kind of funny. So there was a member from the discord MP that was asking if I win over Siri and I have not. But I'm happy to and funny enough, I actually have a trade on in Siri that I took most of it down and left a little bit of it back on. But again, as per usual for me with this stuff, I had no idea that this was even going on. I simply saw it pop up on a couple of my scanners. So I established a position, very small speculative trade, take advantage of what looked to be a bit of a breakout. So let me show you what that looks",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=0"
    }
  },
  {
    "text": "had no idea that this was even going on. I simply saw it pop up on a couple of my scanners. So I established a position, very small speculative trade, take advantage of what looked to be a bit of a breakout. So let me show you what that looks like to start, which is on the chart. Basically, if I zoom this in from a one year to like a three months, I saw two things that really interested me. The first thing was here on the 21st of June, there was a massive skyrocket in volume for the underlying itself. So what that means is if I look at the day before, the volume was 38.8 million. I look at the volume on the 21st, it's 330 million, massive expansion. This triggered an initial alert for me. I get a lot of these to be clear. It's not like each one of them is a unicorn and they all work out great. A lot of them don't. But I'm very willing to monitor products that make these kinds of movements because there is activity. And from an options trading perspective, volatility is my friend. Whenever I'm buying options or selling options, I need things to move in order to make money. So when I see stuff like this, I'm interested. So this popped off and what I did was immediately set an alert at this price level right here, the 298 handle. Now this originally was screened out",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 15,
      "start_timestamp": "00:01:37",
      "start_timestamp_seconds": 97.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=97"
    }
  },
  {
    "text": "or selling options, I need things to move in order to make money. So when I see stuff like this, I'm interested. So this popped off and what I did was immediately set an alert at this price level right here, the 298 handle. Now this originally was screened out because it was sub 5. I very rarely will trade things that are sub 5. When I saw this happen, I dropped this price alert. So I didn't buy or do anything here. And it was originally an alert that looks just like this. So I literally will set an alert that if there's a break above this previous level, it was a little bit lower. It was like right here at like 2.95 right at the open, the previous open on this handle. And if there was a break above that, I just wanted to know about it. So what I get an alert on then is on the second July. And on the second of July, we see a break above that was pretty consistent. And we still have much lower volume than we saw here, but much higher volume than average all the way over here. So what I do is I use this average volume to give me some context. It was skewed a little bit by this day obviously, but because it was only one day, came right back down. And the thing that really stuck out to me here, though, was the fact that",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 15,
      "start_timestamp": "00:03:15",
      "start_timestamp_seconds": 195.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=195"
    }
  },
  {
    "text": "what I do is I use this average volume to give me some context. It was skewed a little bit by this day obviously, but because it was only one day, came right back down. And the thing that really stuck out to me here, though, was the fact that this was overwhelmingly by volume, both of these days. So as soon as I see a bunch of generally higher volume coming into the product, that's majority by volume. I see a break above. This becomes a small trade for me in asymmetric play. I want to take it to the upside. And I'm going to set a really tight stop. And in this case, the stop was 2.95. It was using this prior point of perceived resistance now turned support. Again, I feel like what's stuff like this you have to be so careful applying standard technical analysis. But this is a much smaller subset of what I do as a trader looking for, anomalous things like this and mostly trading things like momentum, which this falls directly into that bucket. We start seeing some really strong momentum with a breakout. This is early stages, though. So then we get a follow on move on the third. I end up exiting a good portion of the position there. And I have some runners that I left on. Now those runners will essentially get stopped out at three and a half or less. And that's it. They're just going to",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 15,
      "start_timestamp": "00:04:53",
      "start_timestamp_seconds": 293.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=293"
    }
  },
  {
    "text": "get a follow on move on the third. I end up exiting a good portion of the position there. And I have some runners that I left on. Now those runners will essentially get stopped out at three and a half or less. And that's it. They're just going to go go do their thing. Now what's going on here? I have no idea. There's a ton of speculation that Roryn Kitty's emojis translate. This everybody was sure was the fourth of July from what I saw from people sending me things in asking what they thought. Fourth of July could have meant because this coast corresponded with that well. And there was a new theory that came out that this stood for America. And then this microphone stood for broadcasting, which is if you look up theory, apparently on the Wikipedia page, it shows just like American broadcasting. So okay, maybe that's the case. This is honestly one of the problems with attempting to interpret emojis to make trading decisions. It's not what I do. But I find it entertaining to look at. So I know a lot of people are curious is Roryn Kitty now potentially building a position here in Siri? And a lot of people are going all over the place with this because Roryn Kitty's been radio silent since essential in terms of positions. And since the 13th of June. So everybody's kind of speculating, especially after the chewy movement and some of the movement",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 15,
      "start_timestamp": "00:06:30",
      "start_timestamp_seconds": 390.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=390"
    }
  },
  {
    "text": "position here in Siri? And a lot of people are going all over the place with this because Roryn Kitty's been radio silent since essential in terms of positions. And since the 13th of June. So everybody's kind of speculating, especially after the chewy movement and some of the movement that we're seeing here, everybody's wondering what's going on and trying to figure it out, rightfully so because it's very, very interesting. So if we take a look now at the options, change themselves. There's a couple things worth calling out here. The very first thing is, this is a very small product. There's not a ton of explorations. There's not a ton of option. If we take a look at the total open interest across these very few explorations, it's over 800,000 balls to 570,000 puts. So to clarify what I said in case it was misleading, when I say that there's not a lot of options, there's a ton of open interest relative to the number of options available. Like if I open up this chain, there's a handful. You go from 0.5 to 6, right? So like in comparison, just for context, if you look at something like spy, and we open up the options chain, there's tons. And there's even, right, there's tons of option. So that's what I mean here when I say that there's not a lot of options in Siri, is that there's just not a ton of explorations and within those explorations,",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 15,
      "start_timestamp": "00:08:08",
      "start_timestamp_seconds": 488.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=488"
    }
  },
  {
    "text": "like spy, and we open up the options chain, there's tons. And there's even, right, there's tons of option. So that's what I mean here when I say that there's not a lot of options in Siri, is that there's just not a ton of explorations and within those explorations, there's not a lot of chains to pick from. Now what I find interesting here is there are a couple very, very active chains, specifically individual strikes that think are worth talking about to a degree. Although when I look at this in a broad brushstroke, I don't see a lot of anomalous activity that would lead me to believe super informed, sized, convicted by, meaning people like RT, coming in, and placing, because especially something like this, if you compare to something like GameStop, where he was coming in with 5,000 lot, 10,000 lot pieces to establish his position. This is a fraction of, but you would, you would have to be pushing some weight in order to get a meaningful position on in here. Now that's from the options perspective. That's not to say that there are not shares transacting because this is above average transactions. There's no doubt. Like even this, again, if we go back to kind of this this pre-jacked up period here, we go back and here, it's like 15 million, 19 million, and then essentially from this point forward, it doesn't get below 30 million. So there's absolutely elevated stock transaction. But from",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 15,
      "start_timestamp": "00:09:46",
      "start_timestamp_seconds": 586.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=586"
    }
  },
  {
    "text": "doubt. Like even this, again, if we go back to kind of this this pre-jacked up period here, we go back and here, it's like 15 million, 19 million, and then essentially from this point forward, it doesn't get below 30 million. So there's absolutely elevated stock transaction. But from an options perspective, I'm not necessarily seeing that because even though that there's a lot of options relative to how few, or I'm sorry, a lot of open interest relative to how few chains and strikes there are to select from, there's not a lot of correspondingly large sizes. Because again, this looks like a big number, 820,000 calls, and it is a lot of OI. But you're talking about something that's trading for 3. So if you want to put on anything of size, you need to put on a ton of the, so let's take a look at some of the chains and then some of the individual. What I do find interesting from the jump, I should say, take a look, this is five days to expiration, take a look at how high the implied volatility is. 195. Why do I find that so interesting, simple. If we come over here and we take a look at something zoomed out a little bit more, this earnings coming up on the first of next month, I would expect the, the expiration cycle that includes this to be the highest IV in the near future. I would expect this",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 15,
      "start_timestamp": "00:11:23",
      "start_timestamp_seconds": 683.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=683"
    }
  },
  {
    "text": "we come over here and we take a look at something zoomed out a little bit more, this earnings coming up on the first of next month, I would expect the, the expiration cycle that includes this to be the highest IV in the near future. I would expect this expiration cycle to be the highest. So if I go there, we know it's the first of August, so the very first expiration cycle that would include it would be the second of August, which is a weekly. So maybe it, you know, sort of slid out to the monthly for more liquidity, sometimes you'll see that happen more even though this contains earnings, the ones around it also can be elevated or even slightly higher if that's where people are going to play earnings. I don't see any of that. I see 195 here, 166 here, and then it dumps the 145, 144, 133, 135. So if we check out the chain that actually has earnings in it directly, it's this one. It's only 144, 66 compared to the next upcoming two in order, 12 July, 19 July at 155, in 166. That's big. Now there's obviously a lot of IV in this front cycle because of this. This is a giant move. This is not a small move, even though it is a very small product. It's gone from 245 from the 13th of last month to 416 was the high hit here. The big move. That is",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 15,
      "start_timestamp": "00:13:01",
      "start_timestamp_seconds": 781.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=781"
    }
  },
  {
    "text": "of IV in this front cycle because of this. This is a giant move. This is not a small move, even though it is a very small product. It's gone from 245 from the 13th of last month to 416 was the high hit here. The big move. That is a big move relative to the size of this product. So the implied volatility for the expiration cycles is interesting to me, and this is abnormal, for sure. I would expect the earnings to be much, much higher. Now pivoting over and taking a look at the volatility smile for specifically the out of the monies, and let's use kind of these near two terms and then where we see earnings. A couple of things. One, these are all jacked up. Normally you don't see them crisscrossing all over the place like this. And what I can tell you is from the one that includes the earnings cycle, notice how high the put side is relative to the call side. This is an expectation of downside. If I go in here to the 12th and the 19th July, so for those wondering it's the blue and kind of the pink is too, they still lean very put heavy. So the market as far as I can tell broadly is pricing in downside. Then when I look at the transactions that occurred on Friday, I see a few things. I see the vast majority of puts transacted at the offer or",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 15,
      "start_timestamp": "00:14:39",
      "start_timestamp_seconds": 879.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=879"
    }
  },
  {
    "text": "is too, they still lean very put heavy. So the market as far as I can tell broadly is pricing in downside. Then when I look at the transactions that occurred on Friday, I see a few things. I see the vast majority of puts transacted at the offer or higher, meaning we're buying puts lots of them. And when I look at the call side, the majority 39 to 36 so a slight majority are on the bid side selling calls. So that still tells me we're looking a little bit more to the downside here. So what does this mean? Well, this pop. Very interesting timing. And I also think some of this might have corresponded with a couple posts that were on Reddit. From the options perspective, it doesn't look super interesting. There are a couple heavy cycles. And I also wanted to show you this now that I became in a field with unusual whales because this is a little easier to use for kind of quick research like this. I still prefer pulling things down, dropping it in Excel or Google Sheets so that I can analyze it a little more in depth. But this is super useful to be able to check out something like. So what I did is I just looked back essentially over all of last month and the beginning of this month. And I'm looking at things that transacted at the offer or higher, meaning that we're buying on the",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 15,
      "start_timestamp": "00:16:16",
      "start_timestamp_seconds": 976.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=976"
    }
  },
  {
    "text": "is super useful to be able to check out something like. So what I did is I just looked back essentially over all of last month and the beginning of this month. And I'm looking at things that transacted at the offer or higher, meaning that we're buying on the call side specifically. I'm looking at calls. And I want premium that's at least 25,000. If it's under 25,000, it is even this is low for me from identifying like big players that are trying to speculate here. So this is a low threshold. And the reason why I use a low threshold is so that maybe I can see if there's a bigger player that's entering with a series of these smaller traits. The way you can detect that is you can see when they're coming in, how close they are to one another and you can pick up on buying pattern. You'll see centralization within the same strike. You'll see consistent sizing to a specific degree, things like that. So when I look at the buying activity centrally over the last entire month, the biggest trade that populates in here is this one right here at 195. So if we sort these instead by premium, there's not a lot of big traits. There's a 195. This is not small, by the way, this is absolutely a large trade. No doubt. And this looks curious to me because it's way far out. So this is a long-term play. That's",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 15,
      "start_timestamp": "00:17:54",
      "start_timestamp_seconds": 1074.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=1074"
    }
  },
  {
    "text": "if we sort these instead by premium, there's not a lot of big traits. There's a 195. This is not small, by the way, this is absolutely a large trade. No doubt. And this looks curious to me because it's way far out. So this is a long-term play. That's what this tells me. You don't go out that far at that size because it's not very liquid. Notice how wide that market is. That's crazy. 0.66 to 0.80 on something we're evolving on a three and a half strike. That's wildly so they want leverage exposure to the upside. That's what this is. No doubt. But it's all the way out in 2025. So they're giving it plenty of time to. In terms of the next largest, there's essentially 75,000 position much tighter, still very liquid for the size of this product. But this is a little near term, but still pretty far out. So the vast majority of these larger trades are kind of spread across these different expiration cycles with some decent weight out here in 2025. But that doesn't bode well for what a lot of people are very interested in is what does this mean for me today, this week coming up now. And as I look across all of this, again, not saying nothing's going to happen, I have no idea. But what I do know is the options chain right now isn't showing me anything that looks supremely interesting. Anything indicative of strongly",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 15,
      "start_timestamp": "00:19:32",
      "start_timestamp_seconds": 1172.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=1172"
    }
  },
  {
    "text": "for me today, this week coming up now. And as I look across all of this, again, not saying nothing's going to happen, I have no idea. But what I do know is the options chain right now isn't showing me anything that looks supremely interesting. Anything indicative of strongly convicted upside bias trading, the majority of volume that we saw on Friday, today's the seventh of July, the majority of volume from Friday was actually trading it to the downside, looking to either buy puts or sell calls into it. So very interesting. Do I think that this is roaring kitty? I have no idea from an options perspective. I would lean no, but from an equity perspective potentially. But I have no idea. He seems really convicted around trading, GameStop, and I had a long conversation with Richard about that not too long ago to understand his behaviors in terms of moving into other products. And it's not outside the realm of possibility. But right now we have no way to know we haven't seen any portfolio updates. We haven't seen any more filings outside of Chewie. So he's obviously looking at other things. But we don't know exactly what that buying pattern entails other than the fact that I do think it's somewhat telling that when we look at this little chain and we had the dog emoji, then we see the filing for Chewie. And then we do see this. I don't think it's that far",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 15,
      "start_timestamp": "00:21:09",
      "start_timestamp_seconds": 1269.8400000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=1269"
    }
  },
  {
    "text": "exactly what that buying pattern entails other than the fact that I do think it's somewhat telling that when we look at this little chain and we had the dog emoji, then we see the filing for Chewie. And then we do see this. I don't think it's that far fetched. Assume there could be activity going on by him in there. I just have no idea. So I'm is eager to find out as you guys are. But my small contribution to the puzzle set would be from an options perspective. I don't see anything interesting to indicate to me that there's Lauren Kittier, really any other large player in their transacting. It would be more on the equity side that I could tell. And even that is relatively late for something that's so cheap, but who knows? So as always, if you have any questions or anything that ad drop it in the comments, be an outlier. I'll see you later.",
    "metadata": {
      "video_id": "8U4dz8MZL70",
      "title": "Is Roaring Kitty Buying SIRI Options?",
      "url": "https://www.youtube.com/watch?v=8U4dz8MZL70",
      "upload_date": "",
      "duration": 1058.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 15,
      "start_timestamp": "00:22:47",
      "start_timestamp_seconds": 1367.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=8U4dz8MZL70&t=1367"
    }
  }
]