[
  {
    "text": "What's up everybody Eric here? I got a video on why I trade IWM and how I've made over a million bucks in it. So I get asked fairly frequently by folks who follow the channel. They know I talk about IWM a lot and they're curious about why. So this video is going to do a couple things. I'm going to walk through why I trade IWM after discussing what it is. But more importantly, I want to compare it to something like the spy and also the rut, which are the most common comparisons that people bring up. Why do I trade IWM over those? So first let's start with a quick overview of what IWM is. So it's the Russell 2000 index. So it tracks 2000 plus small cap stocks across all different sectors, which we'll get into in just a minute. But the beauty of it being an index ETF is it gives you a lot of flexibility and inherent diversification without having to pay like a mutual fund that sort of thing. So let's take a quick look at a comparison. So as you can see, I have a few metrics that I want to look at when we're comparing IWM to the spy and to the rut. So we're going to talk about if it's liquid, if there's a dividend, if there's diversification and quantify that how efficient the products are and then the underlying. So first, let's start with spy, which is the",
    "metadata": {
      "video_id": "9AKqzGkSWmg",
      "title": "Why I Trade IWM vs SPY",
      "url": "https://www.youtube.com/watch?v=9AKqzGkSWmg",
      "upload_date": "",
      "duration": 829.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9AKqzGkSWmg&t=0"
    }
  },
  {
    "text": "look at when we're comparing IWM to the spy and to the rut. So we're going to talk about if it's liquid, if there's a dividend, if there's diversification and quantify that how efficient the products are and then the underlying. So first, let's start with spy, which is the S and P 500 index ETF. Is it liquid? Absolutely. And we can assess that pretty simply. So if we pull up something like spy. Let's take a look at a few key metrics. The first one is the volume over 100 million shares traded in a day. So plenty of movement. You could see that the bid asks spreads are very tight. And this is tight because it's after hours. So during the market when it's open, it's normally a penny or two. So we see a ton of option explorations. This is also a pretty good indicator of liquidity because if there's no demand for the options, they won't offer weekly. They won't offer things like quarter release. The market needs enough people interested in those options in order to make it worthwhile to provide them. So the fact that this has so many explorations inherently can start to give you some ideas. So most importantly, if you pop them open, you can see it's a 400 product. And again, after hours on a 39 Delta put its four cents wide, very, very liquid. So absolutely meets that threshold. The next one is dividend. Does it pay a",
    "metadata": {
      "video_id": "9AKqzGkSWmg",
      "title": "Why I Trade IWM vs SPY",
      "url": "https://www.youtube.com/watch?v=9AKqzGkSWmg",
      "upload_date": "",
      "duration": 829.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 11,
      "start_timestamp": "00:01:03",
      "start_timestamp_seconds": 63.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9AKqzGkSWmg&t=63"
    }
  },
  {
    "text": "to give you some ideas. So most importantly, if you pop them open, you can see it's a 400 product. And again, after hours on a 39 Delta put its four cents wide, very, very liquid. So absolutely meets that threshold. The next one is dividend. Does it pay a dividend? Yes. So as a right now, it pays 1.64 dollars a share. And why I'm doing the gross dollar amount as compared to the percent as a percent because we're comparing it to I WM. So I think it's important to also see the gross dollar amount because really the primary strategy that I'm using when I'm trading I WM is the covered strangle. So if you need a recap of what the covered strangle is or why I trade that, you can find a video to that up here, but that part of that is holding an underlying potentially. So I like things that pay a dividend. The next one is diversification. This one gets a single check for that. And I'll explain why it gains exposure to over 500 large cap stocks. It's a great product for that exact reason, especially for buy and hold. If I was setting up a buy and hold portfolio, it would be mostly spy. Now there are some drawbacks that go with that, which I'll get into in just a minute. Efficiency. This is a really important one, especially if we're actively trading. So what I did again using the covered",
    "metadata": {
      "video_id": "9AKqzGkSWmg",
      "title": "Why I Trade IWM vs SPY",
      "url": "https://www.youtube.com/watch?v=9AKqzGkSWmg",
      "upload_date": "",
      "duration": 829.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 11,
      "start_timestamp": "00:02:15",
      "start_timestamp_seconds": 135.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9AKqzGkSWmg&t=135"
    }
  },
  {
    "text": "was setting up a buy and hold portfolio, it would be mostly spy. Now there are some drawbacks that go with that, which I'll get into in just a minute. Efficiency. This is a really important one, especially if we're actively trading. So what I did again using the covered strangle as my benchmark, because that's the strategy I'm deploying in these. I took a look at a 42 days to expiration short put at a 30 delta. And I looked at the percent return to cash secure the position. So essentially that came out to 2.04 in spy, which actually really good right now, it's because the market's volatile plenty of times this is way under a percent. So this is kind of a fun time to do this comparison. So again, all I did was go out 42 days, I took a look at the 30 delta put and I said, OK, that's given me, you know, 8 in 45 cents, 46 cents or whatever. And it's essentially putting up 413 dollars per share. So it gives me an idea of the percent return for the overall trade. So in this instance, again, you're going to collect 840 something thousand dollars and you have to tie up 41,300 to cash secure the position. And then the last part of the question is underlying what is the underlying product. So again, in this case, it is an index ETF. So it means that it does indeed have shares that",
    "metadata": {
      "video_id": "9AKqzGkSWmg",
      "title": "Why I Trade IWM vs SPY",
      "url": "https://www.youtube.com/watch?v=9AKqzGkSWmg",
      "upload_date": "",
      "duration": 829.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 11,
      "start_timestamp": "00:03:38",
      "start_timestamp_seconds": 218.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9AKqzGkSWmg&t=218"
    }
  },
  {
    "text": "something thousand dollars and you have to tie up 41,300 to cash secure the position. And then the last part of the question is underlying what is the underlying product. So again, in this case, it is an index ETF. So it means that it does indeed have shares that trade, which again is really the main comparison we're about to get into, which is with the rut. So the rut is very liquid because it's a big brother index has compared to the spy. So that's the only reason why it has an additional check mark there has no dividend because there is no underlying product. It's a cash secured index. This is the primary reason why I don't trade the rut for my coverage, strangled strategy because part of the coverage, struggle strategy is taking in stock or taking in a security of some sort and being assigned. You can't be a sign on this. It's cash settled. So diversification, I think that the Russell is more diversified than the spy, which I will explain in just a minute once we get over to IWM efficiency. This one gets three check marks and it's simply because it's the big brother version of IWM and then underlying, like I said, no underlying. Now a notable mention here, though, is it does enjoy section 1256 tax benefits. So it essentially mixes your short term capital gains tax and you actually get a portion of your profits tax at the long",
    "metadata": {
      "video_id": "9AKqzGkSWmg",
      "title": "Why I Trade IWM vs SPY",
      "url": "https://www.youtube.com/watch?v=9AKqzGkSWmg",
      "upload_date": "",
      "duration": 829.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 11,
      "start_timestamp": "00:04:43",
      "start_timestamp_seconds": 283.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9AKqzGkSWmg&t=283"
    }
  },
  {
    "text": "big brother version of IWM and then underlying, like I said, no underlying. Now a notable mention here, though, is it does enjoy section 1256 tax benefits. So it essentially mixes your short term capital gains tax and you actually get a portion of your profits tax at the long term capital gains rate. So when I'm not trading the coverage, strangled. This is typically my go to if I'm trading, making short puts, make sure calls, make sure it ratio, strangles for that exact reason for it's definitely more efficient. You don't have to put on as many contracts and it does have a great tax benefit. Alright, so let's take a look at IWM. So as we can see, it also has a bunch of weekly explorations, not the same number is the spy, though. So I would argue that the spy is slightly more liquid than IWM. You can also see it not slightly actually fairly so because you can also see it in the volume traded. Now the reason why I didn't bother giving spy an additional check mark, although you could argue that it deserves one is from like pragmatic deployment perspective, it really doesn't make a difference. They're both extremely liquid products. So I don't think that there is truly a discernible outcome. If you trade one versus the other via liquidity alone. Now dividend, it also has a dividend that it pays except the Russell dividend is 0.67 cents. So again, it matters",
    "metadata": {
      "video_id": "9AKqzGkSWmg",
      "title": "Why I Trade IWM vs SPY",
      "url": "https://www.youtube.com/watch?v=9AKqzGkSWmg",
      "upload_date": "",
      "duration": 829.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 11,
      "start_timestamp": "00:05:49",
      "start_timestamp_seconds": 349.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9AKqzGkSWmg&t=349"
    }
  },
  {
    "text": "make a difference. They're both extremely liquid products. So I don't think that there is truly a discernible outcome. If you trade one versus the other via liquidity alone. Now dividend, it also has a dividend that it pays except the Russell dividend is 0.67 cents. So again, it matters just in the context of once you're assigned, how much are you potentially going to get when the dividend does come around. Now let's talk about why I trade IWM over the spy. Here's where it really comes in. The first one is diversification and this is a really important concept to understand. So I just pulled up kind of some details for both this side over here is IWM this side over here is spy. There's a few really important notes. The very first one is the top 10 holdings of the spy, which you see here, make up about 25 of the index and you can also see that reflected here. This is the SP 500 index notice how it's broken up. We see a large portion and information technology and communication services. The rest of these boxes have I would argue kind of slightly better profiles, but the size of the box indicates how much of the index it composes. So in this instance, the top 10 holdings are massive. If you look at Microsoft Apple, Google, Google, Facebook, Nvidia, Amazon Tesla, they make up a huge portion of the index. The other thing is exactly what",
    "metadata": {
      "video_id": "9AKqzGkSWmg",
      "title": "Why I Trade IWM vs SPY",
      "url": "https://www.youtube.com/watch?v=9AKqzGkSWmg",
      "upload_date": "",
      "duration": 829.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 11,
      "start_timestamp": "00:07:08",
      "start_timestamp_seconds": 428.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9AKqzGkSWmg&t=428"
    }
  },
  {
    "text": "the size of the box indicates how much of the index it composes. So in this instance, the top 10 holdings are massive. If you look at Microsoft Apple, Google, Google, Facebook, Nvidia, Amazon Tesla, they make up a huge portion of the index. The other thing is exactly what I was just highlighting is the actual centralization of most highlight that there, the centralization of the index, a quarter over a quarter, 26 of the spy is information technology. Now that's benefited the spy pretty heavily, especially over the past decade where technology has been doing great, but it's also a reason why spy was in the hurt locker for a while, especially earlier this year when technology was actually lagging quite a bit. As soon as we start to see some secular capitulation away from information technology being just a pure leader, the spy will start to slow its performance. Now let's contrast that to IWM. The top 10 holdings in IWM, as you can see here, make up about 4 of IWM huge difference. So again, just for a line by line comparison, Apple is 7 of the spy that and that's the top holding in the spy. The top holding in IWM is an energy company, but it's 0.38. So what you'll notice is the variance between these is very low, the highest is 0.38 and the lowest is 0.28 for the top 10 holdings, whereas for the spy it's 7.12 and 1.19 huge variance. By",
    "metadata": {
      "video_id": "9AKqzGkSWmg",
      "title": "Why I Trade IWM vs SPY",
      "url": "https://www.youtube.com/watch?v=9AKqzGkSWmg",
      "upload_date": "",
      "duration": 829.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 11,
      "start_timestamp": "00:08:39",
      "start_timestamp_seconds": 519.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9AKqzGkSWmg&t=519"
    }
  },
  {
    "text": "spy. The top holding in IWM is an energy company, but it's 0.38. So what you'll notice is the variance between these is very low, the highest is 0.38 and the lowest is 0.28 for the top 10 holdings, whereas for the spy it's 7.12 and 1.19 huge variance. By trading something like IWM, you start to limit your unsystematic risk significantly. Now the other thing is if you take a look at its centralization of sectors, you see 39 or cyclical, 24 defensive, 37 is sensitive. Now across those, we still have pretty heavy weights in technology, industrials, health care, financial services, consumers like cyclical. I don't know why I keep doing that word up, but you kind of see the point here, whereas in the spy, you don't have anywhere near the same level of diversification in products. So if we do a heat map comparison of the Russell, notice the difference. Huge, huge change from the SP 500, which has 500 plus quite a few big boxes. So the Russell, which is over 2000 and there's two things to note here. The first one is there's not really many huge boxes. You could argue that the semiconductor, on semiconductors, you know, a bit of a standout. Maybe you could argue lows as well, but other than that, and that's not the lows that you're thinking of, by the way, just to be clear. But other than that, that's really it. The other thing to note is notice",
    "metadata": {
      "video_id": "9AKqzGkSWmg",
      "title": "Why I Trade IWM vs SPY",
      "url": "https://www.youtube.com/watch?v=9AKqzGkSWmg",
      "upload_date": "",
      "duration": 829.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 11,
      "start_timestamp": "00:09:54",
      "start_timestamp_seconds": 594.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9AKqzGkSWmg&t=594"
    }
  },
  {
    "text": "on semiconductors, you know, a bit of a standout. Maybe you could argue lows as well, but other than that, and that's not the lows that you're thinking of, by the way, just to be clear. But other than that, that's really it. The other thing to note is notice the size of the sectors, health care is about the same size as industrials, which is about the same size as information technology, which is about the same size as consumer discretionary. You kind of get the point here, there is just far better inherent diversification in the product, in my opinion. Now, let's also talk about efficiency quickly. We just talked about the return that you would get in the spy. Now looking at IWM for the same exact style trade 42 days to expiration 30 delta put you get two and a half percent on your money. Again, this is another leading reason, especially in lower volatility environments, where this discrepancy starts to be pretty damn meaningful in a position size. You're getting half a percent more essentially return on your money in IWM over the spy. And then they both have underlying stock again, which is why I trade IWM for the coverage strangle and trade IWM very frequently in my core holdings over the rut. It's literally because of that because if the rut had shares to trade that paid a dividend, that's where I would be, especially with that tax benefit, but it doesn't so",
    "metadata": {
      "video_id": "9AKqzGkSWmg",
      "title": "Why I Trade IWM vs SPY",
      "url": "https://www.youtube.com/watch?v=9AKqzGkSWmg",
      "upload_date": "",
      "duration": 829.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 11,
      "start_timestamp": "00:11:39",
      "start_timestamp_seconds": 699.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9AKqzGkSWmg&t=699"
    }
  },
  {
    "text": "I trade IWM for the coverage strangle and trade IWM very frequently in my core holdings over the rut. It's literally because of that because if the rut had shares to trade that paid a dividend, that's where I would be, especially with that tax benefit, but it doesn't so I don't. This is why I trade IWM so much and this is why it's one of the largest contributors to my core returns in my portfolio because it really makes a huge difference. The small little details when it's deployed over a long period of time. So as always, any questions or anything, let me know. Hit me up. You can find my contact info in the video description below. And until next time, be an outlier.",
    "metadata": {
      "video_id": "9AKqzGkSWmg",
      "title": "Why I Trade IWM vs SPY",
      "url": "https://www.youtube.com/watch?v=9AKqzGkSWmg",
      "upload_date": "",
      "duration": 829.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 11,
      "start_timestamp": "00:12:51",
      "start_timestamp_seconds": 771.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9AKqzGkSWmg&t=771"
    }
  }
]