[
  {
    "text": "You ask I answer with another question from the homie Zach. The last one on this list is tips when buying leaps. It's a great question. Now leaps are really, really solid for serving as a levered stock replacement. However, there are a couple things that you have to pay attention to. If we think of different expiration cycles, so we have kind of the front expiration cycle here and then we have the back way out here. As you go further out, liquidity is going to drop. Most people will play the front portion of the expiration cycles. The other thing when liquidity drops is the bid-ass spread, widens. So when trying to find good leaps to trade, liquidity becomes even more important, not just from the context of your entry, but also your exit. The other thing is when you're playing leaps, you have to remember the effect of gamma. If we go back to this expiration thing, gamma is going to be high in the front. And gamma is low as you go further out here. So gamma down here is low. But the other thing we know is Vega is high and Vega here is low. We also know that there's more x-trends that value across the options chain because there's more time. So you need to balance all of these different factors to figure out what you want because if you're looking for something and your sandball, I don't know how much it's going to",
    "metadata": {
      "video_id": "9APL8MtZu7Y",
      "title": "tips for buying leaps",
      "url": "https://www.youtube.com/watch?v=9APL8MtZu7Y",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 2,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9APL8MtZu7Y&t=0"
    }
  },
  {
    "text": "We also know that there's more x-trends that value across the options chain because there's more time. So you need to balance all of these different factors to figure out what you want because if you're looking for something and your sandball, I don't know how much it's going to move, maybe it'll be more of a modest move, then maybe you need more deltas, but it's going to be a little bit more expensive. So the most important thing when you're looking to trade leaps is you have to understand how options behave in this way so that you can build what makes sense based on your idea. The liquidity is going to be the biggest thing hands down, then it's selecting Greeks that make the most sense. Great question. You know, I'll see you all there.",
    "metadata": {
      "video_id": "9APL8MtZu7Y",
      "title": "tips for buying leaps",
      "url": "https://www.youtube.com/watch?v=9APL8MtZu7Y",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 2,
      "start_timestamp": "00:01:14",
      "start_timestamp_seconds": 74.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9APL8MtZu7Y&t=74"
    }
  }
]