[
  {
    "text": "What is up you Scallywags? I got to keep it a buck. I had zero intentions of doing a GME update video today. There wasn't too much that was sticking out to me. I was just going through and collating data because I now am invested in this mentally. I have an obsessive personality so I was just checking things, tracking things, and then something stuck out to me. That looked pretty interesting. We'll take a look at that together in just a second. Now, quick recap, those since we're here. Looking at 23 June, which was yesterday and today, 24 June, nothing sticks out to me crazy. There's definitely depression across the entire options chain in terms of implied volatility. A lot of that is just IV bleeding off to a degree. As you'll note from the video I made yesterday, the put implied volatility for the out of the monies on this front expiration is increasing as I absolutely anticipated, which again is a tradable event. It is now over 520 vol, something like that for the far out of the money puts. There's a little more kinks going on on these calls, which is also another tradable event for volatility traders. None of that really matters so much here. What stuck out to me is completely different. And it's actually not even anything in terms of the broad chain volatility, the volatility within the product. What stuck out to me was this. The call volume today was",
    "metadata": {
      "video_id": "9nxH1G2yGtg",
      "title": "BIG GME Call Option Volume",
      "url": "https://www.youtube.com/watch?v=9nxH1G2yGtg",
      "upload_date": "",
      "duration": 462.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9nxH1G2yGtg&t=0"
    }
  },
  {
    "text": "event for volatility traders. None of that really matters so much here. What stuck out to me is completely different. And it's actually not even anything in terms of the broad chain volatility, the volatility within the product. What stuck out to me was this. The call volume today was huge. 257,740 contracts traded on the call side compared to 92,666. Uh oh, on the put side. Don't know if that's ominous or not. And the other thing I find interesting is this is blank. I tried reloading the platform and it still didn't update, which is kind of annoying because I was really, really interested to dig into this call volume and see what the heck is going on. If this updates, I will let you guys know and I'll just drop it as a comment in the video. So I can see what it was. But the fact that this is doing that is kind of weird. But this is very novel to me. And if you take a look at these purple boxes, it's all 28 June. That's the vast majority of this volume for both the call and the put side. That's where all the activity is going on. There's some of these kind of grays, which if we take a look, we can confirm. I think these are probably the 19 July's, which they are. The 30s are seeing some action as are the 40s. The other thing I did was take a look at",
    "metadata": {
      "video_id": "9nxH1G2yGtg",
      "title": "BIG GME Call Option Volume",
      "url": "https://www.youtube.com/watch?v=9nxH1G2yGtg",
      "upload_date": "",
      "duration": 462.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 8,
      "start_timestamp": "00:01:09",
      "start_timestamp_seconds": 69.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9nxH1G2yGtg&t=69"
    }
  },
  {
    "text": "is going on. There's some of these kind of grays, which if we take a look, we can confirm. I think these are probably the 19 July's, which they are. The 30s are seeing some action as are the 40s. The other thing I did was take a look at time and sales. There was nothing in here that really made me feel any type of way, except whoever bought the 1,110 of the 128 calls for three cents. First, yeah, I get to yellow, right? You're just throwing money away, essentially hoping something sticks here. This is a cheap position that might seem like a big size, but it's not at three cents. It's like 3,000 made about 3300. So no big deal. This is also hilarious to me, just the fact that they literally paid way, way, way, way too much for the volume. These 590 vol on these. So if they get a big move, they'll get paid out, which is great. Hopefully so. But these options are going to decay super, super fast. If we take a look at these 120, it's quickly all out here. And we look at the theta decay. It's two cents. They're right now mid at three. So after a day, they essentially lose their investment. That's essentially what this is showing you. They need a big price accommodation in order for these to come alive. And again, if you watched my videos on buying call options and GME smarter, which",
    "metadata": {
      "video_id": "9nxH1G2yGtg",
      "title": "BIG GME Call Option Volume",
      "url": "https://www.youtube.com/watch?v=9nxH1G2yGtg",
      "upload_date": "",
      "duration": 462.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 8,
      "start_timestamp": "00:02:15",
      "start_timestamp_seconds": 135.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9nxH1G2yGtg&t=135"
    }
  },
  {
    "text": "They're right now mid at three. So after a day, they essentially lose their investment. That's essentially what this is showing you. They need a big price accommodation in order for these to come alive. And again, if you watched my videos on buying call options and GME smarter, which I will link below in case you haven't, the other problem with super far out of the monies is that they need a huge move before they would start to pay you anything because the gamma is so low. So even if you get a 10 point move, these don't care that much. You're not going to see much of it at all, which is unfortunate because you need a really big move in order for these to pay you much of anything. So maybe they think a big moves on the horizon, but with a 3300 position that's not super conviction on my side. This just looks like somebody hoping something sticks in. I'm hopeful for maybe it will, but it doesn't necessarily look great. This I also thought was interesting right after the open that in the five July, we had about a thousand of the 23 puts go through and notice these are at a way more conservative implied volatility, one 12. So much, much lower wall happening at that transaction. But long story short, as I poke through this, I definitely see more activity in the 28 June, but there was nothing that I thought, yeah,",
    "metadata": {
      "video_id": "9nxH1G2yGtg",
      "title": "BIG GME Call Option Volume",
      "url": "https://www.youtube.com/watch?v=9nxH1G2yGtg",
      "upload_date": "",
      "duration": 462.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 8,
      "start_timestamp": "00:03:22",
      "start_timestamp_seconds": 202.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9nxH1G2yGtg&t=202"
    }
  },
  {
    "text": "go through and notice these are at a way more conservative implied volatility, one 12. So much, much lower wall happening at that transaction. But long story short, as I poke through this, I definitely see more activity in the 28 June, but there was nothing that I thought, yeah, okay, this is really, really interesting by activity. I didn't see it. And right now, I'm only filtering by 100 lots and above typically for stuff like this, especially if you're looking at a cheaper product like this, one of the easier ways to filter this if we're kind of being efficient would be to jack that up to like 500 because you'll see way less. You can see where the bigger orders were and there just are not that many of them. Some are a spread, so we don't really care about that. Yeah. So time and sales isn't telling me too much, but this is interesting. So I looked at the strikes where this was kind of heavy. And again, it was the 25s in the 30s. So what I'm postulating is if we pop over and here, and we go to the 25s in the 30s, let's take a look at the volume today, matches there, the volume exceeded the open interest. So we know right out of the gate that we can't go negative on the OI, a lot of these are going to be opening positions at least 8,000 of them. Even if you take",
    "metadata": {
      "video_id": "9nxH1G2yGtg",
      "title": "BIG GME Call Option Volume",
      "url": "https://www.youtube.com/watch?v=9nxH1G2yGtg",
      "upload_date": "",
      "duration": 462.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 8,
      "start_timestamp": "00:04:20",
      "start_timestamp_seconds": 260.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9nxH1G2yGtg&t=260"
    }
  },
  {
    "text": "take a look at the volume today, matches there, the volume exceeded the open interest. So we know right out of the gate that we can't go negative on the OI, a lot of these are going to be opening positions at least 8,000 of them. Even if you take the 10,600 out of this, you still have essentially 8,000 left over on the buy side. So people are buying there. And then if we take a look at the 30s, there was 18,000, 9 and 5. It about could flatten it out. My guess is that's not what's happening here. My guess is the majority of this also will probably be buy side, at least as of now. Now the other thing that could be happening is people could be liking into spreads, where they might be buying these, selling these. That can be a thing, but we'll have to see how that goes. The main thing that was interesting to me today was the amount of volume. This I thought was novel, especially given that there again isn't a lot of catalysts. I haven't seen anything from roaring kitty. I haven't seen any real big updates. I think there was a live stream earlier today by Larry, but other than that, it just I'm not seeing it. So if you guys have any ideas from your side as always, throw them in the comments. I had a chance to connect with Richard. I'm actually going to try to",
    "metadata": {
      "video_id": "9nxH1G2yGtg",
      "title": "BIG GME Call Option Volume",
      "url": "https://www.youtube.com/watch?v=9nxH1G2yGtg",
      "upload_date": "",
      "duration": 462.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 8,
      "start_timestamp": "00:05:25",
      "start_timestamp_seconds": 325.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9nxH1G2yGtg&t=325"
    }
  },
  {
    "text": "there was a live stream earlier today by Larry, but other than that, it just I'm not seeing it. So if you guys have any ideas from your side as always, throw them in the comments. I had a chance to connect with Richard. I'm actually going to try to talk to him a little bit more to pick his brain as much as I can on what he's looking at. I had a chance to go through his big excel sheet and learn more about that. And I mean, I already dropped a thing in the discord for my people, but I mean that the tinfoil hat is on for me. So I'm in the process now as well of just starting to track FDDs. I'm going to overlay volatility on top of this. And then I'm actually going to start feeding a model that I'm in the process of building to try and forecast potential cycles based on the rules sets that I've seen from Richard and Biggie Smalls. Really just had a sheer curiosity. I'm way too fascinated at this point. Like I've told you guys before, this is like a crazy story for me. And in the trading space, there's not a lot of opportunities to come across stuff like this, especially I'm fortunate at this point. I've been doing this for a long time. So I have a lot of different things I can look at and I know to look at. So that's the",
    "metadata": {
      "video_id": "9nxH1G2yGtg",
      "title": "BIG GME Call Option Volume",
      "url": "https://www.youtube.com/watch?v=9nxH1G2yGtg",
      "upload_date": "",
      "duration": 462.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 8,
      "start_timestamp": "00:06:24",
      "start_timestamp_seconds": 384.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9nxH1G2yGtg&t=384"
    }
  },
  {
    "text": "the trading space, there's not a lot of opportunities to come across stuff like this, especially I'm fortunate at this point. I've been doing this for a long time. So I have a lot of different things I can look at and I know to look at. So that's the game plan. If you have any questions, anything that you want me to take a look at, let me know. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "9nxH1G2yGtg",
      "title": "BIG GME Call Option Volume",
      "url": "https://www.youtube.com/watch?v=9nxH1G2yGtg",
      "upload_date": "",
      "duration": 462.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 8,
      "start_timestamp": "00:07:19",
      "start_timestamp_seconds": 439.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=9nxH1G2yGtg&t=439"
    }
  }
]