[
  {
    "text": "Hey everybody, Eric here and I am super stoked to have Brian on from Alpha Trends. So first off welcome to the channel. Thanks for having me on here, Eric. And just so you know whenever you see me looking down, I got a little notepad here because I am partially an idiot and I forget things. So I like to write stuff down. But the reason why I came across you first of all is there's a couple people that I interact with regularly on Twitter and one of which is Jake from Transpiter. As soon as you start talking technical analysis, your name inevitably comes up in that web. And I also wanted to say very quickly, thank you for sending me a copy of your book. I have literally been enjoying reading that a lot. I have actually quite a few questions on that that I'll get to in a little bit. But I want to start with a little bit of level setting with you because the way that my channel is set up is. And I think that financial industry in general has a lot of in authenticity. And one of the things that I've always really benefited from when I was starting trading and whatnot is I had a mentor that just spent some time with me and kind of just shot it to me straight. And I learned a little bit about technical analysis, but one of the things that I'm known for",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=0"
    }
  },
  {
    "text": "always really benefited from when I was starting trading and whatnot is I had a mentor that just spent some time with me and kind of just shot it to me straight. And I learned a little bit about technical analysis, but one of the things that I'm known for on my channel is generally a lack thereof. So I thought what better person to connect with because one of my favorite things to do on the channel is to tie into different skill sets and obviously you have a very technical skill set. And I think that exploring that a little bit offers a really, really cool paradigm to the rest of the audience because like I said, for me, I use some and I'll get into a little bit of what I like to do, but I'm more interested in what you like to do. I thought a great way to start would be if you don't mind, I would love to just get an understanding of your relationship with the markets kind of at large. So maybe when you started in the markets and what that evolved into over time. I started in the markets at an early age, I think I was 12 or 13 and just kind of used to hang out with my dad on Friday nights back when Wall Street week was a big thing with Lewis Ruqaizer, I don't know if you know that name, Eric. It was a Friday night show",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 77,
      "start_timestamp": "00:01:05",
      "start_timestamp_seconds": 65.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=65"
    }
  },
  {
    "text": "early age, I think I was 12 or 13 and just kind of used to hang out with my dad on Friday nights back when Wall Street week was a big thing with Lewis Ruqaizer, I don't know if you know that name, Eric. It was a Friday night show and I would, you know, was the kid who wanted to hang out with his dad. I would sit there and watch TV with him and he'd always have Wall Street week on on Fridays. I was kind of his thing. So I, you know, they, and they talked about the market. So I started, you know, asking questions here and there once in a while. And then there was a company in the Boston area where I grew up at the time, called Lo Jack and they had just gotten a contract with the state police and. And he just, I saw it on TV and basically got lucky. I said to my dad, hey, you know, can we buy some of this stock and it was, you know, 5 a share. He said, sure, I'll put up, you know, I had money from caddy, newspaper roots and all that stuff you do is a kid to make money. And he said, well, we'll buy a thousand shares and, you know, he gave me leverage basically. And then he said, well, I'm going to buy a couple months later, the stock went to 10 per share. And I had",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 77,
      "start_timestamp": "00:02:08",
      "start_timestamp_seconds": 128.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=128"
    }
  },
  {
    "text": "that stuff you do is a kid to make money. And he said, well, we'll buy a thousand shares and, you know, he gave me leverage basically. And then he said, well, I'm going to buy a couple months later, the stock went to 10 per share. And I had a thousand shares of it and I was like, oh, team 14 years old. So, you know, I thought, hey, why does anyone work? This is, this is the way to go. I'm going to, that's what I want to do is be a trader. It wasn't, it wasn't as easy as it seemed from that trade. There's been a lot of up and up and downs, you know, in between that got me where I am today. That was just my first introductory, you know, kind of got the needle in the arm for a lack of better analogy. But I mean, it's true. I was hooked and I really, you know, so I, you know, later on when I was at, you know, 16, 17, I kept my interest in the market. We go to the library and read, you know, newsletters and that sort of thing. When was the cabinet market letter? There was value line there. And I would, you know, look at these things and dream of all the money I was going to make. And I between reading mafia books was, I like to read those in stock market books. So as a kid.",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 77,
      "start_timestamp": "00:03:02",
      "start_timestamp_seconds": 182.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=182"
    }
  },
  {
    "text": "was the cabinet market letter? There was value line there. And I would, you know, look at these things and dream of all the money I was going to make. And I between reading mafia books was, I like to read those in stock market books. So as a kid. Unfortunately, I'm a trader, not a mafia guy. Good career choice. Right. Those guys are in jail or dead. So. Yeah. So, so that really was, you know, it called to me. And so I went on to become a retail stock broker in Boston. And, you know, as I like to tell people, it was basically a glorified telemarketing position. I really, I didn't know what a broker did. I went to college. I didn't take college seriously as I should have. I was a solid C student, basically. And not really. Then I'd think of my injuries just to get an agree. You know, I have mixed feelings about what I had a better time in school or life afterwards. And I think I made the right call just. You know, finding the balance. Although, you know, I think a better balance would have been these and the little less of the weekend activities. But, um, the drifted into the weekdays. serious topics. So the retail stockbroker was basically a telemarketing position. It wasn't what I wanted to do. It was really good that I learned a lot of skills, sales skills, dealing with people, being a retail",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 77,
      "start_timestamp": "00:04:03",
      "start_timestamp_seconds": 243.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=243"
    }
  },
  {
    "text": "little less of the weekend activities. But, um, the drifted into the weekdays. serious topics. So the retail stockbroker was basically a telemarketing position. It wasn't what I wanted to do. It was really good that I learned a lot of skills, sales skills, dealing with people, being a retail broker. So, and I care around when I say it, but it's honestly partially true that I got to practice with other people's money and make mistakes with their money before I went and became a full-time trader myself, which was 1993. So 91 I graduated college and went to work at Lehman Brothers, moved out to Denver, worked for a company called Dane Bosworth. And I think it was 93 I went and became a full-time trader. I opened my own office, actually day trading office in Denver with a partner. And kind of had that office for a little while. I ran a hedge fund for a little bit, which never really amounted to a lot. I just was not it didn't have the asset base and I was a little impatient. So, you know, I started with another company called Marketwise where I created stock, you know, stock trading courses, you know, technical analysis and, you know, just about level two and, you know, trading in general. And then, you know, left them about 14 years ago. I started, you know, I've been trading full-time and just trading and then how would Linson over who started stock",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 77,
      "start_timestamp": "00:05:13",
      "start_timestamp_seconds": 313.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=313"
    }
  },
  {
    "text": "stock trading courses, you know, technical analysis and, you know, just about level two and, you know, trading in general. And then, you know, left them about 14 years ago. I started, you know, I've been trading full-time and just trading and then how would Linson over who started stock tweets approach me once and said, hey, do you want to start a newsletter? You've got a good YouTube following and that sort of thing, you know, and you've got good information. Do you want to start a newsletter? Yeah, but I don't feel like dealing with all the, you know, customer service stuff. So, he said, don't worry about it. We'll handle that for you. So, alpha trends was born out of that as, you know, subscription product. And I still do it to this day. I don't market it heavily or anything like that. I kind of let people organically find me and, you know, if it fits, if it's not, then I'm not going to beat anyone over the head for it. I'm not in the sales. You know, my passion is the market. And if you, if you follow me on Twitter, you see that's, you know, basically my, it continues to be my passion. Now, it hasn't always been, you know, the, it's a love-hate relationship. And, you know, the, the more, the more experience you get in the market, the more it's a love experience because you realize that you can deal with the",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 77,
      "start_timestamp": "00:06:31",
      "start_timestamp_seconds": 391.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=391"
    }
  },
  {
    "text": "know, basically my, it continues to be my passion. Now, it hasn't always been, you know, the, it's a love-hate relationship. And, you know, the, the more, the more experience you get in the market, the more it's a love experience because you realize that you can deal with the market on your own terms. You don't have to chase things. It's okay to miss trades. You just become more patient, more tolerant of market moves. You know, my wife likes to say it's, you know, life's too short to drink bad wine. And life's too short to take marginal trades as well. You know, there's just no longer, do I sit there and just Jones for trades and look to take a trade because I feel like, hey, I'm a trader, I have to trade something. Where's the action? Instead, it's, it's just more methodical, you know, process-based, focused rather and, you know, managing risk is the most important thing. I, I don't know how you read my mind. I literally was just writing down some notes from your book and the very first bullet point. I literally just wrote this was risk management because I love that you talk about that in your book. And it's something that my mentor spent a lot of time explaining to me because you have people like Warren Buffett that has his rules and is, you know, first rule is make money, second rule, don't forget room number one. And, you know,",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 77,
      "start_timestamp": "00:07:35",
      "start_timestamp_seconds": 455.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=455"
    }
  },
  {
    "text": "talk about that in your book. And it's something that my mentor spent a lot of time explaining to me because you have people like Warren Buffett that has his rules and is, you know, first rule is make money, second rule, don't forget room number one. And, you know, he always respectfully disagreed with that for the purpose of traders. Obviously Warren Buffett, more of an investor mindset. And he always instilled in me that the number one job of any active market participant is risk management that's your, you know, very first thing. And I actually love that you talked about that very early in the book because one of the things that I think about technical analysis is a lot of folks either are non-committal in their forecasts or they always have a reason why, you know, the forecast didn't work or something like that. And it just, it, to me, it feels like it misses an element of reality. And the fact that your book started with that really set me on the right tone in my mind for reading the rest of the book because I think the fact that you talk about that early is super important to me as a trader. And obviously I think that that's a great highlight for a lot of folks that are interested in the market, whether it's VATA, you know, investing or whatever. I had a couple questions about your kind of career progression. I always, this",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 77,
      "start_timestamp": "00:08:47",
      "start_timestamp_seconds": 527.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=527"
    }
  },
  {
    "text": "is super important to me as a trader. And obviously I think that that's a great highlight for a lot of folks that are interested in the market, whether it's VATA, you know, investing or whatever. I had a couple questions about your kind of career progression. I always, this is kind of a selfish part of these conversations because I literally am just very curious about people. It's your conversation. You get to call the shots, right? Well, I always, I try to make sure that I integrate, you know, because I get questions that some, you know, the folks send in that they want me to go over with you and whatnot, but I always make sure to add a little selfish time in there because some of this stuff is really cool to me because so for me, I started trading when I was in high school and I started with, you know, buying and selling stock, but essentially, I've been retail trader side the whole time. Right. So when I talk to people like you that have had some mixed experience, I find that fascinating to explore some of that. So one of the, the first questions I wanted to ask you is when you went from your time from working as a retail stock broker and then you opened that day trading office, what, what was that transition like for you? Like when you were retail stock broker, obviously, very focused on sales and getting",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 77,
      "start_timestamp": "00:09:54",
      "start_timestamp_seconds": 594.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=594"
    }
  },
  {
    "text": "questions I wanted to ask you is when you went from your time from working as a retail stock broker and then you opened that day trading office, what, what was that transition like for you? Like when you were retail stock broker, obviously, very focused on sales and getting people, you know, to, to place trades and whatnot. And then I'm assuming when you went to that day trading office, probably a different focus. I'm curious just a little bit about what that looked like for you. Right. So it wasn't straight to my own office. But I didn't clarify that earlier. What happened was I had used to read the, the, get the news, the print IBD. And in the back page, there was always an advertisement there that said, you know, day trade by power, you know, get 20 to one leverage. Right. They put 25,000 dollars down and you get 20 to one leverage. So that appealed to me. I was thinking, you know, I don't have enough money to trade full time. You've got to thank this was 1993. And I was 20, I guess, 20, 21, 22 years old. Is that right? The 20, 26, whatever it was. But the point is that, you know, I had a young family. I had a mortgage. My wife wasn't working. And I had about, oh, so you already had a family at that time. I did. Yeah. Yeah. So the pressure, so the pressure is on",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 77,
      "start_timestamp": "00:10:50",
      "start_timestamp_seconds": 650.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=650"
    }
  },
  {
    "text": "26, whatever it was. But the point is that, you know, I had a young family. I had a mortgage. My wife wasn't working. And I had about, oh, so you already had a family at that time. I did. Yeah. Yeah. So the pressure, so the pressure is on the pressure was on for maybe there was something in my brain that wasn't connected to recognize the magnitude of the risk because because what I'm going to tell you next, I wouldn't suggest anyone do. I had this job as a broker and I had saved up maybe about 19,000 dollars. And I was just couldn't wait to get out of there once I had my 25,000 dollars. And this was about this time of year around Christmas. And I guess it was 1993. And I was training this stock called chantel pharmaceuticals. And chantel pharmaceuticals wasn't a pharmaceutical company at all. It was a, it was a skin cream that had this miraculous anti-wrinkle property. Nice. And I had all these doctors, you know, that came on the payroll and, you know, made it seem like a legitimate story. So you know where this company's going by those words. So I had run my account from, you know, 19,000 to 28,000 in a two week period. I was like, that's it. I'm ready to quit. I'm done. You know, I'm going to, I'm going to go. So I then took a day off work to go skiing. I",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 77,
      "start_timestamp": "00:11:55",
      "start_timestamp_seconds": 715.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=715"
    }
  },
  {
    "text": "words. So I had run my account from, you know, 19,000 to 28,000 in a two week period. I was like, that's it. I'm ready to quit. I'm done. You know, I'm going to, I'm going to go. So I then took a day off work to go skiing. I called the office to see where chantel was. This was a Monday. I took the Monday off. And the person who answered the phone, you know, I had a thousand shares of this thing. It was let's say 23 a share. And she says it's 18.50. I was like, no, no, no, you get to symbol wrong. It should be, it's probably like 28 by now. It does nothing but go up. Anyways, Barons did a hit piece over on it over the weekend and basically said, you know, the company's a fraud. This thing doesn't do anything for wrinkles. So I just said, listen, sell my stock right here right now, which was the right thing to do because it ended up, it was a fraud. And I was lucky to get out 15 a share when it, you know, I mean, within six months, it was a 2 stock. What was your basis? You know, I had been trading it. So I considered my basis, basically, we're closed on Friday, which might have been 23 per cent. So I'd lost 8,000. So it brought me back under that 25,000 level. And, you know, I was crushed. So I",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 77,
      "start_timestamp": "00:13:13",
      "start_timestamp_seconds": 793.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=793"
    }
  },
  {
    "text": "stock. What was your basis? You know, I had been trading it. So I considered my basis, basically, we're closed on Friday, which might have been 23 per cent. So I'd lost 8,000. So it brought me back under that 25,000 level. And, you know, I was crushed. So I had already put in my notice that I was quitting. And I didn't know what to do. So I took a cash advance on my credit card to make up the difference. I wired it into New York and started trading. And, you know, I was scared to death really losing any money. And they say scared money never wins. And scared money doesn't win big. But I was able to, you know, plug away. And I wasn't making real money at all. I mean, I was like making 18,000 this month, 26,000, but I was making me, I had a really, I mean, my first house cost, I think was 79,000. So my mortgage was like less than 9,000. So it was, you know, it worked. But I realized I'm never going to get ahead with this, even with this leverage because one big mistake, I'm just done. I'm not going out of the water. I've got, you know, got to go back up plan. Right. And you got the family now. That, that, that part to me is just, I really tip my hat off to you because that's, no, I get, you know, like looking back, it's",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 77,
      "start_timestamp": "00:14:20",
      "start_timestamp_seconds": 860.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=860"
    }
  },
  {
    "text": "not going out of the water. I've got, you know, got to go back up plan. Right. And you got the family now. That, that, that part to me is just, I really tip my hat off to you because that's, no, I get, you know, like looking back, it's kind of like, was that right? But just to make that bold of a move, I think deserves some sort of recognition because I feel like at some point you have to trust yourself. And you got there a lot earlier than I did. Like that's, that's nuts to me. That's awesome. It is nuts. And that, that, you know, it worked. Fortunately, I can laugh about it. And I wouldn't suggest anyone does it. And I had a very strong, that's why risk management, Eric is so important to me. I've been on the, I've been on the brink of disaster. And I've, I've had, you know, bad drawdowns in between, obviously, in my 30 year career. But it never bad enough to put me out of business. And, and I, I feel like a lot of people out there are putting themselves in positions where they just trust the market game to do nothing but go up and everything comes back. And they would never cut a loser. What, what, you know, the, what, how, how, with that work, they, it's just not a part of some people's process. Anyway, so, you know, the company that I worked",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 77,
      "start_timestamp": "00:15:36",
      "start_timestamp_seconds": 936.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=936"
    }
  },
  {
    "text": "the market game to do nothing but go up and everything comes back. And they would never cut a loser. What, what, you know, the, what, how, how, with that work, they, it's just not a part of some people's process. Anyway, so, you know, the company that I worked for, they were called generic trading. And I was trading remotely on it, it was on a 24 K modem. And then I remember the upgrade of the 48 K modem was just amazing. And then, so I, I, I went to New York and talked to the, the, the owners of it, Ron Sheer and my rough minutes, it listened, you know, there's nothing like this in Denver, would you want to back an office in Denver? And they did. So I, you know, got my branch managers license open in office, ran it for a couple of years, merged it with another company, and, worked with them. That was market wise, was the name of the company for a period of, I think, about eight or nine years. And that kind of just, you know, ran its course. And fast forward to, just sitting down, trading for myself, writing notes and doing, you know, YouTube videos for free with no intent of, of doing anything with it. And then like I said, Howard approached me and said, hey, you want to start newsletter. So I, that, that, that was that. Right, right. That, that is just so crazy",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 77,
      "start_timestamp": "00:16:41",
      "start_timestamp_seconds": 1001.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1001"
    }
  },
  {
    "text": "writing notes and doing, you know, YouTube videos for free with no intent of, of doing anything with it. And then like I said, Howard approached me and said, hey, you want to start newsletter. So I, that, that, that was that. Right, right. That, that is just so crazy to me. The other thing that I find fascinating about these conversations is, you know, I, I have been trading for a little while, right? I've been trading for over 14 years now. Yeah. But to talk to people like you that have like no kidding, like you talking about the modems is what just inserted this in my brain. You know, it's like, people like you have like just this very fascinating perspective about the evolution of the markets, which is another question that I'm going to ask in a little bit. But I have another, another background question to ask you. And what I'm curious about is, so you did this day trading bit for a while and you're kind of explaining how you ended up moving over to the, the hedge fund and managing a fund for a little while. And you were mentioning that that wasn't necessarily your, your, um, and all be all. But I am curious. While you were managing the hedge funds, I'm assuming you had a very different strategy that you were generally deploying compared to when you're trading like now as an individual retail trader. Is that true or no? Not",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 77,
      "start_timestamp": "00:17:49",
      "start_timestamp_seconds": 1069.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1069"
    }
  },
  {
    "text": "necessarily your, your, um, and all be all. But I am curious. While you were managing the hedge funds, I'm assuming you had a very different strategy that you were generally deploying compared to when you're trading like now as an individual retail trader. Is that true or no? Not really. I mean, so it was, you know, I started out kind of just day trading. This was actually, I remember this was during the SOS period as well. SOS was still the way you executed orders. Right. And then they started coming out with the ECNs. The first, you know, real big one was, was Island and then ready and archipelago. And those gave the retail trader the ability to get in between the spreads that back then were, you know, quarters and eighths. They, you know, they were debt, they were fractions, not decimals. So those gave us a perceived advantage. And if you look at it now, you'd be like, well, why is there a 25 cent spread in the stock? This is insane. Right. You know, we're used to pennies now. So that kind of, you know, progressed towards, you know, an evolution of my style. Okay. That the, that the SOS, the speed of SOS wasn't so important anymore. One of the most influential books early on was Hit and Run Trading by Jeff Cooper. And there were some strategies in there that I learned that really helped me kind of see the market for",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 77,
      "start_timestamp": "00:18:55",
      "start_timestamp_seconds": 1135.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1135"
    }
  },
  {
    "text": "Okay. That the, that the SOS, the speed of SOS wasn't so important anymore. One of the most influential books early on was Hit and Run Trading by Jeff Cooper. And there were some strategies in there that I learned that really helped me kind of see the market for more for swing trades. And I started expanding my time frame into, you know, instead of just being a day trader, days and sometimes weeks. And, you know, learning to put my thoughts of what the company does, you know, I was trained as a broker that, you know, fortunately for me, the, when I worked at Lehman Brothers, I had a senior broker I worked under, and he was in the technical analysis. So I picked up a lot from him. And the way that he would pit stocks was he would find earning surprises. But it had to have a good chart. If it didn't have a good chart, forget about it. And then we would, then I would kind of have to, you know, help develop a story to sell to a customer because a customer isn't going to buy a stock because it's breaking out on huge volume. And, you know, the things that we take for granted now instead it would have to be, hey, you know, they make this product, their sales are this, the earnings are that, estimates are going up, you know, value lines says this, our analyst says that. And creating,",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 77,
      "start_timestamp": "00:20:04",
      "start_timestamp_seconds": 1204.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1204"
    }
  },
  {
    "text": "huge volume. And, you know, the things that we take for granted now instead it would have to be, hey, you know, they make this product, their sales are this, the earnings are that, estimates are going up, you know, value lines says this, our analyst says that. And creating, you know, the pitch, creating the story around it. Quick question on that. Yeah. We're most of the people that you were pitching to, were they more investors, where they were like holding for longer than a year, or were you guys managing folks that were actively buying and selling, you know, more frequently than that? Well, you tend to find the people that you that are geared towards your personality. So if I pick, if I, if I pitch somebody on the phone, who is buying a hold investor, and I'm talking to them about, you know, this, we think this is our three to six month target is the way we generally, you know, mention them, or three to six month target is this. They say, well, that doesn't interest me. Then, you know, they need to figure out, you know, and one of the nice, one of the nice, I guess, one of the things that I learned at Lehman was that a successful phone call is either you get a yes, or they hang up on you. And I didn't really want them to hang up on me, but it was, yeah, I'd get pretty firm",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 77,
      "start_timestamp": "00:21:08",
      "start_timestamp_seconds": 1268.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1268"
    }
  },
  {
    "text": "the nice, I guess, one of the things that I learned at Lehman was that a successful phone call is either you get a yes, or they hang up on you. And I didn't really want them to hang up on me, but it was, yeah, I'd get pretty firm nose. You'd have to just keep going back at them, back at them, back at them, until they really became clear. No, this is not what I do. Okay, fine. Thanks. So you would, you know, your, your customers would kind of be representative of this, the style that you presented them. Okay. And, you know, a better salesman would probably try to be all things to all people and pretend, hey, well, yeah, we'll hold it longer term. But I was more interested in the market than I was in being in sales. So I gave it to him straight. Here's what we're looking for. And that was, you know, if I had to do it the other way, in fact, you know, one of the, one of the firms that sponsored me as, as a broker, they wanted me selling sure as products. And I said, listen, I have no interest in selling sure. I'm not going to sell annuities. And I said, no, you have to sell annuities. You, you, I've scheduled you to take your test, you know, in, in a month. So I'm not going to study for the test. We'll see how it goes.",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 77,
      "start_timestamp": "00:22:14",
      "start_timestamp_seconds": 1334.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1334"
    }
  },
  {
    "text": "have no interest in selling sure. I'm not going to sell annuities. And I said, no, you have to sell annuities. You, you, I've scheduled you to take your test, you know, in, in a month. So I'm not going to study for the test. We'll see how it goes. And I failed the test. So because I was stubborn, I'm 22, old, and I already know everything. So why would I want to do this? Yep. But the point is I, you know, I was a stock guy. And I'm not going to, I couldn't authentically sell annuities to someone. That's awesome. So he signed me up to take the test again. I studied for an hour and failed it. Third time he said, listen, you really don't want to do this. Do you? I was like, hey, finally got the hint. Quick bugging me. No, we're selling stocks. I'm a stock worker, not an insurance agent. So that was just a little aside there. That's awesome. Though I'm glad because there's so many people, especially when you realize what you can make on insurance products via commissions, a lot of people are like, yes, you know, sign me up. But it's like you're saying they kind of sell their souls in pursuit of a few dollars. And I actually really respect the fact that, you know, they dangled money essentially in front of your face. And you're like, no, it's not what I like to do. I'm going",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 77,
      "start_timestamp": "00:23:16",
      "start_timestamp_seconds": 1396.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1396"
    }
  },
  {
    "text": "up. But it's like you're saying they kind of sell their souls in pursuit of a few dollars. And I actually really respect the fact that, you know, they dangled money essentially in front of your face. And you're like, no, it's not what I like to do. I'm going to keep doing that. So I, like, I love that. I think that's a little cool. Thanks. So then you were talking a little bit about the broker that you worked under. And he was starting to introduce or I don't make maybe you were already familiar with technical analysis at that point. But that's really what I want to understand next is when did you find technical analysis? And when did that become the thing that appealed to you? The summer of 1991 when I graduated college, as I used to look at these newsletters and there was one newsletter. It was the Cabot Market Letter. And in that they said they were talking about this company that, you know, it was called Advanced Polymers. And it was, you know, things that go into tube products that make it last longer. The flavor last longer in gum or in toothpaste, it will hold things better. It was a polymer that you know, binded them together was the story behind it. It had a great story. And the, I remember reading, you know, we like this stock if it gets above 8 per share or whatever the price was. I",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 77,
      "start_timestamp": "00:24:16",
      "start_timestamp_seconds": 1456.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1456"
    }
  },
  {
    "text": "toothpaste, it will hold things better. It was a polymer that you know, binded them together was the story behind it. It had a great story. And the, I remember reading, you know, we like this stock if it gets above 8 per share or whatever the price was. I was like, why would you want to buy it higher? That doesn't make any sense. You know, why not buy it at this low point? And then I looked at a chart and it was just clear as day. I mean, the chart just spoke to me that it just kept coming up to that 8 level. We couldn't get past it. So yeah, it can't get past eight. Well, if it gets above eight, well, there's clear sky. And then I started to say, okay, I need to learn about this technical analysis stuff. So that somewhere I picked up the first book I picked up was by John Murphy, technical analysis of the future's market, which you know, it applies to stocks. Then I read the better book, which really has had the huge impact, which was Stan Weinstein Secrets for Profiting the Bull of Bear Markets. And that one, you know, I devoured that book and that one just spoke to me big time. So I had a little bit of knowledge going into that role under the senior broker. I was basically, I was getting paid five bucks an hour for qualifying leads. And then if",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 77,
      "start_timestamp": "00:25:21",
      "start_timestamp_seconds": 1521.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1521"
    }
  },
  {
    "text": "that one, you know, I devoured that book and that one just spoke to me big time. So I had a little bit of knowledge going into that role under the senior broker. I was basically, I was getting paid five bucks an hour for qualifying leads. And then if I opened the account, at least a 10,000 account, I would get a hundred bucks. And so I was making peanuts. But I was getting great experience because I was working for a guy who was, you know, he was a million dollar producer, you know, a million dollars of commissions a year. So he was top notch. And I learned a lot there. I didn't stick around long because I wanted to go be a broker somewhere else and rush the prize in a hurry, which worked out great. So he was, you know, he would get the daily graphs, which is Marcus Smith now. Daily graphs had printed products called, what they were called daily graphs. And there were printed books. One was the blue book, which was the New York Stock Exchange and the green was the NASDAQ and AMEX. And it was, you know, it would come every weekend, 200 pages, four charts per page. It had, you know, all the information of sales and earnings. And I would just spend, you know, all day Sunday, as soon as I got those, I would just spend hours going through them. And then, you know, they were",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 77,
      "start_timestamp": "00:26:20",
      "start_timestamp_seconds": 1580.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1580"
    }
  },
  {
    "text": "come every weekend, 200 pages, four charts per page. It had, you know, all the information of sales and earnings. And I would just spend, you know, all day Sunday, as soon as I got those, I would just spend hours going through them. And then, you know, they were four per page. I would cut them out, cut out the ones I liked that were interesting. I'd go down to kinkos and put it on 400 and make it a, you know, full-size page so I could stay and mark notes on it and get ready for the week ahead. So that, it really just, I mean, it just spoke to me and it made so much sense because I knew when I was a broker, I was selling the chart. But I had to, you know, that's what I was selling, but I had to package it with a story. I had to put some sizzle in it because people would be like, right, like, look, I've brought past this resistance on heavy volume. You lose them as soon as you say that. Right. It's different today because technical analysis is much wider known and accepted and seen everywhere these days. Yeah, yeah, definitely. And but I think that that also, I don't know if it was purposeful for you or maybe subconsciously, but even as you're talking about a lot of this technical analysis that you were doing, maybe, you know, you were doing some of this",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 77,
      "start_timestamp": "00:27:29",
      "start_timestamp_seconds": 1649.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1649"
    }
  },
  {
    "text": "everywhere these days. Yeah, yeah, definitely. And but I think that that also, I don't know if it was purposeful for you or maybe subconsciously, but even as you're talking about a lot of this technical analysis that you were doing, maybe, you know, you were doing some of this fundamental research to support it. But I mean, you're telling me about these different companies and like, you know what they produced, you know, what it was supposed to, you know, what value was supposed to provide. So it even seems like, you know, you might focus more heavily on technical analysis, but it does seem like there's still, you know, a bit of qualitative understanding that you used, you know, to like bundle this whole thing up, which I think is really interesting. Do you think that that's something that you still do today? Like when you're trading whatever you like to trade, do you still have that level of fundamental understanding as well and you're kind of driving with technical analysis? Or would you say that you're kind of like more of a pure technical analyst? Yeah, you know, I don't look at, you know, I sometimes I'll look at a company's website if I just want to see what their product, you know, physically actually is. But most of the time I'm familiar with what the company does. I mean, I'll look in, I'll read the paragraph description. I'll look at their, you know, and that's a",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 77,
      "start_timestamp": "00:28:31",
      "start_timestamp_seconds": 1711.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1711"
    }
  },
  {
    "text": "look at a company's website if I just want to see what their product, you know, physically actually is. But most of the time I'm familiar with what the company does. I mean, I'll look in, I'll read the paragraph description. I'll look at their, you know, and that's a nice thing about market Smith charts is that they have what I think are the most important things. The two most important things are whatever the company is, are they increasing revenues, whatever they sell, are they selling more of that stuff than they did in the same quarter a year ago? And is that increasing sequentially as well? First quarters, you know, second and third, fourth quarter. And not only are they, you know, increased revenues, but is it showing up in the bottom line? Or they're making more money? Now they're selling more stuff, are they making more money selling that stuff? That's basically what I need to know about the company. And then if the chart supports it, it gives me that little extra confidence that I can go into this stock a little bit heavier because they have a real product, they have a real company. It's not some fly-by-night little biotech stock that is in phase two, you know, and it's got this wild chart that, you know, it can go up 80 on a day, but if you look at the, you know, every single day, if you look at the NASDAQ losers, you",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 77,
      "start_timestamp": "00:29:32",
      "start_timestamp_seconds": 1772.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1772"
    }
  },
  {
    "text": "It's not some fly-by-night little biotech stock that is in phase two, you know, and it's got this wild chart that, you know, it can go up 80 on a day, but if you look at the, you know, every single day, if you look at the NASDAQ losers, you know, in the top 10, there's two or three little biotech stocks that are down 30, 40. So it just gives me a little bit of confidence to say, hey, it's a real company, and I understand the psychology of what drives fundamental investors. I'm not necessarily buying the story myself, but I understand that the market values these things, and they do have a real product. So it makes sense that I can get involved a little bit heavier, you know, in terms of my risk unit, and give me the confidence to hold overnight. And then I want to know what earnings do over, you know, tonight, if so, I don't want to hold it, or if they're doing a week, maybe I buy it for the run-up in front of earnings, and just basic fundamentals, Eric. That honestly, like, I feel like that's, that came across in your book, and that was something that I really liked, because a big frustration that I have is a lot of, I think retail traders in general face in uphill battle, no matter what. I mean, even down to, you know, what we can transact at, we can get to,",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 77,
      "start_timestamp": "00:30:38",
      "start_timestamp_seconds": 1838.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1838"
    }
  },
  {
    "text": "your book, and that was something that I really liked, because a big frustration that I have is a lot of, I think retail traders in general face in uphill battle, no matter what. I mean, even down to, you know, what we can transact at, we can get to, you know, two decimals, whereas market makers go to four to sit, you know, dependent on where they're at, because there's just a lot of structural, you know, barriers that we already have to deal with. And something very frustrating narrative I see is when people are like, oh, you know, this is better than that, speaking fundamental better than technical, technical, better than fundamental. Right. And I've always been a huge advocate of why pick, that it's not a binary decision. You can exactly like you're saying, you can use both. Do you need to, you know, wait them exactly the same no, you know, you do what you're comfortable with, but I love that you integrate some, you know, other parts, no matter what that is. And I think that this is a powerful message for people, because a lot of folks, you know, might be charts, but even like you said, understanding what the company sells just helps provide a little bit of context. Yeah. And that leads to a follow on question. And this is just a general curiosity. If you came across a chart that you really liked, but the company's description, they sold something",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 77,
      "start_timestamp": "00:31:48",
      "start_timestamp_seconds": 1908.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1908"
    }
  },
  {
    "text": "even like you said, understanding what the company sells just helps provide a little bit of context. Yeah. And that leads to a follow on question. And this is just a general curiosity. If you came across a chart that you really liked, but the company's description, they sold something that you just don't believe in or that, you know, you didn't really think much of, how do you treat those instances? I'm in the market to make money not save my soul, or, or, you know, win points with any investing committee or, uh, big judge, you know, the market to selfish endeavor, I can, I can go beyond that pretty quickly. You know, unless it's something egregious that just, just doesn't make sense to me. And I honestly can't think of an example. I, you know, you're so called sin stocks, you know, sell guns, they sell weed, they sell booze, uh, doesn't, doesn't bother me. You know, there's, there's products for these, they're partner society. The stock is going, I see it, you know, right. Why wouldn't I get involved? Right. I love that. That's, I truly identified with the same thing. I went through an interesting phase. I was trading, like a couple company, like, Philip 66. And I was trading, you know, just some stuff that falls close to those categories. And I was like, thinking through how I felt about it, but I pretty much arrived at the same conclusion a while ago, whereas",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 77,
      "start_timestamp": "00:32:55",
      "start_timestamp_seconds": 1975.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=1975"
    }
  },
  {
    "text": "phase. I was trading, like a couple company, like, Philip 66. And I was trading, you know, just some stuff that falls close to those categories. And I was like, thinking through how I felt about it, but I pretty much arrived at the same conclusion a while ago, whereas there's a market for it. People make their own choices. This looks good at the time. I'm gonna, gonna trade it. Right. Yeah. Um, cool. So that's really helpful to understand a bit of just your general context. Um, like I said, I think that you bring a really fun perspective, um, to really to the discussion because it's, it's fascinating for me to understand more about your, um, your approach. So I want to pivot real quick to just a little bit more about your general technical analysis approach. So there's a couple things that I picked up in the book that really just seemed to cross through to me, one of which was the, the concept of multiple time frames. Um, so if there was like a 30,000 foot view summary, if you were to characterize your general approach to technical analysis, what does that look like? Yeah. So I mean, you hit it. It's trend alignment. And what that basically means is, you know, at any given day in the market, you know, we could be in a bullish environment or a bearish environment. We, I mean, we've had off of the COVID low in 2020, we've",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 77,
      "start_timestamp": "00:34:09",
      "start_timestamp_seconds": 2049.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2049"
    }
  },
  {
    "text": "So I mean, you hit it. It's trend alignment. And what that basically means is, you know, at any given day in the market, you know, we could be in a bullish environment or a bearish environment. We, I mean, we've had off of the COVID low in 2020, we've had this phenomenal bull market. But along the way, there's been a couple scary declines. And, you know, periods of, let's say, three to six weeks where we've clearly been in bearish environments. And if you're buying stocks, you know, it's, you're losing money or if you're buying some of these stocks that are yesterday's winners, Peloton, you know, Zoom, PayPal, you know, the list goes on and on. A lot of these big tech names have been destroyed here in just the last few months. So when I look at those, I look at the big picture and say, Hey, it's, it's in a primary uptrend. So to me, that becomes a candidate for, for purchase. I don't want to buy it after a stock has already made a move or phomo move, you know, fear of missing out. Hey, it's run. I got to get on board. And one of the things that really is curious is that whenever I, you know, interact on one of these Twitter spaces or if I do a webinar with people who are asking questions about a stock, they almost always ask me mainly about two types of stocks. One, the stock",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 77,
      "start_timestamp": "00:35:20",
      "start_timestamp_seconds": 2120.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2120"
    }
  },
  {
    "text": "one of the things that really is curious is that whenever I, you know, interact on one of these Twitter spaces or if I do a webinar with people who are asking questions about a stock, they almost always ask me mainly about two types of stocks. One, the stock that's up 10, 15 in the last week. Do you think this is a good buy here? Look where it's come from. Or they ask about Peloton and zoom and say, does it look like a good buy down here? And they've been trained by the dip, but they bought the dip at 10 down, 20, 30, 40 and here we are 60 down. Dip buying is not a strategy in my mind. So what we want to do is buy strength after a dip. A true dip is a stock in an uptrend that pulls back to a level fine support and resumes that uptrend. If instead the stock pulls back, breaks below key support, breaks below moving averages, those moving averages start to roll over, tells me we're in a different phase for this stock. The sellers of regain control, it's no longer dip buying. You're buying into the abyss. You're buying from institutions who are set liquidating millions of shares and thinking, you know, that it's yesterday's news and using yesterday's logic that the stock is in an uptrend and the bounces have been strong with today's reality that it's a broken stock. So what I want",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 77,
      "start_timestamp": "00:36:28",
      "start_timestamp_seconds": 2188.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2188"
    }
  },
  {
    "text": "the abyss. You're buying from institutions who are set liquidating millions of shares and thinking, you know, that it's yesterday's news and using yesterday's logic that the stock is in an uptrend and the bounces have been strong with today's reality that it's a broken stock. So what I want to do is I want to focus on the stocks that are in uptrends. And real simple, I mean, if you look at a daily timeframe, you could look at a 20 and a 50 day moving average. If the 20 day moving average is above the 50 and they're both rising, to me, it's an uptrend. It's innocent till proven guilty. But it doesn't mean I can just buy it anywhere. Again, it might have just run 15 in the last three days. I don't want to be late because a normal pullback from normal correction could shake me out at a big loss. Instead, I want to see the stock that ran up 15 with sideways for a day or two. And then begins to pull back three or four days. And it maybe retraces half of that rally that it showed. I don't want to buy it as it's pulling back because again, I don't know if this is the time it's going to catch a collapse. Yeah. So as we start to look at shorter term timeframes, and you might look at, for instance, a 30 minute timeframe of the last 30 days, you'll see that",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 77,
      "start_timestamp": "00:37:43",
      "start_timestamp_seconds": 2263.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2263"
    }
  },
  {
    "text": "as it's pulling back because again, I don't know if this is the time it's going to catch a collapse. Yeah. So as we start to look at shorter term timeframes, and you might look at, for instance, a 30 minute timeframe of the last 30 days, you'll see that it's come down and it starts to turn sideways. And as it starts to turn sideways and stabilize, it might be stabilizing on that 20 day moving average or at a 61.8 retracement or at a volume weighted average price from the prior low. If there's some technical reason to be interested there, then I'm aware of it. And I look at the shorter term time frame and I look at and say, okay, it looks like the battle is being waged here between the buyers and sellers. But the sellers have taken control for a few days. Now it's turning sideways. If we go back to technical analysis 101, the first rule is, you know, one of the first rules is trying to once established is more likely to continue than reverse. So if it paused and as soon as it starts to make that first little higher high on the shorter term time frame, it emerges out of the price correction and then a time correction. It makes that first higher high on the shorter term time frame. It's now an alignment with the higher high, the higher highs and higher lows on the daily time frame. That's",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 77,
      "start_timestamp": "00:38:46",
      "start_timestamp_seconds": 2326.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2326"
    }
  },
  {
    "text": "on the shorter term time frame, it emerges out of the price correction and then a time correction. It makes that first higher high on the shorter term time frame. It's now an alignment with the higher high, the higher highs and higher lows on the daily time frame. That's where I want to get involved and set my stop underneath whatever the most recent relevant higher low is. So if you look at my Twitter, I never mentioned stocks without saying, here's where a worst case stop would go. It's always again, back to what you picked up on, you know, first thing you said is, it's always about risk management. You can't get hung up in your analysis and say, I'm going to, I think I'm right. Forget the market. I'm going to buy more. You have to say, at this point, the, you know, if if the first point it makes that first higher high on the short term time frame after the pullback, that's where the momentum is now an alignment with longer term time frame. Now I'm looking at an merging trend defined by higher highs and higher lows. So if instead it breaks higher and then pulls back and makes a lower low, well, my definition of trend is no longer existing. So why on earth would I still want to hold the stock? Because I'm stubborn because I read the annual report and I spent 10 hours researching this stock on the weekend",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 77,
      "start_timestamp": "00:39:53",
      "start_timestamp_seconds": 2393.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2393"
    }
  },
  {
    "text": "and then pulls back and makes a lower low, well, my definition of trend is no longer existing. So why on earth would I still want to hold the stock? Because I'm stubborn because I read the annual report and I spent 10 hours researching this stock on the weekend and I feel like I have to make money in it. That's part of the danger of doing two in depth of the fundamental research you start to feel married to it. Yep. Yeah. I think that that's so that's something that I talk quite a bit about too is it was funny when I I don't know it was trading for a little while early on. I would see these people talking about like emotions and ego and to me it was always just like something that older dudes talked about because you know for whatever reason I didn't understand it because obviously when I was 22 in a rush to make money I didn't have an ego at that point obviously. And you know just it's interesting that you mentioned that though because I think that something I find fascinating is the markets by definition are in uncertain space and people try to find certainty by collecting more data points. But what they seem to not totally understand is sometimes it's exactly like you're saying they kind of just create this narrative for themselves that doesn't necessarily solve the uncertainty the uncertainties still there you just have more",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 77,
      "start_timestamp": "00:41:01",
      "start_timestamp_seconds": 2461.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2461"
    }
  },
  {
    "text": "space and people try to find certainty by collecting more data points. But what they seem to not totally understand is sometimes it's exactly like you're saying they kind of just create this narrative for themselves that doesn't necessarily solve the uncertainty the uncertainties still there you just have more data points that may not believe in. So that leads me actually to another question and this is actually a genuine question that I've had for a long time for for technical analysis in general there's a handful of tools that I like to use. I like to use linear regression channels or standard deviation channels or some sort maybe Bollinger bands and then typically moving averages maybe fibs sometimes. But overall pretty limited I do like to use volume and maybe an oscillator just to glance at but not too heavily. Something that I've always found to be difficult to understand is the idea of market timing because obviously I've read a bunch of white papers on the behavior of individual investors and essentially a very difficult time that traders have predicting timing in any capacity. And when I was reading through your book I actually really liked the way that you use multiple time frames because it's not so much that you're at least this is my interpretation. It didn't seem so much that you're necessarily trying to predict much of anything. You're mostly seeing what's happening and what's most likely to happen thereafter and then you're always",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 77,
      "start_timestamp": "00:42:03",
      "start_timestamp_seconds": 2523.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2523"
    }
  },
  {
    "text": "way that you use multiple time frames because it's not so much that you're at least this is my interpretation. It didn't seem so much that you're necessarily trying to predict much of anything. You're mostly seeing what's happening and what's most likely to happen thereafter and then you're always still using that stop to kind of catch yourself. But I'm curious when you're applying your technical analysis to charts is that close to what you're doing just in terms of trying to understand what's happening and finding the best way to interact with that or is there more of a predictive paradigm that you're applying? You know predict is too strong. I like to anticipate. I like to anticipate different scenarios. And in that if I predict it means I think I know the outcome. But if I anticipate you know at least this is how I differentiate it. Maybe I'm splitting hairs over the terminology. But if I anticipate and if I look at the stock that's in the uptrend I missed that first move. It goes sideways for a day or two and it starts to pull back and then it starts to stabilize a little bit. That's when I really become interested in it because I say okay you know the primary trend is higher it was up on big volume. So I look at you know my main tools are you know time frames. First I want to identify my my candidate on the bigger",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 77,
      "start_timestamp": "00:43:28",
      "start_timestamp_seconds": 2608.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2608"
    }
  },
  {
    "text": "That's when I really become interested in it because I say okay you know the primary trend is higher it was up on big volume. So I look at you know my main tools are you know time frames. First I want to identify my my candidate on the bigger picture the daily timeframe. And then as it begins it's pull back I look at a shorter term timeframe. On the daily timeframe I have as I've mentioned some simple moving averages. I look at volume. I want to see the volume expanding in the direction of the trend. I want to see relative to that the lighter volume as it pulls back and finds you know as it settles in to let's say a 20 day moving average or a Fibonacci or the volume weighted average price off the prior low as it starts to settle in and show signs that the sellers are losing control the buyers are stepping up a little bit. I want to think you know okay in terms of supply and demand. If shorts were shorting this because they thought it was up too much they realized the bigger picture is still higher and they're most likely going to look to be covering that add source of demand. If there was a big fund that started you know they have five million shares and they wanted to take a little bit off while they can they sell it down to the 50 day moving",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 77,
      "start_timestamp": "00:44:38",
      "start_timestamp_seconds": 2678.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2678"
    }
  },
  {
    "text": "they're most likely going to look to be covering that add source of demand. If there was a big fund that started you know they have five million shares and they wanted to take a little bit off while they can they sell it down to the 50 day moving average you know so it wants to get to the 50 day moving average they'll stop selling because they don't want to hurt the stock in fact they might start you know put a bid in there to support their position. So I'm trying to think of who are the players what are they doing how would I feel if I was short what are what would I be doing whatever if I was long what if I was you know as I am and cash what's the right way to look at this it's stabilizing you to key level it's starting to show accumulation on a shorter term timeframe now if is truly in an uptrend and I'm buying it as it emerges after that pullback it should go on to make a higher high but if it doesn't then you know then then there's maybe something wrong here but even before it gets to that higher high let's say a pullback from 25 to 22 and I'm trying to buy it at 22 and a half as it breaks that near term little resistance I want to know if I'm wrong if it goes below 2180 I'm out",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 77,
      "start_timestamp": "00:45:43",
      "start_timestamp_seconds": 2743.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2743"
    }
  },
  {
    "text": "but even before it gets to that higher high let's say a pullback from 25 to 22 and I'm trying to buy it at 22 and a half as it breaks that near term little resistance I want to know if I'm wrong if it goes below 2180 I'm out because that's the most recent relevant higher low for this consolidation and that breaks the definition of trend so it's if then if if it breaks I'll buy it and I will continue to hold it but instead if it breaks lower I need to get out because I'm a technical trader the definition of trend is higher highs and higher lows we broke that definition what the hell am I still doing holding this stock I'm not being true to the process that's pretty powerful I think to be honest I think that a lot of people um you know when things might might Tyson you know said it the best you know everybody's a plan to like punch in the mouth yeah and as soon as you know people see something you know diverting from their original trade hypothesis it seems really common to rationalize it oh you know this is because of this or because of that and it'll it'll revert it'll be better it'll be okay you know Eric thank you and I'm sure up to you it goes back to what we were just talking about you know the fundamental analysis I I like everyone",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 77,
      "start_timestamp": "00:46:37",
      "start_timestamp_seconds": 2797.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2797"
    }
  },
  {
    "text": "know this is because of this or because of that and it'll it'll revert it'll be better it'll be okay you know Eric thank you and I'm sure up to you it goes back to what we were just talking about you know the fundamental analysis I I like everyone learn my lessons the hard way when I lose big money that's when I've lost the you know learn these lessons and what I know is in the past when I've had big losers and if I'm not familiar with the story what do I do you know I'm in a stock I don't want to sell it I'm stubborn so I start looking at the news I start pulling up research reports I start trying to find something some shred of hope to hold on to because I know that price isn't it anymore so you know start to justify it and it's been a long time since I've been in that position that's that's a great habit to get out of as quick as you can recognize you know you're holding a loser and you're starting to justify why you're holding it that means sell the stock that's that's all it means it means that it's arrogant to go in and think that you're going to be right so part of your plan has to be that risk management saying I could be wrong and I don't want to lose my money I don't you know I don't",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 77,
      "start_timestamp": "00:47:45",
      "start_timestamp_seconds": 2865.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2865"
    }
  },
  {
    "text": "that's all it means it means that it's arrogant to go in and think that you're going to be right so part of your plan has to be that risk management saying I could be wrong and I don't want to lose my money I don't you know I don't mind losing a little bit I still don't like losing you know I don't like people say love your losers I don't love my lose I agree with that I don't like to lose yeah we're competitors we want to achieve at high level losing sucks it's part of the process and you realize that and and sometimes the best way to to you know have that point driven home is that you do buy the stock at 22 and a half you sell it at 2180 and you look at it the next day it's 18.50 and then it feels then it feels good then you like your losses a little bit of orange yeah I'm not the dummy still holding this thing I had my plan and I executed it um so you know it it all goes back to you know controlling those emotions and the way to do it is to to have that anticipation I could be right or I could be wrong and if I'm wrong I have to cut my loss that's that's all the risk to it otherwise you know we've all been there it's just it's just a disaster and I",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 77,
      "start_timestamp": "00:48:48",
      "start_timestamp_seconds": 2928.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2928"
    }
  },
  {
    "text": "to do it is to to have that anticipation I could be right or I could be wrong and if I'm wrong I have to cut my loss that's that's all the risk to it otherwise you know we've all been there it's just it's just a disaster and I mean it's a psychological effect that pretty much humans have you know when we have a winning trade we like to take those off super quick because the ego we like to be right and we just confirm to being right and when we're wrong we don't want to confirm being wrong so you just kind of sit there and wait and hold and then you just your loss is exponentially growing potentially um something to that end actually that I'm a really big advocate of and I'm actually curious if you apply any sort of version of this it sounds like you do especially with setting your your stops or wherever you're going to exit but I'm I'm really a big advocate of setting profit and loss targets before you enter a trade before the emotions are involved and before all of that exists it sounds like you do that when we're talking to the downside right you talk about where your next support level is do you do any form of that when it comes to profit taking to know when to take a winning trade off yeah here's here's how I handle winners is that one of",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 77,
      "start_timestamp": "00:49:53",
      "start_timestamp_seconds": 2993.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=2993"
    }
  },
  {
    "text": "that when we're talking to the downside right you talk about where your next support level is do you do any form of that when it comes to profit taking to know when to take a winning trade off yeah here's here's how I handle winners is that one of what I consider one of my key strengths in the market is because I'm looking at multiple time frames and it's not just the daily in the you know 30 minute chart I'll go down to a 10 minute time frame I'll go down to a two minute time frame when it comes time to entry so one of my strengths is that I'm pretty right on my entries um that I'm I'm going to know right away whether I'm right or wrong because it's going to start to move it's at the level where it's supposed to right so when I enter I enter at you know at a bigger size intentionally because my timing is good enough that that I know that's one of my strengths I add a little exercise but my intent is as soon as it begins to rally and generally I don't know if you're familiar with pivot analysis the the floor trader pivots daily pivot R1 and R2 S1 and S2 I'll use those as my first level for taking a third of my position so again if we go back to the stock that was 22 and a half most likely daily",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 77,
      "start_timestamp": "00:51:00",
      "start_timestamp_seconds": 3060.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3060"
    }
  },
  {
    "text": "you're familiar with pivot analysis the the floor trader pivots daily pivot R1 and R2 S1 and S2 I'll use those as my first level for taking a third of my position so again if we go back to the stock that was 22 and a half most likely daily R2 would be somewhere around 23.12 let's say okay so I'll I'll see it run up to daily R2 and I'll either sell some immediately there because a lot of times that's the high of the day it's because there's a lot of programs based around them so I'll sell that first third right then and there and and then I'll hold my two-thirds position what I do with the balances I then raise my stop up to my generally you know right around my cost basis so if I get stopped out on the two-thirds of break even and I've taken 60 cents on the first third it means that I'll get I'll be out of the stock with a 20 cent profit on average so I want to be in a position of strength and winners don't take care themselves it's about aggressive you know money management once you're in them as well if the stock continues to rally I'll raise my stop and what I what I'll often do is you know let's say I get a nice end of day push it ran another dollar and a quarter well I might set half of my stop",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 77,
      "start_timestamp": "00:51:59",
      "start_timestamp_seconds": 3119.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3119"
    }
  },
  {
    "text": "you're in them as well if the stock continues to rally I'll raise my stop and what I what I'll often do is you know let's say I get a nice end of day push it ran another dollar and a quarter well I might set half of my stop below the midday low the next morning the next morning I'll set it below the prior days midday low and then I'll keep my stop on the other third at break even it might break even cost so now if I get stopped out of a third with this much gain another third with this much gain and down here I've got break even I'm going to give that final third a lot more wiggle room so that maybe I can hold it you know if I don't get stopped out of the second third I'll just continue to raise that one very aggressively up under the success of higher lows and then the final third I'll trail it with a wider stop using again the definition of trend but on a larger time frame so that it might be I can hold this stock for two to three weeks and survive some of these one and one and a half point pullbacks on a 25 stock now and then I'll get stopped out let's let's say 26.80 on that final third and maybe I took you know 60 cents on the first third 2.80 on the second third but",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 77,
      "start_timestamp": "00:53:15",
      "start_timestamp_seconds": 3195.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3195"
    }
  },
  {
    "text": "and survive some of these one and one and a half point pullbacks on a 25 stock now and then I'll get stopped out let's let's say 26.80 on that final third and maybe I took you know 60 cents on the first third 2.80 on the second third but I make 6 on the final third it's worth holding that and you know I never regret selling the early pieces because there's a lot of times where I will sell that first third for the 60 cent gain I'll get stopped out of the rest at break even and then I'll see the stock decline and go down a dollar and I got out with 20 cents profit and to me it's those incremental gains as well and not letting them turn into losers really makes a big difference at the end of the year I think that I mean that last part really is huge is not allowing winners to turn into losers that's something I personally trade I'm mostly a derivative trader so I trade options in futures primarily but when I'm trading longer durations I have a very different strategy when I'm day trading it literally looks almost identical to that where I'll break a position either into thirds or quarters right and I find the literally the exact same thing because a lot of times traders again thinking this like we were talking about earlier fundamental analysis or technical analysis right traders on or the",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 77,
      "start_timestamp": "00:54:16",
      "start_timestamp_seconds": 3256.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3256"
    }
  },
  {
    "text": "looks almost identical to that where I'll break a position either into thirds or quarters right and I find the literally the exact same thing because a lot of times traders again thinking this like we were talking about earlier fundamental analysis or technical analysis right traders on or the traders off and they kind of forget to take a little creative license in there and to play with scaling more a lot of traders I think are too black and white and they think that if they exit then you know they should exit the whole thing yeah I really like that so I wanted to talk a little bit more specifically about your technical analysis approach obviously I was fortunate enough to get a lot of it from from your book but if you were to list out your typical trading time frame because that last part actually surprised me when you said that you know sometimes you might take a trade out with that last third you know like two weeks or something I wasn't anticipating that what kind of time frames would you say you trade generally speaking I like to I like to think of myself as a swing trader okay so if the stock allows me to so most of my day trades or either I get stopped out of my what I thought was going to be a swing trade right away because it violated my stop and I have to move on",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 77,
      "start_timestamp": "00:55:23",
      "start_timestamp_seconds": 3323.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3323"
    }
  },
  {
    "text": "myself as a swing trader okay so if the stock allows me to so most of my day trades or either I get stopped out of my what I thought was going to be a swing trade right away because it violated my stop and I have to move on so the market told me to day trade I do some day trades when you know when I'm just sitting there there's an opportunity it's just so obvious that I can't resist taking it but I prefer not to be a day trader okay so I like to swing trade and generally what the market allows me to do in successful swing trades is hold them the sweet spot is really probably three to eight days somewhere in there and then if if like I said I've got final third piece maybe I'll even sell half of that third so now I'm down to one sixth of the position and I might try to hold that I try to experiment with holding it for a month or six weeks but what I find out is once I get beyond that two to three week period I'm generally better just being stopped out rather than trying to hold for a bigger move and of course it's you know dependent on what the market what phase of the market we're in right now we're you know gross stocks are getting hit hard they're not bouncing and the ones that follow through don't",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 77,
      "start_timestamp": "00:56:33",
      "start_timestamp_seconds": 3393.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3393"
    }
  },
  {
    "text": "stopped out rather than trying to hold for a bigger move and of course it's you know dependent on what the market what phase of the market we're in right now we're you know gross stocks are getting hit hard they're not bouncing and the ones that follow through don't do so for as long you know three to three to eight days is you know a longer term window right now for my trades more of them so when there's great you know heightened sense of uncertainty in the market the market naturally shrinks my time frame it's not that I'm sometimes I'm thinking well the market's more volatile so I'm going to be quicker to take a little bit off I'm going to raise my stop you know faster because moves haven't followed through but other times it's just the market tells me that and and and that's the key is to really be able to objectively listen to the market and you know and it truly listen not just hear it but listen and say okay the market's saying get out get out that's that's it and then as I go through my you know stocks at the end of the day I start to see hey there's more stocks here that look like they're ready to break down than I've seen in the last week that's the market telling me something I'm not finding long candidates that's that's important information that the market's telling me it's",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 77,
      "start_timestamp": "00:57:47",
      "start_timestamp_seconds": 3467.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3467"
    }
  },
  {
    "text": "the end of the day I start to see hey there's more stocks here that look like they're ready to break down than I've seen in the last week that's the market telling me something I'm not finding long candidates that's that's important information that the market's telling me it's saying hey you know maybe it's okay to you know do some smaller short sales so it's all about trying to be as objective in listening to the message of the market as possible and using the experience that I've accumulated over the last 30 years to you know make sure I I implement whatever plan I come up with and not let my ego get in the way there's there's still times it surprises me Eric that you know it doesn't happen very often but once in a while I look at my account and go wait a minute who's trading this account today that's that's not me that's not the guy that that I've trained myself to be in the market that I was an emotional basket case I didn't do anything right I broke 12 rules today what the heck you know where does that come from it's it's bizarre it's yeah it's funny you say that because another big it's it's fascinating talking to other traders because you find so many commonalities because that that's another big one for me is trying to impose what we want the market to do or what we think the",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 77,
      "start_timestamp": "00:58:53",
      "start_timestamp_seconds": 3533.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3533"
    }
  },
  {
    "text": "it's it's bizarre it's yeah it's funny you say that because another big it's it's fascinating talking to other traders because you find so many commonalities because that that's another big one for me is trying to impose what we want the market to do or what we think the market should do just leads to errors it just leads to problems yeah and it's exactly like you're saying taking a look at the market and seeing the best way for us to tailor our current skill set to interface with what the market is doing tends to be a lot more successful instead of trying to force things onto it and another thing that I I actually just did a video on this not too long ago is the concept of emotions because a lot of people talk about this idea of you know trying to be like a machine or a robot and I think that that just sets people up for failure because at the end of the day we need to control our emotions with certainty for sure have to do that but you can only control them if you acknowledge they exist and this idea of you know I'm just going to follow all these rules and like you said sometimes you know throughout the day you just have this other version of yourself pop out and you're like who the hell is that guy and you know that that that's emotions at work it's",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 77,
      "start_timestamp": "00:59:58",
      "start_timestamp_seconds": 3598.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3598"
    }
  },
  {
    "text": "of you know I'm just going to follow all these rules and like you said sometimes you know throughout the day you just have this other version of yourself pop out and you're like who the hell is that guy and you know that that that's emotions at work it's I think it's something that I've become really interested in and tune with because the way that I keep trade logs is for especially for shorter term trades I have like a couple note section that I have to fill out and I'll read them I literally go through this big annual review at the end of the year and I'm reading through some of them now and it's it's legitimately kind of funny because I can look at it and be like who the hell is that guy some of this is really emotional the more experience you get the good news is that you recognize those periods quicker you recognize them during the day when you're down x p and l and don't continue to fight and chase you instead you you know hey back off you're you're exhibiting you know dangerous behavior to your financial well being here back off slow down go for a walk do something get away from the screen for a while go reset and that's you know I think the human nature is always going to we're always going to have some little self-destructive seed that if we let it ferment it's",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 77,
      "start_timestamp": "01:00:59",
      "start_timestamp_seconds": 3659.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3659"
    }
  },
  {
    "text": "here back off slow down go for a walk do something get away from the screen for a while go reset and that's you know I think the human nature is always going to we're always going to have some little self-destructive seed that if we let it ferment it's going to turn into something stronger but it the key is to recognize it quicker and then take the preventative actions that that to me is is you know it used to be that that this alter ego would show up once or twice a year and my big thing was that I wouldn't find a stock that's down too much and I would buy just a little bit you know to test the waters and then it dropped you know let's say let's say I'd buy 400 shares but then it drops three dollars and I'm looking at it going well I have to buy more now I'm not going to sell at 1200 and then I'd you know puke it out at the end of the day for a 20,000 loss and go wait a minute I that's not how I trade what right happened there so now that doesn't happen on you know with with his bigger number it's it but I I'm more in tune with catching it catching it quickly and correcting it and saying wait a minute this is just stupid don't for don't forget the times you did this and it cost you",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 77,
      "start_timestamp": "01:02:01",
      "start_timestamp_seconds": 3721.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3721"
    }
  },
  {
    "text": "that doesn't happen on you know with with his bigger number it's it but I I'm more in tune with catching it catching it quickly and correcting it and saying wait a minute this is just stupid don't for don't forget the times you did this and it cost you a lot just move to the sidelines stop right yeah I it's for me I I don't really day trade super frequently anymore actually fall into a more similar category to you where I probably manage my trades within 20 days normally okay but when I do venture into day trading I've set like a couple hard and fast rules one of which is as soon as I get stopped out like three times in a row on something like that's just go do something else that's it for the day yeah and it's just because for me luckily day trading isn't really the the primary you know development approach that I have or income approach at this point but I have learned that once I start having successive stops then sometimes you know I get well I got to get this right you know I got to figure it out and then all of a sudden you know it's just stupid mistakes yeah um you mentioned a little bit you know obviously some important habits you've developed over time and if you were to list out like maybe your top three or five habits that you've developed since you",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 77,
      "start_timestamp": "01:03:10",
      "start_timestamp_seconds": 3790.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3790"
    }
  },
  {
    "text": "out and then all of a sudden you know it's just stupid mistakes yeah um you mentioned a little bit you know obviously some important habits you've developed over time and if you were to list out like maybe your top three or five habits that you've developed since you started trading to now what would those be uh number one don't chase moves I mean that that's so easy to get excited and feel that FOMO and chase stocks always ask yourself where has it come from you know it has an expanded much energy getting to where it is where does it have the potential ago is it running into an important prior level of support that has the potential to become resistance and think of it as fresh money what's my risk reward here if I was the guy who bought three days ago when it was 15 lower and it's now breaking out it makes sense to sell some to the breakout chasers so ask those questions where does it come from where does it have the potential to go my habits are to you know just continually uh you know scan the market manually with my own two eyes looking at you know getting a better feel for the market by looking at a lot of stocks looking at stocks I know I'm not going to trade but you're saying here the themes that seem to be setting up it's not that I'm going to",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 77,
      "start_timestamp": "01:04:16",
      "start_timestamp_seconds": 3856.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3856"
    }
  },
  {
    "text": "my own two eyes looking at you know getting a better feel for the market by looking at a lot of stocks looking at stocks I know I'm not going to trade but you're saying here the themes that seem to be setting up it's not that I'm going to scan and tell the market here's the list of types of stocks I want to buy instead I want to listen to the market I I have a general idea of what I want and I could program that very easily but I don't get the same feel for the market so for me I have to be in tune with the market and you know let's say I come back from vacation most like I was looking at the market on vacation a little bit right but I often won't trade that first day because I my feel isn't there I my I haven't been involved with actual money in the market I can look at the charts right and and know where we are in the overall cycle but my feel isn't there so I I need to just you know sometimes just slow things down a little bit is and that's a habit as well just slow things down don't have to try to be involved in everything it's again just I every once in a while I'll put a video out about you know just some habits that I think are important you know that I",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 77,
      "start_timestamp": "01:05:31",
      "start_timestamp_seconds": 3931.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3931"
    }
  },
  {
    "text": "bit is and that's a habit as well just slow things down don't have to try to be involved in everything it's again just I every once in a while I'll put a video out about you know just some habits that I think are important you know that I looking back and I really like the one you mentioned about slowing down because a lot of people I find myself I literally this morning I was like doing my morning workout and I was watching something and it started to move and I was like immediately starting to place a trade I was like whoa like chill out dude you're not even like I didn't know if that earnings coming up anything and I was like setting this trade up on my phone and I realize like I still have that tendency sometimes where I feel like I'm gonna miss something you know if I don't jump in right now that photo that you're talking about so I think that that cautionary tale in general like slowing down is just really powerful with Eric it just real quickly I mean I I have those feelings once in a while too I'll be looking at my phone you know in bed going what's the market doing and I'll see something happening but I I try not to look at my phone or look at the market until I don't like to be in front of my computer at the most",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 77,
      "start_timestamp": "01:06:34",
      "start_timestamp_seconds": 3994.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=3994"
    }
  },
  {
    "text": "too I'll be looking at my phone you know in bed going what's the market doing and I'll see something happening but I I try not to look at my phone or look at the market until I don't like to be in front of my computer at the most for more than an hour before the market opens only if there's an economic event but generally I like to be in front of the computer about a half hour before the market because sometimes I just get itchy and I and I know this about me and I'll buy something in the market when I know I shouldn't and those end up being mistakes more often than not so to you know prevent myself from doing that I say well I'm not allowed to sit in front of the computer till nine nine Eastern right gives me the ability I can read you know I can read my little summary newsletters and and that sort of thing but I can't let myself get in front of price action because I'm not good at trading in the pre-market and it ends up costing me money so I I'm not allowed to do it I don't I you know I don't allow myself right yeah it's it's funny because it is one of those things that I feel like over time you definitely learn to get a handle on but it's interesting to hear you know that the the urge is",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 77,
      "start_timestamp": "01:07:33",
      "start_timestamp_seconds": 4053.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4053"
    }
  },
  {
    "text": "to do it I don't I you know I don't allow myself right yeah it's it's funny because it is one of those things that I feel like over time you definitely learn to get a handle on but it's interesting to hear you know that the the urge is still there if you accept I say it all the time I say jokingly but anybody who actively trades we all have a little bit of generate in us somewhere in there yeah we got that dude that just wants to get in there and it's just start slinging money and it's important obviously keep that in its proper place because it gets out of control click so I wanted to ask you another kind of list of some of your favorites but this one I wanted to pivot to kind of your favorite TA tools so from your book you actually do a like really really great job outlining a lot of the tools that you like to use in the circumstances you like to use I you know obviously a lot of talk about moving averages involving you know things like that which funny enough those are probably some of the the primary tools that I generally also use which I think is just a indication of how universally they can be applied depending on you know your trading approach but I'm really curious if again if you were to give a handful of your must technical trading",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 77,
      "start_timestamp": "01:08:32",
      "start_timestamp_seconds": 4112.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4112"
    }
  },
  {
    "text": "some of the the primary tools that I generally also use which I think is just a indication of how universally they can be applied depending on you know your trading approach but I'm really curious if again if you were to give a handful of your must technical trading tools what are those obviously price only price pays I had to throw that in there at some point price volume some moving averages simple moving averages whether it's simpler exponential as irrelevant multiple time frames anchored volume weighted average price and the lower tiered ones I do a little bit of Fibonacci stuff just general retracements pivot levels as I discussed and what else sometimes I look at a volume volume by price seldom but sometimes I look at that so the keys are price multiple time frames moving averages volume volume weighted average price got it and just at a curiosity how did you come across like how did that anchor at VWOP find its way into your toolkit because I actually found that to be pretty unique to you other people will talk about it but like that also came through when I was reading some of what what you talk about and I found that interesting because a lot of people talk about VWOP but not everybody actually ties it to an anchor so how did that come to how did that come to be well in 2003 I was trading on a platform called RealTick",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 77,
      "start_timestamp": "01:09:38",
      "start_timestamp_seconds": 4178.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4178"
    }
  },
  {
    "text": "what what you talk about and I found that interesting because a lot of people talk about VWOP but not everybody actually ties it to an anchor so how did that come to how did that come to be well in 2003 I was trading on a platform called RealTick and RealTick had you know the daily volume weighted average price on there that represented it as a moving average it's not a moving average but it represented like one on your chart and then they had a trend tool called you know that you could drag from left to right it would show up as a horizontal line and when I drag it across the screen it would go up and down and it would keep hitting at prices so it was actually a volume weighted average trendline that were it was kind of weird to analyze but then I started playing with the when I had the volume weighted average price on a chart I realized that if I changed the time frame to like 10 minutes and went back 10 days it would give me the 10 day volume weighted average price so I started just I would play around with the date in the time frame to see hey well from that earnings report I wonder what the volume weighted average price was that was 13 days ago so I'd have to just switch it to a 13 day view and it allowed me to basically",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 77,
      "start_timestamp": "01:11:05",
      "start_timestamp_seconds": 4265.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4265"
    }
  },
  {
    "text": "would play around with the date in the time frame to see hey well from that earnings report I wonder what the volume weighted average price was that was 13 days ago so I'd have to just switch it to a 13 day view and it allowed me to basically anchor from that point so I started noticing how how relevant it was to price action that institutions were either defending it or you know on the on the long or short side and it became you know like a hidden point where buyers and sellers would show up so I you know kind of played around with that for a while and and asked RealTick if they could you know build it as a tool that you could anchor from any point they never did it but Tc2000 did about five years ago and they put it on as the volume weighted average price by alpha trends that's my handle and now it's you know point and click and it's on you know from from that introduction about five years ago it's now on about a dozen different platforms where you can very easily anchor from any point forward to understand who's in control with absolute 100 certainty from any point in time right that it's not a subjective analysis tool it's factual supply and demand that's fascinating and what time frame do you normally like to use for your anchor whatever's relevant I put them on a a",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 77,
      "start_timestamp": "01:12:05",
      "start_timestamp_seconds": 4325.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4325"
    }
  },
  {
    "text": "to understand who's in control with absolute 100 certainty from any point in time right that it's not a subjective analysis tool it's factual supply and demand that's fascinating and what time frame do you normally like to use for your anchor whatever's relevant I put them on a a chart from five years ago where there was a significant high and maybe it's you know undergone a long-term accumulation it pops up and you'd be surprised it hits it to the T you know runs 20 hits that VWAP from the peak five years ago and then pulls back I mean it's crazy so I'll look at them I want to be aware of all the time frames generally speaking now it's not often I go to a weekly time frame and look to anchor something but if I can't find it on my daily chart I want to be aware of what's on the bigger picture is there's something there I should be aware of that has the potential to become support resistance the longer it's been out there the less likely it's going to have current memory attached to it but there's still people like myself who will look at it and decide not to buy because it's close to that or to take some profits because it's close to that level so intraday you know I like to use it on by you know 15-minute time frames or 30-minute time frames so I can see the",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 77,
      "start_timestamp": "01:13:13",
      "start_timestamp_seconds": 4393.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4393"
    }
  },
  {
    "text": "will look at it and decide not to buy because it's close to that or to take some profits because it's close to that level so intraday you know I like to use it on by you know 15-minute time frames or 30-minute time frames so I can see the height 20 days ago and the low eight days ago and how they converge together to form you know a volume-weighted average price pension you know you can see factually that transition supply controlled market to demand you know reaching that equilibrium the the battle reaching the equilibrium and then where demand retakes that control with again 100 certainty that the average price from that point the buyers are in control right right that makes it's on a sense and then another question I have is where do Fibonacci's fit into this because you were kind of mentioning that they're like a secondary tier where do those of it in real? Well at times I'll just use them as a again second tertiary tier level that I'll see the stock that goes from 28 to 35 and then it pulls back to the rising 20-day moving average and I'll look at the 28 to 35 and I'll put a Fibonacci and say hey it's right there at the 61.8 retracement so I want to look at and say you know what's the psychology of the rising 20-day moving average okay the psychology is shorts will cover as it approaches that",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 77,
      "start_timestamp": "01:14:30",
      "start_timestamp_seconds": 4470.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4470"
    }
  },
  {
    "text": "at the 28 to 35 and I'll put a Fibonacci and say hey it's right there at the 61.8 retracement so I want to look at and say you know what's the psychology of the rising 20-day moving average okay the psychology is shorts will cover as it approaches that longs will you know try to establish support for their bigger position in their sideline money will come in shorts will not want to short it so it's a transition of supply and demand at this level deemed important by the market a smaller piece is a 61.8 retracement level when it pulls back there the people account your trend shorts will say hey we should cover it's a 61.8 pullback it's still in a primary uptrend let's take our profits a big institution will say hey it's pulled back 61.8 we've got five million shares this thing we sold 300,000 let's bid for a hundred thousand so it sticks in this level sideline cash will come in and say hey I'm a Fibonacci guy I buy 61.8 retracements so it's all about trying to determine how the psychology and supply and demand comes together through those various participants to form the basis of hey we're at an inflection level potential support because it's the 20-day moving average because it's the VWAP from that prior low and it's the 61.8 retracement so we have three different groups of participants long short and cash coming together in the same area to",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 77,
      "start_timestamp": "01:15:39",
      "start_timestamp_seconds": 4539.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4539"
    }
  },
  {
    "text": "form the basis of hey we're at an inflection level potential support because it's the 20-day moving average because it's the VWAP from that prior low and it's the 61.8 retracement so we have three different groups of participants long short and cash coming together in the same area to to find the same conclusion that one we shouldn't sell short or if we were short we should cover if we're on the sidelines and cash maybe we start to nibble and you know just forms that psychology the I'm sorry the the picture of supply and demand by understanding you know the motivations of the participants right and then can you settle a debate do you like to draw your Fibonacci's from highs and lows or from close and opens a highs and lows yeah I like to encompass the whole range and same is true for the VWAP you know I want to know the I want to know the psychology of all the participants within that range got it that makes it ton of sense okay cool so I wanted to wrap things up being mindful of your time and one of the couple last questions I had for you is obviously looking back 2020 2022 just really unique time frame you know in the markets even from the covid drop to the parabolic recovery but I'm curious to get just your general sentiments you know again just looking through your paradigm at the markets what did",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 77,
      "start_timestamp": "01:16:57",
      "start_timestamp_seconds": 4617.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4617"
    }
  },
  {
    "text": "had for you is obviously looking back 2020 2022 just really unique time frame you know in the markets even from the covid drop to the parabolic recovery but I'm curious to get just your general sentiments you know again just looking through your paradigm at the markets what did you what stood out in 2021 and what was kind of something either that was impactful that you didn't expect anything like that um I think that there's you know a lot of things you can look at in the market and you know learn lessons from and to me that it's just kind of reiterating what I kind of already know that you know it to me it doesn't make sense to buy dips that people fall in love with names again going back to some of these leaders that that have been hit so hard down 50 80 and people are stuck on zoom and peloton and paypal and you know the list goes on and on and on uh so you know staying true to the trend rather than the story is what helps me avoid losing money more than anything and then focusing on the stocks that are in those low risk positions and to me it's you know I I don't I'm not a person that has grand you know themes for next year I think that they're kind of foolish to to do for my time frame I have the ability to be flexible",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 77,
      "start_timestamp": "01:18:06",
      "start_timestamp_seconds": 4686.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4686"
    }
  },
  {
    "text": "that are in those low risk positions and to me it's you know I I don't I'm not a person that has grand you know themes for next year I think that they're kind of foolish to to do for my time frame I have the ability to be flexible if my time frame is three to eight days why on earth would I try to project something a year out and say well my price target for the SP this year and I think these industry groups are going to lead or whatever it's got nothing to do with how I put money into the market and move it in and out so to me it's always about staying true to the process staying focused on being religious about cutting losers position sizing you know risk management money management in terms of overall portfolio in in one position when do I hit the gas when when the light is green and when do I slow down and and just nibble on things uh on tester pieces to you know I I would still want to be involved in the stock but the market's not really showing me good signs so I I'd hate for it to go without me but I want to be involved without a lot of risks so taking smaller positions and just being flexible I think is is what I want to be able to continue to do is is to you know I hate",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 77,
      "start_timestamp": "01:19:31",
      "start_timestamp_seconds": 4771.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4771"
    }
  },
  {
    "text": "so I I'd hate for it to go without me but I want to be involved without a lot of risks so taking smaller positions and just being flexible I think is is what I want to be able to continue to do is is to you know I hate to repeat myself over and over again but I want to objectively listen to the market as best I can and not force my opinions but find those low risk high probability setups cut my losers quickly if the market tells me to and and you know do the best job I can holding is big a piece for as long as is the trade lets me right right so you hit a little bit of kind of you know your time frame that you like to look at so don't have to go into specifics here but for the last question I am curious when you're like just getting ready for 2022 what kind of things come into your mind obviously not necessarily talking about price prediction market drops you know stuff like that but just you know when we're looking at the next year what are some factors that you're integrating into that lens well I think it's more about you know having my mind in a good place and being well rested and you know not deviating from my plans and making sure that I've done the homework the night before so that I'm thoroughly prepared for",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 77,
      "start_timestamp": "01:20:37",
      "start_timestamp_seconds": 4837.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4837"
    }
  },
  {
    "text": "that you're integrating into that lens well I think it's more about you know having my mind in a good place and being well rested and you know not deviating from my plans and making sure that I've done the homework the night before so that I'm thoroughly prepared for the next day that I'm staying healthy that I'm you know I've been doing it long enough that it's it's it's not about hey I need to read a new book about money management it's about am I holding myself accountable to the truths that I know and they're not letting myself get distracted by something on you know I don't I don't watch CNBC because it doesn't help me it in fact hurts me and not because it's bad information but it just it distracts me right and and someone will be talking about a stock I'll pull it up I'll be bored and I'll trade it and I'll lose money because I haven't done the work not letting Twitter become a distraction not for me it's about tuning out the outside noise making sure that my mind is in a place where I can perform at my best making sure I know that I can execute what I know that I've learned through a lot of hard experience cutting the same same things we've been talking about yeah I actually really like that I think that's like a great ending note to focus more on your personal game",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 77,
      "start_timestamp": "01:21:44",
      "start_timestamp_seconds": 4904.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4904"
    }
  },
  {
    "text": "making sure I know that I can execute what I know that I've learned through a lot of hard experience cutting the same same things we've been talking about yeah I actually really like that I think that's like a great ending note to focus more on your personal game plan and less on the external noise yeah so I think I think a lot of people get wrapped up in that even myself included sometimes I know when AMC was going crazy at the beginning of the year and you know I wasn't participating I was watching it very closely and then I started nibbling and the trade worked out thankfully but you know what I mean that's exactly what you're talking about I was definitely paying a lot of attention to external noise little FOMO came in so I started nibbling but that can be dangerous so again that's the degenerate in me coming out yeah we if he lives in there but this thank you so much for taking some time to chat with us the the perspective you bring I really think it's fascinating and I think it's something that a lot of people that follow the at least my channel are interested in because I again have a certain lens that I apply to the market but your lens also applies to a lot of people and I mean I'm even excited to learn more about what you do when you're expertise so thank you",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 77,
      "start_timestamp": "01:22:52",
      "start_timestamp_seconds": 4972.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=4972"
    }
  },
  {
    "text": "the at least my channel are interested in because I again have a certain lens that I apply to the market but your lens also applies to a lot of people and I mean I'm even excited to learn more about what you do when you're expertise so thank you for taking some time to hang out yeah thank you so much Eric and you and all the vets out there that you know I've made sacrifices in ways that I can't begin to realize so I appreciate that and you know there's all kinds of ways to the finish line here in the market and you know that one of the things I would encourage people to do is to make sure that you find one that's truly suitable to your personality and you know figuring out what your time frame is and you know tuning out noise and just being as objective about the you know getting the results as possible yeah well thank you and we definitely you know appreciate you taking the time to to share what you know with us and your expertise and definitely would love to have you on again one time we were talking a little before about you and maybe looking at some charts and having you walk us through well specifically walk me through because I would love to learn you know more about your approach and what not I think that'd be a great time that's where I'm at",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 77,
      "start_timestamp": "01:24:03",
      "start_timestamp_seconds": 5043.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=5043"
    }
  },
  {
    "text": "were talking a little before about you and maybe looking at some charts and having you walk us through well specifically walk me through because I would love to learn you know more about your approach and what not I think that'd be a great time that's where I'm at my best Eric that's all perfect that lines up beautifully because I love being a student so I'm looking forward to it very cool thanks again all right thanks Brian",
    "metadata": {
      "video_id": "_bB29g2ofI0",
      "title": "Expert Guide to Technical Analysis with Brian Shannon",
      "url": "https://www.youtube.com/watch?v=_bB29g2ofI0",
      "upload_date": "",
      "duration": 5133.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 77,
      "start_timestamp": "01:25:09",
      "start_timestamp_seconds": 5109.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_bB29g2ofI0&t=5109"
    }
  }
]