[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you all all more time on the elements that are productive. That's the entire goal here. And that's why you see this structure. I'm not gonna go through this whole thing again. This is in that other video that I shared. You can go through that in detail. But I wanna highlight these three main stages when it comes to the idea of managing a portfolio. I always start with a high level overview of just what I think is going on in the world. And you can see this literally starts from the economy. And then it rotates all the way through all of these down to individual events that might pertain to an individual ticker. The idea here is we do not have to become economists and thankfully so because that's a, the interesting job in some ways but a terrible job in other ways. I've not met many economists who are really big into trading. And I think there's a lot of reasons why that's the case. But understanding what the current economic state is super important and I'll give you an example. If I told you, let's say if I was your friend coming to you and it was just like, yo, I have a great idea. Right now I really want to buy anything that's generally related to domestic automotive",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 53,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=0"
    }
  },
  {
    "text": "economic state is super important and I'll give you an example. If I told you, let's say if I was your friend coming to you and it was just like, yo, I have a great idea. Right now I really want to buy anything that's generally related to domestic automotive manufacturing. I think that that's a great space right now. That's what I want to buy. This will probably be like a six month thesis. What do you think? If that was my friend and they came to me with that, I wouldn't tell him no. I wouldn't say that won't work. But what I would say is something like, are you aware of the current tariff landscape and then the potential impacts that that might have on your investment idea? Right? So unlike Reese who is going to be a dickhead to his friends, I like to be nice to my friends, to Reese's point joking aside, I definitely would encourage them to conduct their own research, but I think it's useful at least to in that context. Give them an idea of what they might look at, right? Because if you don't know what to look at, it's really overwhelming. So that stuff aside, if we take a look at the economy right now in the broader macroeconomic picture, we know that tariffs are definitely topical right now, super topical, it matters a lot. Because when we have things like tariffs, they cause a lot of short-term impacts.",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 53,
      "start_timestamp": "00:12:00",
      "start_timestamp_seconds": 720.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=720"
    }
  },
  {
    "text": "really overwhelming. So that stuff aside, if we take a look at the economy right now in the broader macroeconomic picture, we know that tariffs are definitely topical right now, super topical, it matters a lot. Because when we have things like tariffs, they cause a lot of short-term impacts. Guess what that is? Is this me knowing all of the details of tariffs and the impacts of reciprocity and what tariffs do for productivity and all that stuff? No, not in the least. What you'll find is as a trader, you become a generalist. You know a little bit about a ton of shit. So in this case, I essentially know that tariffs, fortunately, I know a little more than that, about tariffs because I spent a while studying them, but let's say if I was just a standard trader, I knew tariffs were going on. I don't have to know all the details to know that there's an impact to stuff. So then as I'm looking at different trade ideas, that's gonna still impact the way I look at them. It's the same thing with basics, like looking at GDP. Are we in a generally growing or contracting economy? I don't have to know all the ins and outs of GDP. I don't have to know that GDP is kind of a bullshit figure that includes a lot of federal spending on internal projects that really doesn't ultimately add value. I don't have to know that. I just",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 53,
      "start_timestamp": "00:13:32",
      "start_timestamp_seconds": 812.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=812"
    }
  },
  {
    "text": "economy? I don't have to know all the ins and outs of GDP. I don't have to know that GDP is kind of a bullshit figure that includes a lot of federal spending on internal projects that really doesn't ultimately add value. I don't have to know that. I just have to know that if this general metric is growing, that tells me one thing versus if it's flattening, versus if it's going down, then that still informs my position. So that's what happens in this disposition stage. I am literally creating context and a disposition towards all of these individual things. And you guys see me do from the market, indices, sectors, subsectors, themes. You see me do this multiple times per week on the various live streams, because I literally am, this is my process. This isn't like a process that I put together is something that's conceivable and could work. Like this is what I do. So that's why you see this happen very regularly. Because it's exactly how I interact with the markets. So the entire purpose of the disposition stage is to give you context around different things because when we click down one level to the portfolio, now we're looking at based on my current analysis of the landscape, what am I holding? And does it align with my current analysis of the landscape? So again, going back to the tariff example, using a simple example. If I looked at my portfolio right now,",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 53,
      "start_timestamp": "00:14:43",
      "start_timestamp_seconds": 883.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=883"
    }
  },
  {
    "text": "to the portfolio, now we're looking at based on my current analysis of the landscape, what am I holding? And does it align with my current analysis of the landscape? So again, going back to the tariff example, using a simple example. If I looked at my portfolio right now, and it was just all long US based car manufacturers, two of them, I guess Tesla as well. Let's just get rid of Tesla from the equation. We'll focus more so on like Ford and GM. I would be nervous. I would say, well, I don't know if this is really the right place for that money. There's going to be a lot that's likely coming down the pike relative to these. So the disposition stage informs how we build a portfolio that reflects our ideas. The other thing a portfolio at the portfolio level that we need to establish is what is this portfolio supposed to do? The funny thing about what I just said there is probably one of the most no shit Sherlock things I could say. What is the portfolio supposed to do? Yeah, got it. But if I actually go through and I have conversations with each and every one of you, I literally will guarantee that I will find inconsistencies in what you're doing and what you think you're doing and what you're trying to do. Because I do this a lot with a lot of people and I've never met somebody so far",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 53,
      "start_timestamp": "00:15:56",
      "start_timestamp_seconds": 956.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=956"
    }
  },
  {
    "text": "with each and every one of you, I literally will guarantee that I will find inconsistencies in what you're doing and what you think you're doing and what you're trying to do. Because I do this a lot with a lot of people and I've never met somebody so far that has had a completely coherent portfolio approach across the board. This is because there is a massive injection of desire. What we want. I want to make X percent per month. Okay, what's that number? I would like to make 5 per month. Okay, do you want to make 5 per month every single month or do you want to make 5 per month on average over 36 month time span? I want to make it every month. Okay, this starts to get really challenging. That's not to say that that couldn't be done. That's a very aggressive return, by the way, like a very aggressive return. So then it starts to beg a lot of different questions. Is it feasible to have a 5 portfolio return per month on average over a long-term time frame? Sure, absolutely. It is reasonable to do that. But what it's going to take to get there is probably a very high risk of ruin and insanely high portfolio volatility. And that same person that typically says I want 5 per month, well, they want to be able to do it every single month. Well, that immediately tells us we actually want less",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 53,
      "start_timestamp": "00:17:23",
      "start_timestamp_seconds": 1043.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=1043"
    }
  },
  {
    "text": "take to get there is probably a very high risk of ruin and insanely high portfolio volatility. And that same person that typically says I want 5 per month, well, they want to be able to do it every single month. Well, that immediately tells us we actually want less volatility in the portfolio. So we're starting to build some inconsistencies right from the jump in terms of what we're trying to do. So the very first stage of portfolio management, the very first thing we need to do is clearly define what the portfolio is supposed to do. And then fact check it. Does this shit make sense? So I think it's a perfect spot for us to start. Let's have a conversation around deciding what the portfolio is supposed to do. I can get rid of all this stuff. So in the chat for anybody, any of the brave souls out there, I would love to have a quick back and forth dialogue and use hopefully your scenario as an example. So if anybody has an idea of like, what's the goal for your portfolio? How would you answer that question? And then I'm going to extract out pieces from that answer to build the scenario. And realistically, it should be a very simple answer. And you'll see why. It's not simple for people because we don't actually know what to look at, but we'll figure it out. So we pretty much just need to figure out this",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 53,
      "start_timestamp": "00:18:50",
      "start_timestamp_seconds": 1130.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=1130"
    }
  },
  {
    "text": "pieces from that answer to build the scenario. And realistically, it should be a very simple answer. And you'll see why. It's not simple for people because we don't actually know what to look at, but we'll figure it out. So we pretty much just need to figure out this first step of managing a portfolio is define our goals. The reason why this comes first is because this is literally going to inform every other step of the way. How much money we need to use, what things we're going to put the money in, what kind of strategies we're going to use, what kind of time frames are we going to use? All of those subsequent details that come out when we're building a trading plan and strategy outlines are going to be informed from this very section here. So the way to think about answering this question, when we're trying to decide portfolio goals, here's some basic places to start. And it's going to be specific to you. But the first one is going to be a percent return. The next is some sort of volatility measure. The next is some sort of you can either bake it into the volatility measure or not, it's up to you, but consistency. Between these three broad buckets, you can pretty much define most portfolio goals with a response to any of these. As long as you have something done, so like for example, let's go back to that original",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 53,
      "start_timestamp": "00:20:18",
      "start_timestamp_seconds": 1218.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=1218"
    }
  },
  {
    "text": "it into the volatility measure or not, it's up to you, but consistency. Between these three broad buckets, you can pretty much define most portfolio goals with a response to any of these. As long as you have something done, so like for example, let's go back to that original example. If that person says I want to make 5 per month, we don't immediately start from the scenario of that's not possible, that's a terrible mindset. I always start from the context of, okay, let's just take that at face value and let's see what else might have to go into place in order for this to be possible. So then if I asked this person again, what kind of portfolio volatility are you willing to endure? This can be things like max drawdown. This can be standard deviation. There's a lot of different ways that you can calculate portfolio volatility, a really simple one I think is max drawdown at the portfolio level. So if we do max drawdown at the portfolio level, this gives us some sort of volatility measure. And then the other thing I already told you is the consistency, is this something that we're trying to do every month? Or is this something that we're trying to do on average over a period of time? And the responses to these give us a lot of initial context. Then there's more qualifying components to this. There's things like involvement. Because there are a lot of",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 53,
      "start_timestamp": "00:21:40",
      "start_timestamp_seconds": 1300.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=1300"
    }
  },
  {
    "text": "trying to do every month? Or is this something that we're trying to do on average over a period of time? And the responses to these give us a lot of initial context. Then there's more qualifying components to this. There's things like involvement. Because there are a lot of traders that have seen different YouTube shorts and Twitter clips or Twitter twitch, not even twitch. What am I thinking of? What's that other TikTok? That's what we're going for. TikTok, we've seen enough TikTok where we think that the idea of a bunch of money in a very little amount of time with very low effort is reasonable. So then a lot of people will also say, well, I don't want to spend a lot of time. Which starts to make all of this increasingly challenging. So when we're talking about our portfolio goals, we need to talk about them in the context of these general buckets. And we need to understand the trade-offs between them. If I want to have a higher percent return, I am inherently going to have to be way more involved. It's going to be way more difficult for me. I'm going to have to probably expect less consistency, higher volatility in my returns. That's the equation you're looking at here. So as per usual, with the world of trading, it genuinely is a choose your own adventure. But going back to my original point where a lot of traders get stuck up because",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 53,
      "start_timestamp": "00:23:13",
      "start_timestamp_seconds": 1393.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=1393"
    }
  },
  {
    "text": "to probably expect less consistency, higher volatility in my returns. That's the equation you're looking at here. So as per usual, with the world of trading, it genuinely is a choose your own adventure. But going back to my original point where a lot of traders get stuck up because of the things that they want to do. You can want different stuff, that's okay. But then you do have to actually do the analysis of, is this reasonable? Can I do this? And this is what leads to that. So Philips says, I want consistency over two years, 25 growth within 24 months. And I think, for somebody like Philip, depending on what consistency means, right? So these are different broad-based terms that we have to define for ourselves. What is consistency? Is consistency hitting that return? And then on average, getting that 25 growth within 24 months? Or is it not having your portfolio value moved by X bans? Is it each strategy that you put on, maintains within a specific expected return range? Right? So like, there's a million different things that would go into defining consistency. And to define it is super important because when we're setting out our portfolio objectives and defining these goals, this is literally what you're evaluating yourself against. This is then how you figure out if what you're doing is correct or incorrect. Because remember, if you think about a standard business, they have a very clear picture. The goal of",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 53,
      "start_timestamp": "00:24:39",
      "start_timestamp_seconds": 1479.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=1479"
    }
  },
  {
    "text": "setting out our portfolio objectives and defining these goals, this is literally what you're evaluating yourself against. This is then how you figure out if what you're doing is correct or incorrect. Because remember, if you think about a standard business, they have a very clear picture. The goal of a business is to increase sales, ultimately increase revenue. That's what most of them are pushing for. But there's no business owner here besides you. You have to set all of these things for yourself. Because otherwise you wind up like another random trader out there in the ether. That's just kind of going through it. And we're seeing how it goes, which is a really, really inconsistent way to go about this kind of thing. So now that we have a concept of our goals, we know that we're probably going to want to define some sort of percent return. We know that we're going to want to define some sort of max drawdown. I refer to this as a portfolio circuit breaker. I'm going to have to acknowledge my tolerance when it comes to consistency. And I mean, I already am obviously about as involved as you can get. But for everybody else, you have to figure out how much time can you consistently run with something like this? So why not says for five K a month average, probably needs 200 to 300 K capital. I think you are probably grossly under valuing how much you probably",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 53,
      "start_timestamp": "00:26:22",
      "start_timestamp_seconds": 1582.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=1582"
    }
  },
  {
    "text": "get. But for everybody else, you have to figure out how much time can you consistently run with something like this? So why not says for five K a month average, probably needs 200 to 300 K capital. I think you are probably grossly under valuing how much you probably need. So let's do a little bit of math. I got to pop the door for Thor. So let's just let's do a little bit of quick math. So effectively, we're saying, let's call it a 300,000 account. And we're talking about getting 5,000, 3.3 return. On a monthly basis, 3.3 return is a 47.6 return. So then for why not, that becomes the next question is, how reasonable would you find it to be to maintain essentially a 49 return consistently? And then therein lies the answer to your question. This is one of the most overlooked elements of planning. How we're using a portfolio. And funny enough, this is literally probably one of the most important elements of planning a portfolio. Because coming up with an idea of what you're trying to do, automatically informs how much of your portfolio you're going to be doing and using to attempt to capture whatever it is that you're trying to capture. So another thing to keep in mind for why not, right? Like that scenario of 5,000 a month, 5,000 a month on a 300,000 portfolio literally means that you have to maintain a 47.6 return every year. Pretty challenging.",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 53,
      "start_timestamp": "00:27:40",
      "start_timestamp_seconds": 1660.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=1660"
    }
  },
  {
    "text": "attempt to capture whatever it is that you're trying to capture. So another thing to keep in mind for why not, right? Like that scenario of 5,000 a month, 5,000 a month on a 300,000 portfolio literally means that you have to maintain a 47.6 return every year. Pretty challenging. I would argue it's literally better than my return. And that's including the last two years for me, which have been anomalies. I don't say that is in, you can't beat me. It's entirely possible to beat me. I do not pursue top line performance. So I don't say it in that vein of saying, like, well, if I can't do it, you can't do it. That's not it at all. I actually think it's quite reasonable to beat my return. The thing that I bring it up, those for context, because most people who say stuff like that literally just lack context and an understanding of what goes into that kind of return. But that's a near 50 return, which is industry leading and then some that also opens up another really important differentiation when we're talking about trading and really aggressive returns. Because if we take a look at, again, that return that we're talking about, which is called 48, is it possible to get a 48 return? Definitely. I've had multiple years that are greater than 48 absolutely possible. That I can say with confidence. The difference though is that it ain't consistent. So when we're trying",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 53,
      "start_timestamp": "00:29:56",
      "start_timestamp_seconds": 1796.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=1796"
    }
  },
  {
    "text": "at, again, that return that we're talking about, which is called 48, is it possible to get a 48 return? Definitely. I've had multiple years that are greater than 48 absolutely possible. That I can say with confidence. The difference though is that it ain't consistent. So when we're trying to get really aggressive returns like this, our consistency is going to plummet. So comparatively, if we're using why not scenario of trying to take in 5K per month, and we're trying to think of the context of consistency, well, let's think about it. What percent return do we think is likely going to be more consistent for us? I can literally tell you it's not even a market return. If you're trying to return in line with the SP 500, let's just call it 10 per year, that in and of itself is going to be quite inconsistent. You can see the volatility that the market has. So unless you become a wildly adept trader, which is possible, you still are going to have some pretty serious volatility even if you're chasing a market return. So when I'm thinking about a higher value on consistency, that necessitates a nearly insultingly low target. But the reason for the nearly insultingly low target is because you'll notice that that low target is actually pretty hard to do consistently. Because when the market starts rolling over, it requires a lot of adjustments in the ability to trade a completely different market really",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 53,
      "start_timestamp": "00:31:12",
      "start_timestamp_seconds": 1872.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=1872"
    }
  },
  {
    "text": "insultingly low target. But the reason for the nearly insultingly low target is because you'll notice that that low target is actually pretty hard to do consistently. Because when the market starts rolling over, it requires a lot of adjustments in the ability to trade a completely different market really effectively. And then the duration of the downturn, whether it's just a short-term correction that then turns into a broad market rally the rest of the year. We've seen a couple of those recently. Or if it's the other scenario where we delve into a broad-based bear market that lasts the average 298 days, we don't know. But you have to be able to play all of those different variations of the scenario. So the main point of all of that is that the more you value the consistency, the lower you need to enable yourself to aim in order to hit the consistency metric. If you're okay with a little more volatility in your returns, then sure, it definitely becomes possible. Like if I was thinking of why not scenario with at least a bit more money, then it becomes definitely very reasonable. But the other thing people don't account for is unfortunately, tax man, because if you make 5,000 or 5,000, if you make 5,000 and let's say that you're not old enough, hopefully you're not old enough, to be able to withdraw it from a Roth IRA, then you're also going to have to account for friction.",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 53,
      "start_timestamp": "00:32:35",
      "start_timestamp_seconds": 1955.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=1955"
    }
  },
  {
    "text": "account for is unfortunately, tax man, because if you make 5,000 or 5,000, if you make 5,000 and let's say that you're not old enough, hopefully you're not old enough, to be able to withdraw it from a Roth IRA, then you're also going to have to account for friction. The tax is that you're going to face so that you can actually pull 5K. So I know it's not a really good thing to have a really fun or sexy answer, but there's one thing I want to circle us back to, hopefully, is that if in the beginning you embrace a higher return, higher volatility, lower consistent style approach that allows you to achieve a much higher return, if you maintain that much higher return, you go parabolic as compounding really turns on. The cool part about going parabolic is going parabolic and that means that for each subsequent year you're maintaining that system and that approach, it means that you are massively changing the gross number of dollars you have at your disposable income. So if you successfully do that, then you don't have to play the game of, well, I only have 300K and I want to make 5K per month. That literally becomes a non-factor and you're talking about this more so from this scenario of, I have 3000K, which is 3 million, and I'm trying to make 5K a month. Then all of a sudden it becomes easy, it literally becomes simple. So a",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 53,
      "start_timestamp": "00:33:51",
      "start_timestamp_seconds": 2031.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=2031"
    }
  },
  {
    "text": "to make 5K per month. That literally becomes a non-factor and you're talking about this more so from this scenario of, I have 3000K, which is 3 million, and I'm trying to make 5K a month. Then all of a sudden it becomes easy, it literally becomes simple. So a lot of traders, newer traders, they focus, I think, a little bit too much on what the early exit looks like for them and what's the lowest amount of money they can use it used to get there. And it really jeopardizes the broader path that I think is much more of a high likely outcome. Because if we take a look at that same scenario at a curiosity and let's say we have 3 million to hit that, that brings us down to 0.3, 0.333, that's a 4.1 return. Now obviously that's really low. But the main point that I'm making though is that you really give yourself a much better potential outcome in this scenario. And that's, I mean, honestly, that's the goal. The higher the outcome potential in terms of probability you can give yourself, you're gonna be just so much better off in that sense. So yeah, I feel some type of ways, sometimes when we do these, because I really don't like to make people feel like, oh, this is impossible or there's no path for me here that's definitely not it. But it is the case that you typically need more money than you",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 53,
      "start_timestamp": "00:35:22",
      "start_timestamp_seconds": 2122.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=2122"
    }
  },
  {
    "text": "yeah, I feel some type of ways, sometimes when we do these, because I really don't like to make people feel like, oh, this is impossible or there's no path for me here that's definitely not it. But it is the case that you typically need more money than you think. But by giving yourself more money, it gives you such a higher probability of this thing working out in your favor. And that's kind of the main message there. Ben says, I don't understand how this stuff doesn't just reflect your strategy. You're talking about the portfolio level, right? Like all these portfolio level details, how this doesn't reflect your strategy? Is that, let me grab this by the way. You need to move this over here. Okay, that's a great question. So for anybody else in the chat, how would you answer Ben's here? Ben is essentially saying, well, doesn't your portfolio or doesn't your strategy represents all of this stuff that we're talking about relative to the portfolio? So what would we say to him? Ben says, portfolio is the highest level than strategies later. So you're kind of highlighting some of it. Ben, the way that I would answer you here is how do you decide what the strategy is? How do you pick that? How do you build the strategy? Additionally, I would say, how many strategies do you think that you're going to trade? Right? The point that I'm making is that in order",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 53,
      "start_timestamp": "00:36:53",
      "start_timestamp_seconds": 2213.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=2213"
    }
  },
  {
    "text": "I would answer you here is how do you decide what the strategy is? How do you pick that? How do you build the strategy? Additionally, I would say, how many strategies do you think that you're going to trade? Right? The point that I'm making is that in order for a portfolio from a trader's lens to do what we need it to do over the course of a year and many years hopefully after that, is we need the ability to trade. So I'm going to say, hopefully after that is we need the ability to trade different kinds of market conditions which requires different strategies. So if it becomes a chicken in the egg problem because if we have no goals that we're attempting to create like the whole point of this section here of defining goals for the portfolio is to then inform what kind of strategies we even need. Because let's say for example, that you're comfortable with really high portfolio volatility, you're comfortable with having negative years but you want to maximize your total return potential. Well, you probably don't have to spend a lot of time then trying to figure out how to trade volatility. Doesn't really apply that much in that kind of scenario. You're going to be way better off and more likely to hit those goals if you're spending your time to find the next 10,000 baggers that exist and there are traits that are common among them. But in",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 53,
      "start_timestamp": "00:38:35",
      "start_timestamp_seconds": 2315.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=2315"
    }
  },
  {
    "text": "trade volatility. Doesn't really apply that much in that kind of scenario. You're going to be way better off and more likely to hit those goals if you're spending your time to find the next 10,000 baggers that exist and there are traits that are common among them. But in your pursuit of getting 10,000 baggers, you might go two years being unprofitable or slightly unchanged and then you might have that third year that recovers the two years prior and then puts you in the black in terms of returns. But all of that is informed at the portfolio level. So if you choose to try to build it into the strategy, the strategy has to reflect your portfolio level imperatives. We actually talked about this not that long ago. For example, if I'm trading, I gave you the example with the max drawdown using something like the coverage strangle, right? Because the scenario was if we scale into the coverage strangle too much and we're planning for a 90 drawdown potential in something like T-Triple Cues. And if we put in too much money that then automatically exceeds our max drawdown tolerance, we've now created an inconsistency in the portfolio. So the really the whole point of this is to have a clearly defined overarching plan so that then we can figure out how to use the individual pieces, which the individual pieces in this context are the strategies. It's a really good question. But that's why I",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 53,
      "start_timestamp": "00:40:02",
      "start_timestamp_seconds": 2402.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=2402"
    }
  },
  {
    "text": "the portfolio. So the really the whole point of this is to have a clearly defined overarching plan so that then we can figure out how to use the individual pieces, which the individual pieces in this context are the strategies. It's a really good question. But that's why I start at the portfolio level. Okay. So we've talked about all this. I don't want to spend time on this. This doesn't matter. Let's talk about managing risk. That's a big part of a portfolio. So we talked about the portfolio giving us context on what we're trying to earn as a return. And then we also included two risk measures, volatility and max drawdown. So there are a bunch of different ways. You can go about determining what risk you're comfortable with in your portfolio. That's not for the scope of this video. But the important point here, it's just like every trade you put on should have a defined P and L target. It's the same thing at the portfolio level. Because this informs a couple of things for me. One of my objectives as a trader personally is I really value consistency of returns. I've mentioned that. And I am willing to forego top line performance to instead maintain consistency in my returns. So what that means is I very rarely have a losing month, very rarely. But it means that I have to carefully measure my risk because markets can turn fast. So in my approach,",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 53,
      "start_timestamp": "00:41:26",
      "start_timestamp_seconds": 2486.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=2486"
    }
  },
  {
    "text": "And I am willing to forego top line performance to instead maintain consistency in my returns. So what that means is I very rarely have a losing month, very rarely. But it means that I have to carefully measure my risk because markets can turn fast. So in my approach, I look to use is little money as I can in order to hit my growth objectives for the portfolio. A lot of retail traders make the massive mistake of comparing their performance against a benchmark, like the SP 500. And they say things like, well, unless I beat the SP 500, then I shouldn't do this, which is a massive mistake. Because depending on what your goals are, maybe it is the case. In a lot of cases, it's not the case. What I mean by that is the SP 500, again, we know it returns about 10 per year. But we also know that so far this year, it's having a pretty bum year. If you were planning on drawing on your portfolio of SP 500 for the last three months for your monthly income, guess what's not happening? That. So there are other objectives that can inform what approach makes sense for us and how we choose to manage risk. Again, if your way to manage risk is by accepting really high volatility and then just using position sizing, yeah, that's okay. You can do that. You can do whatever makes sense for you. But for me,",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 53,
      "start_timestamp": "00:42:39",
      "start_timestamp_seconds": 2559.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=2559"
    }
  },
  {
    "text": "what approach makes sense for us and how we choose to manage risk. Again, if your way to manage risk is by accepting really high volatility and then just using position sizing, yeah, that's okay. You can do that. You can do whatever makes sense for you. But for me, I employ risk management on two different levels, specifically, the portfolio level, and then the position level. The strategy defines the position. So that's why it's like that. This is exactly how I decide the position risk has to fit within the portfolio risk. Okay. So this one is talking about things at the trade level. This is like managing risk within individual trades. So now we can get back. And I want to give it now to actually the process of like building a portfolio so that we can see what this looks like in different ways to visualize and manage it. The first thing though is I want to make sure that we have answers to these as we go over. So one of them actually from Ben from the discord was saying the top level review before assessing how to action your portfolio. Specify does or specifically does the economy review, give you any tree decision paths, which I actually think we talked a little bit about that autonomously earlier. So I think that covers that a little bit. As in, if the economy has specific things, it means specific things for my portfolio management. Yeah. So",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 53,
      "start_timestamp": "00:44:01",
      "start_timestamp_seconds": 2641.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=2641"
    }
  },
  {
    "text": "does the economy review, give you any tree decision paths, which I actually think we talked a little bit about that autonomously earlier. So I think that covers that a little bit. As in, if the economy has specific things, it means specific things for my portfolio management. Yeah. So we actually fortunately did cover a lot of this earlier. Ben, if you have follow-ups from what we discussed earlier, happy to hit those now. But this is absolutely the case. It has, it informs a lot of things from the level of how much risk are we comfortable with having out? And how is that risk allocated? What is it actually concentrated in? So I think that would be a really, really great spot actually to employ this exact thought process. But if you have any other specific follow-ups from that, happy to take a look. Then next up, we have Tommy. And Tommy says sector concentration, correlation, risk, assessment. So that one will get into in a minute using underlying betas and spy weighted delta. And then I'd like an approach to look in toss and I can manually track my spreadsheet. Okay. So from the lens of sector concentration and correlation risk assessment, we'll get that. I actually think in the example. But if you have more of a follow-up, let me know. And then we'll hit that towards the end. And then actually the same thing with betas and beta weighted delta. So I'm earmarking those",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 53,
      "start_timestamp": "00:45:16",
      "start_timestamp_seconds": 2716.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=2716"
    }
  },
  {
    "text": "sector concentration and correlation risk assessment, we'll get that. I actually think in the example. But if you have more of a follow-up, let me know. And then we'll hit that towards the end. And then actually the same thing with betas and beta weighted delta. So I'm earmarking those for the example. And then Shreys talking about duration, which we're going to cover in the example as well. Okay, great. So let's get into building an example. So let's say that I am a trader and let's say that I have a smaller portfolio. So that to me would essentially be, I mean, whatever number doesn't matter. Let's say that you're a trader that has a 25,000 portfolio, something that we might consider. Reasonable. I'm actually going to try not to draw it as much. And I want to see if I can help you visualize it this way. So our portfolio is going to be 25,000 bucks. And then from here. Let's take a look at. What our objective might be. So let's say that your goal. I'm going to use my goal for a long time because it's what served me well, which is 15 per year. So over the course of a year, I would expect to make 3750, which again, this is the unfortunate reality that makes a lot of traders uncomfortable because a lot of traders would look at that and be like, well, shit, 3750, like who cares? But what I will remind",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 53,
      "start_timestamp": "00:46:34",
      "start_timestamp_seconds": 2794.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=2794"
    }
  },
  {
    "text": "So over the course of a year, I would expect to make 3750, which again, this is the unfortunate reality that makes a lot of traders uncomfortable because a lot of traders would look at that and be like, well, shit, 3750, like who cares? But what I will remind traders is that when you have a small account, the way to get a bigger amount of money isn't to just try to get a 200 return to get something you want. It's to build the skill set that allows you to successfully continue to save money and grow your portfolio. So that all of a sudden, when you find yourself with even a 500,000 portfolio, you'll notice that like, okay, this is actually starting to become a decent amount of money that if I'm able to maintain this kind of return, this becomes quite powerful because I'll show you how this works. If we have this 25,000 portfolio, let's say we're not going to add any money just to use the example here, 20 at a 5 return variance. Let's calculate this. So notice the difference here. The difference between a 10 and a 15 return over a 20 year time frame is the difference between 168,000 versus 409,000. This is the scenario where we are adding 0, we're taking 25K over 20 years and we're just seeing what we can turn it into. Now let's take a look at how this starts to go actually parabolic. Let's say",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 53,
      "start_timestamp": "00:48:00",
      "start_timestamp_seconds": 2880.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=2880"
    }
  },
  {
    "text": "year time frame is the difference between 168,000 versus 409,000. This is the scenario where we are adding 0, we're taking 25K over 20 years and we're just seeing what we can turn it into. Now let's take a look at how this starts to go actually parabolic. Let's say we save 500 per month. Then all of a sudden, you'll notice that your 25K at 500 a month at a 15 return yields you 1 million. What most traders do instead is they decide that this return isn't good enough for them. So then they say, well, instead of this, they're misusing percentages and dollars. In this scenario, we should be focusing on percentages. When you have a bigger portfolio, you can switch to dollars. Because at this growth rate at 15, you absolutely smash the market return. And if you give your approach time to work, you literally will become a millionaire. It will happen. But most traders at this point, they say, I don't like this number. It's too low. So I'm going to try to make this number higher. So then that means that they're targeting things like a 30 return. And still, at a 30 return, you're getting 7,500. The total gross number of dollars in no way compensates for the massive amount of risk you now have to take in order to try to get to that 7,500. So anyways, that's the context here. So that's why this doesn't, this looks sad. It's like,",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 53,
      "start_timestamp": "00:49:31",
      "start_timestamp_seconds": 2971.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=2971"
    }
  },
  {
    "text": "return, you're getting 7,500. The total gross number of dollars in no way compensates for the massive amount of risk you now have to take in order to try to get to that 7,500. So anyways, that's the context here. So that's why this doesn't, this looks sad. It's like, damn, well, that's not a lot of money. But it will be in a long time, not a long time, if you consistently hit it. So that's why I care about this. So then now, let's figure out what this means. We pretty much need to get on a monthly basis. We need to get 313. Cool. So now I have a bit of a target. I'm not going into the other goals in terms of max drawdown and stuff like that, because that'll be highly individual. But I specifically want to talk about this idea of looking at the market and saying, how do I get 313 for this month in the current market? So let's just eyeball what kind of portfolio could go into doing something like that. And we can say, well, let's take a look at the, we know the broader economic landscape. I've talked about that in a bunch of recent live streams. So I'm not going to belabor that point. And let's say, okay, it looks like financials is starting to bottom a little bit. And what else do we see? It looks like comm services has been bottoming a little bit better. Utilities",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 53,
      "start_timestamp": "00:51:03",
      "start_timestamp_seconds": 3063.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=3063"
    }
  },
  {
    "text": "that in a bunch of recent live streams. So I'm not going to belabor that point. And let's say, okay, it looks like financials is starting to bottom a little bit. And what else do we see? It looks like comm services has been bottoming a little bit better. Utilities has been doing actually decent. So maybe we start looking inside utilities for an initial idea, because it's been better trending than most of these. And let's start by first just taking a look at XLU. And the implied volatility percentiles pretty high. It's 78. So then we say, okay, that's not too bad. I need to make 333. So let's now figure out if we want to do it in something like the index, which in this case, I wouldn't because I'm actually going to be probably looking at something like a vertical spread to start off. The reason why I'm looking at something like a vertical spread is because we're looking at a really small account. And I'm trying to show a specific approach that is centered on getting that dollar return for the month. If this was a real portfolio with 25k, this is not how I would go about it. Just adding that the reason why I'm going this route is because I simply want to demonstrate something to you. So with that aside, let's take a look and let's just look inside utilities. And what I would do is just eyeball some of these to",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 53,
      "start_timestamp": "00:52:07",
      "start_timestamp_seconds": 3127.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=3127"
    }
  },
  {
    "text": "would go about it. Just adding that the reason why I'm going this route is because I simply want to demonstrate something to you. So with that aside, let's take a look and let's just look inside utilities. And what I would do is just eyeball some of these to start any. They're kind of going sideways and up as oh, same. So let's take a look at a couple of these so far. What I'm going to do is I'm going to detach this. I'm going to move it off to the side so that I can reference it. And then I'm just going to flip through them. Now the way that I personally would do this is actually via scanning. I would use like bar chart or something like that, but it doesn't really matter because we're just going to pick a handful of ideas pretty quickly. So there's so there's ex we know ex he's been doing well. And they have a 32 implied volatility percentile. So let's take a look at. EXC. This we want linked. And let's take a look at a 34 day trade. And let's take a look at. A 1 wide spread. So there's 1 wide spread gives us 32 bucks. And let's take a look at what a 2 wide spread gives us 45 cents. So the 2 wide spread doesn't give us is much for the risk is I would want. So in this case, I kind of prefer a",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 53,
      "start_timestamp": "00:53:16",
      "start_timestamp_seconds": 3196.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=3196"
    }
  },
  {
    "text": "So there's 1 wide spread gives us 32 bucks. And let's take a look at what a 2 wide spread gives us 45 cents. So the 2 wide spread doesn't give us is much for the risk is I would want. So in this case, I kind of prefer a 1 wide spread might do a couple more of these. So to start us off, we're looking at a 25,000 account. We're looking at a trade that is potentially going to make us a buck 60 and it's going to risk 340. So now we have to fact check ourselves. We have to say is 340 reasonable is that a reasonable amount of risk for the portfolio size. So we have to go back over here. And we have to say, okay, for this portfolio, in this case, we're risking 340. So what is that represent as total portfolio risk? 1.36. How do I feel about that? I feel okay. I think when I look at a portfolio of this side for individual speculative trades like this, 1.36, pretty much something sub two, I think is reasonable. So let's say that we're going to just cap our risk. We'll give ourselves I typically like to have a little bit of a buffer. So this will be our annual goal. This will be our monthly goal. And I don't know why it did MTH that's weird. There's already a standard abbreviation for this. Do we have our goals? So now let's",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 53,
      "start_timestamp": "00:54:40",
      "start_timestamp_seconds": 3280.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=3280"
    }
  },
  {
    "text": "ourselves I typically like to have a little bit of a buffer. So this will be our annual goal. This will be our monthly goal. And I don't know why it did MTH that's weird. There's already a standard abbreviation for this. Do we have our goals? So now let's take a look at our risk. Let's say that we're going to absolutely cap our risk at 3. So this means per trade. We can risk up to 750 ish. We want to be on the lower side of that as much as possible. So we know in the context of this trade that we're looking at here, this absolutely falls within the bounds of the total risk. So then we can look at putting a trade like this on. We'll leave this in the total portfolio here. And let's just take a look at the idea. The idea here is we essentially want this to expire. These 43 puts we want these to expire out of the money. And right now they have about a 65 chance. 64.7 chance of that happening. Okay, cool. And it's in a sector that's been performing well. So there's our first trade. Let's find another trade. We're not yet at our 313 bucks. So for this first trade. We have our risk. Portfolio percent risk. We have our return target. And in this case, what was it 160? I think. Don't fully remember, but I think that's right. So now we are. Now",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 53,
      "start_timestamp": "00:55:51",
      "start_timestamp_seconds": 3351.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=3351"
    }
  },
  {
    "text": "find another trade. We're not yet at our 313 bucks. So for this first trade. We have our risk. Portfolio percent risk. We have our return target. And in this case, what was it 160? I think. Don't fully remember, but I think that's right. So now we are. Now we already know that we need to find a couple more ideas. So what I'm doing is I'm just creating a really simple tracker that will use to figure out what our total risk is going to be at a given point in time. How much money we think we're going to be able to make on the risk that's out. And this summary level data is ultimately what guides me. So the delta that we have on this return target as it sits right now. Is 153 bucks. So this is what we need to find out there in the market. So what other ideas do we have what ideas do you guys have? I gave you one. I would love your ideas now and to just try to integrate a couple of yours. Doesn't have to be anything crazy. And I got open the door for Thorigan. So I think that's the zero DTE long strangle SPX wildish I guess. Well, let's see. We can we can eyeball it. I'm open to ideas. So the first question is how high of a probability is the trade. Now we can't use zero DTE right because the markets now close.",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 53,
      "start_timestamp": "00:57:40",
      "start_timestamp_seconds": 3460.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=3460"
    }
  },
  {
    "text": "I think that's the zero DTE long strangle SPX wildish I guess. Well, let's see. We can we can eyeball it. I'm open to ideas. So the first question is how high of a probability is the trade. Now we can't use zero DTE right because the markets now close. So we'll just call it 3DTE. So what's the trade that you're thinking of Ben walk me through the actual position based on the options here. And then we will we'll see. Let's let's test your idea. Because it might be wildish it might not, but we don't know until we actually take a look at it. Five point each direction based on current ATR. Okay. So the current ATR for what period or are you using the actual ATR indicator. Zip so I can throw it on really fast. So there's ATR. The last day ATR. Okay. So then let's update this to be a one day. And this is what we see this kind of manila color is the ATR. So the last day here looks like it's up. So with that, what's the trade that we would put on. You're talking along strangles. So it means we have to buy what delta would we buy for the call on the put. Am any more shelter water. Normally I have a backup. Shame on me. Okay. So I'm going to add the money in the morning. So go five up five down. Okay. So I'm just going to",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 53,
      "start_timestamp": "00:59:29",
      "start_timestamp_seconds": 3569.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=3569"
    }
  },
  {
    "text": "have to buy what delta would we buy for the call on the put. Am any more shelter water. Normally I have a backup. Shame on me. Okay. So I'm going to add the money in the morning. So go five up five down. Okay. So I'm just going to wait at the money. Okay. So let's just call it. That the money here is the 47 delta. And then five. Five strikes. Like this. So in this case, we're going to pay 5,200. So let's just size the trade. Right. So we're going to have T2. And T2 will effectively take the same format as these. So we're going to have a lot of options of formula. So the risk is going to be defined by what we buy in for which is 5,200. And then the return target. What's the target return that we think that we're going to get. This isn't actually that it's just I need to lock this so. I'm going to get it. Yeah. No, I hear that. I'm asking now what the return target is. What I'm trying to do here is to help us understand. Again, like to your second comment, right? Where you said wildish. We want to actually be able to answer that question. Like is it wild? And obviously I already know the answer to this. Let's see. So here we have a scenario where we're risking 100 to make. We're risking 5,200 to make 100. So now let's",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 53,
      "start_timestamp": "01:01:40",
      "start_timestamp_seconds": 3700.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=3700"
    }
  },
  {
    "text": "Where you said wildish. We want to actually be able to answer that question. Like is it wild? And obviously I already know the answer to this. Let's see. So here we have a scenario where we're risking 100 to make. We're risking 5,200 to make 100. So now let's take a look at the probabilities here. And we'll analyze this trade. I'm going to get rid of this one for now. And we're just going to look at this one in SPX. So where do we make 100? We effectively need it to move either to 52 or. We needed to move to 22. Let's take a look. 52 or 22 within this three day time frame. 22 is like a 87 chance. And then 52 is a 90 chance based on current price. So really high probability of getting that. Now this. This doesn't include a really important element here. But let's say. Win amount. Win prob. Lost amount. Lost prob. And let's see. So what I can tell you from a portfolio level, this is going to be inherently way too big. Right. Having 20 of our 25,000 portfolio in this one trade is nonsensical. So we might say, well, I'm not planning on losing the 5,200 box. Right. We're planning on managing it. The reality is the market can move very fast. The probability of the market moving that fast is quite low. But it's not. It's not zero. So it's a scenario where the severity",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 53,
      "start_timestamp": "01:03:46",
      "start_timestamp_seconds": 3826.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=3826"
    }
  },
  {
    "text": "might say, well, I'm not planning on losing the 5,200 box. Right. We're planning on managing it. The reality is the market can move very fast. The probability of the market moving that fast is quite low. But it's not. It's not zero. So it's a scenario where the severity of the move is enough. It requires us to treat the severity of the move with respect. It means that we can't go under the assumption of, oh, this is a low probability thing. Because the severity of it, meaning the damage it can do is a lot. Ben says, sorry, I thought if it moved, it would be good. Definitely in this context with this one individual trade, that's 100 the case. The risk that this trade obviously faces if is if the market doesn't move. But my point is is, and you'll see in a second, with having 20 of the portfolio at risk in something on zero DTE, the theta on those options is going to be a roading super fast. So what what's going to happen in your scenario is this win probability of 88 is actually going to plummet very quickly throughout the day. And the reason why it's going to plummet throughout the day is because of that exact function where theta is going to be bleeding out fast. So then the amount that it's going to have to move in order to make the 100 is going to expand. So this 88 probability",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 53,
      "start_timestamp": "01:05:43",
      "start_timestamp_seconds": 3943.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=3943"
    }
  },
  {
    "text": "the reason why it's going to plummet throughout the day is because of that exact function where theta is going to be bleeding out fast. So then the amount that it's going to have to move in order to make the 100 is going to expand. So this 88 probability is really only going to be at the jump. So let's take a look, one minus this. And then let's figure out our expected return. Oops. Times this. So this is a massively negative expected strategy. Even though super high win rate, because the win is so small relative to the loss, it is a highly, highly unprofitable strategy in this context. So this obviously doesn't include any friction fees, anything like that. And just for broader context, let's do a little bit of math. And let's say how many trades does one losing trade wipe out 52. So this is an example of at the individual trade level, the strategy level. This doesn't make sense at the portfolio level. This doesn't make sense because of the size of the portfolio risk. We're talking 21 of the portfolio in an individual trade. So completely reasonable to look at. But after exploring this, I would personally refute this strategy. I don't think that this strategy would make sense. And I think that it forces us to take a lot of risk relative to what we might actually get out of it. So I personally wouldn't be a big, big fan of",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 53,
      "start_timestamp": "01:07:09",
      "start_timestamp_seconds": 4029.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=4029"
    }
  },
  {
    "text": "exploring this, I would personally refute this strategy. I don't think that this strategy would make sense. And I think that it forces us to take a lot of risk relative to what we might actually get out of it. So I personally wouldn't be a big, big fan of it. But again, completely cool to test, test the idea, right? Like that's, that's the whole idea. So now let's come up with another idea. Just for the sake of it. We can think of other more thematic plays. Now, right now, the reason why I'm focusing more so on more thematic plays is because I'm trying to run something that's a higher probability of happening. So we have something that if we take a look at the portfolio level, let's bait away this against the spy. If we bait away this against the SP 500 and we take a look at this. Trade here. This trade gives us really light delta's. So just literally it's going to behave as one share of spy. And we're collecting 1.88 of theta. We do have not insignificant Vega potential impact. But overall, we're still, we're still good here. So the enterprising trader might say, well, based on my broader market analysis, I would like to be slightly net long, my beta weighted deltas. The reason why this part matters so much is because when we look at the goal of a lot of novice traders that think they're doing something smart by",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 53,
      "start_timestamp": "01:09:08",
      "start_timestamp_seconds": 4148.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=4148"
    }
  },
  {
    "text": "might say, well, based on my broader market analysis, I would like to be slightly net long, my beta weighted deltas. The reason why this part matters so much is because when we look at the goal of a lot of novice traders that think they're doing something smart by being delta neutral, right? So having our delta's flat now. Well, that means that then you have to put on a lot more of the trades in order to hit your target of 313. The reason why this is the case is because if I have one trade that's long delta's that is going to try to make me a buck 60. And then let's say I have another trade that's short the same number of delta's that's going to lose me the 300 bucks or whatever. Well, the problem is is that we're now essentially offsetting the other position. This happens a lot because retail traders, they get into the bad habit of not wanting to make decisions. And then they're like, well, delta neutral, that's what I want to be. And there's nothing wrong inherently with managing your delta's we're actually going to do that here, but we have to do it in context. So now let's take a look at a couple other just general market themes again, just kind of cobbling ideas together here. And we can say industrials look kind of weak there, you know, they had an update. But maybe we think industrials might",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 53,
      "start_timestamp": "01:10:31",
      "start_timestamp_seconds": 4231.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=4231"
    }
  },
  {
    "text": "have to do it in context. So now let's take a look at a couple other just general market themes again, just kind of cobbling ideas together here. And we can say industrials look kind of weak there, you know, they had an update. But maybe we think industrials might be going down still and it looks like tech started leveling off and rallied on the day and tech has gone down a lot. So maybe we want to be long tech just again throw one ideas out. So let's go back to the visualized tab and let's go into industrials and let's take a look at what's been doing poorly northrop grumman lockie martin let's take a look at both of those really fast. It doesn't look bad. And lockie martin doesn't look bad either, but we could say that given the broader landscape of peace talks going on with Ukraine, the US diminishing its support of Ukraine and spending less money potentially on this broader bucket with cuts and defense spending. Maybe we think that that's going to impact northrop grumman. So let's take a look at the implied volatility percentile 90 so really high. This is also going to be good for sell side strategy. And we're looking at shorter term time frames here because sell side strategy. We don't want to be outside 60 days. And this one we think a little bit bearish. Now we're looking at the width of these right out of the",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 53,
      "start_timestamp": "01:11:53",
      "start_timestamp_seconds": 4313.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=4313"
    }
  },
  {
    "text": "going to be good for sell side strategy. And we're looking at shorter term time frames here because sell side strategy. We don't want to be outside 60 days. And this one we think a little bit bearish. Now we're looking at the width of these right out of the gate in their five points wide. We have to pay attention to that. And the spreads here are absolutely horrendous. The ability to trade something like this is essentially nullified right from the jump. You can't even find something in there with a multi like strategy. Let's see if lockie martin is any better. And it is not by much and it's only some of them, but it definitely is better. So let's say that we take a look at this five dollar wide spread the 490 to the 495, which is a 27 delta and a 20 delta. Let's analyze this trade first. Let's analyze the trade by itself. And we want to look at lockie martin. So this has us risking 295 to make 205. So again, let's take a look at the probabilities on this one. So we're trying to make 205. We're risking 295. The win probability here will figure that out. Now. So what's the probability of these 27s remaining out of the money right now the probability of them being in the money at expiration is about 25. So let's call it a 75 chance. This is a positively expected strategy on individual trade",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 53,
      "start_timestamp": "01:13:03",
      "start_timestamp_seconds": 4383.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=4383"
    }
  },
  {
    "text": "probability here will figure that out. Now. So what's the probability of these 27s remaining out of the money right now the probability of them being in the money at expiration is about 25. So let's call it a 75 chance. This is a positively expected strategy on individual trade level. So this one also fits within our risk tolerance to 95 represents a 1.1 risk of the portfolio return target. Here's 205 bucks. So now if we. What is this looking at these got all messed up. So now if we take a look at the total return that we get we're actually in surplus. And with just these two trades we're risking 2.54 of the portfolio. So does this mean that we stop here now because now we can say how does all of this fit together. And what else might I like in the broad market. So let's now go back to the beta weighted portfolio. And then let's look at something like spy. And let's see how these operate together. This essentially is saying if spy remains within 446 and 710 that this strategy itself would. I don't know why this says not traded. What happened to. What happened to our ex trade. Now this thing's also saying it. I don't know why these are saying it. That's annoying. Anyways. If we let's see if I can rebuild these super fast. Yeah, okay, so that's good. And then ex we did like this one and we",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 53,
      "start_timestamp": "01:14:19",
      "start_timestamp_seconds": 4459.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=4459"
    }
  },
  {
    "text": "to. What happened to our ex trade. Now this thing's also saying it. I don't know why these are saying it. That's annoying. Anyways. If we let's see if I can rebuild these super fast. Yeah, okay, so that's good. And then ex we did like this one and we did five of them. Good. And let's see if this breaks it if we go to spy. That doesn't work. No, okay, great. So we actually have our broader metrics. We can see now that we're actually net short a tiny bit of delta's. We're very long on theta and we're short about 12. So the portfolio as it sits is in a really healthy spot. I would think and we're using very, very little money. The total amount of money that is tied up in the portfolio right now essentially is 635. So if we take a look at that 635 of the total utilization. Again, it's like two and a half percent. We're really not using a lot of the portfolio. We have a lot of the portfolio that we can go out now and frolic and find ideas. But the important thing here is we can use the portfolio level metrics to see. Does this make sense for what we want? So let's take a look at one more trade. And this is actually to bake in this idea from Shrejay. Thinking about duration. And right now all of our positions are in one expiration. And there's",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 53,
      "start_timestamp": "01:16:03",
      "start_timestamp_seconds": 4563.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=4563"
    }
  },
  {
    "text": "the portfolio level metrics to see. Does this make sense for what we want? So let's take a look at one more trade. And this is actually to bake in this idea from Shrejay. Thinking about duration. And right now all of our positions are in one expiration. And there's nothing inherently wrong with that. But it does mean that there's going to be a little bit more activity around there. And maybe we have a couple longer term ideas. Maybe when we're looking at something like... Well, you guys tell me, what do we like longer term here? We can look at things like, Palantir maybe? Palantir looks good on a longer term timeframe. So let's take a look at maybe an idea in Palantir. And let's say we go out 63 days. And we know that within account this size, it'll be a little bit difficult to find something that fits the total sizing. So in here, if we buy one, we're risking 12.25. So let's throw that in our risk really quick, 1, 2, 2, 5. 4.9 percent. It's a little too high. So then we can do a couple things to lower this total risk. One of them is we can trade this as a diagonal. So if we go out 34 days and we sell a 28 delta, that'll give us 2.67. So let's analyze that. What I'm going to do is get rid of all of them for now. And I just want to",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 53,
      "start_timestamp": "01:17:44",
      "start_timestamp_seconds": 4664.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=4664"
    }
  },
  {
    "text": "of them is we can trade this as a diagonal. So if we go out 34 days and we sell a 28 delta, that'll give us 2.67. So let's analyze that. What I'm going to do is get rid of all of them for now. And I just want to look at Palantir. And let's go back out. Where was I? One of these. This one's fine. 98 days, 90 day diagonal. That's cool. I think we were in the 60 days, but that's okay. So this one's 1410. So let's analyze this together. So the max risk in this trade is 1150. This still represents too much risk. So we can either make the decision and say, I'm okay with this being slightly elevated risk, because both of these are slightly under risk. Or we say to ourselves, this is too expensive of an underlying. And this exceeds our 3 risk threshold. So instead, I'm going to have to look for something else. Those are the two choices here. But if we take a look at how this fits in with the broader portfolio, if we wait it again, something like spy. You see, you get the dagger of death. But the main thing I want you to pay attention to is the deltas. Now we're long 14 deltas of spy. And we can say, am I comfortable with this? We're still net long theta. And if we want to be net long deltas in general, then this aligns",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 53,
      "start_timestamp": "01:18:58",
      "start_timestamp_seconds": 4738.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=4738"
    }
  },
  {
    "text": "death. But the main thing I want you to pay attention to is the deltas. Now we're long 14 deltas of spy. And we can say, am I comfortable with this? We're still net long theta. And if we want to be net long deltas in general, then this aligns just fine. This is the beta weighted element. The beta waiting gives us a method to analyze if our current risk aligns with what we want it to be. So this here is literally the meat and potatoes of how to build a portfolio. And then the management of it is again, captured in those other videos. But when we're looking at building the portfolio to then subsequently figure out the management, the management from here is easy. It's just managing the individual strategies aligned with the way that we built our strategy outlines, right? From way earlier in the season. But this part here is now management of the portfolio comes down to how do we use the money to get the return that we are targeting in order to hit our long term objectives. So last bit here, we can say for a balance here. Let's say that we think our price target to the upside is going to be a hundred bucks. And let's say our risk management to the downside is at 63. So if we look at just Palantir again. And we say we're going to manage risk at 63, which really takes our total",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 53,
      "start_timestamp": "01:20:18",
      "start_timestamp_seconds": 4818.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=4818"
    }
  },
  {
    "text": "we think our price target to the upside is going to be a hundred bucks. And let's say our risk management to the downside is at 63. So if we look at just Palantir again. And we say we're going to manage risk at 63, which really takes our total risk down to like 800 bucks. So if we take a look at this and we think this being close to 800 bucks, that takes us to a 3.2 total risk a little bit closer. And what do we think we're going to make at the profit target funny 100 bucks is our max profit, which is. 356 and 912. So 912 would be at expiration the decay of the short option. And before that, it would be 356. So something in there. So then we can say what's the probability of us hitting 100 and then again, we can complete that expected return calculation. So then we see if all of that makes sense for the portfolio. All right. So I know that that's quite a lot. And I want to see what residual questions you have related to this broader topic. And I want to make sure that there are two key things you walk away with. The first thing is the importance of developing portfolio level goals, which I think we hit. And then the second thing is this process that I literally just showed you on how to employ your portfolio to hit those goals while",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 53,
      "start_timestamp": "01:21:25",
      "start_timestamp_seconds": 4885.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=4885"
    }
  },
  {
    "text": "there are two key things you walk away with. The first thing is the importance of developing portfolio level goals, which I think we hit. And then the second thing is this process that I literally just showed you on how to employ your portfolio to hit those goals while maintaining all risk metrics. That's exactly what this is all about. So what questions anything that you guys want to hit related to this anything stick out. I hope that the exercise itself is generally useful. And the main takeaway there is we can use different kinds of strategies. And in a smaller portfolio, you guys already know that I'm really not a fan of vertical spreads. But it is always a game of accepting tradeoffs. And that's really what happens here is we have to decide the trade off that we're comfortable with. So Paul says, how do you assess the downside risk of undefined loss strategies? And you mitigate the risks associated with jumps. Absolutely. So it's a great question. Now, if you'll notice in the context of this trade wrong thing. In the context of the volunteer trade, what I'm doing is I'm first starting from a place of deciding if the total debit that I'm paying. So the total risk of the trade is it within the realm of possibility. Like is it marginally acceptable for me? So that's the starting point. So in this case, I'm essentially planning from worst case factor. So if you",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 53,
      "start_timestamp": "01:22:50",
      "start_timestamp_seconds": 4970.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=4970"
    }
  },
  {
    "text": "place of deciding if the total debit that I'm paying. So the total risk of the trade is it within the realm of possibility. Like is it marginally acceptable for me? So that's the starting point. So in this case, I'm essentially planning from worst case factor. So if you recall in the beginning, I'm essentially saying 1125 risk. This 4.5 is that tolerable for me. It's a little bit on the high end. I'm not expecting to hit it. I'm expecting to manage it before then. But could I tolerate it? And the portfolio definitely could. The next question is, how do we pick what the risk is? Well, exactly that process you saw. The process is based on my PL management of the strategy, whatever my approach is for managing profit and loss targets. Now, the risk associated with jumps can be mitigated in two ways. The first way is by making sure that we're not stepping in front of some sort of big industry leading event that might hurt us. The second thing is by looking for historical context of what are some of the worst jumps that we've seen. This is the worst jump that I've seen and it's related to an earnings event, which is from 83 to 102. So that represents a 20 point move. So if we run from 86 to 66, what's the total damage that we deal with there? Let's go to 66. The total damage there is actually less than",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 53,
      "start_timestamp": "01:24:15",
      "start_timestamp_seconds": 5055.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=5055"
    }
  },
  {
    "text": "seen and it's related to an earnings event, which is from 83 to 102. So that represents a 20 point move. So if we run from 86 to 66, what's the total damage that we deal with there? Let's go to 66. The total damage there is actually less than the stop that we've already included. So that's exactly how you bake all of that in. The risk associated with jumps, they're mitigated via trying to avoid scenarios that often lead to jumps. And then the second is via sizing. It's a good question. Anything else you guys have? If we hit all these. I think so. But one other thing that actually is going to be relevant to you guys. That goes into like literally all like these two specifically way more in depth is this video. Sweet. All right, it looks like we're all good. She I'm not seeing any more questions. So I'm going to wrap it up. If you have anything else you want to go over is always hop in the discord. And then I'm going to take a look tomorrow. I have a AMA on Reddit that I'm doing at 1500. So you're welcome to drop anything there. You don't really have to because you guys have better access to me in the discord. But yeah, if you need anything, let me know. Enjoy the weekend. And I will see you guys later. You know,",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 53,
      "start_timestamp": "01:25:46",
      "start_timestamp_seconds": 5146.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=5146"
    }
  },
  {
    "text": "to drop anything there. You don't really have to because you guys have better access to me in the discord. But yeah, if you need anything, let me know. Enjoy the weekend. And I will see you guys later. You know,",
    "metadata": {
      "video_id": "_LwonWbC7LE",
      "title": "Managing an Options Portfolio | Outlier Options Trading Basics Ep10",
      "url": "https://www.youtube.com/watch?v=_LwonWbC7LE",
      "upload_date": null,
      "duration": 5269.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 53,
      "start_timestamp": "01:27:28",
      "start_timestamp_seconds": 5248.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=_LwonWbC7LE&t=5248"
    }
  }
]