[
  {
    "text": "When good just is not good enough, today I got three things on our agenda. The first one is Nvidia. The second one is chewy because they both had earnings today. And then the third one is the hometown favorite. We'll take a quick look at GameStop, although it's still pretty quiet in there. So what's going on in Nvidia? Well, it is all over the map. And this is kind of a really good example for earnings. If you've been watching my videos over the past couple days, last two days specifically where I've been highlighting Nvidia, one of the things I talked about was the importance of Nvidia to deliver near perfectly. And what that meant is even though it had a great quarter, if we take a look at its EPS, it came in at 0.68 against 0.59 expectation. It beat on EPS. If we take a look at its year-over-year revenue, gross margins, operating income, income, diluted earnings per share, everything, it's up. It's up massively year-over-year. Quarter-over-quarter, it's up. It's done exceedingly well. Gross margins came down a little bit, but operating income came up, net income came up. So what's going on here? Well, this is again a good case study in earnings and how they work because I think a lot of retail traders mistakenly believe that if a company beats earnings, it should go up. And that's not at all the case. This is a company that beat earnings that absolutely smashed",
    "metadata": {
      "video_id": "a02m0ETxjkk",
      "title": "NVDA & CHWY Earnings Beat? GME Analysis | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=a02m0ETxjkk",
      "upload_date": "",
      "duration": 871.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=a02m0ETxjkk&t=0"
    }
  },
  {
    "text": "this is again a good case study in earnings and how they work because I think a lot of retail traders mistakenly believe that if a company beats earnings, it should go up. And that's not at all the case. This is a company that beat earnings that absolutely smashed it, both on a quarter-over-quarter and year-over-year perspective. And it's down. It closed at 125.61, announced trading just below 1.18. So what's happening here? This is a couple things that are really important to understand. And this is a good product to look at it through the lens of. So first thing is when we're looking at earnings, it's important to understand the ratings system. And there are a ton of conflicts of interest baked into a stock or earnings rating system. Stock analysts that typically work for big banks that often hold the stocks that they're rating are the ones that come up with these numbers. They say, okay, based on what it's doing in its history, it should come in at 59.07 estimated EPS. Cool. Six story, bro. So then why is it all the time that if we take a look at a density of SP 500 earnings releases, and we take a look at the percentage of those releases over the last 10 years, and we say, what's the percentage of earnings releases in SP 500 stocks over the last 10 years? Where we have either a beats expectation, meets expectation, or is less than expectation,",
    "metadata": {
      "video_id": "a02m0ETxjkk",
      "title": "NVDA & CHWY Earnings Beat? GME Analysis | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=a02m0ETxjkk",
      "upload_date": "",
      "duration": 871.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 13,
      "start_timestamp": "00:01:34",
      "start_timestamp_seconds": 94.95384615384617,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=a02m0ETxjkk&t=94"
    }
  },
  {
    "text": "earnings releases, and we take a look at the percentage of those releases over the last 10 years, and we say, what's the percentage of earnings releases in SP 500 stocks over the last 10 years? Where we have either a beats expectation, meets expectation, or is less than expectation, why is it that the overwhelming majority beat expectation? I don't really think it's because we're that bad at guessing. We're not not great, but we also can figure out how to put a rocket ship on the moon when things are all moving together somehow magically, and then also get it back. We can do that. But somehow if we look over the entire history of all these stocks, we overwhelmingly see beats instead of meets expectations. I think we could be a little bit more accurate if we wanted. So why aren't we? It's because we're not incentivized, we being the analysts. So two things go on. The first thing is again, that conflict of interest I highlighted from the beginning, where they're straight up incentivized to make the stocks look better, because a lot of them hold the very stocks that they're reporting on. So they wanted to look better, so it goes up. The second thing is there's no benefit to being the more accurate analysts. They're actually incentivized to be around the herd, to be around the pack. Otherwise you end up like Kathy Wood, who is obviously somebody that got skylined for all of",
    "metadata": {
      "video_id": "a02m0ETxjkk",
      "title": "NVDA & CHWY Earnings Beat? GME Analysis | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=a02m0ETxjkk",
      "upload_date": "",
      "duration": 871.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 13,
      "start_timestamp": "00:03:09",
      "start_timestamp_seconds": 189.90769230769234,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=a02m0ETxjkk&t=189"
    }
  },
  {
    "text": "to look better, so it goes up. The second thing is there's no benefit to being the more accurate analysts. They're actually incentivized to be around the herd, to be around the pack. Otherwise you end up like Kathy Wood, who is obviously somebody that got skylined for all of her great ideas and all these really cool things she's doing. And then when whatever she's doing stops working, she's now the laughing stock of the town nobody can take her seriously. You know who's not in that scenario? The hedge fund manager that's been there underperforming the SP 500 for 40 years, but he's kind of just underperforming by 2. So he can take his cut, go grab his yacht. He's not incentivized to outperform. It's the same thing when it comes to analyst accuracy. They're not incentivized to be super accurate. They're actually highly incentivized to group around one another. So then if there's a big giant miss, everybody get it wrong. Something crazy happened that nobody saw coming. Whereas in this, if somebody tried to be super accurate and then that one person was wrong, they've just skylined themselves. They've just put them in the scenario to be the laughing stock of the town instead of just being able to collect their money and move on. What I guarantee you is that if they were paid based on their accuracy, these numbers would be a lot better. But this goes all the way back to the earning",
    "metadata": {
      "video_id": "a02m0ETxjkk",
      "title": "NVDA & CHWY Earnings Beat? GME Analysis | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=a02m0ETxjkk",
      "upload_date": "",
      "duration": 871.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 13,
      "start_timestamp": "00:04:44",
      "start_timestamp_seconds": 284.8615384615385,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=a02m0ETxjkk&t=284"
    }
  },
  {
    "text": "be the laughing stock of the town instead of just being able to collect their money and move on. What I guarantee you is that if they were paid based on their accuracy, these numbers would be a lot better. But this goes all the way back to the earning system. It's kind of like a game of softball. So when we're recounting the past quarter, we already have a lot of ideas on how we've done. We again, being the business itself. We have some ideas. Usually we can see the footprints of a well performing business, the way that it's impacting the way it's selling, how prevalent it is, yada, yada, yada. Like there's a lot of cues that tell us how a company is doing. And we have analysts that tend to continue providing update on the life cycle of the company throughout the quarter. So when we're going through an earning cycle, understanding the incentive structure, really what we care about are two things. Big deviations from expectations, so big surprises that somehow slip through, forward guidance. Forward guidance is new information. It's hot off the press and it's information that now helps us discount the future value of a stock. So all of this coming back to Nvidia. As I've talked about in the past two videos, if we look over the last two years on an adjusted basis, the stock has gone from 1081 to 140 and no, it's not a penny stock. This",
    "metadata": {
      "video_id": "a02m0ETxjkk",
      "title": "NVDA & CHWY Earnings Beat? GME Analysis | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=a02m0ETxjkk",
      "upload_date": "",
      "duration": 871.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 13,
      "start_timestamp": "00:06:19",
      "start_timestamp_seconds": 379.8153846153847,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=a02m0ETxjkk&t=379"
    }
  },
  {
    "text": "future value of a stock. So all of this coming back to Nvidia. As I've talked about in the past two videos, if we look over the last two years on an adjusted basis, the stock has gone from 1081 to 140 and no, it's not a penny stock. This is a mega cap stock. It's huge. This kind of movement is very cool to see. As you start getting into these more parabolic phases like this here, there is now a new mandate. You have to deliver near perfectly in order to be considered still on track. They have to be perfect. And as we look through in via earnings while they were damn good, they're not perfect. And there's a couple things in here that start to cause some concerns like this here. So you can see that investors are concerned over how strong AI is going to persist and obviously Nvidia's ability to continue delivering against that. So it's small things like that. Like literally when you're looking at something like this company that has had the growth that's had that is if you look through all of this, it looks so good. It's got a 50 billion share buyback coming out. Like it's crushing it. Market doesn't care. The market had priced in this absolutely insane trajectory that was obviously sooner or later going to have to slow down in order for this stock to reasonably consolidate to deliver the value that we're now discounting out",
    "metadata": {
      "video_id": "a02m0ETxjkk",
      "title": "NVDA & CHWY Earnings Beat? GME Analysis | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=a02m0ETxjkk",
      "upload_date": "",
      "duration": 871.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 13,
      "start_timestamp": "00:07:54",
      "start_timestamp_seconds": 474.76923076923083,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=a02m0ETxjkk&t=474"
    }
  },
  {
    "text": "billion share buyback coming out. Like it's crushing it. Market doesn't care. The market had priced in this absolutely insane trajectory that was obviously sooner or later going to have to slow down in order for this stock to reasonably consolidate to deliver the value that we're now discounting out into the future so that it kind of like makes sense. So again, we close at 125 61 and now we're down in the 116. It's still not a big prop, right? It's a hundred twenty dollar product and it's down about ten points. So not even ten percent yet. However, if I look at the overall story here, it's a great lesson in earnings, how to think about earnings and how to interpret earnings because I think so many people get it wrong and they look at this plainly and they say, wait a minute, 68 is higher than 59. Why would this crash for all of those reasons I just explained? Now during the live session later today, we'll go way deeper into the earnings release itself. I'm going to pull up the earnings presentation so that we can learn because this is a fascinating company at a fascinating point in time that I think is worth deep diving a little bit into. Now another company with another example is Chewie and this is another fascinating one because let's take a look at this. Its previous earnings came in, it was expected at four cents and it came",
    "metadata": {
      "video_id": "a02m0ETxjkk",
      "title": "NVDA & CHWY Earnings Beat? GME Analysis | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=a02m0ETxjkk",
      "upload_date": "",
      "duration": 871.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 13,
      "start_timestamp": "00:09:29",
      "start_timestamp_seconds": 569.723076923077,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=a02m0ETxjkk&t=569"
    }
  },
  {
    "text": "fascinating point in time that I think is worth deep diving a little bit into. Now another company with another example is Chewie and this is another fascinating one because let's take a look at this. Its previous earnings came in, it was expected at four cents and it came in at thirty one. Huge beat, that's way off, not even close. And in that scenario, we saw this massive gap up from sixteen essentially to nineteen and then it ran all the way up to over twenty. Big move following this giant earnings beat. Then we have another very interesting scenario where we were expected at three cents and we came in at twenty four cents, another massive EPSB massive yet we're up eleven percent today. That's it. To me, I was entirely underwhelmed by the movement today for this, that's a huge beat, that's huge. A recent versus twenty four, again, not even close, this massive beat. But again, this shows you the incentive structure. If you look at this past when you're like, okay guys, well, we guess it was going to be four and it came in at thirty one. We probably got to get that a little better next time. Okay, boss, well, for this one, I think it's going to be three cents, right? Now I want to be clear, you can't compare quarter over quarter directly. There is a difference between the circumstances in a quarter over quarter versus a year over year",
    "metadata": {
      "video_id": "a02m0ETxjkk",
      "title": "NVDA & CHWY Earnings Beat? GME Analysis | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=a02m0ETxjkk",
      "upload_date": "",
      "duration": 871.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 13,
      "start_timestamp": "00:11:04",
      "start_timestamp_seconds": 664.6769230769231,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=a02m0ETxjkk&t=664"
    }
  },
  {
    "text": "a little better next time. Okay, boss, well, for this one, I think it's going to be three cents, right? Now I want to be clear, you can't compare quarter over quarter directly. There is a difference between the circumstances in a quarter over quarter versus a year over year comparison. That's why it's really important to look at both because the environment where we're at in an economic cycle, all of that impacts the earnings, which is exactly why you'll generally see both of those quarter over quarter in year over year. So quarter over quarter, we still did a great job here. We came in at twenty four cents. I actually haven't come back this far, but let's see, this was expected at negative six cents came in at fifteen. And this came in at negative three cents and positive fifteen, right? Like how is an analyst that off that regularly? Imagine if this was anybody else's job and you, whatever you did, depended on being even marginally close to this and you were this far off, a weatherman would get fired faster than this and a weatherman or person, sorry, is never right anyways. They're always wrong too, because they're trying to get the weather. So this is just another really fascinating example of markets and all these small intricate nuances about how they behave, how we frame things, these conflicts of interests and the way that underlying move in response to what seems to be in",
    "metadata": {
      "video_id": "a02m0ETxjkk",
      "title": "NVDA & CHWY Earnings Beat? GME Analysis | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=a02m0ETxjkk",
      "upload_date": "",
      "duration": 871.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 13,
      "start_timestamp": "00:12:39",
      "start_timestamp_seconds": 759.6307692307694,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=a02m0ETxjkk&t=759"
    }
  },
  {
    "text": "too, because they're trying to get the weather. So this is just another really fascinating example of markets and all these small intricate nuances about how they behave, how we frame things, these conflicts of interests and the way that underlying move in response to what seems to be in this case a massive outperformance. But the market just did not really care about it on this again, twenty cent outperformance, even higher than that, twenty cent plus outperformance. The market gave us eleven percent move and of that eleven percent, if we look at the volume today, forty three percent of that volume was sale volume. So it's like to me, it's comical really is what it boils down to. It's comical and it makes sense to me why so many investors would look at this and be confused because again to the uninitiated, it makes no sense and I got to be honest with you. Even for the initiated, I've been a market is my seventeenth year. It still doesn't make sense dog. I don't know how we could be this off for this long, but again, joking aside, it goes back to the incentive structure and it goes back into why it's so important to have a keen eye and a discerning interpretation of things. You cannot take much of life let alone the stock market at face value. And I noticed that as I continue to get older and older that there's so much nuance that",
    "metadata": {
      "video_id": "a02m0ETxjkk",
      "title": "NVDA & CHWY Earnings Beat? GME Analysis | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=a02m0ETxjkk",
      "upload_date": "",
      "duration": 871.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 13,
      "start_timestamp": "00:14:14",
      "start_timestamp_seconds": 854.5846153846154,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=a02m0ETxjkk&t=854"
    }
  },
  {
    "text": "goes back into why it's so important to have a keen eye and a discerning interpretation of things. You cannot take much of life let alone the stock market at face value. And I noticed that as I continue to get older and older that there's so much nuance that I used to miss as a younger dude that's kind of just taking things at face value and trying to process a lot of stuff super fast. This is another great example of that. So I thought the earnings in here was also interesting again on the live session later today. We'll pull up the actual earnings report and go through it. So the last thing I want to take a look at is GameStop and it's for two reasons. One, we broke down below the support which I don't love at all. We did see volume tick up just a little bit 5.1 mil against the 20 day average of 5.3 which still slightly below but still a tick up at the vast majority of the sale volume 98. So what this looks like to me is now we're entering a bit of a value area. I would fully expect this to drift down towards this 18 handle unless again, there's some sort of catalyst or news. This looks like the likely direction for us to go because I'm just using where I'm seeing people wanting to buy the stock and there's a giant gap here. So when there",
    "metadata": {
      "video_id": "a02m0ETxjkk",
      "title": "NVDA & CHWY Earnings Beat? GME Analysis | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=a02m0ETxjkk",
      "upload_date": "",
      "duration": 871.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 13,
      "start_timestamp": "00:15:49",
      "start_timestamp_seconds": 949.5384615384617,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=a02m0ETxjkk&t=949"
    }
  },
  {
    "text": "expect this to drift down towards this 18 handle unless again, there's some sort of catalyst or news. This looks like the likely direction for us to go because I'm just using where I'm seeing people wanting to buy the stock and there's a giant gap here. So when there aren't bidders coming in to move the stock up that typically leads us to fall down and that's kind of what I'm expecting here. And then the next volume node that's series that all is down here at like 15 25 15 50 somewhere in there. So we'll see how it goes as per usual I always say something like GameStop is fascinating because it doesn't abide by normal rules and as soon as there's some sort of meaningful catalyst that we completely can undo every little bit of this down move and you can run up and literally start moaning just because of a change in circumstance, which is again, it's kind of what makes things like GameStop or other meme stocks. So interesting is how fast these small to mid cap companies can pivot, which is more akin sometimes to much smaller cap stocks, but these things can start flying again. We went from nine to 65. So it's like, yeah, this thing can move as soon as it wants. It's a month timeframe that it made that move. So keep an eyeball on it. That's all I can say. That's what I see here. Now the other",
    "metadata": {
      "video_id": "a02m0ETxjkk",
      "title": "NVDA & CHWY Earnings Beat? GME Analysis | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=a02m0ETxjkk",
      "upload_date": "",
      "duration": 871.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 13,
      "start_timestamp": "00:17:24",
      "start_timestamp_seconds": 1044.4923076923078,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=a02m0ETxjkk&t=1044"
    }
  },
  {
    "text": "start flying again. We went from nine to 65. So it's like, yeah, this thing can move as soon as it wants. It's a month timeframe that it made that move. So keep an eyeball on it. That's all I can say. That's what I see here. Now the other thing I do want to highlight because I finally feel vindicated is this here. So earnings is now confirmed for the 10th after the market closed. And this is what I was talking about on Sunday.",
    "metadata": {
      "video_id": "a02m0ETxjkk",
      "title": "NVDA & CHWY Earnings Beat? GME Analysis | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=a02m0ETxjkk",
      "upload_date": "",
      "duration": 871.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 13,
      "start_timestamp": "00:18:59",
      "start_timestamp_seconds": 1139.446153846154,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=a02m0ETxjkk&t=1139"
    }
  }
]