[
  {
    "text": "another crazy day in GameStop. We had tons of call volume. We have volatility moving around and then player two has entered the chat with Roryne Kitty coming back with this tweet of this dog emoji. This came out at 10 a.m. today kicking off a pretty interesting move to say the least in Chewy that will take a look at. And this is another instance actually where my option scans picked up the move so that I was like what's going on in Chewy. I played it today because how could you not on the movement. But then I was wondering what was going on and then I came across this tweet a little bit later. And it all kind of made a little bit more sense. Now let's start with a quick recap because we haven't heard from Roryne Kitty in a while. His last tweet was on 17th of June. And then today we had this this I do not know the lore behind and as you guys know I am here to keep it a buck. I'm not going to talk about stuff that I don't know. I know about options and trading. You guys know way more about the background behind all of these things. I just have peripheral information. So my current understanding is that this is a dog emoji that they replaced he replaced the eyes with these green eyes. So that's a purposeful move as compared to the standard eyes that the",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=0"
    }
  },
  {
    "text": "way more about the background behind all of these things. I just have peripheral information. So my current understanding is that this is a dog emoji that they replaced he replaced the eyes with these green eyes. So that's a purposeful move as compared to the standard eyes that the normal emoji has. And this color apparently lines up very, very close to Chewy's brand colors. I think somebody held up the hex code side by side. And it was all by like one character. So very, very close to that. Now people are speculating if that means something about Chewy if that just is kind of the next emoji. I guess in a cycle of emojis that Roryne Kitty has shared in kind of this long stage of them. Again, you guys would know way more than me. I would love any information you guys have thrown in the comments. But that's about my guess as far as I can see from this so far. You know way more than I do. So off of that though, my boy Rastam man was saying can't wait to make a video in terms of Roryne Kitty's new meme, which is kind of this. And then the craziness with Chewy, which yeah, I think craziness is a great way to describe it. So we'll take a look at that in just a moment before we get into Chewy, let's take a look at GameStop. What happened between yesterday and today. Well, yesterday.",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 17,
      "start_timestamp": "00:01:37",
      "start_timestamp_seconds": 97.03529411764706,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=97"
    }
  },
  {
    "text": "of this. And then the craziness with Chewy, which yeah, I think craziness is a great way to describe it. So we'll take a look at that in just a moment before we get into Chewy, let's take a look at GameStop. What happened between yesterday and today. Well, yesterday. Lower volatility still had over 200,000 call options transact big, big movement, but volatility suppression, some bumps in the chains, but nothing super crazy. Take a look at today over 400,000 call options traded today. Now my guess is when I look at this, which I haven't looked at it yet. But when I look at this, I'm expecting to see a few things that we can probably dig into a little bit further. In terms of what's going on with this activity, the put volume also spiked a lot. It doubled from what it was yesterday, but it pales in comparison to the call volume. So with that, let's take a look not at Chewy yet, although we will look at Chewy and let's get over here to GameStop. And if we come into the product itself and we poke around the first thing I notice is take a look at the number of calls that transacted at the ask or above. What does this mean? These are calls that were purchased, which is a lot. There's a lot of calls that were purchased today. So if we open up time and sales, I wanted to see where we're",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 17,
      "start_timestamp": "00:03:14",
      "start_timestamp_seconds": 194.0705882352941,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=194"
    }
  },
  {
    "text": "look at the number of calls that transacted at the ask or above. What does this mean? These are calls that were purchased, which is a lot. There's a lot of calls that were purchased today. So if we open up time and sales, I wanted to see where we're seeing this activity kind of building off the video from yesterday. Where I recapped most of the primary GameStop options volume for this entire month. Now I'm looking specifically today. I'm limiting by things that are at least 250 size or higher. And since there's quite a few of them. I actually think we can bump this up to kind of my typical filter, which would be at least 500. And the reason why like 500 is that that's when it starts to become a meaningful position 250 is not small, but it's also not super large. And let's see where we're seeing this activity. These are the two biggest trades. So we'll kind of catch them when we get down in here. But I see in 12 July, the 30s had 500 move, which is pretty big. And those are slightly out of the money. We'll take a look at those in the second. We can skip over the puts. Those are just people hoping this thing goes down like a bunch of haters. Actually, let me see. Yeah, they're at the bit. So there's actually a lot of people selling puts. That's great. So that's more people that",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 17,
      "start_timestamp": "00:04:51",
      "start_timestamp_seconds": 291.1058823529412,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=291"
    }
  },
  {
    "text": "at those in the second. We can skip over the puts. Those are just people hoping this thing goes down like a bunch of haters. Actually, let me see. Yeah, they're at the bit. So there's actually a lot of people selling puts. That's great. So that's more people that wanted to go up. All right. When we look at this 30 calls, 997 here. So I see 30 calls here. I see 30 calls here. That looks like it for the 30 calls. That's not an insignificant size. Somebody paid a lot compared to the other person. They got 500 for 160. They got 1000, essentially for 210, which is not ideal. Then taking a look at these 24 calls. There's 650 of those out in 26 July. And then in 5 July, we had somebody building a very clear 26 and a half position. The reason why I know that this is very clear is take a look at the execution time on all of these 10. This is Pacific time 1006 30 same time. But this is a series of orders that went through not all at once. So it got chunked up a little bit is what I'm gathering from here. So I see this is an interesting position to me. We'll take a look at this. The reason why this is interesting is the 26 and a half strike selection is very interesting to me. Because most people that are more sophisticated traders trying to",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 17,
      "start_timestamp": "00:06:28",
      "start_timestamp_seconds": 388.1411764705882,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=388"
    }
  },
  {
    "text": "what I'm gathering from here. So I see this is an interesting position to me. We'll take a look at this. The reason why this is interesting is the 26 and a half strike selection is very interesting to me. Because most people that are more sophisticated traders trying to put on meaningful size positions won't go to these half strikes because they're typically not as liquid. And again, my guess is if we check those out now, let's go to the five July's. And we go to those halves was it 26 and I already forgot the memory of a goldfish 26 and a half's. That's a pretty wide market. That's a really wide market. I don't understand that strike selection. I really don't because take a look at this the 26 and a half's there bid at 115 offered at 135 again. I told you guys this a million times, but it's worth reiterating. You will almost always find that these weird strikes have strikes quarter strikes are going to have less liquidity than the whole strikes people kind of navigate to the same places. And you can see this across the board look on the puts side these 25 puts these are 11 cents wide the 24 and a half's are much wider than that 16 cents. So it's the same thing on this side if we look at these 26 is these are six cents wide at 46 delta. And then the 27's were four cents",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 17,
      "start_timestamp": "00:08:05",
      "start_timestamp_seconds": 485.1764705882353,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=485"
    }
  },
  {
    "text": "these 25 puts these are 11 cents wide the 24 and a half's are much wider than that 16 cents. So it's the same thing on this side if we look at these 26 is these are six cents wide at 46 delta. And then the 27's were four cents wide, but for whatever reason we picked these and I really don't know why I don't know why you pick something that's significantly wider bid asked spread. Then something like this. So that's just a really novel position to me and it's hard to say I don't want to say that it's an uninformed position because that's not a tiny trade. If we take a look real quick, I see a thousand 20 plus 644 plus 728. So it's a 2392 position at 1.91. It's like 456,000. It's a big position. So I would man, I don't know. This one has me confused. I really don't know because I would I would guess not retail because it's a near half million dollar position and options that expire in eight days. But this seems like a retail strike selection going to the halves. I don't know why they did that. But it's a person putting on a big trade. Like that's clearly what's happening here. This is a trade that's interesting to me. I know that a lot of times people kind of talk about, I always were in kitty buying this or is he buying that and we can speculate",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 17,
      "start_timestamp": "00:09:42",
      "start_timestamp_seconds": 582.2117647058824,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=582"
    }
  },
  {
    "text": "it's a person putting on a big trade. Like that's clearly what's happening here. This is a trade that's interesting to me. I know that a lot of times people kind of talk about, I always were in kitty buying this or is he buying that and we can speculate a lot. But it's really important to not manufacture the things that you want to see. This is one of the first interesting call positions I've seen over the last few days doing this. This is actually a pretty big position that was put on. So this is a strike now that I will watch. This isn't something that I necessarily will immediately take as some sort of alert or signal. I don't really think that. But I do see that these were also in at the offer. So these are very clearly bought positions. This is a bullish trade. The reason why I can tell is if you look at the market, it's showing you what the bid asked was and the offer there was 1.91. That's where they got in at. So let's take a look at where these are centralized. So if you go to the 28 June, I see 236 of them there. Then in the five July 76 K. So quite a lot. 12 July is pretty light at 16,000. 19 July 46. 26 July 7000. Let's go out here to the 16 aug. So it's still all very, very near term centered action. So",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 17,
      "start_timestamp": "00:11:19",
      "start_timestamp_seconds": 679.2470588235293,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=679"
    }
  },
  {
    "text": "June, I see 236 of them there. Then in the five July 76 K. So quite a lot. 12 July is pretty light at 16,000. 19 July 46. 26 July 7000. Let's go out here to the 16 aug. So it's still all very, very near term centered action. So they go all the way through these. Very, very near term. It's not until 16 Jan that you actually see puts you in the overall volume, which is pretty interesting. I'll take a quick peek at. I almost double the calls to put. So again, as per usual, just massive call skew in this thing and it's hanging in there. Again, let's run through the primary explorations really fast. This front expiration, 334,000 essentially against 128. So massive call skew. Five July. It's about two to one calls to puts. Well, July a little bit closer. And then 19 July still massive call skew. Let's go out here to aug. Still now. So it's 88 K calls to 58 K puts. Further out still we start with puts. So 18 October has 53,000 puts against 46,000 calls 17 Jan back to call skew. This is crazy back to put skew. And even that's hilarious. The fact that it oscillates back and forth like that across these random time frames and then the last one's just even is kind of poetic to me. All of the activities in the front that's kind of clearly observable here. Let's take a quick look",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 17,
      "start_timestamp": "00:12:56",
      "start_timestamp_seconds": 776.2823529411764,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=776"
    }
  },
  {
    "text": "And even that's hilarious. The fact that it oscillates back and forth like that across these random time frames and then the last one's just even is kind of poetic to me. All of the activities in the front that's kind of clearly observable here. Let's take a quick look now at this front expiration. Huge activity here at the 30s. So there was 28,000 OI with 52,000 transactions today. So that's a lot of people that are buying no matter what. And I also see the same story here at the 26s. We have 9,300 OI against 27,000 transacted. So a lot of people are buying here. There's a lot of people buying calls that expire literally in one day. And we got to check our boys at those 128 see how they're holding up. I think yesterday they were at one and a half. You just hate to see it. I mean, this is exactly what I told you guys is more likely to happen than not. It's not like I'm some oracle. It's literally just such a high probability play. But they're now essentially mid at 0.05. 0.005 is the correct number. These are essentially worthless. And there was 4,000 transacted today against 64,000. There's going to be so many people that just lose all their money on that. Not that it's a ton because it was so cheap. This is always an interesting play to me because I genuinely don't see why you come all the",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 17,
      "start_timestamp": "00:14:33",
      "start_timestamp_seconds": 873.3176470588235,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=873"
    }
  },
  {
    "text": "there was 4,000 transacted today against 64,000. There's going to be so many people that just lose all their money on that. Not that it's a ton because it was so cheap. This is always an interesting play to me because I genuinely don't see why you come all the way out here to trade it stuff like this. When you can go much closer and essentially get the same exact price. If that's your move. Again, I want to always continue to redirect you guys to that video on buying call options smarter. I will throw it in the notes below. I genuinely think if you buy options and game stopper stuff like this, you should watch that video. Because I'm just trying to give you information about how to think about structuring your trades versus finding stuff that's super cheap and hoping it works. It's a tough way to make money. So I'll leave that point alone. All right, let's get over to Chewie because today was really interesting. And as I told you, when this first kicked off, I was watching Chewie. It's on my alerts for a few different reasons for the options chain specifically. But today I got an alert on the stock itself. And this is a today chart two minute candles and it started flying off right at 10. And again, if we take a look at this. 10. So I don't want to get into the game of, you know, is D",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 17,
      "start_timestamp": "00:16:10",
      "start_timestamp_seconds": 970.3529411764706,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=970"
    }
  },
  {
    "text": "today I got an alert on the stock itself. And this is a today chart two minute candles and it started flying off right at 10. And again, if we take a look at this. 10. So I don't want to get into the game of, you know, is D of E manipulating markets and stuff like that. Because as soon as he put that out, a little bit later Jim Kramer put something out saying, you know, take advantage of it and sell half your position or whatever. So I don't buy the argument that roaring kiddie is manipulating markets somehow, but all these other pundits that are on TV shows talking about stocks all the time somehow aren't like now man, get out of here. So I don't care about that, but the price activities. I mean, is interesting, right? 10 tweet comes out 10 starts flying really hits this peak. I had originally started transacting at about like 10 or 4. So somewhere in here is when I got in and then I got stopped out on this side. So it wasn't a giant move for me. I was using long calls literally just to trade the flow. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 17,
      "start_timestamp": "00:17:47",
      "start_timestamp_seconds": 1067.3882352941177,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=1067"
    }
  },
  {
    "text": "flow. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know whether or not he even has been related to Chui. I don't know if",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 17,
      "start_timestamp": "00:19:24",
      "start_timestamp_seconds": 1164.4235294117648,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=1164"
    }
  },
  {
    "text": "deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know if it's a big deal. I don't know whether or not he even has been related to Chui. I don't know if it's a big deal. I don't know if it's a big deal. I don't know whether or not he even wore suit povo服. I don't know if the suit豀 swing Lee Gang merits court league tech league league league league league league league league league league league league league league league league league league league league league league league league league league league league league league league listingобр I can't I can't say either way, but the timing of it is too novel, But the timing of it is too novel, but the timing of it is too novel, But the timing of it is too novel, But the timing of it is too novel, here, I don't see it. The biggest call position was the 40s out in 28 June for 19 cents, and there was 688 of those, which that's not a very big position. So we have 688 times, or I'm sorry, at 19, it's a 13,000 trade. So it's really nothing to write home about here. So I don't see that personally, that he was transacting in here. But we will have to keep an eyeball on it now because it is a little interesting that",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 17,
      "start_timestamp": "00:21:01",
      "start_timestamp_seconds": 1261.4588235294116,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=1261"
    }
  },
  {
    "text": "688 times, or I'm sorry, at 19, it's a 13,000 trade. So it's really nothing to write home about here. So I don't see that personally, that he was transacting in here. But we will have to keep an eyeball on it now because it is a little interesting that there was quite that much volume today. It looked like a lot of people piling in after they saw news come out. And if we take a look at where most of those transactions occurred, no surprise to anybody, super far out of the money options, which again, for the vast majority of these people that is going to be money that's lit on fire and they'll never see again. They won't even get to watch it burn, which I guess would be the good part about lighting it on fire instead. There's 29,000 calls transacted today at the 45, which is a 0.04 delta again, 6400 OI. So that's a lot of purchases. And it's super cheap. So again, going back off our standard thing, the theta to K and these is 10 cents. Right now, they're about mid at nine and a half. So tomorrow, these will be worth nothing is what it's going to come down to unless there's some sort of massive move, which when I look at the chart in here, I don't necessarily see a catalyst for it on the horizon, beyond some sort of, you know, crazy market activity. Look at the sale",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 17,
      "start_timestamp": "00:22:38",
      "start_timestamp_seconds": 1358.4941176470586,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=1358"
    }
  },
  {
    "text": "worth nothing is what it's going to come down to unless there's some sort of massive move, which when I look at the chart in here, I don't necessarily see a catalyst for it on the horizon, beyond some sort of, you know, crazy market activity. Look at the sale volume today. Crazy, crazy stuff. The other thing I saw was kind of an idea about maybe XRT holdings. I think the problem with that theory is although chewy is the biggest holding in XRT, it's small. Like 1.77 of the ETF. So I mean, it could be, you know, that broader theory that we're essentially using these for a shell game, but there's just not that much in here. And there's a lot of very near exposure into other things like Irvana or all these. So I'm not exactly sure that that's what's happening here. It's a great theory. And as always, like I genuinely don't know definitively one way or the other. But when I look at this, that's the main thing I see is this is a pretty light position in the broad context of this ETF. So the idea that they're trying to play the shell game with chewy and here, maybe happening, but it seems difficult to do because of the dilution from everything else. That's kind of the main point from that one. But as always, I'm open to more information. So if you guys know something about it, hit me up. As always,",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 17,
      "start_timestamp": "00:24:15",
      "start_timestamp_seconds": 1455.5294117647059,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=1455"
    }
  },
  {
    "text": "game with chewy and here, maybe happening, but it seems difficult to do because of the dilution from everything else. That's kind of the main point from that one. But as always, I'm open to more information. So if you guys know something about it, hit me up. As always, if there's any questions, let me know. I love taking a look at the stuff that you guys want me to. I love sharing at least what I know about this stuff with you all and trying to help provide some useful information to people. This is my world. So thank you for letting me be a part of it. And thank you for sharing with me. Be an outlier. See you guys later.",
    "metadata": {
      "video_id": "A9Uq-DNAV2I",
      "title": "HUGE Option Volume in GME and CHWY & Roaring Kitty Tweet",
      "url": "https://www.youtube.com/watch?v=A9Uq-DNAV2I",
      "upload_date": "",
      "duration": 1088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 17,
      "start_timestamp": "00:25:52",
      "start_timestamp_seconds": 1552.5647058823529,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=A9Uq-DNAV2I&t=1552"
    }
  }
]