[
  {
    "text": "What is going on everybody I am here with my good friend best friend ever gave welcome back. I think this is what the third time or yeah, I think this is the third time. Yeah. Yeah. Well, we're going to have to set up like your own playlist soon. First off, you know, thanks for thanks for joining me again. I always look forward to talking with you because you are truly one of the few people that are very vocal for retail traders and you are obviously incredibly savvy about just the financial markets in general, their structure, which I think would benefit a lot more retail traders. If they you don't have to become an expert, but as long as you start to understand a little bit more, the pieces start to fall in place a little bit better and you kind of know how to more effectively interact with the markets. So thank you again for coming to hang out and spend some time. Sure. Yeah. Thanks for having me. You know, look forward to talking about markets and it's just great that people are interested in it. And so you don't always have to talk about it. Just it is such a funny point because like a lot of my friends that I talked to you, I try to talk to about trading, they couldn't care less. Yeah. And then, you know, like you start, I was talking with somebody on the internet about volatility",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 41,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=0"
    }
  },
  {
    "text": "about it. Just it is such a funny point because like a lot of my friends that I talked to you, I try to talk to about trading, they couldn't care less. Yeah. And then, you know, like you start, I was talking with somebody on the internet about volatility smiles and they were geeking out on it as hard as I was and I was just like, how cool is this that you could just find somebody that's interested in this super niche thing that nobody you know cares about, but you know, this person across the country likes it. I love that. I know. I know. I mean, that's it's the same thing with market structure, you know, and for a long time, again, like nobody in this world cared about it. And there were like 10 people on Wall Street that were obsessed with it. We all know each other and we all even, you know, have us disagree with the other half, you know, that they're always arguing and debating and it's always super fascinating, but you know, it is, it's funny. It's like this thing that just nobody would ever think to care about. And yet it's so important to the economy and to everything, same with trading, right? You know, I think people underestimate the importance of even the speculation, which helps to, you know, bring prices in line. And if you buy any version of the efficient market hypothesis, you know, speculators are",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 41,
      "start_timestamp": "00:01:38",
      "start_timestamp_seconds": 98.92682926829268,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=98"
    }
  },
  {
    "text": "yet it's so important to the economy and to everything, same with trading, right? You know, I think people underestimate the importance of even the speculation, which helps to, you know, bring prices in line. And if you buy any version of the efficient market hypothesis, you know, speculators are important and as part of that. Right. Yeah. And so that's actually like a really good starting point because the last couple of times you were talking, there was this, you know, we are the investors and it, you know, is a started as it looked like a hashtag on Twitter. I don't know if the petition came before that and it was part of it. Maybe you could tell me a little bit about like the timing of it, but more importantly, you kind of started this movement that is definitely interested in, you know, retail traders place in the market and some of the structural components of the markets that, in a lot of ways, they're kind of sold to retail traders like good things. But then when you start understanding it a little bit more, it's kind of like, is this a good thing? So, yeah. Well, you know, it, it originally came about, you know, as I've gotten more immersed in the retail investor and trader community, which is more recent for me. You know, I've sort of been in the professional trading community for a long time, but, you know, the retail trading community is",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 41,
      "start_timestamp": "00:03:17",
      "start_timestamp_seconds": 197.85365853658536,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=197"
    }
  },
  {
    "text": "you know, it, it originally came about, you know, as I've gotten more immersed in the retail investor and trader community, which is more recent for me. You know, I've sort of been in the professional trading community for a long time, but, you know, the retail trading community is new to me for the last, you know, year and change. It's a wild west. We just, we just, we just, we need a fascinating space. But, you know, I was used to encountering firms like Citadel and Virtu and Robinhood, TD Ameritrade in, in the market structured debates that were happening, both in Congress and at the SEC and the, I was used to encountering them, holding themselves up as representing retail. Right. And the absurdity of that was, it was never really lost on anyone, but there was no one to really question it. And there was really no one else who could step in to represent retail. And so the reason it's absurd is because these are companies who profit from retail, who productize retail, right? You get free commissions. I mean, nothing's for free. We all know that, right? Especially on Wall Street, but, you know, even on social media, nothing's for free. If you're not paying for something, you're the product. And since when does the firm that has productized you get to represent your interests and who in the right minds would think that they're representing your interests as opposed to their interests? So",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 41,
      "start_timestamp": "00:04:56",
      "start_timestamp_seconds": 296.780487804878,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=296"
    }
  },
  {
    "text": "even on social media, nothing's for free. If you're not paying for something, you're the product. And since when does the firm that has productized you get to represent your interests and who in the right minds would think that they're representing your interests as opposed to their interests? So that was really where this all began was to say, wait a second, you know, if retail can get educated on these issues and has been educating itself on these issues, you know, everyone cares now about market structure and they're fascinated by it. Which is the only reason, like, I have this Twitter following and, you know, Reddit communities that care to interact and they want to learn more. And, you know, if they can learn enough, then retail should be able to represent itself. And retail should be able to represent its interests and understand the trade-offs that it's being presented with in the current structure and decide for itself is a better one possible. And would there be a better structure that could better advantage retail investors over this extreme system of extreme intermediation and middlemen that has cropped up around retail, right? It's like, you know, if retail or the schools of fish, you have all these sharks coming in, profiting from it. And it's just, it's an unnecessary sort of middle layer in the market. And, you know, so a big part of what we're pushing for with we, the investors, is getting rid of",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 41,
      "start_timestamp": "00:06:35",
      "start_timestamp_seconds": 395.7073170731707,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=395"
    }
  },
  {
    "text": "if retail or the schools of fish, you have all these sharks coming in, profiting from it. And it's just, it's an unnecessary sort of middle layer in the market. And, you know, so a big part of what we're pushing for with we, the investors, is getting rid of that middle layer. Are you getting rid of all this intermediation and letting retail access markets directly and letting retail interact with institutions directly? Which, so, talk to me a little bit more about that, the, you know, getting rid of the intermediary. Can you share a little bit more on like the primary entities or functions that those entities provide now and why you think they shouldn't be there and that retail should be able to go kind of via far direct past them? Yeah. So today, when you enter an order in as a retail investor or retail trader, nearly universally, that order is going to go to what's called a wholesale it. So you use TD Ameritrade or Schwab or E-trade or Robin Hood, even to a certain extent interactive brokers, but not quite the same, you know, but all of these, all of the biggest brokers in the world sell their order flow or even if they don't sell it like fidelity, doesn't sell equity order flow, they do sell options order flow, but they still send it all of those orders to mostly Citadel and Vertu. So those are called wholesalers. And so that order,",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 41,
      "start_timestamp": "00:08:14",
      "start_timestamp_seconds": 494.63414634146335,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=494"
    }
  },
  {
    "text": "in the world sell their order flow or even if they don't sell it like fidelity, doesn't sell equity order flow, they do sell options order flow, but they still send it all of those orders to mostly Citadel and Vertu. So those are called wholesalers. And so that order, you know, marketable orders go to these wholesalers and they internalize it. They fill those orders, they send the fill back. And what your broker will tell you is, well, look, they're paying for that order flow. So that's why we can offer you zero commissions and you're getting all this great price improvement. You're getting a better fill than the MBBO. You should be on your knees thanking us, not getting upset at this great price improvement and free training. You know, what could be better? And of course, you know, like I said, nothing's free in this world. So you know, first of all, there's a good amount of academic evidence that shows that if your order is being handled by a broker that accepts payment for order flow, you're going to get a worse price than if your order is being handled by a broker that doesn't. So, you know, like flat off, that's hardly even a controversial statement at this point. So that part, first of all, that means that your broker is not getting best execution, right? The broker has a duty of best execution above and beyond its interest in accepting payment for order",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 41,
      "start_timestamp": "00:09:53",
      "start_timestamp_seconds": 593.560975609756,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=593"
    }
  },
  {
    "text": "So, you know, like flat off, that's hardly even a controversial statement at this point. So that part, first of all, that means that your broker is not getting best execution, right? The broker has a duty of best execution above and beyond its interest in accepting payment for order flow. And brokers are not meeting that duty. And so that's a big problem in markets today. And you don't know how much it's costing you because you're not seeing it. It's all sort of baked into the execution price. Now the other side of this is this great price improvement that they talk so much about. But price improvement is bullshit. That's the nicest way I can put it because it's completely theoretical. It's not actually a real thing. Okay. So, the best improvement is them saying we gave you a better price than the MBBO. But does that mean they give you a better price than the hidden orders that were out there or the midpoint orders that were out there that they didn't even bother to look for? No, it doesn't mean that. Did they give you a better price than the odd lots out there which don't count in the MBBO? No, they didn't do that. And so much of retail trading today is in odd lots and so much liquidity out there is in odd lots because of these high priced names. So, and then finally, it's bullshit because when they take all of this",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 41,
      "start_timestamp": "00:11:32",
      "start_timestamp_seconds": 692.4878048780488,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=692"
    }
  },
  {
    "text": "don't count in the MBBO? No, they didn't do that. And so much of retail trading today is in odd lots and so much liquidity out there is in odd lots because of these high priced names. So, and then finally, it's bullshit because when they take all of this order flow and they gobble it up into these two big companies, they are damaging the market. So, it actually widens spreads for the entire market. The best estimate I've seen of the impact of that is that it widens spreads by 25 or more. That's a huge multi-billion dollar cost to the economy and to the industry. And nobody's even talking about that. And so, that's like saying, you know, okay, I'm going to raise my price by 25 and then oh, you look nice. I'm going to give you 10 off that price. Aren't I so nice? Right there is your price improvement. That's what, you know, so it's all bullshit. And so the entire sort of ecosystem that has cropped up around the discount brokers and wholesalers is a really corrupt one. And it's one in which brokers are not getting best execution. And it's one in which the markets are being damaged by its very existence. And so that's what we're pushing to get rid of and to get those retail orders either on to the exchange where hundreds of people can compete for them or into some kind of transparent venue that allows for open",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 41,
      "start_timestamp": "00:13:11",
      "start_timestamp_seconds": 791.4146341463414,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=791"
    }
  },
  {
    "text": "which the markets are being damaged by its very existence. And so that's what we're pushing to get rid of and to get those retail orders either on to the exchange where hundreds of people can compete for them or into some kind of transparent venue that allows for open competition for order flow. So that's it. The most important part of all this is today, it's essentially a duopoly. It's an anti-competitive system. And I just believe in competition. You know, I'm funny that way. I'm a capitalist, you know, I believe in open competition and that leads to optimal outcomes. And so that's why we believe that we should get rid of the middlemen and let everyone compete over these orders. So just for the people that might not be familiar with what that could look like. So let's say best case scenario is granted and, you know, the petition that you guys are working on is accepted and they, you know, take on board all of the suggestions. What would the markets look like on the back end of that? I think the markets would look a lot simpler. That's the most important thing that I believe in is today markets are very complex. You have 16 stock exchanges, 40 dark pools and ATSs. You've got things that are called SDP, single dealer platforms being run in an almost unregulated way. You know, it would get rid of a lot of that. And it would really simplify",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 41,
      "start_timestamp": "00:14:50",
      "start_timestamp_seconds": 890.3414634146341,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=890"
    }
  },
  {
    "text": "in is today markets are very complex. You have 16 stock exchanges, 40 dark pools and ATSs. You've got things that are called SDP, single dealer platforms being run in an almost unregulated way. You know, it would get rid of a lot of that. And it would really simplify things. And I think that if we can get closer to a market that is not as fragmented and gives everyone an opportunity to find each other in a more efficient way, that would be a better outcome. And we hear a lot that the US has the deepest, most liquid markets in the world. It's not even close to true. That's like a political slogan or something. I just a very US thing to say. You know, we just messed everything. Right. Exactly. It's just quantitatively not true. You can look at many other markets that have better liquidity and lower execution costs when you adjust for things like company size. You know, yeah, the US has the biggest companies, but not the best markets. And they always say, well, retail has never had it better. And even that, I'm not even convinced that's true. But even if it is, it doesn't mean that we've arrived at a good outcome. We retail could have way better institutions could have it way better. And that should matter to every retail investor because, you know, the majority of the wealth of the United States and many other countries is concentrated in",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 41,
      "start_timestamp": "00:16:29",
      "start_timestamp_seconds": 989.2682926829267,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=989"
    }
  },
  {
    "text": "is, it doesn't mean that we've arrived at a good outcome. We retail could have way better institutions could have it way better. And that should matter to every retail investor because, you know, the majority of the wealth of the United States and many other countries is concentrated in pension plans and mutual funds and ETFs. And that is the institutional money that we should want to be able to execute as efficiently or more efficiently than the retail speculator. And so, you know, I think that when I think of what a better market structure would look like, it's a simpler one in which retail and institutions can hit each other directly without all of this unnecessary intermediation. Now would you still advocate for dark pools? Would they still exist in this world or would you completely want to get rid of them? And if so, where do you block orders go? Oh, yeah. I believe the dark pools should exist. I think they have, you know, an important function in markets. I think it's important to understand and a lot of people tend to confuse the point that retail orders pretty much never go into a dark pool. Dark pools are for institutions. But like you said, have big blocks and they want to see if they can find a counterparty to that trade without hitting the exchange and without impacting the price significantly. I think, again, there should be far fewer dark pools. But dark pools",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 41,
      "start_timestamp": "00:18:08",
      "start_timestamp_seconds": 1088.1951219512196,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=1088"
    }
  },
  {
    "text": "pool. Dark pools are for institutions. But like you said, have big blocks and they want to see if they can find a counterparty to that trade without hitting the exchange and without impacting the price significantly. I think, again, there should be far fewer dark pools. But dark pools are a place for innovation and for, you know, creativity. And I think that that's a good thing. I just think it should be harder to create one if you have a conflict of interest. And so today, a lot of dark pools are operated by institutional brokers. And they are routing the orders of asset managers and operating dark pool. And that's a huge conflict of interest because they are incentivized to preference that dark pool over other potential better sources of execution quality because it's a way for them to save money. So anytime there's a conflict like that, I think it's really important for us to identify the conflict and make sure that it's the kind of thing that we get rid of. You know, I prefer to get rid of conflicts versus disclose them away. And that's, you know, the regulatory instinct is to focus on disclosure. And I think disclosure can be important. But, you know, disclosure does not fix conflicts of interest. And it's a big problem when you think you can fix it with just with disclosure. Right. Which leads me to like a genuine personal question that I've had is, why don't",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 41,
      "start_timestamp": "00:19:47",
      "start_timestamp_seconds": 1187.121951219512,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=1187"
    }
  },
  {
    "text": "disclosure. And I think disclosure can be important. But, you know, disclosure does not fix conflicts of interest. And it's a big problem when you think you can fix it with just with disclosure. Right. Which leads me to like a genuine personal question that I've had is, why don't dark pools? Why isn't there more cannibalization among them? I was always curious why there's so many that are able to operate against one another. How does that work? Yeah, I think it's a huge problem for markets. I think fragmentation is a huge problem for markets. And the fact that you have all of these dark pools and they don't seem to go away, it again, a big part of it is because they don't really need to make money. You know, that when they're operated by a broker, the point is that it's saving the broker a lot of money any time it finds a fill in its own dark pool. Right. And so that, you know, they'll just operate because it's a cost avoidance mechanism. And that's the problem. So you get a ton of them and it's like, you know, you have these big blocks and their ships passing each other in the night. They can't find each other because one is in the UBS dark pool and one's in the Goldman dark pool and another one might be over in Credit Suisse and, you know, Narrow the Twain Shell Meat. And so it's a big",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 41,
      "start_timestamp": "00:21:26",
      "start_timestamp_seconds": 1286.0487804878048,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=1286"
    }
  },
  {
    "text": "their ships passing each other in the night. They can't find each other because one is in the UBS dark pool and one's in the Goldman dark pool and another one might be over in Credit Suisse and, you know, Narrow the Twain Shell Meat. And so it's a big problem. Got it. Yeah, that makes a lot of sense. I hadn't really thought of it that way. Yeah, I was, because I like to follow dark pool flow. It's more just out of curiosity. I just think it's interesting. But I was always wondering why there are so many of them able to exist simultaneously. It seemed strange to me. But yeah. It's, and it's, it's symptomatic of something, which is that, you know, the entire sort of ATS structure is not really set up for regulators to say no to things. So I think that's part of the problem, but it's the same thing is true in the exchange space. You know, we have 16 stock exchanges. Why? Why do we need 16 stock exchanges? And they don't compete over nothing but fee structure. And they're all subsidized by the public. Right? So hundreds of millions of dollars every year goes from public, the public into the stock exchanges. And these are for profit publicly traded companies. And they're getting a hundred million dollars a year each, the three major exchange families, Naising, Nasdaq and CBOE. And all because they are the ones in charge of setting the",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 41,
      "start_timestamp": "00:23:04",
      "start_timestamp_seconds": 1384.9756097560976,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=1384"
    }
  },
  {
    "text": "every year goes from public, the public into the stock exchanges. And these are for profit publicly traded companies. And they're getting a hundred million dollars a year each, the three major exchange families, Naising, Nasdaq and CBOE. And all because they are the ones in charge of setting the fees of the securities information process or the public market data feed. So they set the fees very high because it brings in a huge subsidy to them. It makes it so unprofitable exchanges can be operated because that's what subsidization does. And that allows inefficiency to thrive. And it's a crazy outcome. And it's a problem, it's a real problem for U.S. markets. And so, you know, part of what the change that I'd like to see from regulators is them to start saying no to its changes. I'd like them to get rid of the SIP subsidy or at least dramatically reduce it. It's just supposed to be the cost of operating the SIP, not this massive hundred million dollar a year subsidy that goes to each exchange family. And I'd like to see far fewer stock exchanges who can innovate and compete on real features and execution quality rather than, you know, who can give the biggest rebate to which firm. So aligning two different kind of contrasting concepts when we're talking about payment for order flow, there's a bit of a do-oply there. And then when we're talking about the exchanges, there's fragmentation. So what's the",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 41,
      "start_timestamp": "00:24:43",
      "start_timestamp_seconds": 1483.90243902439,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=1483"
    }
  },
  {
    "text": "quality rather than, you know, who can give the biggest rebate to which firm. So aligning two different kind of contrasting concepts when we're talking about payment for order flow, there's a bit of a do-oply there. And then when we're talking about the exchanges, there's fragmentation. So what's the middle ground? What should there be for? Should there be two? Should there be five? What do you think the right number of exchanges is to find that balance? I think there should be like three exchanges and three dark bulls. But, you know, I don't think we should live in a world in which someone picks a number and says, this is it, right? Like, you know, the Fed does. I kind of believe in markets, but again, I think that both structures, the extremely concentrated, you know, wholesaling and payment for order flow system and the extremely fragmented exchange system, they both have something in common, which is, you know, there's sort of the consequence of regulation. And so, you know, often what I will get accused of is wanting way more regulation. And it's just, it's not the case at all. I want better regulation, but, you know, I want to peel back regulations, right? Like, the, the, the, the do-oply that exists in the payment for order flow and wholesaling world only exists because of regulation. We should get rid of that. We should say that, you know, trades should take place on exchange. That should",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 41,
      "start_timestamp": "00:26:22",
      "start_timestamp_seconds": 1582.8292682926829,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=1582"
    }
  },
  {
    "text": "know, I want to peel back regulations, right? Like, the, the, the, the do-oply that exists in the payment for order flow and wholesaling world only exists because of regulation. We should get rid of that. We should say that, you know, trades should take place on exchange. That should be sort of the guiding light in U.S. markets as it is in many other markets. You know, that's, that's a principles-based approach. Trade should take place on exchange. There might be exceptions to that rule like for block trades, but generally speaking, trades should take place on exchange, right? And on exchange, they, that's where you can get competition, open competition. And then the other side of it is we should not subsidize inefficient companies, right? A subsidy from the public of hundreds of millions of dollars a year that results in, you know, just crazy fragmented exchange, you know, set of exchanges is the other, it's a different problem. And so, again, you get rid of that kind of subsidization and then you let market forces, you know, find the optimal outcome. I love that part. That's such a great, a great sentence to end on allowing market forces to find that, because that's really what I believe in to add my completely unsolicited opinion is. I think that that's just a really effective way to go about it. If the backend structure is there, it seems like that medium would be found. So another related topic that's",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 41,
      "start_timestamp": "00:28:01",
      "start_timestamp_seconds": 1681.7560975609754,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=1681"
    }
  },
  {
    "text": "forces to find that, because that's really what I believe in to add my completely unsolicited opinion is. I think that that's just a really effective way to go about it. If the backend structure is there, it seems like that medium would be found. So another related topic that's in the petition, which I will absolutely make sure I throw in the link in the video description so that people can go check that out. Right now it looks like there's 71,118 people that have signed out of 75,000 and there's 20, what, 32 hours left to go. There's a day and eight hours, something like that. Yeah. So, there's still a little time for people to get involved. I'll make sure I get this video. I'll probably try to dump it out later today so that today's the 23rd, just so that people have time to synthesize and hopefully check this out. Another interesting thing that you call out in the petition is kind of this concept of price discovery. So I wanted to hone in on that specifically because I think that price discovery is one of those things that people, I mean a lot of this is things that people don't think about. But I view price discovery as even like a further subset of that. And I think it has an outsized impact for the level of attention it gets. So I would love to get your take on why you get specifically called price",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 41,
      "start_timestamp": "00:29:40",
      "start_timestamp_seconds": 1780.6829268292681,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=1780"
    }
  },
  {
    "text": "is things that people don't think about. But I view price discovery as even like a further subset of that. And I think it has an outsized impact for the level of attention it gets. So I would love to get your take on why you get specifically called price discovery out in here and kind of the status quo as it is right now for price discovery. Yeah. So markets exist for two reasons and it's very easy to lose sight of this. We like to trade. We like to, you know, they can feel like casinos often. You can say gamble. That's for a lot of people who do. You know, there's no way around it, right? And, you know, I believe me, I've been on Wall Street long enough that it attracts gamblers, right? It's the gambling leverage and it can be fun, right? And especially when you hit one. But markets do not exist to facilitate gambling and casino like behavior. There's a few reasons. Capital formation price discovery, right? And good companies and figure out what those companies are worth over time as the world changes and as those companies change. And so capital formation happens generally in the primary market. That's when you go public. You raise a ton of money and you list your company publicly. And then your shares are floating in the public. They are being traded and the price should reflect supply and demand. It's that sort of, you know,",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 41,
      "start_timestamp": "00:31:19",
      "start_timestamp_seconds": 1879.6097560975609,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=1879"
    }
  },
  {
    "text": "happens generally in the primary market. That's when you go public. You raise a ton of money and you list your company publicly. And then your shares are floating in the public. They are being traded and the price should reflect supply and demand. It's that sort of, you know, random walk over time that is what determines what the company is worth on the secondary market and helps companies to raise money down the line. You know, issue secondary offerings, issue compensation to their employees, reward, you know, have their employee, early employees rewarded as that grows over time. All sorts of things are sort of tied up in this price discovery process that is what is this thing worth. And the most important part of the price discovery process is that the NBBO, the national best bid and offer in the market, reflects the supply and demand of that stock. And so when you, first of all, when you take all of this buying or selling activity from retail and siphon it off, sit it all in virtue, the NBBO stops reflecting that supply and demand. Right. So part of the effects are that the spread widens, like we've talked about, but it is very plausible to think that one of the effects of that can be that the direction of the price can be altered. And so, you know, when I send a buy order in as a retail investor and it gets internalized by Citadel or",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 41,
      "start_timestamp": "00:32:58",
      "start_timestamp_seconds": 1978.5365853658534,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=1978"
    }
  },
  {
    "text": "we've talked about, but it is very plausible to think that one of the effects of that can be that the direction of the price can be altered. And so, you know, when I send a buy order in as a retail investor and it gets internalized by Citadel or virtue and I get my fill back, you know, that trade prints to the tape. And I know that that buy happened, but what that buy order didn't do is it didn't hit the offer, right? It didn't actually hit the orders that are out there being broadcast in the market. So it didn't impact the NBBO in the same way as if that order had been sent to an exchange and hits the NBBO. And so that really can serve to hinder the price discovery process as well. And so I do think that that's a problem that internalization and wholesaling lead to. And then, you know, there's an entire other side of this that gets into short selling. And what the impact of short selling is on the market. And I'm not someone who will argue against short selling broadly speaking. I think you should be able to short something just like you should be able to go long something. I think it has an important impact. And it's an important force in markets to keep things in line. And I think I've seen enough research to know that short selling bands either have negative effects on the",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 41,
      "start_timestamp": "00:34:37",
      "start_timestamp_seconds": 2077.4634146341464,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=2077"
    }
  },
  {
    "text": "short something just like you should be able to go long something. I think it has an important impact. And it's an important force in markets to keep things in line. And I think I've seen enough research to know that short selling bands either have negative effects on the price discovery process or no effect. And, you know, it's not entirely clear. But again, it's enough to tell me that it's an important feature of markets. But when someone shorts something, they are creating more supply. Right? That's the nature of short selling. I'm borrowing 100 shares from investor A. And I'm selling them to investor B. And now investor A and B both are holding 100 shares. But only 100 exist. And they're being borrowed and then replicated essentially. And so to a certain degree, that's fine. But when it starts to exceed certain thresholds or when there are failures to deliver that don't get remediated, that creates this idea of synthetic shares, which increases the supply of shares in the market. And again, that conserved it. What happens when supply increases? Price drops. That's very straightforward impact on supply and demand. And I don't know that it's something that regulators are paying enough attention to. That's awesome. And I appreciate the explanation. It's just something that I think, again, I think that the effects are subtle enough that a lot of people don't really synthesize them totally. But I do think that they're profound over time. And",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 41,
      "start_timestamp": "00:36:16",
      "start_timestamp_seconds": 2176.390243902439,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=2176"
    }
  },
  {
    "text": "something that regulators are paying enough attention to. That's awesome. And I appreciate the explanation. It's just something that I think, again, I think that the effects are subtle enough that a lot of people don't really synthesize them totally. But I do think that they're profound over time. And another kind of dovetail off of that. I saw a tweet that you put out, always my favorite to see what tweets you got going on. And there was one that you put out on the 19th about breaking up the Google and Facebook ad exchange monopolies. So a little bit of a changing gear, but I would be remiss if I didn't bring up a chance to talk about Facebook and your love for them. And for anybody that's just listening, that's just not true at all. Not a big fan. So, but anyways, can you talk to me a little bit about that tweet? And specifically, what you're targeting when we're talking about the ad monopoly between Google and Facebook. And the reason why I bring it up now is a lot of the conversation we've had so far has been very centered on this same kind of concept. It's a different space, not exactly markets, but two very big market players. And they're exerting their power. So I'd love to hear just your take on what is going on between Google and Facebook, the ad exchanges. And then kind of where we're trying to go with this.",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 41,
      "start_timestamp": "00:37:55",
      "start_timestamp_seconds": 2275.317073170732,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=2275"
    }
  },
  {
    "text": "concept. It's a different space, not exactly markets, but two very big market players. And they're exerting their power. So I'd love to hear just your take on what is going on between Google and Facebook, the ad exchanges. And then kind of where we're trying to go with this. Yeah, thanks for bringing it up. It's a thing that I'm so fascinated by and passionate about. And it's not what I do on a day-to-day basis. But I was fortunate enough to get to work with some folks in the Senate who were writing this bill. And the idea was that Google and Facebook and other firms as well run these ad exchanges. And it's become a really substantial economic force. It's responsible for a giant chunk of each of those firms revenue. And those are two of the most valuable firms in the world. And not only do they operate in exchange, but they also operate the brokers. So they have brokers that they operate to buy ads, brokers they operate to sell ads, they operate the exchange. And then from a trading perspective, who even knows what's going on? There's no transparency into these operations whatsoever. Just a quick note. I pulled it up for Facebook. Well, meta right now advertising is 94.9 essentially of their value duration for market caps. So it just bolsters your point that they're very interested in ads. Yeah, that's right. And so they operate these exchanges. And they have complete control",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 41,
      "start_timestamp": "00:39:34",
      "start_timestamp_seconds": 2374.243902439024,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=2374"
    }
  },
  {
    "text": "a quick note. I pulled it up for Facebook. Well, meta right now advertising is 94.9 essentially of their value duration for market caps. So it just bolsters your point that they're very interested in ads. Yeah, that's right. And so they operate these exchanges. And they have complete control almost over every aspect of what's taking place on those exchanges. And there's no transparency at all. So the idea that I was approached with was, can we take these ad exchanges and kind of fit them into the current framework of financial regulation? And because in financial regulation, you've got decades of established precedent and case law and regulatory approaches and a lot of experienced people out there. And I thought, wow, what a great idea. It was so fascinating to me. And so I said, yeah, I'd love to sort of think about how you could do that and doesn't make sense and what can we focus on? And so I worked with them and I'm very pleased with the bill that came out of it. And it's a bill that has a lot of bipartisan support. I mean, it's being co-sponsored by both like Senator Mike Lee from Utah and Amy Klobuchar of Minnesota, right? Like, both sides are interested in this bill amongst other antitrust bills aimed at big tech. And this is the kind of thing that would first break up the monopoly. So that's part of what I think is the most revolutionary about",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 41,
      "start_timestamp": "00:41:13",
      "start_timestamp_seconds": 2473.170731707317,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=2473"
    }
  },
  {
    "text": "from Utah and Amy Klobuchar of Minnesota, right? Like, both sides are interested in this bill amongst other antitrust bills aimed at big tech. And this is the kind of thing that would first break up the monopoly. So that's part of what I think is the most revolutionary about this particular bill. It is taking aim square at these firms and it is saying, they need to be broken up, which is a very standard approach to antitrust. But it's really the first time that Congress, at least that I'm aware of, has said, we support that kind of intervention because it's the only thing you can really do with firms of this size. So you start by breaking them up and you don't let them operate both brokers and the exchange. You provide disclosure and transparency around how brokers are routing to different ad exchanges and what kind of execution quality they're getting. So very analogous to US financial markets. You put a duty of best execution onto these brokers. And in fact, the duty of best execution in the bill would be stronger than the one in US financial markets. It would be an order by order standard, which is one that I've advocated for in US markets for many years now. And so there are all sorts of other details in the bill. One, another one is about data ownership that people will own their own data, which is, it might seem like a really minor",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 41,
      "start_timestamp": "00:42:52",
      "start_timestamp_seconds": 2572.0975609756097,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=2572"
    }
  },
  {
    "text": "standard, which is one that I've advocated for in US markets for many years now. And so there are all sorts of other details in the bill. One, another one is about data ownership that people will own their own data, which is, it might seem like a really minor thing. But today in the stock market, when you send an order, you don't own that order information. The exchange actually ends up owning it. And then they turn around and they sell that with these high speed data feeds and proprietary data feeds for exorbitant amounts of money. So just that little detail of wait, you should own your data, not the exchange could also prevent a huge set of problems and conflicts of interest in the ad market that we already see in financial services. So I think it's great. I think the big tech monopolies are one of the most destructive forces in the US, in the world. And I think, again, I believe in competition. And I believe that when you get concentrated corporate power, you have to intervene in order to try and break things up and try and increase competition. That's awesome. Yeah, I had a chance to go through the post and then the publication. And I thought that that was very educational. All linked to those two as well in case anybody wants to check it out. And then for those that don't know, Dave also wrote kind of a, I would",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 41,
      "start_timestamp": "00:44:31",
      "start_timestamp_seconds": 2671.0243902439024,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=2671"
    }
  },
  {
    "text": "had a chance to go through the post and then the publication. And I thought that that was very educational. All linked to those two as well in case anybody wants to check it out. And then for those that don't know, Dave also wrote kind of a, I would almost call it like a burn piece on Facebook's model in terms of the way that they create space for people to have passionate disagreements. Yeah. Really, you know, the argument to summarize, you know, it seems like the argument is that there's, they use conflict as a way to try and, yeah, drive engagement. So that's another just fascinating read. And it's another perspective that I honestly, I don't use social media that way personally. So I don't see a lot of that. But once you pointed it out, it makes a ton of sense because, you know, drama is just a big thing, you know, that draws a lot of people's attention, whether it's good or bad, it sells, same thing, news agencies, stuff like that, use that. So I thought that was a really interesting take on it. So we have a couple minutes left. I've got to be efficient with our time. And there's a couple of things that I want to go over so the first off last time we spoke was a couple of months ago, maybe, and you were talking to me about avalanche. Talk to, don't worry, I'm letting you off the",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 41,
      "start_timestamp": "00:46:09",
      "start_timestamp_seconds": 2769.951219512195,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=2769"
    }
  },
  {
    "text": "to be efficient with our time. And there's a couple of things that I want to go over so the first off last time we spoke was a couple of months ago, maybe, and you were talking to me about avalanche. Talk to, don't worry, I'm letting you off the hook on the other one. Talk to me. I was sure we were going to talk about that. That's okay. We can talk about it. Oh, no. What? You know what? I'm leaving that one alone. I'm just kind of letting the tape speak for itself. Yeah, I, you know, I think I still think that we are in some extraordinary circumstances. But, you know, I probably underestimated the force of the Fed in those circumstances. But, but when you look at oil as a result of this, you know, stupid war, hard to argue that some structural inflation isn't in place right now. Yeah. I didn't say anything. Back to avalanche. But I am genuinely curious. I look at the crypto market and I continue to struggle to place what it does. Like, and I mean that just in terms of how does it fit into the broader markets? There's lots of people, it was an inflation hedge. That hedge you work in, you know, it's the new goals. And, you know, apparently gold is extremely volatile. If that's the, you know what I mean? It's just like, I see a lot of different arguments on what it does.",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 41,
      "start_timestamp": "00:47:48",
      "start_timestamp_seconds": 2868.8780487804875,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=2868"
    }
  },
  {
    "text": "There's lots of people, it was an inflation hedge. That hedge you work in, you know, it's the new goals. And, you know, apparently gold is extremely volatile. If that's the, you know what I mean? It's just like, I see a lot of different arguments on what it does. And beyond the aspirational side of things, I had a chance to look at a little bit more, like specifically avalanche and some of the current technology and stuff like that. But I would just love to get an update from you on, you know, just what you think about avalanche today. And what your general disposition is towards it in terms of how does it fit into the broader cryptocurrency slash blockchain space? Sure. And, you know, I think crypto is a space. So I, I mean, I was, I think I've talked about it before. I bought Bitcoin now 11 years ago. I did not hold on to that Bitcoin, of course. But I have been in this market for as long as, you know, most others. It is not my full-time job. There are plenty of people that have done that for much, for a very long time now. But, you know, I have been through, I don't know, this will be the fourth. I think crypto winter. And so the price drops, they don't mean much to me. They happen regularly. And so, you know, it is, it's a brand new asset class. It's extremely volatile.",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 41,
      "start_timestamp": "00:49:27",
      "start_timestamp_seconds": 2967.80487804878,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=2967"
    }
  },
  {
    "text": "time now. But, you know, I have been through, I don't know, this will be the fourth. I think crypto winter. And so the price drops, they don't mean much to me. They happen regularly. And so, you know, it is, it's a brand new asset class. It's extremely volatile. Is it potentially a long-term store of value? I think so. I think, and I think you different crypto's serve different purposes. So, Bitcoin is what I would call, you know, a potential long-term store of value, a potential inflation hedge. It has become highly correlated to equity markets for all sorts of reasons. But, you know, if you do believe that inflation is problematic in the long run, and you are looking for something that is, you know, controlled from that perspective, Bitcoin is very appealing in that way. Right. As for Avalanche, when I first learned about it, first, I was looking to better understand proof of stake, and I was looking for something that had the flexibility for broad adoption. And Avalanche really fit the bill. It's proof of stake and consensus algorithm. I thought we're so innovative when I first learned about it, that it was almost enough for me just to jump in based on that. But, but the, some of the features that the network has, and it's complicated, but, you know, there's a thing called subnets, which allow you to sort of stand up another chain on the Avalanche network and completely control",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 41,
      "start_timestamp": "00:51:06",
      "start_timestamp_seconds": 3066.731707317073,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=3066"
    }
  },
  {
    "text": "almost enough for me just to jump in based on that. But, but the, some of the features that the network has, and it's complicated, but, you know, there's a thing called subnets, which allow you to sort of stand up another chain on the Avalanche network and completely control the characteristics of that chain, so that you can have completely regulated systems that are perfectly compliant on top of the Avalanche chain, for example. And so I do think that over time, it's one of the few that will win out. And, and, you know, I've been a big fan of it for a while. You know, look, the price has been extremely volatile. A year and a half ago, it was trading, you know, for almost nothing. Now it's in the 30s. It was trading in highs, highs like 160 at one point, which was crazy. Fun, but, you know, crazy. But, you know, I think that what you're looking at, what you're looking for in a crypto currency, is you're looking for something that is actually decentralized. Which is, and, and especially relative to some of the other proof of stake systems out there. Avalanche is far more decentralized. You're looking for something that is being used today. And the fees being generated on Avalanche are, are like the, you know, four, top four or something behind Bitcoin Ethereum and Binance. And you're looking for something that's cheap and fast. And that's what Avalanche is. It's extremely",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 41,
      "start_timestamp": "00:52:45",
      "start_timestamp_seconds": 3165.6585365853657,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=3165"
    }
  },
  {
    "text": "more decentralized. You're looking for something that is being used today. And the fees being generated on Avalanche are, are like the, you know, four, top four or something behind Bitcoin Ethereum and Binance. And you're looking for something that's cheap and fast. And that's what Avalanche is. It's extremely cheap and extremely fast. And so, to me, that means that it can form the basis of a future financial system, right? It can disintermediate large financial institutions. It can help to collateralize or securitize things without needing those kinds of institutions. It can facilitate loans without needing those kinds of institutions. You can use it for, you know, mortgages and real estate transactions. Eventually, you can use it for, you know, offerings, like token offerings, litigation offerings. So, I think that the problem is you're looking for, okay, well, what does it do today? What is it really fixing or changing? And the problem is, again, it's early days. Avalanche has hardly been around a year and a half now. And so, it's, you know, it's still growing into what it will be. And a lot of crypto, you can say the same thing. But I think that there's some fascinating stuff in smart contract technology that can help to address issues in US equity markets, for example, and the settlement and clearing side of the business. I think there are some really interesting things in terms of like tokenization and securitization that, you know, you can get rid,",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 41,
      "start_timestamp": "00:54:24",
      "start_timestamp_seconds": 3264.5853658536585,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=3264"
    }
  },
  {
    "text": "some fascinating stuff in smart contract technology that can help to address issues in US equity markets, for example, and the settlement and clearing side of the business. I think there are some really interesting things in terms of like tokenization and securitization that, you know, you can get rid, you know, functionally of a lot of counterparty risk in systems like this. So, you know, I think that crypto has a use case. It has functionality. But up until now, it's still been the purview of a small set of people because the user experience isn't there and the interfaces aren't there to make it accessible to the average person. And, you know, think what you will of NFTs, for example, but NFTs have helped to address that because they've helped to make crypto a bit more accessible. And, you know, I love art. I love artwork. And I think that NFTs are a fascinating new medium of art. And I think that, you know, people that kind of dismiss it are sort of missing the point, right? Like they're like, oh, well, I can just right click and download an NFT. It's like, yeah, I can go take a picture of the Mona Lisa. But, you know, like, that doesn't mean that I own the Mona Lisa, right? There's a difference. And that difference has always been sort of a characteristic of visual art. And I think always will be. So, you know, I think that I'm, I",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 41,
      "start_timestamp": "00:56:03",
      "start_timestamp_seconds": 3363.5121951219508,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=3363"
    }
  },
  {
    "text": "a picture of the Mona Lisa. But, you know, like, that doesn't mean that I own the Mona Lisa, right? There's a difference. And that difference has always been sort of a characteristic of visual art. And I think always will be. So, you know, I think that I'm, I don't know, I love it. And I love the space that it's creating. And it's like, but I also see crypto rediscovering a lot of securities law. And it's very funny to see it's like, wait, we didn't have investor protection. Or, you know, like this, this Luna UST thing happens. Like, wait, we didn't have depository insurance. What's going on here? And so, you know, I think that that's going to happen. And the space is going to recognize the value of securities laws in a lot of ways. But maybe eventually the two worlds will come together in a more efficient, decentralized, disintermediated way, which is again, sort of thematic of a lot of the stuff that I like to talk about. Yeah, that's awesome. I'm definitely, I'm one of those people that I don't personally understand NFTs in terms of like the appeal, but I get the appeal for other people. And I could see how, you know, I was watching people, you know, talk about like what he does. And I think the stuff he makes is wild, which is kind of cool. But then, yeah, I like, I can, I can see that. I'm not",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 41,
      "start_timestamp": "00:57:42",
      "start_timestamp_seconds": 3462.4390243902435,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=3462"
    }
  },
  {
    "text": "appeal for other people. And I could see how, you know, I was watching people, you know, talk about like what he does. And I think the stuff he makes is wild, which is kind of cool. But then, yeah, I like, I can, I can see that. I'm not very artistic myself. I don't have that part of my brain, but, yeah, maybe I think my favorite part about the NFTs, I got to be honest with you is when somebody has, you know, the NFT, and then they come up with like a digital display for it. That, because then I'm thinking like that's, that's just art. Just get a painting, man, like you're right there. But then, you know, it doesn't have lights and all that cool stuff. So I get, I get what people like it, but I do just get such a kick out of that. You want like a digital piece of art to display physically that sounds like a physical piece of digital art. You know, but I mean, people like, people were dismissive of, you know, pop art and street art and Banksy and that kind of stuff. And, you know, in the end, they were wrong and art is art, right? Like, it's like, I don't pretend to understand it. I know a good piece that like speaks to me and resonates with me. And I've seen NFTs like that. And I've seen real art like that. And yes, you know,",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 41,
      "start_timestamp": "00:59:21",
      "start_timestamp_seconds": 3561.3658536585363,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=3561"
    }
  },
  {
    "text": "the end, they were wrong and art is art, right? Like, it's like, I don't pretend to understand it. I know a good piece that like speaks to me and resonates with me. And I've seen NFTs like that. And I've seen real art like that. And yes, you know, that's, what can you do? I think it's easy to not understand this world and to be dismissive of it. But, you know, I just think that's probably, you know, a boomer thing. I think so too. Yeah, I really do. And I also think that, you know, that's like one of the downfalls of a lot of people is, you know, if they don't immediately understand something that they dismiss it. Yeah. You know, like, because I honestly think NFTs are actually going to be kind of prolific for at least, you know, until there's a new iteration of them or something. But just because I don't personally understand them totally, it doesn't mean, you know, that they're effectiveness or their audiences and they're, because I think it's exactly as you said, a lot of it comes down to the individual interaction with that art. And people react to different pieces of art in different ways. And I think that that's where it comes from. Yeah. It does seem like a lot of people though are hesitant because it's like, there's just a money grab. There's so many people, you know, just piling into the space. But what art",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 41,
      "start_timestamp": "01:01:00",
      "start_timestamp_seconds": 3660.292682926829,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=3660"
    }
  },
  {
    "text": "different pieces of art in different ways. And I think that that's where it comes from. Yeah. It does seem like a lot of people though are hesitant because it's like, there's just a money grab. There's so many people, you know, just piling into the space. But what art doesn't do that, right? It's the same thing. Exactly. It's the same thing, right? Same thing. Like that same new crypto. Like everyone's like, oh, it's just a scam. It's a Ponzi. It's like, well, you know, like welcome to markets, right? How many scams and Ponzi's are there in markets? Like, you know, is isn't a shock to anyone? You know, that's what I mean. It's like crypto rediscovering securities laws. And you know, all these frauds and scams, that's just sort of human nature to try and, you know, commit crime and rip people off. And it's human nature to, you know, want easy money or want to get rich quick. And, you know, so just because you can do it online versus do it, you know, I don't know, over email for doing it, you know, in a physical place. I don't know. There's big difference there. Yeah. Yeah. I agree. Well, I know that we are at time. I appreciate you hanging out with me for a while. I definitely am looking forward to connecting with you again in the next, you know, a couple of months to take a pulse check on how things are",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 41,
      "start_timestamp": "01:02:39",
      "start_timestamp_seconds": 3759.2195121951218,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=3759"
    }
  },
  {
    "text": "Yeah. Yeah. I agree. Well, I know that we are at time. I appreciate you hanging out with me for a while. I definitely am looking forward to connecting with you again in the next, you know, a couple of months to take a pulse check on how things are going. I'm really excited to see, you know, the terminal continue to grow, which is the platform that that you're working on. And I think that that's going to be such a great tool for retail traders. So I am really excited to hear more about that. And yeah, I just always enjoy the conversation. I think that getting your perspective on things is always fascinating because you are definitely plugged into a different audience than a lot of us are. And thank you for taking the time to bring that perspective, you know, to the broader communities. We really do appreciate it. Yeah. I'm happy to. I always enjoy the conversation too. Yeah, like I'm excited next time I'll be able to show you. I think a bit more of the terminal. It's coming along. We're just we're moving real fast now. We're just opening it up. We open it up on Friday to our investors. And we should be opening it up to the beta wait list in a few weeks. And we're just we're so excited to show like all the different great data sets we've brought together, different ways of looking at them. And more importantly,",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 41,
      "start_timestamp": "01:04:18",
      "start_timestamp_seconds": 3858.146341463414,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=3858"
    }
  },
  {
    "text": "it up on Friday to our investors. And we should be opening it up to the beta wait list in a few weeks. And we're just we're so excited to show like all the different great data sets we've brought together, different ways of looking at them. And more importantly, learning, you know, how to use them. What do they mean and how to get better at investing and hopefully, you know, building long-term wealth? Yeah, I absolutely love it. I am so stoked to check it out more. I get excited every time I see a little bit more come out about it. So yeah, I'm looking forward to seeing what it does. Awesome. Thanks Eric. All right Dave. Well, thanks for chatting and we will catch you in a few weeks. Yep, sounds great. Thanks for having me.",
    "metadata": {
      "video_id": "aCj7f_NDuFA",
      "title": "Dave Lauer - Market Conflicts of Interest || Money Talks",
      "url": "https://www.youtube.com/watch?v=aCj7f_NDuFA",
      "upload_date": "",
      "duration": 2908.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 41,
      "start_timestamp": "01:05:57",
      "start_timestamp_seconds": 3957.073170731707,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aCj7f_NDuFA&t=3957"
    }
  }
]