[
  {
    "text": "Let's talk about trading earnings with options. Why would you do this? I'm going to walk you through exactly that. I'm going to walk you through the way we can structure different strategies around earnings. And at the end of the video, I'm going to walk you through exactly how I think about trading earnings with options and then some best practices. So what's up everybody? Eric here. We'll come back to all the outliers. Shout out to the Patreon family and the YouTube members with that. Let's get right into it. Let's start off with the hypothesis. I wish I was high on partners. This is why we even bother trading earnings with options. And it's because when we're in an earnings cycle, we're getting a lot of new information. Companies are reporting how they're doing at a point in time. They're giving their details on how they performed over the past quarter. But then what my face is blocking right here is they're also helping us understand the future projections. So we want to have an idea of how this company is going to do going forward. And this helps us with that. So as you can imagine, there's a lot of information wrapped around these events. These are what we like to call binary events. Meaning there can be a big move after this event up or down binary because a lot of information is being released at once. Now, just a quick add-in note. Sometimes some",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "there's a lot of information wrapped around these events. These are what we like to call binary events. Meaning there can be a big move after this event up or down binary because a lot of information is being released at once. Now, just a quick add-in note. Sometimes some of the details of an earnings report will be leaked early. And you can even kind of find that in the options. It's not super common. It's illegal. But sometimes you can see it. But anyways, when we're talking about earnings releases, there's essentially a calendar that tells us when they're coming. And I can show you that in just a second. And you'll notice here, we have AM or PM. That is when the earnings are going to be announced. So if we come over here to the platform and today is the 12th of May, and we're looking out at an upcoming earnings release. So this is the 16th of May and I see HD, which is Home Depot. So down here, if I highlight that, you can see that this is the Q1 earnings release. And it'll tell you when it's estimated to be announced. So in this case, it's before the market. And if we take a look at a chart, a lot of times you can even see previous earnings releases. And when those were announced, so in this case, the last earnings they announced was on the 21st of February. And that was also",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "this case, it's before the market. And if we take a look at a chart, a lot of times you can even see previous earnings releases. And when those were announced, so in this case, the last earnings they announced was on the 21st of February. And that was also before the market. They tend to report around the same time frame each year. So now we know that there's an event coming up with a lot of new information. If you trade options, what should be tinkling in your head is volatility. Because that's what's going on here. As we're coming into an earnings release, implied volatility is going to start to expand. The reason why it expands is there's an expectation of new information that could significantly move the product. That's the nature of implied volatility, fallward looking volatility. So what you'll notice is typically about two weeks into the earnings release, we will see implied volatility start to expand slowly. Now, if you could isolate all other variables, this would be much easier to see. But as you know, markets move. So sometimes this movement could be hampered by different things. This is not just my own observations, although I do track a very large data set on earnings plays. But this is also very well studied. If you look up SSRN, earnings releases, I have a bunch of links to throwing here in the notes for you to check out on different papers that I like.",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "observations, although I do track a very large data set on earnings plays. But this is also very well studied. If you look up SSRN, earnings releases, I have a bunch of links to throwing here in the notes for you to check out on different papers that I like. But the punchline here is this release will start to spur IV expansion. And if we take a look, I'm actually curious what Home Depot is doing over the last few weeks. We're just starting to get into the window, essentially when implied volatility will start to expand. So you can kind of see this uptick about two weeks ago and there could have been other things going on as well. But nonetheless, I assume that that would be part of that expansion from what we saw over here. And one of the things that's really useful for traders to be aware of is this idea of an unexpected move. This kind of helps us conceptualize what we think, the expected implied volatility is telling us the underlying might move. So for example, if we pull up something like Home Depot, which again has earnings coming up on the 16th before the market had over here to trade, what we want to do is we want to go to the expiration cycle, the closest expiration cycle that has the earnings event in it. That part's really important because if it doesn't have the earnings event in it, then the implied",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "before the market had over here to trade, what we want to do is we want to go to the expiration cycle, the closest expiration cycle that has the earnings event in it. That part's really important because if it doesn't have the earnings event in it, then the implied volatility is not going to expand for that cycle. So if we pull up this 19 May, we can see this at the money straddle. And then this is essentially how we figure out roughly how much we think it's going to move. So in this case, you would just take the at the money straddle, which is 7.60 over here, call it 7 over here, so about 14.60. So 14.60 move up or down is what's currently being priced in. Now this will adjust as it gets closer. This is just kind of an initial look, and that's a really important note for folks. Because if you start trying to plan all of your earnings plays, let's say on the weekend, because that's when you do your homework, that's okay, but you need to refresh it right before the release, because other things happen in the market. So what you first saw might be impacted by other things, really important to stay close to the event. So one other note here that's kind of a good thing to keep an eye on is the implied volatility for the cycle. So let me switch my camera real quick, so it's",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "you first saw might be impacted by other things, really important to stay close to the event. So one other note here that's kind of a good thing to keep an eye on is the implied volatility for the cycle. So let me switch my camera real quick, so it's easier for you to see. And over here, we have 47.3, and then notice how implied volatility goes down a lot. 37, 34, 32, 31, notice how close all of these are to one another, and then how high this one is relative to the others. This tells you something's going on here. And very frequently, you can identify when earnings is coming up, because of something like this. If we pull up something like maybe lows, which is reporting further out in time, they're reporting on the 23rd before the market. Notice how the run, earning cycle, this is a, the front expiration cycle is high, but this doesn't really matter, because it's already passed. But if we take a look at the 19 May expiration cycle, that's only 30. Then it jumps to 39, and then down to 36. Again, sometimes the difference might be smaller, but sometimes it can be pretty significant. And one other quick example, if we pull up Apple, which I have a position on right now, which is a covered or a ratio diagonal, but if we take a look at the Apple implied volatility ratings over here, you can kind of see",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "it can be pretty significant. And one other quick example, if we pull up Apple, which I have a position on right now, which is a covered or a ratio diagonal, but if we take a look at the Apple implied volatility ratings over here, you can kind of see that it goes from 20, 21, 22, 23, and this is normal. The reason why this is normal is typically the more time we have, the more volatility we expect there to be, because there's more time for that position to move around and do things. But you'll find an anomaly here where a newer term expiration is higher compared to a later term expiration, and it's typically because there's a reason, like earnings. So about two weeks out, implied volatility is going to start expanding everything else remaining the same. Then after the earnings release, we're going to see a pretty significant contraction in implied volatility. And that's because all the information is now known. We know what's going on. So leading into, there's a lot of anticipation, a bunch of information is going to come out, then boom, there goes the earnings release, and we have all of the information out there, all that implied volatility is going to contract down. And really what's not really is both of these are tradable events. If we're talking about wanting to trade the IV expansion, I'm typically going to try to be long implied volatility. Again, everything else remaining the",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "the information out there, all that implied volatility is going to contract down. And really what's not really is both of these are tradable events. If we're talking about wanting to trade the IV expansion, I'm typically going to try to be long implied volatility. Again, everything else remaining the same. So this is going to be mostly long premium strategies. And then when IV contracts, we're going to want to be short implied volatility, but you have to be short before the release, which will get into in a minute in terms of timing and what specific strategies I use. To give you some ideas for long implied volatility, I'm mostly going to use long straddles. The vast majority of the time personally, that is what I'm going to trade as long straddles. I very, really would trade long singles, but that's if I have potentially a really strong directional hypothesis, but I typically wouldn't in this scenario I'm focusing on the implied volatility first and foremost. So I'm going to default to a straddle. And then after the earnings release, if I have a strong directional hypothesis, short single options, meaning short call short put, again, typically not the case, more often than not, it's going to be a short straddle or strangle. Notice how I don't have strangles over here. I don't tend to buy them leading into the announcement. And that's just because my data set and the way I trade them, I tend to do",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "the case, more often than not, it's going to be a short straddle or strangle. Notice how I don't have strangles over here. I don't tend to buy them leading into the announcement. And that's just because my data set and the way I trade them, I tend to do better with straddles. So I trade those. But after the earnings release, sometimes I do have primarily an implied volatility hypothesis, but I kind of amplify it with the directional bias. So if we use, again, Home Depot for an example, right now it's been pretty range bound, so I don't have any sort of strong directional hypothesis here. But let's just pretend that it actually, this is when it was reporting earnings. And it was reporting earnings after, you know, the next day after this, I would have a little bit of a short bias, just because it generally overextended there. And the momentum it would need to get over this plus two linear regression channel would be pretty significant, could happen after earnings, but nonetheless, that would be just an example of when I would skew them. Now, let's get into this idea of how we actually trade these. And again, you can see that there's two distinct hypothesis here. I have the expansion and contraction. Again, when I'm trading around earnings, that's the primary hypothesis I have. I can amplify it with direction, but just about never would I trade earnings just because of direction, because it's",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "these. And again, you can see that there's two distinct hypothesis here. I have the expansion and contraction. Again, when I'm trading around earnings, that's the primary hypothesis I have. I can amplify it with direction, but just about never would I trade earnings just because of direction, because it's a binary event. The way earnings behave, the reason why they're a binary event is because they move a lot and they can go many cycles in a row where they don't really do anything. Just kind of boring and they're not gapping up or down. And then all of a sudden you can have a release that moves, you know, four times the expected earnings, the biggest ever that happens. That's why there's such false elements. So when we're talking about these two different time frames, you should already know this answer, but when we're trading, I have the expansion, we're going to start about two weeks out. Typically, maybe it would be one week out, and then contraction, it's going to be right around the release. So what I mean by this is when you're trading the implied volatility expansion, it is very, very important, really when you're trading both of these. You have to include the date that has the earnings release. So if we come back over here and we take a look at Om Depot again, if you had traded this 12 May expiration cycle, attempting to trade the expansion and volatility for 19 May,",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "trading both of these. You have to include the date that has the earnings release. So if we come back over here and we take a look at Om Depot again, if you had traded this 12 May expiration cycle, attempting to trade the expansion and volatility for 19 May, you might see some of it, but not most of it. And it's because the markets are smart. They know this expiration cycle is not exposed to the earnings. So it's not going to have a bunch of volatility applied to it. Whereas this earning cycle will. So it's really important to stay closer, lash to bang, closer to the actual event because this is where our hypothesis lives. Now when we're trading contraction, I typically am going to enter right before the market closes before the release. You're late. So if it's a Tuesday PM announcement, meaning after the close, I would get in Tuesday, right before the close or as close to it as I can, maybe five minutes out if I'm, you know, just trying to get a fill. And then if it's reporting Wednesday morning, same exact time frame, right? That's the same cycle that's going to gain you exposure. And it's going to be the closest expiration that I can find. I already talked to you about the directional structures. This is more just for your general notes. But again, these are really the main trades I'm going to throw on. And more often than",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "to gain you exposure. And it's going to be the closest expiration that I can find. I already talked to you about the directional structures. This is more just for your general notes. But again, these are really the main trades I'm going to throw on. And more often than not, it will be this one with my really screwed up circle that actually crossed it out. It would be that one for contraction. And then this way for expansion. And again, for me, it's typically not going to be a strangle. It typically would be just a long straddle. And the other, and these are, if there's, these are, directional. So notice how the way I make the straddles and strangle's directional is by including a skew or a ratio, meaning I could trade the 30 delta strangle, but sell more calls than puts. Or I could sell more puts in a straddle than the calls. You can skew these strategies a bit so that it does take a little more of a directional overall disposition. But for non-directional, again, pretty vanilla, long straddles, short straddle strangles, either of those. And then, days of expiration, we want to be closest expiration right after their earnings release. So now I want to talk to you quick about some best practices. The first one is sizing. You got to size these pretty smart, because this is not just my own observations, although I do track a very large data set, our",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "closest expiration right after their earnings release. So now I want to talk to you quick about some best practices. The first one is sizing. You got to size these pretty smart, because this is not just my own observations, although I do track a very large data set, our undefined risk strategies. So I tend to size down into earnings. And it's just because things move a lot, and there's a lot of occurrences. So I'm not worried about getting one to be a super great home run. There's a lot that's released in an expiration cycle. The second thing is liquid. Most of the earnings I trade are within the SP 500, and it's because they're super liquid. I like things that have weak lease, but the liquidity part can't be overstated, because let's say something is a big miss, and it just all goes to hell in a hand basket. If it's illiquid on your way trying to get in, just imagine how tough it is to get out when everybody else is trying to crawl up to the door, when something's going poorly. You get chopped up there. So liquidity is kind of really important in this context. And the other thing to notice around volatility in general, liquidity inherently expands. So you can have something that's liquid, and even before the earnings releases out, we can have this giant expansion and volatility because of the release itself, and that negatively impacts liquidity right out of",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "this context. And the other thing to notice around volatility in general, liquidity inherently expands. So you can have something that's liquid, and even before the earnings releases out, we can have this giant expansion and volatility because of the release itself, and that negatively impacts liquidity right out of the gate. PL defined. This does not mean that I am defining only trading to find PL or to find risk strategies. Notice how pretty much none of these are. All I'm talking about here is I'm going to have a very clearly defined profit target and loss target that I'm going to manage these trades. More often than not, I'm going to put them on before the close, first, specifically the contraction, which this is most of what I do. I do the expansion, but it's mostly the contraction. So when I'm trading these, I'm going to put it on close to the event, and then after earnings is released, I might give the market a few minutes after the open for the volatility to drain out meaningfully, but after that, I'm getting out. I'm not waiting to see how it does the rest of the day. And it's because there's too many times that something can reverse. There's too many times that something can have a really bad continuation. So sometimes people get really bad confirmation bias. They want to trade an earnings release. They wait until the announcement, and then they hold it all day, because they",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "because there's too many times that something can reverse. There's too many times that something can have a really bad continuation. So sometimes people get really bad confirmation bias. They want to trade an earnings release. They wait until the announcement, and then they hold it all day, because they think they can squeeze out more money. And sometimes you can, but a lot of times it'll reverse. Sometimes you can't. Remember, we're trading the volatility here, not the direction, at least the way I'm structuring these in general. So I'm trading around the volatility of the event. I'm not waiting for the fall through more often than not. Now, one quick note, there is another implied volatility contraction strategy that I do run, which is immediately after the release. This is going to significantly decrease the amount of money you'll collect via premium, but sometimes you can follow along with the direction. So it's a slightly different hypothesis in that scenario. But again, in general, I'm going to trade them like this. Portfolio risk. This is just important to note that if you're trading a bunch of earnings, things can go wrong at once. So be mindful of how different trades interact with one another. Track and watch. This is really important. So I actually maintain a pretty big watch list of different earnings products that I follow so that I get a sense of how they move. So for example, if we come back here to Home Depot,",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "different trades interact with one another. Track and watch. This is really important. So I actually maintain a pretty big watch list of different earnings products that I follow so that I get a sense of how they move. So for example, if we come back here to Home Depot, what I might do is I like to go back at least six quarters, preferably eight. And I'll see how it did around earnings. What was the expected? What was the actual earnings per share? What was the close price before the release? What was the open after the release? What was the high price after the release? What was the low price? All of those details give me on text. Notice how I say they don't inform me on what's going to happen. Because again, you can have something that reported a certain way for a long time and then one report at all changes and it's completely different. It gives you some ideas on what to generally expect in a large data sample. So outlier moves are common here. But nonetheless, you can still get an idea of how things tend to move, which is useful for me. Hedging is expensive, which is exactly why most of these do not have legs. But that does not mean never cap your risk if you're super uncomfortable. Just be really thoughtful about how you choose to hedge these strategies. Because again, for example, if we're trading implied volatility contraction, our",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "Hedging is expensive, which is exactly why most of these do not have legs. But that does not mean never cap your risk if you're super uncomfortable. Just be really thoughtful about how you choose to hedge these strategies. Because again, for example, if we're trading implied volatility contraction, our entire hypothesis is that implied volatility is high compared to the expected historic volatility. So if you're selling options to capitalize on that, but then you're also buying them, what you're buying is relatively expensive. So we want to be careful about how we choose to manage hedging. In general, I won't hedge stuff to the downside. But if I'm trading some sort of tech stock or something like that, I will always consider capping the upside risk. Because most things, if it's a strong stock, it can fall down most of the time sooner or later it'll come back up. But if you are talking about something that is a great earnings release, it can skyrocket up and out super fast. And that can be really difficult to find the door quickly enough. I was just mentioning this IVHV. This is really the entire concept of earnings place. We are assuming that implied volatility is going to be elevated compared to historic volatility. So if we come over here and look at an example, that's what this chart is down here. Yellow is implied. Kind of the white in the gray is historic. And in general, you're going to",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "are assuming that implied volatility is going to be elevated compared to historic volatility. So if we come over here and look at an example, that's what this chart is down here. Yellow is implied. Kind of the white in the gray is historic. And in general, you're going to see implied tracking above historic. But if we go back through, we can come in here and see some of these previous releases. Just for an example, let's take a look at MGM. And we can also take a look at what's another one you guys want to look at. Maybe EA. So let's take a look at MGM and we can see how it did around earnings. So notice here, before earnings implied was tracking above realized, but then after earnings realized actually went over implied. That means that the expected move was not high enough for what the realized move was. So if you just traded volatility here, this might have been a tricky trade because the move was bigger than what implied volatility was giving us. Another quick example is if we pull up maybe EA. And I don't know how these did. I'm just kind of pulling up random ones. This is funny enough. An example of the inverse. So we can see earnings was here. Notice how high implied volatility was leading into the release. And then after the release, we get this implied volatility crush as it's referred to. It's just a rapid contraction",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "pulling up random ones. This is funny enough. An example of the inverse. So we can see earnings was here. Notice how high implied volatility was leading into the release. And then after the release, we get this implied volatility crush as it's referred to. It's just a rapid contraction implied volatility. And notice how it tracked above historic volatility. That is the scenario we're looking for where IV is greater than HV and maintains it through the earnings. The other three things I want to mention, the first one, fundamental analysis, technical analysis, really limited efficacy around earnings. And it's because there's so much new information coming out. I don't wait these that heavily. Meaning if something has a really good multiple, I don't necessarily think that's going to support us a whole lot through earnings compared to the current multiple that's being shared with us in that earnings release. Same thing for technical analysis. You'll very frequently see these big moves that you might say, oh, okay, resistance is here at 127, but then around earnings, it just doesn't care. That is such bullshit. So just know that fundamental analysis, technical analysis around earnings, limited efficacy. We talked about the cycle IV already, so I'm not going to beat that again, but that's a really good thing to keep in the back of your mind. That they period that has the earnings release in it, the monthly volatility would tend to be higher. And then the last thing",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  },
  {
    "text": "about the cycle IV already, so I'm not going to beat that again, but that's a really good thing to keep in the back of your mind. That they period that has the earnings release in it, the monthly volatility would tend to be higher. And then the last thing is positive earnings announcement tripped. This is kind of a notion where if we get a really big earnings beat, and a big subsequent move post earnings up or down, that we tend to see a continuation over the next quarter. This is still in play, but in the recent two years, this has contracted a lot for SP 500 stocks. So the PID is not as impactful for SP 500 stocks as it used to be, which I just think is an important general admin note. So hope it was useful for you. If you have any questions, throw them down in the comments below. Let me know what you like. Don't forget to share with some friends, subscribe, be an ally. I'll see you guys later.",
    "metadata": {
      "video_id": "aio6XczsFFc",
      "title": "My Approach to Trading Earnings with Options",
      "url": "https://www.youtube.com/watch?v=aio6XczsFFc",
      "upload_date": "",
      "duration": 1119.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=aio6XczsFFc&t=0"
    }
  }
]