[
  {
    "text": "you you you you you you you you you you you you you And happy episode 11. So it's not quite like Star Wars. Actually, I don't know how many Star Wars episodes there are, but for this, I can tell you that there are 11. And we will be wrapping up the outlier options trading basics stream. And I run this series maybe one or two times a few times a year typically. I time this one to be towards the start of this year. We've been meeting every Friday for the last 11, essentially in a row. And the goal behind doing these is to help provide structure. The time that we spend together for one hour on Friday, to take a look through this stuff is in no way shape or form sufficient in order to learn enough to quote unquote be a option trader. But it provides you context and it gives you structure to learn to follow along on some of the key themes that go into making this a viable approach. Now the goal for the session today is I want to run through a quick recap. And then I actually want to spend the majority of our time talking about where to go from here, how to take the stuff that we've discussed, that we've started to learn, and how to actually turn this into something usable for you longer term. So with that, I figured that we could start by just quickly",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "the majority of our time talking about where to go from here, how to take the stuff that we've discussed, that we've started to learn, and how to actually turn this into something usable for you longer term. So with that, I figured that we could start by just quickly rehashing what we've discussed. So we've discussed options 101 and I'm actually going to move you over to this screen and kind of combine both of these like this so that you can get a side by side view of the stuff that we have talked about and the stuff that I think you should consider integrating into your approach going forward. So here we have the beginning, the beginning started with a recap. We talked about things like the opportunity around options and for those that don't remember, the opportunity around options effectively boils down to the fact that it provides a strategic investment. And so the concept of a strategic investment is simple. It means that we can shape and form the idea into something very specific. It's not like a stock return. When you're buying or selling a stock, the stock can go up or the stock can go down. In this space, it's actually quite different and you can structure things to fit a lot of different ideas. You can trade things that you think might go up a little bit, might go up a lot, might go up a lot, but over a longer term",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "can go down. In this space, it's actually quite different and you can structure things to fit a lot of different ideas. You can trade things that you think might go up a little bit, might go up a lot, might go up a lot, but over a longer term timeframe that might go up and then might go down. That might have no stock change, but the volatility changes and so on and so forth. That's one of the beautiful things about options. The second thing is we talked about where the key market participants, who else is in this space, what they're doing, why they're doing it. The reason why this is important to you is because it is always prudent to understand the get in where you fit in. Understanding that there are areas of trading that retail has zero potential to compete, but that doesn't mean that we cannot find ways to make money in trading. And the other thing is when a retail trader is setting out to enter the markets, it's really, really important to understand the world that we're stepping into. I think a lot of traders step into the market with a lot of hopes and dreams. They have a lot of desires, but the reality is the market doesn't really care about any of that. And unfortunately, I think for a lot of traders, they run into a series of issues where they start to realize that fact the hard way",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "lot of hopes and dreams. They have a lot of desires, but the reality is the market doesn't really care about any of that. And unfortunately, I think for a lot of traders, they run into a series of issues where they start to realize that fact the hard way through losing money, which is unfortunate. Episode two, we talked about buying versus selling options. We just literally just talked about the actual structural implications of them, but then also the different use cases for them, which is important because for a trader like me, I do both. And what I do in terms of buying or selling premium largely depends on what's going on in the market and what kind of risk that I want. There are absolutely traders out there that choose to either buy premium or sell premium. There are other ways to go about this. I typically think that the more adaptable you can be as a trader, the more consistent that you thus can be as a trader. You're not beholden to only being able to capture specific ideas when your one fastball pops up. Next up, I think this is still that standard issue I've shared with you guys before. We're like this thing locks up, but we'll be all right. Next up was pricing, understanding standard pricing models. And the key takeaway from this is that when we're pricing an option, we know everything except one thing, which is implied volatility. And the",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "I've shared with you guys before. We're like this thing locks up, but we'll be all right. Next up was pricing, understanding standard pricing models. And the key takeaway from this is that when we're pricing an option, we know everything except one thing, which is implied volatility. And the name of the game of options trading largely revolves around different expectations and ideas around volatility. After that, we got into trader organization. This matters because there's a lot happening here. And this is actually going to be one of the big things we're going to talk about with the path forward from here because you are not going to remember all this stuff. It is literally impossible to and the only way that you're going to effectively be able to iterate and create something for you that is successful longer term is if you actually have a good system in place to track what you're doing. After that, we talked about volatility and obviously all of the nuances, the different kinds, how it behaves, how it kind of can be classified as its own asset class, which is pretty cool. Then we got into the Greeks. The Greeks are essentially the way that we measure how options move. And it gives us a lot of fidelity around the positions as we're building them. And we learn things like the Greeks are not static. They change. The Greeks have relationships with one another. There's multiple order Greeks. We can have",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "essentially the way that we measure how options move. And it gives us a lot of fidelity around the positions as we're building them. And we learn things like the Greeks are not static. They change. The Greeks have relationships with one another. There's multiple order Greeks. We can have Greeks that are specifically isolating effects with respect to price. We can have Greeks that isolate effects with respect to other Greeks. And this again gives us insight into how an option moves. Then we just had a general QA. In this one, we talked a little bit about the learning path for an options trader. How long it takes to get your feet under you, how to build strategies, those kinds of things. Then more recently, the last couple, how to not only read and navigate an options chain, but also how to use it to identify underlying market information. Because there's a lot in there. And the options chains are actually very educational in that way. And for that, we got into building an option, how to actually start taking these ideas, to turn it into a trade and then thus to take multiple trades into build a portfolio. That's what we've talked about over the last 10 episodes. So if you've made it through all of these episodes genuinely, you should give yourself some kudos, whether that's a pat on the back or whether that's just taking a moment and saying, yeah, actually, that is, as you",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "portfolio. That's what we've talked about over the last 10 episodes. So if you've made it through all of these episodes genuinely, you should give yourself some kudos, whether that's a pat on the back or whether that's just taking a moment and saying, yeah, actually, that is, as you click through this, this is a lot of shit. It's a lot of stuff. And you all know that when we go through these things, I try to strike a balance with how deep we go, but this is in no way like very superficial level. It's definitely a little deeper than that. So not just the scope of what we covered, but we covered some decent depth behind it all. So anytime that you go through a program like that, whether it's something as simple as just kind of a YouTube series with me or anything else, I think it is important to create the mental association with feeling satisfied after completing a task, but then also completing something that is genuinely helping you round out your skill set. Options trading can be really, really tricky in the sense that you can do a lot. And then after a while, it kind of feels like you're just like, like learning into the void. But that is part of the process in building and understanding. It's actually really funny. I had a podcast yesterday with somebody I respect in the field significantly, which is you and Sinclair. And that podcast",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "while, it kind of feels like you're just like, like learning into the void. But that is part of the process in building and understanding. It's actually really funny. I had a podcast yesterday with somebody I respect in the field significantly, which is you and Sinclair. And that podcast will be out next week. And one of the things he mentioned during that podcast that resonated with me so strongly. And it's something that will probably make a lot of sense to you actually after I say it in terms of connecting the dots on a lot of things that I do. And one of the things you and talked about was the importance of building a baseline, meaning when you look at something and rather than looking at something, trying to identify what's wrong or what's missing, instead looking at it and just understanding what's normal. And then after you look at something so long and you understand what's normal, then it becomes really easy to spot things that are abnormal in some way. And you've heard me call this out a million different times on the different live streams that I do with you all. And I found it so interesting because as you and was talking about that, I couldn't identify more with it. It's like such a big part of what I do. And I think it's something that an options trader needs to understand and adopt for themselves. The reality is for most options",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "found it so interesting because as you and was talking about that, I couldn't identify more with it. It's like such a big part of what I do. And I think it's something that an options trader needs to understand and adopt for themselves. The reality is for most options trader, traders out there like this ain't it. This is not going to be the thing for you. And the reason why that's the case is most people come into this with really bad expectations. They have a lot of things that they want to accomplish. They have a lot of hopes and dreams. They want something that returns better than the market. That's not very volatile. That never has a down month. That doesn't require a lot of time or effort. There's all these things that traders come into this thing wanting, which I don't blame them. I kind of want that too. But it's not the reality of what we do as traders. And again, it's a good thing because if it was able to be so, then it would be really difficult to make decent money doing this because it would become increasingly flooded. So all of that is to say a big part of your success as a trader is sticking around long enough to build experience, to then create a baseline understanding of things, to then start thinking of different ways that you can make money from deviations from baselines or from standard market effects.",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "that is to say a big part of your success as a trader is sticking around long enough to build experience, to then create a baseline understanding of things, to then start thinking of different ways that you can make money from deviations from baselines or from standard market effects. But the only way you can really understand a market effect is if you study and see it that it's there. So that leads us now to where we sit today and the purpose of the episode today, which is building a roadmap, thinking about where we go from here. And I actually thought what better way to take all of this stuff and put it all together, then to actually go through a little bit of an exercise with you all. I actually had built a pretty robust final exam that I was going to give you guys. And maybe I'll send it out at some point. It's just a bunch of random questions or multiple choice so that it was going to be easier to do on the stream. But say they're thinking it's like any one of you can have chat GPT give yourself a quiz. So I was thinking, yeah, that's probably not the best use of our time together on the stream. I thought a better use of time together would be to work through all of this stuff kind of in order and think about how we take these pieces and turn it into",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "I was thinking, yeah, that's probably not the best use of our time together on the stream. I thought a better use of time together would be to work through all of this stuff kind of in order and think about how we take these pieces and turn it into something bigger than the sum of the individual parts. So that's the game plan. I want to walk through a roadmap forward for you. But before I could open the door for the door. Okay. Let's get to it. Let me grab our drawing pad. And let's catch this out, shall we? So the way that I'm approaching this conversation is that we just finished a pretty basic and generalized course that helps us understand the context of options. Now the game is figuring out how to take this information and then to turn it into something further. Now, we've already talked about all kinds of things, the outlier strategy process, the outlier trade process, right? Like you're familiar with all of these core concepts, which is great. But that means now we need to actually begin applying things in a meaningful way. So what is, and I would like you to throw this in the chat, what is the number one most important thing to you as a trader? This is above everything. This is my guess is a bunch of you are going to get it wrong. And it's not like wrong, wrong. It's like semi wrong. What",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "you to throw this in the chat, what is the number one most important thing to you as a trader? This is above everything. This is my guess is a bunch of you are going to get it wrong. And it's not like wrong, wrong. It's like semi wrong. What do you think? What is your first, you were very first priority as a trader? Anybody? Consistency of results? Nope. Lauren says mechanics. Nope. Tommy says goals. Nope. Jordan says returns. That's the closest. Alberto says having fun. We know that's not correct. Pepe says increase our wealth. That's also close. Paulo says get a good return for the wrist. That's close. Juicy bot says managing minimizing wrist. That's not it. Tommy says how to make money getting warmer. Nate says protect capital. That is absolutely not the case. You can protect your capital much easier ways than going into the stock market. I'm much better off protecting my capital by putting it into a CD. That's easy to protect the capital. The things in here that you guys were talking about that were close. Were things like returns, things like increase our wealth, good return for the risk. Those are closest. Tommy says how much money need to make and what time frame? That's more of like a planning consideration. That's not your number one priority. Peter says taking risk. That's not it. Closer but still not it. Think of it this way. If we wanted to just make",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "are closest. Tommy says how much money need to make and what time frame? That's more of like a planning consideration. That's not your number one priority. Peter says taking risk. That's not it. Closer but still not it. Think of it this way. If we wanted to just make money, we can make money by buying and holding in index ETF. So through the approach of trading, we're trying to do more than that. Now it doesn't necessarily mean that we're trying to do more in the sense of getting better returns all the time. You can trade to try to be more consistent, to try to have less drawdown, to have less volatility. There's other things that you can trade for that's not always beating the market. But there is a absolutely essential function that needs to be in place in order to do anything as a trader. It's a four letter word. Your number one priority as a trader is edge without edge literally nothing else you do as a trader matters. You can have the best best risk control. If you have great risk control and no edge, you will simply lose money in a controlled way. That's not good. You can have the best capital protection model out there. You can protect your capital in the best way possible. It's great to have protected capital, but that makes you no money. This is the entire focus for a new trader. He's developing edge. There are",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "way. That's not good. You can have the best capital protection model out there. You can protect your capital in the best way possible. It's great to have protected capital, but that makes you no money. This is the entire focus for a new trader. He's developing edge. There are a lot of ways to approach this problem set. As we go through this entire list of things, some of the things in here are designed to directly support edge. Some of the things in here are designed to help us capitalize on edge or maintain our ability to extract an edge. But everything that you do as a trader, it must incorporate some sort of edge. Whether your ultimate goal is to maximize the risk to reward that you're taking. Whether your goal is to consistently profit as a trader. Whether your goal is to try and have some sort of income generation component to what you're doing. The edge is what is required in all of those scenarios universally, period, full stop. This is the focus. Now that being said, in order to get and build an edge, this is where the uncomfortable reality enters the equation because we now have to do hard work. There is no fast, easy way to a consistent edge. And if we reflect back onto something like this, which you've seen before, the outlier strategy process, notice the first thing that's in here, the profit mechanism. This is how you are going",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "we now have to do hard work. There is no fast, easy way to a consistent edge. And if we reflect back onto something like this, which you've seen before, the outlier strategy process, notice the first thing that's in here, the profit mechanism. This is how you are going to make money with whatever it is you're trying to do. So this is your edge, whatever the edge ultimately is that you're attempting to extract. One of the things I would encourage you to think away from is sometimes people will think that edge is some sort of market outperformance. And there's an argument, by the way, depending on the context to be made for that for sure. But in the context of a standard trader that's looking to accomplish a set of goals, whatever those set of goals are, edge is how you're going to realize your performance towards those goals. So then we know that this is our focus. We have got to create an edge. The second priority, another exceedingly unsexy concept, organization. So this is beyond the documentation and all that stuff. It's going to be your trading plan, your trading log, yada, yada, yada. But in terms of organization, the other things I bucket into this are having defined goals. It's being organized not only as a trader in the activity of trading, but being organized as a trader, as a human being that's doing something. So in order to have any chance of",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "But in terms of organization, the other things I bucket into this are having defined goals. It's being organized not only as a trader in the activity of trading, but being organized as a trader, as a human being that's doing something. So in order to have any chance of success as a trader, we need to very clearly articulate what we're attempting to undergo, why we're attempting to do this. And here's the fun fact. If traders actually spent time up front defining what their goals are and not just defining a goal in the context of like, oh, I would like this. Not that at all. That's bullshit. That's what you'd like defining goals in the context of I think this is in the realm of possibility. And then taking time to vet it because I cannot tell you how many times we go through something like Reddit or just general conversations I have from people DMing me or emailing me, asking things like, hey, Eric, is 1 per week reasonable? 1 per week sounds so reasonable. You have a 100,000 account. All you're trying to do is make 1 per week. That seems like somebody that's not being overly aggressive. That's trying to grow their account slowly. And then if you annualize that return, does anybody know what the annualized return on 1 per week is? Obviously, you could do the math, but without doing the math. I'm wondering if anybody just knows. It's like almost 70.",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "being overly aggressive. That's trying to grow their account slowly. And then if you annualize that return, does anybody know what the annualized return on 1 per week is? Obviously, you could do the math, but without doing the math. I'm wondering if anybody just knows. It's like almost 70. I want to say it's like 67, 68, 69. It's like something in the 60s. So it's high 60s. So it's like 70 per year is what this person is asking to do. This is the equivalent of, I used to jitsu a lot. I don't think a lot of you are probably jitsu players. So I think the analogies probably go off. What's a better, most commonly known sport? I mean, maybe in the US football, I hate football or maybe soccer, but I don't know anything about soccer either. I guess the way to think about it is back to Jiu-Jitsu is if this is your expectation, this is the same as being brand new at a sport and genuinely thinking that you are going to not only compete but outperform most of the top performers if not all of them. Like that's literally what this is. And I don't necessarily think that this always comes from greed. I really don't. I think this often comes from genuinely not taking the time to clearly define your goals and vet them to even see if this shit is realistic. Because the paradigm of a standard trader is they're so",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "I don't necessarily think that this always comes from greed. I really don't. I think this often comes from genuinely not taking the time to clearly define your goals and vet them to even see if this shit is realistic. Because the paradigm of a standard trader is they're so concerned with what they want, with what they hope that they totally forget that that doesn't actually matter to the markets. Getting used to interacting with the system that is completely agnostic towards your existence is super important. That's actually one of the beautiful things about the military. Is the military teaches you early on that it's really not about you or your preferences. It's always going to be for the greater good. I'm just offering this as a general mindset for those that might be veterans or military people because you already have a leg up when it comes to understanding the fact that you might have your preferences, but your preferences ultimately don't really matter in the Marine Corps. We always say needs of the Corps matter more. As a trader, there's nothing wrong with defining your goals and having aggressive goals. I think aggressive goals are fine, but I will remind you in my humble opinion, I think for the first two years, greater than 0 return is perfect. Because lame seems like why are we doing this? Why even bother? Why even trade if all I'm trying to do is be greater than 0? The reason",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "but I will remind you in my humble opinion, I think for the first two years, greater than 0 return is perfect. Because lame seems like why are we doing this? Why even bother? Why even trade if all I'm trying to do is be greater than 0? The reason is because as a new trader, there is just about nothing. You are going to do in the first three years that is actually going to matter with respect to meaningfully growing your account. It is what it is. It over it. The reality is, for your first few years of trading, you are actually focusing on building a sustainable skill set. You're focusing on things like creating an effective process to learn, to track what you're doing. Because you go back to what I said in the beginning, a big part of becoming an expert at anything is developing experience. You cannot develop any experience in trading if you blow up your account trying to do things that you literally do not have neither the context nor the skill set to produce. This is one of the instances where I actually think the notion of if you aim low enough, you might be able to hit it is fully applicable. This is accepting the fact that slow is smooth, smooth is fast. What that means is, and again, we use this in the military, where a lot of times, if you're trying to go through some sort of fine",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "enough, you might be able to hit it is fully applicable. This is accepting the fact that slow is smooth, smooth is fast. What that means is, and again, we use this in the military, where a lot of times, if you're trying to go through some sort of fine motor movement when you're in a high stress scenario, your movements become really erratic, jagged, very not smooth. And even though it feels like you're moving super, super fast, like maybe during a reload, you're actually slowing down because you're so jagged in your movements. So by deliberately slowing your movements down, which seems in feels like you're moving slower than when you're really trying to move super fast, you actually ultimately move faster because things are smoother. Then trading the exact same concept applies. If in your first few years you're focusing on good, solid fundamentals of trading, building the skill set, which is what we're about to go into, then you are building the foundation to then actually achieve returns. And if you don't like this and if what I'm saying upsets you, that's actually good because it means you're learning something, but the second thing it means you need to reconcile with yourself. If this is the thing for you, because if we talk about why do so many traders fail, it is not because trading is all that difficult. It really is not. It's difficult in the sense that it requires doing a lot of things",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "you need to reconcile with yourself. If this is the thing for you, because if we talk about why do so many traders fail, it is not because trading is all that difficult. It really is not. It's difficult in the sense that it requires doing a lot of things and at least being decent at most of them, but it's not difficult in the sense that you have to have specific personal attributes in order to stand a chance at being successful at this. It doesn't matter if you were born six foot tall or seven foot tall, trading doesn't care about any of that stuff. It cares about things like your work ethic, how adaptable are you, how persistent are you, things like that. So that's what I mean, that it's not that difficult because anybody that applies a concerted effort towards this can absolutely find something that generally works at least moderately well if they apply the right methodology, which includes a lot of iterative learning. So now that we have the beginning concepts identified, now is when we actually get into the next steps, how do we take this list of things, this list of things that we learned in how do we turn it into something that we can actually monetize, make money. We already know the first thing is edge. So in order to even understand anything about edge or what edge can look like, step one here, and this is something I think",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "that we learned in how do we turn it into something that we can actually monetize, make money. We already know the first thing is edge. So in order to even understand anything about edge or what edge can look like, step one here, and this is something I think makes sense literally for all of you, for at least the next three months. For three months. Monitor the market and take notes. Again, it seems so simple, it seems so stupid. And just like you saw in the karate kid, when Mr. Miyagi had the dude, I forgot the dude's name, do in the wax on, wax off repeatedly, over and over and over again. It seems useless. It seems not applicable to what you might be trying to do, whereas this I'm actually giving you something directly, at least in the realm of what you're trying to do. The reason why those kinds of things are so useful is again, because they're building a base understanding of something, they're building a completely solid foundational core. So in the case of wax on wax off, it's getting the movements right, doing it over and over again until it becomes muscle memory, taking that to a trading lens by simply monitoring the markets meaningfully. When I say monitor the markets meaningfully, this isn't just randomly flipping through things and just kind of haphazardly seeing what you see. This is actually developing an approach to looking at markets and analyzing markets.",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "muscle memory, taking that to a trading lens by simply monitoring the markets meaningfully. When I say monitor the markets meaningfully, this isn't just randomly flipping through things and just kind of haphazardly seeing what you see. This is actually developing an approach to looking at markets and analyzing markets. And as you probably guess, I have a video that I can share with you that walks through a process to actually analyze markets. It's the video that I just dropped in there. And the video is titled How I Analyze the Stock Market to Build Ideas. The reason why I insist on you taking notes is because there is a well studied and documented effect that you learn better by writing things down. That's it. It's not that you have to have this big data source that you're going to go back and look through. The entire concept here is we're starting to build an understanding of what's normal, what's abnormal. This can be done during market close. You don't have to do this during the day sitting there just staring at the market, seeing what's happened. You can do it at the end of the day and you can just see what you see and take notes on it. You should be very deliberate. What we're doing here is we're building context. And three months, by the way, is just a snapshot. This is a super short amount of time. The next thing is step two, which I",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "can just see what you see and take notes on it. You should be very deliberate. What we're doing here is we're building context. And three months, by the way, is just a snapshot. This is a super short amount of time. The next thing is step two, which I believe occurs simultaneously in conjunction with step one. And here, I think you pay for trade ideas. Step three, also during this very same three months. We build a trade log and trade plan. That's really the only way you pay for trade ideas is to have a supporting trade log. Here's what's happening during these first steps. We're creating market context. We're starting to throw ideas out and we're looking at the performance. This is not going through back testing. This again, this here is not because any of these ideas are probably going to work. The reality is they're probably not going to work and that you need to see that. The other thing is the main takeaway from step two here is actually the same as step one. It's building context. Now during this time frame though, we are starting to try and build an approach to placing trades. And again, this is where something like the outlier trade process is relevant. So I'll grab the video for that for you. Here. So during this, you're not worrying about back testing ideas. You're not worrying about if the idea is good. I will remind you just about",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "placing trades. And again, this is where something like the outlier trade process is relevant. So I'll grab the video for that for you. Here. So during this, you're not worrying about back testing ideas. You're not worrying about if the idea is good. I will remind you just about everything you come up with. Your first two years of trading is probably hot garbage. That's just the facts. And again, that's not like something that you should be like, wow, that's crazy. Why would you say that or how could it take that long? Again, think about any other skill based activity you've ever done in your life. How good do you get in the first year? Obviously, from where you start, you grow exponentially. But then if you look back at where you were one year into that activity compared to where you might be now 10 years down the line from there, you probably think of it as like, shit, I didn't know anything. It's actually kind of embarrassing. It's the same idea here. We are not even worried about trying to come up with grand ideas because we do not have the context yet. Ben says, why do that? Why not test the idea first to prove it's at least theoretically possible? It's a great question. It's because you have no idea what the test for at this point. For a trader that's been in the market for X period of time, that is, meaning when",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "why do that? Why not test the idea first to prove it's at least theoretically possible? It's a great question. It's because you have no idea what the test for at this point. For a trader that's been in the market for X period of time, that is, meaning when I say X period, I mean probably sub two years, you're not in a point to even, you don't even know how to back test. You don't even know what to look for. If you're a trader that is again in that window, you are not familiar with the concepts like adverse selection. You don't know about confirmation bias. You don't know about sampling error. You probably don't know about sample distributions and sample out of sample. All of these things have to be done and understood deeply before you even attempt to crack open a back test. Because if you don't, then all you're doing is reaffirming terrible habits. So again, the main thing to answer Ben's question on this one is all you're doing is gaining context. You're not actually trying to trade these great ideas. Everything that you're trading in this is probably going to get thrown out. This is just so that you can look at the markets and just so that you can be engaged with your interaction with the markets while you're learning. That's exactly what this is. This is not the actually built trade ideas because a trader at this point is not",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "out. This is just so that you can look at the markets and just so that you can be engaged with your interaction with the markets while you're learning. That's exactly what this is. This is not the actually built trade ideas because a trader at this point is not prepared. They're not prepared in any way. It's a come up with good trade ideas. Pepe said TA should also be considered as a must. No. Definitely not. You can trade, you literally can trade an entire career with zero technical analysis if you're so inclined. If you're an options trader genuinely, there are different approaches that one could easily argue. The probabilities of movement are already generally accurately reflected in a chart, which air go are already going to be baked into an options chain. So it depends on your approach. It depends on your profit mechanism, but I wouldn't consider it a must. I think it's a good idea personally. I think it makes sense. But I do not think that it's a must. But that does move us into step four. In analysis process, here, all we're doing is trying to create a standardized process with respect to how we conduct analysis. So this is not going to be always check the six month chart, the two month chart, the one month chart. It's not that at all. We're thinking much higher process level here. We're thinking economy, stock market, these two are to develop baseline context.",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "to how we conduct analysis. So this is not going to be always check the six month chart, the two month chart, the one month chart. It's not that at all. We're thinking much higher process level here. We're thinking economy, stock market, these two are to develop baseline context. Then after we get the baseline context process down, then we can start outlining trade analysis. Now the trade analysis in this context again is not for a specific strategy. It's the main muscle movements that regardless of what strategy we're doing needs to happen. So the trade analysis for a zero DTE strategy is going to look different than if I'm trying to trade a ratio called the Agnolum Palantir for a longer term idea. However, that being said, it does not mean that the major steps that I take in a zero DTE process do not apply to what I'm looking at the ratio called the Agnolum Palantir. So the trade analysis process for me is you guys know always starts with the portfolio, understanding the portfolio and creating alignment with this base context. This is always going to happen first. So before I ever analyze an individual trade, I'm doing these things every single time. Then I can start thinking about analysis tools. So in here are things like for technical analysis, how do you think you're going to conduct it broadly? Again, this is not specific to a strategy yet. This is us trying to create",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "trade, I'm doing these things every single time. Then I can start thinking about analysis tools. So in here are things like for technical analysis, how do you think you're going to conduct it broadly? Again, this is not specific to a strategy yet. This is us trying to create a general approach to analyzing an individual trade. What are the data points we think we might use we might look at? This here I think essentially takes up the first six months like all of these steps combined, the timeline here, probably like the first six months of a general trader's cycle. From here is when we get into the heart of the work. Oh, duh. I'm so stupid. I forgot that I'm writing with this pen. I have to clear this off. So if there's anything on there that you want, make sure you grab it. I have to clear it off because this is in the way. So the next step, which I already forgot what step around was at step five. Now that we have some baseline stock market understanding, we have an idea we've been logging stock market movements for a few months. We've developed a general, a general outline for a trading plan, a trading log. We've started testing some random trading ideas, realizing most of them suck. Some of them make money. There's a really low confidence interval when we put on the trades. There's very low predictive value in terms of whether",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "a general, a general outline for a trading plan, a trading log. We've started testing some random trading ideas, realizing most of them suck. Some of them make money. There's a really low confidence interval when we put on the trades. There's very low predictive value in terms of whether or not we think we're actually going to make money or not. All of those things will happen in the first steps leading into this. Then once we get to this, we're actually saying, I'm going to take this seriously. At this point, this comes into play, the outlier strategy process. This is exactly where you employ this framework or whatever framework you have that you prefer at this point. We've already reviewed all of this. You're familiar with all of this. But this is where you need to actually go and find profit mechanisms that you can trade. You have to understand them in depth. You have to quantify them, qualify them. You have to then start attaching some of those signals that you found earlier that you're tinkering with and trying to align those signals with the profit mechanism to see if you can actually use those signals to identify the profit mechanism. From there, you can start playing with what kind of options structures might fit. Notice again, I will continue to reiterate this point every single time we look at this. Notice how this is about trading options. Notice how I don't say shit about options",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "to identify the profit mechanism. From there, you can start playing with what kind of options structures might fit. Notice again, I will continue to reiterate this point every single time we look at this. Notice how this is about trading options. Notice how I don't say shit about options until the third step in this process related and about specifically trading options. Options aren't mentioned until the third step. What does that tell you? It tells you that options are simply a vector to capitalize or to extract or to monetize an idea. But you need the idea. There is no baked in option anything that's automatically just going to provide you profit. It doesn't exist. You have to have a profit mechanism. You have to have some sort of approach to identifying, quantifying, qualifying the profit mechanism. And then you can worry about what structures matter. The overwhelming majority of options traders, they get stuck worrying if they're going to buy five DTE options or seven DTE options to trade this idea. And the reality is both of them are probably going to lose money in the long run. We're optimizing for the wrong thing. We have the cart so far in front of the horse, you can't even see it. So this step five is probably, I would argue, the next 12 to 18 months. And over this 12 to 18 months, you might find three to four profit mechanisms like good ones. You might find three",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "cart so far in front of the horse, you can't even see it. So this step five is probably, I would argue, the next 12 to 18 months. And over this 12 to 18 months, you might find three to four profit mechanisms like good ones. You might find three to four. As always, some people might take longer and find more. Some people might find more in shorter time. I'm just trying to give you some context, some ideas from somebody who's gone through all of this and somebody who's helped other people navigate through all of this. This is what I spent a lot of time with the people that are in the coaching stuff and in the discord. And it can be really frustrating because a lot of the times it feels like it's like, man, this just takes kind of like a lot of time. And I don't really feel like I'm learning as fast as I want. The unfortunate reality is we can only move at the pace of time. And time in markets is how we develop experience. So some of it is based on our ability to build that context to then come up with ideas. So after step five, this becomes easier now. So step six strategy, dev, import folio, use or implementation. Now strategy development in this context is taking this step here for these three to four profit mechanisms. And it's making sure that they then work together at the",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "up with ideas. So after step five, this becomes easier now. So step six strategy, dev, import folio, use or implementation. Now strategy development in this context is taking this step here for these three to four profit mechanisms. And it's making sure that they then work together at the portfolio level. So here's what I'm talking about in this step. Let me move this. And I think this would be clear. If we have a 100,000 portfolio, our goal is 15 per year. We already know that we want to minimize total drawdown. So drawdown will be set at 35. We don't want to draw our portfolio down more than 35. We also know that we have a standard W2 job. And we can only look at the market the last trading hour, the first trading hour, first hour. And this isn't for the full hour. This is just sometime during the first hour and last hour. So we have our goal. We have our risk parameter. We have some of the qualitative overlay that is just a fact of our life that we have to account for. So now as we go through these three to four profit mechanisms, if you found one profit mechanism that is following Intraday VWOP for an index, guess what? This doesn't matter. This doesn't fit this. We can't do this. So even though we might have found a viable profit mechanism that makes sense and looks good, it doesn't matter in this",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "mechanisms, if you found one profit mechanism that is following Intraday VWOP for an index, guess what? This doesn't matter. This doesn't fit this. We can't do this. So even though we might have found a viable profit mechanism that makes sense and looks good, it doesn't matter in this context. Now this might lead somebody to say, well, Eric, Eric, why wouldn't we first try to define our portfolio use case and then go find edge that fits it? It's a great question. Does anybody have a guess why it's this way? And anybody that knows me knows that I care a lot about efficiency and I care a lot about rock solid process. So there's a reason. Anybody have an idea what that reason is? Ben says IDK I would ask why is well, and it's a good question. It's a very natural question. So I'm glad that you would ask that. But as you might guess, there is a reason. Does anybody have a guess as to what the reason might be? None. Because it consumes time. No, that's a good guess. I mean, realistically, arguably, the step five and step six here would consume more time, wouldn't it? Something that we just go try to find edge and then we try to fit stuff in the portfolio. So also counter to Pallows point, it actually is less efficient in a way. Ben says overall exposure to see different things. That's definitely part of it. The reality",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "wouldn't it? Something that we just go try to find edge and then we try to fit stuff in the portfolio. So also counter to Pallows point, it actually is less efficient in a way. Ben says overall exposure to see different things. That's definitely part of it. The reality is for a new trader finding any edge, any edge is a tall enough task. So again, taking it back to a sports analogy, this is like what Gordon Ryan does in Jiu-Jitsu, where as he's competing with world-class athletes, he'll have a letter that he signs before the match and he says how he's going to submit his world-class opponent before the match starts, which for those that don't have context of Jiu-Jitsu, even finishing somebody, meaning actually getting a definitive submission, is difficult. A lot of them just go by time and points. So the fact that not only is he so confident in the submission, but he's also picking what he's going to do is quite literally an elite level move. This is the same, a new options trader that has less than five years in the market, especially in this case, less than three years in the market, coming in and saying not only am I going to find an edge that I like, but I'm going to be able to find an edge that fits all of my parameters. Let me go find that. It's beyond arrogant. It's beyond misguided. The probability of an actual",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "the market, coming in and saying not only am I going to find an edge that I like, but I'm going to be able to find an edge that fits all of my parameters. Let me go find that. It's beyond arrogant. It's beyond misguided. The probability of an actual new options trader finding an edge literally at all, in case you need a reminder, is low. It's very low. If we take a look at what is the probability of a regular options trader finding an edge, it's exceedingly low. So that's why this is a scenario where we are knowingly doing something that's slightly suboptimal because of the landscape and because of the reality of what we're doing. This is exactly why. If a new options trader can find any edge, that is an incredible start. It's literally an incredible start. So whether that edge can be traded during market hours when you're able to get to the markets or anything, it doesn't even matter yet. The fact that you can even find it is huge because if you're able to actually genuinely find a true edge that you can extract, that you can monetize over time, then you can absolutely become more selective. Paul says, how do you know that you've found an edge? That's an absolutely great question. And the funny answer to that is the way that you know you've found an edge is when you don't have to ask anymore, which I know sounds",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "you can absolutely become more selective. Paul says, how do you know that you've found an edge? That's an absolutely great question. And the funny answer to that is the way that you know you've found an edge is when you don't have to ask anymore, which I know sounds kind of silly, but it is the exact truth. Once you are onto something that you can consistently see results of some sort with some sort of predictive value that is based on something logical, then you know that you're probably onto something and you'll see it start to materialize. Now to talk about this from a general perspective, because Paulo also in his question brings up a really important point, which is that of discerning return path from just Appen Stamps, part of that again comes from this process. By actually defining the market effect and then doing research on that market effect. So for example, a well-known market effect is variances premiums. You've heard me talk about a million times because it is actually a defined market effect that we know is there reliably. Sick. Sick story, bro. But I know then because this is something that is well researched, it's documented. I can look at studies about it. I can see it in the market to confirm what I'm seeing. Right. Then I already know I'm kind of off to a good start. I already know that I'm looking at something that's based on something. So that's",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "well researched, it's documented. I can look at studies about it. I can see it in the market to confirm what I'm seeing. Right. Then I already know I'm kind of off to a good start. I already know that I'm looking at something that's based on something. So that's exactly how two things come into play. The first thing is finding something that we actually can even identify that we're going down the right path in the beginning and then building off of that. That's exactly how if I were a new trader trying to identify in edge in the beginning, that's exactly what I would do is I would start with something that probably knowingly doesn't have a ton of edge, but it has something there and it's based on a well-documented market effect that I know exists for a reason and it's logical and then trying to find ways to monetize that. That's the exact way I would start. Now to just put a bow on this and then happily turn it into just an open QA for the next 15-20 minutes. This, it's not a lot of steps, but sitting down and actually doing this work is absolutely what is required. If somebody is unwilling to do this work, then the probability of you being a successful trader long-term is about zero. If you are willing to do this work, it is highly, genuinely, highly probable that you will find something. It doesn't necessarily mean that",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "is absolutely what is required. If somebody is unwilling to do this work, then the probability of you being a successful trader long-term is about zero. If you are willing to do this work, it is highly, genuinely, highly probable that you will find something. It doesn't necessarily mean that you'll hit your portfolio goals. It doesn't necessarily mean that you're going to smash the SP 500 every year. It all depends on what you find and how adept you are at employing it, but the overwhelming probabilities you'll find something because there's a lot of stuff out there that exists right now that we know exists that's well studied and documented. If again, you start with something like that as your base, then you can very easily iterate that into something more meaningful over time as you're exploring other ideas. In my opinion, this is the first two years for a new options trader. There's a lot of iterative learning going on during this time frame, continuing to try to read new books, expand your general knowledge base. There's using things like ChatGPT to help make sure that it's quizzing you so that you're continuing to validate your knowledge. There's using those external audits or AARs. The discord that's free to join for everybody is a great place to do this. You can literally ask somebody in their hey, can you just quiz me on options? Just literally, ask a few questions. That's useful for everybody. But there's no",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "There's using those external audits or AARs. The discord that's free to join for everybody is a great place to do this. You can literally ask somebody in their hey, can you just quiz me on options? Just literally, ask a few questions. That's useful for everybody. But there's no reason to grossly overcomplicate the beginning stages for an options trader because there's already enough going on that you have to tangle with. So there's the next 24 months for anybody that's been a part of the series so far. So before we turn to just open QA, I do want to say for those that actually stuck out the whole thing from me to you, solid job. There's a lot to do here. Your work literally is just starting, but I think that this will provide a usable foundation. And my hope for doing these sessions is not just to give you a video to watch, but to give you an honest, earnest take on trading, what it takes to be successful and to try to set you down the right path. I think sometimes some of the things that I say, they're a little bit disheartening also to me because I don't want to sound like I'm trying to dissuade anybody from trying to trade. I think it's good for everybody to at least try. But I think what's more damaging is making it seem easier than it is or just covering over the rough spots to make",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "me because I don't want to sound like I'm trying to dissuade anybody from trying to trade. I think it's good for everybody to at least try. But I think what's more damaging is making it seem easier than it is or just covering over the rough spots to make it more approachable. And I think that that hurts people because the majority of people that start trading options are the exact group of people that typically don't have a bunch of money to lose because I know that that's exactly why I started trading options because I did not have money and I was trying to figure out how to make money. So that's my TED Talk. I hope that the series is good for you. I do plan to run another one of these at some point throughout the rest of the year, maybe one or two more. And we will absolutely dive into another one in the future. But I'll turn it over to just a general QA throw anything you want in the chat. I will happily roll through those. I'm going to go grab the manager, Thor just finished his dinner, so I'll grab him and then we'll get to it. The champ is here. The champ is here. He's straight up smelling like dinner. Look, you guys can see his eyes. There's actually light enough for reflection. So if you guys have any, oh, and now he's tired. He's going to recharge before we",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "and then we'll get to it. The champ is here. The champ is here. He's straight up smelling like dinner. Look, you guys can see his eyes. There's actually light enough for reflection. So if you guys have any, oh, and now he's tired. He's going to recharge before we go for our walk later. So he's ready to rock and roll. Oliver says, do you think Elon will exceed 30 children? How many kids does he have right now? I actually don't know how many he has, but it wouldn't surprise me. I do think that because I really believe that he believes that there's a significant imperative for him to do that. So I absolutely can see it. Reese says, it might have been hung up on the word, but what would you say is your edge, not trying to copy yours just seem hard to define. So I think you can, there isn't like what is your edge Eric or what is your edge Reese. I have different strategies that have edge. So one of my strategies that has edge is the coverage strangle as I've built it. And it's something that reliably creates profit and it typically beats the underlying index. So it still has down years, right? So it's not again, edge isn't something that's nipotent or always, but the strategy in the long run absolutely yields edge, the variance for premiums that I play in index volatility has edge. The earnings place that I",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "typically beats the underlying index. So it still has down years, right? So it's not again, edge isn't something that's nipotent or always, but the strategy in the long run absolutely yields edge, the variance for premiums that I play in index volatility has edge. The earnings place that I trade has edge, my pattern recognition when I'm trading breakout setups or breakdown setups has edge. So these like these different approaches, it's the approach itself that has edge. I wouldn't think of like what is your edge as a person or as a trader. I would think it's, it's a little more specific to the strategy than that. The reality is, is like as a trader, you and Aitley have to get a lot of things right. And that's just an expectation. It doesn't lead to profit, right? You'll hear things like discipline, risk management, those kinds of things. And you have to have those like there's no debate. You have to have those. But even if you have those, it doesn't necessarily mean that you make money. So the way to think about it is that like as a trader, there's a bunch of things you have to do that are just base expectations. And then what you do beyond that is really the pursuit of edge. Policies, how do you go about back tests? It's a good question. The way that I go about back tests is by first looking at the market and trying to come",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "do that are just base expectations. And then what you do beyond that is really the pursuit of edge. Policies, how do you go about back tests? It's a good question. The way that I go about back tests is by first looking at the market and trying to come up with different ideas based on things that I see or things that I think might logically make money. So one of the examples is post earnings announcement drift. Before I knew that that was a thing, I had already been trading it for a while. I had come across it and it was an effect that I could see following an earnings release. I didn't have it qualified quite the same is a lot of the studies do. I had a different criteria that I would use. But what I do is look at the market and based on what I see, I try to find things that I think like hmm. I wonder if I can make money off of that. And then I will then start to develop the structure for what I need to have in order to be able to validate or invalidate the idea. So the purpose of back testing for me is I'm going to grab a relevant data source of whatever it is that I'm trying to look at. So in that case, I'm going to have to find the names that I would trade earnings. And I need to get their",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "So the purpose of back testing for me is I'm going to grab a relevant data source of whatever it is that I'm trying to look at. So in that case, I'm going to have to find the names that I would trade earnings. And I need to get their price performance details around earnings and then the earnings details around, you know, the specific duration. And then I would start programming it. Now I typically use Python. Now I think with the advent of chat GPT people have slightly more capability, although I have tried to use it for stuff like that. It's really not that good. So I think I would use it more as like an accelerator for back testing, not to actually run it. It's very unreliable with the logic that it tries to use sometimes. But I think it'll get better. And then I approach back testing, not in an attempt to turn something into something. I look at a back test literally to see what's there. And first to start with standard measurement. And then after that, I go through, I segment the data. I try to make sure that I'm following good data hygiene. And then I can start overlaying some basic criteria to see if my general approach or idea might make sense on a risk adjusted return. Now a really important thing when it comes to back testing is the tendency for people is to say like, oh, I noticed that",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "hygiene. And then I can start overlaying some basic criteria to see if my general approach or idea might make sense on a risk adjusted return. Now a really important thing when it comes to back testing is the tendency for people is to say like, oh, I noticed that this helped my returns. Let me try adding this on top of it. And let me try adding this on top of that. And then you kind of start with this base effect that after you add 32 filters, it looks great in a back test. That is obviously what we would call overfitting. And the danger is trying to strike a really good balance between optimizing something so that you know that you're extracting as much of it as you can, which does require parameterization. But without going too far. And the way that I validate that is through different kinds of robustness checks. You can segment, you can check variance between segments. And then you can forward project with out of sample data, that kind of stuff. So the whole purpose of back testing and the approach I follow is essentially that. And then the last thing I would mention is even if I have a good back test, that doesn't mean that the strategy works or that the idea is valid, it just means that it's not a bad idea to test and then to go from there. Because a back test, even if you account really",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "would mention is even if I have a good back test, that doesn't mean that the strategy works or that the idea is valid, it just means that it's not a bad idea to test and then to go from there. Because a back test, even if you account really diligently for things like slippage, for cost and stuff like that, there's a lot more to it. And when you're actually trying to employ it on an actively trading market, so the back test is a way to quickly and then slightly less quickly, more in depth, validate ideas. But it will not represent the actual performance of the strategy. I could grab a water beer back. So, I'm going to go back to the last thing I did. I'm going to go back to the last thing I did. And then I'm going to go back to the last thing I did. And then I'm going to go back to the last thing I did. And then I'm going to go back to the last thing I did. All right. Hey, yo, Lauren just hooked a bunch of people up. Thank you very much for doing that, Lauren. Very nice. Thank you. Lauren says, I just want to thank you for doing this, learned a lot, and appreciate taking the time to do it. That's awesome. That really is like really encouraging to hear, especially as simple as it is because a lot of the times when I'm doing",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "nice. Thank you. Lauren says, I just want to thank you for doing this, learned a lot, and appreciate taking the time to do it. That's awesome. That really is like really encouraging to hear, especially as simple as it is because a lot of the times when I'm doing stuff like this and talking about this, I, I, I, I, I, I, I, obviously do my best and I hope it's stuff that's useful. But I never fully know, like if what I'm actually talking about is connecting, if it makes sense, if it's logical. So I, I really am stoked to hear that it's something that's like useful for you. That was hopefully right level. I don't want stuff to be too easy, but I also don't want stuff to be agreedgiously difficult for this. And I want there to be like clean takeaways. So yeah, that's, that's awesome. Thank you very much for mentioning it. Ben says, how much what you do is discretionary versus systematic as far as edge, everything I do is discretionary. I have ideas that are based on effects that I can observe and measure, but the way that I implement them is always with discretion. There's absolutely ways to systematically extract edge as a retail trader. It's just much more difficult and it's the kind of edge that you can extract in those circumstances tends to be slightly lower than what you can actually pull once you're an experienced trader applying that",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "always with discretion. There's absolutely ways to systematically extract edge as a retail trader. It's just much more difficult and it's the kind of edge that you can extract in those circumstances tends to be slightly lower than what you can actually pull once you're an experienced trader applying that experience. There's value. There's objectively value and experience as a trader. You have to temper it because sometimes the intuition or the, the approach that traders will have will be to overweight their experience at the wrong times or underweight it at others, which negatively impacts their performance, but there's definitely value and experience as a trader. So I always, the saying that I use for that is the trader always has the last say. So even if I'm doing something that has a specific parameter that I typically would follow because it generally makes sense, I always allow myself to deviate. And it's because I've developed enough trust in myself that I know I wouldn't deviate for some sort of half baked random idea that's based on an impulse. And the deviation typically would be because I'm seeing something that I know isn't captured in what I did previously in building the strategy. So I need to react differently to that scenario. It's a good question. Jordan says can edge be found by being very familiar with the specific equity and then coming up with option structure that works for that snapshot in time? Could you expand? I follow",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "in building the strategy. So I need to react differently to that scenario. It's a good question. Jordan says can edge be found by being very familiar with the specific equity and then coming up with option structure that works for that snapshot in time? Could you expand? I follow your question, but depending on how you're thinking about it would lead to the yes or no. In a high level, the answer absolutely could be yes. But the option structure itself is not necessarily what would be delivering on the edge in that specific underlying. So I need to understand your use of that a little bit more. At a high level, if you think about developing like a really close relationship with a specific stock, you absolutely can then identify anomalies. Jordan says for example, you mentioned how you tend to always run a covered strangle on IWM is that edge. All the strategy is edge. I mean, the funny element of that is I haven't traded a covered strangle in IWM in several years now. So the reason being is we have to adapt to evolving market conditions. So for example, IWM over the last several years, small caps in general, have performed very, very poorly. Jordan says must be an old video. Definitely was. It's the ones that you're talking about, like the old covered strangle videos. Because if we take a look at, let's just take a look at like a quad chart. So it's",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "small caps in general, have performed very, very poorly. Jordan says must be an old video. Definitely was. It's the ones that you're talking about, like the old covered strangle videos. Because if we take a look at, let's just take a look at like a quad chart. So it's not like obnoxiously noisy here. And let's bring these back. Let's go back 10 year monthly. What do you notice? What do you notice about these as you go into 2021? What's happened here? Is the total returns generated from small caps have absolutely cratered. For the longest time, small caps were far more favorable in terms of total return. It's because they're a higher volatility. So the amount of growth that you would get from small caps typically would be more than what you would get from large caps and mega caps. But what ended up happening in 2021, like post COVID, is we entered actually a really restrictive environment that made it very, very challenging for small caps to make a bunch of money. So if we measure from here to here, I want you to notice something. And this has everything to do with the change in market paradigm. This is the COVID drop. And then this is the recovery out of the COVID drop. If I look inside the SP 500, it rallied 118 from the draw of the COVID drop to the following peak. If we look at that in small caps, it rallied 150.",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "market paradigm. This is the COVID drop. And then this is the recovery out of the COVID drop. If I look inside the SP 500, it rallied 118 from the draw of the COVID drop to the following peak. If we look at that in small caps, it rallied 150. That's another 50 on top of what you saw in spy, a massive variance in favor of small caps. But at this point, I was still trading the Russell. This is actually when I had an old video, I don't know if it's still out there, but I had an old video talking about managing the coverage strangle during like a really big market drop. Because I had a coverage strangle out at that exact time. What happened here is this period here heavily favored small caps. But then as we had to get into a more restrictive fiscal policy environment, small caps have lagged ever since. So you can see effectively from 2021, it just ran sideways. And this is as rates and inflation was going up, which is very difficult for small caps. So I very, very regularly trade small caps and absolutely would again. But the problem is is the current market conditions that we're sitting in really, really don't favor them. So I have no other choice but to move into other things. Now the broader question though, of running the coverage strangle, the coverage strangle as a strategy that I've built absolutely has edge. Because",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "is is the current market conditions that we're sitting in really, really don't favor them. So I have no other choice but to move into other things. Now the broader question though, of running the coverage strangle, the coverage strangle as a strategy that I've built absolutely has edge. Because it captures on various risk premiums on the put side also puts you. It captures a little bit of premium from the short calls that minorly hedge the downside moves that doesn't really cap my upside potential because they're sold at a ratio. And I also aggressively manage them typically to avoid assignment on those short calls. I also apply a value averaging approach, which is a way to effectively create returns out of volatility. So that's all part of my scaling strategy in addition to dollar cost averaging. So the coverage strangle really takes several effects and it compiles them into what it is and what the opportunities are. So to recap those, we have what's Q. We have variance risk premiums. We have short call. I don't want to use the term hedge because I don't mean it that way, but that is what will be most familiar to people. So I have the short call hedge, but then these are also managed to avoid assignment when I want. Then there's dollar cost averaging. There's value averaging. And then there's drift that's being played. So the coverage strangle is really giving me access to all of these things.",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "to people. So I have the short call hedge, but then these are also managed to avoid assignment when I want. Then there's dollar cost averaging. There's value averaging. And then there's drift that's being played. So the coverage strangle is really giving me access to all of these things. And the way that I built a strategy is to help me extract all of these things. The great example of this is if we take a look at the triple queues, you guys have seen the coverage strangle in here several times now. If I zoom this out, because we can get rid of these drawings, I don't really need these. But if I zoom out into the timeframe where I started trading the coverage strangle in the triple queues, which was, I want to say maybe October of last year, I started doing like a sample portfolio because I've always tinkered with different kinds of leveraged coverage strangles as a smaller allocation of the portfolio. But I think it was towards the end of last year, maybe October, somewhere in here. But effectively, what I do is let's say I can't remember. Let's say it was somewhere in here. What I do is in the value averaging and dollar cost averaging, as things rally up, I try to maintain a certain amount of equity exposure. I'm making money on the short puts and I'm rolling the short calls up and out at a loss each time. But I'm",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "here. What I do is in the value averaging and dollar cost averaging, as things rally up, I try to maintain a certain amount of equity exposure. I'm making money on the short puts and I'm rolling the short calls up and out at a loss each time. But I'm moving my bases up and up and up. Then as the market starts to unwind heavy, I typically pair down my equity allocation. So this is essentially, let's say if I got in here, I'm getting out somewhere in here with some of the equity not all. So I'm realizing a profit. So let's say if I started with 500, obviously it's more than that for the coverage strangle, but just using smaller numbers for an example. And let's say on this move up here, I make 50 bucks on the equity side of things. So what this means is I've actually just increased how much I can buy because I have 50 new dollars that I didn't add into it externally. And that's just from the equity that's not including any of the performance of the options during the same time frame. So then as it starts going down, down, down, down, down, I really just kind of slowly scale into it. So then we add another share, we add another share. So this is the dollar cost averaging component. So this is DCA, this is VA. As I'm dollar cost averaging into it, then when it has its",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "down, down, down, down, I really just kind of slowly scale into it. So then we add another share, we add another share. So this is the dollar cost averaging component. So this is DCA, this is VA. As I'm dollar cost averaging into it, then when it has its next big up move, I either again decide how I want to play it if I'm going to start unwinding on the way up or yada, yada, yada. But this is how I use the coverage strangle to not only play the longer term effect of the indices, which is if we zoom out long enough, we can see the longer term effect of the indices is they tend to rally. I'll go into QQs, the underlying in this instance. So this is the last 10 years monthly, right, tends to rally. So there's absolutely a drift effect by the market with these. But then I amplify my exposure by playing these shorter term moves with options and then a mix of dollar cost averaging and value averaging. So all of that is a pretty long answer for you, Jordan. I hope it paints the picture though on the difference between just trading the coverage strangle as a structure in IWM is an underlying and the steps that actually go into taking the structure into something that outperforms the benchmark that it's relative to. That's the broader idea there. Anything else you guys got? Okay, cool. Yeah, glad it was",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "between just trading the coverage strangle as a structure in IWM is an underlying and the steps that actually go into taking the structure into something that outperforms the benchmark that it's relative to. That's the broader idea there. Anything else you guys got? Okay, cool. Yeah, glad it was useful. I still have time. I actually totally forgot. I need to start our dinner order. I even think about it. Whoops. But obviously happy to get anything else that you guys, any questions, anything about trading that you're stuck on if you're not sure what your personal next steps should be. All of that stuff is fair game at this point in time. Paul says do edges have expiration dates? That's actually a really great question. So I would not phrase it that way personally. I would phrase it more so that edges can absolutely go into and out of favor. That is absolutely the case. So what that means is when we're trying to trade again, some sort of broader market thing like post earnings announcement drift post earnings announcement drift actually used to be way more prevalent in more names. But in the recent history, it's actually slowed down quite a lot. And the reason why it slowed down so much is because of general market participants. But what that ultimately means is the total edge has actually shifted quite a bit when we're looking at something like post earnings announcement drift. So in that context, it",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "slowed down quite a lot. And the reason why it slowed down so much is because of general market participants. But what that ultimately means is the total edge has actually shifted quite a bit when we're looking at something like post earnings announcement drift. So in that context, it absolutely is something that doesn't necessarily have an expiration date. But it definitely is something that has a change in the effect over time with without a doubt that is absolutely the case. So yeah, I hope that clarifies that part a little bit for you. And says, what is your argument for options directionally is not sub optimal as compared to shares. What is your argument for options? Directionally are not sub optimal compared to share. So what is your argument for the first reason? The first reason why I would argue that options can be preferential over shares for directional plays is capital efficiency. I think whether you choose to buy options, you can access leverage. If you choose to sell options, you can make money even if the market goes slightly against you and your directional bet is wrong. So I mean, those are the main ones I would point to like the main reason why you would buy options comparatively to shares is for leverage. That's really the main reason. Through that leverage, you gained guaranteed downside if you buy an option. If you sell an option, you don't gain guaranteed downside, but you gain the",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "I would point to like the main reason why you would buy options comparatively to shares is for leverage. That's really the main reason. Through that leverage, you gained guaranteed downside if you buy an option. If you sell an option, you don't gain guaranteed downside, but you gain the ability to manage the basis through things like rolling. So the fact of the matter is you can just make a lot more money with an options trade. Let's just take a look at an example together. Let's... I'm not going to pick an individual. Actually, we can pick an individual stock because this is one that I traded recently that's been topical Tesla. So if I want to try to trade Tesla to the downside, there are a few ways. We can short shares, which is fine. We can sell calls. We can buy puts. Now with shorting shares, there's a cost to carry that position and it is a little bit expensive to maintain the position. So let's go to when I first started trading it, which is on this drop, specifically below the 50-day moving average here. At this point, the moving averages were already negatively inverted. So I had entered a short position here and then I scaled into it here. So I mean, really, we can go to the 29th. Wanted to have earnings, I don't remember. After the close, that's right. I tried... I was going to trade earnings for it, but then I",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "So I had entered a short position here and then I scaled into it here. So I mean, really, we can go to the 29th. Wanted to have earnings, I don't remember. After the close, that's right. I tried... I was going to trade earnings for it, but then I didn't... I had started entering a short position but came out of it from earnings and then I waited to get back in until we dipped below the 50 again. The trade here was really, really embryonic, meaning it was early. This was partially hypothesized due to the broader sentiment that was building. It was also keyed off by some options activity. Let's take a look at here the third of Feb and we'll just take a look at two comparative positions. Well, I guess we could do three, four. Let's just do four. So it's loading right now and then we'll take a look. Risa has never heard you mention it since it happened today. Does quadwitching have tradable effects? Definitely. It certainly does. Let's hit play. So all I'm going to do is we're in on demand right now. We're back in time and I'm going to show you a position and then we will build a little bit more of a position around it so that we can observe the effects over time, which is my goal here. So let's do that. First thing we could take a look at just selling shares. Let's see how much",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "you a position and then we will build a little bit more of a position around it so that we can observe the effects over time, which is my goal here. So let's do that. First thing we could take a look at just selling shares. Let's see how much this would cost. I think this is regulation T. Yeah, this is taken 20 grand. It's regulation T. So this is not like a portfolio margin account. But what I'm going to do is I'm going to actually add it to analyze. And then we'll take a look at this from a portfolio lens. We got to get rid of the old stuff that's in here quickly. Give me one sec. So we can get rid of this. We can get rid of this. We can get rid of these. And the reason why is I want to keep track of these so that we can see how they perform comparatively. We have that one. Then let's say that we think it's going to continue to go down for whatever reason. I typically prefer 90 day for the diagonals. And let's do two different tranches. So that first one is going to take up 20 grand ish. I'm going to effectively use a similar amount of money in this one just to compare it directly. So this one is 16 313. So let's add a little more to this one. So we'll add we'll have one base position for this",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "going to take up 20 grand ish. I'm going to effectively use a similar amount of money in this one just to compare it directly. So this one is 16 313. So let's add a little more to this one. So we'll add we'll have one base position for this trade and then we'll have one kicker. So right now we have like four grand left to play with. I would go a little bit lighter than that. But maybe we go to like the two 70s. We buy these as well. And let's grab a couple more of these two 70s. Grab five of those. Okay. So now let's fast forward time. We'll just go to the fix them. And let's see how we do here. All I'm going to do is effectively monitor what the value for these would be at this point in time. And then we can do the PNL for each. First we'll take a look at just the equity. Okay. So our equity position right now is making 11,250 bucks. That's where it's sitting at. At this 11343. Sorry, 11343. Now let's take a look at the options position. The options position is making 20,830. So it's making effectively double using actually a little bit less money from the other trade. So this is an example of, and this isn't optimized by the way. A more optimized trade here would have been meaning if I want to like really overfit to prove the point.",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "20,830. So it's making effectively double using actually a little bit less money from the other trade. So this is an example of, and this isn't optimized by the way. A more optimized trade here would have been meaning if I want to like really overfit to prove the point. I would have just done 20,000 worth of out of the money options. But I wouldn't trade that way. So even though it would make for a better back test, you know, in this sample, for the example more broadly, it's just not reflective of reality. So this is like an actual position that I put on, not this one specifically, but close to it, where there is a deep in the money leg and then there are kickers outside of it. So this is an example of how rather than trading the underlying, in this case, we're just talking about downside. It doesn't matter if it's down side or upside, same concept supply. But when we're trading the underlying, this makes the options component, makes more money with less total risk and less money utilized than the long equity component. So Ben, let me know if that answers the perspective of why options would not inherently be suboptimal for a directional place compared to the underlying. Ben says I have just read options for price direction due to they don't have linear reaction to price, as with shares, as well as paying more due to liquidity of option. I",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "perspective of why options would not inherently be suboptimal for a directional place compared to the underlying. Ben says I have just read options for price direction due to they don't have linear reaction to price, as with shares, as well as paying more due to liquidity of option. I don't follow that last part, but the other inaccuracy with your statement is actually some options do have linear reaction to price, just to be aware. So what you're referring to there is the variance of delta and gamma. But if you have an option that has a delta of one, it will move linearly with the underlying. Ben says you're losing money on your fills. I see. Yeah, there definitely is less liquidity in options than the underlying out right? I absolutely would agree with that point. The underlying itself is also going to have slippage. So in this case, you can see Tesla at this point was bid at 270.28 offered at 270.50. So this also has a bid-ass spread. And effectively, if you multiply this by 100, the bid-ass spread sometimes on the equity can be even worse. It's rare that it would be the case, but it can be. So let's take a look at an example here. If we take a look at just these 270 options, which we bought, that we have to get out of. These are 25 cents wide. If you multiply 25 cents, I'm 100, you get 25. So that's effectively",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "it can be. So let's take a look at an example here. If we take a look at just these 270 options, which we bought, that we have to get out of. These are 25 cents wide. If you multiply 25 cents, I'm 100, you get 25. So that's effectively the slippage here. If you take a look at the bid-ass spread on this, it's what, 270.22. So really not that different is the broader point. The bid-ass, and again, if you do that on 100 shares for the equity, that's, you're going to pay that 270.22. So it's actually not that different. And very frequently, options will be less liquid. I'm not arguing that options are more liquid. They're definitely not. But they're not inherently way off compared to the equity, especially to involve volatile periods. So Risa says the leverage should make up for the spread, also trading liquid underlying helps. Yep. Two super important points. And understanding how volatility behaves. When markets are going through broader drawdowns, then things inherently are going to become more volatile and wide-mounted. So yeah. Sweet. Well, I have my dinner order launched. So I'm just going to turn to making a video. But I'm happy if anybody else has any other questions that you want to hit before we wrap up. Feel free to throw it in. Obviously, happy to hang out a bit longer on this one, because this is our, this is our season finale. This is where we're",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  },
  {
    "text": "video. But I'm happy if anybody else has any other questions that you want to hit before we wrap up. Feel free to throw it in. Obviously, happy to hang out a bit longer on this one, because this is our, this is our season finale. This is where we're designed to pull everything together. So I hope, I hope you guys walk away with a pretty effective, forward-looking plan. That's the general intent. Cool. All right, okay. That makes me complete for the season. And I hope if you guys have any questions, as always, you'll reach back out. We'll kick another one of these off in a few months. But in the meantime, if you have any questions, as always, hit your boy up, be an outlier. See you later.",
    "metadata": {
      "video_id": "AWB8d0uMeoA",
      "title": "Options Trading Final Exam & Recap | Outlier Options Trading Basics Ep11",
      "url": "https://www.youtube.com/watch?v=AWB8d0uMeoA",
      "upload_date": "",
      "duration": 6285.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=AWB8d0uMeoA&t=0"
    }
  }
]