[
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 59,
    "text": "I think last time we spoke, you were like 20,000, it's almost 28 good stuff man. Who knew? All right, it looks like it's going through now. I'm just gonna have to drop a new link for it really quick. But that's easy. Perfect. All right, so here's the new link. I'm gonna drop it in here, new link. And then I'll put it on X as well. And then we should be good. Yeah, those weird. A lot of times you can pretty seamlessly run it through another like relay service. But for some reason it didn't like it. So, blockcat. Cool. That'll be all right. Cool, everybody can make their way in as they figure out their lives as I'm trying to figure out my life. Looks like everybody's following over to the other one, which is good. They should all have access to the new link. So we'll pivot over to this one. Beautiful dude. When you use your ears is live. That is correct, sir. Yeah, so we're good. What's pop in everybody? Yeah, welcome over folks. Sorry for the last minute change. You know how that goes sometimes. Literally had it all set up. I have like a, I don't know, I'd call it like a 15 percent hit rate with trying to go live through zoom. It's not the worst, but it's also not the most seamless. So we figured it out though. What's up, man? Nothing much, man. Just enjoying the year end.",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=0"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 59,
    "text": "have like a, I don't know, I'd call it like a 15 percent hit rate with trying to go live through zoom. It's not the worst, but it's also not the most seamless. So we figured it out though. What's up, man? Nothing much, man. Just enjoying the year end. What's been a good market year? Strong markets and it's about it. Just looking forward to chatting with you. It's always a pleasure. Did you, did you trade APP? You know what? It's like I look back and like how did I miss APP? It's like the most perfect like set up like a couple of months back. Dude, vertical, unbelievable. I did you so dirty because I got in on the 11th of September and I used options on it. I got in. I literally think it might be one of my biggest trades. Definitely for the year, but it like might be a multi-year period for me because when I got in it was sub 100. It was like 98. And then I got, yeah, I got out when it was like four. I forgot what it got up to. But as you know, that's not my style of trading at all. So like I didn't deserve that in the least. It just kind of like randomly. You came and you came to out do me and my my style of trading is that it? Is that what you're trying to kick this off with? What I'm trying",
    "start_timestamp_seconds": 82.56,
    "start_timestamp": "00:01:22",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=82"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 3,
    "total_chunks": 59,
    "text": "of trading at all. So like I didn't deserve that in the least. It just kind of like randomly. You came and you came to out do me and my my style of trading is that it? Is that what you're trying to kick this off with? What I'm trying to say, there's no chance I ever could. But, but I'm telling you, every once in a while, a blind squirrel does find a nut. And it was so funny because when I was putting on the trade, dude, I was like, I saw volume expand massive. Actually, I'll pull up a chart really quick because it's kind of interesting now that I look at it because it's, I honestly am actually really surprised that you didn't, that this wasn't your back. This seems like the exact kind of thing that you would find your way into. But yeah, I had originally gotten in here. And it was for two very simple reasons. The first one is it started to break out and it was on crazy volume. I didn't know why. And I did zero research. I didn't know anything about the earnings. I didn't even know what the company did when I bought it as people in my field tend to do. No, nothing about what we do. I, it's whenever I talk to my wife about what I do as a trader, I literally tell her, I just look at colors on a screen. And if I",
    "start_timestamp_seconds": 143.4,
    "start_timestamp": "00:02:23",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=143"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 4,
    "total_chunks": 59,
    "text": "company did when I bought it as people in my field tend to do. No, nothing about what we do. I, it's whenever I talk to my wife about what I do as a trader, I literally tell her, I just look at colors on a screen. And if I like the colors, I'll do something. If I don't like the colors, I don't do anything. And that's about my existence. But yeah, that was a funny entry. Now, at a curiosity though, with your general approach, maybe trading view, maybe I should pull that up because this is obviously all messed up from the scale. But where, like where in this would your typical entry window be? No, I mean, you nailed it perfectly. The reason I kind of slipped on this one is just because a good marker will have so many nice setups come in your way. So there's a lot of stuff I'll building into at that time. And so sometimes you already got like a foolish portfolio. And it's like, no, to be honest, like now looking back, it's like the home run trade. Sometimes, you know, a lot of people like, I'll tell them it's like, you don't always know, you're buying five, six, 10 stocks. You don't really know the one that's gonna pull off something like this. It's kind of like your, it's a right environment. You're looking at the right setups. And sometimes your place pretty full. And so it's just",
    "start_timestamp_seconds": 208.84,
    "start_timestamp": "00:03:28",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=208"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 5,
    "total_chunks": 59,
    "text": "it's like, you don't always know, you're buying five, six, 10 stocks. You don't really know the one that's gonna pull off something like this. It's kind of like your, it's a right environment. You're looking at the right setups. And sometimes your place pretty full. And so it's just like, for that reason, you're not just like constantly forever extending yourself. So I mean, the way you did, the way you did it was like the classic set up. I mean, it's just, it was perfect. And especially, you know, that is the quintessential move is when, you know, like you can't buy a stock. Like, I mean, like it took off. If you're waiting in any way, if you even just flinch and said, I'm gonna wait for a pullback, I'll wait for the volatility to die down, I'll wait for it to go side, it's never stopped. So like, it's like the stocks that you can't buy are the stocks that you should buy. It's the perfect, perfect example. What a move. Beautiful. What a great way to phrase that by the way. Because I've not heard that before. And I don't know if that's something you say a lot, but if not, you should. Because the statement of the stocks that you can't buy or the stocks that you should buy, like that's a great way to frame it. And I imagine for a lot of traders, that does take a while to get used to,",
    "start_timestamp_seconds": 268.64,
    "start_timestamp": "00:04:28",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=268"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 6,
    "total_chunks": 59,
    "text": "say a lot, but if not, you should. Because the statement of the stocks that you can't buy or the stocks that you should buy, like that's a great way to frame it. And I imagine for a lot of traders, that does take a while to get used to, is like buying stuff high and then trying to sell it higher. That's very, very counterintuitive. But, and for myself, like sometimes, it's like, you know what to be true, but then after other times, it's like, because at the same time, you're always trying to balance, which is that leading stock, but also you want to avoid buying things that are extended, even good stocks could kind of come up, pull back at the end of June. So, especially when things are starting to kick off and it's like, you have to remind yourself, like, because there's the other setups that will look more timely, like, oh, this one hasn't gone yet. It's like, this, I think it's a natural built-in emotion we have from life, like looking for a dealer at this counter, what, you know, so it's like, you have to remind, no, no, like just buy the one you could buy. Just find the way, even if it's more expensive, buy that one. And nine times out of 10, that's the one that just keeps going. It's crazy. I mean, how many people have been saying Palantir is all a value and it's just like, it's",
    "start_timestamp_seconds": 317.48,
    "start_timestamp": "00:05:17",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=317"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 7,
    "total_chunks": 59,
    "text": "the one you could buy. Just find the way, even if it's more expensive, buy that one. And nine times out of 10, that's the one that just keeps going. It's crazy. I mean, how many people have been saying Palantir is all a value and it's just like, it's tripled again, you know, like, so, you never have been ever waiting. So, really fun story about Palantir. I recently did a, it was a video actually, think about Palantir. It was about Palantir maybe so far, maybe both of them. And there was a bunch of people on seeking alpha that we're talking about how it's, you know, no good at this point. It's already overextended, like all that kind of stuff. And I obviously can't help but just find it comical that exactly to your point stuff that's like that tends to keep being like that. Like, well, it just keeps going, dude. So whatever, that's about all, all you really need, I think. Another question about that stock, as I was looking at it, out of sheer curiosity. I had, I was using the 10 and the 20 that essentially follow the trend. Now, a lot of other times that I do that for a breakout style trades and kind of momentum following at that point, I find that you really can't take the rules super strictly, otherwise you get chopped out a lot. And I noticed that in this case as well. So when you're trying",
    "start_timestamp_seconds": 369.52,
    "start_timestamp": "00:06:09",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=369"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 8,
    "total_chunks": 59,
    "text": "other times that I do that for a breakout style trades and kind of momentum following at that point, I find that you really can't take the rules super strictly, otherwise you get chopped out a lot. And I noticed that in this case as well. So when you're trying to follow, let's say that you, you find a good entry on something like this, what's your approach to follow the trend as it's unfolding without getting dumped out? So I try and, and this like really was from William O'Neill. You kind of brought up the concept, but it just, it's slowly just taken over my process. But he had like this thing called the hold rule. So if the stock goes up like so much, like 20 within the first three weeks, it's something you want to hold onto, or you know, that's kind of like the basics of it. But for me, the way it's grown over time is, if the stock is just very strong, it's one of my best stocks, I just don't want to sell it for the first two or three weeks. Because there's always going to be a pause, there's going to be a pullback, like I'll always rather manage risk with the stocks that are not going up. Because yeah, because that's a typical thing, right? It'll pull back to a 10, you say it closes below it, you exit and then just kind of keeps rocking higher at three days",
    "start_timestamp_seconds": 437.4,
    "start_timestamp": "00:07:17",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=437"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 9,
    "total_chunks": 59,
    "text": "be a pullback, like I'll always rather manage risk with the stocks that are not going up. Because yeah, because that's a typical thing, right? It'll pull back to a 10, you say it closes below it, you exit and then just kind of keeps rocking higher at three days later. So I found that coming out of a base, coming out of a structure, the first two, three, four weeks is really when the stock is showing what it's got. Like if it's something that's worthwhile holding, it's worth watching. So I have a bit of like a time clock going on. Like I just, as long as I'm not losing money on a stock, like the first couple of weeks, unless it's like, like now there's a really great market. Like if a stock is not doing anything now, maybe just roll it into something else, because there's so much heat. But like back in September at markets, we're just like coming out of a bit of a slumber and like all the stocks are starting to move. So whenever you're at the beginning of like that cycle, I find new markets go like these three, four, five, one cycles. Like that first two, three, four weeks, I just want to like leave it alone. I just don't want to touch it. So that's usually my pride. And I find it super helpful. Because by that time, like APP, like those first three, four, five days, the impulse",
    "start_timestamp_seconds": 494.68,
    "start_timestamp": "00:08:14",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=494"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 10,
    "total_chunks": 59,
    "text": "one cycles. Like that first two, three, four weeks, I just want to like leave it alone. I just don't want to touch it. So that's usually my pride. And I find it super helpful. Because by that time, like APP, like those first three, four, five days, the impulse would have been so strong to like, you know, we went from 87 to 125, the impulse is so strong to take your profit. And so you just need kind of like this mindset, what I know, that's just don't touch it now. Like whatever it is, I'm expecting higher. And say what policy or same one, G-E-V, so many others this year that I did trade, ALAB recently. It's the amazing thing about these kind of markets. So like the time, time's an important consideration. And your average holding duration maybe for this year on some of those names, what's your holding duration? So for me, so it's almost like I have like a split personality. Like I think if you get the average, it's not like a proper representation. So there's probably stocks where like the average holding period is like four days, you know, some are a couple of days they can stop, some are like a week and a half they can stop. So like those are the stocks that are like the under performers. And after the ones that do work, like that's a different crowd. That's usually like two to four months. So that's",
    "start_timestamp_seconds": 540.32,
    "start_timestamp": "00:09:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=540"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 11,
    "total_chunks": 59,
    "text": "couple of days they can stop, some are like a week and a half they can stop. So like those are the stocks that are like the under performers. And after the ones that do work, like that's a different crowd. That's usually like two to four months. So that's a new average of three. So there's kind of like, if you look at the trades that split on the two sides. And I was gonna ask, so like is a percentage of trades, is it like 50, 50-ish or is it like the only four months or usually the rock star moves? But it's probably like, probably like close to like a 35, 65 or something like that, for you know, a 37. Depends how good the market, like in hot markets, it could be near 50, 50, or even better in bad markets. It's like, could be 2080 for a little bit, you know, so it depends with the market. And when you're prospecting to enter your trades, I know that you obviously follow an adapted version of Can Slim that you've built and refined over time. One of the things I find so fascinating about Can Slim is that it is a lot of fundamentals that they look at. Obviously overlay with technical for timing. But then if you're talking about like a quarter long holding duration, that seems like a shorter window for like fundamentals to fully be reflected. So can you talk about that relationship",
    "start_timestamp_seconds": 597.6,
    "start_timestamp": "00:09:57",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=597"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 12,
    "total_chunks": 59,
    "text": "is that it is a lot of fundamentals that they look at. Obviously overlay with technical for timing. But then if you're talking about like a quarter long holding duration, that seems like a shorter window for like fundamentals to fully be reflected. So can you talk about that relationship a little bit? Well, I see, so like what I find, like if you could, like the alternate moves for most of these big winners, and seem like Will and Will and Neil speaking at Can Slim or anyone who does this style, like the majority of the full most of these stocks, or let's say 18 months, that's an average full cycle for a stock to do, it's entire move. The thing is though, normally you'll have like a three to five month really hot run, then you'll have like a correction. And the corrections can be 15, they can be 35. So depending on how, like because I'm a more aggressive trader, I'm very concentrated, I tend to be on margin, like you don't want to sit through a 35 correction like on heavy margins, it's very, very painful. So if I do sit with some stocks, it'll be like the few most I'm looking to kind of capitalize on those individual legs, it's almost like the different quarters of a football game or something like that, you think a bit. So it's like I try after each quarter, to reassess like who do I want to stay",
    "start_timestamp_seconds": 650.0,
    "start_timestamp": "00:10:50",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=650"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 13,
    "total_chunks": 59,
    "text": "be like the few most I'm looking to kind of capitalize on those individual legs, it's almost like the different quarters of a football game or something like that, you think a bit. So it's like I try after each quarter, to reassess like who do I want to stay in or just move the cash and look to kind of rebuild and do it again. So that's what works for me with my personality. Like always tell people, it could be the best strategy in the world. It doesn't mix with your personality, it won't work. So that's how I found it to be helpful. I literally say the same thing all the time, literally the same thing, because that exact note is like the definition of square peg round hole and there was actually a post that came across on Reddit not too long ago. I like to post on there once in a while. And there was somebody that was in like the day trading subreddit and they were like the silliest thing dude. They were like, I'm so good at swing trading, but I wanna be a day trader so bad. Why, I don't know why, why do you want to torture yourself? Yeah, the first thing I thought it was just like, how stupid is this? That like you're just worried about a label, swing trade every day, now you're a day trader. Like who gives a fuck? What the label is bro, just do",
    "start_timestamp_seconds": 714.04,
    "start_timestamp": "00:11:54",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=714"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 14,
    "total_chunks": 59,
    "text": "why do you want to torture yourself? Yeah, the first thing I thought it was just like, how stupid is this? That like you're just worried about a label, swing trade every day, now you're a day trader. Like who gives a fuck? What the label is bro, just do what works, exactly to your broader point of find what gels with you. Now you mentioned something there that drew my interest about the use of margin and it begs the natural question, why use margin when you can use option? And okay. So I think you're slowly seeking into my brand. I'm trying to fucking wear you down bro. You are, you're gonna be down. But I've been really working on, again, I like to get concentrated, I like to be aggressive. It's just my natural thing. If I think markets are hot, if I'm like, if I have 20 cash, I'm kicking, if I'm only 120 invested, I'm upset on myself. Like I wanna be aggressive. When you start getting to that 150, 200 invested the volatility's wild. So the thing is with options that they're less liquid, the expire, your paying, the implied volatility all the time is a draw. So like what I like to do, what I've begun doing, is not get really, really heavy. But when I have indicators that will show me that we're stretching the short term, I'll start to kind of buy some, let's say two, three week put options, a",
    "start_timestamp_seconds": 770.32,
    "start_timestamp": "00:12:50",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=770"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 15,
    "total_chunks": 59,
    "text": "is a draw. So like what I like to do, what I've begun doing, is not get really, really heavy. But when I have indicators that will show me that we're stretching the short term, I'll start to kind of buy some, let's say two, three week put options, a little bit out of the money so the cost is not too much. Because again, kind of like I was saying before, sometimes the corrections are 10. And they're like, okay, that's cool. No, it's not a big deal. So that's a 30 or there could be a downgrade. All these girl stocks, like analysts love to downgrade them and it's like they get these big massive hits out of nowhere. So I've found, so I've started to incorporate them more and more to kind of just to smooth out the equity curve. But like, so the way I kind of use it, so basically once you're running up, it's probably different than how you would do it. But like the way I look at it is that what I wanna be totally long, I want the full delta going up. But then after once I get like at an extended point, then I just wanna be like a call option. Like I wanna take more ups. So basically you know, stock with the put, you're like synthetic call basically. So I just wanna like, I want it, so I still wanna be long, but not a lot all the",
    "start_timestamp_seconds": 841.96,
    "start_timestamp": "00:14:01",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=841"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 16,
    "total_chunks": 59,
    "text": "extended point, then I just wanna be like a call option. Like I wanna take more ups. So basically you know, stock with the put, you're like synthetic call basically. So I just wanna like, I want it, so I still wanna be long, but not a lot all the downside anymore. So I start to flip that in. And what's cool is like, let's say it does connect and you like the stock and it pulls back normally. Well, you're protected from that put that you bought cheaply, but also now you can start like actually buy a more stock on that pullback comfortably because there's like your big positions are already hedged out. So it's actually allowed me to like, I've been doing it on Tesla, I just lay it up and it's allowed me to build a monster position. And I never really took on like any additional risk than I would normally, but like that put hedging stride along the way worked out great. Yeah, that's awesome. I love that for you. Yeah, it's in your point about liquidity and what offers that's genuinely one of the answers I was expecting to hear from you even though you didn't explicitly say, you still kind of implicitly said it, where a lot of the stuff that I imagine you might trade may or may not even have option. Because. Yeah, they could be maybe they should have quarterly. I mean, some are super like like now I'm",
    "start_timestamp_seconds": 885.84,
    "start_timestamp": "00:14:45",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=885"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 17,
    "total_chunks": 59,
    "text": "though you didn't explicitly say, you still kind of implicitly said it, where a lot of the stuff that I imagine you might trade may or may not even have option. Because. Yeah, they could be maybe they should have quarterly. I mean, some are super like like now I'm like, I've said I'm trading Tesla. But that's of course, it's all great. Yeah, no, not a problem at all, but if it's a young IPO, I mean, what's the, what's the vault, the volatility, the pricing in and how liquid is it and how far out? So a lot of time it's just, and then it's like a thumb to break out. The break out fails, then you're trying to roll out of these liquid options and it becomes a bit tricky. So I like to build the position up. Now it's going my way. I can take my time to hedge like where I want and kind of smooth out the equity curve. So it's a different, different approach. Yeah, very, very. And it's that's one of the reasons why I love doing these, right? Is it's a chance not just for you and I to, to bullshit and share some different ideas, but it's also for people to hear different, different ideas because yeah, it's I find that's a big filter that I apply. It's I don't only trade options. I absolutely will use the underlying itself. If it's something that looks really, really good and I",
    "start_timestamp_seconds": 935.28,
    "start_timestamp": "00:15:35",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=935"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 18,
    "total_chunks": 59,
    "text": "and share some different ideas, but it's also for people to hear different, different ideas because yeah, it's I find that's a big filter that I apply. It's I don't only trade options. I absolutely will use the underlying itself. If it's something that looks really, really good and I feel like that's the only way reasonably to gain entry, but yeah, the even stuff that has decent liquidity, you I find that if there's a really big balance between how far out in time you go to decrease your daily theta, even though there's a higher gross theta, you kind of have to strike a balance because if you go out too far, then you are giving up more and more liquidity, which is a problem. So I can totally see that. One of the other things I noticed though with this, the like the breakout style of trading, this I've used it way more this year than the past few years because it just, I keep a pretty detailed log and I can see like what's, I'm always prospecting, but I can start to see like what's catching and it's like, okay, this is actually starting to, to really move the needle a bit. One of the things I noticed though is I wanted to pick your brain on the timing of entry. Obviously, that's the name of the game, right? Like that's the difficult part. And I find, I have no problem entering on a breakout if",
    "start_timestamp_seconds": 984.6,
    "start_timestamp": "00:16:24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=984"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 19,
    "total_chunks": 59,
    "text": "really move the needle a bit. One of the things I noticed though is I wanted to pick your brain on the timing of entry. Obviously, that's the name of the game, right? Like that's the difficult part. And I find, I have no problem entering on a breakout if it fails, take the exit, whatever the defined exit is, typically shortly below, wherever the lows were right before the breakout, the consolidation phase. And if it starts breaking out again, then I'll just get right back in. Like I really don't have any problem with that at all. Is that something you do? So I used to do more of that. Like the example of APP you showed, like that is the textbook example of what William Wanniel was showing his books. Like that's the reason why you would use a breakout strategy because it's not doing much of anything then boom breaks out and it's gone. I found that, I think it's because of HFTs and algos which have become more and more powerful, that's more and more rare to see. You don't see it that way so often. Like typically the big move happens like before the breakout, then you come back in. So I rarely, unless it's something like an APP, like I have a much stronger filter. Like that day the volume was huge. Like that was like, you need to have something that will make that day seem better because a roster so many",
    "start_timestamp_seconds": 1046.28,
    "start_timestamp": "00:17:26",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1046"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 20,
    "total_chunks": 59,
    "text": "breakout, then you come back in. So I rarely, unless it's something like an APP, like I have a much stronger filter. Like that day the volume was huge. Like that was like, you need to have something that will make that day seem better because a roster so many fake breakouts that even like, oh, I get out, I get back in, like that can get real costly because those reversals are fast. And you can tell, like if you're buying that breakout and it's up 6, and all of a sudden it's up 4, 3, 2, you're like, ah, the machines, that was totally a machine. And like you just know it, now I'm getting out, everyone's getting out at the same time, the spreads widen, I guess. And it's like, then you feel like adults. And also, like I typically like to start building into a position. So if I like the way the chart looks, like I'm building it's usually prior to the breakout a little bit, and then if it does have a big power for move, I'll, maybe I'll add a little, but I wanna see a close up there. And then typically the next couple of days, I'm looking for kind of backfill or consolidation pause. So like APP is an example, like again, I already had a pretty full play at that point. But even if not, if I wouldn't miss that initial breakout, like it's harder to chase, it's up two,",
    "start_timestamp_seconds": 1113.88,
    "start_timestamp": "00:18:33",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1113"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 21,
    "total_chunks": 59,
    "text": "next couple of days, I'm looking for kind of backfill or consolidation pause. So like APP is an example, like again, I already had a pretty full play at that point. But even if not, if I wouldn't miss that initial breakout, like it's harder to chase, it's up two, three days in a row, most don't have that straightaway type of move. There's a lot of backfill. So I prefer the backfill, I prefer like the pre-breakout. I actually, almost prefer everything but the breakout now, these, because I find it's, I mean, again, there's a logical argument for it, because that's like, you know, hey, the stock's finally going, but the machines have become very powerful. And they've read the books too. They can see that the retail flow, and I just read the old even pro flow coming on breakouts. And it's like, there's such an incentive to like push and fade. You know, if they can push enough liquidity to fade it, just that eight percent, they know all the stops will trigger and then they cover those shorts, and then they can get long and take it up a second time. You know, so over a course of like a few hours or a couple of days, like that's quite a profit. You could do on size if you have the capability to pull it off. So that's why I don't do the breakouts as much as people would think I do. Yeah, so it",
    "start_timestamp_seconds": 1163.4,
    "start_timestamp": "00:19:23",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1163"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 22,
    "total_chunks": 59,
    "text": "a course of like a few hours or a couple of days, like that's quite a profit. You could do on size if you have the capability to pull it off. So that's why I don't do the breakouts as much as people would think I do. Yeah, so it sounds like you're almost trying to front-run them a little bit. And then, yeah, front-runner, going for the confirmation, I'd rather pay a little bit higher and then build an actor, then like try and go with the stop order. Like you miss something like an APP sometimes. It's a real hard one to miss, but a lot of times it's like, it gets very, and it's a good market. Like then a shopping market, it's like 10X the chop, you know, like everything's failing. So it's, it can get tricky. Yeah, that leads to the, to the following one actually. Is that I've even noticed in the last couple of weeks that stuff seems to have slowed down, not a ton. But I'm not seeing as many things that are popping up that are looking quite as promising. Have you seen that, or you're just looking at different stuff? Well, I think it's because most stocks have been correcting. Like if you look at the, and not just like the small cast, but if you look at the yes and P500, yes, PY versus the RSP, RSP is like equal weights at SP 500. Like it's still like large",
    "start_timestamp_seconds": 1215.52,
    "start_timestamp": "00:20:15",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1215"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 23,
    "total_chunks": 59,
    "text": "Well, I think it's because most stocks have been correcting. Like if you look at the, and not just like the small cast, but if you look at the yes and P500, yes, PY versus the RSP, RSP is like equal weights at SP 500. Like it's still like large cap index, but it's been literally falling for I think 10 or 11 straight sessions, whereas, you know, the QQ looks great. So it's been, like the past couple of weeks have actually been, okay, if you were in just the right names, there was like a few like real, there's been a couple of main themes that have been powerhouses, everything else has been kind of consolidating. I think it's rotationary. Like I think this market's really strong. I think there's like massive field winds. Like I think the AI revolution is in a like, you know, people are talking Tesla, like Tesla is an AI revolution because I mean, autonomous driving is an AI answer. That's not being accelerated. And it's really a US centric development. Like there's no other country that has any kind of, I was just at the Alex card, the Palantir CEO, it's like he was even saying that there's no country that has the technology, the energy capacity, the intellectual, like you know how, how to put this together. And it's a revolutionary approach to how we do everything. So like I think this is such a strong market. I think we're getting",
    "start_timestamp_seconds": 1269.88,
    "start_timestamp": "00:21:09",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1269"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 24,
    "total_chunks": 59,
    "text": "he was even saying that there's no country that has the technology, the energy capacity, the intellectual, like you know how, how to put this together. And it's a revolutionary approach to how we do everything. So like I think this is such a strong market. I think we're getting rotations like Broadcom, like the semiconductor that's been dead, not suddenly Broadcom had a big move on Friday. And so like now those are gonna think of pause. And then you know, I bet my, the way I'm positioned, like there's Santa Claus rally and small myth caps are gonna rip all of a sudden. People will be like, oh, the ones that were quiet are suddenly going, you know? So I think it's rotationary. Speaking of that, what's been going on with small caps? They're like, I don't get it. Like everybody else is partying right now. Small caps, they're even, it looks like they're gonna get their cut this month. And they're just like, what are they doing? What's the problem? I think it's just like, I mean, in the market world, we forget about like the real economy a lot of times. But like, you know, like there's the haves, like all the great companies, the Google's, Metas, you know, Tesla, where their cost of capital super cheap, like the demand for their product, people are addicted to social media, and no one's getting off-medagest because of, like they're having a hard time at work, like everyone's",
    "start_timestamp_seconds": 1326.88,
    "start_timestamp": "00:22:06",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1326"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 25,
    "total_chunks": 59,
    "text": "there's the haves, like all the great companies, the Google's, Metas, you know, Tesla, where their cost of capital super cheap, like the demand for their product, people are addicted to social media, and no one's getting off-medagest because of, like they're having a hard time at work, like everyone's on all this stuff. And so for them, it's like, ah, whatever, but for small caps, like, you know, like the, you know, the impact of inflation on margins, and like, maybe a bit of a, like, slower economy than people wanted, like, that has a real, so they're not really screaming it. I think there's gonna be a catch-up when rates finally come down. And also, I think they thought rates were gonna fall quicker than they are, and they're not, because the fed's being a little more conservative here. So it's like, always kind of like, they promise the gift, and they kind of pull it back. So like, at some point they'll get a massive tail when there'll be some outperformance. But, you know, at the same time, as an institution, usually you go to a small cap for high growth. And that's the way I usually think, you know, small, even, I prefer mid caps. But you're looking suddenly at something like a Tesla, or a Google, or whatever, or like, you're gonna revolutionize like, autonomous, I think of all the, the impact of autonomous. So you get all the liquidity of a trillion-dollar company with",
    "start_timestamp_seconds": 1384.84,
    "start_timestamp": "00:23:04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1384"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 26,
    "total_chunks": 59,
    "text": "think, you know, small, even, I prefer mid caps. But you're looking suddenly at something like a Tesla, or a Google, or whatever, or like, you're gonna revolutionize like, autonomous, I think of all the, the impact of autonomous. So you get all the liquidity of a trillion-dollar company with the same growth rates, or higher than a small cap, with the cost of capital of, I established it, so it's like kind of, the usual pull, the smalls are out there, you know? Yeah, yeah, I was, because I've been obviously playing a couple of thematic moves in the Russell, just because of expectations on when the rate cut would find its way in. And I think we saw some of that, what was it? In like July, fell back, then we saw some of it in October. I think it was like mid late October, there was another pop. I think like really, really, I don't know, it's definitely had some big moves, but it's also been pulling back way more than I would have expected. It's been a while. It's been a while. Yeah, yeah, I'm rare, I'm kind of rare to see. Yeah, because I feel like they could, like, totally understand the consolidations, especially on something like this, but it's almost like a radic. And I can't quite put my finger on the pricing methodology that's going on there. Like I can't, because to me, to cause those moves, you need big institutional participation of",
    "start_timestamp_seconds": 1436.68,
    "start_timestamp": "00:23:56",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1436"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 27,
    "total_chunks": 59,
    "text": "like they could, like, totally understand the consolidations, especially on something like this, but it's almost like a radic. And I can't quite put my finger on the pricing methodology that's going on there. Like I can't, because to me, to cause those moves, you need big institutional participation of some sort, but it's hard for me to think that there's institutions that are getting in in like the beginning of July. And then two weeks later, they're like, ah, never mind, this is all bad. Let me get completely out. And then it reverts back to where it was before. It just, it confounds me. The only thing that made sense to me is, I think there's been a big trade on where, it's like your large, your long large caps, short small caps, like a market neutral approach. At every time, there's like the hope of more aggressive rate cuts, which is, you know, more bullish in short term, I do not theory small caps. It's like that, that trade goes in reverse. It goes one point this summer, where it's like literally the QQQ and the Russell were trading completely inversely to each other. Like it was this, like if the Russell was up 2, the Qs were down 1 and vice versa. And so, so I think that that trade got pushed to the every few years, there's like a trade that takes over. It was the carry trade at one point. There's always like a",
    "start_timestamp_seconds": 1500.6,
    "start_timestamp": "00:25:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1500"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 28,
    "total_chunks": 59,
    "text": "this, like if the Russell was up 2, the Qs were down 1 and vice versa. And so, so I think that that trade got pushed to the every few years, there's like a trade that takes over. It was the carry trade at one point. There's always like a trade that takes over that all the institutions, like everyone thinks the hedge fund guys are like, these geniuses, but a lot of them all have some drinks at night. Like you're doing that kind of a trade yet. And suddenly everyone has the same trade on because it's making money. So I think everyone gets on one side of the trade. And so you're seeing basically all those pops are the fear moments where, why gotta get out of this trade? And the small caps are less liquid. So it's like they're all trying to do it at the same time and then it's put back on. So I think you're just seeing yet what it curve like the guys who are putting on this long short triple Qs or Russell or whatever. And that's only to me that explains it because overall the advance, if you just look at, let's say a 50 day moving average, it's up to the roof. But the moves are like you're up 12. Yeah, you're up with, which doesn't make any sense. So it's definitely some kind of liquidity driven strategy, you know, move that's coming off and on. Yeah, and that's",
    "start_timestamp_seconds": 1559.72,
    "start_timestamp": "00:25:59",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1559"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 29,
    "total_chunks": 59,
    "text": "at, let's say a 50 day moving average, it's up to the roof. But the moves are like you're up 12. Yeah, you're up with, which doesn't make any sense. So it's definitely some kind of liquidity driven strategy, you know, move that's coming off and on. Yeah, and that's the part that I find so fascinating, bike. So I was looking at it for a little while and like the Russell was flat for a long, long part. And then all of a sudden it was starting to catch up to the SP 500. They weren't that far apart. They're like five, six points apart. And then they've obviously decoupled now where it spies up almost what like 30 and Russell's like sub 20 still. Yeah, that's why I think I have a feeling going to your end will probably get like a catch up move. So we'll see what happens. But it's been, it's been wild to see, I agree. And if you're at the perfect example, if you're a breakout trader, like that's a painful advance. You know, you look back and it's still out of your pants or you're saying what I just lost money the entire time. I bought it or something. I was just going to fill out it. And it's like you want to like hit something but that's why I was a bit of balance on the entries and whatnot. But it's been a, it's been a wild charge for sure. Yeah.",
    "start_timestamp_seconds": 1604.96,
    "start_timestamp": "00:26:44",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1604"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 30,
    "total_chunks": 59,
    "text": "entire time. I bought it or something. I was just going to fill out it. And it's like you want to like hit something but that's why I was a bit of balance on the entries and whatnot. But it's been a, it's been a wild charge for sure. Yeah. And well, you're coming on the breakout trading might make a lot of sense because I couldn't imagine that being like the thing you, the thing somebody does. Because I feel like if that's the only thing somebody does, you just have to be a glutton for punishment. You just have to be okay getting kicked in the shin over and over again until you get your couple of home runs. Like a really, anytime I run the strategies, it's like the win rate is typically okay. It'll still hover around like 60, which is a decent win rate. But there's still a lot of losing trade. It's 40 of trades losing is not good. Yeah. No, you know what? It's because I think it goes back to like I said before, markets were so much simpler. Like people didn't have the knowledge they had. So a lot of these, these strategies, I mean, really more meals started trading in the 50s, the 1950s, you know what I mean? So it's like back then you said you ordered to the floor, a guy went to the post, he bought the stock. Like it was in algorithms like moving this and",
    "start_timestamp_seconds": 1666.16,
    "start_timestamp": "00:27:46",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1666"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 31,
    "total_chunks": 59,
    "text": "these strategies, I mean, really more meals started trading in the 50s, the 1950s, you know what I mean? So it's like back then you said you ordered to the floor, a guy went to the post, he bought the stock. Like it was in algorithms like moving this and that's what it was different. If a stock had not gone anywhere for a while and then suddenly it would go to new highs on a big bit of volume probably was an insider buying or someone would use something about the company. Like it was very meaningful, like immediate information. Now, and it's easy to teach. It's a very teachable strategy. You wait until it's in a base and then after for breaks in new highs, that means people want it. And logically it is correct. But markets are pretty efficient, I always say that, you know what I say? It's not perfectly efficient, but it's pretty efficient. Pretty awesome. You know, like the machines that they're mad say, hey, that you have these people who run in on this idea and then run out and you know, you've been through so long, every cycle there's new people who come and learn that they learn the basics first and it takes time to realize it's not bad at easy, you know, so. Yeah, yeah. It's, yeah, this past year's been really interesting just because it's led me to lean into some of the other kinds of approaches that I",
    "start_timestamp_seconds": 1722.6,
    "start_timestamp": "00:28:42",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1722"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 32,
    "total_chunks": 59,
    "text": "come and learn that they learn the basics first and it takes time to realize it's not bad at easy, you know, so. Yeah, yeah. It's, yeah, this past year's been really interesting just because it's led me to lean into some of the other kinds of approaches that I got a little dusty that I had necessarily been using a lot of the stuff before that was really, really focused on volatility and because it was everywhere. Now, when you look back over 2024, what are some of the primary themes that stuck out to you? Not the obvious ones, not the high interest rate environment and stuff like that. What were some of the themes that you picked up this year that were more novel that you're like, oh, this is kind of a new thing I'm seeing. In terms of actual stock themes are like investing process. Whatever makes you happy. Well, sometimes you know, it's interesting. Like one thing I thought that was gonna be stronger was cybersecurity. Like you would think with the AI revolution that there'd be an emphasis on like stopping fakes and so that was like an early theme I was putting on early in the year that didn't kind of like come to fruition. Like it's a bit of like you look back at the gods, like wasted time, like there was other things that were working better. So this year was tricky in a sense that there was a lot",
    "start_timestamp_seconds": 1777.0,
    "start_timestamp": "00:29:37",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1777"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 33,
    "total_chunks": 59,
    "text": "on early in the year that didn't kind of like come to fruition. Like it's a bit of like you look back at the gods, like wasted time, like there was other things that were working better. So this year was tricky in a sense that there was a lot of rotations in themes. So you know, the semiconductors were red hot and then like look at AMD now. Like it's, it's awful. I mean, like terrible, you know, but at the same time like broad comments now blasting off. So it's like a lot of stocks in the end did generally well, but if you were in the wrong place in the wrong time, you still could have been very painful for you. So there's a lot of that rotational themes that would come in, which is pretty normal. Like most markets will have that. What I think, again, well, my kind of like base case that I've been trying to follow was like the internet rule out the 90s where, you know, it wasn't just, you know, people making mainframe computers that dominated it. It was, it was first, it was like, you know, routers and switches and ethernet cables. Then that went to internet portals. Then I went to browsers and then I went to mobile phones. So it's like everything built on itself. So if you're just kind of sat back, you know, like the NAS that kept going up, if you sat back in that",
    "start_timestamp_seconds": 1839.96,
    "start_timestamp": "00:30:39",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1839"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 34,
    "total_chunks": 59,
    "text": "ethernet cables. Then that went to internet portals. Then I went to browsers and then I went to mobile phones. So it's like everything built on itself. So if you're just kind of sat back, you know, like the NAS that kept going up, if you sat back in that original theme, saying like that's it, these are the guys who are going to lay the foundation for everything. Well, once they got fully priced, like the market went on to like what was going to come next and next and next and next. So that's kind of what I was expecting. It's not always easy to catch even if you're expecting it because I mean, you don't really know, like it's all new technology. Like looking back, it's easy to study. And real time is like sometimes I look at these companies and I spend 20 minutes and I'm like, what they do? Like what is this contraption that they have? You know, like, you know, so, but like that's the way you have to think. So I think it's typical, but it's never easy. But definitely like I think looking at it from the lens of how the internet rolled out, like through and how like there's reverberations through different industries and how the industry itself drew, I think that's the right way. So I think it was to the point, but yeah, that's kind of, I think the themes that came out were just always trying to",
    "start_timestamp_seconds": 1898.56,
    "start_timestamp": "00:31:38",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1898"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 35,
    "total_chunks": 59,
    "text": "internet rolled out, like through and how like there's reverberations through different industries and how the industry itself drew, I think that's the right way. So I think it was to the point, but yeah, that's kind of, I think the themes that came out were just always trying to understand what's going to come next. You know, and how it's going to be the next player. I think your point on semi-conductors is massive because I think that that caught a lot of us off guard. The fact that they've hailed off literally as a sector quite as hard as a sector. And that also seems, I can't fully tell what that's driven by. It's not like demand for semi-conductors is going to go away. Even now that we're talking about just more computing being required for everything beyond AI, but now we have this new emergence of quantum computing with Willow and Google that's been, you know, worked on for 12 years. Now that's starting to gain some traction. So when you think about a sector like semi-conductors, what are your thoughts on it? You think that this is just profit taking for people that are got in super low, screws making ducking it, swimming in gold coins, or like it just seems like the demand isn't actually contracting that. It goes back to your other question, like we were saying, how long do you stay in these stocks? Because the market exaggerates the way up, and exaggerates",
    "start_timestamp_seconds": 1947.84,
    "start_timestamp": "00:32:27",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=1947"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 36,
    "total_chunks": 59,
    "text": "super low, screws making ducking it, swimming in gold coins, or like it just seems like the demand isn't actually contracting that. It goes back to your other question, like we were saying, how long do you stay in these stocks? Because the market exaggerates the way up, and exaggerates the way down. So like when you're on the way up, like for example, not pounded, I had a great traded pound here. I got in like 20s, I exited like in the 70s, which was a great trade. But like even I have some clients, they're like, why are you selling pound here? Well like look, it is trading like at 65 times sales. Like I always say, I wish I could start any company and sell it at 65 times just my sales for the year. Like I'll sell at a year one, it's gone, you know? Like think about it, like 65 years should now be dead. I can get all of those sales like done now, you know? Like that value. So the thing is it's like, I love pound. I think pound here is in such a unique spot, like in the AI ecosystem. But like, you know, look, I mean, the market will just get headed itself on the way up. Then it has to, so at some point, you know, like pound here is gonna correct or make a base and it'll be, you know, it'll work again. But also sometimes like with",
    "start_timestamp_seconds": 2010.56,
    "start_timestamp": "00:33:30",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2010"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 37,
    "total_chunks": 59,
    "text": "like, you know, look, I mean, the market will just get headed itself on the way up. Then it has to, so at some point, you know, like pound here is gonna correct or make a base and it'll be, you know, it'll work again. But also sometimes like with the semis, when it's new technology, like stuff's moving so quickly, sometimes it's like someone has run over. Like AD, even though it's a big player, you can say like, well, you know, like maybe people thought that their chip wasn't gonna be competitive, they'll be able to do something competitive and maybe they can't. So from having to look at Intel, Intel sucks. After all these years when it was a kingpin. So you know, that's why I like to kind of sell in those four or five months cycles when I can. And then you always reassess on every pullback. Because the pullbacks are normal. They're not broken, the stocks. But at the same time, sometimes the stocks that you thought were gonna be winners, you find out where, in fact, sometimes even though they're in the industry of where the heat is, they get run over by the new engines. You know what I mean? I think they look at Blackberry. I mean, you could have said like mobile phones are gonna be the future 15 years ago or 20 years ago when you were bang on right, but Apple destroyed them. So if you just sat",
    "start_timestamp_seconds": 2065.32,
    "start_timestamp": "00:34:25",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2065"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 38,
    "total_chunks": 59,
    "text": "the new engines. You know what I mean? I think they look at Blackberry. I mean, you could have said like mobile phones are gonna be the future 15 years ago or 20 years ago when you were bang on right, but Apple destroyed them. So if you just sat there saying like, oh, you know what's gotta be, you know, come on. Blackberry's still mobile phone, yeah. But they got completely run over by Android and Apple. So I think that's what's going on with Semi. It's like, I agree. Like, look at Broadcom, big move up, like, Time on Semi, like, but now this quantum computing changed anything. I doubt in the short term if you kind of look into it. But there's so much stuff coming down the pipe. It's like, especially as an investor, we tend to be generalists. Like, I mean, like I was saying it half-joking, but it's true. Do you really, do you personally understand the difference between, you know, an Intel chip or AMD chip and an Nvidia chip, like really down to what makes one so much better than the other? Like, sometimes it's hard to understand what these guys even do, you know, so. So that's the way I look at it. And that's why, you know, those drops, this isn't ruined the stock, but it does give you a chance. That's why a relative strength to me is so important. Because the stock that just drops the least, you",
    "start_timestamp_seconds": 2116.16,
    "start_timestamp": "00:35:16",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2116"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 39,
    "total_chunks": 59,
    "text": "do, you know, so. So that's the way I look at it. And that's why, you know, those drops, this isn't ruined the stock, but it does give you a chance. That's why a relative strength to me is so important. Because the stock that just drops the least, you don't have to know is that chip better. The market's telling you that chip is better. If AMD is down 50, and XYZ stock is down 15, and they're both in the same group, like go out, go with XYZ, like a stock, like they won't sell that stock for a reason. Like the people who do know, the people who do make the semis or the institutions where they're specialists and semiconductors, like they know AMD is gonna be beat. And this one's gonna be the winner. So that's why to me, relative strength is so critical, especially on pullbacks. It's a great way to phrase it. When you see all these new policies coming out from our boy, Trump, you know, he's out there, heckling, slinging tariffs, the comedy show is back. And so it's awesome. I anytime I have a chance to listen to that dude talk, there's a zero percent chance I miss it because it's freaking hilarious. He always comes up with, he always comes up with something that you just don't expect. On the trading desk, we had a clip from him when he was running the first time saying, he's like, we're gonna",
    "start_timestamp_seconds": 2168.56,
    "start_timestamp": "00:36:08",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2168"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 40,
    "total_chunks": 59,
    "text": "there's a zero percent chance I miss it because it's freaking hilarious. He always comes up with, he always comes up with something that you just don't expect. On the trading desk, we had a clip from him when he was running the first time saying, he's like, we're gonna win so much. You guys say Mr. President, please stop winning. I'm gonna say no, we need to win more. So every time we're having a good trading day, we would have that clip on, we'd all be laughing together. Sorry, I didn't mean to cut off your trade thought. No, that's like the exact kind of talking. So with that back in terms of introducing policy and stuff, it seems like there's a lot of new changes coming down the pike. We're seeing deregulation likely in the financial sector. We're seeing oil and gas probably coming back in a vogue. We're seeing EV credits probably going away. Like a lot of things I see that really stick out to me, but what are your thoughts? And I always love listening to a Canadian talk about this stuff because I have to be honest. I don't know shit about what your prime minister has talked about recently, but everybody knows what's going on. He doesn't know what he's been talking about ever. So it's okay, don't worry about it. If ever you're unhappy with your politicians, you can look at Justin Trudeau and feel good about yourself all this. But,",
    "start_timestamp_seconds": 2224.56,
    "start_timestamp": "00:37:04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2224"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 41,
    "total_chunks": 59,
    "text": "your prime minister has talked about recently, but everybody knows what's going on. He doesn't know what he's been talking about ever. So it's okay, don't worry about it. If ever you're unhappy with your politicians, you can look at Justin Trudeau and feel good about yourself all this. But, God, I mean, I mean, look, it's an instead of winners and losers. What I really like about Trump, the return of the Trump, is that I think especially having a guy like Elon Musk, which, I mean, sometimes some people, my brother-in-law's that he teaches finance at university. And his colleague is on the other side of the political spectrum. He really just doesn't like Musk and Trump and all that. And so, he's like, you know, Musk's not even that good of a businessman. And he was like, come up. Like, he's maybe possibly very likely the best businessman who ever, like, he if you don't like his politics, you can't say he's a bad business person. I mean, he's winning his 50s and he's like probably going to be the first trillionaire. Anyways, so what I like about Trump version two, better than one, is I think there's better economic guidance. I think Musk isn't going to play that role. I think Musk realizes, I think for his own ambitions, that like, you know, even for a time he's driving in the rest and everything else, like space on Mars and shit. Run a Mars and whatever",
    "start_timestamp_seconds": 2290.28,
    "start_timestamp": "00:38:10",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2290"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 42,
    "total_chunks": 59,
    "text": "there's better economic guidance. I think Musk isn't going to play that role. I think Musk realizes, I think for his own ambitions, that like, you know, even for a time he's driving in the rest and everything else, like space on Mars and shit. Run a Mars and whatever other crazy ideas he has, that he's not even articulating. Like, you need the way that I thought. Framework, sorry. Isn't that a thought? I started to cut you off. That just really struck me. The fact that like, he's talking about fucking colonizing Mars, which is kind of crazy. And your comment that you just said of, even the ideas that he's not articulating. That's crazy. That's crazy. We have to, that's openly talking about colonizing Mars. And then that begs the question, what else is going on in the brain? That's not sorry. That just, to be fair though, with Musk, like so much of what he's doing, which is, to me, is amazing. It's like, if you watch his old clips, like I love to study people, you know, as he said so much of it, like 25 years ago, like I wanted, like after he sold PayPal and he has, he's like, I'm going to build this, I'm going to build this. And it's like wild. That like any of that even happened. Never mind all of it pretty much, you know what I mean? So for round two, I think, at least the hope is,",
    "start_timestamp_seconds": 2348.36,
    "start_timestamp": "00:39:08",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2348"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 43,
    "total_chunks": 59,
    "text": "PayPal and he has, he's like, I'm going to build this, I'm going to build this. And it's like wild. That like any of that even happened. Never mind all of it pretty much, you know what I mean? So for round two, I think, at least the hope is, you know, like that it's going to be more thoughtfully implemented, you know, like, you know, everyone's scared of tariffs, but I mean, like, you know, with the right team, like a tariff, it can be, if you have a domestic alternative, a tariff doesn't necessarily, like, hurt your domestic economy very much. If you don't have a domestic alternative, well, yeah, then the whole cost of the tariff basically gets passed onto the consumer. So like, I mean, I don't think it's going to be like blanket tariffs and all the rest. So like, I'm more optimistic that it's a pro business climate, that's a deregulation climate. If you look at any country in the world, like I always tell people, like it's, like, like I, and that's in some of the least racist person in the world, I always tell people, it's like everyone can have incredible success. Like China was horrible in the 90s. They started these free markets, small cities, and they boomed like East West Germany. West Germany was amazing. East Germany was terrible because one was communist, one was cap. So it's like, you know, like, just get those foundations there. It's not going",
    "start_timestamp_seconds": 2406.16,
    "start_timestamp": "00:40:06",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2406"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 44,
    "total_chunks": 59,
    "text": "Like China was horrible in the 90s. They started these free markets, small cities, and they boomed like East West Germany. West Germany was amazing. East Germany was terrible because one was communist, one was cap. So it's like, you know, like, just get those foundations there. It's not going to be perfect, but moving towards free market capitalist deregulated ideas, there's going to be bumps in every city, but you'll have a much, much better outcome, especially when you mix that with like, technological breakthroughs, like AI. I'm personally very hopeful for the next, and not just because of Trump, I think just because everything is just going in a better direction, that's more pro business. And pro business means, I'm someone who believes in, I'd rather have a bigger pie for everyone to share than a smaller pie. And we're all fighting each other to cut that up in a different way. So I think bumps are not, like I think overall it's going to be rock and roll, especially tie that with AI and all the rest. It's going to be some amazing opportunities. Amazing. Do you see any specific sectors or industry that you expect to suck over the next two years? Or within whatever timeframe, just a reference period? Anyone, I think anyone who relies on big government spending, even though Trump is very like, you know, pro-military and all the rest, like, you know, like, you know, we got like Musk, like he was",
    "start_timestamp_seconds": 2459.12,
    "start_timestamp": "00:40:59",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2459"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 45,
    "total_chunks": 59,
    "text": "suck over the next two years? Or within whatever timeframe, just a reference period? Anyone, I think anyone who relies on big government spending, even though Trump is very like, you know, pro-military and all the rest, like, you know, like, you know, we got like Musk, like he was just joking recently, like why are people still designing and building like F-35, you know, like Jets, when drones are the future? Like I think it's got, like if you're an incumbent person where you benefit from regulation, like a lot of companies like LIKE regulation, if you're the big, the big boy, a regulation protects you, it's like a mold that keeps others away from you. So I would be more concerned of people who are very entrenched and benefit from big government. Like that's where I think the pain can come and stod your companies that are not as willing to kind of move into new tech. Cause it's like with the internet, if you didn't embrace the internet that you were running over, so that's where I think that the risks come. The other element I think about green energy stuff like that, there's been a bunch of stuff in there that I think is already starting to show early weakness. At least you only trade to the upside though, right? You don't fade stuff. Yeah, if I do like I'll do two parts. Like I'm not, I don't like being short typically. I'm not like a",
    "start_timestamp_seconds": 2516.76,
    "start_timestamp": "00:41:56",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2516"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 46,
    "total_chunks": 59,
    "text": "of stuff in there that I think is already starting to show early weakness. At least you only trade to the upside though, right? You don't fade stuff. Yeah, if I do like I'll do two parts. Like I'm not, I don't like being short typically. I'm not like a short guy. Yeah, I'm, I'm reckless. I don't care. Up down sideways. It's my mind, like my first year trading pro was 2008 and like I made good money that year and I traded along the whole year. I don't know what I would have done if I had to trade short, but I just traded long, it's just the way my mind works. So yeah, yeah, which is, I was at the point like, why fight it? You know, if you know what you're going to have, like don't like, you know, so. And I think something like AI, AI has the ability to quite literally transform, I mean, most industries to some degree in some way, even if we're talking things like HR process, but not. What do you think this does to labor force? And what do you think that that leads into over the rollout of AI? Yeah, I think everyone's worried about it, but if you look back at like most technological revolutions, you never really see them like, you know, over let's say the intermediate term into any real trouble, like people just start doing. Re-skill things, you know what I mean? It's like,",
    "start_timestamp_seconds": 2585.76,
    "start_timestamp": "00:43:05",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2585"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 47,
    "total_chunks": 59,
    "text": "AI? Yeah, I think everyone's worried about it, but if you look back at like most technological revolutions, you never really see them like, you know, over let's say the intermediate term into any real trouble, like people just start doing. Re-skill things, you know what I mean? It's like, I don't know if you heard of Malthus' theory, it's like one of the early economists, like they thought the world was gonna have like peak population because there's only so much food you can grow. Well, yeah, well, the amount of crops we get at break ranges like skyrocketed with better technology so we could feed more people. So like I'm an optimist in that respect. The AI revolution is gonna be weird compared to others because like I feel up until now, almost every revolution is like worked to replace manual labor. This is the first time where I think like white-collar people are probably more like at risk because if I think if you're a manual laborer, it works to your benefit, like it's very hard to kind of replace someone who lays tiles in a house or something like that or in a building. So I think that's gonna be tricky, which like people haven't experienced. So if you have a mid-manager job and you're 50 years old, it's like you gotta start to kind of concern yourself or if you're like what the future will be. Like you better be on track with what's happening,",
    "start_timestamp_seconds": 2637.76,
    "start_timestamp": "00:43:57",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2637"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 48,
    "total_chunks": 59,
    "text": "think that's gonna be tricky, which like people haven't experienced. So if you have a mid-manager job and you're 50 years old, it's like you gotta start to kind of concern yourself or if you're like what the future will be. Like you better be on track with what's happening, I would say, for your own benefit. I thought you were gonna say that they were gonna have to start working on the dance moves in case they'd go be a stripper. But okay. That's always that. That's business, it's business. The world's the whole profession, it's hard to replace that with AI. Exactly. So and everybody has needs. Okay, so for everybody that's in the chat, if there is anything that you want to ask Matt, you could start throwing it in now. I have a couple more questions for him before we wrap in like five, six minutes. The 2025 key themes that you have in mind, if you were to pick a few of them on how you're interpreting what kind of things you wanna get into, you wanna eyeball, you wanna position into for 2025. What are those? To me, one of the top is autonomous driving. I think it finally can come to fruition. And if you saw just recently GM pull their crews like autonomous driving program. So like it's basically a two horse race, it's Google and Tesla. It's two companies who have the potential to change how everybody in the world moves.",
    "start_timestamp_seconds": 2694.88,
    "start_timestamp": "00:44:54",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2694"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 49,
    "total_chunks": 59,
    "text": "driving. I think it finally can come to fruition. And if you saw just recently GM pull their crews like autonomous driving program. So like it's basically a two horse race, it's Google and Tesla. It's two companies who have the potential to change how everybody in the world moves. Like think of like the scale of what that can mean. It's like enormous. So for me, that's one of the big ones is autonomous driving. And everything really, to me, it's like an AI centric play. But the thing is, I don't know how it's all gonna play out. Like new names come up, like Estara Labs came out. You know, they try and like speed up how like data transfers and all the rest. And so it's like just being awake, I think one of the themes that we're gonna have to, that will be big is new IPOs, new young companies. It's been a very frozen IPO market. Yeah. Tie that in with like the regulation and a better market, I expect to see a lot more of that coming. So I think just being on the lookout for every company in every industry, like in Fintech, I'm really focused on Fintech, like Lenders with a back job of falling interest rates. And now like better in models, I think they can have a huge upside move. Upstart is a stock I've been on for a while. They were big like last cycle and they got creamed",
    "start_timestamp_seconds": 2761.2,
    "start_timestamp": "00:46:01",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2761"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 50,
    "total_chunks": 59,
    "text": "I'm really focused on Fintech, like Lenders with a back job of falling interest rates. And now like better in models, I think they can have a huge upside move. Upstart is a stock I've been on for a while. They were big like last cycle and they got creamed with all that. But they've been coming back, they've been doing great. And it's interesting I was reading like the company reports. And they were saying like over the past two years, so everyone hated on the stock. They improved their models, not more than expected. They improved their models more than they thought was possible. Like I think like up to 90 of their process is fully automated. Like start sprinkling on even more AI capability and data processing, that's huge. So I thought I was driving everything AI and how that's gonna leak through to things like Fintech are like my big focus is going to 2025. What about cryptocurrency, Bitcoin? I think that's, I know that cryptocurrency might not be your direct bag, but it seems like there's a lot of things in Fintech that are gonna be able to play the game as that seems to be a massive, massive initiative. Like I like Bitcoin. Like I think Bitcoin is, it's hitting critical mass to a point where it's like keeps snowballing itself higher. But to me, I feel like everything else crypto related hasn't found the right product market fit. Like they're trying to make",
    "start_timestamp_seconds": 2820.72,
    "start_timestamp": "00:47:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2820"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 51,
    "total_chunks": 59,
    "text": "be a massive, massive initiative. Like I like Bitcoin. Like I think Bitcoin is, it's hitting critical mass to a point where it's like keeps snowballing itself higher. But to me, I feel like everything else crypto related hasn't found the right product market fit. Like they're trying to make crypto do things that it, there's like, you know, like I like to be start on a books to an entrepreneur books. It's like, you know, something has to be just good enough to keep its position. Like if you're gonna, like this lodge, like incumbent technologies and stuff, you gotta be much better. So I feel like Bitcoin is caught in the imagination, but everyone try and do everything crypto. I don't know who else the winners are gonna be, like all these small coins and stuff. Like a lot of it is very scammy. So like I'm just, I mean, I'm long like Microsoft and trading Microsoft, they actually just got it to the NASDAQ 100, which is cool. So hopefully we're trading higher Monday. So still like pressing that, you know, through I bit and the rest, but beyond Bitcoin, I don't see where the big theme is or I can't see, I can't see where the endgame is for other crypto related things. Well, the good part too is with something like micro strategy and sailors genius plan to just do convertible debt, you know, so that the new people that are buying debt are subsidizing",
    "start_timestamp_seconds": 2878.48,
    "start_timestamp": "00:47:58",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2878"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 52,
    "total_chunks": 59,
    "text": "is or I can't see, I can't see where the endgame is for other crypto related things. Well, the good part too is with something like micro strategy and sailors genius plan to just do convertible debt, you know, so that the new people that are buying debt are subsidizing the existing positions. It's kind of really cool to see you just be able to make money out of thin air and just keep dealing that. So I'm excited to see how that goes for him. It's funny, like the way he explains it, he explains it so like matter of fact that he can't lose because Bitcoin keeps going up. But wild. It's basically just a really big leverage position and I'm aware of it. Literally. Like I mean, if Bitcoin drops, like the company is in very big trouble, like if there's no special magic that he's found besides like leverage. I know. I have this amazing strategy that I'm gonna have. I'll have you to invest with me with. You let me a lot of money. I'm gonna buy a few QQ because the stock market just goes up. And so as it goes up, then I'll borrow more money and I'll buy more stocks and the stocks will go up even more. Like yeah, it's all stocks go up. It's a great strategy. We'll make a lot of money together. But if there's a problem somewhere, I mean, and like to be fair, like Bitcoin was",
    "start_timestamp_seconds": 2940.28,
    "start_timestamp": "00:49:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2940"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 53,
    "total_chunks": 59,
    "text": "borrow more money and I'll buy more stocks and the stocks will go up even more. Like yeah, it's all stocks go up. It's a great strategy. We'll make a lot of money together. But if there's a problem somewhere, I mean, and like to be fair, like Bitcoin was down to, was like 15,000, like just a couple of years ago. So it's not like it's impossible for this to go down. So, but that, you know, when you trade long enough, you get cynical about a lot of things. So I try and balance all that. But anyways, it's just the way he talks about it is if it's like a cat mistradigy, and I just see a lot of things. And so. That's honestly, that's the, that is the problem because I traded MicroShreddyshees who specifically on the breakout that it had in early November. Say it. Yeah. And like it's no problem, right? Like companies are gonna have ups and downs. But yeah, the fact that he, every, he intelligent leverage, like dog. What? What's me? Bro, like, it's not leverage. It's intelligent leverage. It's different. It's different. All right. So there's a couple of things I saw come in that I want to ask you quick. One of them is from Tommy. He says are a, a, I software companies going to get customers to pay. That's actually a great point. So companies like Microsoft Apple, CRM, Amazon. What do you think about that? I",
    "start_timestamp_seconds": 2998.72,
    "start_timestamp": "00:49:58",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=2998"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 54,
    "total_chunks": 59,
    "text": "I saw come in that I want to ask you quick. One of them is from Tommy. He says are a, a, I software companies going to get customers to pay. That's actually a great point. So companies like Microsoft Apple, CRM, Amazon. What do you think about that? I think so. Like I think we have to move past like I was surprised Apple on such a bump with their thing because like these like funny emoji or whatever. Like to me, that's nonsense. I don't think it was a pay for that. But if you can have things that are going to be productive, like a helpful productivity, like chat, like I paid 20 bucks a month for chat GPT and it saves me a ton of time. I'm very happy. Like I find that way, way more value than so many other softwares that I pay for. So I think they will. I think we're early days. It's kind of like the parallel I would draw is like, if you, I mean, I don't know how Tommy is with the question. But if you go back early enough and be like, would people really pay for like data on their mobile phone? Well, the early mobile phones you couldn't do much with data. So the ads were like, oh, why would they pay for that? But you have to kind of see how it'll snowball and grow over time and how one thing builds on another. So",
    "start_timestamp_seconds": 3063.96,
    "start_timestamp": "00:51:03",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=3063"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 55,
    "total_chunks": 59,
    "text": "data on their mobile phone? Well, the early mobile phones you couldn't do much with data. So the ads were like, oh, why would they pay for that? But you have to kind of see how it'll snowball and grow over time and how one thing builds on another. So I think, I mean, like look, look at how like minimum wage of gone up right and all this kind of stuff. If I can save you 10 of your time in the day, every day, you wouldn't pay me 25 bucks a month. I mean, I wouldn't make that short. If you could save me two percent of my day, every day I'd give you 25 a month. What 25 a month? So like I think there is a big opportunity. But yeah, it can't just be, but that's the bad part about growth investing is that people will start like, AI, AI, and it becomes like this, like this fairy dust of like whatever magic stuff, like no, at the end of the day, it has to be a pro-dust. So that brings dry's value. But I do think they'll get there. Autonomous driving is one. I mean, think of how many people would rather have an autonomous vehicle, you know, what's safe and we're all sure about that. Over having to pay more for someone to come pick you up, make conversation with that person. Like I bet a ton of people will say, like give me",
    "start_timestamp_seconds": 3115.84,
    "start_timestamp": "00:51:55",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=3115"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 56,
    "total_chunks": 59,
    "text": "think of how many people would rather have an autonomous vehicle, you know, what's safe and we're all sure about that. Over having to pay more for someone to come pick you up, make conversation with that person. Like I bet a ton of people will say, like give me the robot at half price. I don't have to talk to anybody in the car, you know? So that's also just because you're too nice. Because if I get him with like a lift or somebody in the room, they start trying to talk to me, but like, sorry, I don't feel like talking. I just don't need it. I have to be nice. It's a problem. I know. And then you got to get you got to talk to him about maple syrup and stuff. I get it. It's a big thing. I feel you. And then Bueller just wanted to let you know that he was very thankful for you hanging out. He said that you're funny. I think you're funny too. And then Tommy says, would you pay 200 a month if AI improved your work day a lot? Yes. It's a no-brainer. Yeah, that is a no-brainer. I, and I think a lot of people at this point, they have enough disposable income of some sort to be able to scrounge up something like that if it makes a big impact. And the other thing I think for AI on top of that is because it",
    "start_timestamp_seconds": 3165.48,
    "start_timestamp": "00:52:45",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=3165"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 57,
    "total_chunks": 59,
    "text": "no-brainer. I, and I think a lot of people at this point, they have enough disposable income of some sort to be able to scrounge up something like that if it makes a big impact. And the other thing I think for AI on top of that is because it can be so scalable that can naturally control some of the costs. They're going to come up with different tiers. I'm sure. Yeah. Well, I think almost everybody paid, like everyone has their main car. How many people have a second car that they're paying five, six, eight, and a 1 a month for? Which they're barely using, but that those two times where it saves you the 45 minutes to walk to a store, I mean, you're paying for that convenience for that time. Why wouldn't you pay 200 if it could maybe save you time, even make you more effective and help you to make more money at what you're doing? I would easily, I'd get, I'd pay 1,000 a month if it's something that could help me be productive enough. I mean, why don't you pay for Bloomberg terminals? 3,000 a month because it allows them to be extra productive with their trading. I mean, it's 100 that would do it. Yeah, definitely, man. As always, it is an absolute pleasure hanging out. Like I told you, we can talk a little bit more, but I'd love to set up something like maybe monthly or something like",
    "start_timestamp_seconds": 3214.56,
    "start_timestamp": "00:53:34",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=3214"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 58,
    "total_chunks": 59,
    "text": "be extra productive with their trading. I mean, it's 100 that would do it. Yeah, definitely, man. As always, it is an absolute pleasure hanging out. Like I told you, we can talk a little bit more, but I'd love to set up something like maybe monthly or something like that, just to both should see what's going on in the world. Because it's always a pleasure. You balance me out. You're a nice person. I'm not. So it's good to find my way around good people. It helps reform me, I think. So thanks for hanging out, man. Anytime, man, always a pleasure. For anybody that wants to get a hold of Matt, you can go to his website. I think that's the main landing page for you now, right? Crusoe and sex.com with that, right? I'm from, yeah. I'm also on YouTube. I've been trying to get some different videos out. So you can find some things there as well. We're on X trader on this, we're on Kruro. Beautiful. And then on X, do you, X or do you tweet? What do you do on there? I X, I try and be promise. I'll say I X is there to do. I just don't know what we've, if we've moved from tweeting to Xing. Is the Xing is weird, right? Like tweeting makes sense. It's supposed to be posting. I think the official term is it's a post now set up a tweet, the official term. Literally",
    "start_timestamp_seconds": 3265.24,
    "start_timestamp": "00:54:25",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=3265"
  },
  {
    "video_id": "B3SW20MSNbM",
    "title": "2024 in Review and 2025 Outlook - Matt Caruso | The Outlier Podcast",
    "url": "https://www.youtube.com/watch?v=B3SW20MSNbM",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 59,
    "total_chunks": 59,
    "text": "is there to do. I just don't know what we've, if we've moved from tweeting to Xing. Is the Xing is weird, right? Like tweeting makes sense. It's supposed to be posting. I think the official term is it's a post now set up a tweet, the official term. Literally did not know that. That makes way more sense. I think everybody like me, we're just dumb because I used to be Twitter, so you tweet and we're just applying it, wrote methodology. Some smooth brain people like me, that sounds right. Well, thanks everybody for hanging out. We will catch you guys all another time being outlier and we'll see you all later. And we are off. Awesome. Beautiful dude. Super, super fun. Thanks for coming to hang out.",
    "start_timestamp_seconds": 3318.68,
    "start_timestamp": "00:55:18",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=B3SW20MSNbM&t=3318"
  }
]