[
  {
    "text": "What's up, outliers? Quick market update. We're taking a look at GameStop today for your weekly fix. We're going to run through quick stock analysis. We're going to talk about what we covered on the live stream last Saturday for anybody unable to make it and give you a quick recap there. We'll take a look at the options chain and then I'll give you a couple updates on the coverage strangle that I personally am running in GameStop. So you can see some different ways to approach it. So what's the latest? Well, ever since we had this big massive down day 10 in a day that was completely nondescript, not tied to any sort of news. Interesting. The stock continued down for a few days post that and then since this term low here that did dip below 26 and a half, it's now started consolidating and trending sideways. So we did get a lower local high. So this does confirm a downtrend and this now is all eyes on how we behave here. There's two dominant ways it can go. And again, you can see I didn't draw on these lines today. These lines have been here for a little while actually drawn off this originally. And we can see either it might decide to consolidate sideways for a little bit hovering around this 26 and a half handle which I do think is fairly likely. We can see that there's a really big volume note here.",
    "metadata": {
      "video_id": "b4MsuxMBYGo",
      "title": "GME Stock Analysis & Ryan Cohen's Latest Move",
      "url": "https://www.youtube.com/watch?v=b4MsuxMBYGo",
      "upload_date": "",
      "duration": 778.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b4MsuxMBYGo&t=0"
    }
  },
  {
    "text": "for a little while actually drawn off this originally. And we can see either it might decide to consolidate sideways for a little bit hovering around this 26 and a half handle which I do think is fairly likely. We can see that there's a really big volume note here. And we can also see that this has been defined as support for a little while now this 26 and a half handle. It's essentially all these transactions there. So it did break out of this descending channel. Now the question is does this new breakout day start showing appreciation and challenging this lower local high, which would then signal a short term trend reversal. Or does this move sideways consolidate purely or does this actually begin a downward move here? Now from my best analysis, which again, I always throw the caveat, GameStop is very unique in the way that technical analysis applies to it in that it generally doesn't. Well, that's actually a lie. It generally does, but a lot of the important times it doesn't. So with that caveat aside, this I think would be more likely to either consolidate sideways or consolidate and start to show some sort of trend reversal, whether the trend reversal to the upside happens after today. Tomorrow, next couple days, it's hard to say it really depends on where order flow comes in. But the fact that it punched below this 26 and a half here, it got close to it",
    "metadata": {
      "video_id": "b4MsuxMBYGo",
      "title": "GME Stock Analysis & Ryan Cohen's Latest Move",
      "url": "https://www.youtube.com/watch?v=b4MsuxMBYGo",
      "upload_date": "",
      "duration": 778.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 13,
      "start_timestamp": "00:00:59",
      "start_timestamp_seconds": 59.78,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b4MsuxMBYGo&t=59"
    }
  },
  {
    "text": "some sort of trend reversal, whether the trend reversal to the upside happens after today. Tomorrow, next couple days, it's hard to say it really depends on where order flow comes in. But the fact that it punched below this 26 and a half here, it got close to it here and here. And it kind of just was navigating above it. That kind of shows us that the general accepted value for GameStop right now, even from a short term sentiment perspective is above the 26 and a half handles. So of those three coas courses of action, I would presume the least likely would be a significant drop below the 26 and a half and assumption of this downtrend could happen. Don't know, but I personally think that's lower lower likelihood. And then higher likelihood, sideways consolidation followed by some sort of new approach to these local highs to see if price will recapture those. The way I look at this is there was no real material change anywhere in here. And yet there was a lot of people willing to transact at these levels. So with no true fundamental change in the company, I don't see why people wouldn't be willing to transact at these levels. So now another random piece of information that I came across from the discord actually from just want to give credit to where I saw it from TCM King. So shout out to TCM King from the discord, but he was",
    "metadata": {
      "video_id": "b4MsuxMBYGo",
      "title": "GME Stock Analysis & Ryan Cohen's Latest Move",
      "url": "https://www.youtube.com/watch?v=b4MsuxMBYGo",
      "upload_date": "",
      "duration": 778.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 13,
      "start_timestamp": "00:02:22",
      "start_timestamp_seconds": 142.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b4MsuxMBYGo&t=142"
    }
  },
  {
    "text": "people wouldn't be willing to transact at these levels. So now another random piece of information that I came across from the discord actually from just want to give credit to where I saw it from TCM King. So shout out to TCM King from the discord, but he was essentially saying that Ryan Cohen just moved all of his shares out of RC ventures into his personal name. And if I'm not mistaken, I actually think his personal entity is outside the country, which I find that just very interesting. I actually put an ask out on X to if we know why this might be. It looks like the entity is in Canada if I'm not mistaken. So I honestly don't know what to make of that. I'm very eager to see what people think of it. Generally, I don't know. I'm trying to understand what the potential pros and cons could be of making this kind of move. There's lots of ideas I have. But the ideas that I have don't really matter what matters is what I know and can prove. And unfortunately right now there isn't much that I can prove with respect to why he might do this. So my guesses will have a little bit more clarity about this throughout the week. It's definitely something I'm going to look at. And this is definitely something we'll look at on the Saturday stream. But just in case you didn't know. Now speaking of the",
    "metadata": {
      "video_id": "b4MsuxMBYGo",
      "title": "GME Stock Analysis & Ryan Cohen's Latest Move",
      "url": "https://www.youtube.com/watch?v=b4MsuxMBYGo",
      "upload_date": "",
      "duration": 778.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 13,
      "start_timestamp": "00:03:25",
      "start_timestamp_seconds": 205.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b4MsuxMBYGo&t=205"
    }
  },
  {
    "text": "he might do this. So my guesses will have a little bit more clarity about this throughout the week. It's definitely something I'm going to look at. And this is definitely something we'll look at on the Saturday stream. But just in case you didn't know. Now speaking of the Saturday stream, we had a really, really fun series of conversations. We spent a while talking about this AMA with Lucy Commissar. How did she ends to learn a little bit about her? I actually reached out to her. And she's a journalist that deals a lot with off short entities. And she started tying some really interesting trends between off short entities, FTDs, and naked shorting, which then led us to find this video, which is called the Wall Street Conspiracy movie, which we're going to continue next weekend. We spent a while just kind of poking through this maybe almost 15, 20 minutes. And there's a lot of really interesting details in here. And there's also Susan Trimbath, who I've reached out to as well. I'm hoping to do a podcast episode with her to just explore this whole thing a little bit more demand. Look at that. Real thoughtful, very expensive. But you kind of need to pay attention when you're looking at this stuff because the rabbit hole goes deep real fast. And I think that's smart. So we need all brain power applied, as you could tell is happening right here. So really interesting learning",
    "metadata": {
      "video_id": "b4MsuxMBYGo",
      "title": "GME Stock Analysis & Ryan Cohen's Latest Move",
      "url": "https://www.youtube.com/watch?v=b4MsuxMBYGo",
      "upload_date": "",
      "duration": 778.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 13,
      "start_timestamp": "00:04:30",
      "start_timestamp_seconds": 270.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b4MsuxMBYGo&t=270"
    }
  },
  {
    "text": "Real thoughtful, very expensive. But you kind of need to pay attention when you're looking at this stuff because the rabbit hole goes deep real fast. And I think that's smart. So we need all brain power applied, as you could tell is happening right here. So really interesting learning about more of the naked shorting, the offshore component to it. And the fact that this thing has been going on now for over 20 years. And this same damn conversation continues to be brought up. It's actually a little disheartening, but change can sometimes take a long time longer than we might like. So the fact that there is still people actively fighting against this Dave Lauer from Irving finance, they just launched a lawsuit to start to try to highlight just more of this bullshit. So it's a long fight. Gotta keep on it. That's all there is to it. Gotta keep the pressure. The thing that ends up happening is people try to apply pressure. They don't see the results that they want fast enough and then they fall off. That can't happen because then it continues to happen. Unfortunately. So let's take a peek over now at GameStop options and see if anything sticks out to us. Specifically a big expansion actually in call open interest. This was in the 500,000s before. Not big move on the put side. I mean, we are we are this is what I find interesting. We are hovering at some",
    "metadata": {
      "video_id": "b4MsuxMBYGo",
      "title": "GME Stock Analysis & Ryan Cohen's Latest Move",
      "url": "https://www.youtube.com/watch?v=b4MsuxMBYGo",
      "upload_date": "",
      "duration": 778.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 13,
      "start_timestamp": "00:05:31",
      "start_timestamp_seconds": 331.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b4MsuxMBYGo&t=331"
    }
  },
  {
    "text": "at GameStop options and see if anything sticks out to us. Specifically a big expansion actually in call open interest. This was in the 500,000s before. Not big move on the put side. I mean, we are we are this is what I find interesting. We are hovering at some of the highest call open interest skew that we've seen historically. It's over the three times the calls to puts, but I'm not seeing any sort of significant series of transactions that indicate something's going on on the back end. And that's both good and bad. It means in the short term right now it doesn't look like people are positioning for some sort of anticipatory squeeze, but it does look like people are trying to play this thing fairly directionally. Now you can see the volume today's huge 90,000 calls again 1650 puts, but the vast majority of those are being sold. My expectation for those is people trading cover calls. I have those out right now. And there's a benefit to trading stuff like that when the market is going through these kinds of down moves because the move that you saw in GameStop, this is a novel right this has been going on for several weeks now where it's starting to contract down and it offers an opportunity at least to take in some premium from a short call perspective make a little bit of money again. And then you can choose to do with that whether",
    "metadata": {
      "video_id": "b4MsuxMBYGo",
      "title": "GME Stock Analysis & Ryan Cohen's Latest Move",
      "url": "https://www.youtube.com/watch?v=b4MsuxMBYGo",
      "upload_date": "",
      "duration": 778.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 13,
      "start_timestamp": "00:06:32",
      "start_timestamp_seconds": 392.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b4MsuxMBYGo&t=392"
    }
  },
  {
    "text": "right this has been going on for several weeks now where it's starting to contract down and it offers an opportunity at least to take in some premium from a short call perspective make a little bit of money again. And then you can choose to do with that whether it be buy more GameStop shares at a lower price as it's going down so on and so forth. There's a lot of opportunities there. So the main takeaway from an open interest perspective is really big call skew, but I'm not seeing insane call volume meaning in terms of size and overall net premium. The other thing is if we take a look at expiration cycles, it is all over the place. This is anomalous compared to what we often see in GameStop where we see concentration have the concentration in singular explorations typically the front expirations. So if we take a look, there's 643,000 calls. If we take a look at the 31 Jan, there's 160 K in the front expiration, which is a lot to be very clear, but for GameStop, that's not the majority of this options chain, which is interesting. There's positioning out in 21 Feb. There's light positioning 21 March 17 April heavier 20 June is heavier. So these two combined are playing longer term ideas. That's why they're that far out. Really light 18 July that's common. And then 16 Jan is pretty heavy. And 16 Jan 27 is light. And I would",
    "metadata": {
      "video_id": "b4MsuxMBYGo",
      "title": "GME Stock Analysis & Ryan Cohen's Latest Move",
      "url": "https://www.youtube.com/watch?v=b4MsuxMBYGo",
      "upload_date": "",
      "duration": 778.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 13,
      "start_timestamp": "00:07:42",
      "start_timestamp_seconds": 462.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b4MsuxMBYGo&t=462"
    }
  },
  {
    "text": "Feb. There's light positioning 21 March 17 April heavier 20 June is heavier. So these two combined are playing longer term ideas. That's why they're that far out. Really light 18 July that's common. And then 16 Jan is pretty heavy. And 16 Jan 27 is light. And I would expect this one to stay light. I would expect this one to continue to build out for those longer term ideas. What I'm highlighting is that in terms of volatility dispersion, it's across the expirations, which again, that tells us that people are playing a lot of different ideas. It's not all crowded front expiration people expecting some really strong short term movement. If we take a look at volatility across the term structure, we can see near term vol is actually starting to jack up a little bit, which is interesting. And we can see earnings right now is shown on the platform at the 25 March after the close. And if we take a look out here, it market doesn't look like it's buying it because we can see it's 78 of all here only 80.76 of all here. I would expect the expiration cycle to contain this earnings release, which would be this 17 April. I would expect this to be higher, but what will end up happening is as we get closer, weaklies will be added. So you'll see actually weaklies around this that will probably pop up and fall pretty significantly. All right. Last thing",
    "metadata": {
      "video_id": "b4MsuxMBYGo",
      "title": "GME Stock Analysis & Ryan Cohen's Latest Move",
      "url": "https://www.youtube.com/watch?v=b4MsuxMBYGo",
      "upload_date": "",
      "duration": 778.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 13,
      "start_timestamp": "00:08:41",
      "start_timestamp_seconds": 521.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b4MsuxMBYGo&t=521"
    }
  },
  {
    "text": "earnings release, which would be this 17 April. I would expect this to be higher, but what will end up happening is as we get closer, weaklies will be added. So you'll see actually weaklies around this that will probably pop up and fall pretty significantly. All right. Last thing I want to show you, quick update on the coverage strangle that we have built. And this is currently what it's looking like. So we still have the same 25,000 original allocation right now. We're using 18,000 of that. So about 73 utilized. We have the same options out. There's essentially been no change over the last time you've seen this. I know that's not sexy. That's not super fun. There's not a lot to dive into, but this is what trading is. Sometimes it's a lot of putting stuff on and then just kind of letting it go. Now one admin note is this position is coming up on time on needing to be managed. And we can see that I have the 25s, which are still out of the money, even though it's at 27 and a half and it's been contracting. So these have gotten slightly more expensive, but volatility and time will continue to decay out of those. So this is a little bit of a waiting game on the put side. On the call side, it's just hanging out. These will come down soon enough though because they're showing a pretty decent profit. And now",
    "metadata": {
      "video_id": "b4MsuxMBYGo",
      "title": "GME Stock Analysis & Ryan Cohen's Latest Move",
      "url": "https://www.youtube.com/watch?v=b4MsuxMBYGo",
      "upload_date": "",
      "duration": 778.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 13,
      "start_timestamp": "00:09:47",
      "start_timestamp_seconds": 587.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b4MsuxMBYGo&t=587"
    }
  },
  {
    "text": "expensive, but volatility and time will continue to decay out of those. So this is a little bit of a waiting game on the put side. On the call side, it's just hanging out. These will come down soon enough though because they're showing a pretty decent profit. And now the main question is when do we add more shares? And it looks like it's coming up on time. So what I do now is I set different alerts on where I might want to start nibbling with shares to start using some more of the overall utilization based on where the perceived floor is right now, which is again, about 26 and a half. So with that as the case, if it starts to channel in here sideways, where if it starts to appreciate in here over the next day or two, then we will look to add some more shares right now. It's just a little too early. These three days bowed well. So we're coming up on the decision point again, probably tomorrow, the next day, we're right on top of when I would want to see if this is looking like it's going to fall down further to which I would wait until it consolidates, but right now it is consolidating. So again, probably tomorrow, the next day, the decision will be made on adding some more shares. If I do add some more shares, it'll be a relatively light allocation. And that's simply because we",
    "metadata": {
      "video_id": "b4MsuxMBYGo",
      "title": "GME Stock Analysis & Ryan Cohen's Latest Move",
      "url": "https://www.youtube.com/watch?v=b4MsuxMBYGo",
      "upload_date": "",
      "duration": 778.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 13,
      "start_timestamp": "00:10:57",
      "start_timestamp_seconds": 657.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b4MsuxMBYGo&t=657"
    }
  },
  {
    "text": "further to which I would wait until it consolidates, but right now it is consolidating. So again, probably tomorrow, the next day, the decision will be made on adding some more shares. If I do add some more shares, it'll be a relatively light allocation. And that's simply because we are running out of capital right now. We only have a little over 25 of the capital remaining. And I definitely don't want to go over 85 utilized. That's just in case there's some sort of really big down move, maybe 90, maybe 90. We'll give it 90. But for this kind of strategy, it's really important to keep some cash on the side to be able to add to things if puts get stuck and we need to add some size and stuff like that. So leaving about actually looking at the size of the underlying 10k is about right to leave that'll allow me to add a few lots if I need to, not really expecting to have to do a whole bunch of that, but that's more just from options, management person. So as always, let me know if there's any questions anything I should look at. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "b4MsuxMBYGo",
      "title": "GME Stock Analysis & Ryan Cohen's Latest Move",
      "url": "https://www.youtube.com/watch?v=b4MsuxMBYGo",
      "upload_date": "",
      "duration": 778.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 13,
      "start_timestamp": "00:11:57",
      "start_timestamp_seconds": 717.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b4MsuxMBYGo&t=717"
    }
  },
  {
    "text": "Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "b4MsuxMBYGo",
      "title": "GME Stock Analysis & Ryan Cohen's Latest Move",
      "url": "https://www.youtube.com/watch?v=b4MsuxMBYGo",
      "upload_date": "",
      "duration": 778.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 13,
      "start_timestamp": "00:12:50",
      "start_timestamp_seconds": 770.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b4MsuxMBYGo&t=770"
    }
  }
]