[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you let's start we'll take a look at so-fi from so-fies In the morning, very, very clear spike, man, that's like a really profound spike. And it ran all the way up until on the eighth, it ran all the way up. And then on the ninth, it dipped down pretty hard. So on the eighth is when we saw a really serious acceleration here. So let's see what's going on. A lot of near term activity, that is very easy to see. What I would like to look at is the distribution of a Y, which I can't right now because this is not working, but we can take a look at that tool. Current ally. So across strikes, it looks like broadly calls running on the 13 and a half. 13. It looks like kind of calls you along most of the out of the monies. And then for the out of the money on the downside is when the puts start to pop up. So there is some standard hedging behavior going on in here, which is always interesting to me, especially in names like this, where it seems like there can be just such dominant upside expectation. So to see this kind of distribution is not like super remarkable, but it is semi remarkable to me. Now looking at expiration based, the front expirations are",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=0"
    }
  },
  {
    "text": "is always interesting to me, especially in names like this, where it seems like there can be just such dominant upside expectation. So to see this kind of distribution is not like super remarkable, but it is semi remarkable to me. Now looking at expiration based, the front expirations are very, very call heavy. And then it kind of remains call heavy. Not until you get way out here until June that you start to see the puts put side picking up, but it still doesn't exceed the calls. Not until you get way further out until like October. So yeah, I mean, the OI skew seems really, really centered on the call side. One quick admin note, if anybody else in the chat has think or swim, if you can periodically try logging on and then let me know if it eventually lets you on. So then I can restart mine. But let's take a look at this next. So what I'm doing here is I'm getting a sense of total volume. We can get a sense of total volume across strikes and across expirations. So right now we're looking at the call side of the equation. And all I'm doing is getting a sense of where it seems to be the most dominant. And you can see it's done by a heat map. So it's pretty clear. The front expirations are just absolutely the mass of what you see. And it's literally like. Some Friday into next week,",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 63,
      "start_timestamp": "00:07:54",
      "start_timestamp_seconds": 474.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=474"
    }
  },
  {
    "text": "I'm doing is getting a sense of where it seems to be the most dominant. And you can see it's done by a heat map. So it's pretty clear. The front expirations are just absolutely the mass of what you see. And it's literally like. Some Friday into next week, a lot of this volume on Friday is likely front expirations that are being moved out because it didn't hit, you know, the profit targets that were going right. So you can see that pretty heavily here at the 13s and the 13 and a halves and the 14s of the at the monies. So this just to me, I imagine a lot of this like 11k is coming from this 21k, meaning people are closing out of these moving out to these same thing with this. So what that generally tells me is people are just looking to maintain exposure. Like that's in a nutshell what that means to me. Now let's take a look at overall premium. At the monies. Yeah, I mean, nothing. What I'm looking for here, by the way, is like any distance spikes. I'm looking for anywhere that I can find like really, really strong premiums, which I don't, I don't really see it looks. Yeah, I mean, it looks pretty at the money centric. Okay. So now let's take a look, see if anything interesting is going on. Badgerlord says trying to log in, stuck on updates. Awesome. Thank you guys. I appreciate",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 63,
      "start_timestamp": "00:09:35",
      "start_timestamp_seconds": 575.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=575"
    }
  },
  {
    "text": "strong premiums, which I don't, I don't really see it looks. Yeah, I mean, it looks pretty at the money centric. Okay. So now let's take a look, see if anything interesting is going on. Badgerlord says trying to log in, stuck on updates. Awesome. Thank you guys. I appreciate you guys taking a look at it though, because there's, so I like unusual whales as you all know. And again, they're not like sponsoring this. I am affiliated with them, but it's because I like legitimately like the tool, but there are absolutely things that this cannot do that toss can for me, which is why hopefully we can get that to turn on. But that aside, let's take a look through just recent transactions. This is always good to get a sense of institutional sponsorship. And it's like super slow. Like that's what I see here. It looks like this homie Kelly. I have no fucking idea how you say this. Any guesses, any phonetic Spellers know how to say this? I know that's going to be like lock. Lock. I'm not going to sound that whole thing out, but they've been selling for a little while. I mean, it's not like big and they're not really that large of a holder. Let's take a look at the institutional side. What the sponsorship looks like. Oh, interesting. So it looks like the total net change in ownership hasn't been. It's not as it's not as sponsored as I",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 63,
      "start_timestamp": "00:11:07",
      "start_timestamp_seconds": 667.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=667"
    }
  },
  {
    "text": "mean, it's not like big and they're not really that large of a holder. Let's take a look at the institutional side. What the sponsorship looks like. Oh, interesting. So it looks like the total net change in ownership hasn't been. It's not as it's not as sponsored as I would have thought from an institutional lens. What's the total assume this is the number of the number of names. What I would like to see is the total percentage. That's always a good metric and I don't see that in here. It mostly seems build out. I was trying to get a sense of scale. What is their current total institutional ownership? You guys know, I can look it up. If not, take a look at so far. Let's go to maybe inside. No. I'm just going to look it up. So far institutional. This is normally a good source for this is through Fintel. But it's not loading for some reason. Why do. Is it just my internet that's being absolutely awful today? No, this one works just fine. Looks like everything is doing maintenance right now. That's kind of funny. Literally everything is doing maintenance right now. All right. Let's see. That's 6.5. Good old NASDAQ. Good old NASDAQ getting it done. So 817 or holding 513 mill. Let's see. I want to see how accurate that is. This shows 772. So it lags because this is just from Q4. It would be nice if they built",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 63,
      "start_timestamp": "00:12:42",
      "start_timestamp_seconds": 762.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=762"
    }
  },
  {
    "text": "All right. Let's see. That's 6.5. Good old NASDAQ. Good old NASDAQ getting it done. So 817 or holding 513 mill. Let's see. I want to see how accurate that is. This shows 772. So it lags because this is just from Q4. It would be nice if they built this out a little bit more. What would be really cool on this tool would be like a total institutional sponsorship in terms of not just volume, but net holdings. It's a really useful metric because it gives you a lot of insight is to whether or not institutions are looking to continue to expand into something and consume more of it. But then it also gives you a lot of insight into how much something can move because what happens is as institutional ownership goes up and up and up, it decreases the amount that something can move around because a lot of the shares become locked. So if we take a look at some of like bigger tech names like Microsoft, you can see it's 72.2 institutionally held. So what that means is if Microsoft wants to have some sort of big kind of move, it's more difficult when more of it is being held onto by different kinds of institutions, ETFs. This is where you get into the really interesting world of structural trading opportunities within the market. And it's because you can come up with inferences off of stuff like this. So now if we go",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 63,
      "start_timestamp": "00:15:43",
      "start_timestamp_seconds": 943.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=943"
    }
  },
  {
    "text": "when more of it is being held onto by different kinds of institutions, ETFs. This is where you get into the really interesting world of structural trading opportunities within the market. And it's because you can come up with inferences off of stuff like this. So now if we go back to SoFi like we were just looking at, notice the institutional holdings and SoFi comparatively, right, significantly less. So when you see things with lower institutional ownership, it means that the volatility tends to be higher. And it's because it changes hands more readily. As institutions start to scoop up shares, they're slower to move things, especially again when it starts getting picked up by ETFs and stuff like that. Like spy is not moving much of its Apple holdings. It'll rebalance it and that will cause some of the movement. But that's about it. It's going to maintain the overall target exposure. So just something to be aware of when you look at this stuff and that's why I think that would be a great tool to have here is like not just volume, but literally a net institutional ownership view. Because this looks like total holdings here, this is only showing 772. This looks like the number of companies, which isn't like the number of come, okay cool, like there's nothing wrong with knowing that. But that's also not like something that I think I can't do that much with that information. It doesn't matter to me",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 63,
      "start_timestamp": "00:17:34",
      "start_timestamp_seconds": 1054.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=1054"
    }
  },
  {
    "text": "this is only showing 772. This looks like the number of companies, which isn't like the number of come, okay cool, like there's nothing wrong with knowing that. But that's also not like something that I think I can't do that much with that information. It doesn't matter to me that much at all. So now let's take a look. I want to do one other peak on this. So far. So another tool that is useful for this is Benzinga. I have no idea. Oh, these are like different earnings stuff. Overall profitability metrics. I don't really care about that. Squish all that down. Let's take a look at insiders here. Wow, heavy in the options markets from an insider lens. I think that's some. What's the short interest? 13 and a half light. That's really, really light short float. Do not really going to get a ton of movement on that kind of thing. Yeah, this is not enough from a short holdings perspective. Cool. Let's see if there's any interesting options positioning. I want to look through a couple of the things. This one of the reasons by the way, why I'm going through all this with sofis because I don't necessarily track sofis closes other names. So what I'm doing is I'm building just an overall understanding of like the recent movements in it. Something like beta is actually quite important to me. And it's because beta tells me how volatile is remaining comparatively to a",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 63,
      "start_timestamp": "00:18:49",
      "start_timestamp_seconds": 1129.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=1129"
    }
  },
  {
    "text": "sofis because I don't necessarily track sofis closes other names. So what I'm doing is I'm building just an overall understanding of like the recent movements in it. Something like beta is actually quite important to me. And it's because beta tells me how volatile is remaining comparatively to a benchmark. And again, you can see that this is natively using spy, which I think is a really great benchmark. But that's why I'm looking at that. And then this is just telling me what the overall options activity looks like from a float perspective calls to puts. And this is looking at it in terms of volume. Again, I actually don't care to look at it by volume out, right? I prefer something like this to be by premium. And the reason is because you can uncover some really big low volume trades that are very high premium. So and we did this recently in GameStop with those short puts that were in the money. That's like a prime time example of that. So yeah, I don't care about this. That's looking at an individual option. I don't care about this stuff. Okay. Let's take a look at an actual chart. I don't need the. So on a three month timeframe. I mean, on a three month timeframe, this is not. Not really looking that great. I'm just going to add a couple basic studies really quick. Moving average. No, I don't like this one. I don't feel don't",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 63,
      "start_timestamp": "00:20:45",
      "start_timestamp_seconds": 1245.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=1245"
    }
  },
  {
    "text": "actual chart. I don't need the. So on a three month timeframe. I mean, on a three month timeframe, this is not. Not really looking that great. I'm just going to add a couple basic studies really quick. Moving average. No, I don't like this one. I don't feel don't want that. Now we get to play with new. New fucking tickers. This is perfect. 50 day AMA. Beautiful. Make sure that the longer term ones are exponential for sure. And then we'll add another one that's shorter term will do a 20 period. Perfect. And then we do one more. That's a really short term like a 10 or a 9. And see the relationship here. So the reason why I like moving averages for this is you don't need to put a ton of shit on this in order to get usable information. Another one that would be really good though is a volume profile. If this thing has that. It does. Volume profile is a super super super useful tool. It gives us a ton of information. Yeah, so I'm actually really, really happy that they have this. I like to make it a little less. That's good. It's all beautiful. So the volume profile I care about this because it gives me really important context. On what the overall behavior has been in the name. So when we're looking at something like so far, here's a few key things I can tell you. That there's some",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 63,
      "start_timestamp": "00:22:14",
      "start_timestamp_seconds": 1334.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=1334"
    }
  },
  {
    "text": "good. It's all beautiful. So the volume profile I care about this because it gives me really important context. On what the overall behavior has been in the name. So when we're looking at something like so far, here's a few key things I can tell you. That there's some really important volume nodes here at like the 1564 handle like up in this range. And where we're transacting now is like a moderate shelf around this volume node, but not the biggest volume node. So now what this objectively tells us is it lets us know that as so far might rally, it is very likely to start running into overhead resistance. Once it gets up to this like 483 handle, that's what you're seeing. Like pretty high probability. Now that doesn't mean it can't break through it as hopefully you know the vault supporting resistance, it's supported resistance until it's not right. So you don't like read way too far into that. But if we zoom this in now and we kind of get to a more relevant time frame. So this is looking at the last what four months, let's do the last five months, we'll do like this. And it has just want a line, bro. What the fuck if you guys needed an arrow, I now know how to draw in a noxiously large arrow. Can I delete that? That's great. What does this thing do? Nope. Don't want that. Yo, I literally just want",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 63,
      "start_timestamp": "00:24:55",
      "start_timestamp_seconds": 1495.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=1495"
    }
  },
  {
    "text": "like this. And it has just want a line, bro. What the fuck if you guys needed an arrow, I now know how to draw in a noxiously large arrow. Can I delete that? That's great. What does this thing do? Nope. Don't want that. Yo, I literally just want like a trend line. No, no, continuous now. There we go. The line. What does this line tell me? That's great. Perfect. We found it. We found what we needed. Look at us go. So this is dropped 27. So it's dropped 27 over 74 trading days. This is actually really, really useful. This is good. Okay, no close. Go. Don't need this thing anymore. Go away. That's fine. You could live there. So overhead resistance 425 for sure. This is like absolutely the bulk of the volume node that we're going to see. I think, I mean, from a near term price perspective, you are seeing at least a near term rally. And you can see that noted by the higher local highs and the higher local lows, both of those combined. But what's not a great vibe is the fact that it tried to pop up here and then it got pushed back down, right? It's starting to run into this volume node. And one of the things you'll notice is as we zoom in, you'll get a better sense of different volume nodes. And the reason is because it tells you where people transact it at at",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 63,
      "start_timestamp": "00:26:25",
      "start_timestamp_seconds": 1585.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=1585"
    }
  },
  {
    "text": "then it got pushed back down, right? It's starting to run into this volume node. And one of the things you'll notice is as we zoom in, you'll get a better sense of different volume nodes. And the reason is because it tells you where people transact it at at different points, which is why when you're using something like a volume profile, you have to zoom out far enough to see where the bag holder layers are. Because that's what this is, right? If I zoom out far enough, I can see exactly where a bunch of people started phasing into the position and they're in a bad spot. So for example, this is going back again to January 24. So if I zoom this out, notice how that bar is going further and further up. What that tells you is that there's a ton of people from January 24th and before that are buying at these really high levels. And then you don't see those people go away until we get like pretty far out in time, until we're back in November before the key breakout that it had. So what this tells us is that there is a not small group of people, actually the bulk of trading volume had entered in near the tops here. So then often this is when that group starts to say to themselves, do I want to be in this name? That's a tough question because they then need to essentially",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 63,
      "start_timestamp": "00:28:38",
      "start_timestamp_seconds": 1718.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=1718"
    }
  },
  {
    "text": "a not small group of people, actually the bulk of trading volume had entered in near the tops here. So then often this is when that group starts to say to themselves, do I want to be in this name? That's a tough question because they then need to essentially figure out what they're going to do is it rallies up. But this is where a lot of people will start to unwind. Now going back to the point that we learned earlier about the importance of understanding institutional ownership. If this was 80 institutionally owned stock, what do I think might happen as it gets up to this 510 handle realistically, not a whole lot? And it's because institutions typically are less interested in actively cycling by and sell. But because we know this is like less than 50 institutionally owned, that means that there's not an insignificant number of individual people holding this small shops, stuff like that, that are going to be quite eager to get out as it hits this. So in those cases, really all it tells me is that there's likely to be a fair number of people that are eager to get out of the name when it gets there. That's exactly what I would expect to see. Cool. So now from an options, why can't I delete this? Dude, this is so funny. Every time, I mean, it's fun learning different tools that's cool and all. Maybe if I double click it,",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 63,
      "start_timestamp": "00:29:43",
      "start_timestamp_seconds": 1783.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=1783"
    }
  },
  {
    "text": "of the name when it gets there. That's exactly what I would expect to see. Cool. So now from an options, why can't I delete this? Dude, this is so funny. Every time, I mean, it's fun learning different tools that's cool and all. Maybe if I double click it, nope. Y'all, if you guys have any tips or tricks, there it goes. We got it. Okay. So now let's take a look at the actual options chain really fast since thinkorswim is not playing nice. And we'll look at 50 strikes. I normally don't use this. So there we go. Okay. Okay, okay. This ain't bad. Do I have Greeks? We do have Greeks. We even have Charmin Vanna. That's actually sick. Good. There's Theta. Why the fuck would Theta not be on this list? How does that make any sense to anybody? There it is. Where the fuck is it? Oh, I might just have to scroll. I just got to get rid of some of this extra shit. I'll get rid of the high low. Don't care. Average last is fine. Plus minus is fine. There's Theta. Beautiful. Okay. Cool. So let's see. What I'm doing now is I'm just getting a sense of what the options chain looks like. And I want to get a sense like relative to different deltas. So we obviously need to go out into next week. And let's take a look. So the at the money is like this 1313 and",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 63,
      "start_timestamp": "00:31:05",
      "start_timestamp_seconds": 1865.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=1865"
    }
  },
  {
    "text": "is I'm just getting a sense of what the options chain looks like. And I want to get a sense like relative to different deltas. So we obviously need to go out into next week. And let's take a look. So the at the money is like this 1313 and a half. And what's the IV skew? So the IV skew on the 39 delta is 56 and on the 41s it's 56. So there's a little bit of call skew, not like super heavy. So after like a quick poke through of so fine tinkering with some different tools just to get a fucking feet under me with using this thing compared to think or swim my usual. It looks like there's bullish call flow and positioning expectations. But they're really like right now price is not behaving super well relative to that in my opinion. So with these kinds of things, I normally would look at it as if we see it starting to break above key resistance. Then I am immediately, immediately more interested. But with it behaving like this now, it effectively needs to get over like this handle for sure. So this is the 1375 handle. But the way that this can be played is for me the way I would play it is this becomes near term resistance. The bottom of these candles, the congestion of these moving averages, those kinds of things. And the way that that gets played is stop goes below",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 63,
      "start_timestamp": "00:33:03",
      "start_timestamp_seconds": 1983.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=1983"
    }
  },
  {
    "text": "handle. But the way that this can be played is for me the way I would play it is this becomes near term resistance. The bottom of these candles, the congestion of these moving averages, those kinds of things. And the way that that gets played is stop goes below there. So stop goes somewhere around like 1240 something like that. And then I would probably wait to see if you see it breaking above like this 1376 handle though. But if I thought that it was going to move and I wouldn't want to wait that long to miss the entry. I would just enter a little bit smaller with the expectation of high probability of being stopped and then scale into it if it starts to have that up move, which is from the options markets. It does look. It does look like it wants to go that route. But you need the price performance really to support it. So yeah, I mean, you can see where the pinning is. Which it was just north of Max Payne. Cool. Fun look. It does look overall. I mean, it does look like it's overall being positively positioned, right? Take a look at the net call flow. The problem is, and this is a good example of how options flow is not omnipotent. And you have to think about the timing of things because you can see the options flow really started spiking back here, which was what 23 April.",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 63,
      "start_timestamp": "00:34:48",
      "start_timestamp_seconds": 2088.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=2088"
    }
  },
  {
    "text": "a look at the net call flow. The problem is, and this is a good example of how options flow is not omnipotent. And you have to think about the timing of things because you can see the options flow really started spiking back here, which was what 23 April. So if we take a look at the price chart from 23 April, right? That's here. What has happened since all of that started happening? The fucking thing has gone down. This is why I use options flow in conjunction with other indicators. Because another thing that when we're looking at the net premiums, this is death tone in the sense of this is just call premiums. We don't know where these are. And this is actually why it's really important to look at stuff like this. And what do you notice about the highest OI contracts? 250 days for the call side, 250 days for the call side, 250 days for the call side, 40 days, 250 days for the call side. There's two that exist in here, one at 41 at five that are sub 100 days. So what this tells you is that a lot of that positioning that you see is actually longer term expectation, not necessarily some sort of near term expectation. So interesting look. I'm going to move this over here and I'm just going to close out thinkorswim so that it's not spasming in the background. And then we'll move on to the",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 63,
      "start_timestamp": "00:36:18",
      "start_timestamp_seconds": 2178.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=2178"
    }
  },
  {
    "text": "positioning that you see is actually longer term expectation, not necessarily some sort of near term expectation. So interesting look. I'm going to move this over here and I'm just going to close out thinkorswim so that it's not spasming in the background. And then we'll move on to the next. We could take a quick look through. Yo, it literally doesn't want to close. There it goes. All right, we're good now. Okay, so we're wondering what the background looks like. This is it. This is my wide monitor. So this monitor I think is like, I don't remember. 40. 40 something. So you guys, I'd like cut it down to a little less than half for these. Okay. What else you guys got? LC says, did you discuss, strive the BTC treasury around an asset management code? Reverse margining in asst that went up 10 x they sent the activist letter to GME unless mistaken. No, we have not looked at that. Let's let's take a peek because I'm actually interested. Strive. First thing we need to do is ask chat you PT about that. I'm literally going to post your question and. I'm going to ask it to research the context of this. And you research. And here I'll actually grab a chat and we can look at it together. And you research the context of this. Here. So we'll see what this is. I'm going to pop the door for thrift fest. All right. Let's see.",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 63,
      "start_timestamp": "00:37:37",
      "start_timestamp_seconds": 2257.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=2257"
    }
  },
  {
    "text": "to research the context of this. And you research. And here I'll actually grab a chat and we can look at it together. And you research the context of this. Here. So we'll see what this is. I'm going to pop the door for thrift fest. All right. Let's see. Seven may strive asset management announced a definitive agreement to merge with asset. And to tease Inc digital marketing content delivery company reverse merger position strive is the first publicly traded asset management firm with a Bitcoin treasury focus. Okay. The combined entity will operate under the strive brand and it will stay on Nasdaq. So Bitcoin for stock exchange they plan to offer unique opportunity for Bitcoin holders to exchange their Bitcoin for company equity and a tax free man or whoa. Whoa. That's fucking huge. That is absolutely huge. Wow. If that's accepted that's fucking crazy. Wow. Expand on this. It might sound stupid right if you're not used to looking at this stuff more closely. But for people that are higher net worth this can lead to a massive flow of capital from Bitcoin into other things. Now my guess is that a lot of people that have built a lot of money with Bitcoin probably are just going to continue holding Bitcoin. But that doesn't mean that they might not break out some of it. So that's I mean that's a massive potential draw for people that have made a lot of money. I want to",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 63,
      "start_timestamp": "00:39:11",
      "start_timestamp_seconds": 2351.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=2351"
    }
  },
  {
    "text": "have built a lot of money with Bitcoin probably are just going to continue holding Bitcoin. But that doesn't mean that they might not break out some of it. So that's I mean that's a massive potential draw for people that have made a lot of money. I want to know more about section 351 of the tax code though. This is so interesting. Provides immediate access shelf registration statement company can raise up to one billy through equity debt offerings to accumulate Bitcoin. Okay. This can give or take this is an inherently good or bad innovative strategies leverage institutional investment expertise to implement proprietary strategies for Bitcoin accumulation and including acquiring cash at a high discount through mergers and utilizing fixed income and deliberatives. This is interesting because I also imagine that micro strategy isn't necessarily going to be ultra stoked on this because this isn't exactly what micro strategy is doing. They're intelligent leverage, which is fucking Spanish for Ponzi scheme. But this isn't that far off in terms of their broader goal of accumulating Bitcoin like that part I totally get. All right. So let's see the activist letter to GameStop CEO strive management send activist letter to GameStop CEO Cohen proposing that the company dot Bitcoin is primary treasury reserve asset. The letter emphasized that with nearly 5 billion in reserves GameStop is uniquely opportunity transformers financial future by becoming premier Bitcoin treasury company in the gaming sector. Well, this is interesting like a Bitcoin",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 63,
      "start_timestamp": "00:41:14",
      "start_timestamp_seconds": 2474.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=2474"
    }
  },
  {
    "text": "letter to GameStop CEO Cohen proposing that the company dot Bitcoin is primary treasury reserve asset. The letter emphasized that with nearly 5 billion in reserves GameStop is uniquely opportunity transformers financial future by becoming premier Bitcoin treasury company in the gaming sector. Well, this is interesting like a Bitcoin treasury company in the gaming sector. So expands on what this potentially would look like. Allocating maximum cash reserves to Bitcoin. This is. I mean, this doesn't make sense. To be honest, this, this to me strikes me as like a Bitcoin maximalist that is just trying to get more sponsorship of Bitcoin. That's genuinely what I believe. I like Bitcoin. I think it's a really interesting tool. I think it has valid use cases and it's proven itself and it's starting to expand in adoption. All of that stuff, I think, is unequivocally the case. However, that being said, GameStop as it sits today still has brick and mortar stores. And while it still has that element of its business taking all of its cash and pivoting into something like Bitcoin, which is highly volatile. That can be a mistake. And let's, let's close that out. Let's close this out. Let's take a quick look. Here, I just want to look at a chart of Bitcoin. I don't know what they use for Bitcoin. Do they have Bitcoin futures? Do they do futures? No. We could look at, um, I bit maybe. What is the ticker on this? Bitcoin's",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 63,
      "start_timestamp": "00:42:44",
      "start_timestamp_seconds": 2564.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=2564"
    }
  },
  {
    "text": "out. Let's take a quick look. Here, I just want to look at a chart of Bitcoin. I don't know what they use for Bitcoin. Do they have Bitcoin futures? Do they do futures? No. We could look at, um, I bit maybe. What is the ticker on this? Bitcoin's spot ticker and unusual whales. They have it. TTC? The fuck is this? That ain't it? It doesn't look like they have futures. We can use Ibit. Not the same, but it'll give us something to look at and for the broader conversation point. So what I want to talk about with respect to Ibit, it's not, it's not like this move that you get to focus on only when we're talking about something like getting into Bitcoin and it's more talking about this. So 29 drop. So that has again, if a lot of your capital is in Bitcoin that's not an insignificant drop. Let's just eyeball it really fast. A lot of fucking zeros to type in. So it represents a 1.45 billion decrease in assets. Like that's, that's huge. That's literally huge. And something to remember is that again, this doesn't go back far enough because it's just Ibit instead of the futures. But this isn't the biggest move that we've seen and it's likely not going to be the biggest move that we will see. So I'm going to see if thinkorswim works on my phone really fast. It looks like no. My guess is they're",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 63,
      "start_timestamp": "00:44:33",
      "start_timestamp_seconds": 2673.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=2673"
    }
  },
  {
    "text": "just Ibit instead of the futures. But this isn't the biggest move that we've seen and it's likely not going to be the biggest move that we will see. So I'm going to see if thinkorswim works on my phone really fast. It looks like no. My guess is they're just doing maintenance. I wanted to see based on spot futures, like a broader view of like a worse move that's still recent, because I think that would add a flavor to like what this could look like. But this is super recent, right? And this isn't even like a crazy move. So this is like again, a good display of why going full port Bitcoin as the reserve holding for the cash is in. It's really not a great idea. And when people say stuff like this and when I say people, I mean like in the letter that cash has negative real return, the problem is that negative real return provides a purpose. And the purpose for the negative real rate, real rate of return is stability way more stable than something like Bitcoin. And again, this doesn't even enter the equation of them getting into something that pays them a decent yield, which they could that still doesn't inherently outpace inflation entirely. But you could cut inflation down impact on the value of your money by a point. So that stability matters a lot. All right, let's see. Portal rate for capital deployments using Bitcoin as a",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 63,
      "start_timestamp": "00:47:08",
      "start_timestamp_seconds": 2828.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=2828"
    }
  },
  {
    "text": "pays them a decent yield, which they could that still doesn't inherently outpace inflation entirely. But you could cut inflation down impact on the value of your money by a point. So that stability matters a lot. All right, let's see. Portal rate for capital deployments using Bitcoin as a benchmark for evaluating investment opportunities, ensuring that any capital deployment would aim to outperform Bitcoin's returns. I think you have to again, think of it in the lens of risk adjusted returns, not just returns. This I can see the argument for sure, the concept of decreasing brick and mortar, putting and instead pivoting more so into digital side of things to me, that's just logical. That just makes sense. I think GameStop is going to have to do this and you can see them doing this, right? They're unwinding a lot of their store locations and again, rightfully so you have to. So GameStop store closure chart. I don't know how accurate this is, but it looks like it's generally curated. What is this? This one is from Superstunk. So I imagine this is probably pretty accurate. Like Superstunk is generally on top of their shit with this kind of stuff. So they closed 693 between 2019 and 20, between 2021 down to 43, between 21 and 22 down 160. That bears out with what I would expect. And if we just eyeball the list here, wow. Wait, what is this? These are closings. Holy shit. I thought, did",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 63,
      "start_timestamp": "00:48:36",
      "start_timestamp_seconds": 2916.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=2916"
    }
  },
  {
    "text": "of stuff. So they closed 693 between 2019 and 20, between 2021 down to 43, between 21 and 22 down 160. That bears out with what I would expect. And if we just eyeball the list here, wow. Wait, what is this? These are closings. Holy shit. I thought, did they really close all of these? How many is this? One fact, when I was in Anchorage, Alaska, I actually took a photo for you guys because there was a GameStop there. 401. Wow. So I mean, that puts it into scale, doesn't it? I mean, that essentially shows a significant acceleration. Ivy says it says it on the title. I guess it did, didn't it? I don't, I have trust issues. When it comes to like data and stuff, I have to check things. But that shows a massive acceleration in closures, which again, I really think just makes sense. I think GameStop has to do that in order to survive. So I agree with this. I think trying to do some sort of pitch that Bitcoin should be the main holding or something, I think that's a bit of a mistake. Badgerlord says and they just sold all the Canadian stores. Yeah, I saw there was like some actual, I think it was like a game. A game operator or something that purchased them, that actually looked solid. So ASST, let's take a look at this over a month. Yeah, this makes a ton of sense. This is",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 63,
      "start_timestamp": "00:50:15",
      "start_timestamp_seconds": 3015.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=3015"
    }
  },
  {
    "text": "the Canadian stores. Yeah, I saw there was like some actual, I think it was like a game. A game operator or something that purchased them, that actually looked solid. So ASST, let's take a look at this over a month. Yeah, this makes a ton of sense. This is exactly what you would expect on that news. Now here's the interesting thing. Let's see if ASST shows us any signs that they knew that this was going to happen before it happened. No options. So that answers that. Damn, that would have been kind of fun. Okay. So section 351 allows non recognition of gain or loss when a property is transferred to a corporate solely in exchange for stock and the transfers are in control of corporation immediately after the exchange. Oh, that's cool. That's really cool. And this was the other follow up we had asked. Being a Bitcoin treasury in the gaming sector. So it says GameStop could move material portion of cash into Bitcoin. Okay. But then what? Establishes the companies of forward thinking crypto aligned brand. Well, I think they already have that with the recent offering crypto integration and gaming products. I mean, yeah, this doesn't necessarily do them a lot of favors though. Because I think using like this is the other reality is like Bitcoin isn't. It's not here yet. It's not at the point where people are wanting to make a bunch of like basic, smaller level transactions with Bitcoin.",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 63,
      "start_timestamp": "00:52:05",
      "start_timestamp_seconds": 3125.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=3125"
    }
  },
  {
    "text": "yeah, this doesn't necessarily do them a lot of favors though. Because I think using like this is the other reality is like Bitcoin isn't. It's not here yet. It's not at the point where people are wanting to make a bunch of like basic, smaller level transactions with Bitcoin. And it's because it's expensive on a relative basis. It's way too slow still. And a big part of that is because obviously you need the confirmations and it's not like using a credit card where the credit card company is effectively saying, we're going to pay you no matter what. And then we'll deal with this person on the back end if they need to. But that doesn't exist for a Bitcoin just yet. So I think for Bitcoin to be widely adopted is like a payment mechanism like that. You really need easier spending infrastructure for it, which just doesn't exist yet. Lightning network for micro transactions like this makes sense. I think this would make a lot of sense if it's actually scalable and accessible. It's just not right now. Let's see. Deemphasize retail stores. I think that makes sense. Spend off physical assets. So this is framing it like it could potentially be more so of like a Bitcoin holding just like that's the play. Yeah, Bitcoin back dividend. That would be a massive change. Yeah. That would be a really, really big change. Big bet too. Bitcoin doesn't seem like it's going anywhere, but it's",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 63,
      "start_timestamp": "00:53:50",
      "start_timestamp_seconds": 3230.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=3230"
    }
  },
  {
    "text": "framing it like it could potentially be more so of like a Bitcoin holding just like that's the play. Yeah, Bitcoin back dividend. That would be a massive change. Yeah. That would be a really, really big change. Big bet too. Bitcoin doesn't seem like it's going anywhere, but it's also not necessarily growing at like a fiery exponential rate right now. So it's still and that's just because adoption for these kinds of things is naturally going to be slow. It's just how it is. So let's take a look at the recent recent behavior from GameStop. And give me one sec. I just got to grab another water. All right, all right. So let's see what's popping in the Bitcoin world. What do you see on the ninth huge, huge call premiums on a relative basis, massive. Let's go back a month. So this was 531. This was 487 up to 555. So this is like 30 day one month. Highs here. That's pretty interesting. So let's take a look at where that is. Let's see. So it looks like the 355s got the treatment and take a look at this. A lot of that is for this coming week. So that's a lot of like very, very strong near term positioning. That's kind of crazy. Let's see. We want this by premium. 3.8 mil. Again, 246k. That's nuts. That was just for last week. So let's see what's going on here. Little calls 5.8 for the 16th",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 63,
      "start_timestamp": "00:55:24",
      "start_timestamp_seconds": 3324.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=3324"
    }
  },
  {
    "text": "coming week. So that's a lot of like very, very strong near term positioning. That's kind of crazy. Let's see. We want this by premium. 3.8 mil. Again, 246k. That's nuts. That was just for last week. So let's see what's going on here. Little calls 5.8 for the 16th of May against 653. That's really strong. 1.1 at the 28. That's really strong. Let's take a look at what happened. Wow. So the 20s got absolutely activated. Silent. Nothing going on. And then on the 9th, they just started getting slammed. I didn't see this. So this is one that if I go through my alerts, I definitely would have gotten alerts for this for a few different reasons as I look at this. But I mean, that's huge. 21,03. Volumes 2000 premium is 1.8. And then the premium here is 1.263. Wow. That's really impressive. That's like really aggressive. And it's hard to tell because it actually looks like some of it might have also been unwound. What was the price change between 710, 30 and 40? 710, 30, 40. So it looks like some of this probably would have been sold off. It literally could have been like a really, really short term. Yeah. Let's. That's exactly what it looks like. So I wouldn't call it a scout necessarily, but there definitely is some offload for sure. That's fascinating. 78. That was like the average. Let's see. What do we get into towards the beginning? 7,8. Yeah.",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 63,
      "start_timestamp": "00:58:24",
      "start_timestamp_seconds": 3504.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=3504"
    }
  },
  {
    "text": "like a really, really short term. Yeah. Let's. That's exactly what it looks like. So I wouldn't call it a scout necessarily, but there definitely is some offload for sure. That's fascinating. 78. That was like the average. Let's see. What do we get into towards the beginning? 7,8. Yeah. I mean, these are in profit. Got in 7,8. These are out for eight. On 40 contracts, not a ton of money, but it's still a decent. It's still a decent pick up. What were the delta on these? The in the money delta is an interesting choice. High delta. So by going further in the money, you get a better delta move. They're more expensive, but there's also the hedging requirement. Now these are still 40 days out in time. So there's not a massive hedging concern like upfront because you still have time. But that's one of the reasons why going in the money can be interesting, especially for shorter term ideas is because you start to force that hedging behavior, even if it's not inherently at like the ideal time, but to get them to start putting on. Share hedges to account for potential assignment. Or exercise, I should say, because these people would be along these options. Super interesting. I be says huge risk to be long calls on GME. Not really. I actually don't agree with that at all. I think like any other options chain, it really depends on the way you choose to",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 63,
      "start_timestamp": "01:01:54",
      "start_timestamp_seconds": 3714.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=3714"
    }
  },
  {
    "text": "I should say, because these people would be along these options. Super interesting. I be says huge risk to be long calls on GME. Not really. I actually don't agree with that at all. I think like any other options chain, it really depends on the way you choose to structure your position. But I mean, I've already shared it before like from a coverage triangle perspective, GameStop is the second best performing coverage triangle in the portfolio. It's the first best in terms of how much money it has. But that's just because of the volatility. So being long options and something like GameStop can tear your face off. If you're over sizing or if you're like putting on stupid positions, you're going to let your money on fire. But there's nothing really that forces you to do that. You can absolutely put on smart trades. If you're so inclined, which can work really, really well in something like this because of the volatility. So yeah, I don't really see it as super risky at all. I would be curious as to why you view it that way. Now, if we take a look. Let's. I can this up a little bit. So we've been oscillating sideways in here for some time now. There's a really, really strong volume node that's built. And we can also see that again, we have this plotted in think or swim. But it does look relevant here. Let me grab that horizontal line",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 63,
      "start_timestamp": "01:04:34",
      "start_timestamp_seconds": 3874.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=3874"
    }
  },
  {
    "text": "a little bit. So we've been oscillating sideways in here for some time now. There's a really, really strong volume node that's built. And we can also see that again, we have this plotted in think or swim. But it does look relevant here. Let me grab that horizontal line here. Here. Okay. Oops. So this has us at like the 2110 handle, just like the sub 20. So if we zoom this, can you grab the access? You can. Great. I'm just pulling the squeeze out of here so that we can see the near term price behavior. So you can see that there is some price activity down here, sub 21. But you can see before you get to 21, I mean, we really are in just the meat of overall volume and overall transaction volume. So the way that it's behaving lately, at least for the way that I trade GameStop is been more so from just premium perspective selling puts. It's always maintaining high wall. And I'm not seeing the prevalence of the call skew. If I saw a higher prevalence of call skew, I absolutely would buy shares and sell calls or sell naked calls with. The intent to buy shares set essentially order. If it starts to move up too much. But I'll show you what I mean in terms of this skew. Let's go to the chain. So if we go out. 16th. What's the next main expiration? We'll go out to next",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 63,
      "start_timestamp": "01:05:58",
      "start_timestamp_seconds": 3958.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=3958"
    }
  },
  {
    "text": "with. The intent to buy shares set essentially order. If it starts to move up too much. But I'll show you what I mean in terms of this skew. Let's go to the chain. So if we go out. 16th. What's the next main expiration? We'll go out to next month, the 20 June's. Here. And if we take a look at the same delta equivalent column put, let's do that. We'll do the 29 delta. And the ball on this side is 91 for 29 delta. And if we go to a 29 delta on the put side that puts a summer rate around here, the ball is 73. So that's actually the biggest skew that we've seen for a while. That's still, I mean, that's a bigger skew than I was expecting to see. That's like a 20 point skew. That's significant enough. Now, if it's actually trading, there is another story because we do need to see like what the bid and the offer is. Where is that bid as is that volume? I don't like the way that. Yeah, it's the biggest volume. Where's like the fucking market? Normally, I want to see bid and ask. What I'm trying to do is see how liquid it is. That's still, I mean, that's decent enough. Let's take a look at the 23 of May. Let's take a look at the delta's here. So 33 is 51. And 33 somewhere in here. This is like double. So the",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 63,
      "start_timestamp": "01:07:56",
      "start_timestamp_seconds": 4076.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=4076"
    }
  },
  {
    "text": "What I'm trying to do is see how liquid it is. That's still, I mean, that's decent enough. Let's take a look at the 23 of May. Let's take a look at the delta's here. So 33 is 51. And 33 somewhere in here. This is like double. So the call side is heat. Not this must have been from the activity on Friday. So to me, this actually starts to paint a different picture. This is the exact scenario that I'm talking about that with the ball skew that strong. If it does remain to be this strong, I absolutely would take some of the short puts down by shares and then sell calls against it to take that call skew. And then what I do to protect to the downside on that kind of position is the game plan will be really simple. Why can't I look at a chart? There you go. The game plan is really simple. All I do is set alerts to essentially get stopped out below near term resistance. And I would just do it near the break even for the short calls. Maybe, you know, a little bit edge on it. But that's exactly what I would do. So this is, we'll see how it actually behaves on Monday. But that looks interesting. All right. Let's take a quick look at the DD library quick. Well, maybe just run through one of them before I bounce. But I want to make sure",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 63,
      "start_timestamp": "01:09:29",
      "start_timestamp_seconds": 4169.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=4169"
    }
  },
  {
    "text": "that's exactly what I would do. So this is, we'll see how it actually behaves on Monday. But that looks interesting. All right. Let's take a quick look at the DD library quick. Well, maybe just run through one of them before I bounce. But I want to make sure we keep our cadence. Though this is sorted old. The new. Yeah, this looks old to new. And we're through these. Let me double check. Yeah, we definitely have seen this. So let's take a look at the next one. Thanks big bang, quant apes glitch. Let's go. Zoom in. Damn, is there not like a fucking medium happy medium zoom in? In this DD, I discuss why the meme stock craze is not just a bunch of retail traders pumping up stocks, which I agree with that. Instead, it's the product of greatest shorting fail on the market of all time that was made possible by easy money policies. Apes on cannability to buy hold next. I'll discuss statistical significance and origin of the FDD cycle. Finally, I give you a random dump of DD at the end of my thoughts. Oh, I'm actually fucking stoked for this. This is great. This is great. Can you guys see this? I can try to zoom in maybe on like the window itself. And then we'll just scroll. This is like 125 zoomed in. It doesn't look like it changes the magazine at all. I can download it. Let me know",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 63,
      "start_timestamp": "01:10:51",
      "start_timestamp_seconds": 4251.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=4251"
    }
  },
  {
    "text": "is great. This is great. Can you guys see this? I can try to zoom in maybe on like the window itself. And then we'll just scroll. This is like 125 zoomed in. It doesn't look like it changes the magazine at all. I can download it. Let me know if it's visible. If it's really hard for you guys to see, let me know and then I can just download it. If this is visible enough, then we'll just proceed as is. And in the meantime, I'm a swap out the bubble water. I'm not going to get into it. I'm going to be excited for this one. This looks cool. All right, I will take the silence as you guys can see. This talks about volume. So visualization, what visualization, what we already know, but have been, haven't been able to prove the stocks are related. Okay, are they actually doing a correlation analysis? Certain tests you can run to determine if inputs are correlated to degree of correlation. This is exactly what I did in undergrad and grad. So that's absolutely correct below the apes used statistical test. Ah, that's a bummer. I'm actually very curious what test they used to determine the correlation of game stop to other meme stocks. And the VIX. This should not have a high. I was going to say they should not have a high correlation of X. Let's see. Up is a comparison of these stocks while the bottom compares",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 63,
      "start_timestamp": "01:12:33",
      "start_timestamp_seconds": 4353.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=4353"
    }
  },
  {
    "text": "test they used to determine the correlation of game stop to other meme stocks. And the VIX. This should not have a high. I was going to say they should not have a high correlation of X. Let's see. Up is a comparison of these stocks while the bottom compares them in the last year. Okay. Okay. As you can see, the difference between all time and last year is striking. The Bob Desmos are called correlation coefficients go up to one. There's. There's a lot with this though. So one of the problems with the way that they ran this study in this way. Is that they're missing some really, really important behaviors. And it's you need to create a benchmark without a benchmark. This really isn't that useful because depending on the year and what this is saying is this is the last year. This was written in June. Seven of 2021. What happened in the last year during this time frame where this was analyzed anybody remember. And then the next question I'm going to ask you is what kind of impact do events like the thing we're talking about. Little something that happened in that time frame. What effects on correlation do those kinds of events have. What happened in 2020. And the market obviously had a massive down tick. What happens during really big down ticks. Is everything becomes correlated. Everything. So my guess is if you put in. I mean, we literally can run",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 63,
      "start_timestamp": "01:14:18",
      "start_timestamp_seconds": 4458.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=4458"
    }
  },
  {
    "text": "frame. What effects on correlation do those kinds of events have. What happened in 2020. And the market obviously had a massive down tick. What happens during really big down ticks. Is everything becomes correlated. Everything. So my guess is if you put in. I mean, we literally can run the study right now so that we don't even have to to guess this is super easy to do. Literally, chat you can do this now actually like to a pretty good degree. And we'll just literally take a look at a couple benchmarks. Compared to whatever they come up with the numbers will be a little bit different. I presume just because of. The techniques used, but I think overall it'll still be. Worth the look. So this is. And we'll do. Daily. And we're going to ask for Microsoft. From 2020. And we're going to run it until. 2021. Okay. That's one. We'll add another name will add like Tesla. Same time frame. And then we'll add game stop. So that I have that data. And then let's add like Chevron. And then let's add one more maybe like Pfizer. Cool. And then we'll add some more. And then we'll add some more. And then let's just steal my. Chat GPT. Window back. I'm going to add the files. And then we'll add the variance. Ranked distance. Of the name. Well, so we'll let this run in the background. It's going to have to clean it a little",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 63,
      "start_timestamp": "01:16:08",
      "start_timestamp_seconds": 4568.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=4568"
    }
  },
  {
    "text": "then we'll add some more. And then let's just steal my. Chat GPT. Window back. I'm going to add the files. And then we'll add the variance. Ranked distance. Of the name. Well, so we'll let this run in the background. It's going to have to clean it a little bit because there's some metadata in there. But I think you'll get the you'll get the gist when it pops out. So as you can see, all of them except for NAKD and not have strong correlation. A game stop what really struck me was the VIX because the market usually goes down when the VIX goes up. The fact that game stop and VIX have such a strong correlation in the past year is extremely important for our thesis that HFs are actively acting against it. That's a bummer. If that's a big part of the thesis that's not really a good. That's unfortunate. Bummer. Yeah, Daniel. Anyway, so let's continue. Carpload takes OTC data from Finra plots it for each of the meme stocks. How they seem to follow pattern of spiking FDD cycle. This I think is one of the initial cycle analysis. DDS, isn't it? That's what this looks like to me from 2021. Weasers are extremely rare. There are actually not to be honest. How rare are short squeezes in the stock market. Well, let's see how it answers that broadly. So the correlations for those other names. So Chevron during that time frame was",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 63,
      "start_timestamp": "01:18:25",
      "start_timestamp_seconds": 4705.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=4705"
    }
  },
  {
    "text": "what this looks like to me from 2021. Weasers are extremely rare. There are actually not to be honest. How rare are short squeezes in the stock market. Well, let's see how it answers that broadly. So the correlations for those other names. So Chevron during that time frame was a point four, which is huge. For Chevron at that time. Pfizer was a point five eight. Tesla was a point seven. So what I'm showing you is a bunch of these correlations during that time frame, especially through 2020. Is it just about everything became massively correlated. Let's see. Less than half a percent of all stocks exhibit the classic squeeze characteristics in any given month. I think that's correct. Definitely because there's a bunch of stocks. It was like six thousand. So I would imagine it's a very small minority for sure. And then it says only 10 to 20 stocks per year. See major high profile squeezes with three to five times moves in the short time window. Yeah, I think that's a that sounds right. So for me at least I wouldn't consider that extremely rare. It's rare, but it it happens monthly effectively. It's just. Not like this super widespread effect. Okay, so this is trying to do the math themselves. Let's see what they find. 100 increases to an. Yeah, so they're also classifying a squeeze is like. I mean, that's like pretty high in terms of the total move. Yeah, I mean, these",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 63,
      "start_timestamp": "01:20:21",
      "start_timestamp_seconds": 4821.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=4821"
    }
  },
  {
    "text": "Not like this super widespread effect. Okay, so this is trying to do the math themselves. Let's see what they find. 100 increases to an. Yeah, so they're also classifying a squeeze is like. I mean, that's like pretty high in terms of the total move. Yeah, I mean, these are actually this is even higher than I would have guessed. So they're seeing higher than what we just saw. So yeah, I mean, that's actually pretty. I wouldn't consider that actually like super rare. Seeing the data stocks are correlated is correlated. Me and there's some sort of orchestration going on or something forcing them to move in concert. No, that's true. Again, the other thing is especially during the time frame that it was identified is a highly anomalous period. Typically move same direction reason unknown. There are different tests you can do to not just measure the correlation in terms of like directional relationship, but you like Pearson and spearmen, which allow you to analyze a little more deeply using spearmen. Gives you insight into the actual strength of the relationship, not just the directional tendencies. So let's see. Okay. Rest of the market piling on by orders. I think this is talking about just the squeeze. Yep. Okay, let's go to the FDD cycle. First demonstrating statistical significance of the FDD cycle so that we know it's not just a flu. Yeah, this I want to see. I will discuss origins. Yeah, let's take a look.",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 63,
      "start_timestamp": "01:21:57",
      "start_timestamp_seconds": 4917.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=4917"
    }
  },
  {
    "text": "orders. I think this is talking about just the squeeze. Yep. Okay, let's go to the FDD cycle. First demonstrating statistical significance of the FDD cycle so that we know it's not just a flu. Yeah, this I want to see. I will discuss origins. Yeah, let's take a look. FDD cycles the idea that because that's the C regulations require market makers to cover FDD 35 calendar days. There's a predictable increase in price and volume every 21 ish trading days or 35 calendar days. So far it has continued to repeat itself the idea that shorts are in so deep that they're doing some bare minimum to cover to continue doing sells a deeper hole by kicking the can on the road. Currently increasing exponentially which indicates that it's getting more and more expensive to stay in the game. Okay. Orange line represents FDD cycle increases by each month. I want to know how they got that into think or swim because that to me looks like they're just doing like a time based thing. Yellow lines or FDD cycles. Well, I mean, and this is a good example right depending on what we consider the start date. That's what I need to see. But one of the things I've spent a while looking at with Newton was the various timing theories and we've looked at it before on his sheet and there definitely are relationships but I still wouldn't consider them predictive relationships which you kind of",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 63,
      "start_timestamp": "01:23:33",
      "start_timestamp_seconds": 5013.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=5013"
    }
  },
  {
    "text": "That's what I need to see. But one of the things I've spent a while looking at with Newton was the various timing theories and we've looked at it before on his sheet and there definitely are relationships but I still wouldn't consider them predictive relationships which you kind of see that here as well. Right like this cycle it went down this cycle it really didn't do a whole lot. Even with this green candle it's about flat from where it was the other thing is a really a flawed component of this 35 calendar day thing is that we're expecting to wait the full 35 calendar days which doesn't inherently make sense. So for example, if I know that I'm going to have to you know again based on their theory cover part of my position I'm not inherently going to wait until day 35 that doesn't really benefit me what I'm going to try to do is find the best pricing over that month and a half or the you know month and a week to get where I'm trying to get best pricing for what I'm trying to cover. So I would inherently just wait 35 days I think that's a really big mistake when analyzing the FTD cycles is the assumption that we wait the entire 35 days. So the hardquan gapes gathered from or text showing. S i shortage the stock say that's in accurate because real size hidden okay let's see. Where did",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 63,
      "start_timestamp": "01:24:59",
      "start_timestamp_seconds": 5099.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=5099"
    }
  },
  {
    "text": "days I think that's a really big mistake when analyzing the FTD cycles is the assumption that we wait the entire 35 days. So the hardquan gapes gathered from or text showing. S i shortage the stock say that's in accurate because real size hidden okay let's see. Where did short interest begin to grow this makes sense. A big reason why you might see. This kind of movement is because leading into. Like that kind of explosive of a move it's generally a little bit more common. To see short interest spike but I also imagine and this I think you guys would know better than me looks like LC just. Newt their messages I was wondering what the fuck is going on in the chat. You guys would know better than me but I was expecting people to think that the short interest was even higher in this period leading into 2020 is that about right or. Because I know that we think that the short interest was under reported which I think is broadly supported by the way but I don't know how high. Like we thought it was leading into 2020 my general guess is that we thought it was like pretty damn high. So this is showing like 2017 2018 short interest seemingly a little bit lower at like 28 the reason why I'm saying this is this actually. Could be even worse you know than what's shown here and I think that that's. Completely",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 63,
      "start_timestamp": "01:26:20",
      "start_timestamp_seconds": 5180.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=5180"
    }
  },
  {
    "text": "we thought it was like pretty damn high. So this is showing like 2017 2018 short interest seemingly a little bit lower at like 28 the reason why I'm saying this is this actually. Could be even worse you know than what's shown here and I think that that's. Completely viable from the short interest side it's the same thing the fact that like we see 140 short interest like that shouldn't exist. So it would not surprise me at all to see this number even higher coming into 2020. Oops short interest most of the meme stocks markedly increased 19 game stop had an exceptional increase because of their insurance of bonds. Okay so one of the things that I would want to look at personally with this and this is one of the things that I think that the community unfortunately does too frequently. In this kind of analysis is focusing too much on the basket of interest and not including enough controls. So what makes this data more powerful is if for example we created a list of the most commonly of the top 10 desial for example of short interest names. Because I think that actually would be a pretty powerful plot I wonder if chat you can find that. And you find a plot of the highest short interest pickers by year. That would be powerful because then it starts to show things like prevalence how consistent are certain names at the top of the",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 63,
      "start_timestamp": "01:27:56",
      "start_timestamp_seconds": 5276.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=5276"
    }
  },
  {
    "text": "would be a pretty powerful plot I wonder if chat you can find that. And you find a plot of the highest short interest pickers by year. That would be powerful because then it starts to show things like prevalence how consistent are certain names at the top of the pack or not in the pack. How frequently do they cycle into the pack and out of the pack all that stuff matters actually quite a lot. Until short squeeze scanner. Let's see if this is on target or not. Oh, Fintel didn't work for us before. And it's not working now shocker. So it looks like we'll have to do that one on our own. I can I can grab what we need for that. It'll just be on the back burner, but that's something I will take a look at at a curiosity, because I think it's worth it. Okay. So let's continue. Oh, I love this. So this is sewing. Yeah, this is great. Now it's that short interest. This is great. So as you can see, short interest increased markedly 2015 and 19 got me thinking must be some kind of law correlation with Fed policy or some kind of macro economic happening that led to this. That's a great. This is a great investigative step by the way. I personally think this isn't the right way to frame it because this is a leading framing. The correct way to frame this thought, which is the",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 63,
      "start_timestamp": "01:29:32",
      "start_timestamp_seconds": 5372.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=5372"
    }
  },
  {
    "text": "or some kind of macro economic happening that led to this. That's a great. This is a great investigative step by the way. I personally think this isn't the right way to frame it because this is a leading framing. The correct way to frame this thought, which is the underlying concept that they came up with is way more to the effect of what happened in the years that had a spike in short interest. Because we can absolutely see a spike in 15, but this is also like to me, what's even more important are the percent changes. If we take a look at oh nine to 10, that's a massive percent change. It's not necessarily the highest in terms of short interest, but that is of interest to me. Same thing from this period between 2010 and 2011. That's another massive spike that you see. So the way to think about these investigative questions is not to come up with your hypothesis of I think it was a law or Fed policy related. But do your best to approach it more open ended. You can have those in the back of your brain as like these might be things I should look at because they could be causes. But again, when you conduct analysis in this way, it just forces you to be too centered on like the thing that you think it is and you might miss other really useful details. So just general feedback for",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 63,
      "start_timestamp": "01:30:59",
      "start_timestamp_seconds": 5459.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=5459"
    }
  },
  {
    "text": "be things I should look at because they could be causes. But again, when you conduct analysis in this way, it just forces you to be too centered on like the thing that you think it is and you might miss other really useful details. So just general feedback for the person conducting the research because it's really cool to see people doing this kind of research, but just different ways to tighten it up. All right, let's see not mortgage interest rate federal funds rate in turb yep insanely low since the 90s. Balance sheet of the Fed. Yep. Okay. All right, let's see what they say here. The above graph is especially striking shows the feds balance sheet is increasing proportionally with the SP 500. That's quantitative easing policies have been extremely aggressive since 08. QE is where the Fed purposely stimulates the economy by buying assets like bonds. It's necessary after 08. Yep. This is good. I like that. Mean relative change to open to open previous day in x plus minus one days after green day. Mean relative change to open previous day x plus one days green day Microsoft. Tesla. Okay, this is better. So here's a problem with this right out of the gate. The sizing and this like the start of the plot that they're showing is good. The problem with this is these are in no way like like comparisons. So you have to include these and I'm really, really glad that",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 63,
      "start_timestamp": "01:32:21",
      "start_timestamp_seconds": 5541.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=5541"
    }
  },
  {
    "text": "here's a problem with this right out of the gate. The sizing and this like the start of the plot that they're showing is good. The problem with this is these are in no way like like comparisons. So you have to include these and I'm really, really glad that they included these names. Especially things like Tesla which are higher volatility and Microsoft which we know is lower volatility really big company. So it is literally perfect that they included these names. But to make this plot more meaningful, you have to include similar sized names. And it's because especially at this point where game stop is a much smaller company. They are always going to have more volatility. It's a nature of being a smaller company. So comparing the movement patterns of game stop against Tesla in this case again is perfect to painting the broader picture. But we needed we need to see more of these. That's the main thing I wish was here because I otherwise I really, really like this. Okay, love charge show GME FTD cycle increases after a certain number days. So one of the things I still don't know and maybe one of you guys know I would. Is like how do we pick the day in this person's methodology? I've seen other people how they pick the day. But how do we pick the day. I put Tesla and Microsoft in there so you could see abnormal GME is that's correct",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 63,
      "start_timestamp": "01:34:14",
      "start_timestamp_seconds": 5654.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=5654"
    }
  },
  {
    "text": "of you guys know I would. Is like how do we pick the day in this person's methodology? I've seen other people how they pick the day. But how do we pick the day. I put Tesla and Microsoft in there so you could see abnormal GME is that's correct even compared to volatile stock like Tesla. That's correct. GME is a way more recognizable pattern gives us further. So evidence of the FTD cycle that is not conclusive. Also note that there were many other users different posts and sub who found the FTD cycle statistically significant. This is another view to add to that body of work below shows the short interest of meme stocks in relational one others. So you can see when they started and how they've increased together. So what is the start date though X plus minus one days after green day. Is green day just an update or is green day something else. After green day. What does this mean? Let me see. Let me see if the homie chat GPT knows. What does this. What mean? Because I've been training chat GPT on analyzing the. The frequency of the different cycle theories to try to track them down because there's so many cycle theories now. But my goal is to find actually statistically significant. So I think it's like after a green day specifically looking at the average to open price over the next 40 days. So it's just using a green",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 63,
      "start_timestamp": "01:35:47",
      "start_timestamp_seconds": 5747.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=5747"
    }
  },
  {
    "text": "to try to track them down because there's so many cycle theories now. But my goal is to find actually statistically significant. So I think it's like after a green day specifically looking at the average to open price over the next 40 days. So it's just using a green day. So this doesn't like this, doesn't tell us much. Because like another thing we would want to include here is like positive drift. And we would want to see multiple time series that would be really useful. So what I mean by that is I would plot of rotating number of the time series that starts on different days to show the termination over these durations. Okay, we'll continue though. I love this. I literally love the work. Let's see what's next. One of the short interest retail stocks start to increase significantly. Okay. What do we see here? Extremely easy lending environment rates are dirt cheap. Fed is buying up assets, which is pushing up the prices of literally all assets. Market flush with liquid assets. So much that the Fed was trying to slow it down. Perfect storm for short, friendly environment. I agree with that. Now one thing to note for the short, friendly environment specifically is the rates aren't simply set by what the federal funds rate is. The other thing is there's premiums associated with the nature of the stock. So if things are hard to borrow, they're inherently more expensive to short, even",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 63,
      "start_timestamp": "01:37:22",
      "start_timestamp_seconds": 5842.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=5842"
    }
  },
  {
    "text": "one thing to note for the short, friendly environment specifically is the rates aren't simply set by what the federal funds rate is. The other thing is there's premiums associated with the nature of the stock. So if things are hard to borrow, they're inherently more expensive to short, even if it's a low federal funds rate environment. Now if it's a higher rate environment, that's just going to exacerbate it. So the one thing to note here is that this absolutely is completely cracked, that it's a short, friendly environment. But it is important to temper that with the fact that if something is hard to borrow, it still is relatively expensive, even if it's a low fund rate environment. When I think happened, long as bull market, high frequencies realized that this bull market was propped up on the Fed's massive balance sheet or a hedge fund. Sorry, I assume that's what that means instead of high frequency firms would need to be economic tightening and dissipating an end to the bull market, initiated a giant short campaign in 19. I mean, that's a fucking hell of that's a hell of a. My guess is the timing might be something like that, but I absolutely would not say that that's the reason. The essentially building a giant short position just because of a long bull market, I cannot imagine that being the case. Now again, the reason why they did it doesn't really matter. I agree with the",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 63,
      "start_timestamp": "01:38:56",
      "start_timestamp_seconds": 5936.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=5936"
    }
  },
  {
    "text": "be something like that, but I absolutely would not say that that's the reason. The essentially building a giant short position just because of a long bull market, I cannot imagine that being the case. Now again, the reason why they did it doesn't really matter. I agree with the finding that it absolutely does look like that short interest blew up during then, which is a completely fair, fair observation. So the reason why and the reason why I'm even mentioning that is because it's really important not to underestimate or misconstrued the motivations for quote unquote the enemy. And that's part of what this is to essentially say it's just that is a little bit light. Convinced not continue to happen if the apes didn't hold. This is why it's all able to happen. Never been phenomenon on the market where a significant portion of investors and a stock hold it no matter what the conditions are. I agree with this. All right. Let's see what the DDS. Let's see what the DDS are. K goes funny one, Wang played guilty. Yeah. Ball and Bill Wang. That boy is fucking crazy. Purple line VWAP, SMA, it's Viac. Other companies he bet big on Wang using instrument called total return swaps. Yep. Okay. This hypothesis back by no data and is really just an experiment based on the fact that meme stocks correlate what if hedge funds are using some type of swap on them, which absolutely I absolutely",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 63,
      "start_timestamp": "01:40:13",
      "start_timestamp_seconds": 6013.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=6013"
    }
  },
  {
    "text": "companies he bet big on Wang using instrument called total return swaps. Yep. Okay. This hypothesis back by no data and is really just an experiment based on the fact that meme stocks correlate what if hedge funds are using some type of swap on them, which absolutely I absolutely would expect that to be the case. It would make sense given extremely low interest rates not even from the interest rates by the way. So again, to understand the context behind this. One of the really, really useful thing about swaps is you can build it to be exactly what you want. So I think that's agnostic to the low interest rate environment because depending on how they're built, the rate environment could help or hurt. But I think that the product itself of a swap is so pertinent to this exact use case. So again, I wouldn't tie it to low interest rates, but what a swap is and what it provides. It would make even more sense given the negative beta of game stop. Perhaps they use total return swaps or another instrument to cover to add more pressure. I think ages of thought. It wouldn't necessarily be to add more pressure or to cover outright, but it would be to make the bet is on exactly what they want, which is underlying to go down in different conditions based on different size mood, really, whatever they want. So I wouldn't say it's inherently for these reasons,",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 63,
      "start_timestamp": "01:41:31",
      "start_timestamp_seconds": 6091.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=6091"
    }
  },
  {
    "text": "be to add more pressure or to cover outright, but it would be to make the bet is on exactly what they want, which is underlying to go down in different conditions based on different size mood, really, whatever they want. So I wouldn't say it's inherently for these reasons, but it definitely is for what swaps provide. Could this be the work of an algo? No more observing similarities. Well, I think algorithms are highly trained on the retail trading behavior in game stop. We literally saw this with we absolutely saw this when the cat tweeted about chewy. Chewies price movement was insane and we looked at that closely and it happened at a velocity that literally we can not definitively, but near definitively assert that that was algorithms that were moving off of that. So completely think that algorithms are part of this. And I wouldn't even, I wouldn't bother saying if it's all the work of an algo or partially the work of an algo, that element really we won't know. But I absolutely think that it's very, very easy to say like yeah, a algorithm's in general are heavily involved in this broader process without a doubt completely, completely believe that. Scott says worked at a swap dealer firm, Zaynner, and when you hear the word swaps, think bespoke, multi-like transaction. Yeah, that's a great way. That's a great way to phrase it. The other thing is in terms of like the quote unquote number",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 63,
      "start_timestamp": "01:42:47",
      "start_timestamp_seconds": 6167.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=6167"
    }
  },
  {
    "text": "a doubt completely, completely believe that. Scott says worked at a swap dealer firm, Zaynner, and when you hear the word swaps, think bespoke, multi-like transaction. Yeah, that's a great way. That's a great way to phrase it. The other thing is in terms of like the quote unquote number of legs even is really interesting because the way to think about I would build on to what Scott said, I think the bespoke element is absolutely the most important part. But to think about what bespoke means in this context. And again, Michael Burry in the big short is such a great example of that. It's essentially the ability to build something that directly exposes you to the specific thing you want exposure to. A great example of this is variant swaps. So if you're a retail trader and you're trying to trade the difference between implied and realize volatility, you have to use options. And when you're trading options to capture that vol variants, you essentially have to continually delta hedge, which has a cost associated with there's a lot of things that make it a very impure way to express that idea. Whereas a variant swap is the complete opposite. It removes everything else. And it says this is the only thing that this is essentially going to react to in terms of the performance. So that's the core part about swaps and it's not relegated to price. It's not renegated to just volatility in a vacuum.",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 63,
      "start_timestamp": "01:44:18",
      "start_timestamp_seconds": 6258.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=6258"
    }
  },
  {
    "text": "the complete opposite. It removes everything else. And it says this is the only thing that this is essentially going to react to in terms of the performance. So that's the core part about swaps and it's not relegated to price. It's not renegated to just volatility in a vacuum. It's really exactly what Scott saying a bespoke thing. So you can build it really is like a choose your own adventure kind of thing. Now again, there are bounds on it and whatnot, but definitely way more than when way more opportunities to specify your exposure way more than on the retail. All right. A lot of you probably extremely excited for earnings on the ninth. You don't have to get your hopes up. Okay. And one of my posts I said something along the lines of retail is tapped out. Thankfully, another user made a post disagreeing with that and got tons of replies of apes saying things like I have triple my position. Okay. Okay. So I think this is like I really, really like this piece a lot. I think the analysis that they did was relatively good. I think it's missing some really important elements with respect to making like the outputs a little bit more robust with what you can take away. And like the correlation analysis, for example, and then also the movement based analysis on a green day. I was a little bummed on that because the like a green day is",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 63,
      "start_timestamp": "01:45:35",
      "start_timestamp_seconds": 6335.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=6335"
    }
  },
  {
    "text": "with respect to making like the outputs a little bit more robust with what you can take away. And like the correlation analysis, for example, and then also the movement based analysis on a green day. I was a little bummed on that because the like a green day is just so open. And did markets exhibit positive drift? You have to like break apart that movement a lot more to get to the bottom of like the actual FDD cycle. That's what makes the whole FDD cycle so challenging to track down because there are so many variables when it comes to the movement of a stock that you have to be able to like successfully decouple quite a few components of it to actually be able to say like, yes, this is the primary driver of the price movement, which becomes really difficult to do. And this goes back to what I will always, always, always bring this conversation back to because I love looking at this stuff, but it is so simple in the broad context. Every single big move, every single big move GameStop has ever had has been preceded by massive expansions of volume. Single one. So while we do this research and we enjoy understanding these different theories, cycle analysis, so on and so forth, always remember what I just told you. Before every single time GameStop has had a big move, every single time there is a massive run of volume before the",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 63,
      "start_timestamp": "01:46:59",
      "start_timestamp_seconds": 6419.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=6419"
    }
  },
  {
    "text": "one. So while we do this research and we enjoy understanding these different theories, cycle analysis, so on and so forth, always remember what I just told you. Before every single time GameStop has had a big move, every single time there is a massive run of volume before the move. It's not on the move. It gets exacerbated during the move, but it's before the move. Now, do not misconstrue that into any time GameStop has a big change in volume. It means there's a big move that's not the case at all. This is a difference and this is why there's a nuanced relationship between things like correlation, but then predictability. So just take that and make sure that you understand the difference there. The reason why I always express that is because it can get really overwhelming, trying to track all these different timing theories and going through the DDE, but the ultimate end user perspective from a trading lens is actually it literally is that simple. That's how I trade it. The reason why I go through the DDE library and all that stuff is literally just because I'm interested. It is not because I think this is going to make me trade GameStop better. I actually think the opposite almost. I think when you go too far into that, you start seeing things that may or may not be there versus just following what is there. And again, I can objectively tell you what is",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 63,
      "start_timestamp": "01:48:16",
      "start_timestamp_seconds": 6496.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=6496"
    }
  },
  {
    "text": "this is going to make me trade GameStop better. I actually think the opposite almost. I think when you go too far into that, you start seeing things that may or may not be there versus just following what is there. And again, I can objectively tell you what is there is before every single move. There is a massive change in volume. This is a great example here in April. Notice how the move gets really aggressive in here. But if we zoom in on this period, you can absolutely see that volume starting to jack before the move. And again, it's all relative. But if you take a look, things quiet, quiet, quiet, quiet, quiet, and then I don't know how. How do I see the volume? I don't know what the volume is. I can't see it. But you can see that the volume from here to here changes massively. And then it does again here to here and then again here to here. So it's just one example of how you absolutely can just use volume. Oh, there it is. There's our way to see it. So volume went from 2.6 mil to 8.6. That's here. 2.6 to 8.6. What I like to do is I use an average volume. I'll use like a trailing five days or something like that. And I use two like a five day and a 20 day. But what I'm showing you is a massive change in the volume. It",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 63,
      "start_timestamp": "01:49:35",
      "start_timestamp_seconds": 6575.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=6575"
    }
  },
  {
    "text": "2.6 to 8.6. What I like to do is I use an average volume. I'll use like a trailing five days or something like that. And I use two like a five day and a 20 day. But what I'm showing you is a massive change in the volume. It literally goes from 2 to 8 to 36. When you see that kind of massive changes in volume, some things going on. Now again, does it always mean prices are going to explode to the upside absolutely not. But again, just always remember that point when we're going through this stuff so that you don't get super overwhelmed. This happened obviously mostly because of earnings. You have to remember the context, but hopefully worthwhile. LC says back then, a fascinating part of the mystery and swap basket case was costs most highly correlated with GameStop yet without options. Yeah. And I think there was a pretty big exercise that Newton and I went through analyzing costs specifically relative to GameStop. And there is an uncanny relationship really with XRT. And I think we absolutely got to the bottom of that. I think it was from Stanford. I forgot what institution talked about essentially creation redemption. And that's a big part of this whole story in the correlation between the names. Scott says you just described what a master's in economics is how to isolate what you're trying to measure. Yeah. Yep. That's exactly, exactly it. Wow. Super cool. Very enjoyable",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 63,
      "start_timestamp": "01:50:45",
      "start_timestamp_seconds": 6645.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=6645"
    }
  },
  {
    "text": "talked about essentially creation redemption. And that's a big part of this whole story in the correlation between the names. Scott says you just described what a master's in economics is how to isolate what you're trying to measure. Yeah. Yep. That's exactly, exactly it. Wow. Super cool. Very enjoyable session. It is time for me to bounce, go grab some dinner, but really great hanging out with everybody. As always, if you need anything, you can hit me up. Like I said, for the Saturday series going forward, I'm going to integrate other names for us to look at too from the meme stop basket just because I get people that reach out and ask if we can. So the answer is a absolute yes. Just let me know you can hit me up in the discord. It's completely free to join or just yeah, that's the easy way throughout as a comment on a video if there's a specific ticker that you want to look at. As always, if you have any questions, let me know, be an outlier. Let's see you guys later.",
    "metadata": {
      "video_id": "b6xLHRo383c",
      "title": "SOFI, Bitcoin, GameStop Options Flow Update | Meme Stock Watch Ep40",
      "url": "https://www.youtube.com/watch?v=b6xLHRo383c",
      "upload_date": "",
      "duration": 6802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 63,
      "start_timestamp": "01:52:17",
      "start_timestamp_seconds": 6737.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=b6xLHRo383c&t=6737"
    }
  }
]