[
  {
    "text": "What's up, outliers? Welcome to another outlier, options trading, quick tips. We learned something new in three minutes or less. Today we are talking about what is an implied volatility surface. Now, this sounds way crazier than it actually is. It's very simple. It's simply plots the implied volatility's for each strike across different expiration. And there's a couple different ways that you can visualize this. There are simple versions like the one you see over my head. This is from Think or Swim. And this simply shows in different lines, they represent different expiration's. And then your x-axis represents different strikes. And then your y-axis represents different implied volatility. So we can compare the strike volatility between individual expressions. We can do it across explorations. We can look at the relationship between different explorations and the overall gaps at different points. And another version that people are probably more familiar with is this here, which is actually you can create something like this in Python. But what it does is it essentially removes the three different lines and it combines them into a 3D model. So you can see that there's the same traits. But this case, again, you can build this in Python. And it will just consolidate these lines down into 3D surface. So there's a couple different ways you can visualize it. But the information is about the same. We're looking for any anomalies. We're looking for the relationship of volatility. We're looking to see if",
    "metadata": {
      "video_id": "B_nTx0FAv3k",
      "title": "Option Volatility Surface Explained",
      "url": "https://www.youtube.com/watch?v=B_nTx0FAv3k",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 3,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=B_nTx0FAv3k&t=0"
    }
  },
  {
    "text": "can build this in Python. And it will just consolidate these lines down into 3D surface. So there's a couple different ways you can visualize it. But the information is about the same. We're looking for any anomalies. We're looking for the relationship of volatility. We're looking to see if the put side is much higher than the call side. That is very, very frequent. And that's typically for a lot of things like large cap stocks. For people have big stock holdings. And they tend to hedge risk to the downside. So it puts get priced up a bit more. Then this typically means that there's a lower probability of a massive downside move and a higher probability of a smaller upside move. And then sometimes you can find names like GameStop, which is actually typically inverted, where the call side, out of the money calls will have much higher implied volatility, then the put side. And this is also very common for names that are really expected to have these big upside potential moves. So you can learn a lot from implied volatility surface models. I actually have a video that goes much deeper into implied volatility. You can check that out on the channel. Be an outlier. See you later.",
    "metadata": {
      "video_id": "B_nTx0FAv3k",
      "title": "Option Volatility Surface Explained",
      "url": "https://www.youtube.com/watch?v=B_nTx0FAv3k",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 3,
      "start_timestamp": "00:01:25",
      "start_timestamp_seconds": 85.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=B_nTx0FAv3k&t=85"
    }
  },
  {
    "text": "can check that out on the channel. Be an outlier. See you later.",
    "metadata": {
      "video_id": "B_nTx0FAv3k",
      "title": "Option Volatility Surface Explained",
      "url": "https://www.youtube.com/watch?v=B_nTx0FAv3k",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 3,
      "start_timestamp": "00:02:30",
      "start_timestamp_seconds": 150.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=B_nTx0FAv3k&t=150"
    }
  }
]