[
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 17,
    "text": "What's up outliers? Quick market update before the YouTube live session later today. I just got off the inversion tables through your boys thinking crystal clear, but I want to talk about two products. I want to talk about in video. And then I want to talk about game stop primarily because both have earnings coming up slightly different time frames. But for Nvidia, we're looking at earnings coming up here on the 28th after the market. So that'll be this Wednesday. Now when I've been keeping an eyeball on it, I'm seeing a lot of companies exhibit this exact price behavior specifically within tech where we are just navigating sideways into earnings. Another recent example of this actually is chewy right we had this nice rally and it's just been trending sideways quietly leading into earnings. I'm kind of just seeing that happening with quite a few products here and again, chewy is not in tech. I give that as a non correlated comparison. So a couple of things here. The first one is implied volatility is very high. We have implied volatility raw at 77 and then the implied volatility percentile puts us at 97 and for those that are unfamiliar with the difference between implied volatility implied volatility percentile implied volatility rank in why some of those are better than others. I'll throw a link in the notes below for you to check out, but I definitely prefer implied volatility percentile because it gives me a cleaner",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=0"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 17,
    "text": "that are unfamiliar with the difference between implied volatility implied volatility percentile implied volatility rank in why some of those are better than others. I'll throw a link in the notes below for you to check out, but I definitely prefer implied volatility percentile because it gives me a cleaner look and volume has been also fairly static. We can see both primary time frames. I track the the averages on the five day in the 20 day and they're kind of just floating sideways here. So again, no big surprise to that. And for me, it looks like we're really looking ahead to earnings and rightfully so. So what is the expectation? Well, the first thing is when I take a look at the options chain and we take a look at the positioning that we have leading into earnings. I'm going to take a look at all. We have 13 million point 13.1 million calls against 13.1 million puts so about same same. Now one of my preferred tools now is to look at just the expiration cycle that has earnings because this has all sorts of contracts in here. And you can tell if I look at the put side, you see all these white boxes. These are all further out in time. This is 17, G and 25. These are people adding general broader portfolio hedges designed to take place over a longer period of time. They're hedging their stock. This doesn't tell me how we're",
    "start_timestamp_seconds": 64.0,
    "start_timestamp": "00:01:04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=64"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 3,
    "total_chunks": 17,
    "text": "the put side, you see all these white boxes. These are all further out in time. This is 17, G and 25. These are people adding general broader portfolio hedges designed to take place over a longer period of time. They're hedging their stock. This doesn't tell me how we're positioning specifically for earnings. However, we can easily get to that. If we take a look at this. And when we look at specifically for earnings, I see 900 in 50,000 calls again, 788,000 puts. So there's very clearly a bit of a call skew, but it's not enough for me at least that I would consider this heavily remarkable. So I don't see like a clear signal that I would lean on just in terms of OI. And I say that because sometimes you can see that it's a little harder with really big stocks, especially like mega cap stocks like Nvidia. The ability for you to come in here and see a massive skew is overall pretty unlikely. Now, if I look at the implied volatility for the upcoming cycle, we can see that we are pricing in the downside, which is not meaning that the options markets is expecting a downside move necessarily. But this is standard puts you with respect to all that is very common, especially in bigger products like this, we tend to hedge and fear the downside a little bit more than playing to the upside. This is super common. So again, nothing",
    "start_timestamp_seconds": 152.0,
    "start_timestamp": "00:02:32",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=152"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 4,
    "total_chunks": 17,
    "text": "is expecting a downside move necessarily. But this is standard puts you with respect to all that is very common, especially in bigger products like this, we tend to hedge and fear the downside a little bit more than playing to the upside. This is super common. So again, nothing anomalous here. A lot of what I look at in markets when I look at this stuff is just seeing if something looks off or weird. That's pretty much it. And in this case, not so far now taking a look at the volume today specifically for the 30 aug there's 700,000 calls against 451,000 puts that actually is slightly interesting to me. Because if I take a look at the change in oh, I in this front expiration cycle, my guess is people are actually just now starting to build into their earnings positions, which is essentially what I will be doing. I wait until it gets very, very close before I place any sort of earnings positions because I'm trying to isolate the earnings move itself. So now let's take a quick look at how it's performed during previous earnings. If you're not familiar with this analyze tab and what I'm showing you here, I got another video in the description below that I recently put out actually that's doing terribly by the way. So you should go check it out so that it can probably emerge through the YouTube algorithm. But I just do like a really",
    "start_timestamp_seconds": 222.0,
    "start_timestamp": "00:03:42",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=222"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 5,
    "total_chunks": 17,
    "text": "and what I'm showing you here, I got another video in the description below that I recently put out actually that's doing terribly by the way. So you should go check it out so that it can probably emerge through the YouTube algorithm. But I just do like a really quick walk through of the analyze tab. And this is one of the tools that I use a lot, which lets me look at the previous earnings. So looking at the past series of earnings, most of the bigger gaps that I see are to the upside, essentially exclusively. There are a couple down moves like here, but it's pretty moderate. Same thing here. And I regularly see historic wall exceeding implied. So for me, that tells me it's more of a directional earnings play in my opinion. So there's a couple other things we can look at specifically with respect to preimposed movements. And a big thing that I like to pay attention to is just what's the variance in IV before and after we can see that for all these different expiration cycles. But then also just what's the overall move that we see on a relative basis after earnings is announced. And to the upside, it looks like one of the largest moves we see is 27, which is pretty massive. And then to the downside, it's not terrible. We're looking at like negative five, I see negative seven there. So overall, not a pretty significant down",
    "start_timestamp_seconds": 295.0,
    "start_timestamp": "00:04:55",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=295"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 6,
    "total_chunks": 17,
    "text": "after earnings is announced. And to the upside, it looks like one of the largest moves we see is 27, which is pretty massive. And then to the downside, it's not terrible. We're looking at like negative five, I see negative seven there. So overall, not a pretty significant down move. But again, to be clear, this was looking all the way back from the starting point of five days before what I care about is, the movement around earnings itself. But it does seem to have a bit of positive drift. Now the one exception, I would say in my opinion towards this earning specifically is show me the money. What I mean by that is, indeed, is God at deliver. They got to be on the freaking ball here because they have been valued into the sky and beyond. They have to deliver near perfectly in order for this kind of valuation to maintain can this kind of parabolic upside valuation continue it can, but it needs to be supported by near perfect delivery, which will look like another really solid EPS beat. It will look like increased sales revenue, those kinds of things. So I'm actually really, really eager to see because to me, it looked like a lot of the earnings we were seeing before this was the kind of like the euphoria of understanding how big this market could be specifically through AI and stuff like that and all the support in video supports for",
    "start_timestamp_seconds": 360.0,
    "start_timestamp": "00:06:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=360"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 7,
    "total_chunks": 17,
    "text": "really eager to see because to me, it looked like a lot of the earnings we were seeing before this was the kind of like the euphoria of understanding how big this market could be specifically through AI and stuff like that and all the support in video supports for it. And I think now we have an opportunity to see like what does this look like in a little bit of a more mature phase because again, the market is a discounting mechanism. It's not what have you done for me and it's not what are you doing today. It's what are you doing over the next six to nine months that I care about. So this will be a really important earnings release in my opinion. And then we have crowd favorite, Jimmy, bummed today. I didn't like this move. This is sending us a little bit now on declining pattern on this really short term time frame. So if I take us into like a 30 day, this is four hours. So each candle here is for four hours just because most of mine are daily candles. I don't want to confuse anybody. So it's essentially two candles to each day and essentially from Friday, what two weeks ago, we've slowly been rotating over. Now we're getting to the point where the consolidation in my opinion is starting to break. So the first half of the day, we fell out of this really tight consolidation zone, which",
    "start_timestamp_seconds": 434.0,
    "start_timestamp": "00:07:14",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=434"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 8,
    "total_chunks": 17,
    "text": "candles to each day and essentially from Friday, what two weeks ago, we've slowly been rotating over. Now we're getting to the point where the consolidation in my opinion is starting to break. So the first half of the day, we fell out of this really tight consolidation zone, which I kind of market by the bottom these lows here. We fell out below that and then we continued below it. I'm seeing the moving averages starting to rotate over which doesn't look favorably at least near term in my opinion. And we're looking at the slopes of some of the longer term moving averages, essentially leveling out, which again, I don't love to see. So from a chart perspective, I was actually kind of hoping it would be a little bit more quiet leading into earnings. And then once we got closer to earnings, maybe we would see a little bit of an expansion and volume or something like that. But we're still looking at just highly, highly compressed volume. Now on a solid note, I suppose we did exceed the five day average volume of 3.7 mil, we hit 4.7 mil, which is good. But we're still at least a mill below the 20 day average. And at this point, you can see again, just from the size of these, the volume is so contracted, not even again comparing it to the squeeze here. But to this time frame in here as well, the volume is just so,",
    "start_timestamp_seconds": 496.0,
    "start_timestamp": "00:08:16",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=496"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 9,
    "total_chunks": 17,
    "text": "least a mill below the 20 day average. And at this point, you can see again, just from the size of these, the volume is so contracted, not even again comparing it to the squeeze here. But to this time frame in here as well, the volume is just so, so, so light. So to me, it looks like we are really coming into a bit of a quiet slash rotation period from a charting perspective. I'm seeing a lot of high percentage sale volume on the day. And yeah, I mean, it'll be like that sometimes if something is like highly in favor and then capital starts rotating out for a few days. And then if I take a look at the RSI, which I like to use two different lines, I use this smoothing period. In this case, it's a four period. And then I use the RSI line itself. And you can see here, I I like to track the slope of both the RSI and the EMA over the previous day. Typically, when I see RSI dropping below the four period that generally favors a little bit more of a downside move. Normally, I use this is kind of a momentum indicator personally where if I see it flattening is when I will add more. So this is actually another reason why a bit of an aside here. But when I take a look at QQQ, I've already started trimming and flattening out my cues position",
    "start_timestamp_seconds": 571.0,
    "start_timestamp": "00:09:31",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=571"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 10,
    "total_chunks": 17,
    "text": "is kind of a momentum indicator personally where if I see it flattening is when I will add more. So this is actually another reason why a bit of an aside here. But when I take a look at QQQ, I've already started trimming and flattening out my cues position because it's exhibiting the same behavior. Does that mean that it can't pivot and go up? It absolutely can. And if it does, I'm here for it. But it's not what it's doing. So again, from a trading perspective, my job is to do what it's doing, not what I want it to do. So in this case, this is also starting that. So for my trading, a lot of people ask me about that. And I'm always happy to share. I'm an open book with respect to it. I try not to make it the focus of it. I try to focus more on just providing you information that you can digest and do whatever you want with it. Hopefully to help inform the way you model things and provide data. But beyond that. So the way I'm looking at it is the same as usual. I still have my long shares, but I'm selling calls against the long shares to capitalize on the price rotating down to hedge some of the long share bullish directional preference. But I sell them at a ratio. So what that means is if I have 100 shares and I sell one call.",
    "start_timestamp_seconds": 646.0,
    "start_timestamp": "00:10:46",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=646"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 11,
    "total_chunks": 17,
    "text": "my long shares, but I'm selling calls against the long shares to capitalize on the price rotating down to hedge some of the long share bullish directional preference. But I sell them at a ratio. So what that means is if I have 100 shares and I sell one call. If I play that scenario out and GameStop rallies, well, then I don't participate to the upside because I've capped my upside potential because I have a one to one ratio of short calls, which again, for those unfamiliar, each one call equals 100 shares. So in this kind of scenario, what I'm doing is, let's say I have 5,000 shares of GameStop. Well, I can sell maybe 10, 15 calls, something like that. So I still am very much preferring the upside move, but I'm also going to make a little bit of money while we're oscillating sideways. And then if there is a really big upside move, I still have a bunch of shares in that scenario that would not be covered. So that's the broader thesis here again, quick reminder, still have earnings coming up looking at the fourth before the open. And then when I look at the options in here, I see a few things going on. The first one is we're actually accelerating on the call side more than I thought, which I'm actually very happy about that. What I mean by that is I'm seeing 500,000 calls against 264 K puts. So we're",
    "start_timestamp_seconds": 700.0,
    "start_timestamp": "00:11:40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=700"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 12,
    "total_chunks": 17,
    "text": "at the options in here, I see a few things going on. The first one is we're actually accelerating on the call side more than I thought, which I'm actually very happy about that. What I mean by that is I'm seeing 500,000 calls against 264 K puts. So we're almost at that two to one ratio again that I like to look for. And in GameStop, really, I prefer to be even higher like three. I've seen it up to four and change, but that's when we're in a really bullish configuration. I still just like that we're playing to the upside. That's what this tells me. And I love seeing that disposition here. Now, the other thing I've been keeping a really close eye on is this, which I just am confounded by again. I will never bullshit you guys if there's something I don't know I'm going to tell you. And the overwhelming majority of instances I would expect to see earnings with higher volatility than this next random week beyond earnings. This week is becoming a bit of a puzzle to me. If anybody knows what's going on in the 13th of September, I would be so eager to understand and learn about it because something's going on there. The fact that the earnings week is at 72 the week after earnings is 92.6 and then it drops to 87. That's not normal. Something weird is going on there. So my guess is the market is",
    "start_timestamp_seconds": 766.0,
    "start_timestamp": "00:12:46",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=766"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 13,
    "total_chunks": 17,
    "text": "so eager to understand and learn about it because something's going on there. The fact that the earnings week is at 72 the week after earnings is 92.6 and then it drops to 87. That's not normal. Something weird is going on there. So my guess is the market is expecting something the week of the 13th. I don't know what I don't know why, but that's all I can see from the balls here that again, as you could tell, I am quite infatuated by a couple of people have asked me like, why do I keep covering GameStop even though it's not doing a whole lot. It's literally for things like this. I continue to find from an option straighting perspective, the longer you do this stuff, the less stuff surprises you because you see a lot of it. But this product continues to put all these strange anomalies in front of me that I just find intriguing to explore like this right here. That's anomalous. So I like learning about it and digging into it. And yeah, so it's one of the reasons why I love taking a look at the product. Now let's take a quick stroll down time and sales because this stuck out to me. We started seeing some actual volume coming in today. And this is looking at the call side. All of these are purchases. So we're seeing blocks of 500 coming out at the 21 and a half in 30 August.",
    "start_timestamp_seconds": 822.0,
    "start_timestamp": "00:13:42",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=822"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 14,
    "total_chunks": 17,
    "text": "stroll down time and sales because this stuck out to me. We started seeing some actual volume coming in today. And this is looking at the call side. All of these are purchases. So we're seeing blocks of 500 coming out at the 21 and a half in 30 August. Curious. Then we're seeing some blocks in six step in 13 step at the 23s and the 22 and a halfs. These are starting to get to be meaningful size positions, not huge, but larger. For an alternate view, we can see here through our friends over at unusual whales. Again, the size of these trades is not big, 88,000. Like these are relatively small trades. But what I do find interesting is that we're seeing a couple of these step explorations getting hit. And again, what I find interesting is this one, the fact that we're starting to see a little bit of build out in this 13 step. I don't know what 13 step is, but it's something. I don't know what it is, but it's something. And I can clearly see that it's something. The stuff playing the shorter term stuff like the the six step. My guess is these are kind of earnings shots of some sort. I don't honestly know why you would buy calls into earnings here because typically, VAL will tend to contract. But again, in this case, my expectation is, VAL will continue to expand actually pretty meaningfully. So this could be",
    "start_timestamp_seconds": 883.0,
    "start_timestamp": "00:14:43",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=883"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 15,
    "total_chunks": 17,
    "text": "guess is these are kind of earnings shots of some sort. I don't honestly know why you would buy calls into earnings here because typically, VAL will tend to contract. But again, in this case, my expectation is, VAL will continue to expand actually pretty meaningfully. So this could be somebody that's playing a little bit of a directional disposition, but then also trying to play an expansion in IV because 63 and a half percent balls for this is is light, I think. And there's a good chance that the balls in here will expand even if the option itself doesn't move that much. You can't help but find 10 69. Just a fun number, I suppose. Now, I does look like unusual whales is combining that with a couple other orders here because they take them up to 2000. And I can see a couple other transactions going through for the six step right so I can see a tranche 350 come through here and stuff like that. There's a chance this could be somebody hitting at repeat. Actually, we can check that really fast. This one came through at like 10, what is that 1057. So this is specific time, by the way. So let me scroll down to 1057 and see if we can find a couple other transactions. Yeah, in here. Yeah, so it looks like that person built up and it looks like they gave them all of these here. But that still is",
    "start_timestamp_seconds": 960.0,
    "start_timestamp": "00:16:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=960"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 16,
    "total_chunks": 17,
    "text": "is specific time, by the way. So let me scroll down to 1057 and see if we can find a couple other transactions. Yeah, in here. Yeah, so it looks like that person built up and it looks like they gave them all of these here. But that still is a little bit light for the 2k. So I'm not sure which other transactions unusual whales attributed to them unusual whales has a slightly different system where they'll look a little bit broader in terms of time frame so we can actually click into this and it'll show us what it's given a credit for. So I see, okay, so this is all 1057 that is given it. I see so it's picking up the 1069 and then the rest of these residuals. Yeah, I think that makes sense. I think that that makes total sense. So yeah, it looks like it might be built out to 2k here once you pick up all the smaller pieces that got chopped up. So that's the long and short right now of GameStop. I still believe we're in a bit of a holding pattern. I'm really stoked for Nvidia earnings and for the YouTube live session later today. So as always, if you need anything, drop me a line and then until next time, be an outlier. I'll see you guys later.",
    "start_timestamp_seconds": 1030.0,
    "start_timestamp": "00:17:10",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=1030"
  },
  {
    "video_id": "BhkjwgGvZGY",
    "title": "BhkjwgGvZGY",
    "url": "https://www.youtube.com/watch?v=BhkjwgGvZGY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 17,
    "total_chunks": 17,
    "text": "the YouTube live session later today. So as always, if you need anything, drop me a line and then until next time, be an outlier. I'll see you guys later.",
    "start_timestamp_seconds": 1097.0,
    "start_timestamp": "00:18:17",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=BhkjwgGvZGY&t=1097"
  }
]