[
  {
    "text": "What's up outliers? I forgot we're over here now. Gotta get the right spot. So I'm using my little crappy camera. It's actually not a crappy camera. I just can't get it to look even remotely good, but I don't think there's anything looking good with me in it. Anyways, so none of it ultimately matters. But I'm using this one since the sessions tend to go a little bit longer for this one, because I want to give you guys as much time as I can. I want to be able to sit and stand and then sit again and then probably stand again several times. I try to typically move like every 15 minutes. I don't like sitting all day. But for whoever is in here, please first say hello in the chat so I can say hello back. And then if there's anything in particular that you want to hit, just let me know. We can slot it in as we go through kind of the standard agenda that I have built for us. Or we can hit it at the end depending on the question and what makes sense for the question that whole bit. It looks like we got Paulo, Samota, Jay and Chaser, good to see all of you. And Paul's asking what kind of breed a dog. It is a multi-sputtle. Give me one sec. He ain't doing a whole lot. We might have to change because he's very, let's see. Does he",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 91,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=0"
    }
  },
  {
    "text": "looks like we got Paulo, Samota, Jay and Chaser, good to see all of you. And Paul's asking what kind of breed a dog. It is a multi-sputtle. Give me one sec. He ain't doing a whole lot. We might have to change because he's very, let's see. Does he come through? Yeah, he's right there. He's kind of just like a big, big ball of loop. He can't see too many eyes that he does have eyes. See if I pull his head. He's not super into being disrupted during the sleep in sessions. He's in charging mode. What up, my boy. A nice little nose lick. But he actually doesn't know that much about options. So we will retire him to back to his post. And I'm sure he will just crawl back and go to bed. That is essentially how he gets down. All right. Back at it. Obviously, game stops up. But we don't have to talk about game stop. I know I've been on game stop for essentially the past week. When you trade options as much as I do in your end markets as long as I am, it's not super common that you come across super, super fascinating things like this because it has all the elements of a crazy story. So I can't get enough of it. But enough of that. Let me move over. And again, this is going to be as interactive as possible. I use this as a framework.",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 91,
      "start_timestamp": "00:01:39",
      "start_timestamp_seconds": 99.45494505494506,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=99"
    }
  },
  {
    "text": "come across super, super fascinating things like this because it has all the elements of a crazy story. So I can't get enough of it. But enough of that. Let me move over. And again, this is going to be as interactive as possible. I use this as a framework. Right. So I'm not giving you a freaking PowerPoint presentation. I have zero interest in doing that. Reggie says lies. I saw him reading options as a strategic investment. He probably could read it better than me. I bet. I would not. I would not be surprised. We also got no you. That's hilarious. That reminds me. We have another person named don't ask. Oh my god. We got to like get you guys. You ever see those phone calls where people do a prank call between like two different pizza places or Chinese restaurants and then like turn the phones so that they essentially try to order from one another and it's a hilarious battle. I feel like don't ask and know you would be perfect together in that sense. All right. What I'm going to do now is flip through the vast majority of this. We covered a lot of this in the last session and also be completely straight up with you guys. I don't know where we left off. So you will have to coach me a little bit. I will share the link for the last session in the notes here. There you are. That",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 91,
      "start_timestamp": "00:03:18",
      "start_timestamp_seconds": 198.9098901098901,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=198"
    }
  },
  {
    "text": "lot of this in the last session and also be completely straight up with you guys. I don't know where we left off. So you will have to coach me a little bit. I will share the link for the last session in the notes here. There you are. That is the last workshop we've done. And then the other thing somebody asked me for is kind of some ideas for homework, which is a great question. And especially for this group, the beginner level, I am throwing in a playlist there that is kind of like an options intro playlist. Now a couple notes. Some of the videos in there are super old. You will get a pretty hilarious look at old Eric in production quality, which hasn't gotten much better, especially with this camera. But it's still generally solid information. So it's a good spot to start. I have a new beginner video coming out and like I don't even know how long at this point. We're so backed up with the videos I'm trying to get out. I don't want to do two weeks. I feel like that's too much, although I did one like every day this week. So who knows, man, literally who knows what's going on out here. All right. Let's start actually with a question. And I like this question. And the other part beyond the question I'm not even going to lie with you is the fact that I want this, I",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 91,
      "start_timestamp": "00:04:58",
      "start_timestamp_seconds": 298.36483516483514,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=298"
    }
  },
  {
    "text": "this week. So who knows, man, literally who knows what's going on out here. All right. Let's start actually with a question. And I like this question. And the other part beyond the question I'm not even going to lie with you is the fact that I want this, I want to close this window because I have too many windows open. So this is a way for me to answer the one eyed fat man and to close this window out. And it's a great question. So essentially they said in regards to where I think I'm at, they have you and Sinclair on one shoulder saying, don't be a pussy put on a damn trade, which is literally great. And then it says, then I have me on my other shoulder saying, when there's no trade, don't trade. And I think this is a fair spot to be at for a lot of traders. The easy way I would look at this personally, I genuinely believe there's always a trade. I genuinely believe that. Now, if you trade a system that is very specific on set criteria and there's genuinely not always a trade for you, that's okay. Then I think this advice is fine. If there's no trade, don't trade. But for me as a trader, one of my goals in developing my toolkit that I reference all the time is to almost always be able to find a trade. There's not a great reason not to",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 91,
      "start_timestamp": "00:06:37",
      "start_timestamp_seconds": 397.8197802197802,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=397"
    }
  },
  {
    "text": "Then I think this advice is fine. If there's no trade, don't trade. But for me as a trader, one of my goals in developing my toolkit that I reference all the time is to almost always be able to find a trade. There's not a great reason not to be able to find a trade in my opinion other than a very niche skill set, which again, that can be a completely viable system for people, especially for like very specific canceling breakout style traders. You'll come across that exact kind of scenario. But to me, if you're running into that scenario too often when there's no trade, don't trade to me. That means we need to broaden the skill set a little bit. And the other thing is to just put on a damn trade. It's good advice. And there's nothing wrong with just putting on a small trade. If as long as you have a solid system behind it, and even if it's not fully fleshed out, as long as you're very careful about managing your risk, you're not going to hurt yourself. So for example, if you're trying to do some sort of breakout momentum following strategy and you buy a call, your risk is defined on the onset. So you literally could go into that trade under the assumption of, I'm going to lose this 200 I used to buy this call. You're not going to die. Like that's okay. But the main point is",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 91,
      "start_timestamp": "00:08:17",
      "start_timestamp_seconds": 497.27472527472526,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=497"
    }
  },
  {
    "text": "strategy and you buy a call, your risk is defined on the onset. So you literally could go into that trade under the assumption of, I'm going to lose this 200 I used to buy this call. You're not going to die. Like that's okay. But the main point is I don't actually think getting stuck in this gridlock is super logical. And I think it stems from either not being willing to size down enough to be able to be comfortable putting on the trade or not having a diverse enough skill set. That's my take. Let's see, not sure if this would be a place I should pass around the way up the ladder. If this is where I should live, nope, should not live there. I guess I'm looking for a home-based daily routine to anchor everything. I think this is okay. But I think over emphasizing kind of like comfort and in markets, it works and it doesn't work. What I mean by that is you have to get comfortable working in uncomfortable conditions. One of the uncomfortable conditions of markets is the fact that there is always going to be ambiguity. You will never know what certainty at any point what's going to happen. So getting used to operating in conditions like that. One of the big things I think that's worth mentioning to people is getting way more comfortable looking at markets as probabilistic scenarios and decreasing kind of the self-reflection and assessment of",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 91,
      "start_timestamp": "00:09:56",
      "start_timestamp_seconds": 596.7296703296703,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=596"
    }
  },
  {
    "text": "what certainty at any point what's going to happen. So getting used to operating in conditions like that. One of the big things I think that's worth mentioning to people is getting way more comfortable looking at markets as probabilistic scenarios and decreasing kind of the self-reflection and assessment of being wrong. Those are probably the most common themes I see for traders that are too fearful to put on positions. Is they're terrified of being wrong? And to me, again, that's one of the beautiful things about being like an idiot like I am. I'm wrong literally all the time and I don't care. It's fine. I understand that in this world, you're going to be wrong all the time. And if you use that and that scares you so much from taking steps, guess what? You're never going to get better at something. So in my scenario, I think having a routine is great. That makes a lot of sense. But the way I'm reading this home-based kind of thing to me that just reeks of trying to be comfortable and wanting to be comfortable. And you have to get comfortable being uncomfortable in my opinion. So that's what I say to that. I guess picking core positions, building scans. Yep, that's good. I think I'm stuck there. Yeah. And I mean, you will be stuck there unless you choose to not be stuck there. So then they go on to say normally I copy people and then",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 91,
      "start_timestamp": "00:11:36",
      "start_timestamp_seconds": 696.1846153846154,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=696"
    }
  },
  {
    "text": "what I say to that. I guess picking core positions, building scans. Yep, that's good. I think I'm stuck there. Yeah. And I mean, you will be stuck there unless you choose to not be stuck there. So then they go on to say normally I copy people and then iterate on my own, but variants and constraints are so wide with this. It's not the same as other skills. Yeah, I completely agree. You can't copy people in this. You kid maybe take inspiration from here or there. But if this is your system of learning, this is not good. So let's say let's go from here. It's really super, super simple. We're actually going to cover it a little bit as we get through the presentation today. But you have an idea of picking core strategies or structures that you might run, finding conditions to look for those. Oh, like actually, I'm going to stop there because we're literally going to talk about this in just a second. But we'll talk about these next steps from the jump here. Truck and plane. Good afternoon from New Zealand. It's great to see you. And we're actually on our first stand-up face. What time is it truck and plane in New Zealand? And while we're figuring out what time it is in New Zealand, let's get into this. All right. So we talked about this stuff yesterday. Yada, yada, yada, blah, blah, blah. This we didn't talk about because this",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 91,
      "start_timestamp": "00:13:15",
      "start_timestamp_seconds": 795.6395604395605,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=795"
    }
  },
  {
    "text": "stand-up face. What time is it truck and plane in New Zealand? And while we're figuring out what time it is in New Zealand, let's get into this. All right. So we talked about this stuff yesterday. Yada, yada, yada, blah, blah, blah. This we didn't talk about because this is a new ad. And there's really nothing revolutionary in here for you other than the fact that I like the colors. But I just want to give you kind of this other side of the equation, primary market participants. There's way more than this. But my goal here is for retail traders to see that there's a lot going on in the space. These can break down into subcategories. The overall goal for these different entities is different. But it's we're operating in a space that has a lot of other players. But there's a lot of different rules. And that's a really common misconception. I was actually emailing somebody a little bit earlier about this where markets are competitive. There's not just money laying around everywhere. Everywhere. But at no point as you use a retail trader, you're not competing with high frequency traders. They're literally doing something completely different than you. There's no competition there loosely, right? Obviously, if you put a terrible offer out, one of the algos might scoop it up and orbit. Sure. That's obviously an extreme scenario. But the entire world that we play in is so different. It's so different than what",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 91,
      "start_timestamp": "00:14:55",
      "start_timestamp_seconds": 895.0945054945054,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=895"
    }
  },
  {
    "text": "completely different than you. There's no competition there loosely, right? Obviously, if you put a terrible offer out, one of the algos might scoop it up and orbit. Sure. That's obviously an extreme scenario. But the entire world that we play in is so different. It's so different than what the vast majority of these other entities are doing. Prop traders slightly different. They're way closer and there's definitely competition there. Even market makers, there's some competition there because they can try to front run your order if they think you're an informed trade coming through. But you're not in direct competition with them. They're doing very different things writ large. High frequency traders literally are fighting over how close they can locate near the exchange to decrease the length of their freaking cables to transact milliseconds faster than somebody else. That's where they're at. They're paying millions of dollars to do things like that and build the requisite infrastructure. I'm not doing that at all. I'm sitting here with again a freaking sleep and dog in my office. So again, the point is we're in a competitive space. Very, very different place. Truck and plane says it's 12 p.m. Saturday. Oh, that's literally perfect. Great time change. Pat says 0 111 in the UK. Good old UK. I wonder what the weather's like there. All this says there's even cable speed bumps. Yeah. So that's really the point that to drive home there. We already talked about this. This",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 91,
      "start_timestamp": "00:16:34",
      "start_timestamp_seconds": 994.5494505494505,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=994"
    }
  },
  {
    "text": "Saturday. Oh, that's literally perfect. Great time change. Pat says 0 111 in the UK. Good old UK. I wonder what the weather's like there. All this says there's even cable speed bumps. Yeah. So that's really the point that to drive home there. We already talked about this. This is actually what we're going to talk about. So what I was going to for the one-eyed fat man that I was going to follow up with. And I don't know why I like angles. This is actually really inconvenient. So you might have to tilt your head to follow along here. But you know, so be it. What I'm highlighting in this slide is trading options is really confusing to people and that they think options inherently provide some sort of edge when they do not. So the way I think about trading options is the very first thing I'm doing is devising a thesis based on a profit mechanism of some sort. So for example, if I want to trade momentum, breakouts to the upside, I can buy calls, I can sell puts, I can buy shares. That comes down to optimizing what works best based on my deployment. The mechanism is the same across all those different products. Momentum, breakout to the upside. That's a directional trading strategy. Now the cool part about options is you gain exposure to completely different asset classes essentially, namely things like volatility. And you can trade a completely different world. But",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 91,
      "start_timestamp": "00:18:14",
      "start_timestamp_seconds": 1094.0043956043955,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=1094"
    }
  },
  {
    "text": "deployment. The mechanism is the same across all those different products. Momentum, breakout to the upside. That's a directional trading strategy. Now the cool part about options is you gain exposure to completely different asset classes essentially, namely things like volatility. And you can trade a completely different world. But again, in that scenario, volatility is the profit mechanism. Then the structures that you then turn into strategies, that is simply the implementation of the tools. In this case, that would be derivatives via options. Truck complaints says, bro, my internet can only comparatively stream this damn live stream, let alone make a trade in milliseconds, literally, literally. That's actually hilarious. So notice says fit more in one slide, but still big enough to read. Yeah, I probably could have sized that stuff up a little bit, I suppose. Jay says kind of off that, how much do you think as a retail trader, think about what the other traders are doing when planning your strategies of positions? I guess stuff like sentiment indices and stuff like that. Yeah, that's a great question. The first thing I will definitely mention on that is I think for retail traders, sometimes they're way too concerned with other people with what other people are doing. So trying to play the game of like, what's the other guy on my trade doing is really a fool's errand. You're not going to learn much that way. So and the reason why I think that is",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 91,
      "start_timestamp": "00:19:53",
      "start_timestamp_seconds": 1193.4593406593406,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=1193"
    }
  },
  {
    "text": "way too concerned with other people with what other people are doing. So trying to play the game of like, what's the other guy on my trade doing is really a fool's errand. You're not going to learn much that way. So and the reason why I think that is because again, like we don't know the motivation of the other side of your trade. You could have a roaring kitty on the other side of your trade who's literally just out there moving around doing a bunch of crazy seemingly things. He has his goal in mind though. He's doing his thing. I don't know about looking at half a billion dollars in the face and then taking shares of stock, but he made that choice essentially. That's the cool part about markets and kind of what I'm highlighting is that there are a lot of different reasons for what people do. So when planning strategies and positions, you can leverage elements of sentiment, but that gets more baked into the strategy way less about the, if I sell this call, that means the other person on the other side thinks it's going up and maybe they know more than me. That could be the case. That could not be the case. They also could be playing a completely different game than you. That long call could be some sort of hedge that they're hoping to lose on against a larger position that they have elsewhere. So again, playing",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 91,
      "start_timestamp": "00:21:32",
      "start_timestamp_seconds": 1292.9142857142856,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=1292"
    }
  },
  {
    "text": "than me. That could be the case. That could not be the case. They also could be playing a completely different game than you. That long call could be some sort of hedge that they're hoping to lose on against a larger position that they have elsewhere. So again, playing the game of what's the other guy doing? It's okay to be aware of it and you should be, but it's kind of a circuitous route. I think the most important thing you can focus on, it's kind of a hat tip to the stoic methodology of things, but focusing on your control, what you can control. You can't control what the other guy is doing and what they're thinking. You should be generally aware that other market participants are generally smart. That's not always the case. You could get paired up with a complete idiot. None of that matters necessarily. But as you're playing the game, I think it's important to think markets are generally relatively informed. And like if you see something that seems way too good to be true, you're probably missing something, stuff like that. But it's a great question. I think the absolute focal point for traders, in my opinion, is on your own book and on your own strategies. Whatever it is that whatever profit mechanism that you first outlined and then measured and know is there, you can control that. You can see it. So going through that process is really important. This",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 91,
      "start_timestamp": "00:23:12",
      "start_timestamp_seconds": 1392.3692307692309,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=1392"
    }
  },
  {
    "text": "for traders, in my opinion, is on your own book and on your own strategies. Whatever it is that whatever profit mechanism that you first outlined and then measured and know is there, you can control that. You can see it. So going through that process is really important. This is a lot of what I share with you guys in the discord is just a bunch of different studies. I'm studying the markets every single day. I've built a massive data set that I query against just to look for ideas, just to confirm existing ideas and see if they're still relevant. But the whole point is just start here, profit mechanism. There's got to be something that makes money. You can then fit an option structure, then strategy around whatever that is. But to me, this would be essentially the primary focus, being aware of the other counterparties good, but that's not going to tip the scales one way or the other. I, this one I think we already did. You guys already know about buyers and sellers. You guys already know the components of an options contract. You guys already know about calls and puts, which is great. This one I think I've added in. So this one is a bit of a ugly word slide. I think this covers most stuff that we've already hit on. Correct me if I'm wrong. But you guys, this might be worth lingering on for just a few moments, the",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 91,
      "start_timestamp": "00:24:51",
      "start_timestamp_seconds": 1491.8241758241757,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=1491"
    }
  },
  {
    "text": "great. This one I think I've added in. So this one is a bit of a ugly word slide. I think this covers most stuff that we've already hit on. Correct me if I'm wrong. But you guys, this might be worth lingering on for just a few moments, the pricing component, the at the end of the day. And I think we did talk about this, but I just want to make sure we did. When we're looking at options prices in the market. So if I come in here to GME, get rid of this example trade for now. And I'll pick something other than GME just so that you guys don't get completely fatigued by looking at the same thing because I'm obsessed with it right now. And let's say these 35 DTE 19 July Apple 205 puts these ones, the 26 Delta's. The way that this price is quoted here is by market consensus. That's really what it boils down to. Now we talk about all these different kinds of theoretical pricing models. We talk about things like the Black Sholes Martin pricing model, which actually doesn't represent markets. We can use it in some instances. And it was the framework for how we originally started thinking about pricing options. You can use things like binomial trees. You can do all sorts of kind of different permutations of pricing models. They lay a foundation for us. The way that options are priced in the market is",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 91,
      "start_timestamp": "00:26:31",
      "start_timestamp_seconds": 1591.279120879121,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=1591"
    }
  },
  {
    "text": "And it was the framework for how we originally started thinking about pricing options. You can use things like binomial trees. You can do all sorts of kind of different permutations of pricing models. They lay a foundation for us. The way that options are priced in the market is via supply and demand. The other thing most importantly, as that educated price discovery is occurring and supply and demand is being established. What is happening is this. We are looking to solve for volatility. So as different entities are making markets, as you could probably tell by the way I'm framing that, making markets, market makers, they're determining what the value of volatility should be in their model to offer options at that price. So on the retail side, you can choose to attempt to track and forecast volatility. You can do that. And I'll actually talk a little bit about that later because I think there was a few questions about it. And I geek out over that stuff. I have a bunch of different models built to try and do it. But the fact of the matter is unless you think you can do it better than the market, your prices don't actually matter that much. That's why we call it implied volatility. We use whatever the market is pricing. So again, this 20526 delta put right now the implied volatility on it is 21.08. That's implied from the current pricing of the option. Regardless of what",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 91,
      "start_timestamp": "00:28:10",
      "start_timestamp_seconds": 1690.734065934066,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=1690"
    }
  },
  {
    "text": "the market, your prices don't actually matter that much. That's why we call it implied volatility. We use whatever the market is pricing. So again, this 20526 delta put right now the implied volatility on it is 21.08. That's implied from the current pricing of the option. Regardless of what I get, this is probably more accurate. Probably. It doesn't mean that it is and there are opportunities to find misprice options. But I would consider that a much more sophisticated approach that will take time. That's not where I personally would start. That's not where I'm directing you guys. At least the whole concept of this is to share the path I would give myself to be very, very clear. So I wouldn't turn that off as something that you can't look at. But for example, a much better play if we want to use this specific volatility example. And if this is like way too literally just let me know in the chat and I can completely pivot. But I want to maybe see if this helps explain a few things. If we just look through this options chain and the implied volatility at different prices, there are some anomalies that immediately stick out to me. And there are relative pricing opportunities. So let's go maybe something like 21 days. Let's see if these are liquid enough. Just for an example, yeah, these are okay. So what you can do is monitor the value of implied volatility for",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 91,
      "start_timestamp": "00:29:50",
      "start_timestamp_seconds": 1790.1890109890107,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=1790"
    }
  },
  {
    "text": "some anomalies that immediately stick out to me. And there are relative pricing opportunities. So let's go maybe something like 21 days. Let's see if these are liquid enough. Just for an example, yeah, these are okay. So what you can do is monitor the value of implied volatility for different time frames and different strikes at different deltas in specific underlines. If you want to be sophisticated, you can import all of this data so that you don't have to manually comb through. If you're relatively new to this, you just pick a couple underlines. In general, if you're trying to look at volatility the way I'm about to describe it, doing it in super liquid products is not the move because there's so much liquidity and movement in these products. Finding mispricings becomes way more difficult because this is where a lot of people are looking. The more often opportunities are going to be found in like the trashy less liquid small products because for other entities to interact in those market spaces, it's just not worth their time in capital because they can't size a position on well enough. I'm priced out of a bunch of stuff and I'm still very much a small fish compared to the other entities I'm referring to. So if we look at the let's say 21 days to expiration and we look at the 22 delta here, I see that that's priced at a 21.14. Let's go further out and I",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 91,
      "start_timestamp": "00:31:29",
      "start_timestamp_seconds": 1889.643956043956,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=1889"
    }
  },
  {
    "text": "and I'm still very much a small fish compared to the other entities I'm referring to. So if we look at the let's say 21 days to expiration and we look at the 22 delta here, I see that that's priced at a 21.14. Let's go further out and I already forgot what delta. I just told you guys 22 delta. Yeah, 22 delta. So let's find a 22 delta ish. There's no direct here that's kind of annoying. Let's see if we can find a 22 delta here. This is 24 delta. This 24 delta is priced at 21.29. So you can come up with a relative value play based on a variance between these volatilities. What I'm highlighting in this scenario is that there are opportunities to play relative relative premium opportunities in options, but it's a slightly more sophisticated strategy that requires more tracking. That's what this will boil down to. The other thing that you should note though is if we look across this options chain, notice why I'm just to the volatility when it's at the money. You see 20.36 here and then you go further out of the money that volatility starts jacking way up. That's an important observation to make, especially if you're making relative volatility plays like we're talking about. That creates different opportunities. You can also look at the corresponding delta put in call and see if there's some sort of skew there that you can play with. What I'm sharing",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 91,
      "start_timestamp": "00:33:09",
      "start_timestamp_seconds": 1989.098901098901,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=1989"
    }
  },
  {
    "text": "up. That's an important observation to make, especially if you're making relative volatility plays like we're talking about. That creates different opportunities. You can also look at the corresponding delta put in call and see if there's some sort of skew there that you can play with. What I'm sharing here are just a bunch of random different ideas that I absolutely look at and trade from time to time in using something like what I would consider to be relative pricing opportunities. It's an entire different strategy of trading, which is the thing. Policies, what entities do you look for? Sorry, could you clarify that question? What entities do you look for? Do you mean what the entities look for that I'm talking about in terms of their ability to be able to transact your or what kind of products I look for? And then truck complaints says do you use volatility smile charts for that sort of thing? Do you prefer to look at the option chain? Yeah, yeah, definitely. So with you can use volatility smile and surface charts all the time. There's a bunch of different ones available. You can create your own and import if you like. You can use stuff like this down here, which is also super simple. It's a slightly less definitive model and it can be a little noisy. But in order to make something like this work, I typically would pick, you know, 50, 75 strikes, which is pick 50.",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 91,
      "start_timestamp": "00:34:48",
      "start_timestamp_seconds": 2088.5538461538463,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=2088"
    }
  },
  {
    "text": "you like. You can use stuff like this down here, which is also super simple. It's a slightly less definitive model and it can be a little noisy. But in order to make something like this work, I typically would pick, you know, 50, 75 strikes, which is pick 50. And then instead of all the different series, I would pick the primary series. So in this case, I would start by using the standard explorations, aka not the weekly. So I would pick like this, pick like this, pick like this. And then you can look literally for opportunities either relative to the call in the put side. If there's kinks like that, that's an opportunity. That's a relative value play. You can also, if you're so inclined, you can combine them and see if there's centralization around a specific strike. I prefer to look at calls and puts specifically. And the meantime, we go back down. But yeah, you can absolutely use smile or skew charts for sure. Samo just says can see it's behind you. Oh, yeah, sorry. My bad. It's literally right behind me. And all right, let me get me out of the way. There you go. So I'm talking about kinks like this. Or even kinks like this steeper is better. But stuff like that. Now you have to understand why it's there. That's an important component to this because the like these big dips, they might mean something. It's not always that you",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 91,
      "start_timestamp": "00:36:28",
      "start_timestamp_seconds": 2188.008791208791,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=2188"
    }
  },
  {
    "text": "you go. So I'm talking about kinks like this. Or even kinks like this steeper is better. But stuff like that. Now you have to understand why it's there. That's an important component to this because the like these big dips, they might mean something. It's not always that you see these kind of really extreme drops. But again, it's a spot to at least potentially look. You can say, okay, perhaps in the, what is this? The 19 July's, perhaps the 91 calls might be underpriced in terms of all. Now again, it's, this is probably something because it's after hours and markets are closed. You typically don't see stuff like zero out, right? It wouldn't have zero wall. But that's the idea. Anyways, is looking for relative value value plays something like that. Paul says products. Yeah. So for products, what I'm talking about, what I'm looking for, it's especially for these relative value plays. I'm looking for things that have interesting, interesting volatility. If there's an event coming up that helps a lot, that's a slightly different style play, but that's also one that I would integrate into this. And I also care if it's moderately liquid. Again, for me, I've been kind of priced out of a lot of things that I typically would trade previously, but a great example of a previous book that I normally would try to a biotech. Now when I trade biotech, I have to trade it smaller and I essentially",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 91,
      "start_timestamp": "00:38:07",
      "start_timestamp_seconds": 2287.463736263736,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=2287"
    }
  },
  {
    "text": "Again, for me, I've been kind of priced out of a lot of things that I typically would trade previously, but a great example of a previous book that I normally would try to a biotech. Now when I trade biotech, I have to trade it smaller and I essentially have to size it as if I can't manage it again. So the way I can trade that is very different. So Motis says, cause of kinks. Yeah. The, I mean, the simplest explanation without going super far in the weeds on that, kinks are caused by different relative volatility pricing. That's all that means. So in that case, as we're looking at implied volatility curve, that simply means at this strike for whatever reason, it's priced either low or high relative to everything else that's around it. Now why that's priced as that? That's kind of part of the name of the game. We gotta lose the socks. It's a little too warm in here now. That's kind of part of the name of the game is determining why. But yeah, the short answer is to why that happens is it's simply because volatility is either underpriced or overpriced relative to what's right around it in that same expiration cycle. And then again, on that same thing, you can compare other like different expiration cycles to one another. So let's see if we use like SPX. And again, like this, you have to get rid of a bunch of",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 91,
      "start_timestamp": "00:39:46",
      "start_timestamp_seconds": 2386.918681318681,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=2386"
    }
  },
  {
    "text": "relative to what's right around it in that same expiration cycle. And then again, on that same thing, you can compare other like different expiration cycles to one another. So let's see if we use like SPX. And again, like this, you have to get rid of a bunch of the series. There's just way, way too much noise in order to be able to see anything quarterly. So this right there, this is another immediate relative value play that I can see. If you can see it, throw it in the chat before I answer. There's actually several of them in this case. And again, the way that you play it is different and the way that it unwinds is different. Just because you play it doesn't mean it works out. I'm curious if you guys have any guesses as to what I'm seeing specifically on the call site here at least. Oh my god, I just swallowed a piece that went down the exact wrong tube. Alex says, kink exactly. And this is large enough. This is now interesting to me because that is a very distinct kink. And Alex's other perspective, to be honest, says, can't see puts out, yeah, it's fine. I'm not talking about the puts out. Don't worry about it. But the other thing that Alex points out is exactly correct. We're looking at the slope variance between these aspirations. So now what you can do is say, okay, I want to look at,",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 91,
      "start_timestamp": "00:41:26",
      "start_timestamp_seconds": 2486.3736263736264,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=2486"
    }
  },
  {
    "text": "puts out, yeah, it's fine. I'm not talking about the puts out. Don't worry about it. But the other thing that Alex points out is exactly correct. We're looking at the slope variance between these aspirations. So now what you can do is say, okay, I want to look at, I actually don't know what those DTEs are. Let's take a quick look. 21 June, 34. And then the 16 August, which is 60 days. Let's add that August in there. This one. So now you get to make a decision. You can say you have the 21 June down here, the 28 June up here, the 16 August here. You can even add another one, maybe the 19 July. You can make a determination. One, notice the kink here in this specific expiration cycle. This is in the 28 June. That's something that you're not seeing on anything else. This is a great example of a relative value play in terms of volatility. The other thing I see is notice that the departure between these two lines relative to one another, the 19 July's are much less steep in terms of their drop as compared to the 28 June's. So what we're seeing very clearly is more volatility being priced into the calls here this far out in time. That's again something you can play. Now on the put side, which now I do want you to look at. So I will get out you a way. Is look",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 91,
      "start_timestamp": "00:43:05",
      "start_timestamp_seconds": 2585.828571428571,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=2585"
    }
  },
  {
    "text": "So what we're seeing very clearly is more volatility being priced into the calls here this far out in time. That's again something you can play. Now on the put side, which now I do want you to look at. So I will get out you a way. Is look at this. How much the 21 June's peaked on the put side compared to the 28 June's. This is another relative value play. So just looking in volatility, you can find tons in tons and tons of ideas. That's why I say there's always traits. There's literally always traits. All right, I'd probably just keep myself on the top right. Huh? Keep me out of the way for you guys. I don't really think anybody's super eager to look at me. I'm not eager to look at me. The multiplier you guys know, right? That's just the standard. That's the standard size of a contract. So if we grab spy, it's better example since there's an underlying that trades. And we look at any of these options, you have to multiply the premium by 100. And that is because this represents 100 shares. There are actually, I don't know if there's still art. Do you guys know if there's still many options there used to be? I know that there's like teeth style options is compared to like SPX. There's like the little brother, which are the tenth the size. But that's the product itself. I'm curious about options themselves",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 91,
      "start_timestamp": "00:44:45",
      "start_timestamp_seconds": 2685.2835164835165,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=2685"
    }
  },
  {
    "text": "there's still art. Do you guys know if there's still many options there used to be? I know that there's like teeth style options is compared to like SPX. There's like the little brother, which are the tenth the size. But that's the product itself. I'm curious about options themselves because I think they used to have like Apple minis. I think they got rid of them though because I don't think they were super liquid. Damn it. Chat GPT just signed me out at the worst possible time. I was going to have chat GPT look at up for us. I bet we could still have chat GPT. I don't think so. I haven't seen them. And Apple was one of the products. They try to pick the most liquid products. Here we go. Do markets still offer many options? Let's see the answer. As of now, many options are generally not available for individual stocks or ETFs. Yeah. They were introduced to allow smaller investors to trade options with lower capital requirements since many options represent 10 shares instead of 100. But they were discontinued due to low trading volume and demand. Yeah, makes it so. So that's super common. And it's because options, people don't realize how liquidity-based this stuff is. It's wildly, wildly liquidity-based. And that's why when we look at something like SPX, it's why you see literally daily expirations because there's enough liquidity. There's enough demand to transact in these time frames, which is",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 91,
      "start_timestamp": "00:46:24",
      "start_timestamp_seconds": 2784.7384615384617,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=2784"
    }
  },
  {
    "text": "super common. And it's because options, people don't realize how liquidity-based this stuff is. It's wildly, wildly liquidity-based. And that's why when we look at something like SPX, it's why you see literally daily expirations because there's enough liquidity. There's enough demand to transact in these time frames, which is actually very, very cool. That stuff like that is a thing. Trot complaints as many futures, completely different concept when we're talking about the underlying itself as compared to the options on the underlying. But yeah, you're 100 correct. There are the micros. So you have the eminies and the micros which are smaller. Then you have things like SPX versus I think it's what? Xsp? Is that right? Yeah. So this is the mini SPX index. So it takes it down massively. It takes it down to 543 versus 5431. So yeah, there are many products, but there's not many options. I don't know if you guys ever actually seen that. For me, I'm ever seeing them pop up. And then they have, I haven't seen them since. So it makes sense. They have disappeared due to lack of interest. But anyways, that's what the multiplier is. It used to be that there used to be minis. So you kind of have to know if it's multiply by 110, but now it's easy. It's all 100. American versus European options is important from a few different perspectives. And you guys should know what that is by now, I think.",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 91,
      "start_timestamp": "00:48:04",
      "start_timestamp_seconds": 2884.193406593406,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=2884"
    }
  },
  {
    "text": "to be that there used to be minis. So you kind of have to know if it's multiply by 110, but now it's easy. It's all 100. American versus European options is important from a few different perspectives. And you guys should know what that is by now, I think. I think we talked about that last time as well. But it's essentially when an option can be exercised. American style options can be exercised. And I guess I should say exercise here versus assigned. At any time. So if roaring kitty, for example, great example, if he exercises options, it's due to the fact that they're American, he's able to exercise them at any point in time. A lot of products are American style, the vast majority, but there are European style options. So things like SPX is European style option. That means it can only be exercised at expiration. That impacts the risk of the position so that actually impacts the pricing pretty significantly. J Kim says, so can you exercise the option when it hurts you? You can, but it wouldn't help you unfortunately. If you're exercising an option that's not doing what you want as the buyer, only the buyer can I forgot what you can't respond right now, which one do I look that one? Okay. As the buyer, you get to choose the seller. You don't get to choose it all. But as the buyer, if you choose to exercise an option that's not",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 91,
      "start_timestamp": "00:49:43",
      "start_timestamp_seconds": 2983.6483516483513,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=2983"
    }
  },
  {
    "text": "buyer, only the buyer can I forgot what you can't respond right now, which one do I look that one? Okay. As the buyer, you get to choose the seller. You don't get to choose it all. But as the buyer, if you choose to exercise an option that's not working, let's look at an example and go down that rabbit hole, APL again. Oh, let's use Nvidia. I haven't looked at it much since it's split. Check that out. That's super cool. 131, little baby product now. So if we, let's say we bought this call, the one throughout even better, even better, I'm going to go into on demand. So this is now taking us back in time so that we can look at an example and then kind of dissect how this goes. And what's actually even better is if I go in here and I find a time where this wouldn't work well for us. So I'm actually going to find another product that's not going up IWM as a great example. So let's go back in time to the 28th of March. And let's take a look at how this would perform down to the 19th of April. So I'm going to go back into on demand. I'm going to take us back to March 28th. I'm going to change the time to that. So you'll see this chart update. This is one of the cool things you could do. And think or swim is",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 91,
      "start_timestamp": "00:51:23",
      "start_timestamp_seconds": 3083.1032967032966,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=3083"
    }
  },
  {
    "text": "19th of April. So I'm going to go back into on demand. I'm going to take us back to March 28th. I'm going to change the time to that. So you'll see this chart update. This is one of the cool things you could do. And think or swim is kind of go back and play. It's I think especially for stuff like this, I'm hopeful that it'll better elucidate the point because one of the things I can do sometimes that's not super fair is because I can kind of like see all this stuff in my head. I know that sometimes as I'm talking about it, it's not as clear maybe as it is to me. So let's take a look at let's just say we wanted to buy a call. Now another great kind of workshop topic here. When I'm looking to buy a call, I'm going to freeze the market so it's not noise. When I'm looking to buy a call, I'm typically going to try to go further out in time, typically greater than 60 days. And I'm typically going to try to go in the money at least a little bit. Do you guys have any idea why I would do that? And if you don't know what any of that means, that's completely okay, you don't have to. Part of what I like to do when I'm talking about this stuff is surround you with the topics and concepts. And it's not all",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 91,
      "start_timestamp": "00:53:02",
      "start_timestamp_seconds": 3182.558241758242,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=3182"
    }
  },
  {
    "text": "have any idea why I would do that? And if you don't know what any of that means, that's completely okay, you don't have to. Part of what I like to do when I'm talking about this stuff is surround you with the topics and concepts. And it's not all going to make sense right out of the gate, but as you hear over time, it will start to click. So even if it's something that sounds like a different language to you, that's completely okay, just literally let it passively into your mind. So the reason why we do this is because the way that Delta behaves. Alex says, Jay says with more DTE, you would have more time to enter in the money. Yep, so that's a great, great point. So with more days to expiration, you have more time for the trade to move in your favor. Now, it to be very clear in it does not have to go in the money in order for you to make money on your long option. So if you buy a call or buy a put, the underlying does not need to go in the money in order for you to start making money. It doesn't even have to go to your strike. It just needs to move in the correct direction. And then Dennis says to reduce risk. It's a good point. Now, that's a tricky one though, because when you go further out in time, let's take",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 91,
      "start_timestamp": "00:54:42",
      "start_timestamp_seconds": 3282.0131868131866,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=3282"
    }
  },
  {
    "text": "you to start making money. It doesn't even have to go to your strike. It just needs to move in the correct direction. And then Dennis says to reduce risk. It's a good point. Now, that's a tricky one though, because when you go further out in time, let's take a look at an example. If I buy these 22 DTE IWM calls, let's say I go at the money. These two 12s are trading for like 292, something like that. If I go out to beyond 60 days, 85 days, and I go to like a 52 Delta, again, these are now trading for like 7625. So did I actually reduce risk? Kind of not because these are more expensive. So if I'm buying an option, if we buy a call, we know our max risk is defined by the premium we pay. In this case, your max risk is lower on a dollar basis because this is a lower dollar amount. In this trade, I buy it for 392. In this trade, I have to put up more money. I have to put up 762. Put this trade on. So on a dollar basis, it's more risk. Now, in terms of the dynamics of the position and holding this position, going further out in time gives your option more time to work. So in that sense, it decreases your time risk. So what I'm highlighting is when we're talking about options, it is really, really important to decouple",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 91,
      "start_timestamp": "00:56:21",
      "start_timestamp_seconds": 3381.468131868132,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=3381"
    }
  },
  {
    "text": "in terms of the dynamics of the position and holding this position, going further out in time gives your option more time to work. So in that sense, it decreases your time risk. So what I'm highlighting is when we're talking about options, it is really, really important to decouple the various types of risk that exist for us now because when you're trading something like equities, risk is pretty straightforward. You put your money in, it goes up or down. That's about as much there is to it. It's as simple as it gets. With options, we introduce again, like we talked about in the last session, a lot of complexity. We now have time risk. We need to be correct in the correct amount of time. We have volatility risk. If volatility moves unfavorably to us, it can temporarily decrease the profitability of our position, or permanently, if it stays down or up. We now have interest rate risk less applicable in most scenarios, but it's worth mentioning. It's not something you typically have to worry too much about. So Dennis, your instincts there are right on, but it's just really important to get a little more nuanced with the response. Tommy says slightly in the money less theta decay, position behaves more like shares. That's exactly it. So as soon as you go deeper in the money with a higher delta, you're going to decrease your theta decay. However, you're paying more money upfront. So you're essentially",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 91,
      "start_timestamp": "00:58:00",
      "start_timestamp_seconds": 3480.923076923077,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=3480"
    }
  },
  {
    "text": "with the response. Tommy says slightly in the money less theta decay, position behaves more like shares. That's exactly it. So as soon as you go deeper in the money with a higher delta, you're going to decrease your theta decay. However, you're paying more money upfront. So you're essentially taking two different risk profiles and modulating them to be what you want. If I go further in the money, my cost risk profile is going up. However, my theta decay profile, which is this here, we'll go down. So one of the cool parts is you can de-conflict things like theta decay by using different delta or by using different times. Because for example, 85 days to expiration, if we take a look at the theta decay for the at the money strikes, it's six cents. If we go super deep in the money all the way down to an 81 delta, it's five cents. You've decreased it by one penny. Is that worth the cost? For me, it wouldn't be at all. I don't care about that one penny in theta decay. That is completely fine. So then it's more of a scenario of, okay, this metric theta decay doesn't matter to me as much. So now, how do I feel about the cost relative to the delta? Do I think that there's going to be a really big move? If so, maybe I go something out here, it's like a 50 delta. If I think it's going",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 91,
      "start_timestamp": "00:59:40",
      "start_timestamp_seconds": 3580.3780219780215,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=3580"
    }
  },
  {
    "text": "decay doesn't matter to me as much. So now, how do I feel about the cost relative to the delta? Do I think that there's going to be a really big move? If so, maybe I go something out here, it's like a 50 delta. If I think it's going to be maybe a smaller move and I want to participate in more of it on a dollar for dollar basis, maybe I go deeper in the money and cough up the money. Don't know. But that's the cool part with options is you get to pick all of those details. So now going back to Jay's original question, let's say that we want to analyze exercising the options if things are not working in our favor. So let's say we buy these 50 DTE 212s. So they're going to cost us. I'm just going to make it 660. So it's easier to talk about. It'll cost us 660 bucks. Now let's fast forward time and we'll go out to April and I think it was kind of crappy around like the 18th of the 20th or something. Let's go out here and let's see what our option is trading for at that time. Yeah, it went way down. And we have the 212s. So what's going to happen here is you're going to see the option move super far out of the money in a way from where we're at, which is unfavorable to the long call. There it",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 91,
      "start_timestamp": "01:01:19",
      "start_timestamp_seconds": 3679.8329670329667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=3679"
    }
  },
  {
    "text": "for at that time. Yeah, it went way down. And we have the 212s. So what's going to happen here is you're going to see the option move super far out of the money in a way from where we're at, which is unfavorable to the long call. There it goes. So 212s are now way out here. So the option that we bought for 6.60 is now worth 45 cents. It's essentially completely further out of the money. So following Jay's joking, but still a good hypothesis to to to play out is well, what if we exercise the option? What you can, but a few things happen when you exercise the option one, you forego the remaining extrinsic value that you could have captured by selling the option. So if I sell the option to close the position, I capture this cost back to me. I get it back. You lost most of your option, but you still get some back. If you exercise, this is just going. The other thing is if you're a long call, it gives you the right to purchase shares at a specific price, your strike price. And in this case, we have the so I WM is now trading at 195 02. So sure, you can buy them at 212. I would want to buy a met to 12, not even close. So if you're, however, saying, well, I really don't want to take this loss and I want to hold the",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 91,
      "start_timestamp": "01:02:59",
      "start_timestamp_seconds": 3779.287912087912,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=3779"
    }
  },
  {
    "text": "the so I WM is now trading at 195 02. So sure, you can buy them at 212. I would want to buy a met to 12, not even close. So if you're, however, saying, well, I really don't want to take this loss and I want to hold the position for a long time and build a position, you can do that. But that obsession with trying to avoid losing trades is way more damaging than it's helpful. So for me, if I felt that kind of way that I really wanted to build a big position in I WM and I like it here, you can just eat this cost, recoup your extrinsic value and then just buy it at the money. You're going to lose the money here. It's gone already, but you're not essentially doubling down into something that's moving against you and then tying up capital way more capital for a longer period of time. Because again, you have to buy 100 shares at 212. So 21,200. So Jay, I know you obviously meant that partially as a joke, but that's actually why it doesn't help you at all. It does us very, very little good. Then it says less of a lottery ticket type trade, so a bit more money paid up from higher chance of profit. That is literally exactly correct. That is exactly correct. The way to think about those kinds of plays, at least the way that I trade long options,",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 91,
      "start_timestamp": "01:04:38",
      "start_timestamp_seconds": 3878.742857142857,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=3878"
    }
  },
  {
    "text": "good. Then it says less of a lottery ticket type trade, so a bit more money paid up from higher chance of profit. That is literally exactly correct. That is exactly correct. The way to think about those kinds of plays, at least the way that I trade long options, which again, big caveat. I'm kind of talking to you guys from the perspective of how I do business. There are other people who trade lots of different ways. If you listen to any of the books, Stock Market Wizards by Jack Schwager, you'll hear that everybody has a different approach. And funny enough, the way that markets are, everybody has an approach that can work for them. It's there. But what's really important is defining an approach that aligns with you as a human being. That is so freaking important. I cannot overstate it. And it's really hard to find out. It takes some time. I bring that up because again, I'm talking about the way that I think about using something like a long call. I'm using it for a leverage directional play. Other people can absolutely try to just go with yellows. They can try to go super far out of the money. They don't care if they lose 90 of 100 trades. But if those 10 trades actually are profitable enough to overwhelm those losses, then it's still profitable. Just not how I do business. So just a really important caveat. Now, when we are looking",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 91,
      "start_timestamp": "01:06:18",
      "start_timestamp_seconds": 3978.197802197802,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=3978"
    }
  },
  {
    "text": "super far out of the money. They don't care if they lose 90 of 100 trades. But if those 10 trades actually are profitable enough to overwhelm those losses, then it's still profitable. Just not how I do business. So just a really important caveat. Now, when we are looking at these different structures, which we're going to get to in a minute, you'll notice that as I'm talking about them, there's a lot, a lot of different trade-offs. And that's the cool part about options. Because for something like a ratio called diagonal, one of my go-to strategies, I often will add what I call kicker options, which is actually kind of closer to what Dennis is talking about. So sometimes if I'm really convicted in something that I think it's going to go up, let's, for whatever reason. So let's say for right now, I just think I'd be able to go up. I probably wouldn't hear yet until a little more confirmation. But let's just play the scenario. I think this is going to go up. Well, I can trade a ratio called diagonal. I can go out, let's say 90 days by my in the money option. But I'm really convicted that this thing is going to move. So what I can do on top of that is I can go a little closer in time and go further out of the money. These are cheaper options. But the way that they will behave is very",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 91,
      "start_timestamp": "01:07:57",
      "start_timestamp_seconds": 4077.6527472527473,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=4077"
    }
  },
  {
    "text": "option. But I'm really convicted that this thing is going to move. So what I can do on top of that is I can go a little closer in time and go further out of the money. These are cheaper options. But the way that they will behave is very different. Let's take a look. Let's say we buy these 2.11s. Can you do analyze trade in here? Yes. Kind of slow, but okay, great. That works. Great, great, great. And then let's take a look at this, the 92. And let's say that we get like 80 delta. Let's take a look at how this looks. So let's take a look at a couple scenarios. We think IWM is going to go up a whole bunch. Well, we can go further out in time, deeper in the money. It's going to cost us way more money in this scenario. I would be paying 1966. So 1,966 bucks. And this down here would be only 175 bucks. If I did the 21 June 21. Big difference in delta. These are a 20 delta, the 211s. The 180s are a 79.63 delta. So call it an 80 delta. So before I show you the difference between these, what can you infer if we get a price accommodation? How would these behave? And I specifically want to know which one would compound better? Which one would make more money as a gross dollar amount? Paul says, how would you have explored that",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 91,
      "start_timestamp": "01:09:37",
      "start_timestamp_seconds": 4177.107692307693,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=4177"
    }
  },
  {
    "text": "show you the difference between these, what can you infer if we get a price accommodation? How would these behave? And I specifically want to know which one would compound better? Which one would make more money as a gross dollar amount? Paul says, how would you have explored that king in the SPX curve? That would be a relative wallplay. So you can either trade the expected fade of the point or you can trade the expected rise of the surrounding walls. You could trade relative to a different time frame. In order for you to answer that question for yourself, what you would need to do is study them a little bit and see how different structures behave around it. That's the correct answer for you. Truck complaints says option with the higher delta will make more money. Okay. So far so good. Which option compounds more? Any thoughts? Do you guys know what I mean by compounds more? A lot of us. Yeah, the further out of the money, the kicker options. A truck complaint says no, that's perfect. So when I talk about compounding more, yep, Samo does exactly correct. The percent return on an invested capital. So let's take a look at these two different scenarios. Let's say that we get to these plots here. They don't. That's kind of annoying. It'll be it. Let's say we get a move to 240. At 240, our single, deep in the money option would provide a profit",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 91,
      "start_timestamp": "01:11:16",
      "start_timestamp_seconds": 4276.562637362637,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=4276"
    }
  },
  {
    "text": "capital. So let's take a look at these two different scenarios. Let's say that we get to these plots here. They don't. That's kind of annoying. It'll be it. Let's say we get a move to 240. At 240, our single, deep in the money option would provide a profit of 4124. So let's say 4124 divided by 1966. So that gives us a 209 percent return on invested capital. Really good return at 240. That's a big move, by the way. If we take a look at the further out of the money option, this option only returns 2812. However, you only put in 175 dollars. So this option returns 1607 percent. That's compounding. In this cheaper option, you will get a lower dollar return as a gross figure, but you will get if it's a big accommodating move, a much better percent compound return. That's the tradeoff. So then you get to then make a decision. You could say, well, I think there's going to be a really, really big move. So rather than putting one trade on at 1966, I'm going to go further out of the money and I'm going to put on six trades. Oops, that's wrong button. Forget what this was trading at. Let's call it 175. And in this case, we put on six. This is still cheaper than what you paid for this one option. So if you have that 175 times six, you'd be putting up a thousand and 50 bucks.",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 91,
      "start_timestamp": "01:12:56",
      "start_timestamp_seconds": 4376.017582417582,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=4376"
    }
  },
  {
    "text": "that's wrong button. Forget what this was trading at. Let's call it 175. And in this case, we put on six. This is still cheaper than what you paid for this one option. So if you have that 175 times six, you'd be putting up a thousand and 50 bucks. So this is still half the size of this position, but let's say you still get that same accommodating move to 240. Now your return is 16246. That's leverage. That is quite literally leverage at play. Paul says, I can't see the entire strategy. What strategy you talk about? You talk about here? You can see the whole thing. Yeah, this is all there is to it. Are you talking about the SPX stuff? The SPX stuff is a whole different ballgame. We can absolutely talk about that a little bit more in another session, but I think getting into a ball relative place because the other thing, if you start doing stuff like that, you have to get more sophisticated with the approach to isolate the volatility. So you have to do things like Gamahedge and that opens up a completely completely different dialogue. It's cool stuff, but not so fitting at least for this dialogue. So anyways, back to this. If we take a look at the compounding potential for these cheaper, further out of the money options, it's much bigger. And if you put on same size positions, you can make way more money. But again, you",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 91,
      "start_timestamp": "01:14:35",
      "start_timestamp_seconds": 4475.472527472528,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=4475"
    }
  },
  {
    "text": "so fitting at least for this dialogue. So anyways, back to this. If we take a look at the compounding potential for these cheaper, further out of the money options, it's much bigger. And if you put on same size positions, you can make way more money. But again, you need a bigger move in order for these to pay you out as much as what you can make on a dollar for dollar basis with deeper in the money options. Truck Complain says, what are the drawbacks about doing more out of the money options first, less in the money options apart from lower chance of profit? I just said another component to it. Can you guys take a guess at what it is? Right now, we're using a scenario where essentially we're presuming IWM goes from 195 all the way up to 240. Shrey says higher chance of loss. Yep, well, I guess that's kind of the inverse of probably profit. Yep, okay, Shrey J is on it like white on rice. That's a massive, massive point. So if we take a look at theta decay, this option is losing five cents a day. If we go to the 60 day and we look at theta decay, this option is using four cents a day. So you might be saying, well, wait a minute, this is losing more, oh, five cents. This is losing five cents. So why, like, what's going on here? Why would this not be",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 91,
      "start_timestamp": "01:16:14",
      "start_timestamp_seconds": 4574.927472527472,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=4574"
    }
  },
  {
    "text": "the 60 day and we look at theta decay, this option is using four cents a day. So you might be saying, well, wait a minute, this is losing more, oh, five cents. This is losing five cents. So why, like, what's going on here? Why would this not be the optimal answer? Well, look at it as a percentage relative to the premium of the option. This is losing five cents on something that again, we got into for 1966. If we look at this, this is losing four cents on something that has a 1.75 left to go. As a percentage, the theta decay here is massive. So you are bleeding heavily. And this is already going 64 days out, which again, most people don't do when they're buying options. They're really cheap. When most people are buying options, they're going like same week, maybe two weeks if they're slightly patient. And if we take a look at that profile and we look at again, like a 20 delta out of the money option, this thing is worth 90 cents. And it's losing nine cents a day. It's decaying at a massive relative rate to the premium that's there. So that's the other reason. The other thing is you need a big move. You need a big accommodating move in order to start seeing your money. If you see a small move, even with a larger position, unless the delta's are the same aggregate size, it doesn't matter.",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 91,
      "start_timestamp": "01:17:54",
      "start_timestamp_seconds": 4674.3824175824175,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=4674"
    }
  },
  {
    "text": "there. So that's the other reason. The other thing is you need a big move. You need a big accommodating move in order to start seeing your money. If you see a small move, even with a larger position, unless the delta's are the same aggregate size, it doesn't matter. What I mean by that is again, if we're looking at this further out in time, this is 80 delta's right at the time you put the trade on, you get your 80 delta's. If we go to something like two weeks out and we go to this super far out of the money, let's say these 14 delta's, unless you put on the commensurate size that would equal 80 delta's here, then you don't see the same short term price appreciation if you don't get a big move. It means you really need these to compound via gamma and start seeing an actual return on the capital that's meaningful. It's a great question. It's exactly the kind of stuff you guys should be looking at. So I'm glad that you asked that. And then this one, I think we talked about this one already, closing positions, spider open, sell the closed, sell the open by the close, essentially just inversing. Now with options, we can talk about the different scenarios that can happen for an unwind. So you can close the contracts. That's kind of what most people tend to do. It's typically a little bit more efficient. You",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 91,
      "start_timestamp": "01:19:33",
      "start_timestamp_seconds": 4773.837362637362,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=4773"
    }
  },
  {
    "text": "the closed, sell the open by the close, essentially just inversing. Now with options, we can talk about the different scenarios that can happen for an unwind. So you can close the contracts. That's kind of what most people tend to do. It's typically a little bit more efficient. You can choose to exercise if you're the buyer, which as we talked about, you give up the remaining extrinsic value. And then either you would buy or sell shares at the strike price, if it's a caller put respectively. And if you're a seller, you could choose to hold it all the way through expiration. You could do that as a buyer as well. But it's typically not advantageous for a buyer to take something all the way into expiration. Because if you have something that's really far out of the money, let's say in IWM, let's actually pull up like the real market now because we're on expiration Friday. So let's say you have these options that expire in three days. And let's say that you had these 196s. So and let's say you bought these puts, they have a really low probability of being in the money at expiration less than 50. I'm even of a touch, sorry, to be super clear. These have a low probability of being touched of 32 and being in the money is 16.04. So low probability trade here. You could as the buyer of these options say, okay, this didn't move in",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 91,
      "start_timestamp": "01:21:13",
      "start_timestamp_seconds": 4873.292307692307,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=4873"
    }
  },
  {
    "text": "expiration less than 50. I'm even of a touch, sorry, to be super clear. These have a low probability of being touched of 32 and being in the money is 16.04. So low probability trade here. You could as the buyer of these options say, okay, this didn't move in my favor, rather than hold it to expiration on hope EM. And maybe this thing will work out. You can just close a position and you can at least recoup some of your costs. Those kinds of decisions have to be defined ahead of time. You cannot make them up on the fly. You cannot. The reason why you cannot make them up on the fly is because you cannot think of any one trade as kind of your book, the end all be all. Everything you do as a trader should be viewed in the performance of a long-term system. So if in this individual scenario, you're like, okay, I want my 25 bucks back. I'm going to buy them back or sell them out so I can recoup the cost. So you do that. Then in that scenario, you got your money. Then in another scenario, you do something else. And then another scenario, you do something else. You now have no idea what actually works for the strategy as a whole over the long run. It's another really common mistake traders have is they get way, way to wrapped up in the outcome of an individual trade",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 91,
      "start_timestamp": "01:22:52",
      "start_timestamp_seconds": 4972.747252747253,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=4972"
    }
  },
  {
    "text": "something else. And then another scenario, you do something else. You now have no idea what actually works for the strategy as a whole over the long run. It's another really common mistake traders have is they get way, way to wrapped up in the outcome of an individual trade and trying to maximize their profit in an individual trade. And it's a massive mistake. I cannot overemphasize hopefully based on how dramatic I'm talking, but I really do mean it. It's a massive, massive mistake. Cool. What else do we got in this old deck? Huh? We already talked about this one. Let's talk about volatility. I think this is a new one. So we talked a bit about volatility last time and how it's kind of the big unknown with options. It's the one part that we're using to price options really. That's why a lot of times you'll hear season trader. They're not even talking about if I bought to open the 184 or something like that, you'll hear them say things like, oh, I bought 31 vols. And it's because that's really what we're trading as option traders, whether or not you fully recognize it. So there are different kinds of volatility. I think we talked about some of this last time. Oh, sorry, correct me if I'm wrong, but there's a bunch of different kinds of volatility, especially in the realized volatility side of space, you can have realized historic future realized. You don't have",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 91,
      "start_timestamp": "01:24:32",
      "start_timestamp_seconds": 5072.202197802198,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=5072"
    }
  },
  {
    "text": "there are different kinds of volatility. I think we talked about some of this last time. Oh, sorry, correct me if I'm wrong, but there's a bunch of different kinds of volatility, especially in the realized volatility side of space, you can have realized historic future realized. You don't have to worry about any of that stuff. These are kind of the main volatilities for a new trader to be concerned within the beginning. Forecast implied statistical or historical, we normally would refer to it as HV historical volatility. I guess I can add that here and make it easier HV. Maybe there you go. Most of the time, retail is not doing this, but this is what I was talking about before in terms of figuring out how to price these options. Most of the time retail is doing this, where we're looking at a current option price. And because we know all the other variables, we can imply what the volatility is. That's why it's called implied volatility. We're essentially using the black sholes, Martin model. And that's a really easy way to derive volatility from current pricing. And then there's historical volatility. This is looking backwards in time. So if we look at IWM, you'll notice there's a bunch of different volatilities. Well, you might not, but there is. And I'll show them to you. We have different volatilities for each expiration. So these 19 July's have 20 vol 20.8. These 18 June's have 17.9. Really important.",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 91,
      "start_timestamp": "01:26:11",
      "start_timestamp_seconds": 5171.657142857142,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=5171"
    }
  },
  {
    "text": "time. So if we look at IWM, you'll notice there's a bunch of different volatilities. Well, you might not, but there is. And I'll show them to you. We have different volatilities for each expiration. So these 19 July's have 20 vol 20.8. These 18 June's have 17.9. Really important. No. Notice what happens in general as you go further out in time. What happens to the volatility? Does it get higher or lower as you go further out in time? I have to be honest, as I'm doing this, I'm drinking this lime spend drift. And this one is not as good. I like the raspberry one way better. I am unable to proceed until somebody lets me know because otherwise I'll be confused for the rest of the session. If we go further out in time in general, does volatility increase or decrease? Loaf, you are our savior. The motive is flat. That's actually incorrect. It's a good guess, but it's actually incorrect. Dennis says it depends. That's actually the most correct answer, if we're being honest. But in general, that is correct. The most accurate answer is it depends in the general sense. Loaf was right on the money. The reason why it increases in general and even though there's pockets where it goes up and down, if you were to plot a line of best fit, it still would go up. And the reason for that is think of it this way. How much the motive",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 91,
      "start_timestamp": "01:27:51",
      "start_timestamp_seconds": 5271.112087912088,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=5271"
    }
  },
  {
    "text": "the money. The reason why it increases in general and even though there's pockets where it goes up and down, if you were to plot a line of best fit, it still would go up. And the reason for that is think of it this way. How much the motive says, are we talking about the ticker on the screen? Sure. It doesn't matter. It's essentially universal. Even with something like GameStop that will have a bit of a different smile with this near term volatility than contracting down. As this near term vol bleeds out, this will eventually revert again, eventually. So this is, I wouldn't use like anomalous circumstances as like the base of a theme or a thesis. Andre is also exactly correct. The reason why volatility gets higher as you go further out in time is because more shit can happen. That's really what it boils down to. Now on a relative basis, you can absolutely have periods where it's high here, lower here, high here, and you'll normally see that in shorter term time frames. But you can also see those kinds of pockets out here. This is relatively high. These 21.3s versus these 21.3 ones versus this 28.82, which is in the middle of those. And again, that's a tradable. This is a tradable thing right here. The vol for this expiration is much lower compared to its surrounding constituents. So you could absolutely trade the expansion of vol here against the contraction of",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 91,
      "start_timestamp": "01:29:30",
      "start_timestamp_seconds": 5370.567032967033,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=5370"
    }
  },
  {
    "text": "ones versus this 28.82, which is in the middle of those. And again, that's a tradable. This is a tradable thing right here. The vol for this expiration is much lower compared to its surrounding constituents. So you could absolutely trade the expansion of vol here against the contraction of vol here as a payers trade, or you could trade the expansion of vol here by itself. All of those are completely reasonable positions in this scenario. But that's the reason why in general, you'll see it increasing as you go further out in time, which is an important thing to know because then when you see things like this, this identifies an opportunity for us. It's different. We know it's different. Same thing here. 22.05 compared to 21.82, 21.91. Sometimes you'll see that change involved because there's a very good reason. There could be some sort of, yep, Jay is Jay. My man, you are right on it, brother. That's exactly correct. Do these predictions account for events like elections, earnings, fed, and baseline DTE that is exactly correct. Kill it literally. Kill a job. It's exactly correct. So volatility is very smart. And we can use it again to identify opportunities within the market. Sometimes there's a very good reason why the volatility will be different. Sometimes there might not be as good of a reason. But it still provides another relative value trade. So Jay, absolutely great job there. That's expiration volatility. Now if we go into",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 91,
      "start_timestamp": "01:31:10",
      "start_timestamp_seconds": 5470.021978021978,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=5470"
    }
  },
  {
    "text": "to identify opportunities within the market. Sometimes there's a very good reason why the volatility will be different. Sometimes there might not be as good of a reason. But it still provides another relative value trade. So Jay, absolutely great job there. That's expiration volatility. Now if we go into the strike, you'll notice we also have implied volatility for every single strike. Each strike gets its own vault. The other thing you'll notice is that if we look at the underlying itself, you'll see that there is implied volatility. The underlying itself also has its own vault. So there's these different measures of volatility across different places. It actually creates what we refer to as a volatility surface. And it's kind of like a 3D model. I don't want to do 3D with my hands, maybe something like that. And it has essentially volatility charted across different days to expiration, across different strike prices. And it lets you visualize any areas that might be slightly elevated relative to others slightly lower. But volatility is very informative for us. So, volatility is also something you can trade directly, which I actually think we spent quite a bit of time on, actually. What did I just do that move this? Oh, I added, I was like, why is this now overlapping? It didn't be there. Now the other thing you can do is assess volatility relative to itself in individual products. And we looked at this last time. So I think",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 91,
      "start_timestamp": "01:32:49",
      "start_timestamp_seconds": 5569.476923076923,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=5569"
    }
  },
  {
    "text": "actually. What did I just do that move this? Oh, I added, I was like, why is this now overlapping? It didn't be there. Now the other thing you can do is assess volatility relative to itself in individual products. And we looked at this last time. So I think we can brush over that point for here. This is looking at volatility a little more zoomed in. We talked about the Greeks last time. This, I don't think I showed to you guys last time I added it in. I'm pretty sure afterwards. But this shows you the behavior of kind of some of the primary Greeks. I don't have row in here, because it really doesn't matter that much. And how some of these Greeks behave with respect to things like strike price, delta, and time. So a couple notes here, really high level. For days to expiration, you'll notice that theta decay, then amount of extrinsic value, kind of the inverse, how much decays out of extrinsic value. theta decay really starts to accelerate as we close within 60 days. This is actually why I typically will buy options outside of 60 days. Now there's drawbacks to that. If you get a big move in it, you're at a low delta. You're not going to see as much of a move because of gamma. Gamma is higher as we get low. So let's take a look. If we take a look at gamma out here for an",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 91,
      "start_timestamp": "01:34:28",
      "start_timestamp_seconds": 5668.931868131868,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=5668"
    }
  },
  {
    "text": "that. If you get a big move in it, you're at a low delta. You're not going to see as much of a move because of gamma. Gamma is higher as we get low. So let's take a look. If we take a look at gamma out here for an at the money option 30 days out, it's 0.3 gamma. And if we go four days out and we go to the same out of the money option, it's 0.11 much, much higher. Why is that the case? Because every single option that is coming up on expiration, which is perfect. We have an expiration here. Every single option has to make a choice. Either it's going to be in the money and have a delta of one, or it's going to be out of the money and have a delta of zero. Gamma assesses the rate of change of delta. So as we get closer to expiration, gamma is going to get jacked up because all of these options have to make that choice. So delta is going to be approximating to either a one or a zero in the money and out of the money respectively. So that's why it's slightly elevated, well, it gets steeply elevated as we get closer in time. So the punchline here is you have to spend some time getting familiar with the Greeks because it's not so much the Greeks don't help you. The Greeks don't hurt you. The Greeks don't give",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 91,
      "start_timestamp": "01:36:08",
      "start_timestamp_seconds": 5768.386813186812,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=5768"
    }
  },
  {
    "text": "why it's slightly elevated, well, it gets steeply elevated as we get closer in time. So the punchline here is you have to spend some time getting familiar with the Greeks because it's not so much the Greeks don't help you. The Greeks don't hurt you. The Greeks don't give a shit about you. But they help you inform, make an informed decision on what kind of position you're going to put on and what kind of risk-reward profile you want that position to have. That's exactly why understanding the Greeks is super, super important. There's no superpower within the Greeks. It's not going to save you from, you know, losing a bunch of money if your strategy has no edge. The Greeks are not going to do any of that for you. People, I think, have this really weird perception of the Greeks and it's not like the Greek gods. They're just the Greeks. And fun fact actually, some of these aren't even actually Greek. We just call them the Greeks. Anyways, if you have any questions on these, let me know, because this kind of stuff is actually really important, but it's something that you have to spend some time looking at. One of the recommendations I would have for you is to go through an options chain and open up an Excel sheet and literally take a look at at least delta gamma theta Vega and look at them across four different explorations. That's plenty. That will",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 91,
      "start_timestamp": "01:37:47",
      "start_timestamp_seconds": 5867.841758241758,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=5867"
    }
  },
  {
    "text": "some time looking at. One of the recommendations I would have for you is to go through an options chain and open up an Excel sheet and literally take a look at at least delta gamma theta Vega and look at them across four different explorations. That's plenty. That will give you a pretty good idea of how they behave and it will become very informative to you. So I think that's a really, really good exercise to go through. This already showed to you guys. Okay, so this I think I added this is a ton of different option structures and a quick recap of what they are. I think I showed you guys these already, but then did I show you guys these? I might have, but then I also add the P and all graph for them. So I'll kind of flip through the, oh, it's Africa. This is a video. I'm so stupid sometimes. I was going to say I'll flip through kind of slowly. You could take a screenshot, but newsflash, this is a video. So you literally can go back at any point in time. I'm not going to linger on any of these for too long unless there's one that you're interested in. We learned about long calls before, which is essentially we want something to go up. Now, as we saw before, you don't actually need it to go up to your long strike. Super, super important. You just need to go",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 91,
      "start_timestamp": "01:39:27",
      "start_timestamp_seconds": 5967.296703296703,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=5967"
    }
  },
  {
    "text": "for too long unless there's one that you're interested in. We learned about long calls before, which is essentially we want something to go up. Now, as we saw before, you don't actually need it to go up to your long strike. Super, super important. You just need to go up for a short call. You want something to go down. And essentially, you have a little bit of extra room on a short call. Now, this is also one of the reasons why I highly, yeah, you can see it. I highly recommend that book options as a strategic investment because it breaks down all of these. And I'm sure you can get it from Investopedia as well, like what the break evens are and stuff like that. It's all good to know. But across all of them, let's just use these calls and puts or calls for an example real quick. Let's buy this one. We can get rid of all these other sample trades. And then let's sell this one as well. And then we'll take a look at some different scenarios. The first thing. Notice these two different lines. It's important to understand the difference between these. This purple line is today. The blue line is at expiration. Very important to differentiate these. The reason why it's so important to differentiate is because options decay over time. So as time passes, this purple line will approximate to the blue line. So let's say, for example, we",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 91,
      "start_timestamp": "01:41:06",
      "start_timestamp_seconds": 6066.751648351647,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=6066"
    }
  },
  {
    "text": "these. This purple line is today. The blue line is at expiration. Very important to differentiate these. The reason why it's so important to differentiate is because options decay over time. So as time passes, this purple line will approximate to the blue line. So let's say, for example, we get a really small move. And let's say IWM goes up to 253. In that here, you would make 112. But if it doesn't move again and it stays there and you continue to hold it, this purple line would approximate to this blue line. So you actually your profit would then decay away into nothing. And you would have a losing position at this point. The notice says, where can I find the Greek behavior charts need a poster for my wall? Yeah. You can grab a screenshot from that one I flashed up earlier. For the Patreon members, I give them that one that I made in Excel. Or I think it's a Google sheet just so that they can have as a reference. But yeah, I mean, I think this is the, this is the way to live your life. Just let everybody know that you worship the Greeks. Oh, yeah. The other thing I want to highlight though is when we're buying single options and it doesn't really matter if it's single, which is kind of easier to start with singles. When you're buying a call, your break even price is your strike price plus the",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 91,
      "start_timestamp": "01:42:46",
      "start_timestamp_seconds": 6166.206593406593,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=6166"
    }
  },
  {
    "text": "the Greeks. Oh, yeah. The other thing I want to highlight though is when we're buying single options and it doesn't really matter if it's single, which is kind of easier to start with singles. When you're buying a call, your break even price is your strike price plus the premium you pay. When you buy a put, it's strike less break even price. The reason being is you have to think of it moving in the direction that you want. Now, Samoah says meant the four visuals. Oh, I already told you dog, that's for you to make. There's, there's a reason why I don't give you guys every component out there. It's because I cannot overemphasize how valuable I think going through the exercises are. So for you, Samoah, if you want to use a screenshot as like a reference, that's, that's completely cool, completely cool. But you should make your own. Like you absolutely should make your own. It's an annoying process. But this is, this is the world of trading. If doing stuff like this is super off-putting, trading is not going to be a good fit because it's a lot of small little due diligence work like this. And what I can promise you is if you go through that exercise, you will have a much, much deeper relationship with those Greeks. Then if you just grab a screenshot from somewhere else and print it out, hands down, I guarantee it. So anyways, back to",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 91,
      "start_timestamp": "01:44:25",
      "start_timestamp_seconds": 6265.661538461538,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=6265"
    }
  },
  {
    "text": "work like this. And what I can promise you is if you go through that exercise, you will have a much, much deeper relationship with those Greeks. Then if you just grab a screenshot from somewhere else and print it out, hands down, I guarantee it. So anyways, back to this. If we take a look at the 199 calls and the strike price here, actually let's pick something that's further out of the money for the example. Let's say you picked the two tens. I'm going to unlock this price. So right now in this scenario, IWM is trading for 198. Fiddy. And our strike price on the calls 210. I already told you it doesn't need to go to your strike price in order to make money. The 210 strike is right here. At 210, you would be making money for sure. But notice that you actually start making money as soon as it starts moving in your direction. So it can go from 198. Fiddy to 200. And you're up 33 bucks. Now you are fighting theta decay. As time passes, this purple line is going to approximate to the blue line, but you're up money already. It's just another common really common misconception for long options. You don't need the underlying to go to your strike. That's just the ideal scenario, actually, to go above your strike or below your strike if it's a long put. But it doesn't have to get there in order for",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 91,
      "start_timestamp": "01:46:05",
      "start_timestamp_seconds": 6365.116483516484,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=6365"
    }
  },
  {
    "text": "It's just another common really common misconception for long options. You don't need the underlying to go to your strike. That's just the ideal scenario, actually, to go above your strike or below your strike if it's a long put. But it doesn't have to get there in order for you to make money. Because remember, you can always trade the option. Now if we take a look at short options, this one for an example is a short call. Your break even is slightly different because you collect money upfront. So because we collect that credit when we sell to open, you actually have a little bit of a buffer in your position. So in this case, we're short the 199 call. That means we want IWM. Oh man, I just realized what I did. We can't use IWM for this. I'm not saying you're trying to talk about shorting IWM. Let's use hood. Fuck Robin Hood. Yeah, this is better. This is better for everybody. I think I can't believe you guys were about to let me commit sacrilege there. That was about to be pretty messed up. All right. So now that we're fading Robin Hood, which is completely okay and always on the table. Look at this falling down from that cliff. Die. I hope it just crashes. And we're short now the 22 call, which is right here. Right now Robin Hood somehow magically is above 22 and it's at 2243. We actually want it",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 91,
      "start_timestamp": "01:47:44",
      "start_timestamp_seconds": 6464.571428571428,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=6464"
    }
  },
  {
    "text": "is completely okay and always on the table. Look at this falling down from that cliff. Die. I hope it just crashes. And we're short now the 22 call, which is right here. Right now Robin Hood somehow magically is above 22 and it's at 2243. We actually want it below this, but notice where our break even is all the way out here at 2288. So in this case, it is really, really important when you are selling credits. You have the benefit of receiving a small buffer. If you're buying things, you need things to move enough to cover the cost of whatever you paid in the direction you want. That's quite literally the easiest way to think about break even calculations. If you're selling things, you get a pad against the direction you don't want it to go. So again, if we're selling a call, we want this to go down. Of course, it's Robin Hood. We always want it to go down. But if it doesn't go down, you still get a pad equivalent to the credit you receive. So in this case, it can go against you, meaning up, God forbid, for Robin Hood, you can go up all the way to 2288 and you would still be at your break even. But again, this is at expiration. So your option would be showing a loss until it gets closer to expiration. So if you take a look in this bottom left corner over here,",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 91,
      "start_timestamp": "01:49:24",
      "start_timestamp_seconds": 6564.026373626373,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=6564"
    }
  },
  {
    "text": "can go up all the way to 2288 and you would still be at your break even. But again, this is at expiration. So your option would be showing a loss until it gets closer to expiration. So if you take a look in this bottom left corner over here, you'll see the two different dates and then you'll see the two different prices. So let's say Robin Hood rallied and it goes up to again, 2288. If you held that all the way to expiration, it would be break even. But until then, it would first show a loss of down 3246. And then as time passes, again, this purple line approximates to the blue line. So, Moda says, do I need to understand calculations? Yeah, I think you do for these. These are fundamental enough that it's important to know. And again, it's quite literally as simple as I kind of outlined it before. If you're entering a trade via a debit or verticals and stuff like that, you need something to move in your favor plus the debit. If you've sold an option, you get a buffer against you strike with the premium, whether it's a caller putt depends on whether you add or sell it. That's the way I think about it. For other strategies like butterflies and stuff like that, it's different, right? Because they have completely different risk profiles, which you'll see in a second. But for the directional stuff that will essentially carry",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 91,
      "start_timestamp": "01:51:03",
      "start_timestamp_seconds": 6663.481318681319,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=6663"
    }
  },
  {
    "text": "putt depends on whether you add or sell it. That's the way I think about it. For other strategies like butterflies and stuff like that, it's different, right? Because they have completely different risk profiles, which you'll see in a second. But for the directional stuff that will essentially carry you through pretty carefully. So these are now long puts, short puts. This is incorrect. Elite. So if we take a look at a short put, just to just to get us right, let me go here to spy. And let's take a peak at like this 30 delta short put and a live trade. So a short put is a bullish trade. I think I probably just forgot to swap it out. I'll add this one in for us now. So the short put, we want it to go up. And I think in this scenario, I probably just forgot to switch it. But here you go. Long put, we want stuff to go down. Short put, we want it to go up. Calculating the break evens is the same process for the calls. Long put, you needed to go in your direction plus the W paid at expiration or put you get a buffer if it moves against you, which would be down. Any questions on these single options to start. Long calls, short calls, long puts, short puts. And while you're ruminating on that, I'm just going to let the dog out super fast. He was very",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 91,
      "start_timestamp": "01:52:42",
      "start_timestamp_seconds": 6762.936263736264,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=6762"
    }
  },
  {
    "text": "or put you get a buffer if it moves against you, which would be down. Any questions on these single options to start. Long calls, short calls, long puts, short puts. And while you're ruminating on that, I'm just going to let the dog out super fast. He was very excited to see what movements were going on out there. So what it says, I meant calculus in order to make the four visuals on the green charts. No, no, no, no, no. So that calculus that you're referring to that literally just helps you understand the way that the Greeks behave. But think about what you're doing, right? Think about the process I'm kind of somewhat forcing you to do, I guess. Is if we take a look at spy and let's say that you come into again, those three or four explorations, let's say that you go out a week and you go out to 21 June. And you literally just create a Google sheet with these columns, delta, gamma, theta, Vega, and just pick a handful of strikes, pick like a 50 delta, 75 delta, a one delta, same thing to the other direction. And then just write the numbers down and say, and then literally you can plot them, right? Because you're inputting the data directly from the the options chain. Andre says, how do you make a long put to short the stock? The motor says, okay, I thought the variance would screw it up.",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 91,
      "start_timestamp": "01:54:22",
      "start_timestamp_seconds": 6862.391208791209,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=6862"
    }
  },
  {
    "text": "write the numbers down and say, and then literally you can plot them, right? Because you're inputting the data directly from the the options chain. Andre says, how do you make a long put to short the stock? The motor says, okay, I thought the variance would screw it up. Oh, it definitely will. You need to try to, you need to normalize to some sort of, you need to normalize to something. So like, you can anchor off of delta. That's a really easy anchor point. So then you can reference everything relative to delta. That's why those charts have slightly different configurations. Because if it's isolated off of delta, off of time, there's difference between those. Andre says, how do you make a long put to short the stock? Yeah, great question. So if I want to buy a put to trade something to the downside, kind of similar rules I follow as compared to buying options, buying options is simple. I normally will go beyond 60 days, at least if it's a shorter term thesis, you can creep it in a little bit. But again, if you remember actually that graph that we're kind of referring to right now, you don't want to creep it in too far because then you're going to start losing theta to case super, super fast. So maybe we go out to this 63 16 August. And the delta selection is literally the same process with respect to if we go in",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 91,
      "start_timestamp": "01:56:01",
      "start_timestamp_seconds": 6961.846153846154,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=6961"
    }
  },
  {
    "text": "right now, you don't want to creep it in too far because then you're going to start losing theta to case super, super fast. So maybe we go out to this 63 16 August. And the delta selection is literally the same process with respect to if we go in the money at a higher delta out of the money. That's all completely predicated on how big of a move we think we're going to get. So let's say that we go kind of right at the money, something like this, the 545s. So in this case, literally you can hit buyer sell. It kind of doesn't matter. It just changes the interface when it pops up. But in this case, you can hit buy. I always would go for the midpoint at least to start. So it's a slightly more favorable price to you. And then you launch that order. Now you would essentially have a position with this risk profile. You would want it to go down. And you need to have risk management in place for the strategy. So whatever risk management you tend to apply to stuff like this for directional trading for me personally, it's generally predicated off of some sort of technical analysis. So let's say using spy. Let's say I wanted to fade this to the downside, which I probably wouldn't hear. But let's say I did. Then I would essentially set some sort of stop on the chart that makes sense based",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 91,
      "start_timestamp": "01:57:41",
      "start_timestamp_seconds": 7061.301098901099,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=7061"
    }
  },
  {
    "text": "generally predicated off of some sort of technical analysis. So let's say using spy. Let's say I wanted to fade this to the downside, which I probably wouldn't hear. But let's say I did. Then I would essentially set some sort of stop on the chart that makes sense based on the way that I'm analyzing the chart. And if it hits that stop, I would use that as my point to enter the trade or exit the trade. Sorry. But that's essentially a cliff notes version on how to open a long put to trade a stock to the downside. And let's get back to this. So single options. These are vertical spreads. I don't trade them too much, but there's nothing wrong with them for a newer trader. It's just nothing that I would want to get stuck on for too long. They're difficult to make money on. But you'll notice that they have the similar profit zone as its single option counterpart. So long call spread versus a long call. But it adds a leg to define the risk. So it also decreases the amount of capital that you need. Andre says, if you're scalping, would you go one week out? No. And again, scalping is really important to define because retail traders typically don't scalp algos or scalping, meaning moving super, super fast retail traders, typically or day trading, but going with the colloquial use of scalping totally cool. But if I'm trading something intraday, I'm",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 91,
      "start_timestamp": "01:59:20",
      "start_timestamp_seconds": 7160.756043956043,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=7160"
    }
  },
  {
    "text": "go one week out? No. And again, scalping is really important to define because retail traders typically don't scalp algos or scalping, meaning moving super, super fast retail traders, typically or day trading, but going with the colloquial use of scalping totally cool. But if I'm trading something intraday, I'm not going to go out a week. That's way too long. I might and if it's not something I'm planning on holding for multiple days, I might literally trade that same day. But I rarely will try to scalp options. I will have intraday trades, but I think people think scalping is a lower risk, higher probability way of making trades, but realistically, it's just a way for retail traders to more or less get screwed over because you're transacting so frequently in such a high friction environment, meaning it's very expensive for retail to trade more. So then you probably realize that it's very difficult to make a bunch of money that way. So it's not my go to personally. There might be another, again, that's me, right? So there might be other entities that are super, super successful doing that. And I would probably tap into them a little bit more so than me. It's just very different than what I do. I trade every day and I trade things intraday, but that's not my primary go to at all. But verticals kind of same thing to downside. These are straddles and strangles. So the way to think",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 91,
      "start_timestamp": "02:01:00",
      "start_timestamp_seconds": 7260.210989010989,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=7260"
    }
  },
  {
    "text": "little bit more so than me. It's just very different than what I do. I trade every day and I trade things intraday, but that's not my primary go to at all. But verticals kind of same thing to downside. These are straddles and strangles. So the way to think about straddles and strangles, they're more specific to attempting to trade volatility. So what we want to see is different expressions of volatility specifically for straddles, which is if we're long as straddle, as you can tell, we don't care which way it moves. We just want it to move in a direction, not chop around right in the middle and not go anywhere. So this is a volatility play an expansion because remember, volatility is just an expression of movement. How much does something move? It's variance that's time bound for a short straddle. As you can imagine, it's the exact inverse. We want something to stay within a range in this scenario. We are betting that volatility implied will be higher than realized volatility, meaning it won't move as much. And then strangles are essentially the same slightly different structure as you could tell it's less of a pinpoint and it kind of has this tabletop surface to it. That's because rather than going at the money for both strikes, you're now going to out of the money. The motive says if you express the straddle in a way other than BTO put in call, do you still",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 91,
      "start_timestamp": "02:02:39",
      "start_timestamp_seconds": 7359.6659340659335,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=7359"
    }
  },
  {
    "text": "pinpoint and it kind of has this tabletop surface to it. That's because rather than going at the money for both strikes, you're now going to out of the money. The motive says if you express the straddle in a way other than BTO put in call, do you still call it a straddle? Could you give me an example of what you mean? You can have a long straddle or a short straddle. Long straddle is if you buy the at the money, same strike, put in call. The short straddle is if you sell the at the money, same strike, put in call. Technically, you could do it at a different strike, but it's most often done at the money. Let me know if that answers if you have a different question there. So the way to think about long straddles, long strangles is you want something to move, and then short straddles, short strangles, you want something to stay relatively put. Now, these are essentially the risk-defined versions of straddles and strangles, just like I showed you long call, long put, short call, short put, and then vertical spreads. It's kind of the same thing that I'm doing here. So this is adding legs to straddles and strangles when we go to iron butterflies and iron condors. The names are terrible. They're all supernabulous. You get a feel for them over time. That's why I put it in like a little chart here to make it easier",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 91,
      "start_timestamp": "02:04:19",
      "start_timestamp_seconds": 7459.120879120878,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=7459"
    }
  },
  {
    "text": "doing here. So this is adding legs to straddles and strangles when we go to iron butterflies and iron condors. The names are terrible. They're all supernabulous. You get a feel for them over time. That's why I put it in like a little chart here to make it easier to understand. But as you can see for something like a butterfly, again, you just want it to move. And for a short iron butterfly, you just don't want it to move. This is a straddle that has wings purchased. And then if you look at an iron condor, it's the same thing. You just want the thing to move either direction, but it will have defined risk as well these. For the short iron condor, you just want it to stay put within a range, but you're buying the wings. And then these are kind of my personal strategies. These are my go-to's. So the vast majority of the time I'm trading, it is something from here. The overwhelming majority of what I do is in here. So I add the payoff diagrams for all of these so that you have a sense of how these work. So, notice says, long shares at a profit by puts at a strike above your basis, above your share count, at a quantity above your share count. In 700 shares at 20, I'm super confused. That just looks like a protective put. But if your long shares in buying a put, it's",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 91,
      "start_timestamp": "02:05:58",
      "start_timestamp_seconds": 7558.575824175824,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=7558"
    }
  },
  {
    "text": "says, long shares at a profit by puts at a strike above your basis, above your share count, at a quantity above your share count. In 700 shares at 20, I'm super confused. That just looks like a protective put. But if your long shares in buying a put, it's just a protective put. That's not a straddle. Yeah, what you're showing there is a type of protective put. And then, the motive says, but it's uncapped downside. Yeah, it doesn't mean that your hedge one to one. So if you're saying that you're buying the put above your share count, I mean, let's look at an example. So if we take a look at what did you say? Your long 700 shares. So we buy 700. Lies. Get red. Get red. And then you bought something that was like 20 on a line. Oh, yeah, I see what you mean. It looks the same one model. Yeah, definitely. So the reason why it looks the same is because they're essentially synthetics, depending on what Delta it is, right? A long call is going to look just like long shares. So if I grab this 50 delta long call and we add it, it's synthetically the same thing. The difference is it will have cap downside because it's a long call, but it'll have the same overall slope as long shares. Now if you're adding short puts, then it becomes synthetically the same thing. Okay, call it a synthetic straddle.",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 91,
      "start_timestamp": "02:07:38",
      "start_timestamp_seconds": 7658.030769230769,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=7658"
    }
  },
  {
    "text": "we add it, it's synthetically the same thing. The difference is it will have cap downside because it's a long call, but it'll have the same overall slope as long shares. Now if you're adding short puts, then it becomes synthetically the same thing. Okay, call it a synthetic straddle. No, no, no, no, I wouldn't call it a synthetic straddle at all. It's not a synthetic straddle. I literally just call it a, it's a just protective put. So even though in your scenario, you still have downside risk, it will decrease your downside risk. So in your example, you had something you're saying the 20 underlying was at 25. So in this example, we would have already bought spy, which is trading at 25.42. Let's say we got it cheaper to follow along with your scenario and we're in the profit. So let's say instead of getting it at 5.42, we got it at 5.35. Like that. And then you're saying we bought to open 10 of the, the money puts. So which would be the current price. So these, they'll buy these and we'll buy 10. And we take a look. So in this case, you're essentially creating a position that you have a really small risk here, but the reason why it's a protective put is because it's taking the risk off of your long shares. So if this goes down in this scenario because you're, you're adding more puts, you actually have profit potential if",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 91,
      "start_timestamp": "02:09:17",
      "start_timestamp_seconds": 7757.485714285714,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=7757"
    }
  },
  {
    "text": "creating a position that you have a really small risk here, but the reason why it's a protective put is because it's taking the risk off of your long shares. So if this goes down in this scenario because you're, you're adding more puts, you actually have profit potential if it goes in your direction. But the overall premise behind these puts is you could call it a married put if you don't like the term protective put. That's also fine. But yeah, it's literally just long stock long put is the easiest way to think about it. Yeah. And when it says my long position is at profit and put strike is at profit. So line starts above zero. Yeah, that's totally cool. It's and that's kind of the idea behind a protective put, right? Is you're trying to protect the value of your shares. Now the downside to this kind of position, it well, it all depends on your management. I don't want to get super far down the rabbit hole. But it's not riskless inherently unless you're trading it as one position. That's important to so if you're going to keep your shares and not use like let's say for example, just let's say this moves to here and it falls down to five 23. If you don't move the entire position, what would happen is on your puts, they would be in the profit you would make money. Now the inverse would happen if it goes",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 91,
      "start_timestamp": "02:10:56",
      "start_timestamp_seconds": 7856.940659340659,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=7856"
    }
  },
  {
    "text": "let's say for example, just let's say this moves to here and it falls down to five 23. If you don't move the entire position, what would happen is on your puts, they would be in the profit you would make money. Now the inverse would happen if it goes up. So let's say it goes up to five 60 and you still want to keep your shares because up to five 60 and you don't sell your shares, you're eating that entire loss on your long puts. So there's nothing wrong with that kind of strategy, but it's really important to be thoughtful about how you choose to manage it because you can start building stupid losses that aren't being offset by realized positions. Andre says, how long would you keep a protective put on? I personally wouldn't use protective puts. So the way you would kind of think about that, though, is for the duration of the risk you're trying to cover. One of the biggest issues retail traders can have is becoming too adverse to risk in trying to hedge all of it away. If you hedge too much risk away, you are literally hedging your profit opportunity away at the same time. You're decreasing your profit massively. So I much prefer to size trades and decrease risk via sizing and then via trade management as compared to structurally decreasing it by adding more legs to it. It just decreases the overall profitability of the strategy in",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 91,
      "start_timestamp": "02:12:36",
      "start_timestamp_seconds": 7956.395604395604,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=7956"
    }
  },
  {
    "text": "opportunity away at the same time. You're decreasing your profit massively. So I much prefer to size trades and decrease risk via sizing and then via trade management as compared to structurally decreasing it by adding more legs to it. It just decreases the overall profitability of the strategy in the long run and you're adding more legs. So again, back to that cost thing, that's a little bit nefarious. So personally, I wouldn't run them with them on, but if you wanted to for some reason, that's totally fine. But you have to define how much of your upside or total profitability you're willing to sacrifice for that and then how long you need the protection on the longer the protection has on the more expensive it is. This is just about how I think about managing a portfolio. And I kind of use this top down approach. This is probably a good, oh no, we're essentially done with this thing. Yeah, okay, cool. So I think we just wrap us up. We only have a few left. So the way I think about managing a portfolio is starting with literally a really broad perspective and then narrowing it down and making sure that my portfolio fits how I think about the stock market as it sits now and literally how that fits against the economy as it sits now. And then the individual positions I put on need to make sense in the context of all of that",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 91,
      "start_timestamp": "02:14:15",
      "start_timestamp_seconds": 8055.850549450549,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=8055"
    }
  },
  {
    "text": "down and making sure that my portfolio fits how I think about the stock market as it sits now and literally how that fits against the economy as it sits now. And then the individual positions I put on need to make sense in the context of all of that proceeding information. So I split my portfolio into two different allocations. I have a core allocation and then I have a speculative allocation. The purpose of the core allocation is that's really where I'm trying to generate my annual returns. The speculative allocation is kind of where I'm looking to I take advantage of opportunities. Not quite as discreet as that. Right now, a lot of my capital is tied up in my speculative allocation that is driving returns. That's because sometimes some years, the core allocation will be performing more slowly. So because of that, I rotate more capital and I look more intensively for speculative opportunity. A couple other things I want to highlight from here specifically are these two. And I already talked about this one. It's vital to create an approach that aligns with you as a trader worth reiterating. This one, I cannot overemphasize enough either. Blanket rules in trading generally are stupid, which is kind of funny because that's a blanket rule. Take profits. That's not a good answer. Never risk more than blank percent of your capital in one trade. That's also not a good answer. The reason why it's not a good",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 91,
      "start_timestamp": "02:15:55",
      "start_timestamp_seconds": 8155.305494505495,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=8155"
    }
  },
  {
    "text": "either. Blanket rules in trading generally are stupid, which is kind of funny because that's a blanket rule. Take profits. That's not a good answer. Never risk more than blank percent of your capital in one trade. That's also not a good answer. The reason why it's not a good answer is because everything you're doing within your strategies needs to make sense when we're analyzing the expected return, the expected performance of that strategy over a specific time frame. So if I look up, I'm going to grab a video for you guys that walks through expected return way more in depth there that you could take a look. But the whole idea here is it can't be oh yeah, I'm just going to take profits. I don't want to keep that risk out. And then if you run a portfolio like that, you will find it's too inconsistent to actually make money long term because you are so set in your own discretion that sometimes you will make decisions differently in different time frames. And then you can't model that long term. So this long term modeling is super, super important. And I'll share another couple of videos. This one is a new one that I actually think is kind of important for people. And that one is how to create a consistently profitable trading strategy. And it walks through essentially this process way more in depth. But I think that that is worth the conversation. Someone says",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 91,
      "start_timestamp": "02:17:34",
      "start_timestamp_seconds": 8254.76043956044,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=8254"
    }
  },
  {
    "text": "This one is a new one that I actually think is kind of important for people. And that one is how to create a consistently profitable trading strategy. And it walks through essentially this process way more in depth. But I think that that is worth the conversation. Someone says no correlation between risk and position size. Your risk of losing one dollar on a billion dollar tips position is smaller than your risk of losing one dollar holding one share of Jimmy. Again, I get your point, but it's that's like it's trying to find an example that refutes the concept because even in your tips position, there is risk. Now to your point, the relative risk there is different, but you can't have a unilateral view of risk. There's opportunity cost. That is a risk to the returns of your portfolio. So I get your point and I follow you, but I wouldn't try to essentially just find things like that to have a talking point. There absolutely is a correlation between risk and position size. Again, there are scenarios where it could not be on a relative basis. But even that one billion dollar tips position still has risk. And it has a billion dollars in some sort of commensurate risk compared to the one dollar in GME. So I agree with you, I understand the point that you're trying to make there. But they're to essentially say something like there's no correlation between risk and position",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 91,
      "start_timestamp": "02:19:14",
      "start_timestamp_seconds": 8354.215384615385,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=8354"
    }
  },
  {
    "text": "has risk. And it has a billion dollars in some sort of commensurate risk compared to the one dollar in GME. So I agree with you, I understand the point that you're trying to make there. But they're to essentially say something like there's no correlation between risk and position size is not super logical. Because if we look at now as comparing two different strategies and we actually compare what we're talking about, risk and position size, not relative risk based on beta, but risk and position size. If I buy 700 shares of spy versus five 300 shares of spy, same trade, same position, same product, position size is a direct correlation on risk. So it's actually really important to not get too wrapped up. So I've noticed that sure in the same product, of course, of course, that's when we're making comparisons like that are saying about correlations, you have to control for those things, right? That's the entire point of identifying correlations is you're isolating something and then assessing something else to determine what that behavior is. Again, to your point, I agree with you. Different products can have different relative risk. Like if we were to chart the risk, if you were to put a thousand dollars in GameStop versus a thousand dollars in spy, very different risk profiles. But that doesn't remove the size component to the equation. It's still absolutely a component. Jay says, is there a way to quantify the probability of",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 91,
      "start_timestamp": "02:20:53",
      "start_timestamp_seconds": 8453.670329670329,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=8453"
    }
  },
  {
    "text": "to chart the risk, if you were to put a thousand dollars in GameStop versus a thousand dollars in spy, very different risk profiles. But that doesn't remove the size component to the equation. It's still absolutely a component. Jay says, is there a way to quantify the probability of success for a strategy position? It's a great question. Jay, you are on this, man. I love your questions. So definitely. And some of it will depend on your strategy. And let's use a couple examples. Let's say I'm trading in video. And look at that candle. And let's say I think in video is going to go up. Well, let's say you first would need to say, OK, I think it's going to go up for whatever reason. Let's say you're doing a momentum following strategy or a breakout strategy. Let's say that you're using this most recent 125 55 handle as resistance. And let's say that you were using this breakout day to enter. So you got in now at 128, 129, whatever. And it's starting to drift up. So you then have to make some assumptions about where you think this might go relative to where you where you entered. A lot of times it's easier to use like a really long term reference. If there is one, if there's not one, then you kind of have to come up with your own an easy way to do that to determine how far do I think this",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 91,
      "start_timestamp": "02:22:33",
      "start_timestamp_seconds": 8553.125274725275,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=8553"
    }
  },
  {
    "text": "where you entered. A lot of times it's easier to use like a really long term reference. If there is one, if there's not one, then you kind of have to come up with your own an easy way to do that to determine how far do I think this is going to go is you can use options for this. So if we go to this, you can then model where you think Nvidia might go with a different confidence interval based on different time frames. So this is exactly how you can say, all right, if I think Nvidia is going to go up, what's the probability that it goes up within 40 days? The probability and let's do a touch because we don't care if it stays in the money. The probability of it touching, let's say 142 is 57. There's your probability of hitting 146. So you can use options again, even to inform directional targets. So that's essentially the system that I would run for directional trades to start. That's a very simple one for options. It's kind of baked into the option. So if you're selling an option, let's say that you think Nvidia instead is going to go down and you want to sell calls. Well, you can come out here to the 30 delta and you could say, okay, the probability of these 30 delta calls getting touched is 47.13. The probability of them being in the money is 22.8. Well, if",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 91,
      "start_timestamp": "02:24:12",
      "start_timestamp_seconds": 8652.58021978022,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=8652"
    }
  },
  {
    "text": "instead is going to go down and you want to sell calls. Well, you can come out here to the 30 delta and you could say, okay, the probability of these 30 delta calls getting touched is 47.13. The probability of them being in the money is 22.8. Well, if you're going to apply early management based on them being touched, you obviously need to use this 40 47 number. Not if it doesn't expire in the money, which right now is 22.8. But let's say instead your approach is going to be to not do anything until it goes all the way to expiration. Well, then you can use the 22.8 understanding that they're likely will be a period that they would be underwater, almost to the tune of 50, not quite 50, but pretty close. So yeah, you should be able to quantify essentially the way that you're setting all of these different. Jay says, would you use that information to inform your allocation, how much you're willing to risk in the position to keep your relative to your available cash. Another great question. That's based more on portfolio management and actually that video that I shared above about building a strategy will go directly into capital management on that. But that's another great question. Essentially, the way I think about what gets money in my account is based on what the portfolio needs. I take again, not a position first approach. I take a portfolio overhead approach.",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 91,
      "start_timestamp": "02:25:52",
      "start_timestamp_seconds": 8752.035164835164,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=8752"
    }
  },
  {
    "text": "about building a strategy will go directly into capital management on that. But that's another great question. Essentially, the way I think about what gets money in my account is based on what the portfolio needs. I take again, not a position first approach. I take a portfolio overhead approach. So sometimes I need long deltas, even if I have super high conviction in something, if I don't need a bunch of long deltas, I'm not going to oversized in my long deltas, that kind of thing. And that's using something called beta weighted deltas, which I will share with you here, which helps a lot with subsequent sizing. All right, you all. Man, hour 45 minutes in on a Friday. Thank you guys for hanging out. I have a blast talking about this stuff. It is time for me to go. However, please like, subscribe, share. It does help the channel grow. And I'm looking to do that as best as I can connect more people together. And we will have another beginner workshop next week. It'll probably a little bit more shorter. I think I'm going to go a little more Q and A on that one since we got through a lot of the core content. So in the meantime, think of your questions. What kind of stuff do you want to dig into on the next session? I think it would make sense to start thinking about analyzing kind of that profit. Let me see. Do",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 91,
      "start_timestamp": "02:27:31",
      "start_timestamp_seconds": 8851.49010989011,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=8851"
    }
  },
  {
    "text": "we got through a lot of the core content. So in the meantime, think of your questions. What kind of stuff do you want to dig into on the next session? I think it would make sense to start thinking about analyzing kind of that profit. Let me see. Do I still have this up for you? Yeah, I do. The way I think your next steps would look like is this right here. I think we should start talking about this next week. So take a look at how you intend to do this. And I think we should have some questions to talk about next week on that. As always, feel free to join the discord. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "bhvVBNtOMXk",
      "title": "Option Structures and Strike Selection | Options Trading for Beginners Pt2",
      "url": "https://www.youtube.com/watch?v=bhvVBNtOMXk",
      "upload_date": "",
      "duration": 6392.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 91,
      "start_timestamp": "02:29:10",
      "start_timestamp_seconds": 8950.945054945056,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=bhvVBNtOMXk&t=8950"
    }
  }
]