[
  {
    "text": "of making money, sounds really dumb, but you'll see. We're going to do a little bit of a back and forth style quiz. And my guess is the making money thing is probably one of the least understood elements of what we're going to be talking about. And that's not a dig at anybody, because most people get into this world of trading, again, with this expectation skew and not enough time spent focusing on the things that deserve your attention. So that's one of the things we're going to cover. Now, we're going to talk about risk management. This one is been beaten to death. And thankfully so risk management when people talk about trading or investing risk management always pops up like pretty damn fast. So that part overall, I actually think is good, but I think the concepts of risk management are generally misunderstood. So we will talk about that. And then we're going to get into portfolio management. Essentially, the way to think about portfolio management is it's literally starting with these two ideas, how we think we're going to make money and how are we going to manage risk and it puts them together. That's what portfolio management is. It's literally just these two things combined. So we will talk about that. Now to get started in a conversational side of things, I would love to talk to you about different ways you think you can make money trading. So a little bit of a",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 55,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=0"
    }
  },
  {
    "text": "what portfolio management is. It's literally just these two things combined. So we will talk about that. Now to get started in a conversational side of things, I would love to talk to you about different ways you think you can make money trading. So a little bit of a brainstorm session, I'm going to take notes based on what I see you throw into the chat. So the question is, what are ways you think you can make money as a trader? Don't worry if it's classified in the way I typically talk about things, profit mechanisms and that whole thing. Don't worry about that. Just want to know how you think you can make money as a trader. Because when we think about this, a lot of people have a very rudimentary understanding of this. Lauren says, if I knew I wouldn't be here, that's a fair cop. Your trading option says credit spreads on a weekly to monthly basis. I would argue that is not a way actually to make money. That's not to poke fun. I wouldn't even consider that for the sake of this conversation. But you just outlined there is a structure credit spreads in a time frame weekly to monthly. We can trade credit spreads and lose money. So that's not so much what I'm thinking about in terms of methods to make money. Guy says, stonk go up, believe it or not, that is actually a perfect profit mechanism. One of the",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 55,
      "start_timestamp": "00:01:18",
      "start_timestamp_seconds": 78.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=78"
    }
  },
  {
    "text": "in a time frame weekly to monthly. We can trade credit spreads and lose money. So that's not so much what I'm thinking about in terms of methods to make money. Guy says, stonk go up, believe it or not, that is actually a perfect profit mechanism. One of the primary ones. So profit mechanism from guy is stonk up. There's one. We have one on the board so far. Go us. I hope we can conjure up a few more, hopefully. And don't be afraid to use subsets of stonk go up because there are different ways stonks may go up. The reason why this matters and the reason why this is such an important concept is because we spend so much time as traders working on all these random problems without actually starting at a foundational level of what we really need to focus on. This is one of the first things. So laptop CEO says directional. I would give that partial credit. So when we say directional, we would want to zoom in a little bit further. So then we would also have stonk go down. Laptops uses volatility. There we go. So again, that's a little too vague. So for something like volatility, we would need to click in a little bit. So this is things like maybe volatility risk premiums. Lauren says sometimes knowing when to cut losses can be a profit mechanism. If so fact, though, it cannot. It's a really important element of",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 55,
      "start_timestamp": "00:02:40",
      "start_timestamp_seconds": 160.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=160"
    }
  },
  {
    "text": "too vague. So for something like volatility, we would need to click in a little bit. So this is things like maybe volatility risk premiums. Lauren says sometimes knowing when to cut losses can be a profit mechanism. If so fact, though, it cannot. It's a really important element of a trading strategy. But knowing when to cut losses in no way produces profit. Now it produces it can protect your profit in the aggregate when we're looking at a system. But if I'm starting the equation from what are different market effects or methods that I can make money cutting my losses is not that. So that's why I wouldn't consider that here. Shazad says buy low sell high. That's literally exactly what this is and that's 100 correct by the way. I like that. Buy low sell high. That's correct. This is an actual effect that you're trying to capture. Sell high by low. That's correct. That's something like this. The inverse sell high. Buy low. So we've been batten back and forth for what maybe two minutes now something like that. And we have a few rough ideas. And really I gave you this one. You gave me this one. This is probably the best and this which I also gave you. This is probably the best one that was given and then these two here. ZXBORX says rolling in the money covered calls. No, that wouldn't be a profit mechanism. Sell extrinsic. That's not inherently a",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 55,
      "start_timestamp": "00:04:22",
      "start_timestamp_seconds": 262.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=262"
    }
  },
  {
    "text": "me this one. This is probably the best and this which I also gave you. This is probably the best one that was given and then these two here. ZXBORX says rolling in the money covered calls. No, that wouldn't be a profit mechanism. Sell extrinsic. That's not inherently a profit mechanism. Barrow slash lend intrinsic to slash from your stock position. Well, if you're borrowing, I wouldn't consider that a profit mechanism. And again, your participation here is huge, right? That's the whole point here is to have a conversation about this. And it's literally for this reason. It's because as we sit here and we try to break down the actual ways that we make money, it becomes this much more difficult answer to solve, right? That's the funny part is we take this step literally for granted, which is very interesting to me. Laptop CEO says minimizing drawdown, I would not consider that one. Again, that's on the risk management side of the equation. Again, the way that we're thinking about this first question is what are different market effects or different ways that we can make money in the market. So if I were to set out as a method to make money, minimizing my drawdown is not that. So good guess, but I would say no. Wondering I have a small account doing credit spreads seems like the best way to trade based on directional movement is my strategy to fail then. Not inherently doomed",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 55,
      "start_timestamp": "00:05:57",
      "start_timestamp_seconds": 357.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=357"
    }
  },
  {
    "text": "out as a method to make money, minimizing my drawdown is not that. So good guess, but I would say no. Wondering I have a small account doing credit spreads seems like the best way to trade based on directional movement is my strategy to fail then. Not inherently doomed to fail, it depends on how you go about it. But for the concept of like selling credit spreads, credit spreads itself doesn't mean profitable. Like, credit spreads itself doesn't mean shit. What I mean by this is let's say for example, I'm going to sell put credit spreads. If I'm going to sell a put spread and the stock does this, what happens? I lose. If I sell a call spread and the stock does this, what does that mean? I lose. So looking at the equation from this is the approach I'm going to take will it work? You're literally just saying this is the option structure I'm going to try to use. And there's nothing inherently wrong with that right talking about credit spreads is fine. But there's nothing inherent to a credit spread that equals makes money. It is everything that you do around that option structure that ultimately yields making money, which is really the goal that we want to tie into here. She says theta and I would consider that one. I think that that's fair. I wouldn't consider theta in edge inherently, but it is a profit mechanism. And I think that that's",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 55,
      "start_timestamp": "00:07:31",
      "start_timestamp_seconds": 451.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=451"
    }
  },
  {
    "text": "structure that ultimately yields making money, which is really the goal that we want to tie into here. She says theta and I would consider that one. I think that that's fair. I wouldn't consider theta in edge inherently, but it is a profit mechanism. And I think that that's a fair point. I'm going to open the door for Thorough real quick. I like that one. So let's take a look really quick at the list that I built for you. And the list that I'm going to show you is not comprehensive, but I just want to use it as a comparison to what we came up with here as a group versus some basic ideas. Ah, there we go. She says, vol contraction during earnings. Absolutely. That is a profit mechanism. So vol contraction. That's a great one. That's one of my favorites so far. So let's take a look here. The concept of making money as a trader is actually really simple. There's not that many choices. The funny thing again is that we almost always take this making money element as granted. As if I trade options, I'm doing it to make money. So I'm just going to make money, which just is not how things work. You are trading in asset class, if you'll remember from episode one, but just because you're trading options as an asset class does not yield inherent profit. So things like this, when we're looking at price direction within",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 55,
      "start_timestamp": "00:08:50",
      "start_timestamp_seconds": 530.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=530"
    }
  },
  {
    "text": "just going to make money, which just is not how things work. You are trading in asset class, if you'll remember from episode one, but just because you're trading options as an asset class does not yield inherent profit. So things like this, when we're looking at price direction within price direction, there are two primary directions, right? So price can go up or down. Price can go sideways, but again, technically, even when it's going sideways, it is going up and down. So price really goes up or down. Those are the two choices for price. Now when we take a look at how price goes up and down, we might argue it doesn't go up and down the same for everything. So here's an example here. If we take a look at spy, it literally just happens to be up and we take a look at the move that we've got in spy from here to here. So this is over the last 19 trading days, 26 calendar days, 16.47. This is the recent up move that you saw in spy. Here's another one in the very same ticker. This is 10 trading days compared to 19, so about half the time frame. And this move here went up 4.76. Okay. So we can understand this like difference in terms of duration and in terms of severity, how far it moved. But now let's take a look at a couple other names. I have a position on now",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 55,
      "start_timestamp": "00:10:36",
      "start_timestamp_seconds": 636.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=636"
    }
  },
  {
    "text": "about half the time frame. And this move here went up 4.76. Okay. So we can understand this like difference in terms of duration and in terms of severity, how far it moved. But now let's take a look at a couple other names. I have a position on now in Palincer. I've been trading it for a little while. Let's take a look at Palincer over the last 19 trading days. What do you notice about the percent return in Palincer over the last 19 trading days? Up 87.8. Am I showing you this just to show you that Palincer went up higher? Is that the point of this exercise? No. So why am I showing you this? Why am I giving you these two to look at in comparison to one another? Any ideas what I'm trying to show you? This is the entire game of understanding profit mechanisms. The whole point of this is even when we talk about something like price direction up or price direction down, it's not all created the same. It behaves very differently depending on what it is you're looking at. There are different markets of facts that are at play. That change depending on what you're looking at. So another great example using Palincer again just because again it's up. What's one thing we notice in Palincer when we look at this move here versus this move here? This is a catalyst driven move. There was earnings that was good that",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 55,
      "start_timestamp": "00:12:02",
      "start_timestamp_seconds": 722.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=722"
    }
  },
  {
    "text": "change depending on what you're looking at. So another great example using Palincer again just because again it's up. What's one thing we notice in Palincer when we look at this move here versus this move here? This is a catalyst driven move. There was earnings that was good that led to the stock gapping this much. Notice how this move does have small little baby gaps but nothing to the same degree that you saw here from the catalyst driven move. So this forces you as a trader with this very one profit mechanism of price direction up to then double click. We know not all direction up and then you can assume same for the downside. It's not all created the same. So then therefore the way that you trade them will not be the same. This is again where the decoupling from the casual trader versus a professional trader. It's not just taking something at face value and saying, Oh, Palincer went up. Okay, sick. Bro, what it comes down to is your ability to identify these different conditions and then to be able to trade these different conditions effectively because for example, if we go back in this chart, let's go back a little bit further. Let's go back three year daily. What's something you notice when we look at this chart on a three year daily timeframe and we look at these earnings times. This is an earnings release. This is an earnings release. This",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 55,
      "start_timestamp": "00:13:49",
      "start_timestamp_seconds": 829.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=829"
    }
  },
  {
    "text": "in this chart, let's go back a little bit further. Let's go back three year daily. What's something you notice when we look at this chart on a three year daily timeframe and we look at these earnings times. This is an earnings release. This is an earnings release. This is an earnings release. This is an earnings release. This is an earnings release. This is an earnings release. So is this and so on. What do you notice? Well, one of the things your eyes should be picking up on as you analyze these different earnings releases is that things go slightly haywire. You kind of have the stock coming into earnings, right? So here it's just kind of going. It's still upward sloping for sure. But then earnings comes out and you can literally see the size of the candle compared to the others and you literally can see visible gaps. You can see a gap here, right? With this candle that's poking up above everything else, you can literally see a visible gap here. Now, it's not always going to be this, by the way. But what I'm showing you is very frequently the stock behavior price around earnings is different. So again, when we're thinking about these different ways that we can make money, this is exactly what you need to do as a trader. It's not just saying like, oh, I think stock XYZ might go up. Let me buy a call. That's not going",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 55,
      "start_timestamp": "00:15:23",
      "start_timestamp_seconds": 923.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=923"
    }
  },
  {
    "text": "around earnings is different. So again, when we're thinking about these different ways that we can make money, this is exactly what you need to do as a trader. It's not just saying like, oh, I think stock XYZ might go up. Let me buy a call. That's not going to work long term. I'm telling you, it's not going to work long term. You have to have something way more robust than that. It's simply not going to cut it. So if your goal is to trade at a professional level so that then you can make as much money as you want to try to make so that you can do all of those cool things that people we all get into trading to do, this is the back end that goes into powering all of that stuff. So when I look at something like price direction, we can trade price direction up and down. We can trade price direction up in a bunch of different ways. There are things like drift. There are things like post earnings announcement drift, which is what I was just showing you. There's post earnings gaps. There's momentum. There are tons of different profit mechanisms that live within the broader category of just price direction up your first goal as a trader. Before you even ever click the button, before you ever send a trade off is to spend time thinking about this exact thing. Because again, what do you think the",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 55,
      "start_timestamp": "00:16:44",
      "start_timestamp_seconds": 1004.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=1004"
    }
  },
  {
    "text": "different profit mechanisms that live within the broader category of just price direction up your first goal as a trader. Before you even ever click the button, before you ever send a trade off is to spend time thinking about this exact thing. Because again, what do you think the outcome is going to be? If you just come at this with a lazy approach, you put on trades that are half baked and you're wondering why you were trading something you bought calls, but the theta decay accelerated too much because you didn't go far enough out in time because you were trading something that was really exhibiting more of a drift style move than a powerful enough momentum or breakout style move. So you lose money on an idea that actually might have been correct in terms of direction. It's because we misunderstood this concept. So what I give you here is literally a starting point. Like I said, this is in no way, in absolutely no way, comprehensive. This is literally an overview of different profit mechanisms that you can at least use as a starting point. Fun fact, when you think about profit mechanisms, they're interesting because there's no list of them. You're never going to find a list of profit mechanisms. So find different things that talk about some ways to make money. But one of the cool things about an options trader is you can access a lot of different profit mechanisms. That's exactly",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 55,
      "start_timestamp": "00:18:05",
      "start_timestamp_seconds": 1085.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=1085"
    }
  },
  {
    "text": "because there's no list of them. You're never going to find a list of profit mechanisms. So find different things that talk about some ways to make money. But one of the cool things about an options trader is you can access a lot of different profit mechanisms. That's exactly how I just shared my year to date where we are. My year to date performance here. This is in the discord on Sunday during the pro livestream. We're going to go through this a little bit more in detail. This is nothing sexy. This is just a standard trading cycle. Right? There's nothing I'm showing this and being like, oh, I'm super proud of what this is. That's not it at all. I'm literally just showing you. I share this on a monthly basis part of my end of month AAR after action review. When I share this just so that you guys have an idea of what I'm doing and what this can look like. So what I want you to notice is my core allocation, which is typically the coverage strangle in index ETFs, sometimes leveraged, sometimes not, long beta weighted delta. It means that it makes money when the stock market goes up. Typically suffers when it goes down. This my year to date performance. My core allocation gets most of my capital. It's contributing 1 of my total year to date returns and that 1 funny enough comes from a couple really small allocated names.",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 55,
      "start_timestamp": "00:19:30",
      "start_timestamp_seconds": 1170.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=1170"
    }
  },
  {
    "text": "money when the stock market goes up. Typically suffers when it goes down. This my year to date performance. My core allocation gets most of my capital. It's contributing 1 of my total year to date returns and that 1 funny enough comes from a couple really small allocated names. One of them being game stop. I posted that in the discord because I find it hilarious. In the coverage strangle, I allocate each position of certain amount of money. Game stop has the smallest amount of money by far. Yet on a gross portfolio adjusted basis is performing the second best. Hilarious. So anyways, that on a side, the only reason why the return is what it is has a lot to do with pivoting to other things that are working. This is the game of being an options trader in my style of trading. And I emphasize the my style of trading. The reason why I emphasize that is because there are some options traders that might choose to focus purely on trading vol. The cool part about trading vol is that it behaves a lot different than beta. And you kind of always have a non correlated return source to market beta. If you're doing that sort of thing, so you can specialize if you so choose for me, I continue to be a generalist. I know a little bit about all of these different profit mechanisms and it's how I trade. So back to the point",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 55,
      "start_timestamp": "00:21:08",
      "start_timestamp_seconds": 1268.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=1268"
    }
  },
  {
    "text": "return source to market beta. If you're doing that sort of thing, so you can specialize if you so choose for me, I continue to be a generalist. I know a little bit about all of these different profit mechanisms and it's how I trade. So back to the point on making money. My approach to making money as an options trader is to have different things I can do at different periods in time to try and take advantage of whatever the market condition happens to be. So again, prime time example, the coverage triangle is not performing well right now. Okay, it means I have to do something else. Otherwise the portfolio would be performing very, very sad year to date rather than being up generally okay, 33. That's a solid performance, especially being four months into the year. But if I was only trading long beta weighted deltas, I would be getting smashed. But the reason why the portfolio is not doing that is because there are other things that I can do. So this is literally your very first job as an options trader is to brainstorm actual market effects, actual profit mechanisms and how they behave. It is not sufficient is not good enough to simply say, oh, I'm going to trade directionally to the upside. That is not good enough. You have to do better. Otherwise it's not going to work long term. I will always emphasize that point long term because you can",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 55,
      "start_timestamp": "00:22:34",
      "start_timestamp_seconds": 1354.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=1354"
    }
  },
  {
    "text": "behave. It is not sufficient is not good enough to simply say, oh, I'm going to trade directionally to the upside. That is not good enough. You have to do better. Otherwise it's not going to work long term. I will always emphasize that point long term because you can always have you can throw on a trade that might make money. That's okay. But the thing that I try to remind traders about and we talked about this in episode one is your performance is going to be the reflection not of anyone individual trade. It's going to be a reflection of the application of your trading skill set literally over tens of thousands of trades. So I'm going to take a pause on this idea of making money. And I want to see if you have any questions. If anything I talked about didn't make sense. But I want to make sure that you have a clear stepping stone on how to approach this very first concept of brainstorming different ways to actually make money as a trader. And I have a video literally called I'm almost positive. It's literally called how to actually make money. Let me see. Literally, it's actually hilarious. The name of the video is actually make money. So here that's the name of that video. That's that video I was telling about. That video goes into three profit mechanism that gives you a little bit of a deeper view on how to think",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 55,
      "start_timestamp": "00:23:51",
      "start_timestamp_seconds": 1431.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=1431"
    }
  },
  {
    "text": "see. Literally, it's actually hilarious. The name of the video is actually make money. So here that's the name of that video. That's that video I was telling about. That video goes into three profit mechanism that gives you a little bit of a deeper view on how to think about this. When we're going through these profit mechanisms, your job is to understand them. It's not on a superficial level. Here's why. If we go back, literally let's look at an example. Let's look at balance here. And let's say you're coming into earnings. And one of the things that you will hear is through earnings, you shouldn't buy options. You should sell options. And this is one of the problems with broad platitudes is they're typically wrong because they miss the gray area. In general, I would actually consider that fully correct. Buying premium through earnings tends to be a suboptimal strategy. But as always, there are exceptions. There are exclusions to the rule, just like they are here. So if we look at this upcoming earnings release, which I actually traded. And coming into this earnings release, normally I prefer to sell premium as a basis, but there are times where I will deviate and I will trade the earnings release directionally if there's certain conditions met. And I traded this one to the upside. If I'm trading this to the upside, would I be better off selling a put or buying a call knowing how it",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 55,
      "start_timestamp": "00:25:16",
      "start_timestamp_seconds": 1516.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=1516"
    }
  },
  {
    "text": "there are times where I will deviate and I will trade the earnings release directionally if there's certain conditions met. And I traded this one to the upside. If I'm trading this to the upside, would I be better off selling a put or buying a call knowing how it moved? What's your guess? Let's turn on the fan. What's your those scenarios is better for me buying a call exactly. Super easy, right? Because in hindsight, being so clear, buying premium here benefits way more. From this move than something like selling a put. However, we also know that buying premium through an earnings release can be really dangerous because of the volatility contraction. If we take a look at the volatility move following the earnings release itself, implied wall really didn't do that much. Inplied wall expanded day over day 0.32. So a very small move from there. And then the next day implied wall craters. It has a 3.6 standard deviation down move while realize all is a 3.4 standard deviation up move. All this means is if I had bought a short dated call, I would have made a lot of money if I bought it at scale. The danger of doing that is if the move isn't that big, even if I got a directional move in my favor, buying the short dated call, unless it moved enough would have lost money due to how much wall came out. So what's a way for me",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 55,
      "start_timestamp": "00:26:57",
      "start_timestamp_seconds": 1617.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=1617"
    }
  },
  {
    "text": "at scale. The danger of doing that is if the move isn't that big, even if I got a directional move in my favor, buying the short dated call, unless it moved enough would have lost money due to how much wall came out. So what's a way for me as an options trader to build a trade based on this idea using earnings as a price direction catalyst, expecting targeting larger price movements while trying to avoid being right but wrong. What I mean by that is being right in terms of direction, but then losing money because overall we had massive volatility contraction. What could I do in that instance? Think about the qualities that we select when we're buying a call because that answers this riddle for you. Literally that is exactly where the answer is here. Trading options says buy a call, sell a put. Nope, that's not right in this context. There's nothing wrong with it, but creating a synthetic long doesn't fix it. Lauren's on it like white on rice. That's correct Lauren. Seriously, awesome job. That's exactly correct. The way that we fix this is literally by going further out in time. Why does going further out in time matter here? What we know going further out in time through Vega that it's actually more sensitive to changes in volatility. So a volatility contracts massively and I know by going further out in time, Vega is more sensitive. How does this work out?",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 55,
      "start_timestamp": "00:28:36",
      "start_timestamp_seconds": 1716.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=1716"
    }
  },
  {
    "text": "does going further out in time matter here? What we know going further out in time through Vega that it's actually more sensitive to changes in volatility. So a volatility contracts massively and I know by going further out in time, Vega is more sensitive. How does this work out? It has an understanding of where the volatility is likely to come out of. That is the game. So here's what I mean by this. If we look at Palantir, we know Palantir has earnings. They have earnings on the fifth after the close. What is the fifth? Monday. Monday after the close. So if we take a look at next week's term, 137.4 vol. Big, big, vol. What do we think is going to happen to this vol after earnings is released? We would expect this to contract. What do you notice about vol as you go further out in time? Maybe this 77 period, vol. What do you notice about it? Pretty low. So do we expect this term vol to change that much based on what happens in this term or in this exploration? Those terms are interchangeable, term and expiration. Within this term, not going to move that much. So because of that, if I go further out in time, I can reduce my sensitivity to that volatility contraction while still trying to gain exposure to the directional move. Yet, there's another problem. Anybody have a guess what the next problem is that we have to",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 55,
      "start_timestamp": "00:30:14",
      "start_timestamp_seconds": 1814.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=1814"
    }
  },
  {
    "text": "move that much. So because of that, if I go further out in time, I can reduce my sensitivity to that volatility contraction while still trying to gain exposure to the directional move. Yet, there's another problem. Anybody have a guess what the next problem is that we have to solve for? The way that I'm showing you on how to think about this is by taking a profit mechanism and it's by thinking through each step on using literally the Greeks to build smarter trades. And I have a video on literally with that exact title. Teruel and Shazette says theta, part of it, but not actually that concerned with theta in this context because we're expecting a really big price move post earnings. So the expected holding duration isn't that long. So that's another thing that a lot of times options traders get a little twisted. They think that like theta is going to just burn your options away super, super fast. And it can, depending on what you pick, but because in the example we're using right now with earnings on Monday, where you're looking at 70 70 T options, we can see what our theta is. And at the money, which is where theta is going to be the greatest, that's where the highest extrinsic value is, it's about 11 cents. So 10 bucks a day on something that's trading for 16, 47 ish. So not insignificant, but not a massive problem if we're not expecting",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 55,
      "start_timestamp": "00:32:06",
      "start_timestamp_seconds": 1926.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=1926"
    }
  },
  {
    "text": "And at the money, which is where theta is going to be the greatest, that's where the highest extrinsic value is, it's about 11 cents. So 10 bucks a day on something that's trading for 16, 47 ish. So not insignificant, but not a massive problem if we're not expecting to hold the options for that long. So that's not it. What else is the problem here? You're on the right track looking at the Greeks. There's not that. Aha, Shazette has it. Gamma, delta will move a lot if underlying is expected to move a lot. Delta will move a lot depending on what delta you pick, right? So an example of that is if I pick something that as a delta, 16 delta's, that means if the underlying goes up a dollar, my delta's are going to move up by 16 cents or my premium is going to move by 16 cents. So it's not inherent to case that delta will move a lot if the underlying moves a lot, it might not. And that is actually why gamma is the next problem we have to solve. Take a look at my gamma. And again, this is all from a frame of simply understanding options, understanding the products, the asset class that we're trading. We can see gamma is very low. Gamma is a penny. Why is gamma so low? Because we know that as you go further out of the money, gamma decreases. We also know that",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 55,
      "start_timestamp": "00:33:34",
      "start_timestamp_seconds": 2014.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=2014"
    }
  },
  {
    "text": "from a frame of simply understanding options, understanding the products, the asset class that we're trading. We can see gamma is very low. Gamma is a penny. Why is gamma so low? Because we know that as you go further out of the money, gamma decreases. We also know that as you go further out in time, gamma decreases. So we've just stacked two slow gamma traits together. By stacking these two slow gamma traits together, we've made a trade off. We have low gamma. We have low theta decay. We have low likelihood of vol collapse. So if we kind of rate these so far, we like this theta picture. We like this vol picture. This gamma picture is sub par. However, there is a fix. The way we fix this, gamma measures the rate of change of delta. So if I have a high enough delta, I don't really care about gamma because it's already high. Delta can only go to one. So when delta is one, gamma at that point doesn't matter that much. What's the trade off here? So now we know I'm going to pick a higher delta. This overwhelms this. What did I just add to this equation? Cost. The cost just went up. Higher delta has more intrinsic value. It's more expensive. This is the process of understanding a profit mechanism and then building a strategy to capture the profit mechanism that you really isolate the effect that you want. That's the whole",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 55,
      "start_timestamp": "00:34:41",
      "start_timestamp_seconds": 2081.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=2081"
    }
  },
  {
    "text": "add to this equation? Cost. The cost just went up. Higher delta has more intrinsic value. It's more expensive. This is the process of understanding a profit mechanism and then building a strategy to capture the profit mechanism that you really isolate the effect that you want. That's the whole point here. So that little bit of a long story tale, but that is the concept of making money through profit mechanisms. That's the entire idea is doing that exercise and it comes with a lot of brainstorming. Okay. Next up. That's what Topsy says, but we're saying buying a call after the fact, how do you choose which strategy before the earnings? That's not so much the case actually. I bought the call before earnings in that instance. That was actually the point of that exercise is to show you that typically I would sell premium through an earnings release, but there are instances where I will instead buy it. That was one of them. Now when you're talking about trading earnings, what we do is we analyze things in the profit mechanism, right? So we analyze the profit mechanism in this context of earnings. And if we're analyzing the profit mechanism of earnings, you're going to find a few things. First, there's going to be an IV expansion, a certain amount of time leading into earnings about two weeks. IV will start expanding. The second thing you will notice is that IV contracts generally after earnings. The third",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 55,
      "start_timestamp": "00:36:31",
      "start_timestamp_seconds": 2191.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=2191"
    }
  },
  {
    "text": "the profit mechanism of earnings, you're going to find a few things. First, there's going to be an IV expansion, a certain amount of time leading into earnings about two weeks. IV will start expanding. The second thing you will notice is that IV contracts generally after earnings. The third thing you'll notice is that it can be a big price catalyst. This is near term, by the way. The fourth thing is it can kick off drift. So in this one profit mechanism, there are four different and separate conditions and traits that can be traded around. The way that you know what to use when is by researching these exact things. The fact that I'm giving you this as a starting point is already a gift to be completely honest. Because if you don't even notice, start looking at this, you have to analyze thousands of earnings to understand what it tends to be like around what are the traits. So this is essentially short cutting that part for you. And it's giving you four conditions around earnings that are tradable. So then from there, you have to analyze each of these conditions, get a sense of how they behave. You have to quantify and qualify them. And then you go through that exercise that I just showed you. That exercise that I just showed you was tackling this one right here. Earnings release as a short term price catalyst. That's exactly what that trade was built around.",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 55,
      "start_timestamp": "00:38:11",
      "start_timestamp_seconds": 2291.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=2291"
    }
  },
  {
    "text": "they behave. You have to quantify and qualify them. And then you go through that exercise that I just showed you. That exercise that I just showed you was tackling this one right here. Earnings release as a short term price catalyst. That's exactly what that trade was built around. That third type right there. So it's a good question. But that's the cool part about the research side of what we do. Now, good old risk. Risk matters a lot. And the reason why risk matters so much is because as I very frequently like to say, you can't trade no money. So as an options trader, I think about risk in three different buckets, typically. The first bucket is at the portfolio level. So the portfolio level says, I have this total amount of money. This is all your money in one spot. Hopefully it's more than 3. Hopefully got a few more bucks. And I essentially say of this total amount of money, what am I comfortable losing? So that might be if my portfolio draws down 50. I am now sad. Okay. That's good to know. So what if the portfolio draws down 25. If the portfolio draws down 25, I am filling cally. Not happy, not sad. I'm in the middle. Okay. This is how we get closer and closer to understanding at the portfolio level, what is our maximum drawdown? Our institute portfolio level circuit breakers based on this exercise. Now, as always, in",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 55,
      "start_timestamp": "00:39:42",
      "start_timestamp_seconds": 2382.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=2382"
    }
  },
  {
    "text": "portfolio draws down 25, I am filling cally. Not happy, not sad. I'm in the middle. Okay. This is how we get closer and closer to understanding at the portfolio level, what is our maximum drawdown? Our institute portfolio level circuit breakers based on this exercise. Now, as always, in trading, everything, everything is a trade off. So if we have this school scale and on this side, we have risk, this side is return. So if I'm not comfortable with much risk, it means that I'm waiting this and this side is going to raise up and I'm going to have to accept a lower return. This is not perfect. There are ways to expose yourself to really low returns and tons of risk. So it's not this fixed relationship. You can fuck it up. So you have to be aware of that. But at the portfolio level is when we start by defining what are we comfortable with seeing happen in the portfolio. And you have to balance that against what the potential return is. Now most people will say, well, how do I even start this process? It's a great question. Now for those that are in the coaching program, normally what we do is we start by analyzing goals. And one of the simple ones is what is your annual return objective? This can be a fixed dollar amount. This can be a percent return on the accounts. A very common annual return objective is to",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 55,
      "start_timestamp": "00:41:22",
      "start_timestamp_seconds": 2482.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=2482"
    }
  },
  {
    "text": "the coaching program, normally what we do is we start by analyzing goals. And one of the simple ones is what is your annual return objective? This can be a fixed dollar amount. This can be a percent return on the accounts. A very common annual return objective is to outperform SP 500. OK, fine. So we know that the SP 500 returns, depending on the window that you use, something around 10, waiting that a little more heavily to like the recent 20 years. So this means that if we're going to outperform the SP 500, it means that we're going to have to return at least 10. OK? So if we have a 100,000 account, we know that we want to return this 10, it means that we need to make 10K over the course of a year. OK, we're getting somewhere. So I need to figure out a way to get 10,000 doll hairs in order to meet my goal. Well, the next thing I do is continue segmenting the goal. And I say, OK, if we have 10,000 and we want to make that over the course of a year, that means on a monthly basis, I'm going to need something like 833 and 33 repeating. So this is exactly then how we figure out how much risk should go on at a given point in time. The way that I look at this is if I think the market is really delicate, tenuous, I'm not",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 55,
      "start_timestamp": "00:43:02",
      "start_timestamp_seconds": 2582.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=2582"
    }
  },
  {
    "text": "I'm going to need something like 833 and 33 repeating. So this is exactly then how we figure out how much risk should go on at a given point in time. The way that I look at this is if I think the market is really delicate, tenuous, I'm not super stoked on what I see. I don't want to have a ton of risk out. It means I'm going to put out the minimum amount of risk that I need to in order to have this on the docket in order for me to earn this amount of money over the course of the month. If I look at this and I say, well, the market looks really good, then I'm actually not going to focus on putting on minimum viable amount of money in order to get to this. And I'm going to just take advantage of the opportunities that I can provide it that it's going to make more than this. Then we enter the risk side of the equation. So if in order to make this 833, I have three stocks that I'm trading. I'm trading Nvidia, I'm trading Meta and Amazon. And I'm using short puts, naked short puts in them all. And I'm doing that to make this 900 because we want to outperform the 10. This is an example. Well, the first thing I can tell you is that the portfolio management level, there's some key questions we're going to have to solve",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 55,
      "start_timestamp": "00:44:20",
      "start_timestamp_seconds": 2660.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=2660"
    }
  },
  {
    "text": "puts, naked short puts in them all. And I'm doing that to make this 900 because we want to outperform the 10. This is an example. Well, the first thing I can tell you is that the portfolio management level, there's some key questions we're going to have to solve for this. But focusing on the risk management side, one of the things I can tell you is that by having this kind of risk profile, which is going to be defined risk, or I'm sorry, defined profit, unlimited risk, technically it's not unlimited. Risk can only stock and go to zero, but we use the term unlimited risk just because it's simpler to say shorter. So by having this risk profile, if the stock market has a month like it did in the beginning of April or pick your time frame, end of March, really, end of March, what's going to happen? Well, this is going to experience a massive, unrealized loss and a massive drawdown. So then based on my risk tolerance, let's say my risk tolerance is no more than 25 drawdown. I need to see based on how I built my portfolio to hit this target. If that scenario does happen, meaning we know that the market can go down, we use historic references to ballpark what our risk might be. If the portfolio would draw down greater than 25 in the sense, then it means that this ain't it. We gotta do something else. We",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 55,
      "start_timestamp": "00:45:42",
      "start_timestamp_seconds": 2742.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=2742"
    }
  },
  {
    "text": "If that scenario does happen, meaning we know that the market can go down, we use historic references to ballpark what our risk might be. If the portfolio would draw down greater than 25 in the sense, then it means that this ain't it. We gotta do something else. We gotta put some other shit out there because all of these are going to be hyper correlated. They're also going to be slightly higher beta than the market. So if the market does happen to have a down move, these are all going to move together, typically in a more exacerbated way than the market, you can absolutely hit your portfolio level circuit breaker. Then you have to start cutting positions to follow your rules and you've just set yourself way further back on this because you literally set up a stupid portfolio. Don't do that. So risk management occurs in multiple levels for me and you have to think through all of them for yourself. You have to think through them at the portfolio level. You have to think through them at the strategy level and then set trade level P and L targets. So what this means at the strategy level is if my strategy is naked short puts. One of the big benefits of naked short puts is that they give you a little bit of room if the underlying goes against you. And if you set stops that are too tight, you are going to be",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 55,
      "start_timestamp": "00:47:09",
      "start_timestamp_seconds": 2829.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=2829"
    }
  },
  {
    "text": "the strategy level is if my strategy is naked short puts. One of the big benefits of naked short puts is that they give you a little bit of room if the underlying goes against you. And if you set stops that are too tight, you are going to be closing trades that otherwise would have been profitable. That's an artifact of this specific strategy. So you don't want to do that. So you probably need to set your stop somewhere because if something goes down too far, you now know you're just wrong. Your idea is wrong. A naked short put is still a bullish trade. So if something starts plummeting, it means you are fucking wrong. You have to do something. So what this means is at the strategy level, you need to define based on how your strategy behaves. And if you say Eric, how do I know how the strategy would behave? It's a great question. The answer is you pay per trade it. You look at it before you trade it with real money. So by paper trading your naked short put strategy, you might see that over the course of 200 paper trades that your average, because you keep your size generally consistent, your average MDD max draw down per contract is 5,000. Just picking something. This is now your planning factor. So then you can look at your trade idea. So let's go into balance here. And let's say that we think it's",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 55,
      "start_timestamp": "00:48:14",
      "start_timestamp_seconds": 2894.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=2894"
    }
  },
  {
    "text": "your average, because you keep your size generally consistent, your average MDD max draw down per contract is 5,000. Just picking something. This is now your planning factor. So then you can look at your trade idea. So let's go into balance here. And let's say that we think it's going to go up or 10 that there's not earnings all that other stuff. Let's take a look at selling puts. Let's say that we want to sell these 49 DTE puts. And we're going to start with the one lot, 5K is honestly a little too much to use for the max draw down, by the way. But if we look at balance here, and before we even worry about modeling any of that stuff, we say all right. If balance here drops below the 98 handle, this near term support by here, that's kind of like an early warning system that this thing isn't doing what I want. And if it decisively falls through the point of control, then I just know I'm wrong. Because from the onset of the trade for this negative or put, that's I'm not expecting it to go down there. I'm expecting it to go up, not down. So this puts us at 73 call it. So we going to here, we look at what would our trade be losing at 73. And you don't need thinkorswim to do this. You could literally do this in Excel. Well, at 73, you would lose",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 55,
      "start_timestamp": "00:49:31",
      "start_timestamp_seconds": 2971.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=2971"
    }
  },
  {
    "text": "to go up, not down. So this puts us at 73 call it. So we going to here, we look at what would our trade be losing at 73. And you don't need thinkorswim to do this. You could literally do this in Excel. Well, at 73, you would lose three grand. Okay. So if we look at what we just did in terms of our broad exercise, and our average max draw down per lot is about 5K, this is 3K based on the spot you would consider yourself wrong. This would fit into that strategy wrist side. That's okay. So then all you do is you set the actual PNL targets based on your analysis again, based on your strategy. In this case, it's a directional naked short put. I'm going to set some sort of price target to the upside where I think I'm correct. And then if it goes down, I'm going to set it downside like we just saw it 73. That's where I would be wrong. Say la Vee trade goes out the door. That has aligned portfolio risk across all three levels at the portfolio level, the strategy level, at the trade level. Okay. Last thing, which funny enough, the last thing is what we've been talking about this whole time, believe it or not. It's all of this stuff literally put together. So all we're doing is taking these two concepts and we're combining it into something that we can consistently produce.",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 55,
      "start_timestamp": "00:50:55",
      "start_timestamp_seconds": 3055.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=3055"
    }
  },
  {
    "text": "Okay. Last thing, which funny enough, the last thing is what we've been talking about this whole time, believe it or not. It's all of this stuff literally put together. So all we're doing is taking these two concepts and we're combining it into something that we can consistently produce. So for me, the way I do this is I have a core and speculative allocation as I showed you in the year to date return breakdown. Then I decide based on market conditions, how much money I might want to use in different spots, my scaling in, scaling out protocols based on the portfolio level management. And we already went through the goal based deployment. That's how we figure out how much risk should we have out at a given point in time. It should not be a random ass guess of just putting shit out there. It should be a very calculated amount of risk that gets put out based on what your goals are. So this is literally how you build a trading approach. I will take a pause here and see if there's any questions. If there's anything that you want to double click into that we've talked about with respect to these three items. And then if not, I have one more slide that I built for you that hopefully will firm a lot of this up for you. So talk to me, are we good? Do we feel comfortable? Because I think if you",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 55,
      "start_timestamp": "00:51:58",
      "start_timestamp_seconds": 3118.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=3118"
    }
  },
  {
    "text": "we've talked about with respect to these three items. And then if not, I have one more slide that I built for you that hopefully will firm a lot of this up for you. So talk to me, are we good? Do we feel comfortable? Because I think if you can dial these in, it literally positions you to then have a solid foundation moving forward. This is the core of what it is to be a trader at a very high level. I just heard a small scratch at the door. I think you guys all know what that is. So give me one sec. All right. The portfolio manager is here. If I'm not mistaken, I think he's post dinner. Did you have dinner? Yeah, he had dinner. You could always tell he had dinner because his chin gets a little bit wet and he's a little bit burpy, kind of like a baby. So we're going to let him hang out. To provide, make sure that we're on the right track. He's playing with his joy now, which is good. And let's move on now to our last slide. This here defines at least a general starting point that you might consider on how to build your approach. So we're not going to go through all this. I just wanted to give you something as a takeaway, something that you can effectively look at what we just talked about. And then think about how to actually implement",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 55,
      "start_timestamp": "00:53:29",
      "start_timestamp_seconds": 3209.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=3209"
    }
  },
  {
    "text": "point that you might consider on how to build your approach. So we're not going to go through all this. I just wanted to give you something as a takeaway, something that you can effectively look at what we just talked about. And then think about how to actually implement it. This is a starting point. So I'll leave this up and we can just have an open conversation. Talk about anything that you want with respect to this topic. If there's anything that would be useful for us to explore with the example, stuff like that, let me know. ZXBorg says, I keep hearing about a 2X risk reward. So does that mean you should target 6K as your likely profit before taking that 3 risk trade? That is terrible advice. 2X risk reward is terrible advice. Where that comes from is a standard typically shorter term day trading approach. So in a shorter term day trading approach using equities, it could be fine. Two times risk to reward. It might be completely fine. The broader point is your risk to reward has to be set to your strategy. So I'll give you an example. One of my strategies is based on breakouts. So if we have the concept of a breakout is this, pretend this is a stock chart. And let's say price is consolidating. And I think for based on my approach that if price convincingly crosses up above this, I'm looking to trade the continuation here.",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 55,
      "start_timestamp": "00:55:22",
      "start_timestamp_seconds": 3322.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=3322"
    }
  },
  {
    "text": "is based on breakouts. So if we have the concept of a breakout is this, pretend this is a stock chart. And let's say price is consolidating. And I think for based on my approach that if price convincingly crosses up above this, I'm looking to trade the continuation here. So what that means is my potential profit could be big. That's the idea. But I also need to define a spot where I'm wrong. Whether if instead of doing that, it rolls over. And then I essentially say I am incorrect. So what this kind of thing can be is very small loss size because it's going to be set super tight. Either on that breakout, it's going to do what I want or it's not. So I'm going to have a pretty high loss rate. And I can tell you what the loss rate is for the strategy as it sits right now. Give me a sec. The loss rate for the strategy is, that's actually hilarious, 50. So it's literally a 50, 50, 50 trade. Yeah. However, the strategy itself is highly successful. The reason why it's highly successful is because the average win is much larger than the average loss. So when we compare these, the average loss comes in here. This is the average win. So even though the loss rate is not good, it still makes sense. And this is based on this specific approach going back to what we were just talking about.",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 55,
      "start_timestamp": "00:56:50",
      "start_timestamp_seconds": 3410.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=3410"
    }
  },
  {
    "text": "than the average loss. So when we compare these, the average loss comes in here. This is the average win. So even though the loss rate is not good, it still makes sense. And this is based on this specific approach going back to what we were just talking about. It's a great parallel. If we look at the short put equation and the stock is doing this and I choose to trade a short put for the sake of a breakout, not the right choice, but let's just say I did. Except if I set the stop right here and I do that with a short put, guess what? This might still literally be max profit. She could be max profit still, yet I just took a loss because I'm misapplying the risk management to the incorrect strategy for a short put that little bit of a down move. That's just gamma. That's just what we pay to play this game. So in that context, that's what happens if you apply dumb risk management rules blindly across the board. It has to be specific to the strategy. Otherwise, it literally doesn't make sense. So it's a great question. And that two times risk to reward, you're going to find that typically in shorter term day trading groups. And again, I'm not saying that it's bad. I'm just saying you can't apply that to everything. So the idea of that being the risk management approach, that's bad advice with respect",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 55,
      "start_timestamp": "00:58:27",
      "start_timestamp_seconds": 3507.18,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=3507"
    }
  },
  {
    "text": "that two times risk to reward, you're going to find that typically in shorter term day trading groups. And again, I'm not saying that it's bad. I'm just saying you can't apply that to everything. So the idea of that being the risk management approach, that's bad advice with respect to that specific strategy. I think it could be fine. I don't trade it, but it could be fine. Neon says how much money does this foundation need minimum to be successful? Zero dollars. Zero dollars. Everything that we're talking about here can be done via paper trading. If you notice on this entire approach, this is the first spot real money gets introduced to the system. So all of this, all of this can be done with precisely zero dollars. Don't need any money whatsoever. After that, notice how it's MVP, minimal, viable product. So that means if I'm trading this breakout style thing, one lot. And I still have to make sure that the one lot makes sense for where I would be exiting based on the strategy specific rules. So realistically, to start this process to your point and to be successful in this process, you literally need zero dollars. Because up until step eight, everything else, zero dollars needed, it's only here where you start actually using real money. So you have tons to do with no money. That's the beautiful part. The laptops says do you support resistance levels to determine your stop and take",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 55,
      "start_timestamp": "01:00:07",
      "start_timestamp_seconds": 3607.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=3607"
    }
  },
  {
    "text": "need zero dollars. Because up until step eight, everything else, zero dollars needed, it's only here where you start actually using real money. So you have tons to do with no money. That's the beautiful part. The laptops says do you support resistance levels to determine your stop and take profits? Is there a minimum risk for reward ratio that you use? It's a good question. And this is similar actually to what I was talking about with ZX Borg. It is very specific to the strategy. So for example, if I'm trading something like earnings, if you're all this off, if I'm trading something like earnings, support and resistance literally doesn't matter. And it's because during earnings, the stock tends to go haywire, massive moves all over. Support and resistance is completely irrelevant in this strategy for me. Now coverage triangle, another great example, coverage triangle right now is in T triple cues. Coverage triangle support and resistance really doesn't matter for me. Support and resistance helps me contextualize trend in direction that then informs allocation, utilization and scaling. So in this instance, support and resistance also is more just for context. However, if we go back to a good old trade, some of the OGs will know all about APP, support and resistance is literally the basis for the trade. So this was a breakout style trade. That was the entire purpose of it. So if we go back, we got to get rid of all these massive",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 55,
      "start_timestamp": "01:01:40",
      "start_timestamp_seconds": 3700.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=3700"
    }
  },
  {
    "text": "good old trade, some of the OGs will know all about APP, support and resistance is literally the basis for the trade. So this was a breakout style trade. That was the entire purpose of it. So if we go back, we got to get rid of all these massive gaps so that it normalizes the chart like this. So here's what happened. This was the onset of the trade. As it was chopping sideways, this popped up on a consolidation scan that I run. And on this really strong breakout on volume, there was an entry taken. The stop in this instance for this specific strategy gets placed below, not the moving average. I'll use it as kind of a secondary thing. But the original stop gets placed below the low of the consolidation period. So the last leg up was here, this entire zone that you see from this range effectively is the consolidation. So the low for the consolidation was right here at like 82 and a half. So then give that a little bit of room 82 becomes the stop in that context for that specific example. So that's based entirely on support and resistance because the breakout of itself needs to break out through near term resistance from these prior attempts at the highs that didn't make it. So again, using this trade as a specific example, you can see that there was an attempt at the high here, an attempt at the high here,",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 55,
      "start_timestamp": "01:03:22",
      "start_timestamp_seconds": 3802.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=3802"
    }
  },
  {
    "text": "the breakout of itself needs to break out through near term resistance from these prior attempts at the highs that didn't make it. So again, using this trade as a specific example, you can see that there was an attempt at the high here, an attempt at the high here, a sad attempt at the high here. So a breakthrough between this 92 90 handle becomes interesting. Well, what happened here? It flew through the 92 90 handle all the way up. So in this context, I'm using support and resistance heavily. So to synopsize all of that, as always, it's entirely based on the individual strategy. Same thing with the risk to reward. The risk to reward is specific to the strategy and it has to be it literally has to be it is such a common bullshit mistake to set risk to rewards that are fixed across everything. It doesn't make sense. And it's because especially as an options trader, everything you do is going to move different massively. So you have to treat the individual things that you're trading, the individual strategies, the individual trades, meaning in the individual names, they have to be specialized to whatever it is. That's why I start at the portfolio strategy, then trade level with respect to risk setting. So yeah, it's specific to the strategy without a doubt. Shazad says, what would a realistic return percentage go for an amateur trader? I know it's subjective, but what would something to",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 55,
      "start_timestamp": "01:04:51",
      "start_timestamp_seconds": 3891.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=3891"
    }
  },
  {
    "text": "it is. That's why I start at the portfolio strategy, then trade level with respect to risk setting. So yeah, it's specific to the strategy without a doubt. Shazad says, what would a realistic return percentage go for an amateur trader? I know it's subjective, but what would something to aim for at least? It's a really, really great question. The answer is one that you're not going to like, but it is literally exactly the correct answer is greater than zero. Your first two years of trading greater than zero. If you don't like that, don't trade. Literally don't trade. You're in the wrong business. The reason why I say that is because in order to do well as a trader, there's a lot of things that you have to do. And in the beginning, you have to focus on learning those things. You're in no position to sit there and say, I want to do blank. And I always use Jujitsu as an example here because it's such a great example. If you're brand new Jujitsu and you go to your gym and you're training there, it's your first day. Your goal going in on that first day is not to start subbing people. It's to understand maybe how to even move as a Jujitsu practitioner. That's the first thing. It's not worrying about submitting people, let alone doing the Gordon Ryan thing and calling your submissions before the match and then executing that submission. You don't get",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 55,
      "start_timestamp": "01:06:20",
      "start_timestamp_seconds": 3980.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=3980"
    }
  },
  {
    "text": "is not to start subbing people. It's to understand maybe how to even move as a Jujitsu practitioner. That's the first thing. It's not worrying about submitting people, let alone doing the Gordon Ryan thing and calling your submissions before the match and then executing that submission. You don't get to do that. Because you have absolutely no track record and you have no skill yet. And that's okay. You have to treat it for what it is. You can't pretend that things aren't what they are if they're uncomfortable. So first two years, greater than zero. After that, you should start progressing towards whatever your goal is as a trader. So if your goal is to outperform the market average, then you should start trending towards that. Your goal is to have a consistent amount of monthly return, meaning maybe limiting portfolio, volatility and reducing draw downs, then you should start working towards that goal. But first two years, your goal literally is greater than zero. And if that happens, you literally are knocking it out of the park. That's absolutely crushing it as a new trader. New traders, myself included, we all do this. And it's because most of us approach trading from all the same context. And that context is a lot of us don't have money and we're trying to figure out how to make money. So because of that, we approach trading thinking that we're going to make a bunch of money really fast. And",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 55,
      "start_timestamp": "01:07:39",
      "start_timestamp_seconds": 4059.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=4059"
    }
  },
  {
    "text": "of us approach trading from all the same context. And that context is a lot of us don't have money and we're trying to figure out how to make money. So because of that, we approach trading thinking that we're going to make a bunch of money really fast. And again, from episode one, you will know definitively the fantastic way to lose a bunch of money. That's the reality, unfortunately. So first two years, greater than zero. That's what to aim for for sure. Your main focus for the first two years is developing a process. So this is from episode one. This is your light and shining armor as a new trader is developing a solid foundation that you can leverage. It's a not sexy answer. I know people don't like hearing it. I absolutely would not like to hear it myself, but it is absolutely the correct answer. I'm super confident in that. And then the following one from Shazad was you have a video where you go over analysis of earnings trades. I do. That gives you that video I just dropped is like an overview of how you can think about trading earnings. And then I don't know if we did it on one of the Monday sessions we might have. Maybe this past Monday, but we were reviewing some earnings. We did it in the pro community definitely the last couple of Sundays because that's a big part of what I trade is earnings.",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 55,
      "start_timestamp": "01:08:57",
      "start_timestamp_seconds": 4137.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=4137"
    }
  },
  {
    "text": "I don't know if we did it on one of the Monday sessions we might have. Maybe this past Monday, but we were reviewing some earnings. We did it in the pro community definitely the last couple of Sundays because that's a big part of what I trade is earnings. So yeah, GCA says takes time and practice and no emotions. That's actually incorrect to be completely honest. The time and practice is absolutely true, but no emotions is just not realistic. You're going to have emotions. I find that to be one of the like a common bad piece of advice that new traders are given because it's literally unobtainable. So it's kind of like giving somebody a mission from the onset that you know cannot be accomplished. I consider myself quite stoic and I will have emotions. Everybody has emotions. You cannot escape them. But instead of trying to you know picture it as like not having emotions, I recommend to people instead focusing on managing emotions. That's completely doable. Every single one of us can manage our emotions, but you cannot have none. They're going to be there whether you want them or not. And sometimes we don't, but they're still there. And Ian says, question I've been asking myself, why is trading so concerned with minimal effort? Is it due to human element, an emotional toll or lack of control? Why is trading so concerned with minimal effort? Well, I think I think a lot of",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 55,
      "start_timestamp": "01:10:14",
      "start_timestamp_seconds": 4214.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=4214"
    }
  },
  {
    "text": "don't, but they're still there. And Ian says, question I've been asking myself, why is trading so concerned with minimal effort? Is it due to human element, an emotional toll or lack of control? Why is trading so concerned with minimal effort? Well, I think I think a lot of new traders just come in with skewed expectations. I think new traders come into this from the lens of they think it's going to be fast easy money. So they're trying to do this, the smallest amount of work to get to the fast easy money. So I think that's part of it. And then I think the other part of it is a lot of people are sold of false bill of goods. So what I mean by that is a lot of people are sold this super lavish lifestyle that's you know, just super over the top. And the reality is it really isn't reflective of what trading is, but it can be reflective of the byproduct of trading. That's what I remind people like all of these really cool things that I get to do. It is absolutely powered by trading, but it's also powered by a not insignificant investment of time and effort into trading to be able to do the cool things. So I think from that lens, it's just skewed expectations and misplaced, misplaced hope kind of I think is a fair way to frame it. But there's a balance, right? Like the fact",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 55,
      "start_timestamp": "01:11:35",
      "start_timestamp_seconds": 4295.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=4295"
    }
  },
  {
    "text": "not insignificant investment of time and effort into trading to be able to do the cool things. So I think from that lens, it's just skewed expectations and misplaced, misplaced hope kind of I think is a fair way to frame it. But there's a balance, right? Like the fact that I'm able to kind of control the day that comes through building an approach, but there are tradeoffs with that approach. There are some people that will stay strapped to the screen all day. Some of those people might be able to make more money, but the difference is I don't inherently want to do that. One of the reasons why I got into trading was literally to buy back my own time. So personal freedom, the ability to have choice. So you kind of lose some of that choice if you become really strapped to the screen, but there are people that I have on my podcast, the outlier podcast that, you know, like Tom Soznov, I like Tom. And there's a lot of things that Tasty does that I fundamentally disagree with, but the overall message in general tone and tenor what they do I fully agree with. But somebody like Tom is like just he's all markets. He's obsessed with markets, which is super cool. It's his passion. So for somebody like him, like being away from the screen is more of a punishment. So I think a lot of people that get into trading, they",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 55,
      "start_timestamp": "01:12:56",
      "start_timestamp_seconds": 4376.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=4376"
    }
  },
  {
    "text": "with. But somebody like Tom is like just he's all markets. He's obsessed with markets, which is super cool. It's his passion. So for somebody like him, like being away from the screen is more of a punishment. So I think a lot of people that get into trading, they get into it with really false expectations. And those tend to be the casuals. And those are the people that are not going to be in the business long. That's just the reality. They're going to be gone. They're going to be part of that massive wash out rate that you tend to see with certainty. Laptop says, did you place a limit order or you entered after the candle closed for the breakout trade? No, I don't do limit orders. Whenever you try to trade resting orders like that on options, it's typically a terrible choice. And it's because you're going to get eviscerated on a fill. So there's no way. All I do is I set alerts like you see, meaning like like this. So let's go back to a balance here. So coming into earnings, when we get into after the close, like these alerts here, that's what I do. And I see that alert all into the trade. Again, that's the cool part about being like a professional trader is you don't necessarily have a bunch of periods where you're really strapped from being able to do that. Now when I was on active duty in",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 55,
      "start_timestamp": "01:14:23",
      "start_timestamp_seconds": 4463.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=4463"
    }
  },
  {
    "text": "what I do. And I see that alert all into the trade. Again, that's the cool part about being like a professional trader is you don't necessarily have a bunch of periods where you're really strapped from being able to do that. Now when I was on active duty in the Marine Corps, much more difficult. And the performance that I had that's one of the things I'm actually starting to notice is part of me thought during my time in the Marine Corps that my performance was what it was. And a big part of that I think was me not actually understanding how much the circumstances I was in impacted my trading performance because my average PNL ever since I exited the Marine Corps has been literally massively better. My average PNL post Marine Corps is 53.3 and that includes two outlier years. Without those two outlier years, average performance is 27.34. If I look at average performance while in high school, college and then Marine Corps, average performance was 19. So my compound annual growth rate is better than those, but the average performance is what it is. So I think that's just something that I didn't fully appreciate until my time post Marine Corps because while on active duty, there really are a lot of issues that you have to deal with and like being on base when I was an operations officer, you have to use your security clearance and you have to go into",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 55,
      "start_timestamp": "01:15:42",
      "start_timestamp_seconds": 4542.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=4542"
    }
  },
  {
    "text": "fully appreciate until my time post Marine Corps because while on active duty, there really are a lot of issues that you have to deal with and like being on base when I was an operations officer, you have to use your security clearance and you have to go into these different rooms. We call them vaults and like you can't bring a phone in there. It's stuff like that. So. Shazette said videos about toss scan setups. Well, there's a video about scanning. It's not necessarily specific to toss. Toss is cool, but you can scan on anything. So yeah, that's more about like the general principles and concepts of scanning, which I think is more applicable. Cool. All right. So the last thing that I want to talk to you about is a pre-read for what we're going to be talking about next week. So when we look at what we've covered so far, we've had an orientation into the world of trading. We've discussed this idea of building an approach as a trader. So the next thing we're going to talk about is actually the process of executing, doing the thing. So it takes this general concept and it moves it into the application of the concept. So for this video, I'm actually going to be spending time talking to you about different things that I've done recently or plan to do. And I'm going to walk you through essentially the application of a trading skill set.",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 55,
      "start_timestamp": "01:17:19",
      "start_timestamp_seconds": 4639.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=4639"
    }
  },
  {
    "text": "and it moves it into the application of the concept. So for this video, I'm actually going to be spending time talking to you about different things that I've done recently or plan to do. And I'm going to walk you through essentially the application of a trading skill set. Now in order to make that session more useful for you, you will be far better off if you spend some time doing literally what we talked about today between this week and next week. And if you choose not to, that's okay. You choose not to, but I guarantee you, you will get far less out of next Friday's session if you don't do that. So recommend highly taking the time and actioning on some of what we talked about. It's easy to spend a lot of time talking about and brainstorming what might work, some good ideas. But there is a point where literally the rubber meets the road and you have to do the work. So that's where you are now. You have to start doing the work that we talked about. So as always, if you have questions, you can always hit me up in the discord. Be an outlier. You guys are?",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 55,
      "start_timestamp": "01:18:45",
      "start_timestamp_seconds": 4725.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=4725"
    }
  },
  {
    "text": "discord. Be an outlier. You guys are?",
    "metadata": {
      "video_id": "BKbkWTwx2zI",
      "title": "Building a Trading Approach - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=BKbkWTwx2zI",
      "upload_date": "",
      "duration": 4807.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 55,
      "start_timestamp": "01:19:57",
      "start_timestamp_seconds": 4797.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BKbkWTwx2zI&t=4797"
    }
  }
]