[
  {
    "text": "WARNING Audio file is very small 4386 bytes This transcript may be empty or incomplete because the audio file could not be properly downloaded. YouTube may have blocked download attempts for this video. you What's up, everyone? Welcome back to the outlier podcast. I got my friend and friendly face, Matthew Caruso from Caruso insights. What's up, man? Welcome back. Yeah, I think it's driving me back Eric. It's always a pleasure. Absolutely. Pleasure. We're sitting there kind of BS in for a little bit about how I essentially just the ultimate failure and it's kind of fun to figure out what other ways I can mess things up. But it's always good to talk to people like you that are figuring it out. You just had a really awesome trip over to Europe. I mean, talk to us about that. What do you think? For me, life, markets, everything's all one puzzle that's all wrapped up. So now having two small boys, like I said, being able to show them the history in person and Italy and Rome. And there's just just a phenomenal get outside, get into mountains, exercise and physical conditioning too. It was just wonderful trip. Great way to also rest the mind and recharge the batteries. Just fantastic. Yeah. Now, what kind of stuff did your boys really enjoy doing? What did they gravitate to? So it's so we started off in the mountains and we did some like mountain biking and just like being",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=0"
    }
  },
  {
    "text": "Great way to also rest the mind and recharge the batteries. Just fantastic. Yeah. Now, what kind of stuff did your boys really enjoy doing? What did they gravitate to? So it's so we started off in the mountains and we did some like mountain biking and just like being a lot outside. So they just love like and that's amazing thing about kids. They just love that freedom. They just like be out there and just explore open pastures. Mountains was great. And so it was funny that there was like the two extremes that part and they enjoyed the beach and pool like period, but they also just like loved Rome and the history. And so for me as a history lover, it's great. Like I was saying, show them like, Hey, like you see that balcony there? Like that's then you show them on your phone. That's where Mussolini was, you know, whipping up the crowds and all that like before, like World War II kicked off. And like even at like six years old, they're like amazed. And even for me, it kind of gives me chills to see it all like in the same place. So it's pretty awesome. It's also a good reminder like markets, everything and like things repeat and what to be aware of. So it was awesome. Well, and one of the cool things that you were telling me right before we started talking is that how your what one of",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 57,
      "start_timestamp": "00:00:43",
      "start_timestamp_seconds": 43.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=43"
    }
  },
  {
    "text": "So it's pretty awesome. It's also a good reminder like markets, everything and like things repeat and what to be aware of. So it was awesome. Well, and one of the cool things that you were telling me right before we started talking is that how your what one of your sons was like really starting to like pick up the gravity of things. And like I just feel like that's got to be so cool to be able to experience them experiencing that that's got to be just so fun for you. Yeah, like just for them to see how like the world, you know, they still see things very black and white, but to see them start to like connect the dots of how everything and how the world functions and you know, they grow up in a nice environment and then to see like, Oh, there could be bad actors out there and the repercussions and all that. So it's amazing to see it kind of almost relearn it through someone else's eyes again. It's it's a great experience. So cool. So cool. Dude, I love that. So one of the things I like to ask traders specifically that do stuff like that though is how do you set your portfolio when you go on vacation mode because funny enough I just telling you I was just in Alaska. And I had to go through a similar process that I always find interesting to try to describe",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 57,
      "start_timestamp": "00:01:34",
      "start_timestamp_seconds": 94.14,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=94"
    }
  },
  {
    "text": "specifically that do stuff like that though is how do you set your portfolio when you go on vacation mode because funny enough I just telling you I was just in Alaska. And I had to go through a similar process that I always find interesting to try to describe to people, but as you know, I love learning your approach to stuff. So what do you do with your portfolio before he bounts? You know, it's I feel like I'm cursed. If I go with a lot of positions, like the market tanks, if I go with no positions, the market rips. So it's like you kind of have been trouble. But you know, like I learned even on my honeymoon, I ended up spending way more money on losses than I did on my honeymoon because I became an attentive and positions won against me. So I I never fully disconnect because I I find even being completely away for three weeks, you lose that touch and that feel. So I'll always have a couple of things definitely watch every day, but just really reduce size. And I just I make sure that I can at least check market open. So I can put in stop orders if need be. And then I can go on my own. But you know, having like 30 exposure, not the same as having 120 exposure. So at least if you're you have light positioning and you just at least you're watching",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 57,
      "start_timestamp": "00:02:27",
      "start_timestamp_seconds": 147.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=147"
    }
  },
  {
    "text": "market open. So I can put in stop orders if need be. And then I can go on my own. But you know, having like 30 exposure, not the same as having 120 exposure. So at least if you're you have light positioning and you just at least you're watching you get the best of both worlds. You get to have like a a mind that's not overly kind of way down by markets. And at the same time, you keep your kind of feel with the market. Yeah, that's awesome. Do you find any benefit from not being as over the portfolio? I know for me sometimes, especially if I'm running more programmatic style trades, so definitely a little bit different than what you're doing. But if I'm like trying to churn out risk premiums, a big part of that is just occurrences. And sometimes it is not fun watching one of those occurrences burn into a fiery flame. And you're just like, okay, I guess I guess I should watch this. And at least for me, I find it easier. Cause it's just like I put the stuff on, put on the stops as I need them. And then I just check at the end of the day, I'm just like, how'd I go? What would we do? And it's like, okay, I lost on all of these terrible, but I don't care. Cause I'm going to go do this other really cool thing. Is there any element",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 57,
      "start_timestamp": "00:03:12",
      "start_timestamp_seconds": 192.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=192"
    }
  },
  {
    "text": "then I just check at the end of the day, I'm just like, how'd I go? What would we do? And it's like, okay, I lost on all of these terrible, but I don't care. Cause I'm going to go do this other really cool thing. Is there any element of that for you? Or is it mostly because I know you trade very differently and typically very concentrated. So it sounds like sizing down as a big part of how you set up like your day to day. But do you find any benefit from detaching a little bit more? I do, you know, every so often, like every like several months or at least like once a year, I try and take like a really step back and like question like the different elements of the approach. And like one, like I was a like market maker, like I lived markets, like I'd have like hundreds hundreds of trades a day, you know, and and then even as you gravitate to like more but position trading, like that stays in you, you know, so like so being able to step away, it's like, okay, can I can I do this? Like how much of my time is actually wasted or how much is is like working against me staring at the screens versus just losing stop orders? Because I you know, I have a lot of like clients and stuff that where they, you know, everything is just",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 57,
      "start_timestamp": "00:04:11",
      "start_timestamp_seconds": 251.42,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=251"
    }
  },
  {
    "text": "do this? Like how much of my time is actually wasted or how much is is like working against me staring at the screens versus just losing stop orders? Because I you know, I have a lot of like clients and stuff that where they, you know, everything is just functioned off of like, you know, trigger points and that. So I mean, it works for them, but then I I tend to just sit in front of the screen all day and watch price action. It's like, hey, is that actually helping or working against me? So like when you're your market making, obviously it's critical, but like in this environment, I mean, sometimes you'll cash that extra opportunity, but you got to weigh that against like, does it, you know, pull on your impulses to put on a trade you should end? I mean, we're all human. You still do kind of make those those impulse decisions sometimes. So it's nice to kind of like question like, hey, if I'm really away from the screens, you know, does it help or does it make it worse and what's the impact on? Like for me, touch and feels important. It's like I try and quantify as much as I can, make things as black and white as possible, but there's always a little bit of that like that innate gut feeling where like even if your your system tells you to be long, like you want to attack it",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 57,
      "start_timestamp": "00:05:00",
      "start_timestamp_seconds": 300.78,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=300"
    }
  },
  {
    "text": "It's like I try and quantify as much as I can, make things as black and white as possible, but there's always a little bit of that like that innate gut feeling where like even if your your system tells you to be long, like you want to attack it like with like the full aggressive posturing of your system, or do you want to like make it a little more relaxed? I find that confidence comes from that feel. So it's trying to kind of manage, manage both. Yeah, it sounds a lot like from Malcolm Gladwell's Blink and I think he's the right author for that book. There's a book called Blink and it's very much about subconscious processing and priming. So when you talk about that idea of like this touch and like the feel of the markets, it's funny because when you talk to people that don't really understand it, it's like very esoteric, it kind of just sounds whimsical like nothing. But then when you're actually like a practitioner of it, you get like I literally know exactly what you're talking about because I actually think it's a bigger part of what a lot of traders do, especially more discretionary traders that are not, you know, just algorithmic in nature. So when you're taking a step back in your analyzing what you're doing, you're kind of seeing like this process that I'm following, value-ad versus value-not-ad, do you have any examples of something that when",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 57,
      "start_timestamp": "00:05:46",
      "start_timestamp_seconds": 346.14,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=346"
    }
  },
  {
    "text": "traders do, especially more discretionary traders that are not, you know, just algorithmic in nature. So when you're taking a step back in your analyzing what you're doing, you're kind of seeing like this process that I'm following, value-ad versus value-not-ad, do you have any examples of something that when you're looking at it, you realize that this is not actually tremendous value-ad? Yeah, you know, it's sometimes it's the merging of, you're trying to merge like processes in your mind. So it's like there's certain tools and or applications that work well with how it's day trading. And so the impulse will still come out. Like you can see that in the short term, I can say it goes as a short term opportunity. But then after when you're positioning or what like it throws off a larger strategy, let's say you're not right about that move, then it affects your average cost. And so like sometimes, you know, even though it looks like a good setup in the short term, trying to like through impulse kind of merge two different approaches kind of work against you. But you know, but everything like you kind of touch on, it came more to the forefront for me. I was at one point, I got really deep into like kind of redalue when everything he did and like what he calls like kind of the golden system about how he manages risks with diversification, like which is very different from how",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 57,
      "start_timestamp": "00:06:44",
      "start_timestamp_seconds": 404.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=404"
    }
  },
  {
    "text": "came more to the forefront for me. I was at one point, I got really deep into like kind of redalue when everything he did and like what he calls like kind of the golden system about how he manages risks with diversification, like which is very different from how I approach things. I saw in several interviews where he like they asked him like what do you attribute your success to? Like in different interviews, different times, he's like meditation. For me, it's like I agree, it's like meditation. It was like the most unexpected answer I could have expected, you know, but I think as you go on with time as a trader, especially when you go through periods of drawdown, like when you're fresh, you're new, it's like let's go, let's go, let's go. And but then when you kind of get go through like the meat grinder a little bit, like you realize how like keeping your mind centered and focus is so that's almost the difference between those who end up succeeding and those are just drop off eventually. Yeah, it will and it's funny when you, you know, chuckle about the responsive meditation because one of the things that I find with practitioners that get good at pretty much anything they're doing over the long run, they essentially just boil things down into like these really seemingly simple things, but there are things that are done really well. I always get a kick out",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 57,
      "start_timestamp": "00:07:41",
      "start_timestamp_seconds": 461.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=461"
    }
  },
  {
    "text": "one of the things that I find with practitioners that get good at pretty much anything they're doing over the long run, they essentially just boil things down into like these really seemingly simple things, but there are things that are done really well. I always get a kick out of that, like even in the military, there's a bunch of times that you would talk to dudes about the way that they thought about this process. And the process itself can be insanely complex, like markets, but then they'll literally just boil it down to slow as smooth, smooth as fast. Like, what does that even mean? Like, what does that mean? What do I do with that? And it's really eye opening though. And I think it's important for people to hear those kinds of messages because it goes back to what I, what Leonardo da Vinci, I think he said, um, simplicity is the ultimate form of sophistication. And I love that line because I noticed people that get really good at trading or other things. They're really good at breaking things down into their core concepts, simple and doing them really well, really, really well. So that's an interesting one to hear from your perspective though, because I like the way that you're kind of talking about balancing those two parts, those two systems in the mind. When you're on your vacation, it sounds like you're like me where I still absolutely look at markets. And",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 57,
      "start_timestamp": "00:08:37",
      "start_timestamp_seconds": 517.66,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=517"
    }
  },
  {
    "text": "that's an interesting one to hear from your perspective though, because I like the way that you're kind of talking about balancing those two parts, those two systems in the mind. When you're on your vacation, it sounds like you're like me where I still absolutely look at markets. And for me, it's very rarely because like, I'm like a crack head and I'm like, oh, I just got to get a peak. Like, it's just because much like you, I love markets. It's, I enjoy them. So when you're looking at markets though in a pare-down sense, what are the really key things that you're focusing on? Like, if you already give somebody a cliff notes version of, if they're going on a trip and they're asking you like, hey, Matt, you know, what are some good things I should look at to be super efficient when I'm looking at markets? Was that look like? You know, it's, so it's fine that there's a, I'm sure you know the book Reminist is a stock operator. There's so many little things you can pull from that book. But I remember there was one chapter where he was talking about like a great trader and he would like pace back and forth across the room, but like with a predictable like, like, tempo, like, I think like every 30 minutes he'd go to the ticker tape and check a quote. And like part of the story was like, he basically eventually",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 57,
      "start_timestamp": "00:09:40",
      "start_timestamp_seconds": 580.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=580"
    }
  },
  {
    "text": "a great trader and he would like pace back and forth across the room, but like with a predictable like, like, tempo, like, I think like every 30 minutes he'd go to the ticker tape and check a quote. And like part of the story was like, he basically eventually let us all know that by checking like at a regular interval, if it's every hour or every two hours, you get a sense for how markets are reacting over those intervals. So instead of checking like after five minutes after four hours and after two minutes, like by having kind of like a more like systematic approach, you get a sense of like, let's say you check the first half hour of the day, you know, pretty much like volume price action, what goes on in the first half hour. So like I try even on vacation, have kind of like a different times that I'll regularly check. And also I just check for like the outlier moves, you know, like the outlier podcast, so basically, you know, who are like, especially if it's summertime, like I try and ignore all of the like, just the stocks of 1 down 1, like it's already kind of dramatic outperformance by stocks, like and beyond one day. So for up today is your fall through the next day or it's just like summer chop, summer churn. So just trying to try to try to at least like decipher if there's any",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 57,
      "start_timestamp": "00:10:41",
      "start_timestamp_seconds": 641.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=641"
    }
  },
  {
    "text": "down 1, like it's already kind of dramatic outperformance by stocks, like and beyond one day. So for up today is your fall through the next day or it's just like summer chop, summer churn. So just trying to try to try to at least like decipher if there's any sustainable trend or if it's just noise, like that's just kind of just trying to like get, you know, I have less time. So I want to focus on like what's the signal coming from the market? Got it. Yeah, I love that. So then when you're looking at the rest of your portfolio, though, like you're talking about you size down a lot, are you still ready to jump at opportunities if you see them? Or is it just kind of monitoring things, keeping a pulse, and then you'll really get back to things when you get back at the office? I'll do like a little bit like I just try and avoid getting fully invested like because then like your mind is distracted. You're like, you could be with the kids on a mountain top and you know, a dad come and play and then you're like, you're glued to your phone, which especially if like, you know, of course the way it is the next day, the markets will open up down and you're gonna have to like worry about who's getting stopped out and you're on your phone and then the connection maybe is not great.",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 57,
      "start_timestamp": "00:11:31",
      "start_timestamp_seconds": 691.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=691"
    }
  },
  {
    "text": "glued to your phone, which especially if like, you know, of course the way it is the next day, the markets will open up down and you're gonna have to like worry about who's getting stopped out and you're on your phone and then the connection maybe is not great. So to a certain extent, at least if you're like 50 invested, you know, there's only so much pain that can come from a mistake. So I still try and like keep myself on the reduced side of things just in case something goes awry, you don't have access or whatever happens. Yeah, yeah, makes a ton of sense. So talk to me a little bit about your perception of what the market's done so far this year. And actually one of the things I want to highlight specifically and get your take on was the series of moves essentially that started from the first of August, then over the second and then the fifth like those three days specifically were really interesting to me personally, but I'm curious if they were anything special to you or just what you made of that move there. So this year, it's a really interesting year because when we spoke about our own past podcasts together, like I always fall like to fall like the net highs, like number of stocks making 52 week highs versus 52 week lows. And that hasn't been very accurate this year. It's been very wonky because what",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 57,
      "start_timestamp": "00:12:21",
      "start_timestamp_seconds": 741.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=741"
    }
  },
  {
    "text": "really interesting year because when we spoke about our own past podcasts together, like I always fall like to fall like the net highs, like number of stocks making 52 week highs versus 52 week lows. And that hasn't been very accurate this year. It's been very wonky because what we're going through, like, bouts of inflation messes up the normal mechanics of markets. Like that's why like you saw like in the past couple of years, like, you know, the like the 60, 40 portfolios all kind of blew up because bonds. So so inflation breaks the regular like functioning of the market. The market still function, but the regular relationships go in opposite directions. And so I think coming off the bottom, we're starting to kind of get that rebound once inflation peaked even though the Fed had and cut rates and all that yet. But we entered in this thing like basically like a cable recovery, like they're saying, there's a few stocks are doing really great, but then there's a lot of stocks are not doing well, like not doing great at all, which not that every cycle everyone's doing fantastic, but like the disparity between the few and the many has been larger than any kind of normal cycle in recent in the recent past. So that's been exacerbated with AI and how large caps have led. And again, if you go back historically, if you look at like each year, who's like like the",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 57,
      "start_timestamp": "00:13:17",
      "start_timestamp_seconds": 797.26,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=797"
    }
  },
  {
    "text": "the few and the many has been larger than any kind of normal cycle in recent in the recent past. So that's been exacerbated with AI and how large caps have led. And again, if you go back historically, if you look at like each year, who's like like the the biggest two or three stocks at the SP 500, those don't tend to be the market leaders that year because they're so big, they're so kind of cumbersome. They'll go up with the market, but they're not going to lead. So this combination of like the AI push and like inflation causing this cable recovery is as make things very wonky this year. And so and you can see the how like when the small caps broke out like late July, you had a flurry of stocks making 50s and you guys and at the same time, the Nasdaq rolled over hard. So you have this very weird like small caps and large caps were almost like inversely correlated for a couple of weeks. So I think I think we're still kind of nursing the hangovers of all of the inflation and all the stimulus, which I think once we finally get inflation back down to line, again, normal nature of the market just it gets everyone to think that, hey, those tools don't work anymore or that that process doesn't work and then it goes back into line and everything works again. So I think the way the",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 57,
      "start_timestamp": "00:14:16",
      "start_timestamp_seconds": 856.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=856"
    }
  },
  {
    "text": "we finally get inflation back down to line, again, normal nature of the market just it gets everyone to think that, hey, those tools don't work anymore or that that process doesn't work and then it goes back into line and everything works again. So I think the way the market's been reacting was like you mentioned those days specifically is I think the market's shifted from an inflation concern to more one of recession. And also I think a lot of the the AI hype that's really driven a big part of that like spread between the halves and have knots. It's kind of like show me the money now like people spent a lot of money on cap X. It's been a lot of like enormous market cap gains. Is that going to actually come to fruition? I think through earnings it hasn't been a good earnings season. So there's a bit of like concern with that. So I think there was a bit of that catch of move within the whole yen carry trade like was this giant bomb that like exacerbated everything and again we're still having these rebounding ramifications. So I'm hopeful that once we kind of get inflation back to normal, all the regular relationships are going to work and I can already see a lot of companies that are acting well that I think once we kind of get ourselves back into a healthy uptrend, we'll have like the very normal action of",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 57,
      "start_timestamp": "00:15:08",
      "start_timestamp_seconds": 908.14,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=908"
    }
  },
  {
    "text": "kind of get inflation back to normal, all the regular relationships are going to work and I can already see a lot of companies that are acting well that I think once we kind of get ourselves back into a healthy uptrend, we'll have like the very normal action of these nice mid cap stocks outperforming and all the rest. There's like 62 questions I want to ask you at once. There is a ton of really cool details. I'm going to start with specifically the relationship between small caps and large cap. So a lot of what you were talking about in terms of just price behavior totally made sense. Now what are your thoughts on the rationale behind the seemingly I wouldn't call it inversely correlated personally but maybe not correlated or something but definitely a not normal correlation that I feel very confident saying I just don't know what the numbers are off the top of my head. But when you're looking at large and small, what do you make of the relationship there and how it got so defiant? So I think again because of the K-shape recovery, it just made sense that I think funds started to move to the safety of large companies who had pricing power and all the rest and then I think AI just kind of fell into their lap. They were already kind of a long large cap and like shying away from small cap for that reason. Then AI",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 57,
      "start_timestamp": "00:16:04",
      "start_timestamp_seconds": 964.22,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=964"
    }
  },
  {
    "text": "started to move to the safety of large companies who had pricing power and all the rest and then I think AI just kind of fell into their lap. They were already kind of a long large cap and like shying away from small cap for that reason. Then AI was just this big like, oh whoa, right place, right time, let's take off running and they went for the liquidity. But it's interesting because and again, it's how kind of like the current situation shapes the narrative but people will say like now often like, oh, you know, funds prefer large cap stocks which is true. But if you go back to like the cap M and all the pricing models, like a you know, efficient market theory and all that kind of stuff, like at one point small caps were always out performing large. And so they even had kind of like a like a like a like a like a like a how can I put it like a specific like outlier situation where like oh, small caps will kind of outperform because they're higher risk. So that's why you'll tend to you know that you'll tend to kind of do better than what would be efficient. So like they made it that's they made an exception for small caps like 20 years ago, but now because they've underperformance like oh no large caps will outperform because like liquidity is there and all that. So the narrative",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 57,
      "start_timestamp": "00:17:17",
      "start_timestamp_seconds": 1037.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1037"
    }
  },
  {
    "text": "to kind of do better than what would be efficient. So like they made it that's they made an exception for small caps like 20 years ago, but now because they've underperformance like oh no large caps will outperform because like liquidity is there and all that. So the narrative changes over time. But in general in a normal market cycle, correlations should be generally positive. I mean, no, it's the rising tide lifts all boats like usually if Microsoft's doing well, it's because they're selling office subscriptions to small medium-sized businesses. It's very rare that the largest five are doing phenomenal and everybody else is not. So I think it's a weird moment in time which happens, which is kind of a combination of inflation, safety trade, then suddenly like an infrastructure rollout that kind of popped out out of nowhere, which I think will kind of come into line and we're going to see the normal relationships show up soon. I see. Next question. What did you make of the velocity of small caps on the way up first? So kind of talking about that gap day, was it like the the 11th or the 12th and then the subsequent like three or four days after that? What I know that you're a student of markets and market history and price behavior. Did you make anything specific of the velocity of that move? So that was my concern. So even like with clients who are saying like, oh,",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 57,
      "start_timestamp": "00:18:10",
      "start_timestamp_seconds": 1090.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1090"
    }
  },
  {
    "text": "the subsequent like three or four days after that? What I know that you're a student of markets and market history and price behavior. Did you make anything specific of the velocity of that move? So that was my concern. So even like with clients who are saying like, oh, you know, now that we have these net highs, do we have this big bull market starting now because like small caps took off. And so my concern, and this is like where the gut instinct will still kind of come in because you have this indicator and just knowing that there's some weird kind of issues going on because of this disparity. But what I think happened was that just like what the yen carry trade that blew up, it was the crowd of trade. Everyone was large, long large cap tech, short small caps. And then we just went the other way really quickly as things started to reverse. So I think it was just more of a big short squeeze like an basically a long squeeze on the long push people out both directions. And that's why you just got so incredibly negatively correlated because I think that was just funds way off base way overly concentrated being blown out in both directions. And so that's why I think now you can see that that relationship has kind of fallen back into a little bit more normal seed than what it was for a little while there.",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 57,
      "start_timestamp": "00:19:04",
      "start_timestamp_seconds": 1144.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1144"
    }
  },
  {
    "text": "that was just funds way off base way overly concentrated being blown out in both directions. And so that's why I think now you can see that that relationship has kind of fallen back into a little bit more normal seed than what it was for a little while there. Got it. Okay. And then same question for the drawdown side of things. I personally thought it was really interesting that we saw Russell pop. I mean, it was like one of the largest moves it's had in its history over a seven day period. It was just incredible. And then over a three day period, it literally undies all of it. I was like, I was sitting there. I was just like, what is going on? Like that's crazy to me. And I always thought it was a little bit of just a overly reactive market, like very emphatic is what it seemed like to me. Like just people, it's funny. You mentioned the idea of like this rapid repositioning because that's what it felt like. That's kind of what I was seeing. But the way down typically quicker, but did you make anything special about that three day period, essentially where it just undid that entire move? Yeah, I think it was just easy come easy goes. Whenever like and sometimes the market, there's that there's so many elements of this market. It's like long term, like yeah, fundamental price action will fall, fundamental in the short term",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 57,
      "start_timestamp": "00:19:58",
      "start_timestamp_seconds": 1198.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1198"
    }
  },
  {
    "text": "period, essentially where it just undid that entire move? Yeah, I think it was just easy come easy goes. Whenever like and sometimes the market, there's that there's so many elements of this market. It's like long term, like yeah, fundamental price action will fall, fundamental in the short term positioning is what dominates. Like I mean, the fundamentals could be what they want, but if everyone is short, you're going to get let me look at the game stop. I mean, like that's the extreme example. But like even if that's like, you know, in theory, the extreme point, there's different variations of that. So just like the carriage trade, I mean, look at the Nika, like the entire index, like what are they? I think the third largest economy in the world, you went from like all time highs to like 30 correction, like biggest drops since 1987 within two weeks. And that's because positioning was so extreme. And again, we spoke about that K kind of recovery where some are benefiting and most are not. Well, even if that's the case, getting overly one-sided, then brings up these other kind of risks. And it's not that for I mean, other times I've traded, I remember the carriage trade blown up in the past and you always see this kind of, you know, the oil trades blown up, the gold trades, every so often a trade blows up somewhere. So always be cautious when it's like a very",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 57,
      "start_timestamp": "00:21:04",
      "start_timestamp_seconds": 1264.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1264"
    }
  },
  {
    "text": "I mean, other times I've traded, I remember the carriage trade blown up in the past and you always see this kind of, you know, the oil trades blown up, the gold trades, every so often a trade blows up somewhere. So always be cautious when it's like a very obvious positioning, like you need to be careful. Yeah, yeah, interesting. Yeah, that's helpful context. Now, when you look at the movement post drop, so moving from the fifth until essentially today, what do you notice between the indices? Does anything stick out to you there? Yeah, so we bottomed, VIX hit was 65, so it was a clear that at least in the short term, it was extreme. Either we were going to rebound or we were going to crash. So I mean, I think Bank of Japan backed off, which was the like the crisis of that moment. So I think, you know, we started our rebound today. I think it was a little bit more of surprising that we are so strong. Today, I think it's because PPI was low and they're expecting low CPIs or result tomorrow. And again, I think so many people got like sold out of that drop. There's just that kind of recovery coming back up. So I think it's just the normal mechanics. It's really hard to tell if if the market isn't like still embarking on a deeper correction because of a weakening economy, which I think it is, I",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 57,
      "start_timestamp": "00:22:05",
      "start_timestamp_seconds": 1325.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1325"
    }
  },
  {
    "text": "sold out of that drop. There's just that kind of recovery coming back up. So I think it's just the normal mechanics. It's really hard to tell if if the market isn't like still embarking on a deeper correction because of a weakening economy, which I think it is, I think the economy is weakening and the feds behind the curve. If you look at like the federal funds rate and two-year yield, they're like they're always late. So I think they're late again. So just kind of buying off, you know, it's like just falling prey to that formal on the way back up. Like I would at least want to see a bit of a retest, like coming down two, three days. Like how do you react when some selling pressure coming comes back in? So this is kind of the vacuum back up because we had the vacuum down. And I think now the next few days are going to be telling maybe we get a V recovery straight to the highs. That's happened historically, but it's very rare. It's very rare. If you go and study every drop that's like an excessive 10, it's very rare. You don't at least have, even COVID, like you bottomed hard, you ran up for three, four, five days and you had a little bit of a higher low. And then you went and that was the fed like throwing everything it could at the market. So to have a",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 57,
      "start_timestamp": "00:23:03",
      "start_timestamp_seconds": 1383.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1383"
    }
  },
  {
    "text": "You don't at least have, even COVID, like you bottomed hard, you ran up for three, four, five days and you had a little bit of a higher low. And then you went and that was the fed like throwing everything it could at the market. So to have a real complete V to all time highs, very, very rare. So we'll see I, I think the market had the easy rebound. Like I said, because of that vacuum and the next coming next few days going to be important. What do you make of the relationship between large cap and small cap? Now that's one thing I found interesting. It seems like large cap has been exhibiting very similar to what you're talking about. This almost parabolic now rise back up. Whereas it seems like small cap is already started consolidating. Do you make anything there? I feel like, you know, the same trade that was going on earlier was put on again. Like I think, especially if you look at semis, like semis, I mean, the semi conductor index, I think felt 30 from its highs into the drop early August. So again, funds that were blown out or those that were in blow and they had, it's like, hey, let's put that trade back on again. You know, like, like, positions back to normal. So I think you're just seeing a little bit of that trade put back on pretty clear. It's like three or four days",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 57,
      "start_timestamp": "00:23:53",
      "start_timestamp_seconds": 1433.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1433"
    }
  },
  {
    "text": "or those that were in blow and they had, it's like, hey, let's put that trade back on again. You know, like, like, positions back to normal. So I think you're just seeing a little bit of that trade put back on pretty clear. It's like three or four days where large caps, like easily outperform small caps. But again, looking at the charts, even of the semis and like the larger players, this is still that normal little bounce off the bottom. So running into their averages, very, every, I never seen a bear market where you didn't have at least bear market rallies. So it's really become that uptrend. You learn more about the pullbacks and an uptrend than you do on the rally. So waiting to really see if we get two or three days, four days correction. Do we just kind of flop over hard or is it, is it bought into by funds? Yeah, that's a really interesting point. What did you make of the by volume on the fifth is an indicator of the way they might think about that? Because I was actually a little surprised to see how strong the buying started to come in on the fifth when it just started to take a bite. Do you think that that's informative whatsoever about what they might do if it gets back down to that level again? Or do you think it's a completely new problem set at that point? I think,",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 57,
      "start_timestamp": "00:24:48",
      "start_timestamp_seconds": 1488.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1488"
    }
  },
  {
    "text": "to come in on the fifth when it just started to take a bite. Do you think that that's informative whatsoever about what they might do if it gets back down to that level again? Or do you think it's a completely new problem set at that point? I think, like, I mean, I've seen enough of these these panics enough, like for sure, some phone calls went off and, you know, the people in the know were told like, okay, okay, bankage of pans in a back off. They're not going to keep raising rates. Don't worry about it. We're not going to crash. We'll support more. So someone got the phone calls. Like, I think that Monday morning to like alleviate like panic. And so you saw that like even I bought, like, I was lucky. I had had no positions going into where I had just like one but it's like utility. It was was like untouched. And so I mean, I did a little bit of buying that morning. But like, once you get that like initial burst off of the bottom, it's like, okay, where do we go from here? So I kind of like eased out a little bit out of things. And and now it's waiting to see how we consolidate. It just so happens that we end up going back a little more parabolic. But again, I think it's because people are slamming on that same kind of large being long large",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 57,
      "start_timestamp": "00:25:40",
      "start_timestamp_seconds": 1540.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1540"
    }
  },
  {
    "text": "eased out a little bit out of things. And and now it's waiting to see how we consolidate. It just so happens that we end up going back a little more parabolic. But again, I think it's because people are slamming on that same kind of large being long large semis, which what's strange about what's exacerbating the weirdness of this market is that sometimes people like latch onto a trade could be like, you know, other cycles oil was the hot trade or whatever. It just so happens that the stocks that are the hot trade now are like the biggest market cap stocks in the market. So if you're, you know, if you're ramming up these like seven eight stocks like broad common video and that's enough to move the whole market and then everyone kind of just in unison. So it's a it's a particularly odd market because the speculative names are the largest cap names, which is never usually the case. So it's going to be interesting to see what comes next. Yeah, that's a really interesting point. Honestly, one that I hadn't thought too much about the I mean, if you look back to early 90s, like when the internet was becoming a thing like IBM wasn't like the hot stock of the market, you know what I mean or like if you go back to like, you know, early 2000s, like it it wasn't, you know, I don't know, Exxon mobile that was the",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 57,
      "start_timestamp": "00:26:29",
      "start_timestamp_seconds": 1589.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1589"
    }
  },
  {
    "text": "90s, like when the internet was becoming a thing like IBM wasn't like the hot stock of the market, you know what I mean or like if you go back to like, you know, early 2000s, like it it wasn't, you know, I don't know, Exxon mobile that was the hot stock of the market going up and down like crazy. But like now that's what it is. I mean like Nvidia is maybe not the largest market cap anymore, but close enough and you know, up 7 one day down for like though that's kind of like the actually usually a small cap stock. So pretty wild. Right. Yeah. What do you think about the current positioning of things in the economy with respect to the perspective recession? I think we're slowing it. We just had home people come out this morning saying that the consumer's slowing. So I think your you know, Starbucks been having a hard time. You're seeing it a lot of different places and it makes sense. I mean, we went from zero to five and a half percent in a straight line. I think there was like that excess, you know, COVID savings lying around that's been fully worn off here. So I think we're clearly seeing the slowdown. That's why inflation's coming down. And you know, as investors, it's always easy to kind of like play one day, you know, quarterback for the Fed like all they should do this and do that.",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 57,
      "start_timestamp": "00:27:21",
      "start_timestamp_seconds": 1641.66,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1641"
    }
  },
  {
    "text": "around that's been fully worn off here. So I think we're clearly seeing the slowdown. That's why inflation's coming down. And you know, as investors, it's always easy to kind of like play one day, you know, quarterback for the Fed like all they should do this and do that. But if I was the Fed, I would rather be a little extra hawkish and see the market break down and see a small recession and see inflation ignite again. Like it's far easier to resuscitate like a small recession than to like re kind of anchor people expecting a lot of inflation. If that happens, you set off a decade of trouble. So it's like I get what Powell's doing. Like he's going to be it's always the kind of easy to play the blame game like, oh, they're going to put us into a recession. Like I think the US economy is far stronger than anyone would have expected with five and a half percent like federal funds, right? Like far stronger, which so I mean, I don't I don't see a big usually a big bear market comes around when something systemically breaks or you go into like a hard recession. Like I don't not really see that. I think this is like normal corrective stuff because it was like large caps got ahead of themselves. I think if we even correct a little bit longer and further, it's like we just set up like a really",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 57,
      "start_timestamp": "00:28:11",
      "start_timestamp_seconds": 1691.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1691"
    }
  },
  {
    "text": "like a hard recession. Like I don't not really see that. I think this is like normal corrective stuff because it was like large caps got ahead of themselves. I think if we even correct a little bit longer and further, it's like we just set up like a really strong potential bull market. What I mean, think about it once once inflation gets re anchored at 2 you have like a new kind of massive productivity boost like with AI, which could be someone like the internet. We'll see how it develops whether it does or it doesn't. But markets are already generally strong. Economies are strong and the feds about to go to begin a rate cut cycle. So I mean, it's pretty it's pretty wild to have like all that going on. I mean, we don't know who's going to become president, but let's say it's it's Trump and he also that has more like tax cutting policies. So you'll get like, you know, stimulus from tax cuts. You'll get stimulus from fed rate cuts. You have maybe a potential AI productivity boom. So I mean, if all that work to come together, that shapes up for like a multi year like super bull market. I mean, there's a lot of variables there, but we'll see something to be really, you know, optimistic about I think. You mentioned being close to a rate cut cycle, which I agree with, right? We can kind of see that through",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 57,
      "start_timestamp": "00:29:09",
      "start_timestamp_seconds": 1749.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1749"
    }
  },
  {
    "text": "like a multi year like super bull market. I mean, there's a lot of variables there, but we'll see something to be really, you know, optimistic about I think. You mentioned being close to a rate cut cycle, which I agree with, right? We can kind of see that through the bond market. What do you think about small cap positioning right now, though, in relation to that? I think there's going to be a catch up move. You know, it's it's awful because I think small caps got hammered twofold, which is frustrating for people because the inflation, you know, they didn't have good pricing power. And now recession hits them first before. I mean, you're more likely to not go to your local store than not get an iPhone. So they kind of got hit both sides. So I think it's just a lead to basically everyone being out of small caps, even midcaps. I mean, never we say small, even mid. I mean, this has really been just a large cap game has been where like all the heat has been. So that's why I think that all these like I said, things like rate cuts, things like rate cut cycle, all this is going to benefit. I think everyone outside, I mean, large cap is one now, but on a relative basis, I would imagine that once we turn the corner, mid and small, they're going to have like some epic, epic runs that we haven't",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 57,
      "start_timestamp": "00:30:06",
      "start_timestamp_seconds": 1806.06,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1806"
    }
  },
  {
    "text": "like rate cut cycle, all this is going to benefit. I think everyone outside, I mean, large cap is one now, but on a relative basis, I would imagine that once we turn the corner, mid and small, they're going to have like some epic, epic runs that we haven't seen in a long time, I think. That was honestly my assessment as well, but it's also part of my current confusion, because I think it's a big part of what we saw that original run in small caps in that it seemed like we thought we were on the cost of these rate cuts and kind of starting a front run that move. And then what surprises me now, though, is that it seems like the probability of a rate cut is even higher in small caps or kind of just lay in there. I haven't been really able to make heads or tails of that yet. Sometimes it's just a timing thing. You know, like I've noticed that in my career. So like sometimes I've missed out on some epic opportunities, because I was super long. Like, it doesn't happen for like one month, two months. And you say, oh, maybe I'm just like wrong about that idea, but then it's like six months later, it kicks off. You know, so sometimes I like, I've just noticed, like I've just, if I feel I have a good story, like it's always practice risk management first, like I'd rather",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 57,
      "start_timestamp": "00:31:01",
      "start_timestamp_seconds": 1861.26,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1861"
    }
  },
  {
    "text": "say, oh, maybe I'm just like wrong about that idea, but then it's like six months later, it kicks off. You know, so sometimes I like, I've just noticed, like I've just, if I feel I have a good story, like it's always practice risk management first, like I'd rather be wrong five times under perform, but my capital is intact. Like I really don't care. But then after one, if it is right, then you nail it. But then some it's really just actually going back to reminisces to stock operator. There's like a cool story he talks about where like he finally learns like how to short and all this kind of stuff and he gets his right positioning. He's like, I got everything right, but I didn't realize, you know, I saw this big heap of gold. There was like a wheelbarrow at a shovel help yourself. I didn't realize there was a time lock. And I ran too fast. I fell. I tripped and I missed all the gold and I ended up losing money. So like that time element, and just sometimes I think as traders, we can see better into the future than others. But then after we kind of get ahead of the actual market itself. So sometimes it's just patience, I think. Yeah, I think that makes sense to it's funny when you were talking about the timing element because I think you just about perfectly described the Russell trade that I",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 57,
      "start_timestamp": "00:31:57",
      "start_timestamp_seconds": 1917.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1917"
    }
  },
  {
    "text": "But then after we kind of get ahead of the actual market itself. So sometimes it's just patience, I think. Yeah, I think that makes sense to it's funny when you were talking about the timing element because I think you just about perfectly described the Russell trade that I had on the beginning of the year that just did nothing for two months. And I was just like, all right, man, I guess I'm just the village idiot. Okay. So then I moved on to something else, but I set a bunch of alerts because I was just like, I just know that this, I just know this is going to pop at some point. So I'm going to get it all in five days and you weren't positioned yet. I was actually super stoked because as soon as it made that first gap up, I missed the like the first half of that first days gap up. I missed that gap up. But from there, as soon as I saw that, I was just like, load the boats, bro, I just folded everything into it. And then I kind of just trend followed it down a little bit. I actually have a video coming out soon talking about more specifically the strategy I used a ratio called diagonal. And I use that trade as the vector just because it's a recent one that was kind of entertaining because I get to talk about how dumb I was at",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 57,
      "start_timestamp": "00:32:40",
      "start_timestamp_seconds": 1960.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=1960"
    }
  },
  {
    "text": "I actually have a video coming out soon talking about more specifically the strategy I used a ratio called diagonal. And I use that trade as the vector just because it's a recent one that was kind of entertaining because I get to talk about how dumb I was at the beginning of it. But yeah, I was like, I was sitting there. I was just like, I don't know if I'm pissed off right now because it took so long to happen. But then it literally is essentially made the years worth of moves in like six days. So how mad do I get to be? And I haven't really figured that out yet. I'm still pretty pissed off though because in the beginning, I was just looking left looking right and I was just like, what's happening? What's smoke? Do something. Well, if you think that makes you upset. I had position SMCI. So this year does one of the best. So last year at, let me look at my chart here. So from like June, it was a 200. I had like, I had built a big portfolio. Like I think I was like like a 40, 50 position in SMCI portfolio from like 200 up to like 340. And then earnings were sour or kind of gaped down. So I got out of it with like, you know, some profit, but less profit. And like I'm watching and there was so many failed attempts. And all",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 57,
      "start_timestamp": "00:33:35",
      "start_timestamp_seconds": 2015.18,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2015"
    }
  },
  {
    "text": "50 position in SMCI portfolio from like 200 up to like 340. And then earnings were sour or kind of gaped down. So I got out of it with like, you know, some profit, but less profit. And like I'm watching and there was so many failed attempts. And all of a sudden, like January, it's like lagging and really keep you up at the market. And all of a sudden from 300, you're 1200 is like the trade of the year. I'm like, use anyways. That was like again, being a little bit early sometimes. And that's just and how to have that same position would have been like, wow, like epic year again. Yeah, yeah. What can you do? That's exactly how she goes. Well, and you also know exactly what would have happened if you stayed in the trade, you personally would have crashed SMCI or whatever reason. If you had stayed in that trade, SMCI wouldn't have made that move. Something terrible would have happened. And it would have sounded like shit, I should have got out. I've learned to reconcile that the market is one of the only forces I've ever met that can make two people with opposing positions simultaneously wrong. And there has a reason. As a slick way of doing it too, because you did something different, but we both lost how? I don't know how anyone who's traded long enough can be a getistical. I don't know. To me, it's impossible.",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 57,
      "start_timestamp": "00:34:29",
      "start_timestamp_seconds": 2069.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2069"
    }
  },
  {
    "text": "two people with opposing positions simultaneously wrong. And there has a reason. As a slick way of doing it too, because you did something different, but we both lost how? I don't know how anyone who's traded long enough can be a getistical. I don't know. To me, it's impossible. It's like, if you have an ego after trading for like five, 10 years plus, wow, there's something special about every single person I know has traded for a living is a very like centered person like, okay, that's that's what the market gave me and like just move on, you know, like it just it'll grind you into the ground if you let it. So I literally couldn't agree with you more. There's actually a saying that I use with people at home like, do you want to be right or do you want to make money? And I know there was some people who really like, you know, the skill set of being able to be right. Actually, Jim Ropel is wonderful. I asked him that question. He's like, he's like, no, I want to be right. And I was just like, okay, that's totally fair, man. Because like some people really, really like that process. And in that process, they get to make money. But for me specifically, and I think for a lot of people that have egos, it's really important, at least for me to always put like first things first, which is I could",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 57,
      "start_timestamp": "00:35:28",
      "start_timestamp_seconds": 2128.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2128"
    }
  },
  {
    "text": "like some people really, really like that process. And in that process, they get to make money. But for me specifically, and I think for a lot of people that have egos, it's really important, at least for me to always put like first things first, which is I could be completely wrong in make money. All right, can be completely right and lose money. But the important part is figuring out a system to interface with the market and make money in the long run, which is the whole whole kit and caboodle for me at least. I think I still would. Sorry. No, I'll say like I found that markets go through like repetitive three, four month cycles. Like every three, four months, like the whole, you get a new wave and new winners come out. So like, you know, I've been trading professionally since 2008. I started trading 2003, 2004. Like I've seen these cycles so many times. And sometimes you get them so like I've had like some really epic runs in three, four months, like, you know, multi hundred percent returns. And other times it's like your lag for 12 months is 18 months where you just like, you're making a bit, but you just, you just can't get it to connect. So like, when you go to that cycle multiple times, you just realize like, okay, it's one of those cycles and you just have to learn to be centered and not like blame",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 57,
      "start_timestamp": "00:36:25",
      "start_timestamp_seconds": 2185.18,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2185"
    }
  },
  {
    "text": "you just like, you're making a bit, but you just, you just can't get it to connect. So like, when you go to that cycle multiple times, you just realize like, okay, it's one of those cycles and you just have to learn to be centered and not like blame yourself or not go off and change everything and just stay centered and stay focused because like it's just this recurring cycle of being sometimes super right. But then other times just not getting it. So well, you also said something there that I think is really important because I find trading in general is like the, the art of balance. You got to balance so many things. And to your point right there, like if you miss time a cycle, there's, you have to have enough self scrutiny to look at what you did and make sure that you did programmatically what made sense. But to your point, sometimes the market is just going to throw something else. And I'm actually curious how you think about solving that dichotomy because you can't put your hands up and just be like, oh, the market is just doing whatever the market does and not hold yourself accountable. But you also can't punish yourself into the dirt because if you do that, the market to your point will continue to humble you. Do you have any thoughts about like how to reconcile those two things as a trader? So it's funny. You",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 57,
      "start_timestamp": "00:37:22",
      "start_timestamp_seconds": 2242.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2242"
    }
  },
  {
    "text": "does and not hold yourself accountable. But you also can't punish yourself into the dirt because if you do that, the market to your point will continue to humble you. Do you have any thoughts about like how to reconcile those two things as a trader? So it's funny. You speak of Jim Ropel. So I, you know, I talk with Jim sometimes and he's super nice guy. And there's something I kind of stole from him. He calls him guardrails, you know, like things that you just want to make sure you don't make like a serious mistake. So like what I've, I've tried to do like cycle after cycle is like, what was the biggest mistake that caused like like, like, there's always going to be small mistakes, but those can be watched away. Like, were there any like, like more serious mistakes? And so I kind of like trying line up different rules to be those guardrails to not make them again, you know? So like, for example, like looking back at the past, like, you know, year and a half, I always focus on small midgaps. That's always just where all the actions always been. So it's like, I saw Nvidia. I saw that I had relative strength that had earnings and sales and all that kind of stuff, but just wasn't a focus of mind, you know? So because I always figured like, you know, it's already a trillion dollar company. You're really going to",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 57,
      "start_timestamp": "00:38:19",
      "start_timestamp_seconds": 2299.66,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2299"
    }
  },
  {
    "text": "it's like, I saw Nvidia. I saw that I had relative strength that had earnings and sales and all that kind of stuff, but just wasn't a focus of mind, you know? So because I always figured like, you know, it's already a trillion dollar company. You're really going to triple from here in six months. Well, yeah, apparently you want. So, but, no, like the bingo cards. Yeah, exactly. You know, but again, like so it's like you have the rules of like relative strength will all like if you if a stock won't go down when the market is down, like last to me, like looking back at a video in March of 2023 when there was that like banking crisis that everyone forgot about happened for like a couple of months. When the markets all kind of sold off and like Nvidia was still like climbing and either climbing or just going dead sideways, like that was you don't need to know the news. You almost don't even know to know, you need to know earnings and sales. If the market's going to drop 10 and you're like at least a mid cap or higher. So you're not just like a small cap story. If you won't fall when the market's falling 10 or 15 somebody does not want to sell you or somebody wants to buy every single share they can get. So to me, it's like again, for this past cycle, looking at it, you",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 57,
      "start_timestamp": "00:39:13",
      "start_timestamp_seconds": 2353.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2353"
    }
  },
  {
    "text": "not just like a small cap story. If you won't fall when the market's falling 10 or 15 somebody does not want to sell you or somebody wants to buy every single share they can get. So to me, it's like again, for this past cycle, looking at it, you know, I always put a lot of weight on the net highs and it lows, but I think that the most important factor for me above all, no matter how each cycle as I study things, that relative strength, like and that comes through in the corrections. Like even now we had this correction, everyone's going to go back and look at let's say micron or SMCI that were hot last cycle, but those are not the ones that held up well in this cycle the same way. There's new names. There's new things going on. So again, like why chase micron that's fallen 30, 40 when something like Palantir is already back at 52 week highs and barely budge during like the market sell off. So it's like every cycle again, you get that opportunity and have those guard rails. So you don't make that same kind of mistake you made on a prior cycle. Eventually, as long as you manage risk, you're going to kill it then one of the cycles and do great. Yeah, that's awesome. I love that. What a great way to look at it. When you look at the market behavior this year, one",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 57,
      "start_timestamp": "00:40:00",
      "start_timestamp_seconds": 2400.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2400"
    }
  },
  {
    "text": "you made on a prior cycle. Eventually, as long as you manage risk, you're going to kill it then one of the cycles and do great. Yeah, that's awesome. I love that. What a great way to look at it. When you look at the market behavior this year, one of the things I like to do is just try to decouple different inputs on the markets and just try to assess the overall impact. It's just kind of general curiosity for me. And the election part of this year is weird because there's a lot of other things going on. And the election has its own personality and the impact that that can have, especially with the latest change in candidacy. It looks like Kamala, it will be the democratic nominee when everybody is originally expecting Biden until pretty recently. So when you look at this kind of election year, how do you think that that impacts markets broadly? Because to me, it's competing with interest rates, kind of other things at the same time. Yeah, and this is an important one because it's not like Canadian politics, it doesn't matter, right? But you know, but like I'll tie, especially outside Canada, it doesn't really matter. But this cycle, the view of the two people, Trump versus Kamala, it's dramatic differences in what their view is for the economy and what the impact will be. I mean, I try and even with clients be politically neutral, but there's one",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 57,
      "start_timestamp": "00:40:54",
      "start_timestamp_seconds": 2454.06,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2454"
    }
  },
  {
    "text": "especially outside Canada, it doesn't really matter. But this cycle, the view of the two people, Trump versus Kamala, it's dramatic differences in what their view is for the economy and what the impact will be. I mean, I try and even with clients be politically neutral, but there's one thing to me that's not neutral. It's just like economic outcomes. I'm a free market person, low taxes person, free competition, no monopolies. And that's what leads to the long-term success of countries and nations. So for a moment to look at Trump had kind of a sure victory, whether you love him or not, that's a net positive for the economy and for markets. In Kamala, where news is funny, no one really seemed to like her six months ago or even ever see her. And now, suddenly, it's like, she's supposed to be the favorite, this favorite candidate almost at an overnight. But her economic views, which I'm not even very sure of, from what I understand, her father was even like a Marxist professor. So she's always, she's always been kind of on the very, very left side of the spectrum, even how she's voted and stuff. So those are all policies that are negatives. And I think sometimes people don't even realize how fast negative economic policies can impact the country. Like we have a left leaning person here, true to one Canada. And from when since he took election, like we're like the lowest, you",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 57,
      "start_timestamp": "00:41:59",
      "start_timestamp_seconds": 2519.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2519"
    }
  },
  {
    "text": "So those are all policies that are negatives. And I think sometimes people don't even realize how fast negative economic policies can impact the country. Like we have a left leaning person here, true to one Canada. And from when since he took election, like we're like the lowest, you know, productivity growing country in the G7, like we've the spread between US growth and productivity in Canadian growth, growth of productivity is like widened, I think, to near like historic levels. Like it makes a, it may not be in three months, but fast forward four or five, seven, eight years. And you can have some really dramatic changes to an economy for like, for the worse. So I think it makes a big impact. And I think when, until markets figure out which way it's going to go, there's going to be some flip flopping back and forth. But ultimately, I think will be a big, big net positive if Trump was elected. Or at least if his economic, you know, ideas come to fruition over Kamala's. And how do you think the market is perceiving those two outcomes right now? Because one of the things I've been looking at from the options market is just the positioning in the options chains right around the election. And there's probably what you would imagine. I see it most years with an election is just a lot of hedging. There's a lot, a lot of relatively long term hedges being",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 57,
      "start_timestamp": "00:43:10",
      "start_timestamp_seconds": 2590.06,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2590"
    }
  },
  {
    "text": "looking at from the options market is just the positioning in the options chains right around the election. And there's probably what you would imagine. I see it most years with an election is just a lot of hedging. There's a lot, a lot of relatively long term hedges being put on, which it's been slightly anomalous this year is that they started going on earlier than I typically would expect to see them. But do you think that there is any positioning within the market kind of like in a holding pattern until we get closer to seeing what that's actually going to look like or now? Yeah, I think so. And like I said, you know, there's those multiple tailwinds that are coming. And you know, the Trump one, you know, or those economic policies is a wild card. And I mean, if you have like, let's say a fed cutting cycle coming in or even let's say a productivity boom, but then if you have someone who's who puts up more regulation or as more like really poor fiscal spending, at least to inflation that prevents the rate cut like there's there's bad like, you know, fiscal policies that can ruin these other tailwinds that are are building right now. So it's a big it's a big wild card. And so I think part of part of the last leg up was I think a little bit of excitement over like Trump leading in polls. You saw",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 57,
      "start_timestamp": "00:44:09",
      "start_timestamp_seconds": 2649.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2649"
    }
  },
  {
    "text": "policies that can ruin these other tailwinds that are are building right now. So it's a big it's a big wild card. And so I think part of part of the last leg up was I think a little bit of excitement over like Trump leading in polls. You saw like crypto getting, you know, a bit of a boost as even like he's kind of leaning more positively there. And so then I think just the massive positioning and then everything also Kamala kind of coming through and like raising kind of odds of her waiting the presidency. I think that also kind of weighed on the market drop. So just kind of like a little perfect storm that hit like late July, early August with Japan and all this kind of stuff at once. So I think definitely it's going to be it's going to make things wild the next few months. And I don't I don't know which way it's going to turn out. So it's going to be interesting. Yeah. And I know we're coming up on time. I don't want to hold you too late. But a follow on to that though. Then is how do you personally think about approaching markets then leading it to the event? Because like you're talking about, because I agree with you, like to me, it seems like the outcome of the election, whichever way it goes, it will mean something for markets. So for me, I, well, I",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 57,
      "start_timestamp": "00:45:06",
      "start_timestamp_seconds": 2706.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2706"
    }
  },
  {
    "text": "do you personally think about approaching markets then leading it to the event? Because like you're talking about, because I agree with you, like to me, it seems like the outcome of the election, whichever way it goes, it will mean something for markets. So for me, I, well, I mostly trade shorter term anyways, to be honest. Like let's just keep it up a buck here. You boy, it's like if it's a three week trade, that's an eternity. That is like I am geriatric at that point. I am yeah, I mean, just what I don't even know what to do with all that time. So the vast majority of my stuff is two weeks maybe. So for me, the general game plan I'm using is just kind of honestly like trading the general book leading into, but I am actually avoiding more thematic positions that I typically would put on. Like one of my favorite things to trade is just general positive drift in the market. Super simple trade, not much goes into it, size it down, use options, just say LaVie and come back to it in six months. Now I don't have that on. And part of it is because the recent market activity, but also because I have some reservations about how this could go. So in your opinion, how do you set yourself up leading into the election, understanding that it can have a pretty big impact? It's hard. It's one of those",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 57,
      "start_timestamp": "00:45:58",
      "start_timestamp_seconds": 2758.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2758"
    }
  },
  {
    "text": "part of it is because the recent market activity, but also because I have some reservations about how this could go. So in your opinion, how do you set yourself up leading into the election, understanding that it can have a pretty big impact? It's hard. It's one of those things like, you know, month to month week to week is all this this macroeconomic data. So you have to kind of like separate your views and even like some stuff we're talking about is longer term. Like let's say, let's say, it's a like and she doesn't have great economic policies. Like, you know, at the same time, like you want to avoid like this concern is not going to be this overnight. Like, oh, she's going to trash the economy. And like, I just think, you know, she's going to be more of the policies we have, which will generally favor larger companies way a little more like in terms of smaller companies and all that kind of stuff. So like, I don't think we'd have a, I mean, I think though of Trump, we're to get elected. He's like a faster moving kind of guy. He wants to like implement things quicker and he's got like, and what he would implement would be quite a change from the current. So I think if he would come and be kind of more upside quicker, but I think if Kamala, like, ends up winning, I think it's just a",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 57,
      "start_timestamp": "00:46:58",
      "start_timestamp_seconds": 2818.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2818"
    }
  },
  {
    "text": "to like implement things quicker and he's got like, and what he would implement would be quite a change from the current. So I think if he would come and be kind of more upside quicker, but I think if Kamala, like, ends up winning, I think it's just a little more status quo. We just want to continue to watch. I see. I'm just doing all for us. So like, if anything, that may, which is I think good for the US in a sense, you have almost like an asymmetry where I don't think she would be terrible. Right. Or policies immediately longer term depends on what she would do. But Trump, I think if you would win, would be kind of a pretty immediate like positive, I think, for markets. I see. Got it. Yeah. Last question before we sign off here, what are your favorite things that you're looking at right now? So like, like I mentioned before, I get excited. Like, I don't always catch every uptrend perfect, but I've never been caught in a big downtrend. Thankfully, you know, knock on wood, you know, so, again, I was cached up for this drop. So, and I was not that I was killing it before. So at least I, you know, I didn't kill it on the way up. I didn't get killed on the way down. But again, now is that great time where you can see who didn't fall in this market draw.",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 57,
      "start_timestamp": "00:47:52",
      "start_timestamp_seconds": 2872.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2872"
    }
  },
  {
    "text": "and I was not that I was killing it before. So at least I, you know, I didn't kill it on the way up. I didn't get killed on the way down. But again, now is that great time where you can see who didn't fall in this market draw. And so I'm watching stocks. Like I said, I mentioned Palantir, which is, I think Palantir is really interesting because their growth is really picking up. If you look at their sales growth, not only are they're growing, but the rate of their revenue growth is accelerating, which is phenomenal. And they're on like key themes, like obviously AI, defense spending and all the rest. So they're really interesting. Then after we're looking at some other like the large caps, like meta is held in great. I think meta is someone where like data has become all the more valuable with AI and all the rest. So I think they're just going to find more and more tailwinds like monetize all of that and reach out to new people. So again, they held in very well. There's just a lot of great names that did not break down with this market environment. And a lot of them are midcaps. You know, there's things like Kava, which is the restaurant, Mediterranean restaurant group. There's just so many I can name. Like a service now is more large cap held in well. So it's just really keeping on all those stocks. I",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 57,
      "start_timestamp": "00:48:49",
      "start_timestamp_seconds": 2929.42,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2929"
    }
  },
  {
    "text": "market environment. And a lot of them are midcaps. You know, there's things like Kava, which is the restaurant, Mediterranean restaurant group. There's just so many I can name. Like a service now is more large cap held in well. So it's just really keeping on all those stocks. I did not break down that are already trading at 52 week highs. Some of them with the market still quite a ways off. So they are like so they are all very, very being closely washed to me looking for some kind of consolidation. See what the market does after this initial bounce when it kind of corrects. But it has been very exciting because every time you have these corrections, those stocks that don't fall, then they'll become the epic winners for the next three to four months. But you need the market to participate. That's always that's always like that key thing. I always know which stocks will work, but you never quite know when that market will bottom. And until the market it's like it's that anchor on them. So you have to kind of still need to get that timing right. But I think there's some clear leaders that are really kind of coming through, which is nice to see. Yeah, that's awesome, man. What a great note to end on. Plus, I mean, we can also just shout out the fact that the prospect of getting timing right for you, Boise, about no. So I'll",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 57,
      "start_timestamp": "00:49:37",
      "start_timestamp_seconds": 2977.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=2977"
    }
  },
  {
    "text": "clear leaders that are really kind of coming through, which is nice to see. Yeah, that's awesome, man. What a great note to end on. Plus, I mean, we can also just shout out the fact that the prospect of getting timing right for you, Boise, about no. So I'll continue to mess up all the timing on all of those, even though you gave me the script. I'll still dork it all up. But dude, absolute pleasure always hanging out with me. I like I absolutely love having the opportunity to pick your brain, learn from you every single time I get to walk away with a few nuggets. So thanks for hanging out. I will definitely send a, you know, in the description below all the links to your website newsletter, which is great. Your ex profile, but is there anywhere else that you want to send people to? I'm also on YouTube. I try and increase posting frequency outside the summer. Summer gets a little bit, you know, I get a little bit slower sometimes, but you could also chat. Everyone's watching on YouTube. So if you look me up on YouTube, you'll find me too. Beautiful. Yeah, I'll tag you in this so that it'll pop up on your stuff too. So that they'll get get over to your channel. They definitely should. So thanks for hanging out. Thanks for hanging out. Everybody else being outlier. And we'll see you guys later.",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 57,
      "start_timestamp": "00:50:33",
      "start_timestamp_seconds": 3033.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=3033"
    }
  },
  {
    "text": "Yeah, I'll tag you in this so that it'll pop up on your stuff too. So that they'll get get over to your channel. They definitely should. So thanks for hanging out. Thanks for hanging out. Everybody else being outlier. And we'll see you guys later.",
    "metadata": {
      "video_id": "BrLsg_ig6uk",
      "title": "Finding Strength w/ Matt Caruso | The Outlier Podcast Ep75",
      "url": "https://www.youtube.com/watch?v=BrLsg_ig6uk",
      "upload_date": null,
      "duration": 3101.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 57,
      "start_timestamp": "00:51:23",
      "start_timestamp_seconds": 3083.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BrLsg_ig6uk&t=3083"
    }
  }
]