[
  {
    "text": "What's going on everybody? Big day today, the markets were very, very active. We have this scenario where the E minis the SP 500 futures are up as well as volatility. This is not the relationship that most people think in terms of you never see volatility rise with something like the SP 500, but it does happen from time to time. Now, this past weekend obviously was a little bit tumultuous and I think the market is trying to digest what happened. We talked a little bit about this during a couple of live streams this weekend, so I'm not going to dive far into that. Just know that the market right now is more active. That's the way I would look at it. We had the SP 500 up 0.4. The small caps have been flying off the handle. They are now almost I mean take a look from there open on the 10th. We came in at 2048 and a half in we hit a high of 2219 and this is over the course of four trading days. That's just an insane rally. A lot of this has to do with the market trying to price in who they think is likely going to be the next. The president and then discounting the subsequent impact that that will have on the markets. That's the broad nutshell of what's going on here. That's a big reason why you're seeing the Russell responds so strong because the current restrictive",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=0"
    }
  },
  {
    "text": "who they think is likely going to be the next. The president and then discounting the subsequent impact that that will have on the markets. That's the broad nutshell of what's going on here. That's a big reason why you're seeing the Russell responds so strong because the current restrictive environment in terms of rates is difficult for small caps to survive. They are able to obviously maintain, but it's been a really tough year for small caps for at large. If you take a look over at the financial sector, which is a pretty big component. These are all just small financial and small relative to the SP 500. They're smaller. Most of them are still pretty large market cap over a billion dollars. But it's difficult. The current environment is difficult for them. So with the expectation now of Trump potentially winning the presidency again. I'm not here to be political. I don't care. I'm just talking about what the market is seeing. And you can look at things I shared this again over the weekend. The Bloomberg terminals and there's a lot of websites that project the probability of the outcomes. That's literally all that's happening here. So that's something you should be aware of just the broader environment that we're in. But more importantly, let's take a look at GameStop because we have a lot going on here. We are now breaking up above this point of control that's been established for some time now at",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 16,
      "start_timestamp": "00:00:44",
      "start_timestamp_seconds": 44.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=44"
    }
  },
  {
    "text": "So that's something you should be aware of just the broader environment that we're in. But more importantly, let's take a look at GameStop because we have a lot going on here. We are now breaking up above this point of control that's been established for some time now at like 26 and a half. We closed today at 27 up 3.65. It's one of our bigger days recently. And it's still on a relative small basis. There's nothing to be super excited about just yet. But there are the conditions forming that get interesting. So there's a lot of conversation about some of these different cycles that might be coming up. We know from the live stream this past weekend with Newton that he's looking at August still for this next tailwind cycle. And we're doing another live stream this coming Saturday. So you guys can check us out on that one as well. Same time in place 5 p.m. Pacific time on YouTube live. But to this I'm seeing this floor continuing to race. We are slowly slowly ascending here. If I take us into like a 30 day chart, you can see that we are creeping up and up and up. So the moving averages are starting to align that kind of stuff. I always am careful to say that I don't really care that much about a bunch of standard technical analysis in here because the way that this moves is so different. That's not to",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 16,
      "start_timestamp": "00:02:06",
      "start_timestamp_seconds": 126.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=126"
    }
  },
  {
    "text": "and up and up. So the moving averages are starting to align that kind of stuff. I always am careful to say that I don't really care that much about a bunch of standard technical analysis in here because the way that this moves is so different. That's not to say somebody said in a comment that they thought I was scared to do technical analysis because people might try to beat me up for doing that. It's not at all. It has everything to do with me understanding how this product moves. And I'm very cautious to say, well, this is support and then this is resistance in something like this that just it doesn't care. It doesn't care. It's built on a much broader functional back end that leads to this kind of behavior, right? Because here's your support. Then it got broken and completely violated. And then here's your next support. Like the probability of a normal product going from 18 to 64 in a couple days, then back down and then back up from 22 hitting a high of 50 almost that's that's not normal. That's what makes it so special. So I reiterate that to people so that they understand that I'm a trader. That's what I do is I look at things to trade. But it is really important to understand the individual products and the nuances of them. And this is a very nuanced product. Speaking of all of the nuance, let's take",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 16,
      "start_timestamp": "00:03:12",
      "start_timestamp_seconds": 192.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=192"
    }
  },
  {
    "text": "people so that they understand that I'm a trader. That's what I do is I look at things to trade. But it is really important to understand the individual products and the nuances of them. And this is a very nuanced product. Speaking of all of the nuance, let's take a look now at the options because things are getting interesting. And I want to start with is this right here. Right now at the 30s, expiring 19 July, there was over 40,000 volume transacted today. Now I am very eager to see what this transaction volume is going to look like tomorrow. We can get some ideas, right? So if we grab a tool like this, you can use thinker swim it also has this sort of information. This just makes it a little easier to see, I believe. So if we come in here and we look at this coming expiration cycle and we limit us to the 30s. The reason why I want to do this is because I want to see of that 40,000. Why? How many of those are buying or sales? Because my guess is if the majority of that volume is buys, that's a lot of added pressure. So this is right now filtering by purchases. And I see a thousand there. It doesn't look like a ton. So then let's take a look at sales. And it also doesn't look like a ton. So it looks like a bit of a mixed",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 16,
      "start_timestamp": "00:04:28",
      "start_timestamp_seconds": 268.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=268"
    }
  },
  {
    "text": "a lot of added pressure. So this is right now filtering by purchases. And I see a thousand there. It doesn't look like a ton. So then let's take a look at sales. And it also doesn't look like a ton. So it looks like a bit of a mixed bag is what I'm picking up here. The stuff that transactes at the mid you can't really tell what's going on there. Let's take a quick look in this filter, which will give us a little bit more of a comprehensive view. And I will filter it by just the calls. I want to look at just this series and I want to look at the 30s only. And we'll get a sense of kind of how many were bought versus sold. The reason why I'm doing it in here is platforms like unusual whales. They're limiting by larger transactions. They're not showing us every single transaction. They're trying to find the more interesting things right like the whales. This is time in sales. This shows us everything. So you'll see that the vast majority of volume today, interestingly at the 30s. Actually, it was pretty small. So we see these blocks of 20s and then it just drops to small trades. We have 15s, tens, tons of those tens. And as I scroll through this, it's a healthy mix of buys and sales. That's what I can tell. So right now I'm just scanning for the colors literally and",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 16,
      "start_timestamp": "00:05:34",
      "start_timestamp_seconds": 334.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=334"
    }
  },
  {
    "text": "these blocks of 20s and then it just drops to small trades. We have 15s, tens, tons of those tens. And as I scroll through this, it's a healthy mix of buys and sales. That's what I can tell. So right now I'm just scanning for the colors literally and I'm kind of making a general guess at the lean of the colors, which it does look like slightly green heavy buys, but there's a lot of sales in here too. So this just looks like a ton of transactions. That's kind of the takeaway from this, at least in my perspective is we are seeing a lot of people transacting at those 30s. It's very busy. But a lot of that does not look like buys, which that's why it is hanging out up here with over 40,000 contracts traded today. It's massive. So we also had a couple other interesting strikes pop up. So from a volume perspective, you can see we had 254,000 volume against 58 so massive massive call skew. And if I show you the volatility really fast to give you a sense of how this skew is lining up, it's very standard where we are still seeing way more put. So it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 16,
      "start_timestamp": "00:06:51",
      "start_timestamp_seconds": 411.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=411"
    }
  },
  {
    "text": "are still seeing way more put. So it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not so it's not s fromDOI I think it's a delicious dessert salad. It's super expensive. But I think it's a delicious dessert. But I think it's a delicious dessert. Have a choice always T and hard. So that's why this gets treated with a little bit more respect in terms of the fall pricing. Now going out into 16 aug for a quick comparison, you can see",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 16,
      "start_timestamp": "00:07:54",
      "start_timestamp_seconds": 474.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=474"
    }
  },
  {
    "text": "think it's a delicious dessert. But I think it's a delicious dessert. Have a choice always T and hard. So that's why this gets treated with a little bit more respect in terms of the fall pricing. Now going out into 16 aug for a quick comparison, you can see it actually has this little bit of a bow right there. That's interesting. And that's a little bit less normal. They're starting to see the 25s pop up out in aug even more so than the 19 July's, which is fascinating. That inversion is not normal. And I find that interesting as I've probably mentioned. So what am I seeing from all from a volatility perspective, I'm seeing some slight anomalies. I'm seeing this front expiration not being heavily priced into the upside. I'm seeing the put side continued to skyrocket as per usual. And I'm seeing a lot of instances of inversion, which is kind of backwardation in certain instances for the same strikes, but nothing mind blowing here. Now let's go back into open interest really quick so they can get a sense of what this all looks like. We're up to 815,000 total calls against 480,000 puts. So this gap is still continuing to now contract again. We saw an expansion, the contraction between calls to puts and it is continuing to narrow, not tremendously so, but definitely seeing a lot of put transactions here of the puts that traded today, 29 of them were at the",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 16,
      "start_timestamp": "00:08:48",
      "start_timestamp_seconds": 528.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=528"
    }
  },
  {
    "text": "So this gap is still continuing to now contract again. We saw an expansion, the contraction between calls to puts and it is continuing to narrow, not tremendously so, but definitely seeing a lot of put transactions here of the puts that traded today, 29 of them were at the bid or below. So that tells us that people are selling puts. And then we had 26 at the offer above the vast majority of call volume today was at the offer or above. So opening positions, people buying options. Now I want to take one other look back at the volume, but I want to limit it by this 19 July cycle because there's an interesting trade series right here. This 19 July 24, 27 and a half. The volume is not anything too crazy compared to everything else you're seeing on this 27 and a half's had 7800 contracts traded. So why am I calling that out specifically? Well, it's because they had a little bit of a pretty serious block come through today. So let me show you all get rid of these 30 so that you can see everything. And take a look at these right here. There was a trade that came through that was worth 327,000. It was for 35 51. This was part of a series of orders that totaled 35 51. Now if you go through the rest of this chain, there are a couple other 27 and a half's. The reason",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 16,
      "start_timestamp": "00:10:14",
      "start_timestamp_seconds": 614.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=614"
    }
  },
  {
    "text": "here. There was a trade that came through that was worth 327,000. It was for 35 51. This was part of a series of orders that totaled 35 51. Now if you go through the rest of this chain, there are a couple other 27 and a half's. The reason why that matters is because while this platform might not be joining them together for us, it looks like there's more of them. So it's very likely that the person that put on those original 27 and a half's probably put on some of these other ones. So if we take a look here, there was another 101 that came through that kind of was picked out through what six transactions ish. So somebody was building a little bit of a position. There is a lot about the 27 and a half's that I find so interesting. A big part of that is one. It's for this coming expiration cycle to those started coming through at essentially the open 0 639 Pacific time is when that first tranche of 35 51 came through and then at 0 8 0 8, we saw another 99 of the 27 and a half's come through. Then at 1224, we saw another 101 of the 27 and a half's come through. So this was something that was phased in throughout the day is what I can see. So if we take a look at these 27 and a half's the OIs very small is",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 16,
      "start_timestamp": "00:11:28",
      "start_timestamp_seconds": 688.42,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=688"
    }
  },
  {
    "text": "come through. Then at 1224, we saw another 101 of the 27 and a half's come through. So this was something that was phased in throughout the day is what I can see. So if we take a look at these 27 and a half's the OIs very small is literally 2200 again, I remind you guys this all the time. Notice how illiquid these compared to these. This is exactly why people tend to trade in the round number strikes. You'll almost always find that the round number strikes are going to have more liquidity than others. It's not always there's anomalies, but the vast majority of instances that's what you'll see and it's for the sake of liquidity. So the fact that these 27 and a half's came through at 7800 contracts today with only 2200 open and we know a good majority of those probably at least 4, 5,000 of them are probably opens is very interesting. Now I see people speculating, well, somebody might be buying these to exercise them. They could be and there's an incentive to do that from a settlement perspective with delivery from exercise options. The problem with the theory is it requires essentially lighting this money on fire. You're giving up all of the capital you pay. Why is that because this is all extrinsic value? That's all extrinsic value. So if you exercise that's gone, there's no intrinsic value in those options. So if this person put on something to",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 16,
      "start_timestamp": "00:12:39",
      "start_timestamp_seconds": 759.66,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=759"
    }
  },
  {
    "text": "requires essentially lighting this money on fire. You're giving up all of the capital you pay. Why is that because this is all extrinsic value? That's all extrinsic value. So if you exercise that's gone, there's no intrinsic value in those options. So if this person put on something to the tune of 4,000, 5,000 contracts, the 3,500 contract itself was 327,000. So you're talking like a 400,000, 500,000 position somewhere in that range, depending on where they got their fills and they would just be lighting that on fire. If the intention was to buy those to exercise them, could still happen. If the idea is you exercise them to cause demand, the calculus could be, well, I'll make more on the rest of the position than the cost of the 400,000, 500,000. I'm going to be eviscerating. I have a hard time believing that because that's still a ton of money on something that's very speculative, but it's not outside the realm of possibility. I'm just providing the thought process behind it so that you can evaluate for yourselves what you think is most likely. As I continue to remind you guys, I am not here to spread hype or fud. I am here to do my absolute best to do what I do as a trader, which is look at information, process it as objectively as possible, and then come to as best of a conclusion as I can based on the breadth of evidence available to",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 16,
      "start_timestamp": "00:13:51",
      "start_timestamp_seconds": 831.66,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=831"
    }
  },
  {
    "text": "hype or fud. I am here to do my absolute best to do what I do as a trader, which is look at information, process it as objectively as possible, and then come to as best of a conclusion as I can based on the breadth of evidence available to me. So what does that look like? Somebody is choosing to transact at the 27 and a half. That's a very purposeful strike. Again, most of us that do this at least full-time professionally, whatever you want to call it, these would be the go-to's because they're more liquid. This is already giving up money by going to this as compared to something that's five-wide. You're going into something that's seven points wide for whatever reason. Weird from the start. Second thing, building out the position throughout the day, that shows conviction in whatever they're trying to do. The overall delta is here 50. So if we start to see in a accommodating move, it could be with the idea that if we get a big, strong move in our favor, there is a pretty significant amount of OI building in these out of the monies. If you'll notice right out of the money, there's 6,600 at these 27s with 11,000, so more of those are being added. But then 2200 at this 27 and a half with 7,800 being added. So it literally could even be from the perspective of trying to build out a ramp. So absolutely, absolutely",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 16,
      "start_timestamp": "00:15:13",
      "start_timestamp_seconds": 913.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=913"
    }
  },
  {
    "text": "out of the money, there's 6,600 at these 27s with 11,000, so more of those are being added. But then 2200 at this 27 and a half with 7,800 being added. So it literally could even be from the perspective of trying to build out a ramp. So absolutely, absolutely fun to watch. The last thing I want to highlight from this quickly is we are seeing different explorations being hit. So in 816, we saw a trade come through for 378,000 at the 40s. Then 8,9 at the 29s. We saw 343,000 come through. Then at the 26s, 1018, 232,000 come through. So we're starting to see some size coming into this. And I've been doing this every day for a reason because it allows me to track the progress incrementally and share it with you guys. And this is relatively new. We haven't seen necessarily this level of severity as of late. So this is actually kind of exciting to see these kind of trade sizes starting to roll in. And we will see what that has in store for us. So as always, if you have any questions or anything you want me to take a look at, let me know through it in the comments. Be an outlier. See you guys later.",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 16,
      "start_timestamp": "00:16:15",
      "start_timestamp_seconds": 975.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=975"
    }
  },
  {
    "text": "at, let me know through it in the comments. Be an outlier. See you guys later.",
    "metadata": {
      "video_id": "BSRH0cjr3PE",
      "title": "GME Options Chain Getting Active",
      "url": "https://www.youtube.com/watch?v=BSRH0cjr3PE",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 16,
      "start_timestamp": "00:17:25",
      "start_timestamp_seconds": 1045.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=BSRH0cjr3PE&t=1045"
    }
  }
]