[
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "you you you you you you you you you you you you what's up our lawyers happy wednesday welcome to general stock market update today we just go through the market see what sticks out to us anything interesting and yeah that's the the game plan for today there's a few specific there's a few specific things that I think we should discuss today specifically vix i think we should talk about the fed i think we should talk a little bit about the recent employment data and some individual names probably want to take a look at and video test i'm just looking at a dashboard that i built i also think NFE and i-rin i want to take a look at and then qbts same thing with SLV and we have a really a bunch of things that i want to run through today but there's always if there's anything that's also top of mind for you guys absolutely let me know i'm more than happy to take a look so the market right now is literally none of my alerts have kicked off which is you could see where i'm looking in spy the 685 and the 677 handles this is the area to be in my opinion so right now i don't really view anything that happened today is super bullish bearish definitely leans slightly more bullish than bearish but it's still in this range and the for those that aren't like fully up to speed",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 338.0,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "677 handles this is the area to be in my opinion so right now i don't really view anything that happened today is super bullish bearish definitely leans slightly more bullish than bearish but it's still in this range and the for those that aren't like fully up to speed with where at least some view in the market right now it's as long as the market remains in this consolidation zone it's in the consolidation zone so i cannot definitively say up or down when it's sideways this is also one of the periods where trading things like the cover triangle in index ETFs is actually quite useful and the process of making a bit of a video about one of the management approaches that i use in stuff like that to help manage time frames like this because if we really think about it the market had a bit of a rally back here on 28 October and it's in effect gone down slash sideways that from there that's what we've seen little bit of an up move than a little bit of a down move again this isn't like any sort of crazy down move but a little bit of a down move little bit of an up move like this range is box is been the the case for a little while now having a solution to trade during markets like that especially if you're trying to do this at a consistent level you have to",
    "start_timestamp_seconds": 314.0,
    "end_timestamp_seconds": 408.0,
    "start_timestamp": "05:14",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=314",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "little bit of a down move little bit of an up move like this range is box is been the the case for a little while now having a solution to trade during markets like that especially if you're trying to do this at a consistent level you have to have something to do during stuff like this and there's a bunch of things that i like to take a look at but one of them is maintaining the long beta through the coverage triangles and the indices but then also is the speculative bag and i was just doing a little bit of my monthly aAR sharing where the portfolio is at this was yesterday on the stream yesterday i was sharing just some portfolio level metrics but suffice it's a say so far this has been a really really good year or me right now it'll it's firmly third best and potentially the second best but it's a little too early to tell my expectation is a little bit more towards second best but we're a few minutes in so let's see who's found their way in i see Reese Kirk ZX Lauren Brain great to see you all brain says was just in the middle of watching your doomburg discussion cool yeah that's for those that are unaware there is a podcast that came out earlier today i try to do podcasts those come out on Wednesdays when i have them i target two a month and",
    "start_timestamp_seconds": 384.0,
    "end_timestamp_seconds": 486.0,
    "start_timestamp": "06:24",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=384",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "all brain says was just in the middle of watching your doomburg discussion cool yeah that's for those that are unaware there is a podcast that came out earlier today i try to do podcasts those come out on Wednesdays when i have them i target two a month and this last month actually we did i want to say a hundred and change so a decent number of podcasts for sure also shredder what's up good to see you thanks for coming to hang out and i'm looking forward to poking through the markets with you guys but let's take a look quickly at where things sit from abroad market lens there are a few really really important trends that are worth your attention the first one for those again that are more kind of in the cadence to streams you know that i look a lot at breath and breath here looks okay we see the percentage of s and p companies above a fifty period moving average is now over fifty percent which is good that is exactly what we want to see especially longer term and the reason for that is it shows that the rally or the current price action isn't being hyper siloed in just a very few number of names which is important you can have a certain number of companies move the market and support the market and as much as we like to joke that like in videos single handedly popping",
    "start_timestamp_seconds": 462.0,
    "end_timestamp_seconds": 557.0,
    "start_timestamp": "07:42",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=462",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "or the current price action isn't being hyper siloed in just a very few number of names which is important you can have a certain number of companies move the market and support the market and as much as we like to joke that like in videos single handedly popping out the market which again video is a massive impact on the market but if in video is doing really well in somehow everything else was not doing well yes and be would be down in video is super important but it's not everything now again that's not how markets work if in videos doing well that typically means a lot of partners and stuff doing well but in a vacuum that otherwise would be the case so looking at broad participation is in your general interest when you're trying to get a sense of like how do I feel about the markets broadly how do things look at a high level and this is actually really important because we're seeing slight expansion and net highs lows across your exchange and as that that's a really useful metric because it doesn't need to continually grind higher but what it does need to not do is grind lower after it peaks so it can oscillate above zero and have some level of positive net highs lows and the oscillations completely normal but it needs to not trend down and the print today is it not trending down which is good there's",
    "start_timestamp_seconds": 532.0,
    "end_timestamp_seconds": 643.0,
    "start_timestamp": "08:52",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=532",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "need to not do is grind lower after it peaks so it can oscillate above zero and have some level of positive net highs lows and the oscillations completely normal but it needs to not trend down and the print today is it not trending down which is good there's a couple downsides to the market right now one of them is all is at 16 that starts to become a little oppressive for general vault trading strategies especially in the indices it's way way way way more constrained now so for example is your d to easy yesterday and today we're very good on Monday they were not good and one of the funny things is if you take a look at where all was on Monday, all was a little bit higher but all has been steadily trickling down now again vix is 30 day of all so it's not exactly same same but it's a good proxy for what you're going to see across the curve. because of that behavior the way that I look to trade markets does change a lot and it's because the risk to reward profile for what I'm doing changes pretty significantly and a literally give you a direct example let's go back I'll find some zero d to ease from like November 20th let's find something from around there. Okay so I see one here from the 17th and on this. I'm seeing effectively collecting for a short. Strangle wrapped around",
    "start_timestamp_seconds": 616.0,
    "end_timestamp_seconds": 730.0,
    "start_timestamp": "10:16",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=616",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "and a literally give you a direct example let's go back I'll find some zero d to ease from like November 20th let's find something from around there. Okay so I see one here from the 17th and on this. I'm seeing effectively collecting for a short. Strangle wrapped around like a 28 and 26 delta short call short put respectively those are giving me like almost two dollars more than what I've been getting the last couple days. That's really really important because when I'm taking that risk of intro day, if I'm not compensated well enough for that risk then when we have losing positions then the strategy doesn't do as well and actually the last three days is a perfect example. Because the loss that came through on the first of December which again Monday the loss of the first of December is enough to overwhelm the winds for both of these days it's very mind really so it's like just negative but nonetheless it is negative one losing trade to two winning trades. That happens when ball gets really really compressed and it's because when ball is really really compressed we would expect to see a higher wind rate for these things. But this is where having a nuanced understanding of volatility is very very important and it takes time to get it because a lot of times people are used to more so. What we would refer to as like the tasty methodology which again",
    "start_timestamp_seconds": 688.0,
    "end_timestamp_seconds": 816.0,
    "start_timestamp": "11:28",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=688",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "higher wind rate for these things. But this is where having a nuanced understanding of volatility is very very important and it takes time to get it because a lot of times people are used to more so. What we would refer to as like the tasty methodology which again is it's a starting point I don't actually agree with some of the court concepts of it and I'll explain to you why. All of this stuff is measurable so as I talk about it you should take what I say with the grain of salt and you should try and test for yourself because you'll learn a lot. But if we take a look at vix as a general level right so let's say that this is vix zero and let's say that this is vix a hundred. Generally speaking what your typically told is when ball is high so let's say that this is like 80 and up that we should sell and then when ball is low we should buy. The issue is depending on where you're at on this scale this is it's almost backwards not quite backwards but almost backwards and it's because it's it's playing a couple incorrect things one of which is like the mean reversion of ball and when that actually occurs which again we can literally look at it in vix and see how long it clusters before it goes through a transitory phase but. In here normally what's happening is",
    "start_timestamp_seconds": 795.0,
    "end_timestamp_seconds": 895.0,
    "start_timestamp": "13:15",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=795",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "playing a couple incorrect things one of which is like the mean reversion of ball and when that actually occurs which again we can literally look at it in vix and see how long it clusters before it goes through a transitory phase but. In here normally what's happening is when ball is up this high typically speaking you will find that this is closer to fair price if not slightly underpriced and this is this can be a lucrative time to actually buy. The inverse happens when you're down towards this bottom and at the range but not the very bottom of the range and again this is the nuance of trading because let's say ball is down and I'm using this is like a total range rates like hundred percent twenty percent. Down at the bottom of this range so when you're in like the the bottom five percent of printing this is also a bad time for selling ball so this is like bad to sell this is bad to sell. This is okay to sell say like this is you know 65 percent. This is fine to sell down here anything maybe from like the 10 percent to the 65 this is fine. When you're trading ball there's a bunch of things that you're doing that. Aren't really talked about well or frequently enough and I don't think a lot of people fully grasp what's actually happening under the hood. Because what you're really trading is",
    "start_timestamp_seconds": 869.0,
    "end_timestamp_seconds": 974.0,
    "start_timestamp": "14:29",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=869",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "percent to the 65 this is fine. When you're trading ball there's a bunch of things that you're doing that. Aren't really talked about well or frequently enough and I don't think a lot of people fully grasp what's actually happening under the hood. Because what you're really trading is the implied ball relative to the realize ball. So for example, if you sell ball I V ball when it's high let's say you sell what you think is high ball and your expectation. Is ball main reverse so you think ball is going to trickle down that could happen here's the problem. If that happens but this still increases enough it doesn't matter that this happened. This overwhelms this this is your delta move. This is Vega. This delta in this context overwhelms your Vega. So it doesn't even matter if you get the thing that you're trying to get. If this other circumstance happens. Which is why when you get into options over time you'll develop an intuitive understanding for these relationships my guess is if there's somebody relatively new to the channel in the chat right now this might sound like fucking nothing. This might sound like just absolute gibberish. And by the way if it does you should tell me so that I can explain it to you or figure out the spot that's getting you stuck. But that would be my guess and it's because this stuff isn't as commonly discussed and it's is partially",
    "start_timestamp_seconds": 950.0,
    "end_timestamp_seconds": 1065.0,
    "start_timestamp": "15:50",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=950",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "just absolute gibberish. And by the way if it does you should tell me so that I can explain it to you or figure out the spot that's getting you stuck. But that would be my guess and it's because this stuff isn't as commonly discussed and it's is partially because it'll turn people off like there's a reality that if I go too far into the ball side of stuff that the stream would probably die except for the die hearts that would be here anyways. And it's because they're massacists they like a little bit of pain which is fortunate you have to endure a little bit of that in the markets. All of this goes back to where I'm seeing the market right now because if we look at where vol is as a percentile for VIX super low for realizable super super low. That creates a little bit of a problem and I actually think I once that I think there's a study that I recently did that should show you this. I don't know the name of it it'll be on this one. I just don't I have so many different random studies it'll be on this one what I want is the realized ball as a percentile. Let's go to VIX. So the interesting thing is. If we plot like a five day version of this right now the 20 period realized ball is 63 percent really high and you would expect that right",
    "start_timestamp_seconds": 1054.0,
    "end_timestamp_seconds": 1152.0,
    "start_timestamp": "17:34",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=1054",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "on this one what I want is the realized ball as a percentile. Let's go to VIX. So the interesting thing is. If we plot like a five day version of this right now the 20 period realized ball is 63 percent really high and you would expect that right over the last 20 days we've gone from almost 30 down to 16 it's a 50 percent move. So if in this we added one more version that was like a five day realized ball you would have a completely different picture of what's actually happening right now. The curiosity when vol gets this low and something that's really important to remember is that there's always shit to do just because vol is low doesn't mean that you can't find vol it just means you have to go look for it in some other places and you'll be able to still find pretty interesting stuff. So let's talk about that a little bit some of the interesting stuff and some of the other places that you might be able to look. To find either longer short style trades and I'm talking in terms of premium because. It's like really low you kind of don't want to do anything especially because if you buy you need something to move to make money premium if you sell. You want to collect enough premium for the risk that you're taking it kind of puts you in this really awkward spot that sucks. There's",
    "start_timestamp_seconds": 1130.0,
    "end_timestamp_seconds": 1249.0,
    "start_timestamp": "18:50",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=1130",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "you kind of don't want to do anything especially because if you buy you need something to move to make money premium if you sell. You want to collect enough premium for the risk that you're taking it kind of puts you in this really awkward spot that sucks. There's really really strong mobility going on right now specifically in financials there is that new regulatory change in terms of how much capital that they have to require at the large banks they like that. We can also see the massive difference between staples and discretionary discretionaries had a near meteoric rise relative for what it is. One of my basic concepts for trading is this idea of stacking strength it's looking for things that are doing what you want for your idea so I wouldn't confuse strength with upside. You can stack weakness or stack strength to the downside if you're trying to play something to the downside right now utilities looks absolutely prime or a drop if we look at utilities broadly as a sector. It is hanging on by an absolute thread and this close here is the first print below this general consolidation zone this to me starts to look like downside and really really really downside potential the next major stop that it has is like down here. Something like this. That rage it needs to cross this gap before it starts getting into any sort of at least longer term price history of strength.",
    "start_timestamp_seconds": 1230.0,
    "end_timestamp_seconds": 1332.0,
    "start_timestamp": "20:30",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=1230",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "me starts to look like downside and really really really downside potential the next major stop that it has is like down here. Something like this. That rage it needs to cross this gap before it starts getting into any sort of at least longer term price history of strength. This is a completely viable starting point if you're looking for an idea you can do better though the way that we do better is we go inside of the sector and then we figure out what's dragging this thing down actually let me go back really quick take a look at this if you look across. The. Decelleration of these things across all these longer term and shorter term moving averages again this shows you a massive amount of weakness. So. If we go inside utilities and we try to figure out where is this weakness stemming from one of the first things I would do is again look for weakness via momentum these are the things that have been shitty and continue to be shitty a good example so far that I see here is PCG let's take a look at PCG. To no big surprise. They had a accelerated drop through this consolidation and so far a fair continuation of this now this actually looks interesting to me for a few different things if we're keeping it. A buck. As far as some sort of like large downside expectation I don't really think I would have that",
    "start_timestamp_seconds": 1305.0,
    "end_timestamp_seconds": 1420.0,
    "start_timestamp": "21:45",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=1305",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "a accelerated drop through this consolidation and so far a fair continuation of this now this actually looks interesting to me for a few different things if we're keeping it. A buck. As far as some sort of like large downside expectation I don't really think I would have that until below here it needs to get through this which. The reason why I'm not super interested in buying puts here is because the downside velocity just isn't that huge although. If you add enough leverage you can still get a decent move and here's what I mean by that. If we take a look at a couple different trades to give you an intuitive sense of what this might look like if I sell. And at the money call the sixteenths we get 32 bucks. Okay cool that's scenario one scenario two is if I go a little further out. These are at least liquid enough let's say that I buy a in the money slightly in the money long put we get rid of the short call we just look at the long put. Then let's take a look at one other scenario those were what 143 bucks so let's say instead. We go here. And we get six of these you get them for like 30 cents. Yes you can only do five the be same size. If we do five of these you now are at 150 bucks in terms of what you're pulling up but",
    "start_timestamp_seconds": 1400.0,
    "end_timestamp_seconds": 1522.0,
    "start_timestamp": "23:20",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=1400",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "so let's say instead. We go here. And we get six of these you get them for like 30 cents. Yes you can only do five the be same size. If we do five of these you now are at 150 bucks in terms of what you're pulling up but the more important aspect here is let's just. See how these behave in different moves on the short call. If you get a 5% move against you or I'm sorry if you get a 5% move against you. And let me get rid of okay out of here you're going to lose 35 bucks 10% you're going to lose 82 15% you're going to lose 141. And so on and so forth if we go to the put side. The long put here by itself you lose 45 75 97 right so a little bit less on the law side and then. Quite a bit more on the profit side the drawback here as you guys know is theta and then if we go more of the unit approach. You can see that the total downside is much less in terms of where you would be net net in a 15% move against you or a 10% move against you. But your downside is actually your if it goes down your profit potential is much better and it's because you have just you've brute force delta's by accumulating five of the 13's. Which are 30 cents in this scenario you",
    "start_timestamp_seconds": 1499.0,
    "end_timestamp_seconds": 1609.0,
    "start_timestamp": "24:59",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=1499",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "15% move against you or a 10% move against you. But your downside is actually your if it goes down your profit potential is much better and it's because you have just you've brute force delta's by accumulating five of the 13's. Which are 30 cents in this scenario you get down to 81 short delta's versus the 57 delta's that you get from the slightly in the money versus the 35 delta that you get from the short call. Rances aren't utilities in AI narrative joined at the hip for some time now. Let's see. Let's take a look at utilities and let's compare it to Q Q Q Q. What do we see? Depending on how you structure and how you feel about attached to the hip. I see a relative correlation that absolutely breaks apart. Both of them peaked moderately here. And then the response after the peak is quite different. We had a more aggressive down move here followed by a way more aggressive rally here. And same thing with what you see here a big difference between this and this. So if we then just take a look at the actual plotted correlations for a 10 period I see a 22 correlation or a 30 period or a 20 period, which is 30 day realized a month I should say is 28. 50 period is 2300 period is 77. What does that inform us? Well, it clearly informs us that things that our near term",
    "start_timestamp_seconds": 1584.0,
    "end_timestamp_seconds": 1714.0,
    "start_timestamp": "26:24",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=1584",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "10 period I see a 22 correlation or a 30 period or a 20 period, which is 30 day realized a month I should say is 28. 50 period is 2300 period is 77. What does that inform us? Well, it clearly informs us that things that our near term in these is actually breaking down in terms of the relationship and in terms of the correlation. The longer term correlation in here is definitely quite strong on a relative basis and at a curiosity I'm going to actually scoot out that 100 period correlation and let's make that 120 period correlation. Or actually let's do six months. Yeah, it's 86. It's even stronger as you get further and further out. Very, very clear that that correlation becomes stronger and stronger. But, Alas, it breaks apart and it breaks apart actually quite regularly. What this tells me is that the longer term relationship is actually quite strong, but it's decoupling in the near term exactly what you're seeing. So what I wager longer term that they would play more in line with one another. Yeah, but does that mean in the near term that that's what happens. Yeah, and you can literally see it happening with this move so far. If this thing, like I said, if this thing starts aggressively moving down below there to me, that's a really, really easy trade. It's not easy in terms of like, oh, I know it's going to happen, but it's easy",
    "start_timestamp_seconds": 1690.0,
    "end_timestamp_seconds": 1813.0,
    "start_timestamp": "28:10",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=1690",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "can literally see it happening with this move so far. If this thing, like I said, if this thing starts aggressively moving down below there to me, that's a really, really easy trade. It's not easy in terms of like, oh, I know it's going to happen, but it's easy in terms of risk reward based on like where I would expect it to go versus where I would manage risk at it would be an easy trade, irritably. I did want to talk to you guys about some specific stocks just because of where they're at in their cycles in video being one of them. This consolidation is actually not looking that strong to me. If we look at how it's behaving so far, it's still very much in a downtrend. It's in a defined downtrend. This base so far looks good, but the base really, really, really needs to hold. And if we start to see an acceleration down below this, I actually view that is quite bearish for the market and as you guys know, I'm actually trading. I think that's a very, very, very difficult. So what that means is I am very interested in how this ends up behaving because if it goes too far and it starts rolling off, well, then that means I'm going to be pairing down risk in the coverage triangle pretty quickly. I cannot say that name and the question though, is do we see a bone cone coming for",
    "start_timestamp_seconds": 1799.0,
    "end_timestamp_seconds": 1901.0,
    "start_timestamp": "29:59",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=1799",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "this ends up behaving because if it goes too far and it starts rolling off, well, then that means I'm going to be pairing down risk in the coverage triangle pretty quickly. I cannot say that name and the question though, is do we see a bone cone coming for game stop. Let's get to me. The earnings catalyst I struggle with to be honest, to get a sense of like how the market is planning to play this. I also think that at this point, there is a little bit of a fear that more rallies are just going to be met with more offerings, which is that's a tough one because then as holders, you don't really want to see price. Going up that far that aggressively specifically because then you don't want to be diluted and if there are more offerings at these elevated prices that I think is a general fear. When I look at what Wall looks like in here and what the market looks to be expecting it actually is not pricing in much literally at all. And it's you know the 91% for earnings release for this thing, which is actually very very light. TCM says I don't think more offerings with more. The warrants of the current offering. They are, but they're not like that's the thing is there's a difference between something that can become cash versus cash. For example, if GameStop rallies up here to the 28 handle, which isn't",
    "start_timestamp_seconds": 1884.0,
    "end_timestamp_seconds": 1989.0,
    "start_timestamp": "31:24",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=1884",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "light. TCM says I don't think more offerings with more. The warrants of the current offering. They are, but they're not like that's the thing is there's a difference between something that can become cash versus cash. For example, if GameStop rallies up here to the 28 handle, which isn't the 32 handle, if they choose to do an offering, then they realize that cash. They still haven't experienced any additional dilution from the warrants yet. But my guess is that would be on the road map and my hope would be that they wouldn't. But that all being said that the warrants, the reason why it's such a good play for GameStop is because like doesn't do anything. The only thing it does is that if GameStop has a relatively very high price for what it is, then there's an opportunity to access cash through those. It's a very hard to say to be honest because normally speaking, I wouldn't expect that, but especially with GameStop, what's so confounding to me is how much cash they're sitting on. And they've been sitting on a lot of cash for a long time man. That is bizarre. It's very, very weird to do that. And it's also very, very weird to continue to raise when you already have billions in cash. They could really do a lot with that. The reason why that leads to the sentiment that I have is I would have thought prior that they wouldn't have done",
    "start_timestamp_seconds": 1968.0,
    "end_timestamp_seconds": 2075.0,
    "start_timestamp": "32:48",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=1968",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "to do that. And it's also very, very weird to continue to raise when you already have billions in cash. They could really do a lot with that. The reason why that leads to the sentiment that I have is I would have thought prior that they wouldn't have done additional races. And they did. Which begs the question is whatever they're looking to do with that cash really, really expensive and do they need more money. And if they need more money, it would not surprise me to see another race, another dilution and with the warrants because again, it's really hard to say what the, what the broader ideas in terms of cash. But maybe GameStop is saving cash to invest in outlier trading. Well, fortunately for them. The operation here comes pretty fucking cheap because we effectively don't make any money. So I do believe if that were the case, they have met and exceeded the threshold for some time now. So now I think it's just a matter of when you know, Cohen believes that it's the right time, but the cash picture is just it really is very, very interesting the way that they're balance sheet looks and what it seems like they, they might be trying to do it's from an investor standpoint. I think I've said it pretty clearly, but it is very confounding. You don't see this type of playbook very frequently. Now of that, I did make a couple adjustments to",
    "start_timestamp_seconds": 2057.0,
    "end_timestamp_seconds": 2156.0,
    "start_timestamp": "34:17",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=2057",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "sheet looks and what it seems like they, they might be trying to do it's from an investor standpoint. I think I've said it pretty clearly, but it is very confounding. You don't see this type of playbook very frequently. Now of that, I did make a couple adjustments to my GameStop position. I had the 19 D's 22 puts. What did I do here? So I had the 19 D's 22's and I just took a little bit of size off. I did that back on the night back on what day was that. I don't know, once I could literally have to calculate the dates. I don't have it here. So we were here and then we were this far in the trade. Two D's. So two December. Here yesterday. And I ended up getting back into the 22 puts in 19 D's, but just had a slightly different size. And then I still have the 24 calls that's effectively coming in as earnings play at this point. I purposely didn't want to move them too far out. T Cms is what do you think of the Warren's diverging from the 32. What are the Warrens at right now? For 18. For 18 and October 26. 32's. 32's. It's a pretty meaningful premium. I'd have to think on that a little bit. I think that's a pretty meaningful premium. There's a million different factors that are going into this. And I just am not sure which are going",
    "start_timestamp_seconds": 2137.0,
    "end_timestamp_seconds": 2301.0,
    "start_timestamp": "35:37",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=2137",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "now? For 18. For 18 and October 26. 32's. 32's. It's a pretty meaningful premium. I'd have to think on that a little bit. I think that's a pretty meaningful premium. There's a million different factors that are going into this. And I just am not sure which are going to be the more like profound. So the cost to carry is a big one that comes to mind except the financing cost for game stop has come down significantly. So I think that's a pretty good thing that I would like to borrow. But now it's been easy to borrow for some time. So I actually don't know what the short. Carry rate is one sec. GME short interest. Normally I think Fin tell typically has a good snapshot of the cost. I think that's a pretty good snapshot of the cost. Does it? I guess I'm confused. Not there. It all been Zinga. I think that's a pretty good snapshot of the cost. With a fuck is the rate? Why is this being difficult to find? Do you guys know what the current rate is? I'll check another dashboard. I don't know what I was thinking. I'll check Ben Zinga. I think they're one of these tools. Has it? No that. They've seen it. Seen it with my eyes. Let me see short interest. I don't know what the current rate is. Let me ask AI. What is the current? Because that will be a part of what",
    "start_timestamp_seconds": 2241.0,
    "end_timestamp_seconds": 2431.0,
    "start_timestamp": "37:21",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=2241",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "Ben Zinga. I think they're one of these tools. Has it? No that. They've seen it. Seen it with my eyes. Let me see short interest. I don't know what the current rate is. Let me ask AI. What is the current? Because that will be a part of what you're seeing. To see the current rate is the current rate. Because that will be a part of what you're seeing. It's not a problem. They're going to be a part of what you're seeing. It's not a problem. There is always a small premium. They've been tracking well. But now at a much higher premium. The interesting thing there is that there's like some pretty literally. There's it's not a complete arb because there are inventory and process oriented risks but this says about 0.53% APR so that'll be part of it for sure. The overall rate for the short will be part of it. The other reason for that premium though, like it just seems a little wide to me. Let's take a quick look for a context. Let's just see. Let's look at these side by side really quick. Okay, so that part is pretty clear. Let's give this one a little taller. We'll go to a little more room and let's send it to him. So now what I'm doing is I'm comparing the price history of that call specifically against the. This itself is also quite interesting isn't it? This difference because that is a",
    "start_timestamp_seconds": 2399.0,
    "end_timestamp_seconds": 2561.48,
    "start_timestamp": "39:59",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=2399",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "give this one a little taller. We'll go to a little more room and let's send it to him. So now what I'm doing is I'm comparing the price history of that call specifically against the. This itself is also quite interesting isn't it? This difference because that is a pretty clear stronger transaction. So part of it looks liquidity based to me. Yeah, I think that's the two main things that I can see TCM is it looks like a little bit of a liquidity factor specifically from yesterday in the order flow because that led to a pretty significant gap and then a price small trickle down off of that but super small volume. That's the other problem here is that the liquidity gap that you see here is the volume on this is two hundred and four contracts the volume here is ten whereas the price discovery on this is going to be way better. One point eight to one point seven mill. So there's just way way way way way way more trading in here. So I would estimate that it's really a function of those two things. That's the the broader thing that I see here. The cost to carry a little bit of tracking error but then also literally just base liquidity gaps. That's what I see. QQ says what platform is this? This is a thinker's one. Same platform that I have been using for a Ella, Ella long time but it's pretty",
    "start_timestamp_seconds": 2528.76,
    "end_timestamp_seconds": 2649.88,
    "start_timestamp": "42:08",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=2528",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "here. The cost to carry a little bit of tracking error but then also literally just base liquidity gaps. That's what I see. QQ says what platform is this? This is a thinker's one. Same platform that I have been using for a Ella, Ella long time but it's pretty solid. It in general does what I need it to. Let's talk about one or two other things really quick. I want to talk to you guys we can skip S. Let's take a look at NFE because NFE popped up today for a few different reasons that was kind of fun. This one definitely well I don't know if it's like like a strong meme stock if it falls into that bucket. That part I'm actually not so sure the true classification for it. But this thing had at least in a really really short term had pretty weird price behavior. And I was following the options chain on it. Everyone's in a while. I'll kind of like pick up few tickers that I just arbitrarily want to keep an eye on and follow in this ended up being one of them. This part I thought it was the last few days this part. Take a look at that. The put premium has absolutely skyrocketed relative even though price is starting to rally. When I see those kinds of things it always draws my eye because that's abnormal. Typically speaking when you catch this kind of behavior right like",
    "start_timestamp_seconds": 2629.6,
    "end_timestamp_seconds": 2757.28,
    "start_timestamp": "43:49",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=2629",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "last few days this part. Take a look at that. The put premium has absolutely skyrocketed relative even though price is starting to rally. When I see those kinds of things it always draws my eye because that's abnormal. Typically speaking when you catch this kind of behavior right like so a bunch of short put premium puts being sold either from recent profit or just short puts being offered net new. But then this is clearly demand for long puts and significantly so. So I was looking at where it looked like those were getting done. And we can see that there's a massive build out here except these look more so on the sold side because these came in. We can take a look at the contract itself. Actually that's a lie. It looks like a healthy mix actually. Oh, I see. Because it's just giving the last price versus the average. Okay, got it got it got it. What was confusing me there is I was taking the last here thinking that's one that transacted that which is kind of annoying. It would be much better if it didn't do that. But that's okay. These are pretty long dated though. That doesn't necessarily mean a whole lot to me when I see that long of a duration. So out in March of 20, but this is anomalous and here's the other thing. That's anomalous. Fives. It's a five put. Stock dollar 38. What do you guys think",
    "start_timestamp_seconds": 2724.88,
    "end_timestamp_seconds": 2853.68,
    "start_timestamp": "45:24",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=2724",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "long dated though. That doesn't necessarily mean a whole lot to me when I see that long of a duration. So out in March of 20, but this is anomalous and here's the other thing. That's anomalous. Fives. It's a five put. Stock dollar 38. What do you guys think of that? If we're looking at the five put out here with 113% or 113 times. Sorry, 113 times volume over li. What do we think of that? Is anybody have any inferences that you can navigate from there? Because the cool part is again, as usual, if you can figure out what some of those things might mean, you typically can create a trade idea out of it, which is kind of fun. Brain says someone selling deep in the money puts. Kirk says could that be bullish sold? Good questions. Let's take a look at the economics of it. The majority of this volume came in when it came in at an average of 398. If we plot the bid in the offer on the day, it overwhelmingly came in on the offer side and the upper mid. So what that tells me is that the majority of these are way more likely bought than sold. So it's a good question. My best inference here is that these are bought. Brain says so far out of the money. These are deep in the money. Remember these are puts. So they bought five puts. Five strike puts. I should",
    "start_timestamp_seconds": 2824.24,
    "end_timestamp_seconds": 2979.84,
    "start_timestamp": "47:04",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=2824",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "these are way more likely bought than sold. So it's a good question. My best inference here is that these are bought. Brain says so far out of the money. These are deep in the money. Remember these are puts. So they bought five puts. Five strike puts. I should say not to confuse you with the number. Five strike puts when the underlying is at 138. So these are deep in the money. Very deep in the money. TCMC's TCMC says seems like some kind of weird hedge for some other derivative could be. What else is this sometimes? Symptoms. So sometimes here this literally can be designed as a synthetic position in trying to the reason why you go so far in the money on things like this is because you actually want to nullify most of the Greeks. The funny thing is is because of how volatile this is, it'll still have some extrinsic value, but just not much. Right? And you can do the math. Always to get a sense. It's three dollars and sixty two cents of intrinsic. So the x-trinsic is 30 cents. It's just not much. Because of that the rest of the Greeks really don't matter that much. Your Vega doesn't matter that much. Your theta doesn't matter that much. But what do we notice? It's hard to borrow. What does that mean? It means that if you wanted to short shares, it can be probably more costly to short the shares.",
    "start_timestamp_seconds": 2961.28,
    "end_timestamp_seconds": 3084.08,
    "start_timestamp": "49:21",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=2961",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "Greeks really don't matter that much. Your Vega doesn't matter that much. Your theta doesn't matter that much. But what do we notice? It's hard to borrow. What does that mean? It means that if you wanted to short shares, it can be probably more costly to short the shares. So again, kind of like a funding rate arb. This could be a directional idea or this could be somebody playing the variance between whatever the funding rate is for the heart to borrow on the underlying versus the implied cost to carry of these puts. So it could be a non-directional bet. It literally could just be playing that. I don't suspect that to be the case, but it could be. This to me looks way more of an extrinsic value. Or I'm sorry, not extrinsic value. This looks way more of a synthetic play. Herk says 30 cents of extrinsic is almost 10% of that stock value. Well, it's not right. We got to make sure that it's almost but it's not, which is a pretty big difference. So if they got it for 395 and the extrinsic is 30 cents, it's 7.5%. Right, and again, I understand your point that 7.5 is close to 10, but in the financial markets, that's a big difference. This is just likely based on the funding rate right now. My guess is a much cheaper way to get short. And we can sort that out. We can figure out maybe what",
    "start_timestamp_seconds": 3056.88,
    "end_timestamp_seconds": 3178.32,
    "start_timestamp": "50:56",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=3056",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "your point that 7.5 is close to 10, but in the financial markets, that's a big difference. This is just likely based on the funding rate right now. My guess is a much cheaper way to get short. And we can sort that out. We can figure out maybe what the cost is to borrow NFE. So let's see. What is the current cost to borrow NFE from Schwab? I'm just using Schwab, because that's why I have. Let's see. I don't actually know the answer. Is this the cost? There it is. I fucking, finally. I thought that I knew that it was on here. Not a, not for sure that I've seen it. So now I, now I do. Here we go. So these, these actually look pretty expensive. So this looks like a just a cheaper way to get, to get short to get synthetic short. Remember, this is, this is a percentage. This is in APR. So this is absolutely, absolutely super expensive. So yeah, that's what it looks like to me, a cheaper way for somebody to get short without getting hammered by these rates. You go deep in the money. You get rid of all of your other stuff, meaning the Greeks, you don't really care about Delta anymore. You don't care about Gamma Theta Vega Road, Charm, you don't care about any of it. That is a Delta of one. This is, is effectively is deep in the money as you can go,",
    "start_timestamp_seconds": 3163.84,
    "end_timestamp_seconds": 3307.52,
    "start_timestamp": "52:43",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=3163",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "all of your other stuff, meaning the Greeks, you don't really care about Delta anymore. You don't care about Gamma Theta Vega Road, Charm, you don't care about any of it. That is a Delta of one. This is, is effectively is deep in the money as you can go, well, not quite, but pretty deep in the money. So it's going to neutralize like all of the other Greeks that you see. So that's exactly what I detect going on here, which is actually kind of fun to see if I'm being honest with you. Because it's not super common to see those kinds of positions, especially in smaller floats, stuff like that. Those are the kind of things, though, where I infer that that's probably a pretty informed participant is my, is my sense. Brain says, and if he shot up 12 percent today, so those puts got cheaper. The fundamentals look terrible. Massive debt virtually, no revenue. Yeah. What was their earnings before? They even did worse on that earnings. How they do here? They did terrible on this earnings. So this actually does look like really, really awful. I'm going to add this to my watch list because this might be something that I play along with more out of sheer curiosity. But again, this one is also a pretty cheap asymmetric play. Herx says, can you take a look at iron? Yeah, what do we look in it? What do we see? Iron? I need",
    "start_timestamp_seconds": 3296.24,
    "end_timestamp_seconds": 3403.12,
    "start_timestamp": "54:56",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=3296",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "list because this might be something that I play along with more out of sheer curiosity. But again, this one is also a pretty cheap asymmetric play. Herx says, can you take a look at iron? Yeah, what do we look in it? What do we see? Iron? I need to zoom out a little bit, three months. What do we think in? In my AIC, how did you earn it? 14th thens. Herx says they had a $1 billion offering yesterday, but it held super, woo. Oh, okay, so they offered, so they just diluted. To me, it looks bad. But these are the kind of things that I wouldn't do much with until it gives me some sort of direction from a directional lens. But the fall side, to even the wall doesn't look that good to me. It doesn't look bad. No, that's a lie. Yeah, I take that back. I take that back. I take that back. The realized end day move, 10% 20 days like 34. So it's a 34% move, but a 94% range, which is fucking nuts. But all is at 120. So this actually looks a little bit curious from a ball lens. Super tail happy in the front. And definitely some kinks in the curve. From a directional lens, it would need to effectively move outside of either of those alerts that I set. I don't look to try to guess as something's consolidating, which way it might break. But I",
    "start_timestamp_seconds": 3369.52,
    "end_timestamp_seconds": 3576.16,
    "start_timestamp": "56:09",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=3369",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "lens. Super tail happy in the front. And definitely some kinks in the curve. From a directional lens, it would need to effectively move outside of either of those alerts that I set. I don't look to try to guess as something's consolidating, which way it might break. But I don't love this, right? Take a look at that. Somebody was running up the calls as this thing was rallying. And then they literally flattened. And then this thing started training sideways. So the net here is like short, three, mill, and change to the upside. The long was like five, five, seven. So somebody to me, it looks like they were literally just day trading a little bit. Wow, there's a lot of like really, really short-term shit. That's pretty impressive. And people are buying upside. They're just not buying it with much money. They're really just putting up cheaper ways to get some upside. That's super interesting. Ball is pretty high across the curve. Definitely put skew. Look at that. And then look at that. Jesus Christ. Is this thing, this thing has to have something going on? What the fuck is that? Look at that. 132% All 109. There's something. The market looks real real mixed on this. The risk premiums are starting to flip a little bit negative, which is actually a decent time because the risk premiums themselves when they get down too low. They tend to mean revert. Okay, so to summarize what I'm",
    "start_timestamp_seconds": 3523.04,
    "end_timestamp_seconds": 3747.76,
    "start_timestamp": "58:43",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=3523",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "109. There's something. The market looks real real mixed on this. The risk premiums are starting to flip a little bit negative, which is actually a decent time because the risk premiums themselves when they get down too low. They tend to mean revert. Okay, so to summarize what I'm seeing here, the underlying itself looks bearish. It's in a consolidation range effectively from 12-nove. Still trickling down, though. It's just now posting a low cycle, but it's still lower-low than this. In order to break out of the consolidation to the upside, it needs to get above like this 50-and-three-quarter handle. And then if it breaks down below, then that's when it falls below like the 40-15 handle. Directional preference right now, based on current trend with favor bearish, based on the options market and what we see here, it's a little more of a mixed bag, but I still think a little more bearish than bullish. So, yeah, that's generally speaking. Generally speaking, what I see. Kirk says it's a paper trade, so I'm trying to watch how it moves. What did you do in here? Kirk? Did you get long? I'm going to take a look at the paper. It's a synthetic long 40. Yeah, I got it. Okay, that's kind of a bummer. I definitely, and I know it's a paper trade, but I still treat those like real trades. I definitely hope that it works out, but in terms of a value proposition and just",
    "start_timestamp_seconds": 3699.92,
    "end_timestamp_seconds": 3876.0,
    "start_timestamp": "01:01:39",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=3699",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "the paper. It's a synthetic long 40. Yeah, I got it. Okay, that's kind of a bummer. I definitely, and I know it's a paper trade, but I still treat those like real trades. I definitely hope that it works out, but in terms of a value proposition and just a good strategic programmatic bet, I don't personally love it. I just don't like how weak this looks in the front looks like really, really weak. In terms of stacking strength, it has a lot of stuff going against it. But as always, that doesn't mean that it can't make money, but the way that I look at pretty much all trades, including this one, is always like, not is this one, especially unicorn that bucks the trend, but more so is this to kind of thing that I think is more likely or less likely to have a favorable move based on the position that I put on. Because when I look across five days, it's negative, 10 days, it's negative, 20 days, it's negative. It's not until you get out to like three months and six months, which from a momentum perspective, there could be an argument for a reversal. There could be an argument. It's just a little too early, I think. It's a little too early, I think, to call it that way personally. But yeah, it's an interesting one. And it does look like there's some knowledgeable participants the NFE trade to me definitely also",
    "start_timestamp_seconds": 3842.8,
    "end_timestamp_seconds": 3962.48,
    "start_timestamp": "01:04:02",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=3842",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 3980.0
  },
  {
    "video_id": "Bxh8Fo7CiEI",
    "title": "Stock Market Update | Outlier Trading",
    "text": "a reversal. There could be an argument. It's just a little too early, I think. It's a little too early, I think, to call it that way personally. But yeah, it's an interesting one. And it does look like there's some knowledgeable participants the NFE trade to me definitely also wreaks of that kind of positioning. So, all right, gang, it is time for me to balance some of go work on a video, being out liar. See you later.",
    "start_timestamp_seconds": 3940.48,
    "end_timestamp_seconds": 3975.92,
    "start_timestamp": "01:05:40",
    "video_url": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Bxh8Fo7CiEI&t=3940",
    "chunk_index": 37,
    "word_count": 80,
    "upload_date": null,
    "duration": 3980.0
  }
]