[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you terms of net premiums for calls and puts. And then where we're seeing institutional positioning, what things like the COT report look like, which we're going to go through all of that. Now let's talk quickly about where things landed last week. Also take a look at this, we talked about this a little bit. The I was looking at maybe fading laser and I started stepping into something and funny enough I ended up getting out of the trade pretty fast, but this move here still seems just bullshit to me. But anyways, let's get into the overall markets here. So if we take a look, we can see a lot of the activity that happened Friday. One of the things that jumps out to me is XLB actually had a pretty big dip down compared to everything else just about everything else showed a bit of strength and I'll show you. So if we take a look at XLB, you'll see that materials actually started contracting. And I think that this is a reasonable short at this point for the near term expectation of things like tariffs and the near term potential impacts of them. Now another broader note is when I looked at overall net highs lows, one of the things that is jumping out at me here is the NASDAQ is still lagging pretty",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 66,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=0"
    }
  },
  {
    "text": "this point for the near term expectation of things like tariffs and the near term potential impacts of them. Now another broader note is when I looked at overall net highs lows, one of the things that is jumping out at me here is the NASDAQ is still lagging pretty heavily over the New York Stock Exchange. And if you take a look at the constituents there, New York Stock Exchange actually favors a lot of these kinds of companies. So I think that there's likely going to be some bleed through from this, but this looks like it'll be under near term pressure. One of the big things to keep in mind about Trump's tariff policy, I think that there is currently a pretty big misunderstanding, at least as far as I can tell with respect to how the tariffs might go on. And it looks like people seem to think or are pricing things as if this is going to be tariff city on every country. And if we actually peel back some of the things that Trump has specifically spoken about with respect to the tariff policy, it actually looks like they're trying to be more scalpel than that. And it looks like they're trying to structure it as if there is an unfair trade relationship between the US and whatever other country they're looking at, that's then when the tariffs would come into play and then it would be at a variable rate based on the",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 66,
      "start_timestamp": "00:09:45",
      "start_timestamp_seconds": 585.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=585"
    }
  },
  {
    "text": "than that. And it looks like they're trying to structure it as if there is an unfair trade relationship between the US and whatever other country they're looking at, that's then when the tariffs would come into play and then it would be at a variable rate based on the trade relationship. That matters because when we look across the total market impact, that scenario is vastly different than the scenario of it's going to be hand in tariffs out like it's Halloween and everybody's just going to get more tariffs. That differentiation is actually really important in the expectation of the market reaction to things. The other thing that stuck out to me specifically from last week, I think the relationship between tech and comm services looks like it's just about come back online. So if you take a look at the move on a relative basis between XLC and XOK, they look super similar. So what this means is that pairs trade is in my book, I already told you I've wrapped up the pairs trade between XLC and XOK, but it does look like it might be done at least for now until that relationship becomes decoupled again in the future. The other thing that I noticed is staples and discretionary. Take a look at discretionary leveling off and I still have to expect broader weakness potential from discretionary as compared to staples. This largely is just due to what they are, right? Think of it. Staples",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 66,
      "start_timestamp": "00:10:59",
      "start_timestamp_seconds": 659.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=659"
    }
  },
  {
    "text": "again in the future. The other thing that I noticed is staples and discretionary. Take a look at discretionary leveling off and I still have to expect broader weakness potential from discretionary as compared to staples. This largely is just due to what they are, right? Think of it. Staples are things that people need to survive to conduct their day-to-day living. Not totally. If we looked inside staples, you actually find some stuff in there and you're like, that's a staple, but that aside, in general, a lot of the names that you'll see in staples lean more that direction and then discretionary. Obviously, there are things that people prefer. They like it adds value to their day-to-day life. And funny enough, you'll find some things in discretionary that actually can hold up really well that perform almost more like a staple. It's kind of a fun game with markets. If you take a look at defense contractors, ITA, massive, massive movement, and there's actually a new pairs relationship that has caught my eye here. So if we break this down, let's do a quad. And let's take a look at LMT. Let's take a look at RTX. Let's take a look at Boeing. And Boeing is likely going to see a bit of an uptick. I would surmise. That's actually another simple trade I have for tomorrow. He's looking to just trade Boeing to see how it opens, but then just trade Boeing to the upside short term,",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 66,
      "start_timestamp": "00:12:08",
      "start_timestamp_seconds": 728.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=728"
    }
  },
  {
    "text": "take a look at Boeing. And Boeing is likely going to see a bit of an uptick. I would surmise. That's actually another simple trade I have for tomorrow. He's looking to just trade Boeing to see how it opens, but then just trade Boeing to the upside short term, probably just intraday, but with the announcement of the new fighter. And I forgot, I already forgot the name of it. Is it like the Boeing 49 or something? New fighter jet. F-47. That's close enough, right? F-47, F-49, whatever. But this, I think, is probably going to cause a little bit of near-term price appreciation. One thing to note about this is this announcement actually is not really new. This is something that we expected. And you could actually see some of these artifacts. However, typically what happens is when this kind of news comes from the level of Trump, it has way more eyes on it. Sorry, enough. Thor is walking around the office crying. So now he has to wait before I can let him out. But because there are way more news articles on this now, you'll actually see that information being ingested and incorporated into price a little more quickly. This goes back to this broader momentum concept of information discreetness, whether it's discreet or industry. And this kind of information coming out at this level is likely to cause at least a near-term reaction to things. And then the other one, what do we",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 66,
      "start_timestamp": "00:13:22",
      "start_timestamp_seconds": 802.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=802"
    }
  },
  {
    "text": "price a little more quickly. This goes back to this broader momentum concept of information discreetness, whether it's discreet or industry. And this kind of information coming out at this level is likely to cause at least a near-term reaction to things. And then the other one, what do we want to add in here? I guess we could do general dynamics. And let's see. So notice Boeing compared to Lockheed Martin compared to Raytheon. This movement itself, again, is already something that we can eyeball for a potential opportunity. Because right now the relationship between Lockheed Martin and Boeing is probably a little more extended than Raytheon. But the main cause here is that some of the underlying drivers are a little bit different. So the pairs of the pair structure in general looks better between Raytheon and Boeing because you can see their general price performance largely mirrors one another much better than Lockheed Martin. But these short-term distortions sometimes can be faster ideas. So we'll have to see how this ends up playing out. But it is something that I'm keeping an eye on because these just become simple little trades. They don't necessarily make a ton of money, but they can be interesting to watch. So if we take a look at Lockheed Martin and then if we take a look at Boeing and we just analyze the pairs relationship again, you can see that the total relationship over time has absolutely been contracting. However, the",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 66,
      "start_timestamp": "00:14:55",
      "start_timestamp_seconds": 895.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=895"
    }
  },
  {
    "text": "of money, but they can be interesting to watch. So if we take a look at Lockheed Martin and then if we take a look at Boeing and we just analyze the pairs relationship again, you can see that the total relationship over time has absolutely been contracting. However, the main reversion, this is using a Hearst exponent, is not super high. So it's not something that I've traded that much in the past, but it's something I'm watching because I am curious if this gets as extended as it is, if it now opens up an opportunity, which we'll have to see. So that stuff aside, let's now talk more about some of what we saw last week. And I'm going to let this do it out. The dude needed, he needed to go run around. So one of the broader themes that I was picking up on towards the end of last week is you can see, take a look at the call premium relative to put premium and the overall trends here. This is over the last seven days. You can see that call premiums really started falling off. And then you can see that on between the 19th and 20th, we saw them peak up. And then we've seen them essentially steadily decline from there. So I really am eager to see what kind of options activity we see on Monday in the broad market because I do think that the options markets have been pretty",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 66,
      "start_timestamp": "00:16:18",
      "start_timestamp_seconds": 978.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=978"
    }
  },
  {
    "text": "the 19th and 20th, we saw them peak up. And then we've seen them essentially steadily decline from there. So I really am eager to see what kind of options activity we see on Monday in the broad market because I do think that the options markets have been pretty decent in terms of their expectations so far. Now one note that is worth highlighting here is the put side, his ran off massively. So even if we're not seeing massive speculation via long calls, coming online, we are seeing long puts or just puts in general, starting to slow down. So that I do think is at least again, worth general general noting. So let's now take a look at some of what we have coming up this week again for those that are receiving the newsletter. You will have seen this in the newsletter already, but we'll poke through it really fast together. I have this zoomed out just literally because when I put it in the newsletter so I can grab a screenshot, that's a little cleaner. But here I like to do this did not mean that. All right, so let's see what we have now for the newsletter more often than not. I focus on like the three star items quote unquote, they're just like the much higher impact or expectation. But I when we're doing it on this stream for this kind of preparation, I think going down one click, the problem is is",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 66,
      "start_timestamp": "00:17:53",
      "start_timestamp_seconds": 1073.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=1073"
    }
  },
  {
    "text": "for the newsletter more often than not. I focus on like the three star items quote unquote, they're just like the much higher impact or expectation. But I when we're doing it on this stream for this kind of preparation, I think going down one click, the problem is is for those that don't know the ranking systems are pretty good because they have a lot of noise in here. Now again, honestly, I tend to look at the majority of this, especially because trading things like futures, understanding what's coming up and what the expectations are in terms of the crops. Like that's actually really usable information, but that's not really for the purview here. So we can see Chicago PMI is coming out tomorrow. Chicago PMI is nothing that special, but I do think seeing how the Dallas Fed, how their data lines up with the Atlanta Fed. I'm very curious how well the general stories between those two align because a really big conversation point right now sits on what happens with rates. So let me grab the Fed rate. Where's the Fed watch? Take a look at this. So if we take a look at, I want to look at the historical. And seven may is fine. Yeah, see, take a look at this. Right now, this is starting to skyrocket relative, which is a little surprising, actually. So let's see what's happened here. And this is looking back over a few different time frames. You",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 66,
      "start_timestamp": "00:19:11",
      "start_timestamp_seconds": 1151.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=1151"
    }
  },
  {
    "text": "want to look at the historical. And seven may is fine. Yeah, see, take a look at this. Right now, this is starting to skyrocket relative, which is a little surprising, actually. So let's see what's happened here. And this is looking back over a few different time frames. You can see that the probability of no change originally started at 67 and it's been slowly creeping up to 86 right now the markets currently pricing in two cuts. And the I think that I don't know, man, I can see it and the the pressure from Trump is also an interesting inject there, but we're also coming into a really interesting growth phase with respect to GDP because with all of these attempts to find areas to cut federal spending, for example, which is a massive, massive element of GDP that actually slows overall growth. Now of no, there is the question of, well, does the federal spending like, should it even be in GDP, which I actually think there's an argument there depending on what the spending is. So some of me, I don't necessarily care that much of GDP contracts a little bit because government spending is being cut down and that's being reflected there. But the other thing I noticed that is a little interesting and this is actually a call out for job openings is as these different federal fields are being hacked and slashed. I am surprised to see unemployment and unemployment expectations coming",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 66,
      "start_timestamp": "00:20:48",
      "start_timestamp_seconds": 1248.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=1248"
    }
  },
  {
    "text": "being cut down and that's being reflected there. But the other thing I noticed that is a little interesting and this is actually a call out for job openings is as these different federal fields are being hacked and slashed. I am surprised to see unemployment and unemployment expectations coming in as light as they've been. I do think that there's a reality where unemployment might actually start to speak up a little bit and then how that feeds into a potential cut and whether it's one or two is a different scenario, I think. But all of these data points, at least from a trader's lens are things to be aware of. But the really cool part about being a trader is other than the fact of being generally interested in this stuff, which I am and hopefully you are right because it's super cool. Like the markets are fascinating. The cool part about being a trader is as long as you have the general context on these things that are going on and what may or may not happen, you actually don't have to come up with a really strong, definitive idea because you can play the idea as it's unraveling. That is one of the very few advantages of being a retail trader. I actually have a couple videos coming out. One of them is, I don't know when it's going to land. It's already made. It's going through my editor now. But it talks about some",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 66,
      "start_timestamp": "00:22:21",
      "start_timestamp_seconds": 1341.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=1341"
    }
  },
  {
    "text": "as it's unraveling. That is one of the very few advantages of being a retail trader. I actually have a couple videos coming out. One of them is, I don't know when it's going to land. It's already made. It's going through my editor now. But it talks about some of the advantages of retail traders because retail traders are beat over the head with the fact that they have zero advantages and it literally is not true. It's like 100 not true. That in no way means that retail traders are advantage. That's not the case. But there are certain advantages you have and that's one of them is that you do not have to front run the moves. We are small and agile enough that we can get in as a move is happening, which unloads an insane amount of the burden of coming up with these grand your ideas because big institutions, they have to not only come up with the idea, but then they have to position themselves slowly so that they can get the position they want at a price that's reasonable to then play the idea. A little bit of a cool function of being a retail trader. I wouldn't surprise me to see job openings coming up. Now, everything I've seen so far from CPI, PPI, PMI, it does look like manufacturing is starting to see some pretty big changes and I think a lot of this has to do with the expectations",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 66,
      "start_timestamp": "00:23:33",
      "start_timestamp_seconds": 1413.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=1413"
    }
  },
  {
    "text": "being a retail trader. I wouldn't surprise me to see job openings coming up. Now, everything I've seen so far from CPI, PPI, PMI, it does look like manufacturing is starting to see some pretty big changes and I think a lot of this has to do with the expectations around tariffs, tariff impact and how pervasive that's going to be, especially in things like manufacturing. That absolutely will be a pretty big line item. We'll take a look at the options market in a second to see how the SP 500 is just expecting from this stuff and you'll see it's actually kind of light. Then we have services PMI on Thursday, payrolls, unemployment on Friday. The average hourly earnings, I actually care about the month over month here because one of the things that I've showed you all before is one second, let me log into my Fred account and I'll show you the economic dashboard that I'd like to use this one. One of the things that I'd like to keep an eyeball on is the delinquency rates of different kinds of credit lines. Then I also like to see the health of the consumer, which you'll see here. You can see things like personal savings and personal consumption. The relationship here is actually pretty strong. It's hard to tell because these are kind of squished down. You'll notice that if you take a look at personal consumption, that's what this brighter, thicker blue line is. You'll",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 66,
      "start_timestamp": "00:24:37",
      "start_timestamp_seconds": 1477.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=1477"
    }
  },
  {
    "text": "see here. You can see things like personal savings and personal consumption. The relationship here is actually pretty strong. It's hard to tell because these are kind of squished down. You'll notice that if you take a look at personal consumption, that's what this brighter, thicker blue line is. You'll see that this is down ticking. Then if you take a look at savings rate, it's actually upticking. This to me shows that the consumer is actually pretty accurately playing this so far. It means that they're being conservative, starting to slow spending early. Now, if we take a look at delinquency rates, delinquency rates for mortgages look completely fine. This doesn't look as healthy, but again, this is a little bit lagging. The business loans thing. I'm not seeing any huge activity from the delinquency rate side of things that at least for me start to draw some sort of concern. I don't really feel that way so far. If we double click into this, you can see it looks pretty centrist parabys. I don't see a ton of changes coming through here that again, draw my attention. I think the consumer right now looks healthy enough, but I think that they probably are in a tenuous position. I think that that's pretty fair to say. Now, anything else in here that's worth looking at? I don't really think so. No, no, no. I think the debt picture. There's also the balance sheet, so the Fed is definitely being",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 66,
      "start_timestamp": "00:26:04",
      "start_timestamp_seconds": 1564.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=1564"
    }
  },
  {
    "text": "think that they probably are in a tenuous position. I think that that's pretty fair to say. Now, anything else in here that's worth looking at? I don't really think so. No, no, no. I think the debt picture. There's also the balance sheet, so the Fed is definitely being a little cagey with the balance sheet runoff. There is an argument to be made depending on how pervasive these tariffs go, what impact that's going to have on the dollar. But again, I think from the broader perspective, the impact of the dollar becomes a little macro level, which, again, I think it's good to be aware of, but I think from a standard trader's activity, it won't really matter that much. So I'm not going to spend a ton of time on that. Let's take a look through just the pre-market here from bar chart. See if they have anything that we haven't come across yet. Then we'll talk quick about the portfolio and then start running through some scans. Thursday's final reading GDP, 830, comprehensive, backward look of economic growth. We already know that this is being revised down. So yeah, that doesn't matter much, manufacturing services. We know that that's coming up. Housing market. So the housing market's been really interesting. And we're not seeing any massive changes in the mortgage front yet, although the 10 year is starting to oscillate a little bit. So nothing jumped out of me in there. Let's take a look",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 66,
      "start_timestamp": "00:27:29",
      "start_timestamp_seconds": 1649.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=1649"
    }
  },
  {
    "text": "We know that that's coming up. Housing market. So the housing market's been really interesting. And we're not seeing any massive changes in the mortgage front yet, although the 10 year is starting to oscillate a little bit. So nothing jumped out of me in there. Let's take a look at the SP 500 really fast. And let's see where the SP 500 is seeing anything busy here, definitely. So you can see this jumps up about three quarters of a point, the 28th of March. So if we overlay that with the schedule for the week, this week, I was wondering, I had it as I fucked that up, my bad guys. I was wondering because I had this as next week, but they consider it this week. So I was like, this stuff doesn't fucking line up. That's what I was. Yeah. Anyways. So it's the SP composite manufacturing services. Yeah, that's better. A bunch of Fed speakers. The 28th, the 27th, there's the GDP reading. Here you go. So the 28th or PCE. So that's probably what the market is pricing in here. So that economic calendar we looked at earlier from here, I was looking not at this coming week, but the next week. That's why it didn't match up. And that's really the big day as far as we can tell. Now, various risk premiums in the SP 500 have been some of the best I've ever traded. And I've been running a bunch of",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 66,
      "start_timestamp": "00:29:05",
      "start_timestamp_seconds": 1745.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=1745"
    }
  },
  {
    "text": "at this coming week, but the next week. That's why it didn't match up. And that's really the big day as far as we can tell. Now, various risk premiums in the SP 500 have been some of the best I've ever traded. And I've been running a bunch of different duration strategies. A couple have been working much better than the others. One of the themes that has absolutely been the case is funny enough, the zeros have been a lot more stable than the overnight weekend or other variable entry times. The one day risk premiums have been really, really solid, but they're highly specific. If you, one of the things a lot of retail traders do with like the SPX trading strategies, if you guys have seen some of my videos on like zero DTEs, I have a video coming out soon that's comparing zero to one DTEs. A lot of people try to come up with what we would call a dumb strategy, not that the strategy itself is dumb, but that it's just a defined ahead of time. And then you just continue to execute that strategy itself. And that doesn't work well because the conditions, it's a very conditional style trade that has to be modified, but you have to be so careful with the modifications that you're making that they actually add value because otherwise you can start overlaying filters that don't actually matter. But a big thing that I pay attention to",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 66,
      "start_timestamp": "00:30:33",
      "start_timestamp_seconds": 1833.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=1833"
    }
  },
  {
    "text": "conditions, it's a very conditional style trade that has to be modified, but you have to be so careful with the modifications that you're making that they actually add value because otherwise you can start overlaying filters that don't actually matter. But a big thing that I pay attention to is actually the options activity on the day. Okay, so we can see that the vol though for this front cycle is actually pretty light, right? It's only 18. Vol in general is pretty light. So that's what I'm seeing from a broad market perspective. Let's take a quick look at and I have from the pro questing question sheet. I have one question flagged that we will absolutely get to. I'll hit this one in a little bit, but let's take a look at the covered strangles as they sit. So right now we are about 71 utilized in TQs. We are 52 utilized in SSO. So actually a little bit lighter there than I would care to be. I bits at 60 game stops at 74. The key notes here is you'll see that the equity side of things is still a little bit on the light side. I actually would start looking to start scaling these up closer to like 30. So I'm going to be adding little bits here and there. And then the cash secured put elements. I probably will keep these about the same other than the fact that SSO is too light. So",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 66,
      "start_timestamp": "00:31:41",
      "start_timestamp_seconds": 1901.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=1901"
    }
  },
  {
    "text": "I actually would start looking to start scaling these up closer to like 30. So I'm going to be adding little bits here and there. And then the cash secured put elements. I probably will keep these about the same other than the fact that SSO is too light. So and this is because some of the trades came down last week and it's also saving some of the capital so that I can apply it to some of the roles that are going to happen. One of the things that I pay very close attention to with the management of the covered strangles is if I am too utilized especially when I have cash secured puts that are underwater and are going to need management. I actually slow roll scaling into the equity side of things so that I can ramp up a little bit of my capital use to help me with the roles. And I'll give you an example because T triple Qs is in a pretty rough spot as is SSO. Well, let's take a look at TQs. So if we take a look at T triple Qs right now, I'm short for example the 75s. That's a great example. Those 75s are Ella underwater. So if I show you were 75 is on this chart, it's looking like it's right about here. So as you can tell, this is an un favorable level for short puts, right? Because it means that if I'm assigned, I",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 66,
      "start_timestamp": "00:33:11",
      "start_timestamp_seconds": 1991.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=1991"
    }
  },
  {
    "text": "That's a great example. Those 75s are Ella underwater. So if I show you were 75 is on this chart, it's looking like it's right about here. So as you can tell, this is an un favorable level for short puts, right? Because it means that if I'm assigned, I effectively have to take those puts all the way up here when the market's down here. Don't want that especially because my current basis is 66. So if I had to buy I have 500 shares at 66. So if I bought another 500 shares at 75, that would murder actually a pretty good basis right now. A basis of 66 is absolutely fantastic because I've been trading this and while I have been trading this, we started this on the 20, not the 20th of February, we'll call it 15 October. So this was over 75 bucks when I first started actually trading and scaling into things. So if we go 75 and we take a look at where we sit now, 62, 18, that's a 17 drop. So the fact that the basis that I have right now is actually so close is pretty solid. I'm happy with that. Now all that aside, let's take a look at these puts and finish out that example that I was just explaining to you. So we have the 17 April, we have the 75s which still have a little bit of extrinsic value not much. The midpoint on these, it's",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 66,
      "start_timestamp": "00:34:20",
      "start_timestamp_seconds": 2060.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=2060"
    }
  },
  {
    "text": "that. Now all that aside, let's take a look at these puts and finish out that example that I was just explaining to you. So we have the 17 April, we have the 75s which still have a little bit of extrinsic value not much. The midpoint on these, it's probably a little closer. Yeah, I was guessing closer to the 13 Hano versus the mid to high 13s. This is guessing mid 13s. I would expect it to be kind of around the 13s. So let's just eyeball this as we're going to close these for 13, 25, something like that. So if we mentally bucket closing those at 13, 25 and we go out maybe to 2 May, the first thing is to see where can we get 13, 25, we can get it at 75s. So we can essentially roll out flat, which is fine, but that's not the target here. We want to be able to reduce this basis. So one of the ways that we can reduce this basis is instead of just rolling it same size, I can add contracts and I'll show you what that actually looks like. Do I have the, I do have it in here. Great. So this copied over, which is good. And let me show what the fuck happened to this. We're missing. One sex. Sorry. Oh, because it overwrote it. That's a little annoying. Damn, Daniel. Let me, let me undo all this. How far back will",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 66,
      "start_timestamp": "00:35:37",
      "start_timestamp_seconds": 2137.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=2137"
    }
  },
  {
    "text": "do have it in here. Great. So this copied over, which is good. And let me show what the fuck happened to this. We're missing. One sex. Sorry. Oh, because it overwrote it. That's a little annoying. Damn, Daniel. Let me, let me undo all this. How far back will it be? Doesn't seem like. Damn. Anyways, we can just do some back of the napkin map. It just means that this stuff is broken here, but we'll just, we'll sort it out real quick. Don't you worry. So we'll drop this in. I don't know what ticker this is for, but it'll be. Okay. Five. Oh, this is perfect. This is literally for this exact trade. Fortune, fortune favors us. So I want to show you something. So these again, we eyeballed that we would take it down for like 1325. So now if we take a look, this stock is at 6218. The stock has had a pretty significant move against us up until this point. And this should be AJ. AJ 18. You guys. This here. The AJ 18. So you can see the total move. So the total move here is 37 against which obviously from the entry on these short puts, that really is a pretty profound move. That's not easy to just navigate around. So because of that, we have to pay pretty close attention to how we ultimately manage our movement, which I will show you how we can use dynamic lot sizing",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 66,
      "start_timestamp": "00:36:47",
      "start_timestamp_seconds": 2207.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=2207"
    }
  },
  {
    "text": "the entry on these short puts, that really is a pretty profound move. That's not easy to just navigate around. So because of that, we have to pay pretty close attention to how we ultimately manage our movement, which I will show you how we can use dynamic lot sizing for that. So let's say we run it up to a six lot. And let's see if we can get to the 71s maybe. Because that's really the only next strike. That's another frustrating thing in this goes back to expiration liquidity. Notice how there's no 74 73 72. It's only 75 71. That makes the game of rolling more difficult. Reason why it makes the game of rolling more difficult is because I have less choices available to me, which I mean realistically in this case, I shouldn't, but you know, should shouldn't doesn't matter. I do. And it literally goes from 75 to 71 because I would have a much better role potential here if I was trying to go from 75 to 74 or 75 to 73, but I'm not. I have to go the next choice I have is going down to 71. So let's say I go down to 71 and let's say at 71, let's see what we might be able to take in 1045. Let's see if this works for us. So this does indeed work. And I'll show you. So here's effectively what would happen in this case. Now by adding a",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 66,
      "start_timestamp": "00:38:52",
      "start_timestamp_seconds": 2332.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=2332"
    }
  },
  {
    "text": "I go down to 71 and let's say at 71, let's see what we might be able to take in 1045. Let's see if this works for us. So this does indeed work. And I'll show you. So here's effectively what would happen in this case. Now by adding a single lot, right? So I don't have to add a whole bunch, but by adding a single lot, what I'm doing here is taking my basis down 5. I am rolling for a debit, which is really important to note. This is a debit, which the last trade was also a debit. The reason why I'm emphasizing this is because so many people are used to always hearing you have to roll for a credit, which you don't. You have to track the P and L. That's what you do have to do. And that's exactly what is relevant here. So if we take a look, what is this 23 March, I just have to throw a date in here so that this math is done from you as well. So by moving my basis here, this shouldn't be read. So for those that don't know, I dropped this over from another log that I use. That's why all the formatting and numbers are dorked up. But the main premise stuff here is ultimately what matters to us. So so far, we're going to be increasing the total capital requirement by 5100 bucks. That is really important, because if you",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 66,
      "start_timestamp": "00:40:18",
      "start_timestamp_seconds": 2418.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=2418"
    }
  },
  {
    "text": "from another log that I use. That's why all the formatting and numbers are dorked up. But the main premise stuff here is ultimately what matters to us. So so far, we're going to be increasing the total capital requirement by 5100 bucks. That is really important, because if you take a look at the cash secured requirement for a five-law at 75, it's 3,500. So I'm adding an entire additional contract. We would expect that that one additional contract would cost us an additional 7,100. But it doesn't. The reason why it doesn't is because for the five existing contracts, we're taking the basis from 75 to 71 that represents savings. So that means instead of adding 7,100 of cost, we're only adding 5,100 of cost. This is such an important thing to track because it is one of the absolute most important ways to managing these positions. Because in doing so, we can use not all of our capital to slowly grind this basis down. And literally by adding a single contract, I'm able to move the basis down 5 from 75 to 71. It's still deep in the money, which is suboptimal. But it's much better off than we're at, and I'm not adding a ton of money to do it. That's the main point here. So this goes all the way back to the original thing I was explaining to you. How I often will hold off on adding additional shares even though I typically would",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 66,
      "start_timestamp": "00:41:40",
      "start_timestamp_seconds": 2500.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=2500"
    }
  },
  {
    "text": "than we're at, and I'm not adding a ton of money to do it. That's the main point here. So this goes all the way back to the original thing I was explaining to you. How I often will hold off on adding additional shares even though I typically would want to because I'm accounting for this scenario that I have to do. So that is that's what we need to see in Teachable Cuse. Essentially, this role will be done. It'll increase the utilization ever so slightly. We might even do another lot on top of this just because I probably want to use a little bit more here. But Teachable Cuse is a little on the higher end already. So I don't want to go crazy. And really what I'm waiting for then is if this option, if this 71 strike trades for a dollar 48, that's when I get out at a scratch. And then anything over past that that remaining dollar 48 would then start leading to a profit, the total profit potential given everything so far is 885. So again, it's not the 885 on 4,600. That's nothing I would be supremely proud about. But if you actually take a look at the return potential here for how much is being tied up and for the annualized return of this trade, it's actually pretty decent. It's still a 19 return. Now again, one of the key notes here is with favoring the basis adjustment, I'm",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 66,
      "start_timestamp": "00:43:05",
      "start_timestamp_seconds": 2585.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=2585"
    }
  },
  {
    "text": "if you actually take a look at the return potential here for how much is being tied up and for the annualized return of this trade, it's actually pretty decent. It's still a 19 return. Now again, one of the key notes here is with favoring the basis adjustment, I'm really deprioritizing the total PL of the short puts. And my goal is to get this basis down, down, down, down as much as I can. The further down I get at the more opportunities I have for adjustment. So that is an update and really that same methodology is exactly what I'm going to use in SSO. Okay, a couple other things really fast. And then I will open it up to QA. I'll hit that other question that we have. I want to take a look at a couple broad market scans. And the main reason for the scans is I want to see a few trends. So let's take a look first. I want to see the gap up versus gap down. So this I've been tracking for a while now. This is almost like tracking market breadth. Very often when the market is strong, you'll see actually a pretty comprehensive list of gap ups. Now to be clear, this isn't like every stock that's gaped up 5. There's overlays in terms of things that have options with at least 500 open interest and stuff like that. But it's on a relative basis. Right. I'm not comparing",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 66,
      "start_timestamp": "00:44:21",
      "start_timestamp_seconds": 2661.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=2661"
    }
  },
  {
    "text": "actually a pretty comprehensive list of gap ups. Now to be clear, this isn't like every stock that's gaped up 5. There's overlays in terms of things that have options with at least 500 open interest and stuff like that. But it's on a relative basis. Right. I'm not comparing this against the total universe. I'm comparing this against itself in my observations of historically. So 5 gap up. There's only three names that immediately tells me markets generally weak. If we take a look at gap down, we can see that there's 15 names. So about three times. And some of these names have actually been in pretty serious price extensions. So this to me becomes eyeball for shorter term mean reversion. Now an admin note here. A lot of my trading, especially because this is a free version. So some of the folks on the stream right now won't have this total context of what I've been doing. But a big thing that's been happening, especially with my directional trades is the timelines have come in significantly, meaning my average holding durations are very, very short. Maybe two weeks if that. So a lot of these things, I'm actually purposely playing even one, two day ideas. So if we take a look at something like QUBT. QUBT had a pretty significant initial rally here. And you can see that that, I mean, that's this is what a 2.8 standard deviation move. If you take a look at these",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 66,
      "start_timestamp": "00:45:47",
      "start_timestamp_seconds": 2747.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=2747"
    }
  },
  {
    "text": "actually purposely playing even one, two day ideas. So if we take a look at something like QUBT. QUBT had a pretty significant initial rally here. And you can see that that, I mean, that's this is what a 2.8 standard deviation move. If you take a look at these up, upside standard deviation moves, it is absolutely absurd. How many outsized moves this thing has had, it is beyond a statistical phenomenon. It has 3.2 instances where moves exceed a 3 standard deviation that effectively should not happen right from a statistical lens from a normally distributed curve. Two standard deviations being 25 of instances is very high. So this means that this stock frequently has pretty big moves against volatility expectations. Now this most recent down move to me starts to look interesting to play either a continuation or if this was a larger move, price, mean, reversion, but right now the move that we saw on Friday was actually very inside. The total move there was 0.45. So 0.46 standard deviation. So well within one standard deviation, nothing to be done here. But that's what I'm looking for. And as I flip through some of these, so that you know what my eyes are going to. So BCH like this, this is a massive down move. This is a 2.9 standard deviation downside move. So even with the dividend, and this has been trading really strong, this I actually would be interested to eyeball it for a",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 66,
      "start_timestamp": "00:46:48",
      "start_timestamp_seconds": 2808.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=2808"
    }
  },
  {
    "text": "that you know what my eyes are going to. So BCH like this, this is a massive down move. This is a 2.9 standard deviation downside move. So even with the dividend, and this has been trading really strong, this I actually would be interested to eyeball it for a potential upside play. Big put OI. And let's see where most of those puts are in July 18 and 18 July and 17 oct so much further out in time. I would be in here in 16 May. Super liquid. So I would probably have to play the front. And again, this would be a standard trade that would not be suitable for my account. But if I had a smaller account, I would be looking potentially to size it down massively, trade a one lot too lot. Again, depending on the size of the count, but for my account, this is not tradable. There's nothing, nothing useful to me, unfortunate, but an idea at least to be aware of. In V, this will be the same case. And this one actually has decent risk premiums. You could see it's been trending sideways in this three handle for a really long time. So this could be an interesting short strangle. Again, all of these names that are like this small, you kind of just have to see if it's something that's even worthwhile for the portfolio. But this is, well, this actually shouldn't even be in this scan. One on",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 66,
      "start_timestamp": "00:48:20",
      "start_timestamp_seconds": 2900.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=2900"
    }
  },
  {
    "text": "long time. So this could be an interesting short strangle. Again, all of these names that are like this small, you kind of just have to see if it's something that's even worthwhile for the portfolio. But this is, well, this actually shouldn't even be in this scan. One on here. How is this in this scan? The reason why this shouldn't be in the scan is because the gap down should be at least 5. I'll show you that the scan is and total OI should be greater than 500. So something with less than 100 options shouldn't be in here. Let's see if these are overriding one another. Why would this be in here? Yeah, anyways, I don't want to get to it. That shouldn't be any. Let's take a look at LALAS. Turnings now. LAN NKE NKE. 2.4 downside standard deviation. This has been rolling down though. So this is a tricky one. How did it do on earnings? Be on EPS, bad guidance for sure. So even though this had an extended downside move, I actually don't favor this for a price mean reversion. I actually favor this for a continuation. The market seems to like a little bit of upside activity here. Interestingly enough. Huh. Let's see really quick. So what I'm doing now is seeing how it recently has been behaving. Yeah, that makes sense. Call premiums falling off a cliff. Exactly what I would expect to see. Take a look. This is what",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 66,
      "start_timestamp": "00:49:50",
      "start_timestamp_seconds": 2990.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=2990"
    }
  },
  {
    "text": "a little bit of upside activity here. Interestingly enough. Huh. Let's see really quick. So what I'm doing now is seeing how it recently has been behaving. Yeah, that makes sense. Call premiums falling off a cliff. Exactly what I would expect to see. Take a look. This is what I want. So big changes in March 21. So obviously that's people moving around. And then so it's all the front. Like most of them are in the front explorations. Yeah, okay. So then this would be, how's the skew? Don't love that. Yeah. 27 vol. The 31s. 28. So actually it's pretty flat on the call skew. Yeah, I mean, this could be something easy for some short calls, gain some short delta's. This is a little bit more appropriately priced. So it's easier to trade. I don't love the 72 and a half. I would prefer it to be an even strike. But I don't really like the liquidity here on the 75s. So this would be fine. So that's an idea. Basic short calls and something like this. Again, for me, shorter term ideas. And the reason why short calls is I don't actually favor it. Or some sort of like big downside break. But I do think it would be slower to recover up past 75. And the reason I'm saying 75 versus my strike of 72 and a half is there's just an easy role in there. Because it effectively hasn't been above 82. So",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 66,
      "start_timestamp": "00:51:19",
      "start_timestamp_seconds": 3079.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=3079"
    }
  },
  {
    "text": "some sort of like big downside break. But I do think it would be slower to recover up past 75. And the reason I'm saying 75 versus my strike of 72 and a half is there's just an easy role in there. Because it effectively hasn't been above 82. So even managing the longer term trend with respect to the previous six months. Because again, remember, I'm not really trading in my lens. I'm not really trading things for three, four, five month hypothesis here. Just the market has become a little too active for that. Let's take a look at a couple others. These again, just looking at kind of some short delta ideas. The other thing to keep in mind is ADRs have been doing really well. So I still have my Boba trade on. And like the ADR world has actually been performing really, really well. Let's take a look at FedEx. FedEx has been another interesting one as I was thinking about it. Yeah, look at this. Mist on earnings. So I'm sure guidance was soft. Let's just poke through. What do we got? 1750. We got a few minutes. Let's take a look at FedEx. Earnings really fast. And see if anything jumps out to us from the report itself. Earnings release here. Earnings presentation. This is what we want. And we'll zoom in. Now again, when I'm doing these personally, a lot of times what I'll do is I'll scrape the internet and then",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 66,
      "start_timestamp": "00:53:28",
      "start_timestamp_seconds": 3208.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=3208"
    }
  },
  {
    "text": "Earnings really fast. And see if anything jumps out to us from the report itself. Earnings release here. Earnings presentation. This is what we want. And we'll zoom in. Now again, when I'm doing these personally, a lot of times what I'll do is I'll scrape the internet and then I'll actually run it through chat you PT now. But when I'm doing these streams with you guys, I actually think it's really important to crack open a few of these. One, to get familiar with looking at them. But then two, to get exposure to first hand source information, to take information that you see in a presentation like this and then to turn it into usable information. So let's see if that's the case here. I don't know yet. Yeah, so like revenue is trash. Revenue is absolute trash. So they are really not effectively expanding. We know this. Industrial economy remains weak. We know this. Volume trends by service. Let's see. International exports going up, freight going down, ground package going nowhere, priority and deferred flat. So the next thing to do is to figure out how much of the business is tied to these different things. So let's take a look at FedEx. And let's see. I mean, it doesn't. It's surprising. It actually surprises me that it looks this soft. How is it doing compared to UP? Yeah, see like look at this. The forward P E's 11. This is weaker. This is weaker. And",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 66,
      "start_timestamp": "00:54:58",
      "start_timestamp_seconds": 3298.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=3298"
    }
  },
  {
    "text": "So let's take a look at FedEx. And let's see. I mean, it doesn't. It's surprising. It actually surprises me that it looks this soft. How is it doing compared to UP? Yeah, see like look at this. The forward P E's 11. This is weaker. This is weaker. And exactly they're even trailing UPS. Wow. It's actually surprising. So this tells me a lot of stuff out of the gate. But from a high level, it surprises me to see like this level of weakness specifically in FedEx. Look at this. Wow. What is going on with you guys? I want to see their. I want to see the earnings call. Oh, no, I don't care about this. Do they have the transcript? So what I do with this again, feed it to chat GPT. I have a specific research analyst tool that I've been building to help me with stuff like this. So I'm going to ask it analyze this transcript and summarize all key trends specifically identify forecast information. All right, let's see what it's got. I'm telling you guys, if AI isn't firmly integrated with your process, you are literally so underpowered. It's not funny. Like using AI for stuff like this is just it literally is a cheat code because these typically take me a little while to read and synthesize. But now it's like, okay, so FedEx will separate FedEx freight within 18 months. There we go. Sorry, guys. Where did I leave off?",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 66,
      "start_timestamp": "00:56:56",
      "start_timestamp_seconds": 3416.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=3416"
    }
  },
  {
    "text": "using AI for stuff like this is just it literally is a cheat code because these typically take me a little while to read and synthesize. But now it's like, okay, so FedEx will separate FedEx freight within 18 months. There we go. Sorry, guys. Where did I leave off? No, so it's still this fucking CPU GPU issue. Sorry about that. Where did I leave off? I was talking about FedEx. I was talking about the spin off. Did you guys catch that or no? I can backtrack. I just want to reduce most, I think. Okay, I'll just highlight it super fast. So one of the key themes that they're talking about is separating freight within 18 months, which makes sense because freight is underperforming. I think freight highlights is the largest LTL carrier by revenue. They're operating profit increase 25 it did increase and it looks like they're looking to expand a little bit. They're expecting to achieve 4 billion in savings. He note savings. Cost optimization is one of the levers somebody can pull to increase profitability. Normally, if you have a company that is aggressively expanding or consuming market share, you care less about costs and you care more about acquiring new business. So the fact that they're expecting to see that amount in savings and cost reduction means that the company is slowing down massively. They're looking to roll out network 2.0, which is an initiative to consolidate operations, one truck, one neighborhood that",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 66,
      "start_timestamp": "00:59:16",
      "start_timestamp_seconds": 3556.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=3556"
    }
  },
  {
    "text": "and you care more about acquiring new business. So the fact that they're expecting to see that amount in savings and cost reduction means that the company is slowing down massively. They're looking to roll out network 2.0, which is an initiative to consolidate operations, one truck, one neighborhood that is designed to target 2 billion in savings by 27. Tri-color air strategy, again, efficiency and density. So a lot of these things are really designed savings costs. Let's take a look at guidance. Revenue expected to be up slightly. You're over here in Q3, Q4, Cyber Week boosted expected Q3, USPS contract headwinds, peak season volumes ahead of forecast in December, but not expected to carry through second half. Great expected to have seen revenue trow in Q2, so expecting sequential improvement. Okay. So it looks pretty soft. ISM shows 24 of last 25 months in contraction. This is for industrial economy. 60 of express and 90 of LTL revenue or business B2B, business to business linked. So this not only impacts FedEx, but this impacts a lot of the B2B consumers that they work with. And you can see why they're trying to unwind great, which makes a lot of sense. Interesting. Super interesting. So the tradable ideas from here, in my mind, is short FedEx. I would feel pretty comfortable with that kind of broader idea. Yeah, take a look, take a look at this. 10 strike wide. Let's take a look at five strike wide. So",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 66,
      "start_timestamp": "01:01:17",
      "start_timestamp_seconds": 3677.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=3677"
    }
  },
  {
    "text": "lot of sense. Interesting. Super interesting. So the tradable ideas from here, in my mind, is short FedEx. I would feel pretty comfortable with that kind of broader idea. Yeah, take a look, take a look at this. 10 strike wide. Let's take a look at five strike wide. So one quick note is if you're looking at a standard expiration and it's too wide to get the level of fidelity you want on probabilities, you can always click in to a weekly or get closer in time. And as you do that, you'll tend to see more strikes. So you'll see five strikes there, five strikes there, 10 strikes in the standards. Let's see if they have singles in here, no in there. Two and a halfs in here in the 12 days. And two and a halfs in here. So let's take a look at the two and a halfs, just that curiosity. What I want to do is get a sense of the skew. So I mean, look at, look at this. This is all you need to see up out front. Look at the volume build out. That's not. So for those that don't know, this is a custom vol over, oh, I script that I made that tracks on a relative basis and the in the put build out is huge in the near term. Let's take a quick look here. FDX. Exactly what I expected to see. Exactly what I expected to take a",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 66,
      "start_timestamp": "01:02:54",
      "start_timestamp_seconds": 3774.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=3774"
    }
  },
  {
    "text": "is a custom vol over, oh, I script that I made that tracks on a relative basis and the in the put build out is huge in the near term. Let's take a quick look here. FDX. Exactly what I expected to see. Exactly what I expected to take a look at the put build out. That's short AF. So this would be the kind of thing that for me, again, with the shorter term timeframes and short calls tend to take some time in order to come in. What I would do is actually size the trade up a little bit more than I would want. That's how I would gain the speed. And again, sizing up means give and take, right? If it moves against me in a big way, it would hurt. So it does require active management. But that's the general way I would play. You can see most of the puts were actually being sold that occurred at the bid. But 50 took between the market and and 24 of the calls were bought. That's actually a little higher than I would have expected. 28 March is where a lot of that volume build out is. Let's take a look at the surface really fast. Yeah. So the market is pricing in a higher probability of a smaller downside move with actually some upside severity. Interestingly, the tails on the out of the money calls being that high is a little surprising. That's what I",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 66,
      "start_timestamp": "01:04:06",
      "start_timestamp_seconds": 3846.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=3846"
    }
  },
  {
    "text": "is. Let's take a look at the surface really fast. Yeah. So the market is pricing in a higher probability of a smaller downside move with actually some upside severity. Interestingly, the tails on the out of the money calls being that high is a little surprising. That's what I see here. Cool. All right. I got to say 1800. I'm going to turn to questions. So feel free to throw whatever you want to take a look at in the chat. I'm going to run to the kitchen real quick. But I'm going to pick up with this one from Sky Omen and then throw anything else you want to take a look at. I'll be back in like a minute. I'm going to grab some sugar. Pretty bad. All right. So James says to oversimplify, VRP equals HV minus IV. You can do it that way. Involuntos seems to use a 30 day forward implied. However, in your VRP video, you use HV20. What's the reason in the discrepancy for the look back date? It's a really good question. And it's a perceptive question. So what is the timestamp? We're at like one hour eight minutes. So here is the answer to this. And it's actually a very simple answer. The reason why you see this is because the dates used in each are different. So implied volatility uses calendar days. Historic volatility uses trading date. So that's why you see 30 for IV, 20 for HV. And",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 66,
      "start_timestamp": "01:05:35",
      "start_timestamp_seconds": 3935.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=3935"
    }
  },
  {
    "text": "is the answer to this. And it's actually a very simple answer. The reason why you see this is because the dates used in each are different. So implied volatility uses calendar days. Historic volatility uses trading date. So that's why you see 30 for IV, 20 for HV. And their guess is exactly what we would expect without any context. What if thought it would be 30, 30? And that's why it's not. Next part. When we look at the plot, it shows forward 30 days. If we want to see if VRP exists in weeklies, there's a way that shows you to define period. Yeah, definitely. So that's exactly why you see the plot on mine built as it is. So if you take a look at, and again, this is the basic one, the actual surface that I'll use for VRP is in Excel. Because it's a little denser. And I run a couple other things in conjunction with it. But for kind of like simplicity and tracking, you can see what I do here is I run different periods. One day, vol, two day, vol, seven day, 30 day, 365 annual. And then I can take a look at risk premiums for one day, two days, seven day, 30 day, and so on and so forth. So you can custom code these to grab different periods and look back periods. The other thing that's kind of cool is you can change the way that it calculates",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 66,
      "start_timestamp": "01:08:29",
      "start_timestamp_seconds": 4109.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=4109"
    }
  },
  {
    "text": "a look at risk premiums for one day, two days, seven day, 30 day, and so on and so forth. So you can custom code these to grab different periods and look back periods. The other thing that's kind of cool is you can change the way that it calculates historic vol. A lot of times things will just use close to close, which is okay. But close to close only tells half the story, right? If something closes like this, close to close, but it has a massive big day like this, there's way more vol in this day than what the close to close would show you. Close to close would show you effectively going from here to here. Whereas in reality, it went from here to here to here to here, much bigger day. So that's another thing to tinker with with respect to using the vol calculations is for realized vol, you can use a lot of different things. And then for forward vol, you can either site from the options chain, right? So we can take a look at the front explorations for near term vol. But the other thing is you can take the 30 day vol and you can turn it into any period you want, right? It's just a matter of doing the square root of time. And you can tinker with different time frames using the base vol from the underlying from here. Or you can create your own vol surface",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 66,
      "start_timestamp": "01:10:05",
      "start_timestamp_seconds": 4205.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=4205"
    }
  },
  {
    "text": "30 day vol and you can turn it into any period you want, right? It's just a matter of doing the square root of time. And you can tinker with different time frames using the base vol from the underlying from here. Or you can create your own vol surface to come up with different expectations for different durations. But yeah, you in a nutshell can custom script that to be a lot of different things depending on what you're interested in. So that's a great question. Glad you asked. I'm going to James. Are you? Okay, James is on the chat good. So James, you got your answer here, but I was going to tag you in the in the discord, but it looks like you're here. So yeah, that's that. Any other questions you guys want to take a look at? Risa says I've seen heavy put selling broadly assuming because elevated IV, but tough to read. Yeah, that's a little ambiguous. That's a little ambiguous to. So with it like really depends on what you mean by put selling and what broadly means if we're talking sectors like yeah, what the overall what the overall trend is that you're seeing, but the market itself absolutely is showing a series of different hands and we can look at it from a broader breadth indicator, but I think the market right now is actually in a very defensive posture. That's what I pick up broadly. And the other thing",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 66,
      "start_timestamp": "01:11:13",
      "start_timestamp_seconds": 4273.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=4273"
    }
  },
  {
    "text": "that you're seeing, but the market itself absolutely is showing a series of different hands and we can look at it from a broader breadth indicator, but I think the market right now is actually in a very defensive posture. That's what I pick up broadly. And the other thing that I identify here is we can take a look at different period volatilities, right? So we can look at 90 day compared to three day and actually now I'm going to update these super fast because I think it would be good to have beyond 90 day with how things have been going. I think we can go out to probably like 150 day. We can add that but anyways using just the 90 day unfortunately because the vol has really peaked up near term, right? You can take a look at the five day vol even in individual tickers. Let's take a look at it's like spy and you can see that compared to 90 to five day, it's still way more volatile on a relative basis. Same thing for the average true range, two different measures of vol. So definitely seeing vol pick up across the board, but one of the big things to keep track of, especially with the broader market is the behavior of something like VIX. And VIX is actually showing you a lot. So we're seeing short term daily vol actually quite high. And then if we're taking look at the trend in",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 66,
      "start_timestamp": "01:12:24",
      "start_timestamp_seconds": 4344.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=4344"
    }
  },
  {
    "text": "but one of the big things to keep track of, especially with the broader market is the behavior of something like VIX. And VIX is actually showing you a lot. So we're seeing short term daily vol actually quite high. And then if we're taking look at the trend in VIX, VIX has actually been unwinding pretty nicely. Now I had a couple short VIX plays on playing two different things. One of them was literally playing raw price direction. And I was trying to hold out for 30, but as soon as I saw this double peak at 29 and a half, as soon as it started dipping below 29 as when the fades came on. And this is just playing the transit transitory phases of vol. And I don't think it's done here. I think that the probabilities in my mind lead towards another potential spike in vol. I don't think it's done, especially with the releases this week. And then more importantly, with the tariffs coming out on the second, I think you'll see a lot of that bleed through into the broader market expectations. So yeah, I think vol definitely is here. I think the VIX is only telling us one side of the broader vol picture, but I think there's a little more going on. Then if we take a look, Reese want to take a peek at Nvidia. Happy to. I think I agree. I still think Nvidia. I don't think it's baby with",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 66,
      "start_timestamp": "01:13:50",
      "start_timestamp_seconds": 4430.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=4430"
    }
  },
  {
    "text": "is only telling us one side of the broader vol picture, but I think there's a little more going on. Then if we take a look, Reese want to take a peek at Nvidia. Happy to. I think I agree. I still think Nvidia. I don't think it's baby with the bathwater because if you look at the multiples on Nvidia, Nvidia was was pretty pretty strong. So let's take a look at Nvidia here. And if we take a look at the forward PE, it's come down massively. The trailing PE was a bit higher, and this has been trending down as well. So I think the valuations on Nvidia actually are coming into a really interesting place. I think for a long time in video was a pretty high flyer, actually. So this recent activity, I think, has brought it back down to Earth, so to speak. Now, the question is always from a trader's lens is, well, what matters to us? And that typically is going to be some sort of price behavior, right? We care about what price is doing. And for me, it's still not doing well. So this isn't the point where from a trader lens, I would run in and start putting on positions. And it's really for that reason. I think it doesn't, I don't think it looks great. I think it needs to still gather its feet. And in a long term, I absolutely think, and I've said this multiple times,",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 66,
      "start_timestamp": "01:15:10",
      "start_timestamp_seconds": 4510.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=4510"
    }
  },
  {
    "text": "trader lens, I would run in and start putting on positions. And it's really for that reason. I think it doesn't, I don't think it looks great. I think it needs to still gather its feet. And in a long term, I absolutely think, and I've said this multiple times, I think all of these periods, effectively, with it dropping below 120 or just fantastic long-term investment opportunities in video, I just don't think there's any other way to look at it. It is literally at the epicenter of all of the broad technological changes that are coming down the pike. And I think that it's non-disputable. I think there's been a lot of people that have made tremendous amounts of money in Nvidia. So at some point, there's going to be people taking profits, right? And rightfully so, because on a split-adjusted basis, I mean, take a look. On a split-adjusted basis, the point of control right now is at three, no, I lied, 451. So let's take a look at what that represents. So this is 451 with price peaking at 153. That represents a 3,292.5 return. And if you take a look at the basis of these people when they got into it, again, around these levels, it's not even like we're going back super far, right? People back here got in for less than a dollar on a split-adjusted basis. But a lot of these people were getting in in 19 and 20 at these levels.",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 66,
      "start_timestamp": "01:16:35",
      "start_timestamp_seconds": 4595.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=4595"
    }
  },
  {
    "text": "people when they got into it, again, around these levels, it's not even like we're going back super far, right? People back here got in for less than a dollar on a split-adjusted basis. But a lot of these people were getting in in 19 and 20 at these levels. So for those folks, when you see stuff coming up at these high levels, there's going to be an uptick in selling to some degree, because why would you not start locking in some of those profits, which is exactly what I think you're seeing some of this near term behavior? We take a look inside our behavior. Let's take a look. So I want to sort this by date. I want to see the recent stuff. So this is 21 March, all of these. And what do you see? It's exactly what I would expect to see. It's more senior level folks that are taking profits, which is exactly correct. The smart move. With something trading at these levels, and with the amount of profit that a lot of these folks will have built in here, I genuinely believe it's the smart answer. And I think longer term anyways, it's healthier for the stock, because I think in video, even it's crazy to say this, but it's almost becoming a bargain buy, which is absolutely nuts to say in my opinion. I think the idea that this is a bargain play is absolutely insane, but I do think that",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 66,
      "start_timestamp": "01:18:01",
      "start_timestamp_seconds": 4681.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=4681"
    }
  },
  {
    "text": "it's healthier for the stock, because I think in video, even it's crazy to say this, but it's almost becoming a bargain buy, which is absolutely nuts to say in my opinion. I think the idea that this is a bargain play is absolutely insane, but I do think that is what you're seeing here. So because of that, I think longer term idea, good, I think shorter term idea, tenuous, I think it's reasonable to trade the vol around this period, but beyond that, not a whole much more in addition to that from my lens, at least than the near term. But for me, I have exposure personally to Nvidia through the teacher-pacuse position, through the SSO position that I've had. And I actually have swing traded in video a little bit as things move around just because it has been really volatile. If you take a look even at this most recent move, not from the lows, but from the closes, this is a 15 move in a couple weeks. But that being said, it definitely is weak. I don't think that there's a whole lot of debate in the near term that can be had about the weakness because it is continually trending down. It is starting to try to find a floor, but it's not found yet. Right? Lower, high, lower, high, lower, high, lower, lower, lower, lower, lower, lower, lower, lower, lower, low. So if this starts to consolidate and buck this trend, then",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 66,
      "start_timestamp": "01:19:18",
      "start_timestamp_seconds": 4758.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=4758"
    }
  },
  {
    "text": "the weakness because it is continually trending down. It is starting to try to find a floor, but it's not found yet. Right? Lower, high, lower, high, lower, high, lower, lower, lower, lower, lower, lower, lower, lower, lower, low. So if this starts to consolidate and buck this trend, then obviously we start to see a reversal of the trend. But before that, this isn't there. Yeah. Any other questions? Anything else that you'd like to take a look at while we're on here hanging out? I just put in my dinner order. It's not going to be here for a while. So I still have some time. There was a question in the discord that I actually want to flag more broadly. So let me grab this. I think it's a good conversation point. Most of you will have seen it. Again, from the discord more broadly, but Elizabeth had a question earlier today about tracking indicators. And this is a really, really great question because one of the important things that we can do as a trader while we're building a system is have like intentional actions. So one of the things that people will do is they'll just kind of like put on trades, just put on ideas, see how it goes, and then they'll have this really slanted memory of how things actually went. And that's wrong. So in this context, what we're trying to do is build a system that allows us to monitor the",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 66,
      "start_timestamp": "01:20:57",
      "start_timestamp_seconds": 4857.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=4857"
    }
  },
  {
    "text": "just kind of like put on trades, just put on ideas, see how it goes, and then they'll have this really slanted memory of how things actually went. And that's wrong. So in this context, what we're trying to do is build a system that allows us to monitor the things that we're looking at to explore a trade idea. So then we can make an evaluation on their efficacy. That's exactly what this is. And that's very, very cool. It's something I think is really important to do, especially for highly directional turnover style trades because you really are relying on a lot of those kinds of indicators, especially for trading things like long options, which I'm not sure if this is that. But the way that I think about doing something like this is actually very, very simple. If we go into a Google sheet and we just grab, I'm no idea what all this is. This is my scratch sheet. So we'll just clear all this nonsense out. And let's say for a simple example, our idea, if I can type into this without it freezing, our idea is let's say, Intraday price, cross over VWAP, trade in the direction, set a stop below initial VWAP, cross. Very simple idea. So then what we would do is we would build the infrastructure to actually track this. We would again go into our trading plan and we would define this further in our strategy outline. We need to",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 66,
      "start_timestamp": "01:22:22",
      "start_timestamp_seconds": 4942.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=4942"
    }
  },
  {
    "text": "in the direction, set a stop below initial VWAP, cross. Very simple idea. So then what we would do is we would build the infrastructure to actually track this. We would again go into our trading plan and we would define this further in our strategy outline. We need to figure out what kind of tickers apply to this. What the profit mechanism is those kinds of things. But to just show you in a simple example here. So then we would have something like date, probably a time because that actually will matter for intraday trading date time ticker will have the price level. And then we can have VWAP level. You can do VWAP level a couple of different ways. You can do whatever the VWAP level is. I actually like tracking something like VWAP level. And the reason is because then you can do a bunch of math that gives us a ton of context without having to do things yourself like is price above VWAP? Is price far above VWAP? How much further above VWAP is it? You can literally do all of those calculations over here. And then the important thing as always is the ability to aggregate this data up into something usable. So the way that that works is once we have enough samples in here, we can take a look at the trends. We can say price on VWAP or price behavior for the X period of time following VWAP tends to",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 66,
      "start_timestamp": "01:23:37",
      "start_timestamp_seconds": 5017.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=5017"
    }
  },
  {
    "text": "ability to aggregate this data up into something usable. So the way that that works is once we have enough samples in here, we can take a look at the trends. We can say price on VWAP or price behavior for the X period of time following VWAP tends to be blank and so on and so forth. Then you actually can build a trade idea off of that. So this is exactly how I would go about building the technical analysis tracker so that it's something you can aggregate the data and have ideas of their performance. What I do in a lot of my tools for stuff like this is I build an aggregation tool that does once I'll grab the headers for you. That does this. So what I do is this is the aggregation level. So then I would have on this side over here things like strategy or in this case it would be analysis indicator and I would list them all out and then I would track some of these metrics. And then beyond tracking of the metrics I would also pay really close attention to time frames. So above it I have a secondary version of this that I can input date windows so I can say like one Jan to one March. And then what it does is it pulls up I would input the strategy so in this case let's say it's iron condors. I would input the strategy it then",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 66,
      "start_timestamp": "01:25:12",
      "start_timestamp_seconds": 5112.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=5112"
    }
  },
  {
    "text": "secondary version of this that I can input date windows so I can say like one Jan to one March. And then what it does is it pulls up I would input the strategy so in this case let's say it's iron condors. I would input the strategy it then goes through the strategy performance from here. It pulls up the top level performance for the entire strategy and then it also pulls up the sample performance from all of this stuff down here which are the individual trades. So I literally would do this and it's because it will help a lot with again quantitatively identifying what's working for you and in what way because what doesn't work is guessing. Guessing works terribly. In fact. All right. Mateo, what up? Good to see you Mateo. Tulk fee says are you confident with Nvidia long term because you have a belief that AI will develop towards a GI or is there more that you think in demand for GPUs will continue even if AI development plateaus. That's a great question. I think it's because Nvidia's involvement in technology. Notice how I didn't restrict it to AI. I do think AI is probably going to going to be one of the largest revolutions that might outpace even the internet definitely pace it but might even outpace the total impact. So because of that the adoption of AI is going to be literally profound. It's going to be insane. We can already",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 66,
      "start_timestamp": "01:26:29",
      "start_timestamp_seconds": 5189.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=5189"
    }
  },
  {
    "text": "is probably going to going to be one of the largest revolutions that might outpace even the internet definitely pace it but might even outpace the total impact. So because of that the adoption of AI is going to be literally profound. It's going to be insane. We can already see it starting to happen. Now from that lens I think AI's ability to transform the landscape is so huge and I think Nvidia's involvement in that process is massive. So I think that gives it a massive singular way to benefit in the future but I think beyond that Nvidia has ingratiated itself in just about all major technological adoptions that I can find even down to supplying chips to automotive manufacturers which are becoming increasingly dependent on technology and chip production. So because of all of that and how expansive it is I don't see technological innovation slowing. I see it continuing to expand and evolve in a lot of different ways and I think so far Nvidia has positioned itself almost as a hedgemon because Intel does not pace Nvidia obviously different business as well but Intel Nvidia doesn't really have a lot of big competition at this point with what it does and how how expansive it is. So that's why I think it has a very robust business with a tremendous amount of potential. Now I think a lot of that potential at different points has been priced in but I do think the longer",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 66,
      "start_timestamp": "01:27:54",
      "start_timestamp_seconds": 5274.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=5274"
    }
  },
  {
    "text": "this point with what it does and how how expansive it is. So that's why I think it has a very robust business with a tremendous amount of potential. Now I think a lot of that potential at different points has been priced in but I do think the longer term multiple that it's at now is actually pretty conservative. Well, I think this thing having a lower than industry PE for the four or 12 months is actually nuts. I think that's like a straight up bargain and then I also think the value on the name is pretty strong. EHODGE says do you have a video on how you analyze a company for long term investing? I don't because honestly I don't do it. Most like the overwhelming majority of I like I really don't hold anything long term. Even the equity component of the coverage triangle when I'm trading ETFs that would be like the longest term holdings and very frequently like it's not holding the same shares for multi-year periods. I'm cycling through the shares held, scaling in, scaling out as things move around. So I don't actually think I have I don't think I have much material on like the long term investment approach because it's just really not something I do. I think in general I keep in mind those ideas and those potentials because I know different people have different time frames that they're trying to invest in. So obviously I try to",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 66,
      "start_timestamp": "01:29:21",
      "start_timestamp_seconds": 5361.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=5361"
    }
  },
  {
    "text": "much material on like the long term investment approach because it's just really not something I do. I think in general I keep in mind those ideas and those potentials because I know different people have different time frames that they're trying to invest in. So obviously I try to be helpful but yeah for myself the majority of what I'm doing is going to be shorter term. Now when we're in a bull market I definitely hold stuff longer but it's still not long term. It's still not multi-year periods for me typically. Paulus says I read that some of the 40 of price of a car is electronics and software. I definitely think it would depend on the car but let's see real quick. So break I'm asking in chat breakdown the cost the current cost to produce a car by category. What percentage of the cost comes from chip usage? Let's see we'll find that out. What else you guys got? Jonathan says AMD could have been competition but they kept filming the law. I completely agree. There was a pretty long period actually where those two were very very dominant competitors. So if you take a look at Nvidia and then if you take a look at AMD and then if we zoom these out much longer term let's go to like a 10-year period of this. Let's go to a 10-year here. For a long time actually these guys were pretty strong competitors and I",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 66,
      "start_timestamp": "01:30:43",
      "start_timestamp_seconds": 5443.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=5443"
    }
  },
  {
    "text": "look at Nvidia and then if you take a look at AMD and then if we zoom these out much longer term let's go to like a 10-year period of this. Let's go to a 10-year here. For a long time actually these guys were pretty strong competitors and I think your observation that AMD kept fumbling the ball couldn't be more correct because there is a period realistically that AMD was even outpacing Nvidia. Take a look at the relative move here. So let's take a look at 21 into 22 this period here. If you take a look at those relative periods to one another it's not even close. It really isn't. If we isolate 21 into 22 21. Oh damn. Damn Daniel. 21 I don't want a short change. 21 into 22 right like the move in here is just significant. So I definitely think there was an opportunity there and then they unfortunately weren't able to successfully capitalize on it. So yeah I think it's a completely accurate observation. Mateo sorry Paul says talking of chips what is ARM feeling? Let's see. ARM. Nothing. Chips are hurting really across the board. They do look a little bit better. Their earnings look soft. I mean I guess they're crushing expectations though. They are crushing it. Yeah I mean it really does look like they're like performing a little bit better here. But still short term downtrend. Take a look at the options chain. I mean all skew",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 66,
      "start_timestamp": "01:32:16",
      "start_timestamp_seconds": 5536.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=5536"
    }
  },
  {
    "text": "bit better. Their earnings look soft. I mean I guess they're crushing expectations though. They are crushing it. Yeah I mean it really does look like they're like performing a little bit better here. But still short term downtrend. Take a look at the options chain. I mean all skew and a lot of that call skew is in for April actually. When's it's earnings? Oh that's weird. That's really weird. So it has earnings on 7 May but take a look at all of these calls in for April. 3000 against 2000 okay so it's not that much. It just looks dominant. Imagine most people would be playing it for earnings. Yeah 19 against 26. They're their hedging downside on earnings. What about these longer term options? Yeah and then people are playing it long term to the upside. That's just long term bullish bias. 28 June is 27 against 18. 16 Jan 123 against 58. This is just long term long term stock replacement. That's exactly what that is. I'm going to tell you this if you wanted to buy leaps to run the poor man's covered call which I don't trade that personally. I trade ratio-called diagonals and collect income. Where would you be looking in why at those tickers? Yeah that's a great question. I have actually an entire playlist on the ratio-called diagonal in how I trade that. But effectively the premise that I'm looking for in a ratio-called diagonal if we were to use",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 66,
      "start_timestamp": "01:34:10",
      "start_timestamp_seconds": 5650.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=5650"
    }
  },
  {
    "text": "and collect income. Where would you be looking in why at those tickers? Yeah that's a great question. I have actually an entire playlist on the ratio-called diagonal in how I trade that. But effectively the premise that I'm looking for in a ratio-called diagonal if we were to use just the general outlier strategy process. Hold on Mateo says my understanding is that you want to buy low IV long term look for high short term IV to sell or over. See that is completely misunderstanding the game. It's a common mistake and there's a specific reason why that's completely misunderstanding the game. Let's take a look at an example. Let's find something that actually looks even remotely reasonable. I'm just going to grab something from this list here. This is like a bullish scan for stuff see if any name here. Fix out to me. Yes. Yeah this is fine. So WGS. So looking at WGS if we're trying to trade something to the upside. Let's just do a little bit of ballparking here. If we take a look at the ball ring here which I actually realize we should update the script shouldn't we? I think this script would be good if we had a little bit of context on the high and low. So let's grab this. And then this is going to be part of the example by the way. I didn't forget you. And then for this let's do update the script. So at",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 66,
      "start_timestamp": "01:36:02",
      "start_timestamp_seconds": 5762.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=5762"
    }
  },
  {
    "text": "script would be good if we had a little bit of context on the high and low. So let's grab this. And then this is going to be part of the example by the way. I didn't forget you. And then for this let's do update the script. So at the beginning of the IV label there is a h-l. That's actually a lie. Update the script. So the 7 and 30 IV HV and VRP label include the high. Oh fuck. I don't know what's up. Include the high, low, and average for the period. Okay so we're going to let that run. And then while this is doing that I'll get back to the example. So your question of we should be looking to get low long term IV and then high short term IV. Now there's nothing wrong with that. That is what I would call a secondary function though. And I'll explain why. WGS right now has an implied volatility of over 100. We don't know if that's higher low but on a relative value IVPS 54. So that means that right now the implied volatility is higher than it is over half the time. So objectively it's high. However if we look at the performance of this strategy or of this underlying even from before earnings here from like the second of seven Feb to current it's a 77.7 move. So if you're optimizing for a secondary function in this case I want to get",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 66,
      "start_timestamp": "01:37:51",
      "start_timestamp_seconds": 5871.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=5871"
    }
  },
  {
    "text": "objectively it's high. However if we look at the performance of this strategy or of this underlying even from before earnings here from like the second of seven Feb to current it's a 77.7 move. So if you're optimizing for a secondary function in this case I want to get lower IV then that would lead this to be not suitable for a long option strategy which would be a mistake. It's really important when you're trading strategies to always put first things first. And in something like a ratio called diagonal or in your instance a poor man's covered call is the way that you really make money on something like that is if it goes in the correct direction if it goes up you want upward movement. Now for a poor man's covered call it is a slightly different scenario because typically you'll actually have upside risk which I actually find to be a shortfall with how most people set up something like a poor man's covered call versus how I trade ratio called diagonals but the primary profit mechanism here is still price direction. You need price direction and move in your favor. So I think there's nothing wrong with sub optimizing or trying to get in with good IV parameters because IV is a big part of this. And if you grossly overpay for IV unless you are very correct in terms of your directional hypothesis then it will hurt. But in the example of a",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 66,
      "start_timestamp": "01:40:14",
      "start_timestamp_seconds": 6014.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=6014"
    }
  },
  {
    "text": "nothing wrong with sub optimizing or trying to get in with good IV parameters because IV is a big part of this. And if you grossly overpay for IV unless you are very correct in terms of your directional hypothesis then it will hurt. But in the example of a ratio called diagonal it doesn't really matter how much you pay for IV as long as the direction your trading is correct. You can have IV that's really overstated that contract significantly during the move but as long as the move is big enough because your analysis is looking for that it will easily overpower the IV move. So that's the context as to why and a quick reminder for something like that is you can always just use the Greeks right so if you go out to 19 step they only go out 180 days versus leaps but close enough. And if you take a look at delta or even a slightly in the money option it's 67. You look at the Vega it's 27 right so delta your directional exposure is literally over two times that of your vol exposure. Now you have to do a little bit of an analysis based on how much the volatility moves compared to how much the direction moves and that's exactly how you can use things like ADR, ATR, total ranges for sure that's typically what I would do for that broader context but yeah in this case if you over",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 66,
      "start_timestamp": "01:41:35",
      "start_timestamp_seconds": 6095.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=6095"
    }
  },
  {
    "text": "of an analysis based on how much the volatility moves compared to how much the direction moves and that's exactly how you can use things like ADR, ATR, total ranges for sure that's typically what I would do for that broader context but yeah in this case if you over optimize for IV well you're over optimizing for the wrong thing it's you need direction so. Jonathan says even recently with the pricing of the 1970 they're trying to emulate what Nvidia yeah I agree and AMD has been on the back foot for some time actually which is a bit of a bummer because I really do think that they were pretty well positioned for a while. Paul says many chip companies did did have extravagant P.E.s and that's why you saw them get crushed so hard even though that the prospects look so good for them in a high inflationary or even a recession prone environment high P.E. names get crushed because expectation of future earnings naturally contracts pretty massively so yeah I think that that completely aligns. All right cool that about wraps me up so just to summarize the game plan for the week it does look like there are a couple bigger releases for the SP 500 we see that later definitely later in the week I think that the near term game plan remains about the same for me it will include probably managing those coverage strangles this week specifically on the short put",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 66,
      "start_timestamp": "01:42:51",
      "start_timestamp_seconds": 6171.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=6171"
    }
  },
  {
    "text": "look like there are a couple bigger releases for the SP 500 we see that later definitely later in the week I think that the near term game plan remains about the same for me it will include probably managing those coverage strangles this week specifically on the short put side. Risk premium trade specifically in the indices continue to be extremely lucrative the ball trade and VIX also extremely lucrative especially for pops above 25 so keeping eyes on that I think the other thing I'm paying attention to is any residual earnings movement so post earnings announcement drift although the time frames I've been trading those is contracted and then most of what I'm trading right now is short premium strategies and it's because the market more broadly is favoring that not just because of the vault but because of the actual price movements a lot of the price movements have been way more choppy as compared to trendy so that benefits sell side strategies so that's what it's looking like as always if you guys need anything you can hit me up in the discord you can use the ask Eric channel that's the one I monitor the most closely so anything directly for me I will see it there if you need anything else in the meantime let your boy know be an outlier see you later",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 66,
      "start_timestamp": "01:44:07",
      "start_timestamp_seconds": 6247.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=6247"
    }
  },
  {
    "text": "the most closely so anything directly for me I will see it there if you need anything else in the meantime let your boy know be an outlier see you later",
    "metadata": {
      "video_id": "C1UbvCjzUDE",
      "title": "Trading Prep | Outlier Pro Live",
      "url": "https://www.youtube.com/watch?v=C1UbvCjzUDE",
      "upload_date": null,
      "duration": 6333.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 66,
      "start_timestamp": "01:45:17",
      "start_timestamp_seconds": 6317.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=C1UbvCjzUDE&t=6317"
    }
  }
]