[
  {
    "video_id": "CcLu6CfZhEw",
    "title": "A Simple Guide to Using Unusual Options Activity",
    "url": "https://www.youtube.com/watch?v=CcLu6CfZhEw",
    "upload_date": "20250928",
    "duration": "PT19M15S",
    "channel_name": "Outlier Trading",
    "description": "💡Trade alongside Erik and level up your strategy inside the Outlier Pro Community—get exclusive weekly livestreams, private chat access, market & trade analysis, and more. https://www.patreon.com/OutlierTrading\n\n▬ RESOURCES\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Join the FREE Outlier Community. https://www.patreon.com/c/outliertrading/chats\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n\n▬ DISCOUNTS\n► 50% off Options Omega Backtesting. https://optionomega.com/register/esinvests\n►50% off the ORATS Platform and Tool Suite! \nhttps://orats.com/esinvests\n► Barchart Premium - Try for Free. https://www.barchart.com/get-barchart-premier?fpr=xaiek\n► 5% off Unusual Whales Options Flow Platform. http://unusualwhales.com/referral#esinvests\n\n▬ VIDEO NOTES\n#optionstrading\n\nOutlier Strategy Process. https://youtu.be/DFT8Gg9wThI\n\n\n\n▬ DISCLAIMER\nThe content presented is for informational purposes only and any opinions, news, research, analyses, or other information contained are provided as general market commentary and do not constitute investment advice. Outlier Trading, its affiliates, and employees are not responsible for any investment decisions made based on the information presented. Outlier Trading does not guarantee the accuracy, completeness, or reliability of any information presented and is not liable for any losses or damages arising from the use of or reliance on this information. By accessing this content, you acknowledge and agree to these disclosures and terms of use.",
    "chunk_index": 1,
    "total_chunks": 1,
    "text": "DOWNLOAD FAILED Could not access the original audio for this video This transcript is a placeholder because YouTube blocked all download attempts. You may need to manually transcribe this video by watching it on YouTube. httpswww.youtube.comwatch?vCcLu6CfZhEw 1050.581577 This video has been flagged for manual processing.",
    "start_timestamp_seconds": 0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=CcLu6CfZhEw&t=0"
  }
]