[
  {
    "video_id": "cFB8wKv1dII",
    "title": "VIX vs VXX Explained Simply (For Active Traders)",
    "text": "What's up outliers? Today we're talking about VIX versus VXX. These are two volatility products that are broadly misunderstood but really really useful. By the end of the video, you're going to have an understanding of what they are, what their nuances are, and then more importantly, how to practically implement them into your portfolio. Let's dig in. So we have the VIX which is the CBO volatility index and then we have the VXX. We're going to talk about each and then we're going to summarize them for some key insights relevant to you. We're going to cover what they are, how they're calculated, how they're traded, their behavior in the market, specific risks associated with them. So the first things first, what they are, VIX is a 30 day volatility calculation. It is an index. If we take a look at VIX right now, it is 2642. If I go to SPX and we look at its 30 day volatility. So it's current IV we go down here. The current IV is 25.94. Notice how they're effectively the same. And it's because they're tracking effectively the same thing, which is 30 day ball in S&P 500 options. Then we have the VXX. VXX is a bit different. Notice how it looks different. This is an exchange traded note. And it tracks two different terms of volatility. And I will show you what this means. If we go into VIX, there's a great website from CBO and great web",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 95.5,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=cFB8wKv1dII",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFB8wKv1dII&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 908.0
  },
  {
    "video_id": "cFB8wKv1dII",
    "title": "VIX vs VXX Explained Simply (For Active Traders)",
    "text": "we have the VXX. VXX is a bit different. Notice how it looks different. This is an exchange traded note. And it tracks two different terms of volatility. And I will show you what this means. If we go into VIX, there's a great website from CBO and great web page that goes through all different kinds of detail of what VIX is, how it's calculated. And you can see that's actually a permutation. It's built from a calculation. If we go do the same thing in VXX, this is from Barclays, I path, we can get a sense of what this thing is built of and notice how it's not a calculation, but it's actually two different futures. There's a heavier waiting for the front futures contract. And then a lighter waiting for the back futures contract. What ends up happening is each month as we progress through the month, the waiting will change to represent this distribution of front and next month futures. This is really important in its part of the reason why they behave differently. If we take a look at VIX versus VXX, let's take a look at this spike that occurred back in March. We can see that from kind of like a pre move low to the high. VIX moved 258%. If we look at that same move in VXX, it was only 104% why is this? Because this is exposed entirely to 30 days, whereas this has a mix of 30 days",
    "start_timestamp_seconds": 69.5,
    "end_timestamp_seconds": 170.5,
    "start_timestamp": "01:09",
    "video_url": "https://www.youtube.com/watch?v=cFB8wKv1dII",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFB8wKv1dII&t=69",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 908.0
  },
  {
    "video_id": "cFB8wKv1dII",
    "title": "VIX vs VXX Explained Simply (For Active Traders)",
    "text": "We can see that from kind of like a pre move low to the high. VIX moved 258%. If we look at that same move in VXX, it was only 104% why is this? Because this is exposed entirely to 30 days, whereas this has a mix of 30 days or some front future and then the next term. So it's not all necessarily in the front. This is also used differently. Notice how the graphs look different. This has volume. Why is that? It's because this actually has an underlying. There is a bid and there is an offer for VXX. So if we go into trade, you'll see that there's a bid, there's an offer, there's a size and there's volume. There's an underlying that trades as well as options. If we go to VIX, you'll notice there's no bid, no offer, no size, no volume because there is no underlying. You can only trade options in VIX and futures with forward slash VX, but slightly different thing. The reason why this nuance is important is because something like VXX will experience role yield, which often futures are in contango, which means that the back is more expensive than the front, which costs money. Let's take a look again and make this all make sense. If we take a look at what this current waiting is, which is 94.7% D15 and then 5% in Jan, right now VIX is actually slightly elevated, but if we take a look",
    "start_timestamp_seconds": 145.5,
    "end_timestamp_seconds": 252.5,
    "start_timestamp": "02:25",
    "video_url": "https://www.youtube.com/watch?v=cFB8wKv1dII",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFB8wKv1dII&t=145",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 908.0
  },
  {
    "video_id": "cFB8wKv1dII",
    "title": "VIX vs VXX Explained Simply (For Active Traders)",
    "text": "than the front, which costs money. Let's take a look again and make this all make sense. If we take a look at what this current waiting is, which is 94.7% D15 and then 5% in Jan, right now VIX is actually slightly elevated, but if we take a look at VIX futures forward slash VX and we look at Dson Jan, if we look at Ds right now Ds is trading for 2235 ish. If we go to January, it's at 2285. So these are still slightly more expensive than these. So as these are closed out for 2235, pretending that the role is happening right now to make the point clear. If these are closed at 2235 and then moved out for 2285, you're taking a loss there. Now again, this yield sometimes can be positive, but more often than not, it's negative and it's slowly erodes the value. This is why if you look at a long-term performance of VXX, it looks like this. Actually, a lot of times it has to reverse split to even stay in existence. And it's because it continually erodes over time it's by design and it's designed to do this. Now, if we continue with this comparison and we then move into two other important details. The first one is VIX products are cash settled because there's no underlying. VXX, if you're trading options in VXX, there's actually an underlying. So there's underlying settlement, which is important to pay attention to",
    "start_timestamp_seconds": 236.5,
    "end_timestamp_seconds": 343.5,
    "start_timestamp": "03:56",
    "video_url": "https://www.youtube.com/watch?v=cFB8wKv1dII",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFB8wKv1dII&t=236",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 908.0
  },
  {
    "video_id": "cFB8wKv1dII",
    "title": "VIX vs VXX Explained Simply (For Active Traders)",
    "text": "if we continue with this comparison and we then move into two other important details. The first one is VIX products are cash settled because there's no underlying. VXX, if you're trading options in VXX, there's actually an underlying. So there's underlying settlement, which is important to pay attention to because it adds a slightly different risk factor. We already talked a little bit about the behavior. The behavior of these is quite different, and it's because of what their exposure is tied to. So continuing this point. As volatility changes, volatility typically is going to change more in the front and then less as you go further out in time things become more stable. That's because when the market is going through turmoil in the front, everybody is running around with their hair on fire, but in the long run, we typically know that it will reconcile to a more normal behavior. So when we see big changes in vol, that's why you tend to see a larger change in the front. So in this case, 30 days, as compared to something that has some exposure to the front, and then some exposure to a follow on month. Now, there's other reasons that go into the difference in performance here. That's outside the scope of the video is an introduction. The main thing to notice that they are holding different things, so they perform slightly differently. Now, I want to talk a little bit about some of the risks",
    "start_timestamp_seconds": 313.5,
    "end_timestamp_seconds": 420.5,
    "start_timestamp": "05:13",
    "video_url": "https://www.youtube.com/watch?v=cFB8wKv1dII",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFB8wKv1dII&t=313",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 908.0
  },
  {
    "video_id": "cFB8wKv1dII",
    "title": "VIX vs VXX Explained Simply (For Active Traders)",
    "text": "there's other reasons that go into the difference in performance here. That's outside the scope of the video is an introduction. The main thing to notice that they are holding different things, so they perform slightly differently. Now, I want to talk a little bit about some of the risks that people don't actually fully appreciate in here. The main thing despite or different than the difference between European, American style options and stuff like that is the actual tradable behavior. So for example, let's say that you saw VIX right now at 26 and you're like, well, VIX long term is mean reverting both of these are what is mean reverting. It means that over the long run, they approximate back down towards some sort of average in a literally explain it to you and show it to you. This is a max duration weekly chart of VIX. Notice how even as we go back into the 80s, we started here at like 21 in the 80s. And then right now in 26 were at 1861. So we're at $21 in 1980s, late 80s and now we're few points below. And you notice how every single time it absolutely skyrockets it comes back down. This is tradable, but it looks different than you think it might. And I'll show you why with an example on a moment, but this is true mean reversion. If we take a look at something that isn't mean reverting, at least in the long",
    "start_timestamp_seconds": 407.5,
    "end_timestamp_seconds": 501.5,
    "start_timestamp": "06:47",
    "video_url": "https://www.youtube.com/watch?v=cFB8wKv1dII",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFB8wKv1dII&t=407",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 908.0
  },
  {
    "video_id": "cFB8wKv1dII",
    "title": "VIX vs VXX Explained Simply (For Active Traders)",
    "text": "skyrockets it comes back down. This is tradable, but it looks different than you think it might. And I'll show you why with an example on a moment, but this is true mean reversion. If we take a look at something that isn't mean reverting, at least in the long term like SPX, notice the difference here. If we start again from the same time frame in the late 80s, we can see that it does oscillate around short term averages. But over the long run, this clearly has positive drift. It clearly is just accelerating up into the right. This is something that might have short term mean reverting tendencies, but not long term. Another really important trait with any sort of volatility product is that if we zoom this in to be a slightly shorter term time frame, we also clusters that means that it spends time hovering around wherever it is before it goes through a transitory phase, any either mean reverts or continues where it's at before it explodes. That's another highly tradable effect. So why do I say that the way that this looks is different than you might expect? Well, let's use an example. If we take a look here when VIX rallied from was the ninth of October, it was like 16 in change, and it rallied to a high of like 29. We would think, hey, if I see VIX high, I want to trade it to the downside. Maybe you initially",
    "start_timestamp_seconds": 474.5,
    "end_timestamp_seconds": 577.5,
    "start_timestamp": "07:54",
    "video_url": "https://www.youtube.com/watch?v=cFB8wKv1dII",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFB8wKv1dII&t=474",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 908.0
  },
  {
    "video_id": "cFB8wKv1dII",
    "title": "VIX vs VXX Explained Simply (For Active Traders)",
    "text": "If we take a look here when VIX rallied from was the ninth of October, it was like 16 in change, and it rallied to a high of like 29. We would think, hey, if I see VIX high, I want to trade it to the downside. Maybe you initially mistakenly think I should sell calls. Why shouldn't you have any sort of naked short call and something like VIX? Well, it's because it can rip your face off and go up to 80 from here. It can absolutely defy gravity for short periods of time that can put you in a really dangerous spot with your broker forcing liquidation and things like that. That's why naked shorting in here doesn't make sense. Now, the next thing is the way you make money on something like this can look different. So you might think to yourself, well, I'll buy a put the logical thought you want to trade something to the downside. And if you buy a put here and then you sell it down here, you will make money, but you won't make what you think you should. So let's take a look at that example really, really quick. I took us to the 17th of October. We're back in time. And let's say that you want to trade this thing to the downside. So you go out to the next primary expiration. And while this is loading, I'll explain that you'll notice how the option chain looks really",
    "start_timestamp_seconds": 565.5,
    "end_timestamp_seconds": 641.5,
    "start_timestamp": "09:25",
    "video_url": "https://www.youtube.com/watch?v=cFB8wKv1dII",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFB8wKv1dII&t=565",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 908.0
  },
  {
    "video_id": "cFB8wKv1dII",
    "title": "VIX vs VXX Explained Simply (For Active Traders)",
    "text": "I took us to the 17th of October. We're back in time. And let's say that you want to trade this thing to the downside. So you go out to the next primary expiration. And while this is loading, I'll explain that you'll notice how the option chain looks really wonky, right? You can see that the 50 delta is literally out here at 20 and a half. Why is the 50 delta not closer to at the money? Because the market knows that it's not going to spend forever up here. The market knows that it's going to go lower. Why does that matter? Because it's priced into the options. Again, it doesn't mean that you can't make money. You can, but it's just not what you think you will. So let's take a look. If I buy this at the money. But which is the 24 when the underlines at 2450, again, the 50 delta is still out here. But I'm buying what's closest to at the money right now relative to spot price. We get this for $4.45. It literally is a delta of one. The gamma is essentially flat because it is a delta of one. This is considered completely in the money even though it's sitting at the money. Again, that's because the market knows that this will mean river. So let's go to 27 October. I'm fast forwarding us slightly so that you can see how it behaves as it goes through this contraction.",
    "start_timestamp_seconds": 631.5,
    "end_timestamp_seconds": 703.5,
    "start_timestamp": "10:31",
    "video_url": "https://www.youtube.com/watch?v=cFB8wKv1dII",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFB8wKv1dII&t=631",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 908.0
  },
  {
    "video_id": "cFB8wKv1dII",
    "title": "VIX vs VXX Explained Simply (For Active Traders)",
    "text": "This is considered completely in the money even though it's sitting at the money. Again, that's because the market knows that this will mean river. So let's go to 27 October. I'm fast forwarding us slightly so that you can see how it behaves as it goes through this contraction. Remember as a delta of one. So if we take a look at what our option is worth now, we originally bought it for 445. It's now trading for 60. So if you bought it for 445 and a trading at 60, you've made money. But you didn't make as much as you otherwise think you should because remember it was trading at 24 and a half when we started now it's at like 16. So it's almost a 10 point move. It's just shy of a 9 point move that happened in it had a delta of one. So we would have expected this premium to change by at least 9 points. That's what the delta was when it was the delta of one. So what's happened here. It's because Vega has changed so massively. You're starting Vega in this position was 2581. So this massive amount of Vega absolutely counteracted the majority of what you saw in those options. So the underlying change by $8.50 when again, you have a delta of one we would expect to 8.5 to $9.5 of change in premium yet your premium only changed by 2.1 points. Why is that? Because the volatility",
    "start_timestamp_seconds": 693.5,
    "end_timestamp_seconds": 773.5,
    "start_timestamp": "11:33",
    "video_url": "https://www.youtube.com/watch?v=cFB8wKv1dII",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFB8wKv1dII&t=693",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 908.0
  },
  {
    "video_id": "cFB8wKv1dII",
    "title": "VIX vs VXX Explained Simply (For Active Traders)",
    "text": "absolutely counteracted the majority of what you saw in those options. So the underlying change by $8.50 when again, you have a delta of one we would expect to 8.5 to $9.5 of change in premium yet your premium only changed by 2.1 points. Why is that? Because the volatility here, absolutely unwound your position. So in this context, you still walked out slightly profitable and it's because of how much it moved but notice how much it needed to move for you to get out profitable. If it didn't move that much and let's say that you got in here and then you wanted to get out here after it still had like a 6 point move you probably are negative. And that's because the market knows it's me in reverting so it's priced into the options the last thing. If you think, oh, I should hold Vxx because we don't know when the market's going to pop but the market is likely to pop at some point. So if we zoom this out longer term, we can see that it spends a lot of its time kind of buried here and when it's hovering at these lows, you might think to yourself, oh, all just buy some until the market pops. The problem with that is twofold one with something like Vxx that does have an underlying remember it doesn't pop as much and is because it's spread across those two terms. And again, a few other factors",
    "start_timestamp_seconds": 754.5,
    "end_timestamp_seconds": 855.5,
    "start_timestamp": "12:34",
    "video_url": "https://www.youtube.com/watch?v=cFB8wKv1dII",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFB8wKv1dII&t=754",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 908.0
  },
  {
    "video_id": "cFB8wKv1dII",
    "title": "VIX vs VXX Explained Simply (For Active Traders)",
    "text": "might think to yourself, oh, all just buy some until the market pops. The problem with that is twofold one with something like Vxx that does have an underlying remember it doesn't pop as much and is because it's spread across those two terms. And again, a few other factors outside the scope here. The second reason is because as you're holding it over that time your experiencing that role yield which often is negative meaning you're slowly eroding value. It'd be very, very thoughtful when you employ some sort of volatility product like this. There's a lot of nuance. Best recommendation is paper trade them for a while before you do anything with them. Understand how they behave. Then you can make informed decisions because you can make a lot of money from these. There's way more advanced strategies that use things like Vx relationship to Vxx UVx, Y and Vx. There's a lot of really cool things you can do with volatility, but you first have to understand them in detail. Great way to do that is via paper trading. If you have any questions, let me know. Be an outlier. See you later.",
    "start_timestamp_seconds": 832.5,
    "end_timestamp_seconds": 903.5,
    "start_timestamp": "13:52",
    "video_url": "https://www.youtube.com/watch?v=cFB8wKv1dII",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFB8wKv1dII&t=832",
    "chunk_index": 11,
    "word_count": 196,
    "upload_date": null,
    "duration": 908.0
  }
]