[
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "Edge in options trading or trading in general looks completely different than probably the overwhelming majority of you understand. And the goal of this video is to clear that up. There's nothing that complicated about what we're going to talk about. It's just discussed in a way that you're not used to probably hearing it because I want to talk about three things. I want to talk about what edge isn't what it is. And then at the end of the video, I'm literally going to give you a step by step guide on how to clearly find the fine and then capitalize on sources of edge. Let's start with what edge isn't. And if we go to one of our favorite places on Reddit and we, this is super old for me years ago, but it says, where is the edge? You will see places like this or this person that says, tasty trade is that IV is overstated compared to realizable. This is actually a completely viable source of edge. It's just, it just doesn't work the way that people think it does, which we'll talk about. This says your edge isn't management. This is completely incorrect and you'll see why. This one is saying that feels like the easy money is gone, which is also wrong. The fact of the matter is that you're going to find a ton of terrible information about edge. So, first things first, options are not edge. They are simply an asset",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 85.44,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "you'll see why. This one is saying that feels like the easy money is gone, which is also wrong. The fact of the matter is that you're going to find a ton of terrible information about edge. So, first things first, options are not edge. They are simply an asset class. The way to think about this concept of edge is it flows a lot differently than what you think because people think that options are complex. So if I learn options, I now have an edge. The reality is there's plenty of people that are willing to put in the work to learn about options. Therefore, there is no edge there. It's simply a way to capitalize on what an edge might be. Another is the DeltaU select, the Day's to expiration. Theta itself, different options structures like strangles, verticals, iron condors, literally none of those are edge. There are just decisions about how you're looking to place a trade ideally to capitalize on an edge. But not edges in and of themselves. Or indicator settings, whether you use 1226 or 1326 on your Mac D is not an edge. Those are signals defined by whatever methodology you're using that might help you identify or extract or maximize an edge. But they don't provide an edge in and of itself. Selling premium is not an edge. If there was a straight up edge in selling premium, everybody would do it. But there's a reason why they don't. And it's",
    "start_timestamp_seconds": 68.56,
    "end_timestamp_seconds": 169.96,
    "start_timestamp": "01:08",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=68",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "that might help you identify or extract or maximize an edge. But they don't provide an edge in and of itself. Selling premium is not an edge. If there was a straight up edge in selling premium, everybody would do it. But there's a reason why they don't. And it's because selling premium can capture an edge, but it's not inherently an edge itself. We already talked about this idea of understanding options, not being an edge. It's just what you need to do in order to play the game. Risk management is we talked about. It doesn't create an edge. I can manage my risk very, very carefully. And that doesn't mean I'm going to have any sort of positive return. It just means that I'm going to have good risk management. You have to have good risk management. But you also have to have an edge. Risk management does an equal edge. It allows you enough grace and robustness in your portfolio to attempt to extract an edge. Not one itself being consistently profitable is not inherently an edge. You can have very high win rate strategies that actually lose money. I'll show you. Let's take a look at a hypothetical trading system that wins 90% of the time. If your average win is 200 bucks, high probability, really, really high probability of making 200 bucks. And over the lifespan of your strategy, 10% very infrequent. So if we're using 50 trades, 5 trades lose $2,000. It's the",
    "start_timestamp_seconds": 145.84,
    "end_timestamp_seconds": 255.24,
    "start_timestamp": "02:25",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=145",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "at a hypothetical trading system that wins 90% of the time. If your average win is 200 bucks, high probability, really, really high probability of making 200 bucks. And over the lifespan of your strategy, 10% very infrequent. So if we're using 50 trades, 5 trades lose $2,000. It's the tail risk. This is if you're selling super far out of the money options every once in a while, you're going to get a big move. We could take a look real quick at what that might look like. If we look at selling a 37 days text operation, put in spy. That takes us out right now to the 628. If we analyze the PNL here, we're looking to make 236 bucks. So what's the equivalent of this scenario? This has about a 90% probability of winning. But you can tell that this is a 10x loss, we're on average making 200, losing 2 grand. So the question is, where do we lose 2 grand here? Well, if we eyeball it, we lose 2 grand at 61587. That represents less than a 10% decline in S&P. So is that 10% decline exceedingly probable though? But is it possible that that happens over 10% of the lifespan of selling these? Actually, it largely will depend on the path, how do things happen to unfold? But the point is that this is, you don't need the world ending or some sort of crazy unlikely scenario. Literally just needs to drop 10%.",
    "start_timestamp_seconds": 231.48,
    "end_timestamp_seconds": 331.32,
    "start_timestamp": "03:51",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=231",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "that happens over 10% of the lifespan of selling these? Actually, it largely will depend on the path, how do things happen to unfold? But the point is that this is, you don't need the world ending or some sort of crazy unlikely scenario. Literally just needs to drop 10%. Over the course of these 39 trading days, that's completely realistic. That's the point here when we're looking at consistently profitable or high win rate strategies. That's not inherently an edge. So what I'm highlighting here is that very frequently, options traders look at this equation from the exact wrong lens. We start backwards. We start with options, then we start trying to figure out where we're going to trade the vertical spread or what options we want to trade the wheel in or other versions or what underlines we want to trade the wheel in and other versions of that. And the issue is it's completely backwards. Let's talk about getting this oriented correctly. Edge simply put is positive expected return. It doesn't necessarily mean that you outperform the market. That's alpha. But it means that whatever you're doing in the long run makes money. Now if we think about different ways to make money, we have to start with an effect. The way to think about a market effect is something that happens either structurally, gave you really, but something that occurs that you see, you can identify and you can find a way to trade it successfully.",
    "start_timestamp_seconds": 313.32,
    "end_timestamp_seconds": 418.36,
    "start_timestamp": "05:13",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=313",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "about different ways to make money, we have to start with an effect. The way to think about a market effect is something that happens either structurally, gave you really, but something that occurs that you see, you can identify and you can find a way to trade it successfully. Let's talk about a source of edge that you all know. If I go to this chart and spy and I zoom out over a really, really long timeframe, this is effectively going back to 1995. One of the things that I notice is that S&P 500 tends to go up over time. This is called drift. The market drifts up over the long run. That's an edge. That is a way to make money. This is positively expected right from the jump. There's your first edge for free. You can take action on that immediately if you so choose. The issue is in general, edge is way more abundant than people think, but it's way less profound than people think. More often than not, an edge like this is not lambo in two weeks kind of money. This is your money doubling every seven years, but if you're starting with five grand, your money doubling every seven years isn't necessarily that inspiring. That's why the concept of saving is so important and why consistency is so important. Because if you can do those and you can amplify the market return slightly, all the people are starting to realize that",
    "start_timestamp_seconds": 394.76,
    "end_timestamp_seconds": 497.0,
    "start_timestamp": "06:34",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=394",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "with five grand, your money doubling every seven years isn't necessarily that inspiring. That's why the concept of saving is so important and why consistency is so important. Because if you can do those and you can amplify the market return slightly, all the people are starting to realize that you're not going to have a lot of money. For those that don't know, I started with a tiny account. I grew up relatively poor, but I really focused on saving. That's exactly how I hit my first million before I was 30. I was not on some sort of profound roadmap to do that. I didn't get into some sort of crazy, lucrative career. I was a marine officer, which is awesome, but you make good money, but you're not making that much money. It's because of these principles that I'm explaining to you. So we now know what edge isn't, we know what edge is. Let's talk about where we can find edge, and then I'm going to give you literally a step by step guide. Real sources of edge exist in market effects. Market effects that we can make money from, I refer to as profit mechanisms. The reason for this is there are plenty of market effects that we cannot monetize, but they're still there, but they're just not reachable due to things like friction. The cost of doing business costs to carry stuff like that. So one of the ways that we can create true",
    "start_timestamp_seconds": 474.48,
    "end_timestamp_seconds": 558.64,
    "start_timestamp": "07:54",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=474",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "The reason for this is there are plenty of market effects that we cannot monetize, but they're still there, but they're just not reachable due to things like friction. The cost of doing business costs to carry stuff like that. So one of the ways that we can create true edge through stuff like indexed additions and deletions. There's a phenomenon that as a company gets added to an index, it tends to experience positive flow. We can rationally logically pursue this, because if something is in an index, it's going to naturally have more capital flowing into it. What does that mean? The market at a base effect operates on supply and demand. If there is enough demand, that's going to push price up. So being added to an index typically does that, same to the inverse for deletions. If something is removed from an index, typically goes down. Next, rebalancing flows. We know that periodically indices need to get back to their target balance. That causes artificial price movement. But what's the cool part? The cool part is, is we know when they're rebalancing. Now the market knows this as well. It's not free money that's just sitting there in mass. A lot of times people will try to front run the move. That causes earlier moves that can become dislocated from the rebalancing. But we know the rebalancing effect exists. Next, end of month window dressing. This is something that's really, really common where different kind of",
    "start_timestamp_seconds": 544.4,
    "end_timestamp_seconds": 637.52,
    "start_timestamp": "09:04",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=544",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "there in mass. A lot of times people will try to front run the move. That causes earlier moves that can become dislocated from the rebalancing. But we know the rebalancing effect exists. Next, end of month window dressing. This is something that's really, really common where different kind of funds towards the end of the month, they sell off their risky stuff. And then they buy into more common or more mainstream stuff so that when they send their statements out, they can say, yeah, we're holding the same stuff everybody else is. That causes a really easily tradable phenomenon that typically towards the end of the month, the S&P 500, for example, drifts up. Not every single month. It's not always going to be the case. But again, positive expectancy over the long run, that's another effect that you literally can execute on right now. What's another one, index putt skew. This is the tendency for puts to be priced more expensive than the relative out of the money calls. Let's take a look at an example. I haven't prep this. So we'll see if it's holding true right now. The six, 68 puts, these are a, well, it's use these, the six, 67's because these are actually a 30 delta. The 30 delta puts are trading for, let's call it $7.14 with a volume of 1710. Let's go to a 30 delta call. The 30 delta call is only 13.4% volt and it's literally like $2 cheaper.",
    "start_timestamp_seconds": 622.56,
    "end_timestamp_seconds": 705.84,
    "start_timestamp": "10:22",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=622",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "it's use these, the six, 67's because these are actually a 30 delta. The 30 delta puts are trading for, let's call it $7.14 with a volume of 1710. Let's go to a 30 delta call. The 30 delta call is only 13.4% volt and it's literally like $2 cheaper. That's putt skew. The market prices puts more rich than calls in things like indices specifically, but other names as well, because people are willing to overpay for downside protection. For somebody else to take the downside risk for them. This is an edge. Again, it's not always an edge. If you just blindly sell puts all the time, that's not necessarily going to net out again, depending on how the market's doing. That's one of the most common issues when people are trying to find an edge is they're trying to find something that they could just always do. And there are regimes where certain edges are favorable to others. But understanding where the edges are and what they are is a super important starting point. Next, the fact that typically speaking, we see implied volatility elevated through earnings releases. What does that mean? Well, all of all, typically you're selling more expensive, involved than what's realized. Again, another piece of edge that can be executed right now. Last, information indiscreteness. This means that with different issues, meaning securities, that are less covered, less analyst reporting on it, less focus on the news, it takes longer for information to",
    "start_timestamp_seconds": 688.68,
    "end_timestamp_seconds": 789.68,
    "start_timestamp": "11:28",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=688",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "you're selling more expensive, involved than what's realized. Again, another piece of edge that can be executed right now. Last, information indiscreteness. This means that with different issues, meaning securities, that are less covered, less analyst reporting on it, less focus on the news, it takes longer for information to be integrated into the price that leads to things like price direction opportunities, momentum. We can see this through things like post earnings announcement drift, another actionable source of edge available to you right now. Let's talk about this process on how to actually do this. The first thing. And enough, I would avoid YouTube altogether. The reason why I would avoid YouTube for sources of edge is because everything will sound good, right? So for example, as I talk about that earnings effect, it sounds good. But the reality is, if you execute it, you're going to go through some bad times because it works out in the aggregate. That means you can have some really big losses. But if somebody's just talking about it in a video, you see the aggregate results, it automatically looks good. That will confuse you. That doesn't mean don't use the internet, do. But save searching for edge for later, and I'll give you other ways to find it first, which is go to SSRN. The social, science, research network. I'm not affiliated with them at all. You can create a free account, and you can just search for things. This gives you",
    "start_timestamp_seconds": 767.48,
    "end_timestamp_seconds": 876.4,
    "start_timestamp": "12:47",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=767",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "But save searching for edge for later, and I'll give you other ways to find it first, which is go to SSRN. The social, science, research network. I'm not affiliated with them at all. You can create a free account, and you can just search for things. This gives you access to literally thousands of peer reviewed research. And what do we look for? We just look for stuff. We type in the word stock market. We type in various risk premiums. If you're familiar with my work in the channel, you will come across this term. We look for value stocks, growth stocks, momentum, alpha, edge, stock market effects, et cetera, et cetera. And to give you an example of what this looks like, if I go to stock market edge, I see this thing right here. So, we have a stock market in no dividend stocks. Okay, it has thousand downloads. That's relatively a lot for something like this. Let's see what it says. We develop a model of aggregate stock market featuring both dividend and nonpaying dividend stocks within the familiar, equal of your own base framework. So, familiar buckets. We find that such a simple feature leads to profound implications supporting several stock, and empirical regularities that leading consumption-based asset pricing models have difficulty reconciling. This is all just fancy research-based jargon because a lot of researchers, they're essentially trying to explain relationships against the efficient market hypothesis. That said, it's important to take what you",
    "start_timestamp_seconds": 859.6,
    "end_timestamp_seconds": 949.0,
    "start_timestamp": "14:19",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=859",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "leads to profound implications supporting several stock, and empirical regularities that leading consumption-based asset pricing models have difficulty reconciling. This is all just fancy research-based jargon because a lot of researchers, they're essentially trying to explain relationships against the efficient market hypothesis. That said, it's important to take what you read here in context. So let's see what they find. They find that we show that the presence of no dividend stocks in the market leads to lower correlation between stock market return and aggregate consumption growth. When we quantify these effects, we find them to be economically significant. This means that there's some sort of value there. We find that no dividend stocks command lower mean returns, but have higher return volatility in higher market betas than comparable dividend paying stocks consistent with empirical evidence. This, again, is giving you a direct place that you can start to research. Another example here is one important caveat is you want to focus on US stock market effects. If you don't look at US stock market effects, they'll look at the Chinese stock market, Taiwanese stock market, these different Indian stock market. And those effects won't pull over as nicely to the US stock market. That doesn't mean don't look there. You should look there eventually, but I would start with what's most relevant. And if you do this, you'll come across stuff like this, the Halloween effect. You'll come across very insurice premium. You'll come across different market effects that",
    "start_timestamp_seconds": 926.08,
    "end_timestamp_seconds": 1023.88,
    "start_timestamp": "15:26",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=926",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "the US stock market. That doesn't mean don't look there. You should look there eventually, but I would start with what's most relevant. And if you do this, you'll come across stuff like this, the Halloween effect. You'll come across very insurice premium. You'll come across different market effects that you can literally turn into profit mechanisms. So as you're conducting this research, create a trading plan. In that trading plan, you're going to take notes. You're going to focus on the most recent and most downloaded papers. From there, you want to actually add details for you to follow up on and explore more deeply. So think about creating just a quick description of the profit mechanism, the behavior that it exhibits. What impacts it has. What the frequency is. So again, for example, with the Halloween effect, we can answer all of those questions by reading this paper. And then that leads to your next step, which is open up a Google sheet called a trade log and as you outline this effect, try to track it. Notice none of this has anything to do with options. You don't even have to worry about options yet. If you want to measure the Halloween effect, maybe you look at the index pricing around the bounds that it gives you. And you just measure how does this behave over the defined period? That's a good starting point. Now with this, we want to be able to do things like backtest,",
    "start_timestamp_seconds": 1007.88,
    "end_timestamp_seconds": 1096.88,
    "start_timestamp": "16:47",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=1007",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "want to measure the Halloween effect, maybe you look at the index pricing around the bounds that it gives you. And you just measure how does this behave over the defined period? That's a good starting point. Now with this, we want to be able to do things like backtest, forward test and live test. That all will be covered if you're interested in another video. But the important thing to note here is that if you want to backtest something like that, you could just eyeball it. Take a look at what this thing tells you. And then go find it. Prior Halloween's in the stock market and see what happened. Measure it. Measure the window that it gives you at the beginning of October, what's the S&P 500? At the end of October, what's the S&P 500? Take a look at that across multi-year periods. See what you see. You might come across something interesting. From here, as you're outlining your profit mechanisms avoiding YouTube in all those places, you should be really building out your fundamental understanding of options. Every place do that is through options as a strategic investment by Larry McMillan, any work by Nate and Berg specifically option volatility and pricing. Anything by you and some Claire, all of those will help you build your understanding of options because how do options fit into this? Well, if we understand that there's some sort of price opportunity in the Halloween effect, rather than just buying",
    "start_timestamp_seconds": 1082.52,
    "end_timestamp_seconds": 1173.44,
    "start_timestamp": "18:02",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=1082",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "and Berg specifically option volatility and pricing. Anything by you and some Claire, all of those will help you build your understanding of options because how do options fit into this? Well, if we understand that there's some sort of price opportunity in the Halloween effect, rather than just buying shares, maybe we can use options to gain leverage. Or when we're trading stuff like variance risk premiums, you can't trade that with equities. Options give you access to this edge. So you need to understand options in depth so that you can then use them properly to maximize your potential. Once you have this understanding, then you can go into the deeper layer of research. This is again, back testing, forward testing, live testing, so that you can quantify things. Coming from here is when you actually start building strategies. I have a video called the Outlier Strategy process. It gives you the exact framework to leverage to take the information that you just learned which is baked into this process and then to action on it. This is the exact kind of process that we work on in the Outlier Pro community because this is the fundamentals of trading that for whatever reason nobody talks about. It's because it's the work side of the equation. And this does take some effort, but the cool part is you genuinely can make a lot of money doing this if you do a good job. Be an Outlier. It's Billiter.",
    "start_timestamp_seconds": 1156.64,
    "end_timestamp_seconds": 1246.68,
    "start_timestamp": "19:16",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=1156",
    "chunk_index": 15,
    "word_count": 249,
    "upload_date": null,
    "duration": 1248.0
  },
  {
    "video_id": "cFgz1nHWr3E",
    "title": "Why Options Traders Fail to Build an Edge (How to Fix it) ",
    "text": "trading that for whatever reason nobody talks about. It's because it's the work side of the equation. And this does take some effort, but the cool part is you genuinely can make a lot of money doing this if you do a good job. Be an Outlier. It's Billiter.",
    "start_timestamp_seconds": 1229.2,
    "end_timestamp_seconds": 1246.68,
    "start_timestamp": "20:29",
    "video_url": "https://www.youtube.com/watch?v=cFgz1nHWr3E",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cFgz1nHWr3E&t=1229",
    "chunk_index": 16,
    "word_count": 49,
    "upload_date": null,
    "duration": 1248.0
  }
]