[
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "In trading options, there's a lot of things you got to do. You got to manage risk, you got to research ideas, you got to pay attention to the market to understand where opportunities might be. And unfortunately, in all of these different things that you have to do, there is a bucket of things I refer to as trap tasks. And these are probably some of the absolute most nefarious things that catch a lot of traders. And unfortunately, more often than not, it doesn't lead to some sort of quick blow up of capital. It's something that actually happens typically speaking slower over time. So let's talk about this idea of trap tasks. As we think what we do as traders, there are a lot of fundamental activities that you need to do in order to be successful. Yet, a lot of these fundamental activities, if you do them poorly, it can be more damaging than not doing them at all. Why? Think of it this way. If you spend a lot of time doing something thinking it's helping, but it's actually hurting, but you don't know. That's problematic. A great example of this. I was stretching my hamstrings every single night for like 15 minutes without break for like two years because I thought that I just had systematically tight hamstrings. Little did I know, I actually had a herniated disc at L4L5. What's the problem there? The way that I was stretching my hamstrings was literally",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 97.4,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 1032.0
  },
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "hamstrings every single night for like 15 minutes without break for like two years because I thought that I just had systematically tight hamstrings. Little did I know, I actually had a herniated disc at L4L5. What's the problem there? The way that I was stretching my hamstrings was literally putting more pressure on the disc. It was damaging me, not helping me. So this happens in trading quite literally all the time. So I want to walk through six of these tasks. There's way more than six. But I think by going through these six really common versions, that it will help open your eyes to how this can be the case so that we can then talk about how to turn these trap tasks into value add. And then you can apply the same methodology essentially across the board in most things that you're doing. All right, so we're gonna run through six of them. Risk management already alluded to it, back testing, trading plans, analysis. So this is like your technical analysis, fundamental analysis, tool kits. The fundamental operations of options. So what I mean by this is literally just understanding like what options are, how they behave, volatility, different structures, that kind of stuff. And then strategy optimization. So let's talk about each of these quickly. I wanna talk first for each. What it looks like when it's done wrong and then I'm gonna show you what it looks like when it's done right. So let's",
    "start_timestamp_seconds": 77.72,
    "end_timestamp_seconds": 176.4,
    "start_timestamp": "01:17",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=77",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 1032.0
  },
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "behave, volatility, different structures, that kind of stuff. And then strategy optimization. So let's talk about each of these quickly. I wanna talk first for each. What it looks like when it's done wrong and then I'm gonna show you what it looks like when it's done right. So let's start with risk management. The very first trait that's super common is some sort of static approach. What that means is a lot of times traders will say, I always manage risk at x points or if the stock does this, I get out. And it's completely wrong. 100% wrong. And I'll explain why in a few moments. Overheading. This often is due to the risk ofverse nature of traders. And it spits in the face of what we're really trying to do, which is speculate. The reason why there is a return that can exceed the market return beta is because there's risk. So if we want to outperform the market but we wanna do it with lower risk and part of that lower risk approach isn't smart things like managing correlation, sizing, stuff like that, it's just through peer hedging, buying options to cap your downside and stuff like that. The ability for you to outperform and also manage your risk in that way is completely ridiculous. If it was doable in that way, everyone would do it. So these are literally just two elements of risk management. There's way more, but two big ones. Let's talk about",
    "start_timestamp_seconds": 156.08,
    "end_timestamp_seconds": 258.72,
    "start_timestamp": "02:36",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=156",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 1032.0
  },
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "like that. The ability for you to outperform and also manage your risk in that way is completely ridiculous. If it was doable in that way, everyone would do it. So these are literally just two elements of risk management. There's way more, but two big ones. Let's talk about what this looks like when it's done right. The first thing I have a video that goes through risk management in an office trading portfolio end to end. So you can look for that on my channel, it's easy to find. But let's talk about these two elements of what it looks like when it's done right, the first one is portfolio in strategy specific plans. What does that mean? I will show you. Let's say that I'm trading long calls in Tesla. Just don't worry about the rest of the details of the strategy, let's just say it's long calls. What I likely manage those long calls in Tesla, which has a current implied volatility, 65.5% implied volatility, percent, 1043%, would I manage those calls the same as something like GE, same idea, long calls, but this has 34% vol, 64% implied volatility, percentile. The reality is no, probably quite different. So the point that I'm making here, even in the instance of using just long calls across the board, is that you have to build things that are specific to what it is that you're trading and what you're trying to capture. If you apply broad platitudes, it's",
    "start_timestamp_seconds": 236.84,
    "end_timestamp_seconds": 330.2,
    "start_timestamp": "03:56",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=236",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 1032.0
  },
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "quite different. So the point that I'm making here, even in the instance of using just long calls across the board, is that you have to build things that are specific to what it is that you're trading and what you're trying to capture. If you apply broad platitudes, it's essentially taking a hammer to every single thing that you need to do around your house. It just doesn't work like that. And then the last thing that's just honorable mentioned is you do have to execute. And a lot of people will abandon what they're doing and I'll explain a little bit more about that in a little while, but worth mentioning, back testing. So the first thing is, if you do this task of back testing, you probably feel like you're doing the work that needs to be done. It probably would feel like you're doing well, you're doing the hard stuff that helps build your approach. The problem is, back testing is literally riddled with pitfalls. It is funny enough, one of the things that you really do need to do in order to succeed in trading long term. So this is a perfect example of a trap task. Because if you do this poorly, you're going to build some sort of grossly overfit strategy that has you entering your option strategy at 1152 and 30 seconds, because that performs better than 952, and it's only going to be on Thursdays, but we don't know why. Right?",
    "start_timestamp_seconds": 315.96,
    "end_timestamp_seconds": 406.64,
    "start_timestamp": "05:15",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=315",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 1032.0
  },
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "trap task. Because if you do this poorly, you're going to build some sort of grossly overfit strategy that has you entering your option strategy at 1152 and 30 seconds, because that performs better than 952, and it's only going to be on Thursdays, but we don't know why. Right? Like in the process of back testing, most of the time, people really do not understand how to apply a basic statistical approach. There's also different kinds of biases that people don't recognize. A big one is availability. If the information is easy to get, it means it's widely gotten. So is there some sort of big edge baked into that easy to access information, maybe maybe not, but it's probably going to be less of an edge than you might want in terms of severity. Then there's also the desired outcome bias, which is when we go into something programmed with what we want to see, which then poisons all of our decision making all the way down that path. So the first thing to do in order to do this right is you got to build a framework, and just like any other scientific experiment or approach, it's got to be structured, so that you can control for these different kinds of things, specifically a lot of these biases, which will catch you. The cool thing is when it comes to building an actual approach, there's tons of great resources out there. AI can help you build a",
    "start_timestamp_seconds": 381.96,
    "end_timestamp_seconds": 477.64,
    "start_timestamp": "06:21",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=381",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 1032.0
  },
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "got to be structured, so that you can control for these different kinds of things, specifically a lot of these biases, which will catch you. The cool thing is when it comes to building an actual approach, there's tons of great resources out there. AI can help you build a good approach. That's all good, but the trick here really is making sure that you are addressing you as a variable because a lot of people don't. And then there's something really simple again. This isn't an exhaust of list by any means, but talking about stuff like robustness checks. So one of the things I see a lot, especially in coaching calls, where somebody will share a back test with me that looks really, really good. And then I'll say, oh, what if we tweak this one variable? And we tweak that one variable. And then all of a sudden, the performance of the strategy just completely collapses. That's a problem. That's not robust, literally at all. Same thing when people try to use really favorable assumptions in terms of stuff like liquidity and ability to execute. That also is a massive problem. If you don't know, there's a lot of theoretical elements in the stock market that you could arbitrage. And you can see them. The problem is, once you include friction, execution, costs, latency, you kind of can't in a practical sense. So checking robustness is not negotiable. And these are just a couple of ways to",
    "start_timestamp_seconds": 461.48,
    "end_timestamp_seconds": 547.16,
    "start_timestamp": "07:41",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=461",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 1032.0
  },
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "lot of theoretical elements in the stock market that you could arbitrage. And you can see them. The problem is, once you include friction, execution, costs, latency, you kind of can't in a practical sense. So checking robustness is not negotiable. And these are just a couple of ways to think about it. Next, trading plan. This one is super nefarious. People will say things like, trade your plan, plan your trade. And it sounds intellectual. It sounds smart. But unfortunately, in most instances, this is just so superficial. It's not funny. And it's because for a lot of people, their plan is not, it's not based on anything real. So an example I like to use for this is, if you play basketball and let's say that you are going to the free throw line. And you have to shoot two free throws. Let's say that there's two scenarios. The outcome of shooting the free throw is you have to get your arm cut off if you miss one of the time, two of the times, whatever. But there's two scenarios leading into that. One, where the trader has shot the free throw, thousands and thousands of times. And then the second where the shooter has never touched a basketball in their life. Which one of them is probably going to be at least more confident in their ability to adhere to whatever they think the game plan is in order to shoot the basketball. Probably the person that's",
    "start_timestamp_seconds": 529.68,
    "end_timestamp_seconds": 621.76,
    "start_timestamp": "08:49",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=529",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 1032.0
  },
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "then the second where the shooter has never touched a basketball in their life. Which one of them is probably going to be at least more confident in their ability to adhere to whatever they think the game plan is in order to shoot the basketball. Probably the person that's done it thousands of times. It's the same thing in trading. If your confidence is based on you simply saying, I'm going to exit at 50% max profit. Meanwhile, you don't know why. You haven't really researched it. You haven't done the analysis to realize that actually in a lot of instances itself optimal. But that is what leads to just abandoning your plan right away, which leads to execution shortfalls. If you build something that's made out of paper, the shade don't be surprised if it crumbles under the slightest pressure. So when we think about building a robust trading plan, this is when we take the time to build an end to end analysis in outline of our trading approach. I have a video that talks about this stuff in depth. But remember, one of the primary purposes of a trading plan is not the actual plan itself. It's the planning exercise that's super valuable. All right, let's talk about analysis. A lot of people will say stuff like, oh, I use bow and Japan's, or I use moving averages, whatever. And very much like what we saw up in risk management, the reality is your profit mechanisms",
    "start_timestamp_seconds": 604.88,
    "end_timestamp_seconds": 692.6,
    "start_timestamp": "10:04",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=604",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 1032.0
  },
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "It's the planning exercise that's super valuable. All right, let's talk about analysis. A lot of people will say stuff like, oh, I use bow and Japan's, or I use moving averages, whatever. And very much like what we saw up in risk management, the reality is your profit mechanisms come first every single time. So what that means is when we're looking at technical analysis, fundamental analysis, those are tools designed to help you identify opportunities. They are not any sort of edge in and of themselves. So for example, a great example of this, a really, really commonly researched well-understood profit mechanism, which I have a video that goes into detail on profit mechanisms, is momentum. It's really well researched. We know it's there. It's robust. So if I want to start with the profit mechanism of momentum, then I start thinking, what kind of analysis tools might help me identify good candidates to trade momentum? Maybe that's stuff like moving averages, which measure momentum. My point here is that the signals used should directly allow us to identify and trade the profit mechanisms, not signals for the sake of signals. And one other quick note here is I cannot tell you how frequently that I come across people that will say, like, oh, normally when I use bow and Japan's, I see the stock do this when it touches the upper bow and Japan. This is the pure definition of confirmation bias. It's somebody seeing and remembering",
    "start_timestamp_seconds": 675.64,
    "end_timestamp_seconds": 772.04,
    "start_timestamp": "11:15",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=675",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 1032.0
  },
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "I cannot tell you how frequently that I come across people that will say, like, oh, normally when I use bow and Japan's, I see the stock do this when it touches the upper bow and Japan. This is the pure definition of confirmation bias. It's somebody seeing and remembering what they want to see. The problem is in those instances, they don't remember literally the thousands of instances where the price touched the upper bow and Japan and did not do that thing that they're used to it doing. So when we're analyzing anything, especially technical analysis, fundamental analysis, tools you got to remain objective, what's the easy way to do that, run a study? Literally, back test it, forward test it, see how efficacious it is. But if your basis for using something is ever something that's not quantitative and it's you saying, I used to, I'm used to seeing it do this or it typically does this as complete bullshit. Doesn't mean anything. Options fundamentals. There's this really common misunderstanding that options provide edge in some sort of structural way. And they don't. So what this means is sometimes people say, like, oh, I buy options. And they think that's their edge or oh, I'm in theory gang. I sell options. That's my edge. And it's not. Same thing when it comes to different kinds of structures. I literally just responded to a post today on Reddit of somebody saying, oh, I switched from iron condor to",
    "start_timestamp_seconds": 754.76,
    "end_timestamp_seconds": 840.24,
    "start_timestamp": "12:34",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=754",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 1032.0
  },
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "they think that's their edge or oh, I'm in theory gang. I sell options. That's my edge. And it's not. Same thing when it comes to different kinds of structures. I literally just responded to a post today on Reddit of somebody saying, oh, I switched from iron condor to verticals, what a game changer. And it's like, no dog, that's not a game changer. That's literally a just different option structure. It's like saying, oh, hey, I switched from a screwdriver to a hammer, what a game changer. It's ridiculous. The only thing is doing your best to fit the tool to the job. But a lot of people think as you're going through the effort of learning options that there should be a payoff be a some sort of baked-in edge. And it's not the case. This is literally just the cost to play the game. And the last thing is people bounce between structures, like that example that I just gave you, instead of starting with a profit mechanism. So going back to this momentum example, if I'm trading momentum in my expectation is something is going to go up, do I want to trade a short iron condor because I know what a short iron condor is? And I think that that strategy or that structure is good. No, the short iron condor makes no freaking sense in the concept of a momentum play. So the game here is you notice on multiple of these points",
    "start_timestamp_seconds": 825.92,
    "end_timestamp_seconds": 913.2,
    "start_timestamp": "13:45",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=825",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 1032.0
  },
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "iron condor because I know what a short iron condor is? And I think that that strategy or that structure is good. No, the short iron condor makes no freaking sense in the concept of a momentum play. So the game here is you notice on multiple of these points is starting with the profit mechanism. What is the thing that you're trying to monetize? And then fitting the rest of what you're doing around that. OK, last one, strategy optimization. This kind of a dovetail off a backtesting. But one of the issues that you find frequently is as people are attempting to optimize a strategy, they're trying to tweak what different inputs is that lack of robustness that I shared before. But also if you're trying a strategy that's not well researched at all, most people will abandon it as soon as there's a site of difficulty. Meaning we have a couple losing trades, maybe in a row. We abandon and we go to another strategy, massive massive mistake. So when we're thinking about optimizing a strategy, that's fine. It should be iterative. But before you start messing with things, you should start with something that's well researched. If you're noticing something that you think can be improved, you need to start with a hypothesis. You need to test that idea and then validate or invalidate that idea in a much larger sample than the handful of trades that you recently had. Last thing, robustness and process-based focused",
    "start_timestamp_seconds": 896.36,
    "end_timestamp_seconds": 986.52,
    "start_timestamp": "14:56",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=896",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 1032.0
  },
  {
    "video_id": "cnLc2wn6GMY",
    "title": "Trap Tasks: STOP Making These Options Trading Mistakes That Destroy Your Results",
    "text": "If you're noticing something that you think can be improved, you need to start with a hypothesis. You need to test that idea and then validate or invalidate that idea in a much larger sample than the handful of trades that you recently had. Last thing, robustness and process-based focused versus the outcome of individual trades, that is what a strategy is predicated on. But most people are too wrapped up in the outcome of individual trades. This is literally a, just my new shot of what trap tasks can look like. All of these things are things that you need to do. But if they're done poorly, can make you think that you're doing the right thing, that you're doing well. But really what you're doing is shoving a stick into your own spokes on your bike and causing yourself to fall. God, I pay attention to what you're doing being outlier. See you later.",
    "start_timestamp_seconds": 972.28,
    "end_timestamp_seconds": 1030.0,
    "start_timestamp": "16:12",
    "video_url": "https://www.youtube.com/watch?v=cnLc2wn6GMY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cnLc2wn6GMY&t=972",
    "chunk_index": 13,
    "word_count": 156,
    "upload_date": null,
    "duration": 1032.0
  }
]