[
  {
    "video_id": "CO9TLXsZVLM",
    "title": "How to Trade Options When Implied Volatility is Low",
    "text": "What's up, Alias? Let's talk about four ways to trade options when IV is low. I want to start first with a couple of facts to keep in mind, then we'll talk about how we can trade during low IV. Okay, first thing. A lot of people will cite VIX and say VIX is low, and follows low. VIX does not equal all volatility. VIX is the S&P 500 volatility. So what that means is, if we look across the market, even if VIX is low, which right now is super low down at 14, this is mean everything is low. If I look at gold, gold is up at 56% implied volatility percentile. S-O-V is at 98% implied volatility percentile. Even if I look across the individual component sectors, I can find 33% implied volatility percentile in materials. I can find 17% in health care. I can see 23% in staples. The point that I'm making is even though implied volatility percentile in S&P is literally zero. That does not mean everything is low-vol. Even the sectors can have elevated vol. And then as you go one step further into the individual constituents, individual stock names, you can still find vol. So the most important thing to pay attention to in the sector is that VIX does not represent the entire market. And if vol is low, there's always vol that's high somewhere, which we'll talk about. The last thing that I want to talk about briefly is what",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 96.8,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=CO9TLXsZVLM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=CO9TLXsZVLM&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "CO9TLXsZVLM",
    "title": "How to Trade Options When Implied Volatility is Low",
    "text": "find vol. So the most important thing to pay attention to in the sector is that VIX does not represent the entire market. And if vol is low, there's always vol that's high somewhere, which we'll talk about. The last thing that I want to talk about briefly is what you're actually trading. Number three, most people think that when you're selling options that you're inherently selling implied volatility going down, which is really not what you're trading. What's thing of a scenario? If I sell to open a straddle. And what ends up happening is, let's say I got in when vol was 30%. Let's say IV goes up to 35%. What happens to my unrealized P&L? It hurts, right? It would go down because vol got more expensive than what I sold. But what happens over time? If vol goes up in realized vol does also not go up, meaning it doesn't breach my short strikes. And it stays relatively range bound, even though implied vol has gone up, that means that implied volatility going up temporarily hurts me. But it's not going to kill me. The thing that kills you, pervably, is when realized vol exceeds whatever the implied vol was that you sold. So this thing works both ways. Let's say that you sold vol when it was actually high. Let's say it was 35%. And let's say vol goes down to 30%. Vol goes down. But let's say that realized vol trended in one direction",
    "start_timestamp_seconds": 77.2,
    "end_timestamp_seconds": 178.6,
    "start_timestamp": "01:17",
    "video_url": "https://www.youtube.com/watch?v=CO9TLXsZVLM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=CO9TLXsZVLM&t=77",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "CO9TLXsZVLM",
    "title": "How to Trade Options When Implied Volatility is Low",
    "text": "the implied vol was that you sold. So this thing works both ways. Let's say that you sold vol when it was actually high. Let's say it was 35%. And let's say vol goes down to 30%. Vol goes down. But let's say that realized vol trended in one direction albeit slowly, and it violates your short strike. Even though you got in accommodating move and vol, you're still going to lose money, because realized vol was too high. So remember, even though you're commonly told implied volatility is mean reverting and all this other stuff, remember what you're actually trading, which more often than not is not actually the mean reverting component of implied vol utility, but you're typically trading the relative relationship between implied vol and realizable. Now one quick admin note is you could tell this is primarily built around short options this video, but it's not relegated to short options. Because when you're trading long options in low vol, you can get torn up because you need enough movement. So some of these things will still apply to you. All right, let's talk about now how to trade them. I got four things we're going to review. We're going to talk about trading implied vol utility relative to realize, which we just covered at a high level. Then we'll talk about finding catalysts. We'll look for earnings plays and then trading relative vol. Let's start with trading implied vol relative to realize vol. As I literally",
    "start_timestamp_seconds": 160.08,
    "end_timestamp_seconds": 252.24,
    "start_timestamp": "02:40",
    "video_url": "https://www.youtube.com/watch?v=CO9TLXsZVLM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=CO9TLXsZVLM&t=160",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "CO9TLXsZVLM",
    "title": "How to Trade Options When Implied Volatility is Low",
    "text": "review. We're going to talk about trading implied vol utility relative to realize, which we just covered at a high level. Then we'll talk about finding catalysts. We'll look for earnings plays and then trading relative vol. Let's start with trading implied vol relative to realize vol. As I literally just told you, implied vol utility right now in S&P 500, as you can tell, you might have to zoom in, but I'll read it to you. implied vol utility percentile is literally 0%. That means implied vol utility has not been lower than what it currently is in the S&P 500 over the last year. It's as low as it gets. But notice what's going on in this other graph down here. Notice how the yellow line, which is implied vol, is remaining elevated relative to realized vol. That means if you sell vol, you're still making money right now. Moreover, the net, if we look at a scale of implied volatility percentile, 100% here, 0% here, you're typically not well off trading the extremes. Let's say the top 20% or the bottom 20%. You want to try to avoid those. But if that's all you got, it's not the worst to be down here preferable to up here. If you're trading when it's up here, it's probably closer to fair value. Down here, more often than not, is where you will at least find some relative risk premium. So again, remember, when you're trading implied volatility relative to",
    "start_timestamp_seconds": 235.96,
    "end_timestamp_seconds": 324.96,
    "start_timestamp": "03:55",
    "video_url": "https://www.youtube.com/watch?v=CO9TLXsZVLM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=CO9TLXsZVLM&t=235",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "CO9TLXsZVLM",
    "title": "How to Trade Options When Implied Volatility is Low",
    "text": "the worst to be down here preferable to up here. If you're trading when it's up here, it's probably closer to fair value. Down here, more often than not, is where you will at least find some relative risk premium. So again, remember, when you're trading implied volatility relative to realized volatility, you're trading risk premium, which typically exists, you can find it in the indices, but you can find it in individual constituents and so on. So this is the first place you can look even if vol is low. Next, find catalysts. I looked for stocks that had weird moves in one of them that popped across the old desk was SOC. What happened here in SOC? Let's take a quick look. You can see that it literally had a gap up a few days ago and it had another gap up today. The SMP's been moving relatively sideways, but if we measure what's going on in SOC, what's happened over the last few days, if this is not tied to earnings, it ran up 44% effectively in a day and then from here to here, it's up another 10%. So there's absolutely volatility to be found here, and you can see it confirmed with implied volatility percentile at 98%. It tells you something's going on here. What is it? Well, they just had some news come out on two different pieces of their business. There's one catalyst that's driving the classification of their pipeline, and then there's",
    "start_timestamp_seconds": 305.4,
    "end_timestamp_seconds": 397.2,
    "start_timestamp": "05:05",
    "video_url": "https://www.youtube.com/watch?v=CO9TLXsZVLM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=CO9TLXsZVLM&t=305",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "CO9TLXsZVLM",
    "title": "How to Trade Options When Implied Volatility is Low",
    "text": "and you can see it confirmed with implied volatility percentile at 98%. It tells you something's going on here. What is it? Well, they just had some news come out on two different pieces of their business. There's one catalyst that's driving the classification of their pipeline, and then there's another broader economic breadth impact for more energy is specific to this sector. So this is having a few things moving in its direction and then it also had a loss-fluorous pipeline approval to restart. So the point that I'm making is you can find things with high-vol, even when vol is low. The thing you have to not do is just bitch that vol is low. There's opportunities you're just being lazy in you're not looking. Next, earnings plays easy place to find vol. Now you'll see right now we're kind of outside of an earnings cycle. That just happens to line up sometimes, but others times it doesn't. So it's always a place that's worthwhile to take look right now. You wouldn't get much there, but earnings season's going to start again soon. So it all remains suppressed to a great place to look. The last thing, relative volatility. This is when we look at volatility across the volatility surface. We can look within the smile, which is within an individual expiration, where you can look at term structure across expiration. So in this example in SLV, we can find some really interesting relationships. So for example, here,",
    "start_timestamp_seconds": 380.52,
    "end_timestamp_seconds": 470.68,
    "start_timestamp": "06:20",
    "video_url": "https://www.youtube.com/watch?v=CO9TLXsZVLM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=CO9TLXsZVLM&t=380",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "CO9TLXsZVLM",
    "title": "How to Trade Options When Implied Volatility is Low",
    "text": "volatility. This is when we look at volatility across the volatility surface. We can look within the smile, which is within an individual expiration, where you can look at term structure across expiration. So in this example in SLV, we can find some really interesting relationships. So for example, here, I can see that the 16-jane vol in this level between like the 60 and 70 is actually higher than the 31-deese vol. But I can see that it flips back and forth. Maybe I think there's a trade idea there. Maybe I can find these deep trials in the volatility surface a lot of times this won't be anything. But other times you'll find areas that are very picky compared to others. So then you can start running things like diagonals and calendars. You can trade term vol relative to other terms. And you might see that right now, the five-day or seven-day vol is actually waning as 60-day vols expanding. Maybe we think that relationship might normalize. The takeaway is that there are always a bunch of things that you can do. This is literally only four. There are x number of ways that you can actually trade vol during low volatility environments. It's always there. You just have to look. Don't be lazy. Be an outlier. See you later.",
    "start_timestamp_seconds": 449.12,
    "end_timestamp_seconds": 534.92,
    "start_timestamp": "07:29",
    "video_url": "https://www.youtube.com/watch?v=CO9TLXsZVLM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=CO9TLXsZVLM&t=449",
    "chunk_index": 6,
    "word_count": 222,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "CO9TLXsZVLM",
    "title": "How to Trade Options When Implied Volatility is Low",
    "text": "vol during low volatility environments. It's always there. You just have to look. Don't be lazy. Be an outlier. See you later.",
    "start_timestamp_seconds": 528.24,
    "end_timestamp_seconds": 534.92,
    "start_timestamp": "08:48",
    "video_url": "https://www.youtube.com/watch?v=CO9TLXsZVLM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=CO9TLXsZVLM&t=528",
    "chunk_index": 7,
    "word_count": 22,
    "upload_date": null,
    "duration": 536.0
  }
]