[
  {
    "text": "What is up to the ape outliers for today? We have kind of a mixed docket. I want to spend a little time going through the bed bath and beyond case because I think that that's generally interesting. And then there was a couple other questions that we got in the discord that I want to hit. And as always, whatever you all decide that we should talk about, we should take a look. So anything that you want to hit throat in the chat, we can dip dive, duck, dodge and dodge any direction that we want, dive into whatever. Unfortunately, our boy Newton is still slightly under the weather. So he and I were texting to figure out when we want to do our next session, but he's just looking to kind of, you know, take it easy this weekend. Rightfully so he's been working a lot now and live streams, I love him, but they do kind of require a lot of focus in order for it to be kind of a good conversation, right? So he's keeping it chill for himself. So make sure you all send your best wishes to our boy Newton. And I were talking a little bit, he actually had a couple recommendations. I always like to talk to him about what he thinks we should take a look at. And he had two things that he brought up. He thinks we should take a look at Causing Chewie. And then he",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 107,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=0"
    }
  },
  {
    "text": "were talking a little bit, he actually had a couple recommendations. I always like to talk to him about what he thinks we should take a look at. And he had two things that he brought up. He thinks we should take a look at Causing Chewie. And then he also wants to take a look at some, he suggested that we take a look at some of Roaring Kitty's charts is the last that I got. So I think we will dive through those. Also, we have somebody in the chat name, California pizza is best, who you, you just know that probably a great person, but they are just trying to start some shit is what I think because it is objectively probably some of the worst pizza I've ever had. I've had better pizza in Las Vegas than I've had in California. And I'm from New York. So I do have a lot of respect. And that's where I think the best pizza is I would not call it California by any stretch of the imagination, but I have to imagine our friend California pizza is best knows exactly what they're doing. So shout out to them for ruffling people's feathers because that can always be kind of fun. All right, let's see who we got in the chat. I see PFA, Nola, Ron, ape of spades. That's a great name. ape of spades. Eating crayons. I second that with you. Shrey J is here. We got",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 107,
      "start_timestamp": "00:01:05",
      "start_timestamp_seconds": 65.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=65"
    }
  },
  {
    "text": "for ruffling people's feathers because that can always be kind of fun. All right, let's see who we got in the chat. I see PFA, Nola, Ron, ape of spades. That's a great name. ape of spades. Eating crayons. I second that with you. Shrey J is here. We got California pizza is best, which again, I probably have to argue against. Sadrick is here. Chris is here. Somewhere nowhere. That's kind of tricky. I guess it's nowhere as in they know where. That's pretty good. Let me grab this chat. Move it over here. So it's a little easier for me to keep up with you guys. Mark says, Johns of bleaker best pizza in New York City. I don't I'm not sure if I've had theirs before, but I think really when it comes down to where the best pizza actually is a lot of it comes down to like what hits up like nostalgia metrics because I remember as a kid, my favorite place was Tommy's in in the Bronx. Love that place. But yeah, I think a lot of it also comes down to like just what yeah, like what nostalgia buttons get hit. Snehill, Veyha says, sir, no, Richard Newton. No, so Newton is not available to join us today. Like I said, I still think that he's trying to like completely recover because he also started like his standard work. And it's a lot of work. One, doing all the game stop stuff. And",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 107,
      "start_timestamp": "00:02:09",
      "start_timestamp_seconds": 129.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=129"
    }
  },
  {
    "text": "says, sir, no, Richard Newton. No, so Newton is not available to join us today. Like I said, I still think that he's trying to like completely recover because he also started like his standard work. And it's a lot of work. One, doing all the game stop stuff. And then also doing like his standard job picking up. And he was sick most of last week. So day swag says, also, I like that you know, Newberg. I literally grew up there. So I went to NFA and went to South. I know Newberg super well. It's where I got stabbed in my hand. So super, super familiar with, yeah, super familiar with Newberg. California pizza's best says I got booted from Jackie stream after he talked about turning 1000 to a million. I don't know anything about any of that. And so I am not going to weigh in. I got to be honest, like I've heard people mention him before. I'm just not familiar with his work. So I have really no opinion one way or the other on, that side of things at least. I am, I kind of stick to the stuff that I spend time experiencing. Like with Newton, the main reason why I started working with him on this stuff is that like I could just tell he's a genuine human being, which is kind of rare to find in finance media, finance YouTube and stuff like that. So I naturally gravitate to",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 107,
      "start_timestamp": "00:03:19",
      "start_timestamp_seconds": 199.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=199"
    }
  },
  {
    "text": "time experiencing. Like with Newton, the main reason why I started working with him on this stuff is that like I could just tell he's a genuine human being, which is kind of rare to find in finance media, finance YouTube and stuff like that. So I naturally gravitate to those, those kinds of people just because I identify with them a lot more. I'm not saying that Jackie is not that again, I don't know him. I literally don't know him from a hole in the wall. But that's how I started working with Newton, especially unlike the broader GameStop stuff. So all right. Let's start here. So I started reading through this. A lot of it is mostly because, damn it, I keep forgetting to not put it behind my head. I changed sides. So it completely screws me up. Now that I'm on this side as compared to that side. And as you can tell, I forget all the freaking time. So when I look at, when I look at this, there's a couple of things I'm looking for. And again, just as I'm trying to develop a fingerprint for roaring kitty, the way that he does things more just because I think as an actor, he's interesting, not like an actor putting on a show, but like as a participant in this market, I think really, really interesting. So I enjoy learning about him the way he thinks about things, the way he does things. Cohen",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 107,
      "start_timestamp": "00:04:23",
      "start_timestamp_seconds": 263.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=263"
    }
  },
  {
    "text": "things more just because I think as an actor, he's interesting, not like an actor putting on a show, but like as a participant in this market, I think really, really interesting. So I enjoy learning about him the way he thinks about things, the way he does things. Cohen is obviously another one of those people. I spent some time watching a live stream. He did a while ago. No, that's a lie. Sorry, it wasn't a live stream. It was a like a podcast, I think. And it's like one of the only podcasts I've seen him do. And I learned a lot about Cohen, honestly, during that podcast. Let me see if I can find it really quick for you. I'm sure you all have seen it, but just in case somehow somebody hasn't, I think it's good context. Ryan Cohen podcast. Yeah, this one right here. So I think this podcast here. This was really fun to watch. If you guys haven't had a chance to watch this, I cannot emphasize it, or I cannot like recommend it enough. It was so good because it was such a cool opportunity to get a chance to like learn about like Cohen, the way that he views things the way that he interacts in a much more kind of relaxed setting, right? So he's not being deposed. He's not on some sort of like large media interview. He's just kind of having a conversation with this dude. And",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 107,
      "start_timestamp": "00:05:40",
      "start_timestamp_seconds": 340.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=340"
    }
  },
  {
    "text": "learn about like Cohen, the way that he views things the way that he interacts in a much more kind of relaxed setting, right? So he's not being deposed. He's not on some sort of like large media interview. He's just kind of having a conversation with this dude. And I think the conversation that they had was fascinating because it was a really good mix of shit that was about Cohen specifically. His background, him as a person. But then there was a lot of stuff that we got to talk about the way that he thinks about business and the way that he does things, which is really cool. This is actually where I learned a lot about his tweeting and his tweets now to me, they make so much more sense. So if I grab Cohen's Twitter, if you go through that podcast and then you look at his Twitter, I mean, it literally lines up perfectly. The fact that he did this, the fact that I think he changed this a few times, it used to be I forgot. He had like two different versions in his bio. One of them was like, she heard something and then the other one I think he had was like, unemployable or something. I forgot exactly what it was. Again, you guys probably would know better than me. But the point being is it's just very clear that the dude, he just like fucking around like he's just he's",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 107,
      "start_timestamp": "00:07:05",
      "start_timestamp_seconds": 425.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=425"
    }
  },
  {
    "text": "and then the other one I think he had was like, unemployable or something. I forgot exactly what it was. Again, you guys probably would know better than me. But the point being is it's just very clear that the dude, he just like fucking around like he's just he's just playing games and it's hilarious. So like this, the Kamala coffee and the Trump coffee and what they are absolute joke Kamala 2069 absolute joke. This absolute like he's just he's literally just playing games and it's hilarious because when I listen to this interview, it made way more sense. Like the dude just doesn't take the stuff that's seriously. He actually reminds me a lot of musk in the sense that like they're obviously very successful people that actually think that like the system and the game is kind of bullshit and they don't want to play like the corporate game by standard corporate game rules. And they like moving around a little bit more freely and just calling the nonsense as it is. Like that's some of what I see. And it's it's just so refreshing. So I bring all of this to context because when I'm looking through like this stuff and then I start reading through the the deposition a little bit again, I'm like I'm developing a deeper and deeper understanding of how this thing all works for him and the way that he thinks about things because I think it's important for us,",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 107,
      "start_timestamp": "00:08:25",
      "start_timestamp_seconds": 505.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=505"
    }
  },
  {
    "text": "looking through like this stuff and then I start reading through the the deposition a little bit again, I'm like I'm developing a deeper and deeper understanding of how this thing all works for him and the way that he thinks about things because I think it's important for us, especially because like I own shares of GameStop. So it's admittedly a small part of my portfolio, but nonetheless, I still care about the performance. I don't hold stock in pretty much anything. I trade options. So there's a few things I hold stock in and it's again, I remind you a lot of it is to support the movement and it's to participate, right? Because when there's something cool that's happening, I like to try to contribute to it the way that I can. But in my DNA, I'm a trader man. Like I'm always going to be a trader. It's how I do what I do. I started in 2007. And it's not going to change for me. It's how I make a living. So there's like the trading part of me that does stuff. But then there's in this case, part of me that's an investor in a company. And I'm holding shares for it, which I don't do much. So when I am in that position, I want to know about the company. And I started kind of getting caught up on this whole case. So I want to preface kind of poking through this with",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 107,
      "start_timestamp": "00:09:35",
      "start_timestamp_seconds": 575.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=575"
    }
  },
  {
    "text": "a company. And I'm holding shares for it, which I don't do much. So when I am in that position, I want to know about the company. And I started kind of getting caught up on this whole case. So I want to preface kind of poking through this with you guys that I'm not an expert at any of this stuff. I'm not an attorney. I'm literally just a dude that's online. I'm intrigued by these things. So there will be parts that I have some background information on, but I would wager hands down. You all know collectively, definitely far more than I know about this whole thing. So because of that, I want to poke through some things that I did see that were pretty interesting though. So as you can see that this case started in 23, log of 22. And from my understanding, and again, please help me understand if I'm wrong. That's really the whole point of doing these in a live session specifically in these instances is because it helps me learn as well. And not here just to teach the elements that I know again, like if it's something about options, I probably can teach you about it. That I know inside and out in sideways managing a portfolio analysis. That's my bag. But getting more and more the context of this broader story, that's where I'm learning. And I traded the squeeze twice, the one that we had recently and then",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 107,
      "start_timestamp": "00:10:35",
      "start_timestamp_seconds": 635.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=635"
    }
  },
  {
    "text": "probably can teach you about it. That I know inside and out in sideways managing a portfolio analysis. That's my bag. But getting more and more the context of this broader story, that's where I'm learning. And I traded the squeeze twice, the one that we had recently and then the one before that. But I traded the movement of the price. That's what drew me to it as a trader. But after this most recent one, I started paying more attention to the broader story because at this point, I had been on YouTube. And I started just getting infatuated with the background of this whole thing. Because it is such a fascinating place to be. The way that I approach markets is so different than this. So all of that context is to say most of this is not my strength. There's pieces of this that I can definitely talk about very strong. Well, but there's a lot of it that I don't know. So anyways, going back to this, I was trying to understand even the origin of this, which it really seemed to amounts to some sort of stock market manipulation pump and dump. So when I was reading this initial complaint to again, get that general context, you can see that a few things came up. And the way that this thing is moved is actually been also pretty interesting because if I'm not mistaken, do you guys remember when the first bedbath and beyond",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 107,
      "start_timestamp": "00:11:42",
      "start_timestamp_seconds": 702.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=702"
    }
  },
  {
    "text": "I was reading this initial complaint to again, get that general context, you can see that a few things came up. And the way that this thing is moved is actually been also pretty interesting because if I'm not mistaken, do you guys remember when the first bedbath and beyond when this happened? Because if I'm not, what was it like 2020 that it went down or something like that? Or was it 2022 specifically? Let me see. So the reason I'm thinking about the timelines is just the timelines that this unfolded from like when the initial event happened versus when they actually filed. Twit2b says, make your position larger. I'm near 45 of my portfolio. Yeah, it's not going to be me. Again, I just got to keep it a buck. There's I like the stock for sure. Like I think it's interesting and I think it's at a really, really cool spot here. But the nature of being a trader, it's completely different, man. Like the way I look at markets is I'm looking to find opportunities that I can trade up, down, sideways. I don't care. But it needs to be something that I can trade and consistently make money off of. The way that I trade is completely different. I don't want to make this about that. Just because nobody cares. But yeah, the the cliff notes version of it, those that what I do as a trader is is completely different. It's literally completely",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 107,
      "start_timestamp": "00:12:49",
      "start_timestamp_seconds": 769.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=769"
    }
  },
  {
    "text": "and consistently make money off of. The way that I trade is completely different. I don't want to make this about that. Just because nobody cares. But yeah, the the cliff notes version of it, those that what I do as a trader is is completely different. It's literally completely different. So yeah, the two parts of my brain are engaged in this kind of story. There's the stuff that's just fascinated by GameStop, Ryan Cohen, Roryn Kitty, the whole background, FDDs, the swaps, the different kind of tailwind cycles that we think exists. Like what Newton put together, this is like a freaking, it's, I call, he's like a, I call him I scribe, not my, right? It's not possessive like that. But like he's like the GME scribe because he's done such an incredible job staying in touch with what's going on. And he absolutely spends a lot of time and effort, you know, finding things that feed into the story. And he and I actually spend quite a bit of time, both on live streams. He and I have spoken more off live stream than on live stream by quite a lot at this point. And we talk about like these different things that he's coming across and try to analyze them. It's again, this stock moves so differently than normal stocks. And for somebody like me that's been in markets for so long, coming across products that do that is so intriguing. Like there's no other",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 107,
      "start_timestamp": "00:13:59",
      "start_timestamp_seconds": 839.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=839"
    }
  },
  {
    "text": "talk about like these different things that he's coming across and try to analyze them. It's again, this stock moves so differently than normal stocks. And for somebody like me that's been in markets for so long, coming across products that do that is so intriguing. Like there's no other way for me to describe it than pure intrigue to see things. It's like if you play a sport, right? If you're a martial artist and you think about certain movements, movement patterns, there are things that are generally universal. But then every once in a while, somebody will come up and do things completely different. So that's kind of like a John Jones kind of fighter who's not really perfect at anything, but he's really good at most things. And he's super creative or like a Mikey Mousametshi from a Jiu-Jitsu world. Like they move differently than like the standard. And it's part of what makes them so intriguing. So when I look at GameStop, it's that. It's absolutely intriguing the way that the thing works. So Jay Swag says, I feel like you could trade GME pretty consistently, but not your portfolio. Yeah, absolutely. I think that's a completely fair statement. I think traders have to figure out what's right for them. So like, for example, if I look at GME and the way that GME has been moving, the notion of could it be traded? Absolutely. This can be traded, no doubt. But from the context, also,",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 107,
      "start_timestamp": "00:15:17",
      "start_timestamp_seconds": 917.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=917"
    }
  },
  {
    "text": "completely fair statement. I think traders have to figure out what's right for them. So like, for example, if I look at GME and the way that GME has been moving, the notion of could it be traded? Absolutely. This can be traded, no doubt. But from the context, also, there's a hundred of us here. So shout out to the outlier apes or just the apes who ever is here hanging out, all are welcome. But when I look at something like GameStop, could I trade this here? Of course, I could always trade something if I'm so inclined. But the question I think a trader has to ask themselves is not like, could I conceivably place a trade in this? Could I conceivably place a trade? Yes. The question realistically is where is the best place for my money? That's what I care about as a trader. So to me, the question when I look at something like GameStop or any other opportunity is not, could I trade this at this point? I can structure a trade for anything. But it's where is the best possible place for my money? And it's not just in terms of where can I make the most money? Where's the best return? It's how do things fit into my portfolio so I can deploy all of my capital in a way that achieves my broader objectives with my money. So yeah, day swagger, I completely agree with you. Somebody could easily focus",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 107,
      "start_timestamp": "00:16:27",
      "start_timestamp_seconds": 987.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=987"
    }
  },
  {
    "text": "can I make the most money? Where's the best return? It's how do things fit into my portfolio so I can deploy all of my capital in a way that achieves my broader objectives with my money. So yeah, day swagger, I completely agree with you. Somebody could easily focus only on GameStop. That is completely possible. But it's a really tough way to make money in general for a trader. For an investor, it's definitely a different story. Investors have to do whatever's right for them. But even somebody like Roy and Kitty, that's one of the reasons why I'm so fascinated by him because he is an outlier. He's a true outlier in the way that he approaches markets and the way that he approaches money and the way that he runs trades. And he's been extremely fortunate. I will again, keep it a buck. The dude's smart. He's super smart. But the thing about the way that he's been able to grow his money is that it's not even just about being smart. It's also a lot about fortune. Like how much luck is involved with how positions happen to be built at given different point in time? Now for him, he's obviously sustained the approach for some time. So it shows that I would argue it's more skill than luck. But there's still a healthy dose of luck. So with stuff like that, like looking at somebody like Roy and Kitty, I think it is so",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 107,
      "start_timestamp": "00:17:37",
      "start_timestamp_seconds": 1057.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=1057"
    }
  },
  {
    "text": "time? Now for him, he's obviously sustained the approach for some time. So it shows that I would argue it's more skill than luck. But there's still a healthy dose of luck. So with stuff like that, like looking at somebody like Roy and Kitty, I think it is so important, absolutely so important that we have to have like a healthy understanding of survivor ship bias, how that works. And again, even the cat, he's moved from at least I think. I don't know if he's sold out of GME. I can't say definitively, but I think he has. And it looks like he's rotated into Chewie for now. I don't necessarily think by any means that he's done with GME. I still think that, again, based on the breadth of evidence I've come across, it seems like GME is kind of like his bag. But I also think he's venturing out for opportunities where he sees them. So I think that's part of the reason why he moved. At least in the short term. Now again, I want to be very, very clear. I don't know because I haven't seen his portfolio. I don't think anybody has. And with that is the case, it's impossible for me to say definitively and I refuse to. That's another thing that you'll find about the way that I talk about these things. I am so mindful about the framing of things. And I think a lot of people are too comfortable",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 107,
      "start_timestamp": "00:18:46",
      "start_timestamp_seconds": 1126.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=1126"
    }
  },
  {
    "text": "with that is the case, it's impossible for me to say definitively and I refuse to. That's another thing that you'll find about the way that I talk about these things. I am so mindful about the framing of things. And I think a lot of people are too comfortable saying things is fact when it's impossible for them to know it is fact. And I think that's dangerous. That creates a really bad habit in our brain. That we turn things that are well educated guesses into fact and they're different things. So yeah, somebody like growing kiddie is just absolutely fascinating to me in the way that he trades. So back over to this though, I started reading through the case to understand the broader context of like what the problem is, what they're thinking about. Let me zoom this in a little bit. Let me know if that's easier for you guys to read. If not, I can zoom it in a little bit further. PFA has to step away for a few moments. PFA, let's not joke around. We know that you'll be back in about 45 seconds, but that's good. Enjoy those 45 seconds as best as you can. And then yeah, that's great. We'll catch up with you in a few moments. We got roaring titty. You guys didn't tell me roaring titty was here every time I have a chance to say that name. I'm always here to say roaring titty. It's great",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 107,
      "start_timestamp": "00:19:50",
      "start_timestamp_seconds": 1190.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=1190"
    }
  },
  {
    "text": "best as you can. And then yeah, that's great. We'll catch up with you in a few moments. We got roaring titty. You guys didn't tell me roaring titty was here every time I have a chance to say that name. I'm always here to say roaring titty. It's great to see you. Oh, PFA pulled their message back. That's unfortunate. It was good for everybody. That's okay. It's all right. PFA. It looks like PFA might be back already. That was quick about time I think. All right. Back into this. So let's take a look at the primary complaint. And I'm not going to go through each piece in this docket at all. My intent is just to help us align on the big muscle movements and have everybody on the same page. Because one thing I do find people do not just in the ape community, but in most communities, is I don't find people take the time to go to sources. And I think it's important to go to sources, to like actually see with our own eyeballs what something is. Because a lot of people, they have like different opinions of stuff. And that's okay to hear the opinions. But I think it's really important to see the actual information. Again, like you can tell from the way that I typically present content to you guys. I'm very specific when I'm talking about something as an opinion, I literally will say in my opinion very",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 107,
      "start_timestamp": "00:21:01",
      "start_timestamp_seconds": 1261.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=1261"
    }
  },
  {
    "text": "to hear the opinions. But I think it's really important to see the actual information. Again, like you can tell from the way that I typically present content to you guys. I'm very specific when I'm talking about something as an opinion, I literally will say in my opinion very purposefully so that you know that is my brain interpolating information and coming up with what I think. But there's also a difference between like objective information. So that's what I aim to align with on this specifically is what is the objective information? What is the origin of this thing as it sits? So the lead plaintiff, this homie, individually and on all other person situated. So from my understanding, stuff like this happens when there's going to be some sort of potential class action suit, bigger suit, but they pick a lead plaintiff. And then they represent all their people that are in similar scenarios. So from my understanding, they'll typically do this so that they have obviously a focal point to work with. But they'll also try to find somebody that like represents the case. Well, the most recent case against roaring kitty that was filed I think on a Friday. And it was dropped on the Monday, which was really interesting. I did a video on that a while ago. That was a similar scenario where they picked somebody to be kind of like the lead in that case. But I thought the lead for that",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 107,
      "start_timestamp": "00:22:11",
      "start_timestamp_seconds": 1331.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=1331"
    }
  },
  {
    "text": "think on a Friday. And it was dropped on the Monday, which was really interesting. I did a video on that a while ago. That was a similar scenario where they picked somebody to be kind of like the lead in that case. But I thought the lead for that case was really, really weak. So I'm actually very curious how strong this lead is in this case because yeah, I think that's kind of an important, I don't want to say that important, but it is kind of an important factor to have somebody that represents it that has, I don't want to call it like a more exaggerated story, but definitely more severe story would make sense. So let's see, the within allegations based upon the investigation conducted through the plaintiff, they reviewed analysis of Ryan Cohen, Arnalg Gustavo's public filings with the SEC, press releases, public report news articles, research reports, so on and so forth. So this is a federal securities class action brought on behalf of those folks who purchase stock from within the time frame, essentially that they're referencing. And it says the plaintiff brings action, derivative action within the meaning of rule that. So this is kind of just the foundation for the case writ large. It's talking about everything what it ties to for different case laws and different rules that they have to abide by who has jurisdiction, yada yada yada, I want to see where we see the, where we",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 107,
      "start_timestamp": "00:23:19",
      "start_timestamp_seconds": 1399.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=1399"
    }
  },
  {
    "text": "So this is kind of just the foundation for the case writ large. It's talking about everything what it ties to for different case laws and different rules that they have to abide by who has jurisdiction, yada yada yada, I want to see where we see the, where we see the, where we see the meat potatoes here. So here is the first part. So paying Chang-C, it looks like they're saying that they acquired 8,020 shares. And then they got it, they're arguing when it was artificially inflated. And then they lost 106 thousand dollars. First off, I boo fucking who, crime me a river, but that part of side, let's see what they say. Canadian citizen called by media is the meme stock champion? Is that accurate? Is this, is this true? Like is this actually what he's generally known as the meme stock champion? I've heard of him, I know like Elon calls himself like the meme stock king or some shit like that, but I don't know about the, the meme stock champion. What does that make sense to you guys? I'm most, I think we should be back up. My bad. We just took, we took a little hiatus, you know how it goes. I think I messed up something in, in OBS. Okay. So Paulus says full iceberg. Well, all right. We're back at it. Also, there's 69 of us. So that, that was worth dropping out for a moment. Okay. So it",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 107,
      "start_timestamp": "00:24:41",
      "start_timestamp_seconds": 1481.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=1481"
    }
  },
  {
    "text": "we took a little hiatus, you know how it goes. I think I messed up something in, in OBS. Okay. So Paulus says full iceberg. Well, all right. We're back at it. Also, there's 69 of us. So that, that was worth dropping out for a moment. Okay. So it sounds like a kernel says you're breaking up. Let me know if the audio is still coming through choppy. The OBS looks like it's going through. Okay. I see 60 FPS, 4600. All right. So Paulus says I'm thawed. That sounds great. I'll go with thawed. That's all right. And doctors A says we sound okay. So it looks like whoever says that I'm coming through broken. We're just going to have to get you off of bad Wi-Fi. So okay. So it sounds like from consensus, though, this isn't actually something he's like overly well known for. The reason why I was asking this is because I see this where again, like in the deposition that I was reading most recently, it looked like they were really trying to lean into this shit. And I'll explain a little bit why I think that is when we get there. But I was genuinely just curious if this is like a well-known name for him. And it sounds like generally not. So it says Cohen has employed, oh shit, they're getting right into the meat and potatoes has employed pump and dump scheme to raise as much capital and ignited several",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 107,
      "start_timestamp": "00:26:06",
      "start_timestamp_seconds": 1566.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=1566"
    }
  },
  {
    "text": "I was genuinely just curious if this is like a well-known name for him. And it sounds like generally not. So it says Cohen has employed, oh shit, they're getting right into the meat and potatoes has employed pump and dump scheme to raise as much capital and ignited several meme stocks to draw dropping heights. He served as chairman of game stops boards in January 21 and throughout the class period. So that's also fascinating. Now obviously they have to come out with their forks and knives in order to start getting something spicy going here. But when I'm reading this, I think that they kind of forget quite a lot that he can't, like he can't actually do this that well. The problem with larger float stocks is that they're difficult to manipulate. That's why traders like me tend to not trade penny stocks. So if you've ever been in any of my like my weekly update live streams, whenever people bring up, you know, penny stocks, I'm always not about it. And it's because like I can't really trade it and they're really prone to manipulation. So Evergreen says more on alert. Yeah, I mean, I don't think you're wrong, brother. I'm probably fall squarely into that category, but I'm enjoying learning about the the story and whatnot. So hopefully we can learn a little bit together. But back to this, it's difficult to actually run some sort of broad pump and dump on something like this",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 107,
      "start_timestamp": "00:27:18",
      "start_timestamp_seconds": 1638.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=1638"
    }
  },
  {
    "text": "think you're wrong, brother. I'm probably fall squarely into that category, but I'm enjoying learning about the the story and whatnot. So hopefully we can learn a little bit together. But back to this, it's difficult to actually run some sort of broad pump and dump on something like this in my opinion. So could it be done? I absolutely think so. But I think it would be really difficult. There was a recent case. I'm not sure if you all are familiar with it, but there was an entity. I'm not going to name them because I don't want to give them any undue press. And the entity though, they were like straight up running pump and dumps. And it was clear to see that there was like very clear messaging behind it that they got from fact finding. So yeah, I mean, that's like a clear example of pump and dump. I think this is a really difficult argument for them to make here. But when somebody has a lot of money, a lot of times they're not necessarily trying to position something that is super solid enough to go through and win a trial. Because really if they can get them to settle ahead of time because they don't want to go to trial or whatever else, that's what this is for. So even if this case is not the strongest thing based on our opinion or whoever else's opinion, the main thing is they're kind of",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 107,
      "start_timestamp": "00:28:30",
      "start_timestamp_seconds": 1710.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=1710"
    }
  },
  {
    "text": "they can get them to settle ahead of time because they don't want to go to trial or whatever else, that's what this is for. So even if this case is not the strongest thing based on our opinion or whoever else's opinion, the main thing is they're kind of just taking a shot here. And if they can get some of this to stick, then it becomes kind of again, just how much can we potentially get from this dude to settle before even going to trial? Because that's the vast majority path of cases is not trial. So this has like a little bit of mango on the lip. Gotta get my mango. Warring Titty says isn't Colin also the son of a big time trader? Yeah, I think his dad not only was a trader, but I'm pretty sure he was a businessman. So let's see Ryan Cohen's dad. Ted Cohen. Let's look up Ted Cohen. This shows philosophy. That's not right. There's a lot of I don't know if you guys can find a Wikipedia page on it. Let me know. I didn't see one doing like a really quick like a really quick pick through, but yeah, I think he came definitely from money. He also came from a pretty well educated background. So yeah, Evergreen says so buy Fubo tomorrow since they won the federal lawsuit against Disney and competitors. Oh, I see. Evergreen's just talking to somebody else. I see. All right. No,",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 107,
      "start_timestamp": "00:29:42",
      "start_timestamp_seconds": 1782.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=1782"
    }
  },
  {
    "text": "but yeah, I think he came definitely from money. He also came from a pretty well educated background. So yeah, Evergreen says so buy Fubo tomorrow since they won the federal lawsuit against Disney and competitors. Oh, I see. Evergreen's just talking to somebody else. I see. All right. No, this says he's really known for true, though. Yeah, yeah, that's exactly right. So Ryan Cohen is really the one that started Chewie and that was a fascinating business venture for him because his direct competitor, somebody like Amazon, and he found a way to angle in between Amazon and a broader market that overall by all intents and purposes, they they had dominated. So that is a really, really interesting outcome, I think, for Chewie and how how successful he was able to able to make it. Roing Td says never mind. A.A says he's not a big time investor. Yeah, I thought he was a businessman more so. Pat Smith says, Glassware Company. Yeah, okay, that checks out. I thought he was a business dude. So they're trying to say essentially that he ran a pump and dump. And this is talking about JP Morgan. Don't care. Defendant RC ventures, Delaware Corporation. That's super common, by the way. LCs very often are going to be out of Delaware because they have more favorable business laws. It's talked about, okay, so he bought in 10 stake and best buying beyond, a bad bath and beyond in March of 2022.",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 107,
      "start_timestamp": "00:31:30",
      "start_timestamp_seconds": 1890.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=1890"
    }
  },
  {
    "text": "RC ventures, Delaware Corporation. That's super common, by the way. LCs very often are going to be out of Delaware because they have more favorable business laws. It's talked about, okay, so he bought in 10 stake and best buying beyond, a bad bath and beyond in March of 2022. And the defendant has served as the company executive vice president since May of 2020. And here are the allegations. Plaintiffs claims or typical claims members class adequately protect the interest. Here we go. So the class is so numerous that jointer of all members is impractical, will impracticable. Why would it not just say impractical? What does this word mean? Impossible impractice to do or carry out. Why not just impractical? Why does it have to be impracticable? Huh. Learn a new words. As of 22, BBBY is essentially 80 million shares outstanding. So such shares traded on NASDAQ, exact members not known at this time, numbers in the thousands. Okay, so here are the actual allegations. It says that there were materially misleading statements, omissions made to investors regarding the company plans, financial conditions, so on and so forth. So not representing the company is effectively at all times Gustavo as the executive VP, CFO and Treasurer control day to day affairs. And Cohen was the largest shareholder who appointed three directors to the board, a controlling person pursuant to section 20a. Through mid August, 22 BBBY appeared from the company's perspective statements and financial reporting to be",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 107,
      "start_timestamp": "00:32:44",
      "start_timestamp_seconds": 1964.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=1964"
    }
  },
  {
    "text": "times Gustavo as the executive VP, CFO and Treasurer control day to day affairs. And Cohen was the largest shareholder who appointed three directors to the board, a controlling person pursuant to section 20a. Through mid August, 22 BBBY appeared from the company's perspective statements and financial reporting to be a successful turning around companies. So let's grab a chart of BBBY. And then let's go back five years. I don't even think we have to go back five years. We do like maybe three years, except I want daily. So let's do a three year daily chart like that. That's better. Okay. So this is not going to be behind my head, but I think I'm mostly out of the way. So here we can see where 22 was. So 22 just for reference starts right here. And they were saying the time frame that they're referring to through mid August, which is here, which is really interesting. Because if you actually look at this chart from that time frame, this wouldn't look like a company that's turning around. I mean, just I don't know, maybe I'm being nitpicky there, but I wouldn't consider that a company that's turning around. It looks like a company that's having giant problems. Now for those that don't know, from my understanding, somebody like Ryan Cohen seems to just realize the chair was like screwing up the background remover. Ryan Cohen seems to like to intervene in seller boxing, which seller boxing is",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 107,
      "start_timestamp": "00:34:29",
      "start_timestamp_seconds": 2069.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=2069"
    }
  },
  {
    "text": "around. It looks like a company that's having giant problems. Now for those that don't know, from my understanding, somebody like Ryan Cohen seems to just realize the chair was like screwing up the background remover. Ryan Cohen seems to like to intervene in seller boxing, which seller boxing is a man. It's an interesting business practice, but it's essentially to not go super far in the weeds. It's a predatory business practice where you attempt to extract as much money from a company before it goes bankrupt. And the reason why you do that is because if you essentially extract as much value as possible, and then you short sell something and then it goes bankrupt, you don't have a tax footprint. There's you don't owe anything because the entity is gone. So there's an incentive for this predatory practice. And essentially the way it works is investors of different sorts, sometimes in goods with a broker of some sort, well, identify a company that's otherwise struggling, they'll put a board in that specifically or one of two things either a grossly incompetent board and leadership team that they know is not really going to save it, driving it into the ground, or somebody that's complicit with the behavior, either or again, don't know in this circumstance what that was looking like. But the process can make a ton, a ton of money. So that's why they're incentivized to do stuff like this. Now for somebody like Ryan Cohen,",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 107,
      "start_timestamp": "00:35:59",
      "start_timestamp_seconds": 2159.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=2159"
    }
  },
  {
    "text": "into the ground, or somebody that's complicit with the behavior, either or again, don't know in this circumstance what that was looking like. But the process can make a ton, a ton of money. So that's why they're incentivized to do stuff like this. Now for somebody like Ryan Cohen, if you're able to turn the company around, it leads to stuff like this, to squeezes. And it leads to movements that force the other side of the trade that was shorting it to get out of their trade and it can make a shit out of money to the upside. Now it's very, very much difficult in order to make that kind of turnaround. But if you are able to make that kind of turnaround, you can make a ton of money. And I think Cohen started getting more into this activist investor role because of some of the possibilities there. Now again, I don't know his actual motivations. I don't know if he's in there till, you know, for Chevrolet to go in there and save a company. I like, I think he's still a businessman. But I think it happens to Cohen side with doing something that I would consider to be more honorable than, you know, participating in purposefully sending a company into the dirt because you have a chance to make a tax regain on it. So that's what I think in general, one of the reasons why he started moving into this is because",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 107,
      "start_timestamp": "00:37:16",
      "start_timestamp_seconds": 2236.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=2236"
    }
  },
  {
    "text": "I would consider to be more honorable than, you know, participating in purposefully sending a company into the dirt because you have a chance to make a tax regain on it. So that's what I think in general, one of the reasons why he started moving into this is because he saw an opportunity here to navigate that. So here it says through mid August, it appeared to be successful turning around the company appeared to be moving rapidly towards growth, profitability through fundamental reshaping strategies, spending off the best, the buy-by baby business, the picture almost entirely fiction from March 22 through August 22. They're saying that Cohen in conspiracy with Gustavo engaged in fraudulent scheme to artificially inflate the price of BBY publicly traded stock. More specifically, with JPMs aiding in a betting, blatantly misrepresented the value of the profitability of BBY causing it to report revenues that was fictitious and all right. So they're any here talking a bunch of shit. I think if anybody has any questions on this, I think we can go further into detail if you'd like. The only reason why I really wanted to start with this document is so that everybody has again, from the source, what the issue is, what they're looking at and why they're looking at it. So my intent isn't to go through this entire document because it's going to be super one-sided. This is the complaint. When you see a complaint, this is the people who",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 107,
      "start_timestamp": "00:38:27",
      "start_timestamp_seconds": 2307.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=2307"
    }
  },
  {
    "text": "has again, from the source, what the issue is, what they're looking at and why they're looking at it. So my intent isn't to go through this entire document because it's going to be super one-sided. This is the complaint. When you see a complaint, this is the people who have a complaint that are going to talk all their shit. So it's going to be super one-sided. I don't care to go through this, but for those that want to go through the whole thing in detail, I'll drop a link in the chat. You guys all have access to that now. Then I'll drop a link to the broader thing as well in the chat just so that you can have the entire docket. I'm pretty sure this is on Newton's sheet somewhere. If I'm not mistaken, if not, I'll make sure that he also has exits. Not really GME, but it's tangential via Cohen because this does impact Cohen when he has pending litigation like this going on. So that's this one. We now understand, again, from the source, what the general gripe was, they think that these two incahutes were trying to spread a fake story about Best Buy essentially for their own gain. I have to open my door real quick because the boss is here, aka Thor. I think he heard us talking about legal stuff and he decided to come check it out. The main thing is he is hilarious. He goes up",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 107,
      "start_timestamp": "00:39:53",
      "start_timestamp_seconds": 2393.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=2393"
    }
  },
  {
    "text": "about Best Buy essentially for their own gain. I have to open my door real quick because the boss is here, aka Thor. I think he heard us talking about legal stuff and he decided to come check it out. The main thing is he is hilarious. He goes up to my door and he just scratches it once. Oh, you're tired. Why are you so tired? You've been sleeping, bro. He comes up and he scratches the door once and then he scratches it again and then he scratches it again. It's like a very, very specific cadence. But as you can tell, he's ready. He's interested to get into the legalities of game stop. Do you know about this? Hey, need you to focus. We're going to talk about depositions. You know what deposition is? I think he's ready. I feel like he's essentially, you can tell he's ready for court. He has his tuxedo on. He does have a mohawk. I don't know how well perceived that would be in court. But yeah, we got the boss here. All right, let's get my ugly face out of the way now. Alan says real quick. Can you explain for me how to buy shares of GME on the lot market? I've seen a lot of talk about retail traders orders not making it to a lit market. Okay, you meant lit market. Yeah. So depending on who your broker is, you can choose where to route your order.",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 107,
      "start_timestamp": "00:40:59",
      "start_timestamp_seconds": 2459.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=2459"
    }
  },
  {
    "text": "for me how to buy shares of GME on the lot market? I've seen a lot of talk about retail traders orders not making it to a lit market. Okay, you meant lit market. Yeah. So depending on who your broker is, you can choose where to route your order. So again, I don't know who your broker is. But if you choose order routing, then you can essentially determine where you want it to go so that it's not gone through a market maker. So if you use something like the ice, it's an electronic exchange. You can change the routing of your order so that it's not being fulfilled through a market maker, that kind of thing. Cedric says, oh, shit, this guy's USMC. Yes, sir. That is exactly what all that paraphernalia is that you see in the background. Rohingtini says, IEX, I think, yeah, so you can take a look at a couple different ones. Alan uses Robinhood. So I honestly have absolutely nothing to say to you because the last thing I would use is Robinhood. That is like straight up the last possible broker I would use. I would rather use a fucking notepad that I mail to people then using Robinhood and supporting that business. I would rather use stone tablets that I chisel my trade and deal with the delay of FedEx shipping stone tablets in order to get trade confirmations than going through Robinhood. There's just no way. So the main",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 107,
      "start_timestamp": "00:42:28",
      "start_timestamp_seconds": 2548.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=2548"
    }
  },
  {
    "text": "that I mail to people then using Robinhood and supporting that business. I would rather use stone tablets that I chisel my trade and deal with the delay of FedEx shipping stone tablets in order to get trade confirmations than going through Robinhood. There's just no way. So the main thing you want to look up though is like specific to your broker once you get a natural broker is just how to route orders directly to the exchange. So if you route orders directly to an exchange, you're now bypassing the market maker and you don't really need to you don't have to have your order internalized. So yeah, that's what you can do there for that. It's a good question. Ian says, dude, I remember these livestreams two years ago where you attend 13 people so sick to see other communities going, yeah, man, I have to be honest. The funny thing about the way that you could tell that I'm not in this for like the fame or the attention because exactly as Ian is saying, I've done livestreams since I started on YouTube essentially and like we used to have like 10 people which I was totally cool with. My goal for being on YouTube is just to try to share information because when I started looking at the broader picture, there's so much shitty information and terrible people that are just trying to make money off of people that it drives me crazy, especially because",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 107,
      "start_timestamp": "00:43:39",
      "start_timestamp_seconds": 2619.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=2619"
    }
  },
  {
    "text": "totally cool with. My goal for being on YouTube is just to try to share information because when I started looking at the broader picture, there's so much shitty information and terrible people that are just trying to make money off of people that it drives me crazy, especially because the people that they're trying to make money off of are the exact people that don't have the money to waste. So that's I did a thing for a while where I was doing like these trade service reviews stuff because I was like super pissed off about it. And I was trying to find like decent trade services and I can't find them really. They're hard to find, but yeah, we've been running this for a minute and it's fun. Yeah, I love seeing the community grow. It helps also with just collective intellect and like the hive mind and the overall amount of information we have available to us. It's just straight up beneficial for everything. Paulus says when is it advantageous to bypass the market maker? Really, if you don't want your order being internalized. So like if you want your order to be processed on the actual exchange, that's when you could do it. But other than that, again, from like a practical perspective, it's it's not really beneficial. More often than not, you are going to get a slightly better fill through a market maker because of the way that payment for order flow is",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 107,
      "start_timestamp": "00:44:53",
      "start_timestamp_seconds": 2693.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=2693"
    }
  },
  {
    "text": "actual exchange, that's when you could do it. But other than that, again, from like a practical perspective, it's it's not really beneficial. More often than not, you are going to get a slightly better fill through a market maker because of the way that payment for order flow is structured. Again, just keeping it real. I'm not saying that I love payment for order flow or anything. It's I will again, objectively say markets now are more efficient with payment for order flow than when they were when I started trading like 2008, 2007 is when I started, but specifically with options. So like payment for order flow isn't all negative, but I also don't think it's great. Like I think we're at a point now where we've seen how this works and I think that we're at a point where we can kind of move past payment for order flow into the next thing because there is a next thing that's better than payment for order flow without a doubt. But yes, just kind of where we're at at least at the point now. So yeah, that's the the idea about bypassing the market maker. Eric, it's my doppelganger. Eric says, have you heard about the cat error reporting numbers? There appears to be a correlation of a significant number of equities error reporting dates with GME price runups. Interesting. Really, really interesting. Now, I haven't looked into that. If there's somewhere that I can take a look",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 107,
      "start_timestamp": "00:45:59",
      "start_timestamp_seconds": 2759.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=2759"
    }
  },
  {
    "text": "doppelganger. Eric says, have you heard about the cat error reporting numbers? There appears to be a correlation of a significant number of equities error reporting dates with GME price runups. Interesting. Really, really interesting. Now, I haven't looked into that. If there's somewhere that I can take a look at it, let me know. You can either email it to me now and just let me know when you email it to me or you can drop it in the discord if you're in there, either or is totally cool. Eric at outlier trading.io, that's the new email address. So for everybody that doesn't know, I've moved the branding from ES invest to outlier trading. I just want it less like focused on me. It shouldn't be about me. So that's what that is. So that's my new email. Okay, yeah, if you put it in the discord, I can grab it real quick and pull it up. No problemo. I see. Let's take a look. All right. So this is from region formal. I say those names because you guys might know them. I honestly don't so I don't know exactly who they are if they have a background with you all. I don't know them, but just in case you do. This is finra is just released the latest cat error data and it has them intrigued. So once a month it says finra reports cat errors volume reached trading day. Yep. Notice the error rate percentages",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 107,
      "start_timestamp": "00:47:12",
      "start_timestamp_seconds": 2832.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=2832"
    }
  },
  {
    "text": "background with you all. I don't know them, but just in case you do. This is finra is just released the latest cat error data and it has them intrigued. So once a month it says finra reports cat errors volume reached trading day. Yep. Notice the error rate percentages which are trades that occurred on all dates did not contain all regulatory required information. On most dates, the rate is less than 21. However, occasionally much higher numbers first of May and I'm just trying to follow the logical thing here. Specifically, a nine occasions, there were excessive errors over a short duration, 1.8 billion within five days. All nine instances resulted in significant price rents for GME within the next 60 days. Yeah. Here's the deal. I again, I could see the interest here. The interest is interesting. That was kind of a funny sentence. But again, for like if this is the trigger, right, that if this happens that there's a price run within 60 days, that's a long ass time. And what happens over that 60 days, it's like unless you can purely isolate this thing, the cat error as the thing, unless you can purely isolate that. Then to me, and that's one of the things that makes the whole GME story so difficult, because it's so difficult to actually isolate individual things. So in this case, does it look like there's a relationship? I mean, they're saying in nine instances, there was a relationship.",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 107,
      "start_timestamp": "00:48:25",
      "start_timestamp_seconds": 2905.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=2905"
    }
  },
  {
    "text": "isolate that. Then to me, and that's one of the things that makes the whole GME story so difficult, because it's so difficult to actually isolate individual things. So in this case, does it look like there's a relationship? I mean, they're saying in nine instances, there was a relationship. I would need to know essentially the full data set though. And maybe they have it in here. But like I would want to see all of the instances, not just nine instances. So this says all nine instances resulted in significant price runs. But were there any instances where it went up and price didn't move? I would need to know that. But the other thing is with such a big window of like 60 days, I think it's really hard to like point at this and say this is the thing. Again, to their point, I'm not saying that that's what they're doing. But to them, it looks like there's an interesting correlation, right? So it says I found this trend applies to the market as a whole. Much stronger for GME than other stocks. BlueBars average performances of the stocks from 15 to 25 in the nine instance of the higher billion aerosicles. Tested price action after huge cat option air periods found the opposite trend. It looks really interesting. So this is the kind of data that I find really interesting. Because again, the what I see is there's two different parts of this. The first",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 107,
      "start_timestamp": "00:49:50",
      "start_timestamp_seconds": 2990.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=2990"
    }
  },
  {
    "text": "instance of the higher billion aerosicles. Tested price action after huge cat option air periods found the opposite trend. It looks really interesting. So this is the kind of data that I find really interesting. Because again, the what I see is there's two different parts of this. The first part is from just a general trading perspective. So I'll again use the example that I share with you guys here, which is in GME. If we go back here, if we go back here, I noticed something even before like the market started taking off on this first leg up. You can see on the third of May, there was a massive, massive increase in price and volume. So what causes this? I couldn't tell you, but this is one of the things that caught my attention. So when I look at this kind of run up, I see just interesting behavior. I see an explosion and volume that's focused on by side. And I see a massive movement in price. So now how that corresponds with again, this other data that we're looking at, I don't know. But what I do know is that before all of the squeezes that I've seen, there's been a really anomalous run up in average volume. That I can point that. What causes the run up in that volume, I don't know. But I do know that whenever I've seen GameStop run, the volume has changed. So for me, that's the indicator",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 107,
      "start_timestamp": "00:51:08",
      "start_timestamp_seconds": 3068.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=3068"
    }
  },
  {
    "text": "squeezes that I've seen, there's been a really anomalous run up in average volume. That I can point that. What causes the run up in that volume, I don't know. But I do know that whenever I've seen GameStop run, the volume has changed. So for me, that's the indicator I look for personally, because I can directly look at it. Nathan says, yeah, in those nine times price run happened completely different ways over those 60 days. So it's not exactly isolated. I got downvoted to hell saying that on his post. Well, I think the problem is Nathan for that, like why you would get downvoted is because like depending on the way that you frame it, right? Because I think one of the problems is it's so easy to cast stones and disprove theories. And it's much harder to come up with like efficacious theories. So the way that I typically try to look at addressing those kinds of things, at least from my mind, is from a pure scholastic standpoint, I am interested in finding the holes in the faults in a theory, not to tear it down because I don't want it to be true, but because I'm attempting to find truth. But I normally try to approach it from a method of how can we, if there's a hole in the theory on how we can build on the theory to try and again, identify as much truth as possible. That's the idea at",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 107,
      "start_timestamp": "00:52:54",
      "start_timestamp_seconds": 3174.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=3174"
    }
  },
  {
    "text": "but because I'm attempting to find truth. But I normally try to approach it from a method of how can we, if there's a hole in the theory on how we can build on the theory to try and again, identify as much truth as possible. That's the idea at least. So yeah, I'm not sure. I'm not exactly sure what the background is behind like your comment or how it went. But yeah, that's, it's really interesting to see those kinds of connections made because again, like there's no doubt that that is a fascinating, fascinating correlation with the cat error data. Like that, that's something. But whether or not that's the actual trigger to something, I'm actually like, I'm not sure. I'm really not sure. It's very difficult for me to tell. So it's something that I would keep an eye on and see what I could then tie it to and try to isolate. That's one of the hardest parts when I look at this here. And I explore Newton's data. We kind of talked about this. I can find a lot of instances where it's like there's kind of these really neat correlations between things where we might see FTD skyrocket or we might see some of the ETF FTD skyrocket. Like we can see these different pieces that start to move. But then I can also find instances where like the pieces move and then price doesn't move. So again, from like a correlation standpoint,",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 107,
      "start_timestamp": "00:54:01",
      "start_timestamp_seconds": 3241.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=3241"
    }
  },
  {
    "text": "we might see FTD skyrocket or we might see some of the ETF FTD skyrocket. Like we can see these different pieces that start to move. But then I can also find instances where like the pieces move and then price doesn't move. So again, from like a correlation standpoint, which again, like my background is based in stats. So from a correlation standpoint, it becomes really interesting to try to isolate it. And again, for me, the cleanest isolation I found so far is volume. And no shit, Sherlock, there's nothing magical about that. It's like very common. Now that the tricky part, I think for a lot of people is trying to identify where the volume comes from, which again, it looks like this is a start on that. But I think Noah says not every cat error equals an FTD, which is another really important point, I think. I think when we look at cat errors, it tells us there's something going on with tracking, but we don't know exactly what. So I'll have to see. Okay, so let me grab this link really quick. So this is the cat data. Where's the actual data? I see the presentation. So this link, it says the error update, including the data. So maybe it's in the presentation. So that's what I'm looking at here. So what I can do is I can pull this data down and then I can run a slightly different analysis that essentially can",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 107,
      "start_timestamp": "00:55:24",
      "start_timestamp_seconds": 3324.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=3324"
    }
  },
  {
    "text": "the presentation. So this link, it says the error update, including the data. So maybe it's in the presentation. So that's what I'm looking at here. So what I can do is I can pull this data down and then I can run a slightly different analysis that essentially can test for correlation and then I can regress it and assign a confidence interval. So I'll take this as an action item. Let me write that down. I have to write it down because I'm pretty dumb and I mess things up a lot. All right, so let me get rid of this. Because it's interesting. Again, like all of these different kinds of things, I really, really enjoy looking at because they are so interesting. But a big part of it, at least for me, is to try to like actually see if I can get to the heart of signal from the information. Because there's so much interesting information. So I need to do like a cat error, regression, and correlation. So then I'll add this to my to do list. This I'll save this as a bookmark on to do and then we'll take a look at that. So I will follow up on that to see like what I can find because I'm not sure. But this looks interesting to me. I can objectively say that this looks interesting to me. But it looks like there was another comment. Let me see. Diana says what initiates",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 107,
      "start_timestamp": "00:56:50",
      "start_timestamp_seconds": 3410.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=3410"
    }
  },
  {
    "text": "that. So I will follow up on that to see like what I can find because I'm not sure. But this looks interesting to me. I can objectively say that this looks interesting to me. But it looks like there was another comment. Let me see. Diana says what initiates more volume? I know news and earnings usually does but what else? The this isn't designed to be like pedantic. But the genuine answer and just to start from like a base level understanding is it's more interest in the stock. It's demand. It's people buying. So when I look at volume, I'm it's in the simplest form telling me people are buying. Now why they're buying? That's where it starts to get interesting. So in this case, are they buying because there's an FDD cycle and they need to accumulate shares in order to cover? That could be. Could they be buying because there are swaps coming up and they need to be able to deliver on the underlying? It could be. There's a lot of reasons why volume might start to emerge. But again, from like a trading perspective, we actually try to eliminate as much of that noise as possible because it's noise. The thing that matters to me is volume moving. Now again, from like just the general interest standpoint and markets, which obviously I'm fascinated by GME, but like I just love markets. You could tell because even when I was on vacation in Alaska,",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 107,
      "start_timestamp": "00:58:26",
      "start_timestamp_seconds": 3506.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=3506"
    }
  },
  {
    "text": "noise as possible because it's noise. The thing that matters to me is volume moving. Now again, from like just the general interest standpoint and markets, which obviously I'm fascinated by GME, but like I just love markets. You could tell because even when I was on vacation in Alaska, I was making videos about this stuff because I love markets. But so there's that side of me that wants to understand some more of the background. But I always make sure that there's a bifurcation in my mind. I'm compartmentalizing. Like I want to know why this volume is here because I'm generally interested. And maybe I can find a way to detect different kinds of volume signals to make decisions. So I can do that. Now with GameStop, it's interesting because again, like if I zoom this in a little bit more, it'll be easier for you to see. This is right now. Let's go to six months. Notice something very specific. And this is my initial key. And this is actually what made GameStop pop up on a scan for me. Notice this day doesn't look interesting by itself. I'll zoom in so it's easier for you guys to see this day right here. It doesn't look interesting by itself. It actually looks like it pales in comparison to everything else that we saw here. But relative to the time frame before all of this happened, this looked like a freaking mountain. As did this, these periods",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 107,
      "start_timestamp": "00:59:49",
      "start_timestamp_seconds": 3589.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=3589"
    }
  },
  {
    "text": "guys to see this day right here. It doesn't look interesting by itself. It actually looks like it pales in comparison to everything else that we saw here. But relative to the time frame before all of this happened, this looked like a freaking mountain. As did this, these periods looked really interesting to me. So when I saw this day come through where the bi volume was 8 million, the average volume at that point was 3.9 million per day total. The bi volume in this case essentially was almost two and a half times that. Well, two times. This becomes super interesting to me. So I this popped up on a scan. So then I started following it and I see this volume jumping in. So something's going on. And the fun part is is if you look at the options chain, you could see somebody knew something was going on. And it wasn't just roaring kitty. There was more players in there than roaring kitty. Because I started getting in along with a bunch of other people that are looking for these same kinds of things. Now, it's really important to note sometimes it turns into nothing. That happens. It's not a sure thing. But what I'm trying to do again from a trading perspective is just picking up breadcrumbs from options markets, which are highly informed smart people use options. And it's not because options are like cool or anything like that. It's because options provide",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 107,
      "start_timestamp": "01:00:51",
      "start_timestamp_seconds": 3651.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=3651"
    }
  },
  {
    "text": "That happens. It's not a sure thing. But what I'm trying to do again from a trading perspective is just picking up breadcrumbs from options markets, which are highly informed smart people use options. And it's not because options are like cool or anything like that. It's because options provide leverage smart people like leverage. You can make more money on your smart idea with leverage exactly what's going on there to a T. So when I see this kind of movement, I am very, very interested. With GameStop though, obviously it's super tricky because we don't know exactly what causes the volume. And it looks like there's that this is the other part of the story. That's really interesting to me is that when I look at these different really large movements in GameStop, a lot of times, I think there are different factors that drive the price performance. That's just been another wrench in identifying like what the the real signals are is that it looks like it's multivariate. That's as far as I can tell. So it makes it much more difficult to discreetly identify stock prices moving because of X because of Y or because of Z because sometimes it moves because of X other times it moves because of Y other times it moves because of Z. So again, for me, I funnel all of that into what I can tell you again with near certainty volume moves. I've not seen any sort of massive",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 107,
      "start_timestamp": "01:02:08",
      "start_timestamp_seconds": 3728.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=3728"
    }
  },
  {
    "text": "Z because sometimes it moves because of X other times it moves because of Y other times it moves because of Z. So again, for me, I funnel all of that into what I can tell you again with near certainty volume moves. I've not seen any sort of massive movement in GME before volume has moved. So if we go to a five year daily and we look at the the pre squeeze move here, look what happened to volume. You got a ton of crazy expanded volume here. I'll zoom it in. So it's easier to see. Take a look at the volume here, right? This is well before it started running up even above 100. In this case, it had already made a giant move here. It was like five bucks and here it doubled to like 10. But look at the volume. It's massive. So that's realistically the ultimate trigger that I personally use for stuff like this. Now again, as I'm analyzing it, this stuff I just find interesting and I want to learn more about it. I want to understand more about the product, how it moves, it's quirks. But this really comes down to just interest in what drives the volume. From a trading perspective, I'm just looking for volume. That's how I'm going to find movement. That's why I've been so disenfranchised as of late because we're, I mean, literally, you can't even see the volume anymore. It's so suppressed. And part",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 107,
      "start_timestamp": "01:03:40",
      "start_timestamp_seconds": 3820.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=3820"
    }
  },
  {
    "text": "to just interest in what drives the volume. From a trading perspective, I'm just looking for volume. That's how I'm going to find movement. That's why I've been so disenfranchised as of late because we're, I mean, literally, you can't even see the volume anymore. It's so suppressed. And part of that suppression to be clear is going to come from this. Jerry Diamond says volume is the ultimate trigger he uses after the facts. No, that's what I'm trying to show you is that volume starts to kick off before. That's the whole point I'm trying to explain to you guys. So again, maybe the point wasn't clear. So in this case, look at the second of May, we can see that price of GameStop second of May, it closed at 1276. And we can see that the volume though, the buy volume on the second of May, when it was still sub 15 dollars, the second of May, the buy volume was 8 million shares. The 20 day average volume at that point was 3.9 million shares. That's 3.9 million shares over the entire day on average for the past 20 trading days. On this day, the second of May, the buy volume, only the buy volume, the buy volume was 8 million shares. So the buy volume on the second of May was twice the average total day volume. This is again, when GameStop closed at 1276, this is light years before the interesting move happened, right?",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 107,
      "start_timestamp": "01:05:01",
      "start_timestamp_seconds": 3901.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=3901"
    }
  },
  {
    "text": "of May, the buy volume, only the buy volume, the buy volume was 8 million shares. So the buy volume on the second of May was twice the average total day volume. This is again, when GameStop closed at 1276, this is light years before the interesting move happened, right? This is on the second of May. You didn't get the ultimate moves until the 13th or the 14th of May. This is exactly what I was just showing you again, going back into 21. Before, in this case, we went above 100, the volume started growing above average volume levels days before. So like the 13th of Jan, you can clearly see excessive volume, even on the 11th of Jan. So what I'm highlighting is actually the exact opposite, Jerry. I'm highlighting that volume can start showing us positioning before the move because exactly to your point, what good is it to be able to say like, oh yeah, on the 28th of January, it was so clear that this was going to happen because the RSI started peaking and you know, it's all bullshit. Like the ability to look at something afterwards and paint a pretty picture is completely useless exactly to your point because it's after the fact. Of course, it's clear. It's hindsight. But what I'm trying to show you specifically with volume is that volume is such a great indication of things that might be happening. And again, I already told you, it's not perfect.",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 107,
      "start_timestamp": "01:06:19",
      "start_timestamp_seconds": 3979.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=3979"
    }
  },
  {
    "text": "completely useless exactly to your point because it's after the fact. Of course, it's clear. It's hindsight. But what I'm trying to show you specifically with volume is that volume is such a great indication of things that might be happening. And again, I already told you, it's not perfect. There will be times where you'll see a volume run up and then something falls flat on its face. That absolutely happens. But when you're trading, it's about a probabilistic assessment of things and where can you find a higher probability of a move. And the reason why this happens is because markets take time to position. It's not an instantaneous thing. We as retail traders, that's one of that's one of our very few advantages that we get to position however we want, whenever we want. And you can essentially do it with your entire account that is not the case for larger institutions at all. Larger institutions have to take time to position things however they want. And even somebody like Rory and Kitty, which we clearly had an example with not that long ago, and when he started posting his yellow updates, we can trace back his behavior when he was entering the position. And you can see that he had to build it over time. So yeah, I mean, that is again, like one of the very, very few benefits that we have. And I am getting a dinner order ready for my wife and I.",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 107,
      "start_timestamp": "01:07:54",
      "start_timestamp_seconds": 4074.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=4074"
    }
  },
  {
    "text": "behavior when he was entering the position. And you can see that he had to build it over time. So yeah, I mean, that is again, like one of the very, very few benefits that we have. And I am getting a dinner order ready for my wife and I. I think we're going to do barbecue tonight. A little bit of barbecue. It's supposed to be good for the soul they say. I'm think I'm going to do try tip and pull pork. I think that's what I'm leaning towards. What do you guys think? Maybe do it like the spicy barbecue. That's what I'm going with. I think that's a good pick. I'd rather be seeing says increased volume starts before the actual move. Yeah, exactly right. The vast majority of instances you'll see volume move before the underlying starts to move. Dan says, doing a stir fry with veggies rice chicken steak. Oh, dude, that sounds so good. Tomorrow, I was going to do pasta with garlic and oil. My mom used to do that. She does like, I don't know, it's super, super good. And I like, I like that a lot, but I always add chicken to it because I don't just like eating pasta by itself. Obviously, it's just like a lot of carbs for the sake of carbs. And then also, I need to text my wife quick to see if she can hook me up with a reload. And you grab me",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 107,
      "start_timestamp": "01:09:11",
      "start_timestamp_seconds": 4151.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=4151"
    }
  },
  {
    "text": "chicken to it because I don't just like eating pasta by itself. Obviously, it's just like a lot of carbs for the sake of carbs. And then also, I need to text my wife quick to see if she can hook me up with a reload. And you grab me a reload of mango orange. Spend drift. She's the homie. She essentially keeps it keeps it pushing in here because, but I think I've told you guys like towards the end of the day is when I normally break my fast. So I start going through liquid like a mother. Colonel says, you're living the life of Pat Riley. I actually don't know who that is. Is that like, I actually have no idea if it is off the lift them up. And then back for I forgot, Jerry, I think Jerry originally was talking about the volume. I just want to make sure, Jerry, that that makes sense for you because I think that that's like a really important general point for people for traders in general because it's one of the cleanest indicators that you can use. It's very difficult to use just volume by itself. Like I said, you kind of have to pick up other context clues by volume versus cell volume, by volume versus recent average volume. There's a lot of these like smaller quirks that I think you have to pay attention to. So another thing that you'll find on my chart sometime that",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 107,
      "start_timestamp": "01:10:24",
      "start_timestamp_seconds": 4224.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=4224"
    }
  },
  {
    "text": "said, you kind of have to pick up other context clues by volume versus cell volume, by volume versus recent average volume. There's a lot of these like smaller quirks that I think you have to pay attention to. So another thing that you'll find on my chart sometime that not here now, but is actually two moving averages. So in this case, I have a longer term moving average. You're the bomb. Thank you. And then I sent you a part. She came in with the hook off. Thank you. There we go. We got another mango orange. I was having to drink my backup watermelon, Seltzer water, which is just a, you know, just a to giant step down. All right. So it looks like we might have lost Jerry. That's okay. I just wanted to make sure that the explanation was clear because I really do hate it when people are doing technical analysis after the fact and we pretend like it's all so clear and we could see all these things. But ahead of time, it was like the clearest thing is possible. And yeah, I just don't think that that's useful. It looks like there's a question from Tommy. Tommy says, what volume specific scans you use and toss? There's a bunch of them. So I'll use percent growth. I'll use percent growth over an average. I'll use percent overnight growth. If I'm trying to trade something next day, continuation style, I'll use standard deviation.",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 107,
      "start_timestamp": "01:11:37",
      "start_timestamp_seconds": 4297.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=4297"
    }
  },
  {
    "text": "a question from Tommy. Tommy says, what volume specific scans you use and toss? There's a bunch of them. So I'll use percent growth. I'll use percent growth over an average. I'll use percent overnight growth. If I'm trying to trade something next day, continuation style, I'll use standard deviation. That's another big one. So like volume that exceeds two and a half time standard deviation. I'll use volume that's accompanied with a price gap. All of those are on the table for me. Volume is one of my favorite scans because it really is super, super telling. You can learn a lot by looking at volume. And again, it's not a perfect thing, but what I like to do is start with volume. And then I'll then start to build off of it with what else I can see. So sometimes if you start with volume and then you start seeing, for example, the moving average starting to expand. And then you start to see the buy volume as a larger percentage of total volume. All of those things start to coalesce, I think, into a really, really cool picture. That's relatively, I don't want to say easy to see, but it's relatively high probability, I believe. But I definitely like to make sure that if I'm playing something one of the base requirements, oh, it almost always is volume. If there's no volume, you're losing liquidity, which you need in order to get in and out. And you",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 107,
      "start_timestamp": "01:13:01",
      "start_timestamp_seconds": 4381.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=4381"
    }
  },
  {
    "text": "see, but it's relatively high probability, I believe. But I definitely like to make sure that if I'm playing something one of the base requirements, oh, it almost always is volume. If there's no volume, you're losing liquidity, which you need in order to get in and out. And you also need volume because that's again, what ultimately moves stock price, which is kind of that smaller component, we were talking about a little bit earlier when I kind of glossed over it. I'd rather be skiing says volume is like hearing a gunshot. You just don't know where or if it will continue. I know. Yeah, I think it's a weird comparison because if you've been shot at you actually get kind of good at knowing how to detect like different sounds of gunshot where it is. So I get your point though. I think overall it's a good point. No, this says what's your analysis of these recent low volume days? Yeah. Yeah. To me, it looks like we're consolidating. So a couple of things that I think about in this like within this context, you can see that even on this really light volume, GMEs not being pushed down, which is actually to me like really good news. So when I look at like this day, it was 64 sale volume, meaning people hitting the other side of the bid ask spread. And it still was a small update like not huge. It opened at 2237 and",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 107,
      "start_timestamp": "01:14:13",
      "start_timestamp_seconds": 4453.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=4453"
    }
  },
  {
    "text": "pushed down, which is actually to me like really good news. So when I look at like this day, it was 64 sale volume, meaning people hitting the other side of the bid ask spread. And it still was a small update like not huge. It opened at 2237 and it closed at 2240. So I mean, we made three pennies on the day. It's nothing really to write home about. But if you think about it in the face of doing that with pretty decent sale volume on a relative basis for the day, I actually consider that a little bit of a win. So I think GameStop is getting really close to a point where like investors are generally agreeing on the value. We did exercise not too long ago on like what the intrinsic value was. And I know a lot of people got pissed off at me for talking about like the intrinsic value. I don't know why because I'm not suggesting that that's, you know, GameStop is worth something. But what I'm using that as a benchmark for is like when people ask how far we think GameStop can go down to, to me, using something like intrinsic value is just a really great back of the napkin parameter to use to start with. Because again, like as something starts getting towards its intrinsic value, just about all investors get interested in it. Because then it's not even trading at a premium to future discounts",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 107,
      "start_timestamp": "01:15:42",
      "start_timestamp_seconds": 4542.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=4542"
    }
  },
  {
    "text": "something like intrinsic value is just a really great back of the napkin parameter to use to start with. Because again, like as something starts getting towards its intrinsic value, just about all investors get interested in it. Because then it's not even trading at a premium to future discounts to discounted future cash flow. So because of that, I think it's just a good general tool to use from like overall context. Cedric says 13 is the book value, right? I don't know. So I looked it up on chat GPT and it was a little bit lower than that. Let me see. What is GameStop's current intrinsic value? And I'm using intrinsic. So if you use in book value, that's a little bit different. What is, let me ask that question too, GameStop's current book value. Which I think I have actually. Let's see. Book value per share, three or average is like 10, 403. This is just giving me an average. Book value per share here you go. This is like 438. That's a different metric. So intrinsic value is kind of what the actual price if it unwound entirely. So this says as a 14-og 24, the intrinsic value is estimated to be 845 per share based on DCF. Now a discounted cash flow model is still kind of different. I wouldn't use that in this case because it misses a lot of context. It looks like the other thing that chat GPT is saying is",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 107,
      "start_timestamp": "01:16:41",
      "start_timestamp_seconds": 4601.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=4601"
    }
  },
  {
    "text": "the intrinsic value is estimated to be 845 per share based on DCF. Now a discounted cash flow model is still kind of different. I wouldn't use that in this case because it misses a lot of context. It looks like the other thing that chat GPT is saying is that the intrinsic value ranges between seven, which is not true, an 1109, which I think is a little bit low. But I think using 11 is like a floor is reasonable. Again, it's like a conservative reasonable floor. But to me, I would probably guess it. I haven't ran it yet myself. So I can't tell you. But it's not hard to run. I can download the fundamentals and look at again, like the objective if we were to flatten this entire company, what it was looking at. But in this case, I would guess somewhere around 12. That's my best guess. Like if I were to just swag what I think the current intrinsic value is. Now, the problem with using an intrinsic value like that though is that you also have to take into account the IP intellectual properties, the brand value itself. And this does have that. So that's also another reason why I think it might be a bit higher than those, like generally super conservative estimates, in my opinion. So yeah. Cedric says, now we are 22. So let's six per share different on the books. Right. Well, that's because again, you have to",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 107,
      "start_timestamp": "01:18:07",
      "start_timestamp_seconds": 4687.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=4687"
    }
  },
  {
    "text": "that. So that's also another reason why I think it might be a bit higher than those, like generally super conservative estimates, in my opinion. So yeah. Cedric says, now we are 22. So let's six per share different on the books. Right. Well, that's because again, you have to remember when you're looking at the stock price of something, you're looking at a forward projection. It's an expectation. So right now, this is looking at like the future. This is discounting the future cash flows. This is what we think GameStop will be able to produce over the next six to month timeframe, six to nine month timeframe given what we know now. So it's it's by its very nature a very conservative estimate. So yeah, I think Nola says, intrinsic value includes inventory, physical, real estate, or negative value for a lease. It depends on what model you use. The way that I like to think about intrinsic value is that if it had to start liquidating and essentially like closing out the business, what would the value be per share? So I think about something like a lease, whatever value is remaining on the term of the lease, that would have to be absorbed, that would be negative. But if we're going to unwind the physical real estate, the current market value of the physical real estate would be whatever that value is. So the difference still in the way that I think about intrinsic value is",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 107,
      "start_timestamp": "01:19:16",
      "start_timestamp_seconds": 4756.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=4756"
    }
  },
  {
    "text": "lease, that would have to be absorbed, that would be negative. But if we're going to unwind the physical real estate, the current market value of the physical real estate would be whatever that value is. So the difference still in the way that I think about intrinsic value is that I don't think about like overnight liquidation because that would infer having to do things at like just a gree just prices, right? Because of the time bound constraint, you would have to sell things crazy. So I think of it as like a reasonable time frame for liquidation so that you can get like fair market value for things. So Dan says, I'm all in on GME. Yeah, that's awesome. I like again, from a trader perspective, the trader has to do whatever is right for them. In this case, I don't think GME is positioned poorly. I think that right now it's running again, like kind of consolidation. That's the overall feel that I get here. We're starting to build out this volume node. You can see it breaking out right here that's starting to grow and grow and grow. Just as more people transact here. This was also pretty cool to see people starting to buy in because my original idea, which I was a little bit off, but it's this I haven't moved this price handle, which was like just around 18. So I used 18 just because it looked like near term support based",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 107,
      "start_timestamp": "01:20:41",
      "start_timestamp_seconds": 4841.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=4841"
    }
  },
  {
    "text": "was also pretty cool to see people starting to buy in because my original idea, which I was a little bit off, but it's this I haven't moved this price handle, which was like just around 18. So I used 18 just because it looked like near term support based on what we saw here. And again, like this is not something I added after the fact kind of what we were talking about before I added this before we started getting down here. I added it when we're back up here because I was just curious where things were looking like they were going. So when I see like price move here, but you can see volume expanded that day. So it was 93 by volume at 11 million shares where the average at that point for each day was 12.9 million shares. So that was good to see. That was like a lot of people buying at a specific value area that they thought. So yeah, that's kind of what I think about at least the the recent lower volume periods. The options chains have also been much more quiet than I've typically have seen them, which has been kind of interesting. Again, let me know whatever else you guys want to look at. I'm going to pivot back over to taking a look at the rest of this kind of like the new developments in the case. And then but yeah, like we literally can pivot as",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 107,
      "start_timestamp": "01:21:46",
      "start_timestamp_seconds": 4906.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=4906"
    }
  },
  {
    "text": "been kind of interesting. Again, let me know whatever else you guys want to look at. I'm going to pivot back over to taking a look at the rest of this kind of like the new developments in the case. And then but yeah, like we literally can pivot as much as you guys want. So you can see that there's been a bunch of stuff going on. So the appearances and stuff. Yeah, this is talking about like summons for things. Essentially everything has to be logged, but the interesting stuff is way down here. Down down down down down down. But I think it's attachment five is the exhibit 40. Let me double check. I think this one is the deposition. Yeah, this is the deposition. So let me open this one here. And then all as always give you guys the source so that you can look for yourselves. And we'll grab the text. So let me see if this starts here. I haven't looked through four yet. Yes, so I'm okay, here we go. Let's see what this is. So this is showing price volume data. So we don't have to worry about that. Let's take a look here. Paul and install says been swinging this from the beginning. I'm feeling great and still transferred to the purple circle. Yeah, that's great. I think that's awesome. I think something like GameStop when it's when it has volume, I mean, it has a ton of volatility. It",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 107,
      "start_timestamp": "01:23:00",
      "start_timestamp_seconds": 4980.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=4980"
    }
  },
  {
    "text": "a look here. Paul and install says been swinging this from the beginning. I'm feeling great and still transferred to the purple circle. Yeah, that's great. I think that's awesome. I think something like GameStop when it's when it has volume, I mean, it has a ton of volatility. It moves all over the place. It really is a great trading vehicle. So yeah, Stephen Brown's dropping some random ass stocks in here. So I'm actually going to get rid of those because we don't need that floating around some random ass bullshit. If we want to take a look at it together, I'm down, but that didn't look like it. That look like you're just sharing a random ass name. All right. So let's see. You were investing more money into GameStop. Correct. I've invested since 2019 and never sold my shares to date and you never shorted. No, not even one, not that I believe. You don't like short sellers. That's correct. So the queue obviously is the counter side, the opposition, and then the answer in this case is I don't know how to go in. I believe you sent out a tweet. 15th May saying taxpayer money should be spent cracking down on hedge funds and short sellers. Why did you delete the tweet? I don't think so. So you don't believe that you deleted it. I don't know. Can you show me the tweet? Well, I cannot, because I couldn't find it. It's not there",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 107,
      "start_timestamp": "01:24:25",
      "start_timestamp_seconds": 5065.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=5065"
    }
  },
  {
    "text": "money should be spent cracking down on hedge funds and short sellers. Why did you delete the tweet? I don't think so. So you don't believe that you deleted it. I don't know. Can you show me the tweet? Well, I cannot, because I couldn't find it. It's not there in your page anymore. So then it was deleted. So this is really interesting. The reason why attorneys do this is because they're to like non to the non initiated. A lot of the questions that go down during a deposition can look really stupid. But in fact, they're not stupid. They're very, very, very educated movements that they're making because one of the things that they're trying to do is essentially box in the response is given so that if it goes to trial, they know what he's going to say. And then if he says something else, he looks, it creates a problem, right? Because then they'll say something like, oh, well, you said this during under oath, why is it different now? So that's why they're asking these questions so that if during trial, he contradicts himself in any way, it again will look not good. Mr. Freena, who is obviously Cohen's attorney, says objection form witness. No, I don't remember. Well, let me back up a little bit. Did you delete the tweet? And then so right, like they're trying to box him in just even on this stupid little thing. The other thing to know",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 107,
      "start_timestamp": "01:25:46",
      "start_timestamp_seconds": 5146.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=5146"
    }
  },
  {
    "text": "Freena, who is obviously Cohen's attorney, says objection form witness. No, I don't remember. Well, let me back up a little bit. Did you delete the tweet? And then so right, like they're trying to box him in just even on this stupid little thing. The other thing to know about depositions is that it is literally, it's just a war of attrition. They have a certain amount of time that they can spend with people. And their goal is to ask the same question in as many permutations as they can. And part of it is just becomes, it becomes like a metronome. You feel like you're answering the same thing or you feel like you fully answered a question, but in the attorneys mind you haven't because they want to close out the question. So that's why you'll see stuff like this. It's like really arduous to get through. So Cohen says, I've made multiple tweets and comments about the fact that I do not like both hedge funds and sort sellers. What's the reason for that? I think it's un-American to bet on and to profit from someone else's failure. It's one thing not to invest in someone's success. That's another thing to profit from someone's failure. And I think it's un-American. And it's illegal. And it's legal and they're entitled to it, but I don't like them. Like what a great answer. I literally love that answer. This says, I mean, that's my opinion. I don't",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 107,
      "start_timestamp": "01:27:12",
      "start_timestamp_seconds": 5232.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=5232"
    }
  },
  {
    "text": "someone's success. That's another thing to profit from someone's failure. And I think it's un-American. And it's illegal. And it's legal and they're entitled to it, but I don't like them. Like what a great answer. I literally love that answer. This says, I mean, that's my opinion. I don't feel as people should profit on and bet on somebody else is going to fail and employ tactics in order to increase the odds that they're going to be that they'll end up failing. And that's what a lot of these hedge funds and sort sellers do. Yeah, that's awesome. Why do you feel so strongly about the fact that they're un-American when you're not an American citizen? That's so funny. Mr. Frieda says, objection form. The witness says it's not about being a citizen, being un-American. It doesn't matter about whether it has nothing to do with citizenship. Then, Jofri says, so then has to do with innovation, entrepreneurism. The fact that this is the greatest country in the world, less than 5 of the population is 25 of GDP. So much of innovation come out of America. So then the other side says, let me get to straight. You don't like short sellers. You want the government to crack down on them, but you allowed your lawyers in this case to make filing saying that retail investors were croaked manipulators because they were trying to bet against shorts. objection form. I don't know what my lawyer said. What",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 107,
      "start_timestamp": "01:28:13",
      "start_timestamp_seconds": 5293.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=5293"
    }
  },
  {
    "text": "You don't like short sellers. You want the government to crack down on them, but you allowed your lawyers in this case to make filing saying that retail investors were croaked manipulators because they were trying to bet against shorts. objection form. I don't know what my lawyer said. What I'd say with respect to hedge fund short sellers, I find it ironic that if you have a large position, you just close that long position. But if you have a short, but if you short that position, there's not the same kind of disclosure requirements, which is a really great point. But I believe there should be more transparency. This is just absolutely like I love this. Holland install says the vagueness in RC replies is defining to the ears. I think you might have meant deafening to their ears, hearts and minds. I love it. Yeah. Well, the other reason why he would answer like this is because if he's talking about like a previous recollection of some time ago, again, like he also doesn't want to contradict himself. So his council, they will coach him on how to answer all of this stuff. So that's why a lot of the responses are going to be broader in nature because he's again, being advised by really smart attorneys and he's doing his best to fall in line with again, the coaching that he got. But you said more than that, they're against entrepreneurship on Americans. So it's not",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 107,
      "start_timestamp": "01:29:18",
      "start_timestamp_seconds": 5358.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=5358"
    }
  },
  {
    "text": "lot of the responses are going to be broader in nature because he's again, being advised by really smart attorneys and he's doing his best to fall in line with again, the coaching that he got. But you said more than that, they're against entrepreneurship on Americans. So it's not just about the disclosures. It's more than right. More than that, right? And then the attorney, the opposition says, so I'm going to back to the questions about the filing in this case. Are you aware that there's a motion for class certification that's pending in this case? He asks, do you understand what it is? Then Mr. Farina, which is Cohen's attorney says, I don't think he can have an understanding other than what he obtained from council. Then the other side says it's a public document. He can have an understanding of a public document. And then he goes on to say, unless Mr. Farina tells you not to address my question, you have to address my question, would you like me to repeat it? Then Farina says, well, if you can address the question without anything that you've learned from your lawyer, why don't you go ahead and repeat the question? So they asked the question again, have you read the motion for the certification and what's filed in this case? So now the attorneys are going back and forth. I'm not going to go through all of that. So right now what they're trying to do",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 107,
      "start_timestamp": "01:30:14",
      "start_timestamp_seconds": 5414.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=5414"
    }
  },
  {
    "text": "and repeat the question? So they asked the question again, have you read the motion for the certification and what's filed in this case? So now the attorneys are going back and forth. I'm not going to go through all of that. So right now what they're trying to do is they're playing a game of like gotcha, right? They're just trying to see if they can get them to say something or do something. And I think, yeah, they're just trying to play gotcha, which is just super annoying. My question was, are you were the fact that your attorneys in your name have argued that the fact that people couldn't short BBB Y stock enough meant that the market for that stock was inefficient? So for those that don't know, one of the arguments for efficient markets is the ability to short things because sometimes we know traders can bid things up to nosebleed levels and sometimes it's based on like FOMO euphoria. It's not based on the actual value of the company itself necessarily. So one of the arguments for short selling is that it does technically make markets more efficient by starting to press down some of that value until enough people oppose the selling value, which would likely denote some sort of equilibrium where we both agree the short sellers are like, okay, well, there's enough buyers here. I can't press it down anymore. So this is where people actually think the stock is worth.",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 107,
      "start_timestamp": "01:31:27",
      "start_timestamp_seconds": 5487.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=5487"
    }
  },
  {
    "text": "of that value until enough people oppose the selling value, which would likely denote some sort of equilibrium where we both agree the short sellers are like, okay, well, there's enough buyers here. I can't press it down anymore. So this is where people actually think the stock is worth. That's kind of the general argument behind it. So they're just fighting back and forth. I think we can skip through some of that. This they're talking about attorney, client privilege, right? So they're not talking about answering conversations behind these. Alfonso says not for nothing, but Cohen bought his most recent shares in GM E in March 22 and then liquid dated all BBY shares five months after mid August in 22 RC ventures, most recent 30 F only holds GM E. Yeah, well, I think in this case, a lot of that is because he realized that he was going to run into structural issues when he was trying to get kind of start angling into best buy. That was going to cause him problems. So I think that's why he started his unwind. Ars says, what stops shorting from just being bidding down problems the way bidding up was a problem. It's inefficiency in both directions, isn't it? Well, that's the idea, though, is that because both directions are possible is that it would gain efficiency. So again, you can have something to your point that gets bid down like, for example, a great example of this,",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 107,
      "start_timestamp": "01:32:36",
      "start_timestamp_seconds": 5556.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=5556"
    }
  },
  {
    "text": "up was a problem. It's inefficiency in both directions, isn't it? Well, that's the idea, though, is that because both directions are possible is that it would gain efficiency. So again, you can have something to your point that gets bid down like, for example, a great example of this, I think, is crowd strike. And again, full disclosure, I traded this because this movement. So this was bid down into the dirt until people started to buy it. And then now it's obviously moving back up towards some sort of accepted value, broad accepted value for the price of the underlying. Now this will happen, though, because of information in discreteness, it takes time for information to permeate through a market and then to be positioned by people. So this kind of thing, again, is because I sold this short to the downwind and sell it short, I don't typically use that. I use options to trade it to the downside. But as it's running to the downside, then there's a bunch of different reasons why this gets sent down so far until enough buyers start to step in. They're like, okay, well, I actually really like this all the way down here at 200. So the short seller start to get tired. This movement becomes the representation of the failure that they had in the systems, which overall to me didn't look quite that pervasive. So ape of spade says we already have that it's called selling not",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 107,
      "start_timestamp": "01:33:45",
      "start_timestamp_seconds": 5625.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=5625"
    }
  },
  {
    "text": "the way down here at 200. So the short seller start to get tired. This movement becomes the representation of the failure that they had in the systems, which overall to me didn't look quite that pervasive. So ape of spade says we already have that it's called selling not so much. Selling again, it doesn't have the same effect as shorting because selling it's almost like the removal of something, but it's not the active suppression of something. So they're kind of different effects. I wouldn't equate the process of like selling out of a position as short selling. Apospeed says supply and demand can still exist. Yeah, of course. Yeah, no doubt. There's absolutely no doubt. Again, I'm not arguing that short selling has to exist. I'm not saying that at all, but I'm simply talking about the way that people and again, like from an objective analysis standpoint on why it's argued that short selling increases market efficiency, because again, like arguably it does. So to ape of spade's point, and I get the point totally, that essentially we can get to a point where like here that enough people are like, okay, I don't think crowd is, crowd strike is worth more than this. So then from here, they stop buying and then price naturally could start to drift sideways. But if you have people that can actively sell against it, the process would happen faster because there's kind of a counter opposing force. Ars says",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 107,
      "start_timestamp": "01:35:04",
      "start_timestamp_seconds": 5704.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=5704"
    }
  },
  {
    "text": "is, crowd strike is worth more than this. So then from here, they stop buying and then price naturally could start to drift sideways. But if you have people that can actively sell against it, the process would happen faster because there's kind of a counter opposing force. Ars says I'm not arguing against short selling. I'm just skeptical of efficiency arguments. I don't know why. I mean, the the process of identifying like activities that make markets more efficient are kind of easy and clear to see. Now, the secondary and tertiary effects of those obviously is up for debate. And then whether or not we like the practice in and of itself is obviously up for debate. But again, like I can look at something like payment for order flow. And that's it's objectively made markets more efficient. We might not like it. We might not like elements of it. I don't. I think it creates some fucked up incentives. But I can still look back 50 years. And I can say markets now are more efficient. And one reason for it, I'm not saying the only reason, but one reason for it is because of payment for order flow. So if you have people competing to obtain order flow, that competition will make things slightly more efficient. Your order execution, your bit asks spread, your price improvement. Again, I don't think payment for order flow is great. I think there are better systems. It's not my favorite",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 107,
      "start_timestamp": "01:36:27",
      "start_timestamp_seconds": 5787.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=5787"
    }
  },
  {
    "text": "order flow. So if you have people competing to obtain order flow, that competition will make things slightly more efficient. Your order execution, your bit asks spread, your price improvement. Again, I don't think payment for order flow is great. I think there are better systems. It's not my favorite thing in the world. But it's not it's not the again, like the the boogie man, um, ape of spade says with efficiency can comes conflict of interest. Why I think anything related to financial markets is going to bring conflict of interest. So yeah, R says I don't think market participants are motivated in their moves to make markets objective. I think profit is created from differentials from price movement. So to profit, you want price to move, right? I'm not totally following the first part of your argument there. But yeah, for the second part, I would agree with you that in order to make money, you would want price to move in some sort of direction. If you're buying equity or selling equity, if you're buying or selling a product, you would want it to move. I agree with that. Yeah. Dr. Zay says more efficient in this context is a step in the wrong direction for most people. Yeah, again, I'm not sure I would fully agree with that. I like markets now more than when I first started trading. I and that's for a bunch of different reasons. Not only is it cheaper from a",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 107,
      "start_timestamp": "01:37:36",
      "start_timestamp_seconds": 5856.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=5856"
    }
  },
  {
    "text": "this context is a step in the wrong direction for most people. Yeah, again, I'm not sure I would fully agree with that. I like markets now more than when I first started trading. I and that's for a bunch of different reasons. Not only is it cheaper from a commission standpoint, but I get better fills. Markets are now much narrower. So yeah, I mean, for me, I think markets being more efficient now is good for me. So again, like if that's the ultimate stop or if people want it to be more efficient, I think that's a completely fair argument. And I think we're in a position that markets can be more efficient than they are now. I agree with that. Willie says can it be argued that payment for order flow contributes to monoplystic practices? I agree. Yeah. Now places like Citadel and Virtue, they're not necessarily the only entities that can enter or can run payment for order flow. Other people can enter that market, but it's really competitive and it's hard to break into. It's kind of like the search engine market, right? Like could there are there competitors for Google? Sure. But it's really difficult to compete in that space. That's what makes Ryan Cohen, I think so fascinating because he was able to compete with Amazon with something like Chewie, which is not an easy online market, especially from a logistics standpoint. So that kind of thing is crazy that he was",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 107,
      "start_timestamp": "01:38:50",
      "start_timestamp_seconds": 5930.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=5930"
    }
  },
  {
    "text": "really difficult to compete in that space. That's what makes Ryan Cohen, I think so fascinating because he was able to compete with Amazon with something like Chewie, which is not an easy online market, especially from a logistics standpoint. So that kind of thing is crazy that he was able to do what he was and he was very successful. So yeah, I think that Willie, to your point, I agree with that. But Willie says payment for order flow itself is not a bad thing in itself, but when a handful of firms that have that power, it can be abused. Absolutely zero debate. Completely agree with that. I also would even take that argument a step further and say that payment for order flow itself is I actually don't love that as an incentive. I think it should be an open competition for order flow. Like I don't think it should be bundled because from an execution standpoint that actually disincentivizes the optimal order routing for your transaction, which is really frustrating. But again, like even though that's the case, the order routing, even though it's not optimal, it's still better than what it was. This is the nature of the game is that it's not exactly black and white. There are shades of gray that have to be considered, I think, in order for it to be like a good discussion about the structure of markets. So I completely agree with you, Willie. I think that",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 107,
      "start_timestamp": "01:40:03",
      "start_timestamp_seconds": 6003.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6003"
    }
  },
  {
    "text": "the nature of the game is that it's not exactly black and white. There are shades of gray that have to be considered, I think, in order for it to be like a good discussion about the structure of markets. So I completely agree with you, Willie. I think that anytime you have money involved, lots of money, there's going to be bad actors. That is how it's always going to go. As soon as there are large buckets of money that are accessible, there will be bad actors. I guarantee it. Always going to be the case. And that's just how things go. Like the people that want to try to take advantage of things, they're always there. And they shape shift over time, but they're still there. They just take different forms as things evolve. Fonsus is home computers and the internet have brought efficiency. I remember my dad getting phone calls it dinner to confirm his traits that he placed by his phone earlier. Yeah, that's hilarious. That's so true. Beach says, who do you have in the UFC main event tonight? I don't know who's in the UFC tonight. I was looking at the Craig Jones invitational first. I really want to see him in Gabby, because I just think that's going to be hilarious. I also want to know who won it. I haven't I was watching yesterday's stuff earlier. So let me see it. The UFC card tonight was that is that easy and",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 107,
      "start_timestamp": "01:41:10",
      "start_timestamp_seconds": 6070.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6070"
    }
  },
  {
    "text": "invitational first. I really want to see him in Gabby, because I just think that's going to be hilarious. I also want to know who won it. I haven't I was watching yesterday's stuff earlier. So let me see it. The UFC card tonight was that is that easy and do plusy tonight? Or am I making that up? It is. Oh man. Man, that's a toughy. That is such a tough. That is such a tough card. Who's the what are the odds on it? So it has is easy. It is easy is the minus 130. I could see that. I mean, from a striking perspective, I would have to give it to Izzy from a striking perspective. No doubt. But Izzy, I feel like he hasn't really been showing up as he like as good as he has been. Even like that fight with Strickland showed that. So it would not shock me to see do plusy win. But like I would have to agree with the odds on Izzy. I think that that's a fair I think that's a fair line. Now you got me looking at oh, how did Jenkins do? He won. That's good. I'm glad Jenkins won. All right. I'll get out of UFC. You fucking sent me down a tangent. You always know I'm down to look at some fight stuff. But yeah, I would I would have to lean towards Izzy personally. All right. Let's poke through this a little bit",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 107,
      "start_timestamp": "01:42:21",
      "start_timestamp_seconds": 6141.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6141"
    }
  },
  {
    "text": "I'm glad Jenkins won. All right. I'll get out of UFC. You fucking sent me down a tangent. You always know I'm down to look at some fight stuff. But yeah, I would I would have to lean towards Izzy personally. All right. Let's poke through this a little bit more. And then I want to take a look at Chewy a little bit. No, it says Chewy calls when kind of crazy Friday afternoon. Yeah, we'll take a look at that for sure. I'm trying to see if there's any other like really interesting bits that they got out of here. This looks interesting. Q. No, it's in it. But I think that my question is a little different, which is when it comes to those people who interpret your tweets, like the ones you discussed with Joe Fonacelo, like people on Twitter who respond with your tweets, you've never tried to correct them in any way and say that you are misunderstanding what I meant. My tweets are just being or just me being me there. I don't know what tweets you're referring to. I don't know what comments you're talking about. And you're again, you're talking about people as in they are speaking in generalities. So if you have a specific question, I'll answer it, but I don't understand these generalities. It's impossible to answer the question. That's a great, that's a great response, by the way. So right now, it seems like what they're trying to",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 107,
      "start_timestamp": "01:43:56",
      "start_timestamp_seconds": 6236.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6236"
    }
  },
  {
    "text": "people as in they are speaking in generalities. So if you have a specific question, I'll answer it, but I don't understand these generalities. It's impossible to answer the question. That's a great, that's a great response, by the way. So right now, it seems like what they're trying to do is to start creating a line between his tweets as possible drivers of movement. And in this line of questioning, they're trying to say, well, you're not necessarily outright saying, you know, you listen to these things of what I'm doing, but you're also not correcting people when they're misinterpreting your stuff. So they're trying to catch them with like the null is what that looks like, which is against super annoying. I'm specifically referring to Twitter, yes, in which comment on Twitter and which posts that I make any comment, do you recall even one instance? I rarely reply to my comments. Sure, that's not my question, Mr. Cohen. Do you recall even one instance where you posted something in someone interpreted a meaning and you said, that's not correct? I don't remember. That's hilarious. And it looks like the reporter needed to take a break. There. Can we focus on the final sentence here in the third paragraph? You know the one that started with as a role model among apes? We talked that about it already. You know, in that final sentence here, yeah. When it says any news about the investors often enough to generate",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 107,
      "start_timestamp": "01:45:23",
      "start_timestamp_seconds": 6323.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6323"
    }
  },
  {
    "text": "we focus on the final sentence here in the third paragraph? You know the one that started with as a role model among apes? We talked that about it already. You know, in that final sentence here, yeah. When it says any news about the investors often enough to generate positive sentiment among apes active on Reddit, hey, shout out to you guys. Do you see that? Yes. Okay. Now have you seen another article saying that they have that specific thing that we just read to you? I don't remember. Okay. But you may have no. I meant I don't. What I said is I don't remember. Okay. Now you've never eat. Now you've never gone. Shit, I fucked that up. Sorry. Now you've never gone ever publicly and said, I'm not a role model for the apes. I don't believe so. Okay. And you've never gone and publicly said, I've never said I'm a role model for the apes either. Please let me finish my question. That's just jockeying for a position. You never gone and said that you're not influential among this community of retail investors. I've never said that I was. That wasn't my question. You've never said that you weren't. Correct. So that that's all this is they are trying to catch him with noils, right? Because obviously like who would go on social media? And for example, with Jeffrey Epstein and all the bull crap that he did did everybody have to go on",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 107,
      "start_timestamp": "01:46:33",
      "start_timestamp_seconds": 6393.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6393"
    }
  },
  {
    "text": "never said that you weren't. Correct. So that that's all this is they are trying to catch him with noils, right? Because obviously like who would go on social media? And for example, with Jeffrey Epstein and all the bull crap that he did did everybody have to go on social media and be like, I don't agree with that. No, like it's kind of inherent that what the did what the dude did was shitty. And it was like most people don't agree with that. So in this case, they're they're trying to start lining them up for well, you've never explicitly said, you're not this thing, which is crazy. Absolutely crazy, especially because the way he communicates on Twitter or X, right? Like if you look through his stuff, a lot of it is jokes like this. Like he's just playing games. So that's like the whole the whole point of he's a troll. So this is kind of nuts. Okay, you have publicly said nothing in fact to assert that you do not influence stock prices like this. Who would go out of their way to say like I don't influence stock prices? I don't believe so. And you've never said that I Ryan Cohen don't generate positive sentiment among meme stock investors on Reddit. This I never said I do, but you've never said I didn't, right? I don't believe so. So you never contested any of. So then he goes into investment advice stuff. My",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 107,
      "start_timestamp": "01:47:40",
      "start_timestamp_seconds": 6460.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6460"
    }
  },
  {
    "text": "And you've never said that I Ryan Cohen don't generate positive sentiment among meme stock investors on Reddit. This I never said I do, but you've never said I didn't, right? I don't believe so. So you never contested any of. So then he goes into investment advice stuff. My question wasn't about, you know, whether you should provide an investment advice, your question is putting words in my mouth. Yeah, yeah, you're this, honestly, this, this from the door, leave that. This from the attorney is hilarious from the opposing counsel. This is this is literally hilarious. You're giving me a justification for why you didn't do this. I understand I'm not interested in I don't care. It's just a funny line from the from the opposing counsel. Alfonso says, must trolls much, much harder than Cohen must absolutely does. That's the funny part is that a lot of these guys are just trolling, but in this case, they're trying to they're trying to use it against them. My question is very, very simple. You've never gone and said something like, you know, please stop saying that I generate positive sentiment against these so-called apes on Reddit. You never done that answer. I've answered your question, which is a yes that you've never done it. I answered your question. What was the answer? Is it a yes or no? It's a simple yes or no. You can go through the transcript and you'll see my answer. Well, I think",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 107,
      "start_timestamp": "01:49:04",
      "start_timestamp_seconds": 6544.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6544"
    }
  },
  {
    "text": "done that answer. I've answered your question, which is a yes that you've never done it. I answered your question. What was the answer? Is it a yes or no? It's a simple yes or no. You can go through the transcript and you'll see my answer. Well, I think you said yes to some of the things and I don't know why you're struggling so much with this one. Again, this is this is quintessential. They're trying to fatigue him. That's why Cohen is starting to answer like this because he's starting to become slightly belligerent and this actually doesn't normally bowed well for his argument because it does make him start to look slightly belligerent. I would understand why I would be furious with this. This would get so old, so fast, but it's also it's part of the game and it's why they're doing this. Is they're purposely trying to they're trying to do this? So then when I told you have you ever said for instance that you don't have influence on stock prices, you said that you haven't. So this is a very similar question. It's just about a different topic, which is have you ever said that you don't generate positive sentiment among the apes on Reddit publicly? I don't know. You haven't, right? No, I mean, I don't know. You don't recall any instance, right? So again, this is them trying to close out the topic. Recall any instance. It's very purposely phrased",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 107,
      "start_timestamp": "01:50:25",
      "start_timestamp_seconds": 6625.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6625"
    }
  },
  {
    "text": "ever said that you don't generate positive sentiment among the apes on Reddit publicly? I don't know. You haven't, right? No, I mean, I don't know. You don't recall any instance, right? So again, this is them trying to close out the topic. Recall any instance. It's very purposely phrased like that. These these can seem like really stupid questions and they kind of are in a sense, but they're really calculated. I just try to remind you guys of that because some people can look at this and kind of just think like, oh, what what is all this buffoonery? But it's actually really, really tactical what they're trying to do. You don't recall any instance. You can't tell me one example where you have publicly said it. I don't know. Okay. I don't remember every single thing that I've said. So then very, very short transformation that the company, especially going into a macro time, a lot of uncertainty given the balance. She you see all that, right? Yep. So he's obviously talking about a specific documentation or tweet that he said. He said, so when you said that, I you, is it true that you said that to the company did not have the balance sheet to transform the business answer. I don't remember exactly. These are not my notes. Okay. But do you believe that the company did not have the balance sheet to do a transformation? I believe that the company was doing a lot",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 107,
      "start_timestamp": "01:51:31",
      "start_timestamp_seconds": 6691.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6691"
    }
  },
  {
    "text": "to the company did not have the balance sheet to transform the business answer. I don't remember exactly. These are not my notes. Okay. But do you believe that the company did not have the balance sheet to do a transformation? I believe that the company was doing a lot worse than I expected and losing a lot of money. I didn't have visibility obviously into the future trajectory, but based on what I saw in the previous corner, the company was using a lot of money. So again, they're trying to now tie Cohen to the perception of the stock, which was one of the things if you remember from the first document that they're trying to contest that they were providing a skewed perception of the stock. Let's see. The final section of the page here says again, is attributed to you. It says RCD. Do you see that? But operationalizing a plan. You see that. So it says, but operationalizing a plan SGNA at 33 is insustainable in GM contracting by 400 BPS. So back to SGNA mid 20 will involve pretty significant changes in the company, given the macro backdrop we're heading into probably some big changes. Is it true that you wanted the company to come back to cut back on its SGNA expenses to get it down to the mid 20? I wanted them to reduce expenses. Yes, to mid 20. I mean, that sounded like a good target. That number happened while you",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 107,
      "start_timestamp": "01:52:38",
      "start_timestamp_seconds": 6758.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6758"
    }
  },
  {
    "text": "changes. Is it true that you wanted the company to come back to cut back on its SGNA expenses to get it down to the mid 20? I wanted them to reduce expenses. Yes, to mid 20. I mean, that sounded like a good target. That number happened while you were invested. Correct? I don't believe so. And then the answer says, and then over here, does this jog your memory where it says we scrap the 2020 plan? I don't remember that. I think it was, and this is a funny comment. I think this was 150 page. God knows what they paid McKinsey to to talking about how they were going to have private label, all kinds of things. And I thought it was crazy. And I said in the letter, I thought it was crazy. Did it? But they never changed their behavior. So they're just going back and forth now about the operation of the company and how it was doing. Let's see. So this one says, so you wrote, given that I'm going to be in the market buying, I'd like to cancel the call and ask her to speak next week. No, let's says so as an activist investor, he RC ran into resistance from the board on the direction he was interested in taking the company that definitely seems part of it. I don't know exactly what ended up making him divest. So let's see. I'll ask Chattat Gpt. When Ryan Cohen bought",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 107,
      "start_timestamp": "01:53:40",
      "start_timestamp_seconds": 6820.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6820"
    }
  },
  {
    "text": "so as an activist investor, he RC ran into resistance from the board on the direction he was interested in taking the company that definitely seems part of it. I don't know exactly what ended up making him divest. So let's see. I'll ask Chattat Gpt. When Ryan Cohen bought into BBBY, what ended up making him divest? Let's see what that comes up with. After initially buying into the company earlier that year, the decision to the FS was interested influenced by a combination of factors, including the lack of substantial progress in turning around the company, as well as growing concerns about the financial stability. So I think there was a lot more to it than that. I don't remember all the details, but I know that there was a significant change in the backdrop. And he definitely didn't like the direction that things were going. Now I also think that there was a couple of forcing functions that came with his size that he came in at. And then what he was trying to grow up into. A fun says, but the lawsuit asked for a return of short swing profits on his sale of BBBY Shales Persection SEC rule 16B. Yeah. Alfonso says, I don't see any impact on GME. Well, I think the impact that this can have on GME is that while Ryan Cohen is wrapped up in any sort of litigation, it just is immediately going to complicate other stuff that he does",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 107,
      "start_timestamp": "01:54:42",
      "start_timestamp_seconds": 6882.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6882"
    }
  },
  {
    "text": "Persection SEC rule 16B. Yeah. Alfonso says, I don't see any impact on GME. Well, I think the impact that this can have on GME is that while Ryan Cohen is wrapped up in any sort of litigation, it just is immediately going to complicate other stuff that he does to your point. I don't think that this prevents him from running GME. I don't think that this has a direct impact on GME. But I would kind of I would frame it that there's a secondary and a tertiary effect that this will have on GME. Just again, in the sense that the CEO of GME is wrapped up in this other litigation. So even down to as simple as this is something on the back of his mind that he has to deal with while he's trying to run another company that again, like we have to be honest with ourselves. GameStop has to innovate here. It has to change things quite a bit in order to kind of really rise into what it can be. And that requires a ton of effort. And for most CEOs, that is a full time effort. It's not like I have to spend 30 of my time dealing with this case and then 70 of my time trying to grow this company. Most of those kinds of transformations take like the majority of effort. So even from just a drain perspective, this in my opinion will have an impact. Hopefully, and",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 107,
      "start_timestamp": "01:55:57",
      "start_timestamp_seconds": 6957.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=6957"
    }
  },
  {
    "text": "to spend 30 of my time dealing with this case and then 70 of my time trying to grow this company. Most of those kinds of transformations take like the majority of effort. So even from just a drain perspective, this in my opinion will have an impact. Hopefully, and I think so far he's done a great job. Like he's obviously super resilient. This isn't like killing him or anything. You can even tell from the way that he's trolling and still having fun. But again, it's just in the backdrop. It's something that's there. Raspberry pizza says it's the BBYC in the board leading up to the bankruptcy that totally misled people that need to be sued straight up lies. That's kind of the general thing that I've been noticing. It looks like he's been wrapped into this for a few different reasons. So here, they're he's talking about like what he's gotten into and why. This is interesting. Did you know, did you question her about whether there was bankruptcy risk? I don't believe so. So we'll show you one dot. So this is also really common, which is super annoying. So a lot of times in these kind of depositions, the council will ask you about something that they already have shit on and they won't show it to you unless you ask for it and you know to ask for it. So in this case, when he said, you know, did you question her about",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 107,
      "start_timestamp": "01:57:02",
      "start_timestamp_seconds": 7022.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=7022"
    }
  },
  {
    "text": "these kind of depositions, the council will ask you about something that they already have shit on and they won't show it to you unless you ask for it and you know to ask for it. So in this case, when he said, you know, did you question her about whether there's bankruptcy risk? I don't believe so. And then he says, oh, well, let's take a look at this document. Right. So it's like those kinds of things are really, really frustrating because it's so easy than to double back on yourself unnecessarily. I'm just seeing if there's anything else that like really sticks out to me as I scan through it. This overall just looks like kind of a standard deposition. I like a lot of the things that Cohen said. I think he's handling it overall really, really well. But as you can tell, it's just tiring. Like it's just annoying to go through this. If you're going to ask him about the motion, then show him the motion and ask him whether it's like this is another, that's funny that I stopped here. This is another like very specific example about this very specific thing. So he said, the next thing I want to just, are you aware of the factual representation on your behalf that were made in the motion to dismiss about this tweet? Right. So like, again, he's asking him about a document and he hasn't shown him the document. So his lawyer",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 94,
      "total_chunks": 107,
      "start_timestamp": "01:58:11",
      "start_timestamp_seconds": 7091.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=7091"
    }
  },
  {
    "text": "he said, the next thing I want to just, are you aware of the factual representation on your behalf that were made in the motion to dismiss about this tweet? Right. So like, again, he's asking him about a document and he hasn't shown him the document. So his lawyer is like, yo, if you're going to ask him about this thing, then show it to him and then ask him about it. So for instance, I would suggest you take the document if you want to ask him about it. Right. So yeah, it's just like standard super annoying lame practice, but it's how it gets done. This stuff is so annoying, man. Oh, I saw the word trading. Hold on, I got to look. You want to know how long this will take? Am I prevented from trading? In the mean time, can this be done today? The answer I was not trading. So then they're saying they're questioning. So then why were you telling him that you, why were you questioning him about whether or not you could prevent from trading? Because my bank told me that I was prevented from trading. I told him what the bank said. Okay. And why did you contact the bank? Because I was interested in being able to trade. Being able to trade and do what? That being able to trade, sell, depending on the price. So you were thinking of buying shares on this day, depending on what the",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 95,
      "total_chunks": 107,
      "start_timestamp": "01:59:22",
      "start_timestamp_seconds": 7162.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=7162"
    }
  },
  {
    "text": "bank said. Okay. And why did you contact the bank? Because I was interested in being able to trade. Being able to trade and do what? That being able to trade, sell, depending on the price. So you were thinking of buying shares on this day, depending on what the price would have been. So they're going back and forth now about like this trading thing. Did you have a thought in your head on this day that you might be that you might buy shares of BVY? My dog is letting me know I need to open the door. I think for him, he's going to go now how and I'm going to text my wife real quick and ask her to feed him. Because I believe that's what he's looking for. He's looking for his dinner, rightfully so it's about dinner time. I think my barbecue should be here in a little bit. Depending on the price, which what he would have done obviously, but my question is nothing to do with the response. My question was whether at any point you thought about buying shares on August 15th. I don't remember what I was thinking on that day. Okay. So since it's based on your testimony, then you obviously didn't tell Nebel on this day that you were selling shares correct. I was not selling shares on that day. So you only told him that you were trading. I told him what's in the email that you",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 96,
      "total_chunks": 107,
      "start_timestamp": "02:00:27",
      "start_timestamp_seconds": 7227.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=7227"
    }
  },
  {
    "text": "day. Okay. So since it's based on your testimony, then you obviously didn't tell Nebel on this day that you were selling shares correct. I was not selling shares on that day. So you only told him that you were trading. I told him what's in the email that you were contemplating trading. He was in communication with the bank that I was contemplating trading and that I wanted the option to be able to trade. So this is just this is going back to trying to contradict his intent. They're trying to say like you were doing this one thing but you were talking about this other thing. I wonder what the average duration is for a deposition because I actually think there's rules about how long it can go for. How long can a deposition go for? The duration can vary widely depending on the complexity, the number of parties, generally depositions last a few hours but they can extend to a full day or even multiple days. In federal cases, there is typically a seven hour limit for a deposition in a single day unless the court orders otherwise. Although however the parties can agree to extend this time if necessary, that's brutal man. They imagine doing this for seven hours. Seven hours. Shit. Again, this goes back to to I think it was Alfonso's point about the impact to me. That's an impact. Man, I'm fatigued just trying to read this. You can see he's starting",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 97,
      "total_chunks": 107,
      "start_timestamp": "02:01:37",
      "start_timestamp_seconds": 7297.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=7297"
    }
  },
  {
    "text": "this time if necessary, that's brutal man. They imagine doing this for seven hours. Seven hours. Shit. Again, this goes back to to I think it was Alfonso's point about the impact to me. That's an impact. Man, I'm fatigued just trying to read this. You can see he's starting to get more and more frustrated. Literally even in his written responses, I can see him becoming more belligerent. That's my statement. Those are not my words. These are his. He's becoming more and more belligerent. Right. Fully so. I would be too. This is absolutely exhausting to deal with. How does this end? I just feel like this. I just feel like even the council is getting upset. It's not surprising. So anyways, that looks like the heart and soul of the overall deposition, which bam, bro. I just opened that one. I'm just seeing if there's anything else interesting in here. Yeah. A sedric is asking for the link again. You got it. Here is the link right there. You got it, Cedric. Anything else we want to take a look at? That was kind of fun. I wanted to spend a little time going through the case just because I was really interested to again, learn a little bit more about how he handled the situation, what it looked like, what kind of things they're talking about. And also to Alfonso's point, what kind of potential impacts that I think it could have in his operation of",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 98,
      "total_chunks": 107,
      "start_timestamp": "02:02:49",
      "start_timestamp_seconds": 7369.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=7369"
    }
  },
  {
    "text": "just because I was really interested to again, learn a little bit more about how he handled the situation, what it looked like, what kind of things they're talking about. And also to Alfonso's point, what kind of potential impacts that I think it could have in his operation of something like GameStop. If there's any potential carryover and again, I don't really see a lot of that. I just see a really arduous, annoying process to have to tolerate. That's what it looks like. It doesn't look fun. It looks like a lot of effort that goes into answering the same questions over and over again, which looks like pretty freaking fatiguing to me, to be honest. So that's what I have for that. Now the other thing I did want to look at quickly before I wrap is Chewie. And it's because Chewie has been starting to gain some legs, little bit different here. And you can see where I got interested in Chewie. So as soon as it broke above this 2524 handle is when I started biting a little bit. I don't have a big position, but I definitely am interested in seeing where this runs to the upside. If it does, and I mean, if it stops me out at 2524, I don't really care. It's not really... It's not going to hurt me. That would just be flat on the trade. Razberry says nice to see RC in action. Dudes and mystery amazed that",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 99,
      "total_chunks": 107,
      "start_timestamp": "02:04:36",
      "start_timestamp_seconds": 7476.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=7476"
    }
  },
  {
    "text": "to the upside. If it does, and I mean, if it stops me out at 2524, I don't really care. It's not really... It's not going to hurt me. That would just be flat on the trade. Razberry says nice to see RC in action. Dudes and mystery amazed that he even did that GME interview. Yeah, I agree. Because that's an exactly to your point, Razberry. Because we don't have a chance. He's not doing stuff like this. He's not jumping on a bunch of live streams. He's not doing a ton of other things. Afonzo says, is this for non-payment of BCG for consulting services? It's completely different. I think that's already done and gone. The... This case is clearly more so about manipulation. So they're trying to frame it as if he knew BBBY was doing terribly, and he was putting out a different message so that then he could sell his shares for a profit. That's essentially what they're trying to say. So... I think that other madness with BCG is a completely different thing. I think that was like 30 million or something in unpaid stuff to them, which up to that was pretty interesting. But yeah, anyways. So, Chewie's been looking interesting. It does have earnings coming up on the 28th. So that's part of the activity that you see there. And then GME has earnings still coming up on what is it the 4th? September 4th, I believe. I don't know why it's",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 100,
      "total_chunks": 107,
      "start_timestamp": "02:05:41",
      "start_timestamp_seconds": 7541.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=7541"
    }
  },
  {
    "text": "But yeah, anyways. So, Chewie's been looking interesting. It does have earnings coming up on the 28th. So that's part of the activity that you see there. And then GME has earnings still coming up on what is it the 4th? September 4th, I believe. I don't know why it's not showing up on this one. Normally it does. Let me... Yeah. It might be just because there's too much crap on here right now on this one over here. But yeah. So this... And the reason why that's been so interesting is because the expiration that contains earnings is so low. I would expect this to be much higher, but it's not. I haven't really been able to make quite heads or tails on that just yet. But you can see that the options chain has now just become so anemic after everything from the past week was stripped out. The bulk, obviously, of the volume was in the last expiration cycle. And now you can also see that the open interest across the board is just a crap shoot. It's all over the place. But the bigger positions are actually pretty far out in time. There's 17 Jan 25. Like we don't have a bunch here yet in 23. The next primary expiration is 27, which there's just not much build out yet. Nola says it makes all the social media post up for microscopic scrutiny even up to today. Absolutely. Yeah, absolutely. That's one of the most",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 101,
      "total_chunks": 107,
      "start_timestamp": "02:06:47",
      "start_timestamp_seconds": 7607.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=7607"
    }
  },
  {
    "text": "25. Like we don't have a bunch here yet in 23. The next primary expiration is 27, which there's just not much build out yet. Nola says it makes all the social media post up for microscopic scrutiny even up to today. Absolutely. Yeah, absolutely. That's one of the most annoying parts about that. It essentially makes everything under scrutiny. Even if he was texting with his friends and having like a standard joke between friends, that can be added as evidence for whatever reason. I'm not saying it in this case, but in general, they'll purposely go through literally, literally everything, which is super annoying. Now, to your point, though, it's also, I think, one of the reasons why he's trolling the way that he is because it's kind of continuing to second the fact that he's a troll. He enjoys just playing jokes and not taking it super seriously. Raspberry says, hoping to get out of my 20 steps unscathed and throw that into Jan's. Yeah, the problem with 20 step is depending on the position, you're going to start running into pretty accelerated faded decay. So, Fonsus says, Chewie volume doesn't see to be linked to share price. What do you mean? Chewie. What do you mean? Willis? It looks like it's definitely linked here. Big drive up here. Big drive up here here. I think it does. We talk about this move, even this move. It's important to, I think, it's important to keep things in",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 102,
      "total_chunks": 107,
      "start_timestamp": "02:08:28",
      "start_timestamp_seconds": 7708.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=7708"
    }
  },
  {
    "text": "price. What do you mean? Chewie. What do you mean? Willis? It looks like it's definitely linked here. Big drive up here. Big drive up here here. I think it does. We talk about this move, even this move. It's important to, I think, it's important to keep things in context. So, this move here, the 20-day average volume is going to be super skewed by this stuff. So, let me grab this really quick. I have another version of this. Is this... Yeah, okay, this is the right one. So, I'm just going to swap it out so that you can see a little bit. But, Fonsus, what's your specific question? Because to me, I actually don't... I don't follow your point. Because to me, I feel feel like it's there. No, it says those are pure green volume. Exactly. So, to me, it's like massive, massive buying pressure. If I change... Where am I at? Oops. So, if I change this, let's do, instead of 20, let's do what the past... 10 days looks fine. So, if you do 10-day, M-A there. Yeah. So, even this is exceeding the 10-day average. So, like, the previous 10 days in here, which is getting rid of this. But, the volume on this day was 4.8 million, which was 93 by volume. And then the average volume at that point for the day in total was 4.686 million. So, it literally had more by only volume on that day than the",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 103,
      "total_chunks": 107,
      "start_timestamp": "02:09:47",
      "start_timestamp_seconds": 7787.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=7787"
    }
  },
  {
    "text": "here, which is getting rid of this. But, the volume on this day was 4.8 million, which was 93 by volume. And then the average volume at that point for the day in total was 4.686 million. So, it literally had more by only volume on that day than the total average for the past 10 days. So, yeah, I'm not exactly sure what you're looking at, but for me, that looks super bullish. Again, it's all in context. It's none of these things typically are going to be, you know, like the most discrete answers or the clearest things on planet Earth. But, at least for me, like, volume is pretty consistent. So, like, here, on most of these upmoves, like, I can see volume behaving a certain kind of way. So, yeah, to me, I feel like chewy volume, just like anything else. I don't think it's specific to chewy or really anything. Like, if you look at GameStop, we were just looking at this. The upward price move that it had here. It was definitely, again, if I close this time frame down, it will be about close to average, but it's like all by volume. So, there's definitely people that are looking to get along the product. So, all right, gang, I think this might be my longest live stream ever, but super, super fun. Love hanging out with you guys. Like I said, I'm in, I was just chatting with Newton to see what we",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 104,
      "total_chunks": 107,
      "start_timestamp": "02:11:59",
      "start_timestamp_seconds": 7919.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=7919"
    }
  },
  {
    "text": "there's definitely people that are looking to get along the product. So, all right, gang, I think this might be my longest live stream ever, but super, super fun. Love hanging out with you guys. Like I said, I'm in, I was just chatting with Newton to see what we want to try to set up another joint session to, you know, see what's good for his schedule. I know he's getting busy now with the school year starting and stuff. But as always, whatever you guys need, just let me know. Hit me up in the discord. You can hit me up on the video comments or whatever works for you works for me. But I always love doing this with you all. I think next week, I'll either do this on Thursday or Saturday undecided yet. But I'm going to keep the cadence going. Once I start something, I tend to keep doing it. So, we have daily live streams and we have one weekly live stream that is dedicated to taking a look at all of the GME and peripheral stories. So, that's the point of this. And if there's ever anything that you want to look at in those, just let me know. I love trying to integrate as much of the stuff that's interesting to you guys into them so that we can spend time looking at what you want to see. So, let me know if you have anything being outlier, being ape. And",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 105,
      "total_chunks": 107,
      "start_timestamp": "02:13:11",
      "start_timestamp_seconds": 7991.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=7991"
    }
  },
  {
    "text": "at in those, just let me know. I love trying to integrate as much of the stuff that's interesting to you guys into them so that we can spend time looking at what you want to see. So, let me know if you have anything being outlier, being ape. And I'll see you guys later.",
    "metadata": {
      "video_id": "cT6vsQUM33k",
      "title": "GME Livestream | GameStop Live Analysis Ep6",
      "url": "https://www.youtube.com/watch?v=cT6vsQUM33k",
      "upload_date": "",
      "duration": 8070.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 106,
      "total_chunks": 107,
      "start_timestamp": "02:14:11",
      "start_timestamp_seconds": 8051.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cT6vsQUM33k&t=8051"
    }
  }
]