[
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "you you you you you you you you you you you you you you you you you you you you you you you what's up outliers, what's up, apes, I hope everybody's having an awesome weekend. Thanks for coming to hang out. Game plan for today is actually to take a look at GameStop. I've had a couple questions about my current position, so well, at least the sample position that I that I share with you guys for those that don't know the way that I do it and kind of you have protect confidentiality and stuff is I have like my main portfolio and then I kind of scale things out of it for contextual conversations. So that is what we'll take a look at today. And I think there's a really really interesting series of behavior going on, especially with GameStop, but also the broader market. That's why I want to start here from the broader market and then we'll double click into GameStop and some of the conversation points there. Across the board, the broad market right now is going through a pullback. If that extends, we can find ourselves very quickly in a correction, which is defined as about 10% from near term highs into lows. And right now, I can't see the number, but I'm guessing it's like half of that. Maybe a little over half of that. The market is a reminder spends the majority of its time within 5% of all time",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 380.0,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "is defined as about 10% from near term highs into lows. And right now, I can't see the number, but I'm guessing it's like half of that. Maybe a little over half of that. The market is a reminder spends the majority of its time within 5% of all time highs. So this right now is the early stages of something that may or may not get worse. There's always nobody knows and I don't pretend to know anybody else that pretends to know as a fucking liar. But we do have inability to create probabilistic assumptions. And actually a couple weeks ago, I think it's one or two weeks ago. We were having a conversation and I was explaining that my current probabilistic assumption is favoring near term downside and still long term bullish. And thus, I still feel that general way until we see some of these broader things of bait, right? We need to see volume down. We need to see the indices stabilize, which right now they really haven't, they're still, I don't want to call it freefall, it's dramatic, but they've unwell and pretty quickly. And they continue lower. So until that actually starts to normalize, then yeah. But relevant to game stop is actually not crude oil, but it's Bitcoin Bitcoin. This is nasty. What's going on there, I think you can can screw it a bunch of different ways, but we'll take a, we'll take a quick look at it because I think.",
    "start_timestamp_seconds": 360.0,
    "end_timestamp_seconds": 460.0,
    "start_timestamp": "06:00",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=360",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "normalize, then yeah. But relevant to game stop is actually not crude oil, but it's Bitcoin Bitcoin. This is nasty. What's going on there, I think you can can screw it a bunch of different ways, but we'll take a, we'll take a quick look at it because I think. I think the issue is with Bitcoin as we go through this broader drop, like nobody knows why. There really hasn't been a clear logical discussion that I've seen at least that would lead me to believe like, oh yeah, okay, I can clearly understand the catalyst here. If we take a look at this move so far, I'm not even using the low will go to the low, just to see the total range, I guess this is a 36% drop in less than two months. That is an aggressive bear market. That's not like a small bear market. That is an aggressive bear market. I've seen a lot of different commentary about why this may or may not be, but I've not seen anything that I would consider to be kind of like an accepted depiction of this catalyst. So my first question to you all in the chat is, what do you think is causing the drop in Bitcoin? Do you think it's just people want to unwind and get out of it? Do you think that there is an issue with the having? Do you think that it's institutional sponsorship, unwinding? What do your thoughts? And",
    "start_timestamp_seconds": 445.0,
    "end_timestamp_seconds": 556.0,
    "start_timestamp": "07:25",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=445",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "chat is, what do you think is causing the drop in Bitcoin? Do you think it's just people want to unwind and get out of it? Do you think that there is an issue with the having? Do you think that it's institutional sponsorship, unwinding? What do your thoughts? And again, the reason why this pertains to game stop is because Bitcoin is a key part now of game stops balance sheet and on top of that. This is one of the risks that we reviewed together on the stream of holding something like Bitcoin that this kind of thing can happen. Let's see what we got. We got race. We got brain says, you know, sorry if I was being snarky on the stream last night, I honestly don't even remember anything registering any close to that. So I'm not sure. I don't even know what that pertains to, but completely. Nothing registered on my end. Kelly Luca good to see you. Lawrence says can we talk about game stop trade. Game stops trade. Anything on December 6. Could you clarify? When you, uh, game stops trade. What do you mean? I mean, the thing is, is like some of the behavior in Bitcoin is trackable, right? Like there are liquidity effects through stuff like the having. There are things like being added to indices futures starting to trade on Bitcoin. Like there are clear effects that we can identify typically speaking when we have something that's down like",
    "start_timestamp_seconds": 537.0,
    "end_timestamp_seconds": 624.0,
    "start_timestamp": "08:57",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=537",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "of the behavior in Bitcoin is trackable, right? Like there are liquidity effects through stuff like the having. There are things like being added to indices futures starting to trade on Bitcoin. Like there are clear effects that we can identify typically speaking when we have something that's down like over 30% in two months. That's a different bag and like normally there would have to be some sort of structural catalyst. The good example of a structural catalyst could be futures on Bitcoin are going away. Again, this isn't what's happening. I'm just saying like these kinds of things. Or the big banks have moved to block Bitcoin as illegitimate payment structure or not having it on their balance sheets or some sort of governmental government regulation on Bitcoin in the way it fundamentally behaves like that kind of stuff can cause this sort of movement. I guess the trick here is that those things haven't happened and it's still exhibiting this kind of movement. That's what makes it so unique. And this is again, one of the long term tricks when it comes to something like Bitcoin is it does move like this. It's not always it's not necessarily frequent, but again, if we go back to this most recent reference range, that was 32% over 54 trading days. So it's like not that crazy. Ericsson Reggie says Bitcoin seems to be following its four years cycle, maybe three years trending one year down. Let's take a look.",
    "start_timestamp_seconds": 608.0,
    "end_timestamp_seconds": 709.0,
    "start_timestamp": "10:08",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=608",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "necessarily frequent, but again, if we go back to this most recent reference range, that was 32% over 54 trading days. So it's like not that crazy. Ericsson Reggie says Bitcoin seems to be following its four years cycle, maybe three years trending one year down. Let's take a look. Let's test the hypothesis. Let's go to four years daily. I am unsure. Because if we apply that four year cycle concept, then this looks negative to me, then this looks positive. Positive. The negative positive big negative is a deep ass pull back. I'll tell you that. Ericsson's market makers need liquidity. Bitcoin is a Ponzi scheme basically loose useless crypto transactions wise. I mean it's objectively not true. That's you cannot like it. It's okay to not like Bitcoin or not believe in it, but like as objectively not true. It's not so much a Ponzi scheme. I don't think. It's certainly not useless transactions wise. Again, I can understand people not liking something, but I think it's a massive logical error to make statements like that when this thing objectively has profound user base and sponsorship. It's just a reality of it. If this thing, if other entities share that perspective, you wouldn't see Bitcoin like valued anywhere around here. So yeah, I don't buy it. I think again, it could be cool to completely find if somebody doesn't like it, but I wouldn't confuse opinions and perceptions of stuff with like factual and this factually is",
    "start_timestamp_seconds": 695.0,
    "end_timestamp_seconds": 812.0,
    "start_timestamp": "11:35",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=695",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "entities share that perspective, you wouldn't see Bitcoin like valued anywhere around here. So yeah, I don't buy it. I think again, it could be cool to completely find if somebody doesn't like it, but I wouldn't confuse opinions and perceptions of stuff with like factual and this factually is not. Not useless. It's used by a ton of people. Ericsson's asked Michael Salar. Well, I'm not what he's saying on it because if I'm not mistaken, I don't think I don't think he would say. I don't follow him closely. So I actually don't know what what he postulates versus what he does. I know that he's obviously a big Bitcoin proponent, but I don't know what he actually says. Lawrence says open trade thing. They say you can bring anything in trade for game stop credit with a few exclusions. The exclusions were interesting. Oh, yeah, let's take a look at that. That's actually super weird. Ericsson's MSTR is toast. Let's see. I do think MSTR is going to come under pressure. I completely grew with that. And funny enough, when it comes to something like Bitcoin. I do not believe that Bitcoin is a Ponzi scheme, but I do think this thing is. At least ask. I want to be clear with my terminology. It's not directly a Ponzi scheme technically speaking, but this thing I do believe has way more in common with a Ponzi scheme than it doesn't. So yeah, I. This thing has been",
    "start_timestamp_seconds": 798.0,
    "end_timestamp_seconds": 904.0,
    "start_timestamp": "13:18",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=798",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "I do think this thing is. At least ask. I want to be clear with my terminology. It's not directly a Ponzi scheme technically speaking, but this thing I do believe has way more in common with a Ponzi scheme than it doesn't. So yeah, I. This thing has been perverted for so long. The only, I mean, the big thing here is that somebody like sailor is going to do everything humanly in his power to make sure that this thing eventually Bitcoin specifically, but I mean, it's down 70%. It's a big move, but like, eTriple Cuse moves more than that. So we're still not even really at like awful price levels yet. And the other thing to remember about micro strategy specifically is that it still does have a business. Now, all of the other business and what the business does, different conversation, but it does have a business. My guess is somebody like sailor, I don't know what they're balancing, what was their latest balance sheet, let's take a quick look, say actually don't know. MSTR earnings release. Let's see what they got. Third quarter, I don't really care about the webinar, I just want to see. Do they have a deck? Here we go, earnings presentation, perfect. Let's see. I just want to see what they have for cash. So Bitcoin, they have 3.1% market cap doesn't matter, their market cap is absolutely eviscerated as of right now. So let's just matter. Here's what we",
    "start_timestamp_seconds": 881.0,
    "end_timestamp_seconds": 1002.0,
    "start_timestamp": "14:41",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=881",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "see. Do they have a deck? Here we go, earnings presentation, perfect. Let's see. I just want to see what they have for cash. So Bitcoin, they have 3.1% market cap doesn't matter, their market cap is absolutely eviscerated as of right now. So let's just matter. Here's what we care about. Operating income is super unstable, net income super unstable. EPS is kind of all over the map. I mean, I don't care about their Bitcoin per share. What is the yield? Incremental value generated through strategy, treasury operations, okay, got it. So this is how they're primarily. Generating as acquired additional Bitcoin every quarter. So they're slowing down as well. All right, let's see. Here we go. So they have eight bill in debt. And a good bit of it is in the money, which is actually helpful to them. Their interest is not crazy. So this is actually really. This is really interesting because you could tell very clearly, obviously, like where they're where their focus is and what their intent is. And right now with their general. So lending. Operations, they're able to generate. A reasonable yield. The problem is a lot of this obviously is everything to do with Bitcoin going up though. So the STRC, I mean, that's a. Fucking hell of a yield. And in a half. And they're making a decent amount. In yield. I have to be honest. I'm not. Again, I'm no massive fan of any of this kind of",
    "start_timestamp_seconds": 969.0,
    "end_timestamp_seconds": 1176.0,
    "start_timestamp": "16:09",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=969",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "everything to do with Bitcoin going up though. So the STRC, I mean, that's a. Fucking hell of a yield. And in a half. And they're making a decent amount. In yield. I have to be honest. I'm not. Again, I'm no massive fan of any of this kind of stuff. And I'm not really sure what it is. But I think that's a bit of a bit of a policy scheme, but. I will say. They're. They're executing. But. The other thing that we can logically assume is that they probably have a pretty robust. Game plan in place. Now where that game plan ends. That's the real question. That's the real question. What I mean by that is this move is nasty. Not a good move. But if we look out longer term again, like this isn't. Oh, shit. This isn't the first time Bitcoin is done something like this. So because of that, when you're creating risk management models, you don't make or risk management model based on like a nice scenario. You use the worst scenario you can find and then you amplify it. I don't think we would be at the level yet that we would be breaking any sort of risk management models that they might have. And if you look at the price performance of MSTR, again, something like game stop. It actually like this recent price behavior mirrors a lot of what you're seeing from Bitcoin. The. Interesting thing with respect to",
    "start_timestamp_seconds": 1140.0,
    "end_timestamp_seconds": 1275.0,
    "start_timestamp": "19:00",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=1140",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "would be breaking any sort of risk management models that they might have. And if you look at the price performance of MSTR, again, something like game stop. It actually like this recent price behavior mirrors a lot of what you're seeing from Bitcoin. The. Interesting thing with respect to Bitcoin is the price levels that we're hitting. So I have a buddy out here in California. He actually helped me work on my house when I first moved into it. And he was a Marine really, really good dude and he. T and I keep in touch like once every great while right we're not like hitting each other up monthly, but it's whenever. And it's always great to chat with him, but he reached out asking about game stop because he is a position where his basis is like in the fucking forties. And what he was considering doing is taking a massive amount of capital and throwing it into game stop at these levels to try and you know manages basis and whatnot. So we had a really good conversation about like the pros and cons and you know what whatnot around the thing you might be thinking of. And what I brought up during that conversation though is when you see game stop right now. Where if you look at its overall intrinsic value again, there's like different different numbers that you'll see thrown around, but with the cash that it has. It's like close to",
    "start_timestamp_seconds": 1250.0,
    "end_timestamp_seconds": 1353.0,
    "start_timestamp": "20:50",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=1250",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "thinking of. And what I brought up during that conversation though is when you see game stop right now. Where if you look at its overall intrinsic value again, there's like different different numbers that you'll see thrown around, but with the cash that it has. It's like close to 1940 a share and then you have the Bitcoin it's like 2060 so we're like almost below. Like raw intrinsic value. Now again, the reason why that can happen is because it's still like game stop does have debt in overhead, which typically is integrated into. That kind of assessment, but. This seems really low. You can see like this 255 handle was the last primary downside threshold that we drew before we had to explore. A slightly longer term window to get some context on where the next might be and you can see where I have that pin that right now, which is like 1877. And the only reason for 1877 is because it's the last real volume note that we saw and that seems low to me that seems really low to me. The beautiful part again about game stop at levels like this is for those that like the company long term. It's a really really good entry. TCM says five years swaps maybe wish we had more clarity. I don't think so. I honestly think the game stop community would do themselves a massive massive favor. If you guys maintain awareness that swaps are a",
    "start_timestamp_seconds": 1323.0,
    "end_timestamp_seconds": 1434.0,
    "start_timestamp": "22:03",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=1323",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "that like the company long term. It's a really really good entry. TCM says five years swaps maybe wish we had more clarity. I don't think so. I honestly think the game stop community would do themselves a massive massive favor. If you guys maintain awareness that swaps are a thing and they exist, but it's less of a focal point in terms of like analysis and price for casting. It's just because it's not like we can see by measuring them that it really isn't predictive. The reason why we know that is because we can take a look at the swaps see when the swaps are due and then take a look at how price behaves the important part when you do something like this. So you have a swap. Is what you do not want to do is see that the swap comes on the 30th of no. And then the assumption is on the 30th of no of something has to happen because this swap is due. When we analyze this the only way to actually analyze this rigorously is not to pick the instances where this swap was due at this point and saying like, oh here look the swap made it move. It's it's not how you conduct an actual like rigorous scientific study in order to do this what we need to do is say give me a list of Jimmy swaps. All of them not one all of them all of their",
    "start_timestamp_seconds": 1412.0,
    "end_timestamp_seconds": 1519.0,
    "start_timestamp": "23:32",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=1412",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "oh here look the swap made it move. It's it's not how you conduct an actual like rigorous scientific study in order to do this what we need to do is say give me a list of Jimmy swaps. All of them not one all of them all of their expressions. And then what we need to do is overlay these expressions with price behavior we literally can do it right now together at a curiosity I haven't done it in the last three months. So this will be net new for me, which I'm happy to take a look at let me grab I need to find if any of you guys have a quick reference for like recent game stop swaps. I would love that. If not I can find a really quick to so recently expired. Aim stop swaps. All right. I see this. Let me see what this is. I don't know what this. I'm looking for a list if you guys have it that would help but if not I'll keep looking for a few minutes until it gets chew. If it's difficult. I thought for sure that there was a list. Let me just see. All right, so here's a swap deedy so maybe this one gives us links to. All right, here we go. No, that's them as the intermediary so it doesn't even see this aggregated yet. I see CFDs. And I see different listings of swaps but I don't actually see.",
    "start_timestamp_seconds": 1495.0,
    "end_timestamp_seconds": 1639.0,
    "start_timestamp": "24:55",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=1495",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "see. All right, so here's a swap deedy so maybe this one gives us links to. All right, here we go. No, that's them as the intermediary so it doesn't even see this aggregated yet. I see CFDs. And I see different listings of swaps but I don't actually see. In aggregate. Let me take a look. Yeah, I don't see anything in the aggregate. I don't know what I'm going to do. If you guys. If you guys see it, let me know, but I'll walk you through at least what we would need to do so the first thing is we would need to find a list of swaps. I know on Newton sheet, and I think somebody new is maintaining Newton sheet if I'm not mistaken, but I think on his sheet he tracked some of the swaps, And that was one of the tricks with it, is that he sheet didn't track all the swap. So the first thing we wouldn't need to do is actually find a comprehensive list of all the swaps. And then we would run just a general statistical analysis on it, which kind of useless to do it on the price without the swaps if the intent is to explore the swaps. But like I said, I haven't done it like the last three months. But when I was looking at it, we were closely before, especially when Newton and I were spending a lot of time talking about it. I",
    "start_timestamp_seconds": 1610.0,
    "end_timestamp_seconds": 1714.88,
    "start_timestamp": "26:50",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=1610",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "without the swaps if the intent is to explore the swaps. But like I said, I haven't done it like the last three months. But when I was looking at it, we were closely before, especially when Newton and I were spending a lot of time talking about it. I did a very deep analysis of it. And I didn't see anything. That doesn't mean that there still isn't a relationship. But there definitely wasn't anything that we could objectively say swap equals blank. Reggie says I think Newton believed there were up to 15 swaps was varying lengths, two, three, and five. Yeah, I think that that's, I mean, that sounds right. And I wouldn't be surprised if there's more to be honest. Here's another swap, D.D. Yeah, okay. So where is he pulling this from? I can see somebody's pulling this somewhere. Look at these data points, basket swaps. Where's this from? I'll show you what I'm reading. This thing. Let me move this. I'm reading this. And in this is this. So I see these. I mean, we could literally run a quick analysis, literally using just these. This is enough. It's not enough for us to be like ultra mega highly confident in the outcome, but we can literally just use what's here real quick. And I bought. So let's do it. I'm gonna, let's do two things. First thing I need to do is get GameStop data. And we need to go back to 2022",
    "start_timestamp_seconds": 1700.24,
    "end_timestamp_seconds": 1819.44,
    "start_timestamp": "28:20",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=1700",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "be like ultra mega highly confident in the outcome, but we can literally just use what's here real quick. And I bought. So let's do it. I'm gonna, let's do two things. First thing I need to do is get GameStop data. And we need to go back to 2022 is the earliest that I see. So let's do that. Let's grab GameStop data. And we don't have to go back super far, so I'm not gonna go back to fucking oops, or I am. We go back to 2022. 2022. On download this. Wait. And then I'm gonna drop this. What am I looking at? The crisis is looking. What? Oh, these are fucking spy. That's hilarious. I opened up, I think the wrong file, and I saw a bunch of prices at fucking 655. Why is this saying spy? Here, GameStop. There we go. There we go. There we go. Okay. That was hilarious. I was just like, yo, what the hell is going on? All right. So what I did first, and I'll show you guys, is I grabbed price data first. So we have price data. This is daily going back to 2022. And what I'm gonna do next is overlay the swap explorations over here. So I'm gonna move this out of the way, so that I can see them. And then we'll build it together really quick. And then I'm just gonna include two data points, the expiration and then the notion. I think",
    "start_timestamp_seconds": 1797.84,
    "end_timestamp_seconds": 1937.28,
    "start_timestamp": "29:57",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=1797",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "gonna do next is overlay the swap explorations over here. So I'm gonna move this out of the way, so that I can see them. And then we'll build it together really quick. And then I'm just gonna include two data points, the expiration and then the notion. I think those are really what's mostly relevant. And then I'll just add like a swap count, so a swap number so that we can track them a little easier. So then we'll have an expry, and then we will have a notional. And I'll run through these, really quick. So we have, this is gonna be sorted by no additional. The easiest way to do this would just be to download this as a PDF and then to extract it. Versus hand jamming all of it. We wanna save it as a image. Yeah, cool. And then I'm gonna open it in a PDF. I wanna add it there. I wanna open it, right? Let's just do it. I wanna open use a PDF there. There. I wanna open use a PDF there. There. There. The distancing is getting super, super. I'm gonna open it. For some reason it's fucking literally misreading the file. So I'm not gonna bother. I'm just gonna hand jam it really quick. So eight March 24, it won't take that long. So really, at least in this sample, there aren't a whole lot, so we'll get right. And then the notional there is 31 million. This",
    "start_timestamp_seconds": 1917.84,
    "end_timestamp_seconds": 2106.92,
    "start_timestamp": "31:57",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=1917",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "misreading the file. So I'm not gonna bother. I'm just gonna hand jam it really quick. So eight March 24, it won't take that long. So really, at least in this sample, there aren't a whole lot, so we'll get right. And then the notional there is 31 million. This will be currency. And we'll copy this format all the way down. Okay, we have our little structure set up and I'll run through like 20 of them. Is that'll be enough to give us a starting point? Hopefully there's 20, I think there is. So 25 March 12, 24. That one is 30 mil. Fourth is also 12, 24. That one's at 29 mil. Then I see 18 March 24 again. That one is 29 mil. Then I see 8 Jan 24. That one is 28 mil. And I see 21. That one's 27 mil. Next is 21. That one's 27 mil. See three June. 24. We're on number nine. Case you wondering. 27 mil. And then 25 March 24. 26 mil. Five. Five. Five. 24. 24 mil. 12. Eight March. 18 mil. 25 March. 24. 18 mil. One April. 22. 17 mil. If it's eight Jan 24. 17 mil. And. 12. 24 almost done. 12. 18 mil. And then I'll still talk about my position and stuff, but I just want to do this because there's a lot of conversations around swaps. And most importantly, I want to show you guys how to do this for yourselves. This",
    "start_timestamp_seconds": 2071.92,
    "end_timestamp_seconds": 2285.92,
    "start_timestamp": "34:31",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=2071",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "mil. And. 12. 24 almost done. 12. 18 mil. And then I'll still talk about my position and stuff, but I just want to do this because there's a lot of conversations around swaps. And most importantly, I want to show you guys how to do this for yourselves. This is just a slow time consuming process. This is 17 mil again. And then we have 25 March. 24. That's number 19. That's 15 mil. And then number 20 is 3 June 24. And that one's 15 mil. My instinct is just to do the rest since we're very much through the whole list. Five. 24. 14 mil. 22 March 22. 12 mil. 18. 18. 23. 3 mil. 8. 12 mil. 8. 8. 8. 8. 8. 8. 8. 9. 8. 5. 7. 8. 7. 8. 7. 7. 8. 7. 8. 7. 8. 7. 7. 7. 8. 7. 7. 8. 7. 7. 9. 8. 8. 8. 9. 9. 9. 8. 7. 8. 8. 10. 8. 9. 8. 7. 9. 8. 7. 8. Now, the next thing we need to do is write a few formulas. So, Re says IDK, what we're doing, but still here. Okay, that's, no, thank you for bringing that up. I'll explain what we're doing. The purpose of this exercise is to show you the individual people. When you hear all these conversations about swaps and swap impact on price, I want to show you how to do is analyze objectively the impact of swaps on price.",
    "start_timestamp_seconds": 2261.92,
    "end_timestamp_seconds": 2439.92,
    "start_timestamp": "37:41",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=2261",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "bringing that up. I'll explain what we're doing. The purpose of this exercise is to show you the individual people. When you hear all these conversations about swaps and swap impact on price, I want to show you how to do is analyze objectively the impact of swaps on price. So, what I did is I grabbed from the screenshot. I don't know where they grabbed this from, but I grabbed this screenshot. I've seen different versions of this before that include, you know, game stop to different degrees. Some of them are a basket with other stuff, but all these include game stop and some capacity. I grabbed all of them and their notion of value. So, what I'm going to do is create an analysis section here. And again, for the analysis section, I'm literally going to show you how to use AI in case you don't know how to do this. You literally can use AI to show you how to do this. So, I'm going to grab, I'm going to squish this screen down. Maybe to hear, and then I'm going to grab Gemini. It's so funny. I have a really, really big screen. It's like almost 50 inches, but I have to like crunch it down to fit it to that you guys can see which is kind of fun. So, I'm going to give it information. So, I'm going to say, well, first let's architect what we think we want to see. The first",
    "start_timestamp_seconds": 2423.12,
    "end_timestamp_seconds": 2518.92,
    "start_timestamp": "40:23",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=2423",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "almost 50 inches, but I have to like crunch it down to fit it to that you guys can see which is kind of fun. So, I'm going to give it information. So, I'm going to say, well, first let's architect what we think we want to see. The first thing I think we want to see is the stock price behavior coming into the swap and then out of the swap. So, this will be swap minus 20 days. This will give us a date. There's two ways, more than two, but there's a few ways to set this up. I'm going to set it up in a way that there's more columns than you really need to use, but all the data will be available. So, we'll have 20 days, swap minus 20 days. This is your first date, and then this will be spot price, flows. Then we'll have swap minus 10 days, spot price. Spot price. Close. Swap minus five days. Spot price. Close. What I'm going to do is use Gemini to help me create formulas. And what I want to do is write a formula here that first gives me the nearest trading day. Minus 20 period. The easiest way to set this up so that it can be copy and pasted is these become kind of headers. And then here I literally just input numbers. So that'll be 20, 10, 5. Now, I haven't bothered doing the post swap move yet, because we",
    "start_timestamp_seconds": 2501.92,
    "end_timestamp_seconds": 2626.92,
    "start_timestamp": "41:41",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=2501",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "Minus 20 period. The easiest way to set this up so that it can be copy and pasted is these become kind of headers. And then here I literally just input numbers. So that'll be 20, 10, 5. Now, I haven't bothered doing the post swap move yet, because we want to get this dialed in first. So here's what I'm going to tell Gemini. Zooming out so that you guys can see everything in one shot here, at least so far. I'm going to tell it in O4 in Google Sheets. So O4. I want to calculate the trading day. I want to calculate a trading day. Before an input date given in L or to L. The input period is in O3. Example. In L3, the date is 8, arch 24. I want to calculate 20 trading days prior to that expiry day. Let's see what we get. So it looks like it's doing in array which is fine. I think it's, I know, overdoing it a little bit in the way that it's writing it. Let's see. And then I'm actually going to open up another. Yeah, I figured this feels very overkill what they did for what we want. So let's open up a new chat and we will do it with Grock. And let's see what Grock gives us. And then while we're at it, I'll do it with chat, GPT as well. Just set a sheer curiosity. His. This doesn't really need to be",
    "start_timestamp_seconds": 2603.92,
    "end_timestamp_seconds": 2793.92,
    "start_timestamp": "43:23",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=2603",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "what we want. So let's open up a new chat and we will do it with Grock. And let's see what Grock gives us. And then while we're at it, I'll do it with chat, GPT as well. Just set a sheer curiosity. His. This doesn't really need to be the case. Yeah, this is way simpler. Returns dates before the expiration. How many dates exist before the expiry. Creating days. Holds the specific date end days earlier. Okay, so this one slightly mistaken it. I want it to calculate. 20. Want to calculate the input. Period. I want to calculate the date based on the input. Period. Against the reference. D in L. What it's doing is it was going to go through. Yeah, so this is exactly what it should be, which is literally just using a work day function. Sometimes I notice that Gemini can kind of go off the deep end. When it doesn't need to. So now we just fact check this. Does nine. Beb. Align with eight trading days before. And that seems like absolutely correct. So I just want to see. And it's good. So. Grock also did a good job actually. Grock did a slightly better job because the other thing that it did is it automatically included. The freeze for row three, which this will allow us to drag it down. Which is good. Because now all we do is copy and paste it off to the side. So clearly there's",
    "start_timestamp_seconds": 2764.92,
    "end_timestamp_seconds": 2909.92,
    "start_timestamp": "46:04",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=2764",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "did a slightly better job because the other thing that it did is it automatically included. The freeze for row three, which this will allow us to drag it down. Which is good. Because now all we do is copy and paste it off to the side. So clearly there's an error. What it's doing is it's switching the column from L. Which we don't want. We need this to be locked. And then we want to be able to just obviously drag it down. These won't change. This one should change. So 10 days before eight March that looks correct. And then this one's five days before eight March in terms of trading days. These all look correct. So the next thing I'm going to do is calculate. In P. Or let me get rid of this one. And then I'll show you guys what Brock is giving us. Again, the whole reason why I do this is so that if you don't know how to write formulas yourself. I am literally teaching you. How to calculate. Jason says I bet if you upload the actual spreadsheet Gemini would do a better job. So the issue with that is it is it takes a lot of effort to actually make sure you can trust it. But we can absolutely do that as well. So what I'll do is at the end I will just I'll get rid of our stuff. And then upload like these details and then I'll",
    "start_timestamp_seconds": 2894.92,
    "end_timestamp_seconds": 2982.92,
    "start_timestamp": "48:14",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=2894",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "it is it takes a lot of effort to actually make sure you can trust it. But we can absolutely do that as well. So what I'll do is at the end I will just I'll get rid of our stuff. And then upload like these details and then I'll have it do the same stuff and see how close they align. My guess is they won't align. And it's just because there's a lot of small little nuances in logical errors that end up being committed. But that's okay. So in P4, I now want to pull the corresponding closing price from F4 to F. Matching the date input from O4 with the date in E4 to B. Now one thing I need to do because I've played this game enough times is I need to make sure all of these dates are formatted the same. Even if it looks like a date and you would expect it to do the correct matching it doesn't which is kind of annoying. Excel is a little bit smarter in that way compared to this. So let's see what this gives us in B4 to B. So now all I'm doing is I'm having it create a formula for here that's going to look for this date in this column and then give me this response. So it's indexing F which is good and it's matching O4 which is this date which is good. To B which is this so that looks",
    "start_timestamp_seconds": 2967.92,
    "end_timestamp_seconds": 3097.92,
    "start_timestamp": "49:27",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=2967",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "I'm having it create a formula for here that's going to look for this date in this column and then give me this response. So it's indexing F which is good and it's matching O4 which is this date which is good. To B which is this so that looks correct and then it's also giving me a cute little if error. So now we have our first trick we need to find nine. Bad 24 let's see if we can find that. So you see how some of these didn't update. This is the date issue so I actually have dealt with this before what I need to do is. I need to update it in Excel before I pull it over. So all I'm going to do is go back to the base file really quick and then I'm going to reformat the dates in here. And I want. Day month year like this. All I'm doing is copying that and then I'm dropping it in here so that it should generally match. Okay so this we're looking for 15 Jan 24 let's see what's up with that. So that looks like a trading holiday. This won't necessarily know about holidays so there is an easy way to fix that with formulas but it's also easy enough to just force fix this if you're so inclined. In this case I'm going to see if it actually is able to find that would be really really cool by the",
    "start_timestamp_seconds": 3074.92,
    "end_timestamp_seconds": 3186.92,
    "start_timestamp": "51:14",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=3074",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "know about holidays so there is an easy way to fix that with formulas but it's also easy enough to just force fix this if you're so inclined. In this case I'm going to see if it actually is able to find that would be really really cool by the way if it was actually able to find. Like calendar calendars or this that would be dope so I'm going to try that first I'm not expecting it to be able to do it. But it would be super cool if it could now the other thing I'm doing is I'm just locking these different ranges so that when I copy and paste this over. It should give us some stuff. Okay the other thing I noticed is that it's like the same buckets across which is actually kind of strange. Hey that's my birthday. Let's take a look really quick at 20. No it's not the the on same number a few times. And then Jan 4 March. All right let's see how this works so. Update update the formula in. Oh. That is calculating the dates to ensure it's a trading day. Which should exclude. Holiday where the market. I'm very curious if it'll be able to do that if not again we can do it what I'm going to do for the sake of this is just get rid of these from the data sample because it's not that many and it will be faster to just",
    "start_timestamp_seconds": 3170.92,
    "end_timestamp_seconds": 3275.92,
    "start_timestamp": "52:50",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=3170",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "market. I'm very curious if it'll be able to do that if not again we can do it what I'm going to do for the sake of this is just get rid of these from the data sample because it's not that many and it will be faster to just not even fuck with them. But I am curious if it can do it. Because that would be sick. So we are we literally have the backbone for what we need to do this analysis because now what we're going to do is be able to change these formulas you see I was like minus the date. All we're going to do is change these formulas so that it becomes plus the date and then we will be able to see how it behaved after the swap. Okay so yeah what this thing is doing is just creating a map of holidays for the given durations which is completely fine. I'm literally just going to exonerate these from the sample for now. If we run into a bunch of issues going forward. And it gets rid of too much of the sample then I'll change my mind but right now I'm not worried about that. So this will be the swap now plus five days. So we'll be five. Now funny enough there's actually an even smarter way to do this which is to automatically have this as plus and then make this a minus 20. Why would that change",
    "start_timestamp_seconds": 3271.92,
    "end_timestamp_seconds": 3368.92,
    "start_timestamp": "54:31",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=3271",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "I'm not worried about that. So this will be the swap now plus five days. So we'll be five. Now funny enough there's actually an even smarter way to do this which is to automatically have this as plus and then make this a minus 20. Why would that change that though. Yeah okay all I'm doing is making it so that I can automatically copy and paste this no matter what. So that's going to be plus. And then this one plus. Cool. Now we'll literally be able to just do the same the same stuff and we'll do plus five days plus 10 plus 20 you guys want to do like a plus one day as well like the day after the swap. This is easy enough to do so let me know. Let me know what you guys want to do. I picked stuff that I think is generally relevant but if you want to do like more. Incremental steps we obviously can it's at this point it's literally just going to be copy and pasting which is easy enough not like any additional effort. I'll start here and then you guys can tell me what we want. So I'm just going to copy this this should give me dates. This does give me dates this. Should give me price. So this is going to match F with. E. No oh. There's an error. This one shouldn't be locked. It's this that should be locked. That's a",
    "start_timestamp_seconds": 3335.92,
    "end_timestamp_seconds": 3502.92,
    "start_timestamp": "55:35",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=3335",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "want. So I'm just going to copy this this should give me dates. This does give me dates this. Should give me price. So this is going to match F with. E. No oh. There's an error. This one shouldn't be locked. It's this that should be locked. That's a lie. An idiot. None of that should be locked. I need to be able to copy it over. Yeah. Okay. That's more logical. Good. Let's see if all this stuff looks right. So this is looking at F matching you. This should match. You you for that's good. That's correct. Then this should match you three. That's correct. So these are good so far. Fin says, do you have any advice for someone aspiring into the field of orin. Theology Cosplay. I'm a sucker for shit that I don't know. I'm an absolute sucker. So I got to look that up with the fuck is that. Orin. So you can see that it's not a good idea. It's not a good idea. I'm going to tell you about the psychology, what is orin. Scientific study of birds. Okay. Orin. Theology Cosplay. Let's see what you're in for. So it looks like you could be a pigeon. That's pretty sick. Because you got to you got to spread your wings. You got to stretch your stuff. I think peacock or pigeon flamingos are kind of dumb. By the way, they're pink because of what they eat. I think the pork is",
    "start_timestamp_seconds": 3451.92,
    "end_timestamp_seconds": 3601.92,
    "start_timestamp": "57:31",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=3451",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "like you could be a pigeon. That's pretty sick. Because you got to you got to spread your wings. You got to stretch your stuff. I think peacock or pigeon flamingos are kind of dumb. By the way, they're pink because of what they eat. I think the pork is also legit. So I would say pork, pigeon or peacock. You don't want to be a seagull because those are kind of lame. Being like a raven would be sick, but that's taking it a little too serious. Yeah. It's a great, it's a great life choice, I believe. That's awesome. All right. Let's see where we're at. So we have a mix of date not found. Let's see how many we we would get rid of. If there is a date not found in any of the columns. Just want to see how many we would end up having to get rid of before we go in and manually do it. It's looking like a little too many for me. Yeah, I say we go through. What's our sample count? Yeah, I'm just going to go through really quick. Now, when I if I do something like this, that's meant for overriding a formula that although otherwise I'm trying to copy and paste. I will either add a comment with the formula so that I don't break it because what I'm going to go through now is like manually change these. So what we need to do is find",
    "start_timestamp_seconds": 3585.92,
    "end_timestamp_seconds": 3695.92,
    "start_timestamp": "59:45",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=3585",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "meant for overriding a formula that although otherwise I'm trying to copy and paste. I will either add a comment with the formula so that I don't break it because what I'm going to go through now is like manually change these. So what we need to do is find the closest date to 15 Jan 24 which I think was what like 20. 15 Jan. I'll be the 16th. So these will be 16 Jan. And I'm just manually overriding 16 Jan 16 Jan. And then we have 19 Feb is our next one of 24. Let's go find that. 19 Feb would put us on the 20th of Feb. So 25 oops. 19. Ah. These need to be minus. It was wondering that made no fucking sense. So 25 D's is our next for these three. So 25 D's 23. That puts us on 26 D's. So one of the trends that I see right now is we literally could write a formula. That automatically adds a day if we get a date not found. Again, don't care enough on a run-and-through this. Yeah, that's good. And then 1 Jan 24. 2 Jan. And the last one here we have 27 May 24. 28 May. So we have 19 Feb. Yeah, that's okay. So 19 Feb was 25. This is 25. Charlie's 16 Jan. Fuck was that 24. Yeah. 16 Jan. 20 Feb. And 16 Jan. With at least the structure for us to analyze this shit. So",
    "start_timestamp_seconds": 3677.92,
    "end_timestamp_seconds": 3900.92,
    "start_timestamp": "01:01:17",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=3677",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "we have 27 May 24. 28 May. So we have 19 Feb. Yeah, that's okay. So 19 Feb was 25. This is 25. Charlie's 16 Jan. Fuck was that 24. Yeah. 16 Jan. 20 Feb. And 16 Jan. With at least the structure for us to analyze this shit. So this will be that all looks correct. Of 14. Five. Feb. Yeah, that's good. This will be 25. 16 April. 25. 24. And then we only have one left. So five to lie 24. We have all our stuff. Now the next thing that we're going to do is add some data analysis stuff. This is the last part. All we need to do is figure out the price behavior. So this will be. Minus 20. To expry. And then in here we're literally just going to take our spot price for minus 20. And then we're going to take. We need price on expiration date. So we need to take. This and I need price data for M. So. This over. In M4. I want the price from L to L. All right. No F. Minity F. F. Matching the date from A with the date in B. So we need to take the price from the price. So it should do. I mean, technically it should do the. Workday function for there. Yes, so that's. Are these all on a weekend. Eight March 24. No, there is absolutely a date. So what the fuck's the problem? Oh, the.",
    "start_timestamp_seconds": 3821.92,
    "end_timestamp_seconds": 4059.92,
    "start_timestamp": "01:03:41",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=3821",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "we need to take the price from the price. So it should do. I mean, technically it should do the. Workday function for there. Yes, so that's. Are these all on a weekend. Eight March 24. No, there is absolutely a date. So what the fuck's the problem? Oh, the. Wait, the formatting is the same. But now. What is this looking for F matching K. That's why I fucking input the wrong thing matching L. Be there we go. Okay. We're back on that grind. Now we have what we need over here. So what I'm going to do is I'm going to take a look at the 20th 20 days out. Minus the spot price for the spot price. I'm going to lock this. So that it stays in M. And so that we can track it. And let's make sure that this is correct. That's good. Now I should be able to copy and paste this. To be five days in a second, but I'm going to do this also as a percentage. So this divided by this. The person. So we have now. The meat of what we're looking for. So that's 20 days into 20 days prior to expiration coming into expiration, which I actually guess that this is technically backwards. That's my bad. So this should be spot price minus. 20 days. Is this will be 20 days prior to that date. Did I have it that way already? I don't think so. So",
    "start_timestamp_seconds": 4033.92,
    "end_timestamp_seconds": 4169.92,
    "start_timestamp": "01:07:13",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=4033",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "days prior to expiration coming into expiration, which I actually guess that this is technically backwards. That's my bad. So this should be spot price minus. 20 days. Is this will be 20 days prior to that date. Did I have it that way already? I don't think so. So now we'll do we have minus 10 days to expiration. So for this, we take our expiration date spot price minus. So this is a percentage of the price. So this divided by this. Then I have to fix the other ones. The percentage on the other. And this should be. This divided by this. Okay. And then let's take a look at five days minus five. Two expry. That equals this. Minus. This. And then we need that as a percent. And then these are all percent. So what we have so far in this wall of numbers is this is really the section that we care about. All we did is take a look at the price behavior. 20 days out. Five days out. Five days post 10 days post. And then 20 days post. And now we can calculate. How did this thing behave across those windows? And then we can create a little plot. So now it's just repeating this very quickly. But then doing now 20 days. To expry. And then we're going to want that as a percent. Then we're going to want 10 days post expry. And then we're going to want that",
    "start_timestamp_seconds": 4141.92,
    "end_timestamp_seconds": 4325.92,
    "start_timestamp": "01:09:01",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=4141",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "And then we can create a little plot. So now it's just repeating this very quickly. But then doing now 20 days. To expry. And then we're going to want that as a percent. Then we're going to want 10 days post expry. And then we're going to want that as a percent. And I guess I should actually reverse these. Yeah, it should be five and then 20. So that'll be five. And. And then this one. 20. Now we need. The spot price following expiration. So we switch the order here to see how spot price does following. And then we need this divided by this. All of these will be a. And. 10 days. Which is our 10 day spot. Minus are starting point. And then we want this is a percentage. And then we have 20 days. But. Minus are starting point. And we want this as a percentage. This. And then we have 29 days. So I hope you're excited. If you made it through. Give yourself a pat on the back in the chat. Because what you now have. Is a look into. How these things. how stock prices behaved coming into a swap and then following the swap. And again, this is not for a massive data sample. So there has to be a bit of nuance applied to this. Now, what I would do to simplify this whole thing is I would actually make it so that we only look at unique",
    "start_timestamp_seconds": 4305.92,
    "end_timestamp_seconds": 4466.92,
    "start_timestamp": "01:11:45",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=4305",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "and then following the swap. And again, this is not for a massive data sample. So there has to be a bit of nuance applied to this. Now, what I would do to simplify this whole thing is I would actually make it so that we only look at unique dates because there's multiple in here. So we can limit the total exercise that we're doing based on not having a bunch of duplicate dates because the duplicate dates don't really matter, but we'll be able to do that effectively anyways. So first of all, any questions on what we've done so far before we get into the culmination of the last 40 hours of this rabbit hole that we randomly went down, but I am absolutely here for it, because I think it's awesome. So we're doing a whole good. All right. Our next task, and again, we can do this a couple different ways. TCM says not really, but just no way to know if that's all the swaps that could be 1%. You're absolutely correct. And that's exactly correct when it comes to understanding the sample. I actually know for a fact, there's more swaps than this. This provides an initial look. And I would not take whatever we see here as like some sort of definitive solution. I really don't believe that that's the case at all. Now, what I'm going to do is add some more rows or columns I should say, and what I",
    "start_timestamp_seconds": 4437.92,
    "end_timestamp_seconds": 4561.92,
    "start_timestamp": "01:13:57",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=4437",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "This provides an initial look. And I would not take whatever we see here as like some sort of definitive solution. I really don't believe that that's the case at all. Now, what I'm going to do is add some more rows or columns I should say, and what I want to do is grab unique stuff. So I want all of this really all of all of this. We could just literally do it from here. Do like a little quirky version. Actually, no, we'll duplicate it. There's really no reason. I'm duplicating this sheet, and then I'm going to fix this section here, so that it's just unique dates. So it cuts our sample down, but then what I'm going to do is get rid of this, and you'll see it'll pull most of this stuff out. This stuff we can get rid of this we can get rid of. And then we just have to fix this stuff that broke in this section, which is just these date not founds. So it's literally just these. Plus one. Now remember we did hard code some of these in. So we got to make sure that those didn't get too broken. All I'm doing here is adding an additional date. 18 Jan something. Okay. There we go. 26. I threw it supposed to be 26. This should be 2 Jan. All I'm doing here is redoing this formula so that all of these are correct versus the dates that",
    "start_timestamp_seconds": 4547.92,
    "end_timestamp_seconds": 4695.92,
    "start_timestamp": "01:15:47",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=4547",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "too broken. All I'm doing here is adding an additional date. 18 Jan something. Okay. There we go. 26. I threw it supposed to be 26. This should be 2 Jan. All I'm doing here is redoing this formula so that all of these are correct versus the dates that I raw. Hold over and then I'm just fixing them quickly by adding one to them. So this would be 2 Jan before. Now what this is doing is just giving us a like an actual unique. An actual unique look. That's 2524. 16 Jan 24. 25. 16 April 24. Yeah. 16 17 18. Okay. 5. June. July 24. So now all of our stuff is fixed. Mike will says how do you know for a factor of more swaps how many swaps do you know for sure. I don't know the count but I've like personally seen a list that's way larger than this and you can look it up. I just don't know off the top my head where they're grabbing it from. Otherwise I would just do that with us. But yeah, I definitely have seen with my own eyes a larger list. Okay. So we're at a really cool spot now. So we're going to be able to see the possibility to plot the percent price change. Or these different terms relative swap prior in post expiration. Now first thing we can see is that there's some anomalous periods which we can immediately ball park mentally.",
    "start_timestamp_seconds": 4660.92,
    "end_timestamp_seconds": 4816.92,
    "start_timestamp": "01:17:40",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=4660",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "a really cool spot now. So we're going to be able to see the possibility to plot the percent price change. Or these different terms relative swap prior in post expiration. Now first thing we can see is that there's some anomalous periods which we can immediately ball park mentally. And so this might have been the outliers themselves are of some level of interest but moderate. The first thing I'm going to do is I'm copying pasting these names just so that I can plot the percentages. But so that we have clear title links so it's easier for us to see what's going on. And we'll insert a chart. This is before doing any sort of actual correlation analysis. Let's see what we're going to chart. Okay. So we're looking at price behavior for you post. And we want to just take some guesses as to what seems to be predictable versus what isn't. And so far we can see a couple things. We can see that this period was clearly very anomalous. And the interesting thing about this period is that this is 20 days out, 10 days out, five days out that price is up massively. And then following price contracted massively that's interesting. But then as we eyeball the rest of this like this is just kind of a mismatch of colors kind of all over the place. And it becomes a little more difficult to come up with very, very clear trends, but from",
    "start_timestamp_seconds": 4798.92,
    "end_timestamp_seconds": 4928.92,
    "start_timestamp": "01:19:58",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=4798",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "And then following price contracted massively that's interesting. But then as we eyeball the rest of this like this is just kind of a mismatch of colors kind of all over the place. And it becomes a little more difficult to come up with very, very clear trends, but from this window itself. There's actually some very interesting trends to me. And one of them is we can see in general, the five day post 10 day post and 20 day post is actually negative. Not always, but in general, it flips. So like this section, it clearly flipped on this date. This section clearly flipped. So we can see instances work clearly is flipping. But in general, that's actually a very interesting data point to me. Now, we can take a look. These are all based on those individual dates just to make the dates a little clearer to the eyes. So now what we can do is finish with a correlation analysis. And we can say to ourselves, based on this data sample, how predictive is these different price levels and the swaps on the following price. And that'll be your homework. In order to do that, I'll give you the exact prompt you need to use. You need to ask some sort of AI, rock, whatever. I would avoid Gemini with this just because again, it tends to be a little bit quirky. And I would say based on the data from AC and I would get",
    "start_timestamp_seconds": 4914.92,
    "end_timestamp_seconds": 5012.92,
    "start_timestamp": "01:21:54",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=4914",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "give you the exact prompt you need to use. You need to ask some sort of AI, rock, whatever. I would avoid Gemini with this just because again, it tends to be a little bit quirky. And I would say based on the data from AC and I would get rid of the dollars from it just to make it easier. You don't need the dollars. You really just need the percent from here. And I would say based on the data from this section, I want to analyze the correlation between swap date from L with price performance again from this section. So to simplify that in easy way to do that is hard code this in, which isn't not going to hard code it in because that's like against my religion. I'll show you instead how hard code this one over here. And by hard coding this one, I'm just going to get rid of the dollars because we don't care about them. So now you have the actual data that you need in the correct section. So that's the next step. You literally can take this so you can take a screenshot of what I did. And run the next piece for yourself. If you find something or if you get stuck, you can hit me up in our discord so that I can walk you through it. But as soon as we get off the stream, I'm going to do it myself, so I'll have the",
    "start_timestamp_seconds": 4999.92,
    "end_timestamp_seconds": 5133.92,
    "start_timestamp": "01:23:19",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=4999",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "run the next piece for yourself. If you find something or if you get stuck, you can hit me up in our discord so that I can walk you through it. But as soon as we get off the stream, I'm going to do it myself, so I'll have the answer, but I think it's a good exercise for you guys. So it's a little bit of a cliffhanger. I edged you all a little bit. You already have a visual analysis, but now you need to complete the analysis to get the best friend of the last endpoint here. Any questions on anything that we covered or anything related to this before I quickly talk about my position as promised, which, on fact, I don't actually think it's changed. I'll take a look really quick. I made a couple trades on four nove and I bought shares on 11. On 11 November, I bought a hundred shares. So that takes the total game stop position, which right now has an allocation of 25 grand. It takes me to 400 shares at 2247. And then right now I have five puts out in 19d set the 22, so the same same thing there. And then I'm short for calls at the 24 strike in 19d's. This is one of those less common instances where I'm out of one to one ratio. And it's really designed to be very temporary, but it's because of the price behavior and it's really trading",
    "start_timestamp_seconds": 5122.92,
    "end_timestamp_seconds": 5213.92,
    "start_timestamp": "01:25:22",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=5122",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "same thing there. And then I'm short for calls at the 24 strike in 19d's. This is one of those less common instances where I'm out of one to one ratio. And it's really designed to be very temporary, but it's because of the price behavior and it's really trading that broader down move. So those calls are actually, I mean, I can take them down now that I've been in those trade for 18 days, but those would be sitting in a pretty healthy profit at this point. But when I see game stop behaving as it is, I play the coverage triangle a little more defensively and it's literally just to give me a better opportunity in order to make money while the underlying is struggling. On text, my coverage triangle right now in the course of, let's say, 2025. I am outperforming game stop by 56% now. Game stop at the start of the year is 31.84. It's down 36.75% from that point. And the allocation that I have is up 19.9%. So we're literally outperforming it by 56% over the reference timeframe. And the last part of the coverage triangle. So if I bought on the first of the year and just kind of held or, you know, really didn't do anything, I would be down there. But because of the coverage triangle and because of trading around it, not only am I not down, but I'm actually making a decent amount of money. And so",
    "start_timestamp_seconds": 5194.92,
    "end_timestamp_seconds": 5308.92,
    "start_timestamp": "01:26:34",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=5194",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "first of the year and just kind of held or, you know, really didn't do anything, I would be down there. But because of the coverage triangle and because of trading around it, not only am I not down, but I'm actually making a decent amount of money. And so that total allocation compared to the market this year, that position my coverage triangle in game stop something that's gone down 36% from the start of the year is outperforming the market to the upside. The stock market as a whole right now is up 11.82%. As I said, that allocation is up 19%. So that one thing is literally outperforming the market, even though the underlying that I'm trading it in is down 36%. That is literally the power of understanding how to trade derivatives in a nutshell. That's one of the one of the reasons why I do these is to help expose people to new information. You should always do whatever is right for you. But you should know stuff like that exists because that's be honest pretty fucking sweet. Any questions on the position or anything like that before I sign off for the evening. How's it going to figure out what our dinner plan is? Mel hit me up like 25 minutes ago asking about dinner. Reset says when you use 25 allocation does that mean total market not margin. I don't even think GME is marginal but in general. That's cash secured. So what",
    "start_timestamp_seconds": 5289.92,
    "end_timestamp_seconds": 5395.92,
    "start_timestamp": "01:28:09",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=5289",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "it going to figure out what our dinner plan is? Mel hit me up like 25 minutes ago asking about dinner. Reset says when you use 25 allocation does that mean total market not margin. I don't even think GME is marginal but in general. That's cash secured. So what that means is. In my actual account it's a larger position. But this is part of like the sample coverage strangles that I've been sharing with you guys. So all I did was scale it linearly from the size of my account into the correct allocation for the sample portfolio. And in this context what I'm doing is taking a set amount of capital and I'm setting it aside to trade a coverage triangle in game stop. So what that looks like in the long term is I don't always use 25,000 dollars. I actually rarely use all of the money. More often than not I have some cash aside to do other things but I still assess my returns based on that entire allocation because it's money that is dedicated to trading this. So for example right now I'm 79.95% utilized 36% of that is in stock 44% of that is in cash secured puts. So for example on those cash secured puts the cash secured amount to hold those right now is like 11 grand. That 11 grand is earmarked and set aside for the specific position even though technically I would I don't think they're cash secured.",
    "start_timestamp_seconds": 5368.92,
    "end_timestamp_seconds": 5476.92,
    "start_timestamp": "01:29:28",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=5368",
    "chunk_index": 46,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "that is in cash secured puts. So for example on those cash secured puts the cash secured amount to hold those right now is like 11 grand. That 11 grand is earmarked and set aside for the specific position even though technically I would I don't think they're cash secured. I think you can trade those on margin for at least for the short puts but I don't. Brains says how big is your GME position relative to your portfolio. Well we can see that at scale here. So in terms of the total in terms of the coverage triangle allocation of the portfolio it's a little under 10%. It's like 99% of the portfolio. So it's actually funny enough one of my larger individual stock holdings. But also to be clear that's largely just because I got involved in the game stop community and wanted to participate. That's not like some sort of endorsement but I'm obviously very comfortable trading it and I can generate a lot of money from it. So I'm still that that's why it's at that number. But that's what it multiplies out into the main portfolio. But sample portfolio it's obviously the same percentage. I like I purposely scale it down. I was actually talking about it in the discord. I might not do that going forward just because it takes a little bit of effort to scale it out. But we'll see. Alright. That wraps me up. Hope this session is useful. You",
    "start_timestamp_seconds": 5456.92,
    "end_timestamp_seconds": 5562.92,
    "start_timestamp": "01:30:56",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=5456",
    "chunk_index": 47,
    "word_count": 250,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "I like I purposely scale it down. I was actually talking about it in the discord. I might not do that going forward just because it takes a little bit of effort to scale it out. But we'll see. Alright. That wraps me up. Hope this session is useful. You have some homework. Your homework is to follow up with me and discord as a comment on the video literally wherever you want to communicate with me. But what I want you to be able to tell me is what is the correlation between swap expiration date and impact to price. Well, we've just done is isolate the swap piece. The next thing that you need to do is build this out using non swap data. So you need to take 20 days, 10 days, 5 days before, 5 10 20 from random days, not from swap days. So you literally create three or four different versions of this that are just completely random days. And then you can test how correlated is the swap to price performance compared to that series of just completely random days. It's not just about if the stock goes up or down in this small basket, you need to compare it and that's how you compare it. As always, if you have any questions, let me know being outlier being eight to you guys later.",
    "start_timestamp_seconds": 5546.92,
    "end_timestamp_seconds": 5628.92,
    "start_timestamp": "01:32:26",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=5546",
    "chunk_index": 48,
    "word_count": 231,
    "upload_date": null,
    "duration": 5637.0
  },
  {
    "video_id": "cy-eNQnNVA4",
    "title": "Analyzing GameStop Swap Impact to Price | Meme Stock Watch Ep56",
    "text": "small basket, you need to compare it and that's how you compare it. As always, if you have any questions, let me know being outlier being eight to you guys later.",
    "start_timestamp_seconds": 5620.92,
    "end_timestamp_seconds": 5628.92,
    "start_timestamp": "01:33:40",
    "video_url": "https://www.youtube.com/watch?v=cy-eNQnNVA4",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=cy-eNQnNVA4&t=5620",
    "chunk_index": 49,
    "word_count": 31,
    "upload_date": null,
    "duration": 5637.0
  }
]