[
  {
    "text": "What's up outliers? Let's talk about trading options with a 5,000 account. This is a really tricky video because you're going to see a lot of the issues with this. Now, I started with a small account. Most of us do. The problem is most of us start not knowing what we don't know. And I just wrapped up my 18th year of trading and looking back over my trading career thus far, I realized how much risk there is in this process right here. So the goal of this video is to give you an orientation, a framework on how to think about trading options with a 5,000 account so that you have something to show for it at the end. Let's start first with a quick overview. So why do we trade options? They're highly adaptable. That means that you can build positions to represent every permutation of what your idea is. Compare that to equities. You can buy stock. You think it's going to go up. It's essentially going to move dollar for dollar with the underlying and that's it. You just buy it. It goes up. You hope you make money. If it goes down, you lose money. A one-to-one ratio options are different. You can trade options that pay you out a lot of money on a little bit of movement. You can trade options that make money if the market goes sideways. It's completely different. So because of that, they offer a lot of",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "lose money. A one-to-one ratio options are different. You can trade options that pay you out a lot of money on a little bit of movement. You can trade options that make money if the market goes sideways. It's completely different. So because of that, they offer a lot of opportunity. Options are also really efficient because they provide leverage. Even if you're selling options, maybe a cash secured put, so you're setting aside money that would be tied to an open trade. You still earn interest on that money that's tied to an open trade that's also earning you a return. So the overall leverage provided combined with the liquidity that it can give you is really attractive. And the last thing that options do is allow you to truly isolate profit mechanisms. And if you're unfamiliar with this concept, I'll throw a link in the description below that talks about profit mechanisms. But the concept here is if I think a stock is going to go up a lot, I can build a specific trade for that. If I think a stock is going to go sideways and I want to trade volatility by itself and remove my exposure to the underlying stock movement, I can do that. You cannot do those kinds of trades with equities. It's just the limitation of the securities themselves options. Grinch you that. So one of the things you'll notice as I'm talking about this stuff is options are complex. This is",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "exposure to the underlying stock movement, I can do that. You cannot do those kinds of trades with equities. It's just the limitation of the securities themselves options. Grinch you that. So one of the things you'll notice as I'm talking about this stuff is options are complex. This is part of the challenge. These first two points are probably the biggest issues that all new options traders will face. They are really complex and they take a lot of time to learn. But there is a extremely low barrier to entry. What that means is anybody can be an options trader. All you need to do is go to a place like Robin Hood, sign up. They have an app and now you're an options trader. Think of anything else that requires a lot of skill, anything else. Normally there's education, there's exercises, there's projects, there's tests, there's certifying exams before you can actually do the skill set. That's not the case for options. And trading is no less complex than a lot of those other things. There's just not that barrier to entry, which is really confusing to people. Couple that with point number three, which is there is a massive lagged feedback mechanism. So if I'm playing basketball and I shoot a ball, when I shoot the ball, I get immediate feedback. Did it go in the hoop or did it not immediate feedback? And based on the outcome in the hoop or not, I can then",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "is a massive lagged feedback mechanism. So if I'm playing basketball and I shoot a ball, when I shoot the ball, I get immediate feedback. Did it go in the hoop or did it not immediate feedback? And based on the outcome in the hoop or not, I can then conduct a self analysis. Was my elbow tucked in as it should be? Was my forearm straight up? Was I jumping too much at an angle instead of vertical? I can think about all these little things that I have to get right. In order to have a good jump shot, but trading is different. You can be trading a really good strategy and go through a long losing streak just because of the sequence of returns. This is called path or you could be do something completely wrong, abysmally wrong, but you can make money. So then you're being positively conditioned to think you're doing something right, even though you're being tricked again through this idea of path. So not only are you dealing with something that's really complex, there's no certification before you can start or anything to vet your understanding. And it looks like it's really easy to do because of slick internet marketing by people trying to take advantage of you. Couple that with the fact that there's drastically lagged feedback in the systems. That's a recipe for disaster within the first three. We got three more to go. The next thing about trading that makes",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "to do because of slick internet marketing by people trying to take advantage of you. Couple that with the fact that there's drastically lagged feedback in the systems. That's a recipe for disaster within the first three. We got three more to go. The next thing about trading that makes it so difficult is you have to wear a lot of hats. You have to be risk taker, the person putting on the trade. You have to be risk manager to make sure that the trades make sense. And if you look at something like an investment bank, they literally have entire entities designed to these different tasks. They have researchers that are designed to come up with the ideas and then the traders that are meant to execute them. And then a risk management desk that makes sure that what all the traders are doing makes sense together, you have to do all of that. And you have to be super self aware. You essentially have to be your own psychologist to identify all of the small little quirks. We all have his humans. So add that onto the bucket. Then going back to that really slick internet marketing stuff like this, these kinds of things are so dangerous. Now I'm in an incognito tab on Chrome. So it's not skewed by anything that I typically would look at. And after scrolling a little bit, and this is no dig at any of these people. I'm just talking about",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "stuff like this, these kinds of things are so dangerous. Now I'm in an incognito tab on Chrome. So it's not skewed by anything that I typically would look at. And after scrolling a little bit, and this is no dig at any of these people. I'm just talking about the marketing, which is this options trading in 10 minutes. How to make a thousand dollar a day at 19 for beginners. What does that prime you to do mentally? Right? That's completely picking you. The next thing, 4,000 in 10 minutes, not saying that this person did or didn't make 4,000 in 10 minutes is absolutely possible and doable for sure. But for new traders, especially with small accounts, this sets you up for the entire wrong mindset coming into this thing going all the way back to this. We think we're going to turn a small amount of money into a bunch of money. And then the last thing, lack of structure. Anybody that follows my work, you know that I am an evangelist for things like trading plans, trading logs, all even throw a video about them below. But we're trading things that are really complex that have lagged feedback that there's a really misleading low barrier to entry. So we think it's going to be much easier than it is. There's a lot of different tasks we have to perform. Most people don't track anything they do. And then they're wondering why it doesn't work. You",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "have lagged feedback that there's a really misleading low barrier to entry. So we think it's going to be much easier than it is. There's a lot of different tasks we have to perform. Most people don't track anything they do. And then they're wondering why it doesn't work. You have to track what you're doing. Otherwise, how on earth would you think that this is going to work? Again, it's because you're primed in a really unhealthy way by people trying to essentially just bait your eyeballs to get you to click on stuff or their own growth. And it's unfortunate, but it's the reality. Let's take a look at a couple studies and I recommend you check these out. So this one is about the performance of different kinds of options traders. This one talks about retail options trading. This one talks about risk premium in the markets. The reason why these studies are relevant to you is because if you want to be an option trader, you have to understand the place that you're operating. You have to understand the tools. You have to understand the landscape. It's the same thing is going back to the basketball example. If you want to be a basketball player, you have to understand the positions. You have to understand different plays. You have to understand offense and defense. You have to understand positioning. All of those things apply here. Again, the difference is is nobody's going to tell you any",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "example. If you want to be a basketball player, you have to understand the positions. You have to understand different plays. You have to understand offense and defense. You have to understand positioning. All of those things apply here. Again, the difference is is nobody's going to tell you any of it. You have to figure it out because it's all on you. You are a one man or woman band out there doing it all by yourself. You don't have a coach that's telling you do this. Do that. It's you. You are the coach. You're also the player. That is what makes it so tricky. Okay. So now that we understand trading options is tricky. That is just the nature of this thing. I now want to talk about some goals for a small account. What are things to focus on that are a good use of your time? The first one is to focus on saving. I know this isn't about trading at all. Here's the reality. The probability of you turning a 5,000 account into your future wealth is about zero. It's not zero. It could be done. But the probability of that happening is really freaking low. So in the beginning with small accounts, you have to focus on saving because let me show you something. If we take a look at two accounts as an example, we have a 5,000 account of 5,000,000 account. If we save 1,000, that 5,000 account just grew by",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "freaking low. So in the beginning with small accounts, you have to focus on saving because let me show you something. If we take a look at two accounts as an example, we have a 5,000 account of 5,000,000 account. If we save 1,000, that 5,000 account just grew by 20. Just by saving 1,000 with a small account, your savings have an outstanding impact on your overall principle. On a 5,000,000 account, you save that 1,000, you just grew by 0.02. What ends up happening is when your account gets bigger and bigger, your returns start to matter more than your savings. With a small account, it's the inverse. Your savings will matter so much more than your returns. When you compare these on a return basis, if you get a 10 return on this 5,000 account, you get 500,000, you get a 10 return on a 5,000,000 account, you have 500,000, same return. Notice how different that is. In the beginning, small accounts must save. Towards the end, when you have a more developed account, your return matters so much more. Just keep that in mind. So we have to save. Alright, that's stuff aside. Let's actually talk about this. The next thing is, I already explained that this is kind of difficult. This is not easy. It's not what it's made out to be. It's going to take a lot of effort just like getting good at anything else. You have a choice. Either do it or",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "about this. The next thing is, I already explained that this is kind of difficult. This is not easy. It's not what it's made out to be. It's going to take a lot of effort just like getting good at anything else. You have a choice. Either do it or don't do it. But does not work well is kind of half-assing it. Seeing it like maybe you're the next savant that's just going to pick it up and be supremely good at trading. It could happen, but it's unlikely. So you either make the choice to do it and you accept that it's going to be a lot of work. It's going to be frustrating. It's going to take a lot of time and effort to learn this thing and that's great because trading in my opinion is entirely worth it. But what will screw you up the most is if you go into it half-assed, you trade a little bit, you start losing a bunch of money that could have been compounding in a buy and hold index ETF that works well for most people long-term. It's just a waste of time and you'll have little to show for it. So either commit or don't. This isn't something to kind of do kind of not. Make the choice. Your first goal is to learn options. Notice how I don't say your first goal is to return 10, 5, 20, 50, that's not your goal. You don't even get",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "for it. So either commit or don't. This isn't something to kind of do kind of not. Make the choice. Your first goal is to learn options. Notice how I don't say your first goal is to return 10, 5, 20, 50, that's not your goal. You don't even get to have that goal yet because you have to learn the skill set. The only way you can learn the skill set is if you focus on learning versus the returns. You need to build an approach that's part of learning. We're going to prioritize the process of trading because again, going back to this example. If we have that 10 return, 10 on 5,000 is very unappealing. 500 bucks, who really cares. But if you're able to maintain a 10 return every single year without missing a single year, that all of a sudden becomes really meaningful when you're able to give yourself half a million dollars after you continue to save really aggressively, don't have any losing years and scale really effectively. So that's why we care about prioritizing the processes because again, when you're trading a 5,000 account, it's not about the 5,000 you're learning. Next up, you got to track your work. We already talked about that. This is a great time to test ideas, both via paper trading and live trading. You want to limit drawdowns. Drawdowns are going to happen, but with small accounts, they're a killer because they require a much larger percent",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "you got to track your work. We already talked about that. This is a great time to test ideas, both via paper trading and live trading. You want to limit drawdowns. Drawdowns are going to happen, but with small accounts, they're a killer because they require a much larger percent to get back to break even. If you pop over to my website, I have a display built for this. It's under resources and down here under volatility decay and loss recovery chart. If you take a look at the loss recovery chart, if you with your 5,000 account, if you draw it down by 25, you now need a 33.3 return to get back to break even. You've made 0 in this case. You've actually still would have lost money once you include friction meaning fees. But what I'm showing you is that the more you draw down, the bigger return you need to literally get back to break even. You have to avoid that. And again, going back to exhibit A, we're not trying to grow this into our future wealth. We're trying to build a skill set that's sustainable that when coupled with aggressively saving, growing our income will yield future wealth. Last thing, focus on learning already, belabor that point enough. All right, let's now talk about some strategies. The first thing is you do need to outline profit mechanisms. Again, you can check out that video below, but this is just to clearly identify what",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "income will yield future wealth. Last thing, focus on learning already, belabor that point enough. All right, let's now talk about some strategies. The first thing is you do need to outline profit mechanisms. Again, you can check out that video below, but this is just to clearly identify what you're trying to trade. Are you going to try to trade directionally? Are you going to try to trade long term strategies short term strategies value? It's all up to you, but you have to define it and have a sense of what you're trying to do. Risk management is going to be super important. The way that we avoid those draw downs is by managing risk. And there are a few things you can do to completely revolutionize your trading. In a few simple steps, it sounds like gimmicky, but it is the absolute honest truth. I'll throw a link in the notes below about a few simple things you can do. But one of them is every single trade from now on forever. Before you enter, you define your exit points before you enter. So for a 5,000 account, you're naturally going to be oversized. You can't avoid it. But we don't want to have a 10 drawdown on an individual position. That's just too much money. So you can think about things maybe 5 drawdown. And even that for a developed account for a big account, that's a lot. On a seven figure account, you're way more",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "it. But we don't want to have a 10 drawdown on an individual position. That's just too much money. So you can think about things maybe 5 drawdown. And even that for a developed account for a big account, that's a lot. On a seven figure account, you're way more looking at typically things like half a percent to maybe 2. It obviously depends on your approach and your strategy, but you have to balance it with expected return allocation utilization. This is a way that I think about using a portfolio. Again, I'll throw a link to this in the notes below. Allocation is how much money you're going to use at a given point in time for a strategy. And utilization is how much you're actually using at a given point in time. With a 5,000 account, you have to be very, very cautious with this because you're going to have to essentially use most of the portfolio almost all the time. But you have to pay close attention to the portfolio structure. What that means is we don't want a bunch of trades that are mirroring one another. So let's say if you're able to put on 5 trades that are at a 1,000 capital utilization each, well, if they all behave as the same thing, maybe they're all in tech. Well, if tech goes down, your portfolio structure is trash. You have no diversification within them and your probability of blowing up is big. We have",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "5 trades that are at a 1,000 capital utilization each, well, if they all behave as the same thing, maybe they're all in tech. Well, if tech goes down, your portfolio structure is trash. You have no diversification within them and your probability of blowing up is big. We have to balance our return expectations for smaller accounts. It's typically best to focus on percents. The reason again for this is going off of what I showed you here. 10 return is pretty solid. The 500 is trivial. That's not exciting. So focusing on the percent return is a little bit better. When you have a bigger account, we generally use both, but focusing on the dollar amount starts to make more sense because it's less about what the percent is and it's more about how much income do I get? What am I spending this month or this year and how much am I putting back? So we have been flow between these, but just for your context, ticker selection is going to be challenging. One of the things that I do is use scanners. So in this example, I'm using bar chart and you can go in and limit your tickers. I'm using things that are optionable that have gone up over a time frame, but they're trading at 15 or less. The reason being is because I want to be able to put on a few trades. If you're trading things that are too expensive, you've run",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "limit your tickers. I'm using things that are optionable that have gone up over a time frame, but they're trading at 15 or less. The reason being is because I want to be able to put on a few trades. If you're trading things that are too expensive, you've run out of choices, strategies, vertical spreads, ratio diagonals, covered strangles and single options, single options kind of bubbles up under ratio diagonals. Let's first start with verticals. We're going to go over to the platform and let's say after going through a scan, you come across soundhound and you're like, oh, I think that this is interesting. They're getting involved in AI. I think there's a future here. Now, it's rolling over right now, but let's just use it for an example. It's a 18 stock. The first thing you could do is trade verticals. You can go long or short them depending on what you want. I'm not a big fan of verticals, but we can look at one. So let's say you think it's going to go up. So we're going to look at selling a put vertical. So it's a dollar wide. Why does this matter? Well, verticals give you access to a lot more tickers that are more expensive. It's because the width of the spread becomes how much money you need essentially. So in this case, you stand to make what, 59, risking 41, that's actually really good. Typically, it's going to be way less",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "verticals give you access to a lot more tickers that are more expensive. It's because the width of the spread becomes how much money you need essentially. So in this case, you stand to make what, 59, risking 41, that's actually really good. Typically, it's going to be way less than that. But this can give you access to much more expensive tickers because again, you determine the risk by the width of the spread. So let's use Apple for an example. Because if we come in here, we take a look at the same 45 DTE and these are automatically 5 wide. But let's take a look because it's a 242 stock. If we put on a single 5 wide spread in here, let's get rid of this old example, you're risking 365. That falls closer to our risk profile. Again, that's a little too high. We don't want to be at 10 almost. We want to be closer to 5 at the max, but just showing you that using a vertical can get you into much more expensive underlines. The way I think about verticals is that there are a way to learn. That's not really the strategy I would try to use longer term. The ideal strategy that I used when I did a small stack segment not too long ago, using a 5,000 account was ratio call diagonals. I'll throw a link to those in the notes below. But this is where we go out. I",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "I would try to use longer term. The ideal strategy that I used when I did a small stack segment not too long ago, using a 5,000 account was ratio call diagonals. I'll throw a link to those in the notes below. But this is where we go out. I would probably use something like a 90 day diagonal. It would be actively managed and I'm using the long option as the equity. You can see that this trade takes 485. The thing is I'm not going to risk all of that. I'm going to plan to manage this trade. What I mean by that is I'm going to apply my technical analysis and I'm going to say, well, if soundhound drops below 1685, I'm wrong. It's continued to gone down too far and I wouldn't want to get in it. Just for an admin, no, I wouldn't get in here. I'd wait until it bases. Let's say maybe I had gotten in here or something. What I'm going to do is I'm going to see what my risk is here. Let's just call the risk at 17. If we go in here and we take a look at 17, my risk is about 55. That's well within my risk tolerance. I actually can put another one of these on. This is the difference between allocation utilization here. In order to buy these two, I'm going to use 970. I'm using a fifth of the portfolio putting on this one",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "my risk is about 55. That's well within my risk tolerance. I actually can put another one of these on. This is the difference between allocation utilization here. In order to buy these two, I'm going to use 970. I'm using a fifth of the portfolio putting on this one trade. In terms of actual risk, I'm risking about 100. That's well within risk tolerance. I can come in and I can sell calls against it if I'm inclined to try to offset some of the theta. You can check out the video on diagonals. You can trade ratio diagonals both to the upside and to the downside. Coverage strangles are really difficult to do in here, but they're better suited for long term holdings. But again, with a 5,000 account in order to trade the coverage strangle, you have to be able to buy more than 100 shares. That means you're essentially going to have to be trading 56, 7 stock at the most. You're going to be kind of stock. The last one is long singles, which essentially, again, I would trade them just like I trade the ratio diagonals. I just wouldn't add the short leg element. This is trading option with the 5,000 account. It's doable. It's real tricky. If you want to see a follow-up video that goes through these with actual examples for a 5K account, let me know. We could do a follow-up. If you have any questions, let me know. Be an",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  },
  {
    "text": "This is trading option with the 5,000 account. It's doable. It's real tricky. If you want to see a follow-up video that goes through these with actual examples for a 5K account, let me know. We could do a follow-up. If you have any questions, let me know. Be an outlier. I'll see you later.",
    "metadata": {
      "video_id": "cz-aR_GUcXw",
      "title": "Complete Guide to Trading Options with $5K",
      "url": "https://www.youtube.com/watch?v=cz-aR_GUcXw",
      "upload_date": "",
      "duration": 1237.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=cz-aR_GUcXw&t=0"
    }
  }
]