[
  {
    "text": "What's up outliers? Today we're going to talk about what actually matters in obstetricity because the vast majority of us when we are first starting, you are juggling a million different things and the funny part about that is the overwhelming majority of them literally don't matter. And it actually takes a long time to figure out what matters and what doesn't matter. And I can literally guarantee you that you will fall prey to at least several of what I'm about to walk through in terms of common focus topics for obstetricers that really don't matter. After that, I'm going to show you what actually matters. And then at the end of the video, I'm going to show you how to apply what actually matters. So the entire concept behind this video is to try and give you some clarity because now markets are challenging in a different way that there's pure information overload, which is a completely different problem than when I started in 2007, which is information was harder to come across. But nonetheless, they're both challenging to work through. So let's focus on this information overload. And let's talk about a lot of the false focus areas for new obstetricers. All of these have come from the option trading audience. First one, what expiration should I select? Next one after that is what delta, or typically what goes with this one is what is the best delta after that is my focus is not to be",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=0"
    }
  },
  {
    "text": "areas for new obstetricers. All of these have come from the option trading audience. First one, what expiration should I select? Next one after that is what delta, or typically what goes with this one is what is the best delta after that is my focus is not to be greedy and to lock in profits. It's actually a complete mistake. And you'll see why in a little bit what stocks what are the best stocks to trade options in? What is the best strike to select? What are I setting? Should I use should I have the upper threshold at 70 or 80? Who knows? Win rate focus. Lots of new traders will tout having a 80 90 plus win rate completely forgetting the fact that even with those win win rates, you can lose money. And I have a video that talks about that in expected return. The whole of the topic. The multi-leg omnidragon fire breathing spread. Obviously, Joe just made that up. Obstetricers very commonly will layer on more and more legs. And you'll see why that's typically a mistake. Market narrative. The market narrative matters in terms of providing you context, but lots of new traders will see something move and they'll say something like why did this move? It's a good question and you typically can find some sort of answer depending on what you're looking at, but not always. So this creates a false feedback loop where it feels like every move you",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 14,
      "start_timestamp": "00:01:06",
      "start_timestamp_seconds": 66.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=66"
    }
  },
  {
    "text": "traders will see something move and they'll say something like why did this move? It's a good question and you typically can find some sort of answer depending on what you're looking at, but not always. So this creates a false feedback loop where it feels like every move you have to be able to completely and discreetly explain perfectly, whereas the reality is an obfustrator, you just got to be able to trade it. Now, again, there's new wants here as with all of this, because you should have an understanding of what's going on. Those inform your overall decision making process, but there becomes a myopic focus on trying to explain everything discreetly. And sometimes it could just be a fund that's choosing to rebalance. So they're selling their holdings of something. It's not even because it's not doing bad. It can be stuff like that too. Next one, predicting every move. This becomes a little intoxicating when we're seeing the markets will say things like, oh, I think this is going to happen. Oh, I really, really believe that this stock is value too low or whatever this broader analysis lens is. Now, prediction is a big part of what we do. And you have to be able to predict well, regardless, really of what strategy you try to trade, it never needs to be to this extreme. And again, you'll see why in a little bit indicator stacking similar to the option leg stacking indicator stacking",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 14,
      "start_timestamp": "00:02:19",
      "start_timestamp_seconds": 139.14,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=139"
    }
  },
  {
    "text": "part of what we do. And you have to be able to predict well, regardless, really of what strategy you try to trade, it never needs to be to this extreme. And again, you'll see why in a little bit indicator stacking similar to the option leg stacking indicator stacking is when we say, oh my god, RSI worked great in this back test. What if I overlay it with a MACD indicator? And then I also have some sort of heat map that puts sprinkles on my chart. And man, that back test looks great. The problem here is you creating something that is as thin as paper in terms of how robust it is. You'll see a better way of thinking about this in a little bit. Last one, dollar and percent return. This one's kind of funny because it actually does matter a lot. The happening though is that most options traders focus on the wrong one at the wrong time, which is kind of funny. What I mean by this is if you're trading a small account, let's say you have a 5,000 account, let's say that you get a 10 return, you got 500 bucks. That 500 bucks really isn't that inspiring. That's not going to take you to that trip on Tahiti that you were looking forward to or whatever grand or ideas you have about option trading, which really most people come into this with the exact wrong expectations. And that's because people",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 14,
      "start_timestamp": "00:03:19",
      "start_timestamp_seconds": 199.78,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=199"
    }
  },
  {
    "text": "That 500 bucks really isn't that inspiring. That's not going to take you to that trip on Tahiti that you were looking forward to or whatever grand or ideas you have about option trading, which really most people come into this with the exact wrong expectations. And that's because people start trading options and they think, oh, I'm trading options. This is an edge. And it's not. Options are just another asset class. You have to learn how they work in order to develop an edge, simply trading them isn't in and of itself an edge. And yes, this is even for the sellers out there. It's not inherent edge just to sell all the time. You'll get ran over. So back to this dollar and percent return comment. It's because that small account 5,000 that made 500 bucks. That 10 return in the broad context really isn't bad. That's something that can be shaped and turn into something. If it's consistent robust, there's something there. But a lot of times the option trader will say, oh, man, I only made 500 bucks. I got to do something else because this isn't going to make me what I want. And it's the complete wrong focus. The other thing is if you're starting with a bigger account, what ends up happening is your account mature as you actually start you should start to care more about the dollars than the percent. Because at the end of the day, the percent is",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 14,
      "start_timestamp": "00:04:19",
      "start_timestamp_seconds": 259.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=259"
    }
  },
  {
    "text": "it's the complete wrong focus. The other thing is if you're starting with a bigger account, what ends up happening is your account mature as you actually start you should start to care more about the dollars than the percent. Because at the end of the day, the percent is what grows your account. The dollars is what you withdraw from the account to go live your life. So knowing what to focus on and when is important. Let's talk about what matters. These eight things risk management because you cannot trade zero dollars, behavior of options, which we'll talk about profit mechanisms, good feedback loops, your organization as a trader, edge over time, process over outcome and simplicity, slash robustness. Let's get a look at these. So the very first one risk management, it's pretty straightforward. We need to be able to manage risk at the portfolio, the strategy and the trade levels. If you do not have all of that clearly defined from the jump, it doesn't matter what delta you're worried about. There is no best DTE in this scenario. You literally are worrying about the wrong thing before you have the foundation of your trading career established. This is first, after this, the behavior of options, the way we learn how options behave is through something called the Greeks. I have a video, multiple videos that goes all through the Greeks and let me show you why this, the behavior of options coupled with profit mechanisms",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 14,
      "start_timestamp": "00:05:29",
      "start_timestamp_seconds": 329.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=329"
    }
  },
  {
    "text": "established. This is first, after this, the behavior of options, the way we learn how options behave is through something called the Greeks. I have a video, multiple videos that goes all through the Greeks and let me show you why this, the behavior of options coupled with profit mechanisms are so much more important than you trying to figure out what the best RSI setting is. When we're talking about profit mechanisms, we're talking about methods that actually yield profit in the market. So market effects, things like direction, can you trade things up, down, sideways, volatility, expansion, contraction, clustering, relative volatility. There's a million things you can do in volatility. It gets deep. You yield of an underlying if you like to play dividend paying stocks. These are things that actually lead to making money. Let's talk about why the behavior of options and why profit mechanisms are so much more important than starting the question sets from what is the best stock to trade options in and what DTE should I pick? I'll show you exactly why. If we go back in time to Tesla, I'm going to show you a trade that I made towards the end of last year in December. Effectively, it was in this time frame, Tesla was already doing well at this point. It was consolidating and it was following a standard pattern based on how I trade for a potential breakout actually manifesting on this day here on the 5th of",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 14,
      "start_timestamp": "00:06:37",
      "start_timestamp_seconds": 397.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=397"
    }
  },
  {
    "text": "end of last year in December. Effectively, it was in this time frame, Tesla was already doing well at this point. It was consolidating and it was following a standard pattern based on how I trade for a potential breakout actually manifesting on this day here on the 5th of December. Let's go to the 5th of December and let's take a look at this example. So what this is going to show you is what the market looked like at that day. So as you can see, this is what it looked like at that day. As soon as this broke above, I chose to go long and I used options to make the trade. We're not going to talk about my trade specifically, but I want to show you an important point. If we take a look at a bunch of different kinds of bullish trades, so let's say that you're wanting to trade Tesla, it literally doesn't matter. If you come to 20 December and you trade an at the money call, it doesn't matter if you go to 21 Fed and trade a slightly in the money call with a higher delta, it doesn't matter if you go to the 17th, in 25 and sell a put. If we take a look at all of these, what do they perform like relative to the underlying goes going up? This one makes money, this one makes money, it literally doesn't matter which of these you would have",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 14,
      "start_timestamp": "00:07:55",
      "start_timestamp_seconds": 475.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=475"
    }
  },
  {
    "text": "you go to the 17th, in 25 and sell a put. If we take a look at all of these, what do they perform like relative to the underlying goes going up? This one makes money, this one makes money, it literally doesn't matter which of these you would have selected if you have a system that led you to be bullish here, whatever that is. Now, there's a lot of nuance between them and this is why the behavior of options becomes so important to understand because if we go back to this scenario, there's a couple things that we can tell right out of the gate. We know that these 15 DTE options are going to be cheaper than buying these 78 DTE options. We also know that these 20 D's 24 15 DTE calls are going to expire at an exponential rate compared to the further out in time options. So if we take a look at the at the money's here, you're getting a 50 delta, you're losing 53 cents a day. If I go out here to 78 days, slightly in the money, I know that they're going to be more expensive. I know that they're going to have more extrinsic value, but they're going to have a lower daily theta. Take a look, 26 cents of theta. I also know by going further out in time, these are going to be more sensitive to changes in Vega in volatility than the near term options.",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 14,
      "start_timestamp": "00:08:53",
      "start_timestamp_seconds": 533.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=533"
    }
  },
  {
    "text": "they're going to have more extrinsic value, but they're going to have a lower daily theta. Take a look, 26 cents of theta. I also know by going further out in time, these are going to be more sensitive to changes in Vega in volatility than the near term options. I also know that the near term options are going to have more gamma than these, which is why I go slightly deeper in the money to get more delta. This is the process of actually learning how options behave. So that then you can build the thing that makes the most sense based on your idea. This is why there is no best anything. It's all highly dependent on what you're expecting to see. So going back to this example, if we take a look at the subsequent move, literally all of those would have made money. It's just a question of how much money? So then this starts opening up the conversation about creating a feedback loop, being organized and focusing on edge over time. The feedback loop using Tesla trade as an example would be, I think it's going to break out here and go up. So I'm going to place a trade, maybe a paper trade, and then I'm wrong and it goes down. Okay? I got to track that. So then I'm going to put that in my trading log because I'm going to be trading a strategy that I defined in my trading plan",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 14,
      "start_timestamp": "00:10:02",
      "start_timestamp_seconds": 602.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=602"
    }
  },
  {
    "text": "I'm going to place a trade, maybe a paper trade, and then I'm wrong and it goes down. Okay? I got to track that. So then I'm going to put that in my trading log because I'm going to be trading a strategy that I defined in my trading plan that I researched that I generally think makes sense. But then as I'm logging these different traits, I'm noticing it's not working. So that means I need to change something. Now, while most traders are worried about what DTE is best, none of them are best. What matters is your ability to express ideas using options and then slowly iterate on them to make them better based on your style of trading, whether you like to buy options, sell options, do both short term, long term, all of these are choices available to you. Now, another thing that is so important when we're talking about the behavior of options is volatility. And it's because if we take a look at all of these other things that you're doing, you're going to notice that sometimes you might be directionally correct, but your trade still lost money. And then you're like, well, what the hell happened? Well, a lot of times volatility did some dig a dirty, did some nasty that you didn't expect and you didn't plan for. So volatility is a force that's underpinning literally every trade you could ever place as an options trader, whether you choose to focus",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 14,
      "start_timestamp": "00:10:58",
      "start_timestamp_seconds": 658.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=658"
    }
  },
  {
    "text": "what the hell happened? Well, a lot of times volatility did some dig a dirty, did some nasty that you didn't expect and you didn't plan for. So volatility is a force that's underpinning literally every trade you could ever place as an options trader, whether you choose to focus on vol or directional style trading. Last, a couple of things to know on. Your ability to adhere to a process versus an outcome is probably going to be one of the actual determining factors of your ability to be successful over time. What this means is can you sit down and can you think about different profit mechanisms and create a plan on how to make money from them? I have a video that talks about the outlier strategy process. That's the exact point of that. Look at different profit mechanisms and figure out what strategies make sense for those. Then can you place a trade following your plan that's researched consistently over time, avoiding this urge to strategy hop because things go through different paths where it works, then it doesn't work, and then you move to something else and you have nothing to show for it. If you can learn to focus on the adherence of a process, which means taking all of the different feedback you get from your trades, baking it back into your approach, refining your strategy, that is going to ultimately lead to your success over anything else. And it's because trading is",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 14,
      "start_timestamp": "00:12:04",
      "start_timestamp_seconds": 724.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=724"
    }
  },
  {
    "text": "you can learn to focus on the adherence of a process, which means taking all of the different feedback you get from your trades, baking it back into your approach, refining your strategy, that is going to ultimately lead to your success over anything else. And it's because trading is not like the kind of thing where you go to Vegas, you put it all on black, you win your bucket of money, tons of money, hopefully. And then you never touch a casino again. That is what we call a massive outlier, but they do happen. Options trading for most of us is literally going to be tens of thousands of trades over your trading career, which hopefully is very long. So what that means is the impact of any one individual trade really doesn't matter that much. For most people like me, this is going to be something you're going to have to do consistently over time for a long time in order to make a lot of money, but that's the cool part is you can make a lot of money doing this if you focus on the right things which most people don't. If you have any questions, let me know. I'll be in our last video later.",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 14,
      "start_timestamp": "00:13:03",
      "start_timestamp_seconds": 783.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=783"
    }
  },
  {
    "text": "any questions, let me know. I'll be in our last video later.",
    "metadata": {
      "video_id": "CzPirDlJWgM",
      "title": "What Actually Matters in Options Trading",
      "url": "https://www.youtube.com/watch?v=CzPirDlJWgM",
      "upload_date": "",
      "duration": 852.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 14,
      "start_timestamp": "00:14:07",
      "start_timestamp_seconds": 847.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=CzPirDlJWgM&t=847"
    }
  }
]