[
  {
    "text": "What's up, outliers? We're on the mobile setup today and I open up the platform and GameStop rallies 6.34. So a really, really big day and I want to talk about it for a few different reasons. The first thing I want to talk about is shout out to Benzenga here who's talking about some homies taking a bearish sentiment towards GameStop. We'll talk about that. I see what they're talking about. Really a series of larger transactions here, but I think that they're missing a lot of other pieces that are worth talking about. So the overall story narrative here is a little bit interesting. So take a look at the candle. It had very little down tick and then it almost cracked above. I mean, we are so close to cracking above 30. If I zoom this out to a one-year daily, you can see that we are just below that 30 handle, which is we talked about before. It's kind of like the next area of resistance, at least as far as I see it. These kinds of candles are interesting. And again, I'm not super big into candlestick analysis beyond trying to use it to infer what the market is doing on the back end. And what this means is take a look at the volume bar for today. It was essentially all by volume. So I'm looking at 12.9 million shares traded. And 6 of that was sale volume with 94 as buy volume. So",
    "metadata": {
      "video_id": "d_pt7wcQRnk",
      "title": "Gamestop at $30 Breaking Down the Move & Options Analysis",
      "url": "https://www.youtube.com/watch?v=d_pt7wcQRnk",
      "upload_date": "",
      "duration": 645.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=d_pt7wcQRnk&t=0"
    }
  },
  {
    "text": "what the market is doing on the back end. And what this means is take a look at the volume bar for today. It was essentially all by volume. So I'm looking at 12.9 million shares traded. And 6 of that was sale volume with 94 as buy volume. So this is actually way, way, way busier than I would have expected leading into earnings like this kind of move. I genuinely was expecting it definitely to be in the 30 like this range that I defined. I think we talked about this on the recent live stream, but I didn't expect it to be this sec of a move. I thought that it would be kind of more days like this, more days like this, more days like this, more kind of like inside days that are continuing to grind and follow this trend. But that's not what was in mind here. So the high we hit again, I mean, we're just a few pennies off, which is pretty impressive. The fact that this is also done on really big volume is important. Now, if we take a look, I think you can see it, yeah, you can see it down here on the oscillators. The oscillators aren't even tighter yet. So this is using a RSI that has a 7-day VWOP moving average. And they're hovering, I mean, just at really healthy levels, it is depending on whether you use 80, 20 setup or 70, 30. I kind",
    "metadata": {
      "video_id": "d_pt7wcQRnk",
      "title": "Gamestop at $30 Breaking Down the Move & Options Analysis",
      "url": "https://www.youtube.com/watch?v=d_pt7wcQRnk",
      "upload_date": "",
      "duration": 645.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 10,
      "start_timestamp": "00:01:34",
      "start_timestamp_seconds": 94.80000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=d_pt7wcQRnk&t=94"
    }
  },
  {
    "text": "it down here on the oscillators. The oscillators aren't even tighter yet. So this is using a RSI that has a 7-day VWOP moving average. And they're hovering, I mean, just at really healthy levels, it is depending on whether you use 80, 20 setup or 70, 30. I kind of prefer 80, 20 just because it really emphasizes extremes a bit more, but some that are a little more conservative will use stuff like 70, 30, but you'll spend a lot of time above 70. So and that's, I mean, really case in point here. Now, the moving averages are expanding in terms of width, which means that we're seeing overall volume on the buy side expand. Now, what I am eager to see is this moving average here, which is a longer term moving average. This one is 120 day moving average. And it's not yet upward sloping. It's kind of taken its time, which is a little interesting to me because we have the 10, the 20, the 50 here, and then this one is like a six month of 120. You'd use 120, 150. Whatever it was you're about actually let's flip this real quick to a 150. I just want to see what it looks like. This is 150 is a little more widely used than 120. So I'm wondering what that's looking like. Let's see. Okay. So yeah, this kind of captures a little bit more of this move better because it's gathering a",
    "metadata": {
      "video_id": "d_pt7wcQRnk",
      "title": "Gamestop at $30 Breaking Down the Move & Options Analysis",
      "url": "https://www.youtube.com/watch?v=d_pt7wcQRnk",
      "upload_date": "",
      "duration": 645.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 10,
      "start_timestamp": "00:03:09",
      "start_timestamp_seconds": 189.60000000000002,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=d_pt7wcQRnk&t=189"
    }
  },
  {
    "text": "a 150. I just want to see what it looks like. This is 150 is a little more widely used than 120. So I'm wondering what that's looking like. Let's see. Okay. So yeah, this kind of captures a little bit more of this move better because it's gathering a little bit more the longer term breadth. So really all we need is this last moving average to pop above that 150. And we have a little bit of like strong alignment and continuation of the moving averages, which is cool to see. We still are coming into earnings, which is on the fourth of December right now after the close. We'll see if it remains there. And I mean, the move here is nothing to scoff at. And I think what I'm looking for now is how does it behave around the 30 handle? And the reason why I care about that is because when I look for support and resistance between kind of 35 and 30, it's super light. So this area that it's building in now is hands down the breadth of trading volume for the last six month period. And then even if we move out to the last year, you can see. So the cool thing is we're seeing the bulk of trading volume sliding up and up and up. So that means that again, the value of the stock is being considered by more people. Now, the overall strength of the trend, I think,",
    "metadata": {
      "video_id": "d_pt7wcQRnk",
      "title": "Gamestop at $30 Breaking Down the Move & Options Analysis",
      "url": "https://www.youtube.com/watch?v=d_pt7wcQRnk",
      "upload_date": "",
      "duration": 645.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 10,
      "start_timestamp": "00:04:44",
      "start_timestamp_seconds": 284.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=d_pt7wcQRnk&t=284"
    }
  },
  {
    "text": "to the last year, you can see. So the cool thing is we're seeing the bulk of trading volume sliding up and up and up. So that means that again, the value of the stock is being considered by more people. Now, the overall strength of the trend, I think, is at risk here. If we get another couple big continuation days, obviously, then it looks like a continuation. But this also looks like it can roll over in trend sideways into earnings, right? So we can see this upper trend. It hits kind of that 30-ish handle very close on the 20th. And then it's been rolling sideways a bit, big up day closing near the highs, which is good. So possibility for a continuation is not small. I think that it's pretty fair as I see it here. But it also tends again, we tend to see slightly more mellow movement coming into earnings, although we already talked about we looked at the probabilities. What was it? On the live stream two days ago, and the probabilities are really, really strong for a healthy move. So and it was up to like 35, I think, if I'm not mistaken. So let's take a look now at the options chain and see what happened today. So we had 210 closing calls trading in 29,000 puts and the overwhelming majority of those calls around the buy side. So this is people building to the long side. And that's why that",
    "metadata": {
      "video_id": "d_pt7wcQRnk",
      "title": "Gamestop at $30 Breaking Down the Move & Options Analysis",
      "url": "https://www.youtube.com/watch?v=d_pt7wcQRnk",
      "upload_date": "",
      "duration": 645.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 10,
      "start_timestamp": "00:06:19",
      "start_timestamp_seconds": 379.20000000000005,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=d_pt7wcQRnk&t=379"
    }
  },
  {
    "text": "mistaken. So let's take a look now at the options chain and see what happened today. So we had 210 closing calls trading in 29,000 puts and the overwhelming majority of those calls around the buy side. So this is people building to the long side. And that's why that benzenga thing I had it up in the beginning. I thought it was kind of cute. They they were talking about a couple, you know, different positions that people were building. But I could just tell from the underlying activity today and then the overall options volume that I took peak at that there's way more bullish position going on here, like light years more bullish positioning. And if you take a look at the majority of the puts, they're on the sell side. So there are definitely people buying puts. Why wouldn't there be? It's starting to get in your highs, but it's a really small subset of the overall volume that we see. Now let's take a look at where the volume was. This is interesting. This is really interesting because we broke out of all of the volume being in the front expirations. And now it looks like we're back in the front expirations. The majority of the volume here is in 29,000 in six days. And those are two non-standard expirations. Although 60s does capture earnings. So I would expect to see 60s to be a little more active just simply from the fact that it",
    "metadata": {
      "video_id": "d_pt7wcQRnk",
      "title": "Gamestop at $30 Breaking Down the Move & Options Analysis",
      "url": "https://www.youtube.com/watch?v=d_pt7wcQRnk",
      "upload_date": "",
      "duration": 645.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 10,
      "start_timestamp": "00:07:54",
      "start_timestamp_seconds": 474.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=d_pt7wcQRnk&t=474"
    }
  },
  {
    "text": "like we're back in the front expirations. The majority of the volume here is in 29,000 in six days. And those are two non-standard expirations. Although 60s does capture earnings. So I would expect to see 60s to be a little more active just simply from the fact that it has earnings. So this is interesting to me. Now let's take a look at two more things. I want to look at the open interest. We're still bulk out in 17, Jan 25. So there's longer positions that we've talked about plenty of times now. The other thing I want to take a look at is changes in OI for these individual expirations cycles. So take a look at this. This is all build out. All of this green, I'm tracking. It's a custom thingscript that I've built. And I'm tracking the change in open interest from yesterday into today. And then today this is going to go up again because there's 31,000 calls at the 30 handle expiring 29. And there was only 25,000 open interest. So that tells us that least 6,000 of these are going to be added onto this, which is again, people really, really bullishly positioning. It looks like people are expecting this move to heat up a little bit. I'm interested in that theory. Maybe you guys know a little bit more about it than I do. I would love to learn about it because with earnings coming up, normally companies will be a",
    "metadata": {
      "video_id": "d_pt7wcQRnk",
      "title": "Gamestop at $30 Breaking Down the Move & Options Analysis",
      "url": "https://www.youtube.com/watch?v=d_pt7wcQRnk",
      "upload_date": "",
      "duration": 645.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 10,
      "start_timestamp": "00:09:28",
      "start_timestamp_seconds": 568.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=d_pt7wcQRnk&t=568"
    }
  },
  {
    "text": "positioning. It looks like people are expecting this move to heat up a little bit. I'm interested in that theory. Maybe you guys know a little bit more about it than I do. I would love to learn about it because with earnings coming up, normally companies will be a little more mellow into earnings. So if this were me, I wouldn't be yolowing into the 29, no expiration. Unless again, I'm like supremely convicted that there's something expected here. So I don't know if there's something from like the emoji timeline that you guys know about or if there's some other confidence that people are expecting to hit sometime this week. Again, I'm traveling. So I haven't been as close to the news. So you guys will have to keep me up to speed. So let's take a look at 6Ds. This is mostly build out much smaller though, right? Take a look at the OI change here at the 30s. It's 342. Take a look at the change at the 30s here. It's 2,522 with another 31,000 traded today. So these are people playing the front expiration hard, really, really hard. Same thing out here. We're not seeing anywhere near the same amount of build out further out in time. So it looks like we're back to the good old play the front move here, which is always interesting to see. Now, last thing I want to take a look at quick is I guess we'll just zoom",
    "metadata": {
      "video_id": "d_pt7wcQRnk",
      "title": "Gamestop at $30 Breaking Down the Move & Options Analysis",
      "url": "https://www.youtube.com/watch?v=d_pt7wcQRnk",
      "upload_date": "",
      "duration": 645.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 10,
      "start_timestamp": "00:11:03",
      "start_timestamp_seconds": 663.5999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=d_pt7wcQRnk&t=663"
    }
  },
  {
    "text": "anywhere near the same amount of build out further out in time. So it looks like we're back to the good old play the front move here, which is always interesting to see. Now, last thing I want to take a look at quick is I guess we'll just zoom this in all the way. And let's take a look and see if there's any interesting options transactions that have happened today in GameStop. So let's go today and we'll keep the mid as well. And I'm going to keep the puts off. Let's just eyeball this shall we? Okay. I don't see a lot that's like jumping out at me is crazy. There definitely are some decent sized trades, but these are like pretty small relative to what we typically see, right? 154,000, 155, 150, those are all relatively small trades. Let's take a look at the put side real quick, just see if there's any big put transactions. No, so relatively quiet on the options front. Now, what that tells me is that most of what we're seeing from the options trade side of things is that they're just a bunch of different people playing a bunch of different size positions. So there's not like these really big trade buildings. So really, really interesting to see this moving GameStop is always if you guys have any information as to why this week, why it looks like 29 noves piping up. I'd love to hear about it because yeah,",
    "metadata": {
      "video_id": "d_pt7wcQRnk",
      "title": "Gamestop at $30 Breaking Down the Move & Options Analysis",
      "url": "https://www.youtube.com/watch?v=d_pt7wcQRnk",
      "upload_date": "",
      "duration": 645.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 10,
      "start_timestamp": "00:12:38",
      "start_timestamp_seconds": 758.4000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=d_pt7wcQRnk&t=758"
    }
  },
  {
    "text": "different size positions. So there's not like these really big trade buildings. So really, really interesting to see this moving GameStop is always if you guys have any information as to why this week, why it looks like 29 noves piping up. I'd love to hear about it because yeah, normally days that have quiet market periods like Thanksgiving, these weeks generally tend to be a little bit more quiet, but is preusual GameStop tends to buck the trend. So let me know what you think's going on and then also how we're positioning into earnings because that's another thing that's coming up real soon. Let me know if you need anything. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "d_pt7wcQRnk",
      "title": "Gamestop at $30 Breaking Down the Move & Options Analysis",
      "url": "https://www.youtube.com/watch?v=d_pt7wcQRnk",
      "upload_date": "",
      "duration": 645.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 10,
      "start_timestamp": "00:14:13",
      "start_timestamp_seconds": 853.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=d_pt7wcQRnk&t=853"
    }
  }
]