[
  {
    "text": "super quick video for the eight outliers out there to fund not to share. So at zero nine, we have Warren Kitty dropping Woody with obviously the dog stock. That's what this clearly represents not so cryptic in this sense back into the toy box. And so would we know? Well, we know probably that he's closing if not exited the entire chewy position. And then the other interesting thing is that if we take a look at what's happened today in the options market, I can show you that there's one point one two million dollars that went into the 13-Sept 22 and a half calls. Who knows who it is? I don't. But I do know some people that tend to move in this kind of size around this position. And then if you take one look below that at eight forty two, we see another six hundred and nineteen thousand dollars same strike same expiration. So to me, it looks like there's a little bit of a shift going on. And right now the phone is freaking out because I have a bunch of trades that are moving around as they should be because if we take a look at games. Game stop is now up over six percent already and we're leading into earnings. This is exactly what I've been talking about with respect to. As soon as there's a catalyst, the stock starts to move and right now it looks like the catalyst is very",
    "metadata": {
      "video_id": "DeQ8wc28Bic",
      "title": "Roaring Kitty Out of CHWY into GME?",
      "url": "https://www.youtube.com/watch?v=DeQ8wc28Bic",
      "upload_date": "",
      "duration": 180.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 3,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=DeQ8wc28Bic&t=0"
    }
  },
  {
    "text": "a look at games. Game stop is now up over six percent already and we're leading into earnings. This is exactly what I've been talking about with respect to. As soon as there's a catalyst, the stock starts to move and right now it looks like the catalyst is very much likely to be the cat. If we take a look through time in sales now, it's flying off the shelf. If we take a volatility the front vol is now over four hundred percent. This is where things start to get real interesting because there's a lot going on now, especially as this news gets out moves around. People are going to be looking at game stop pretty pretty hard because for a while people are started to get a little disenfranchised thinking that you know maybe DFV moved on but I think most of the community was pretty resolute that he was doing his thing probably going to come back. I think that's what the vast majority of people probably thought. And I mean you can just see we're flooding in now. So if we take a quick look at the open or the volume for today, you'll see that there is a hundred and thirty one thousand contracts traded and then if you take a look over here at this box which represents the thirteen step, the twenty two and a halfs thirteen thousand three sixty three twenty two and a halfs. So those are slightly in",
    "metadata": {
      "video_id": "DeQ8wc28Bic",
      "title": "Roaring Kitty Out of CHWY into GME?",
      "url": "https://www.youtube.com/watch?v=DeQ8wc28Bic",
      "upload_date": "",
      "duration": 180.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 3,
      "start_timestamp": "00:01:12",
      "start_timestamp_seconds": 72.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=DeQ8wc28Bic&t=72"
    }
  },
  {
    "text": "see that there is a hundred and thirty one thousand contracts traded and then if you take a look over here at this box which represents the thirteen step, the twenty two and a halfs thirteen thousand three sixty three twenty two and a halfs. So those are slightly in the money. That's a slightly different move. Then we've seen previously but can't help but enjoy the show up over eight percent now in two and a half minute three minute video. So I mean we just got to keep an eyeball on this. I'll do a bigger video later today kind of recapping what goes down but too exciting not to share it's up almost nine percent already. So watch the fireworks in joy. See you all later.",
    "metadata": {
      "video_id": "DeQ8wc28Bic",
      "title": "Roaring Kitty Out of CHWY into GME?",
      "url": "https://www.youtube.com/watch?v=DeQ8wc28Bic",
      "upload_date": "",
      "duration": 180.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 3,
      "start_timestamp": "00:02:14",
      "start_timestamp_seconds": 134.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=DeQ8wc28Bic&t=134"
    }
  }
]