[
  {
    "text": "What's up everyone? Eric here. Welcome back to the outlier podcast. I have David Hunter back yet again for another update to see what he's seeing in the markets. Welcome back David. Great to see you. Yeah, great to see you Eric. Thank you. Of course we had a chance to talk really quick. I heard that you are enjoying the northeastern weather. It's not humid at all or anything like that. Just be perfect. Yeah, typical new England weather. It's in the 90s and I think today they said it feel like a hundred so we're getting our summer weather, you know, but they just wait a minute a little change. I know that's I tell you what that is the good thing about the northeast isn't it is that if you don't like one of them, you just wait a month or two and then it's going to look real different. Yeah, definitely speaking of looking real different, a completely unintended segue, but a perfect one. The last time we spoke, the markets looked quite a bit different than what they do now and I mean realistically in the past week or two, things have started to capitulate pretty meaningfully. So I figured that we could start with a little bit of a gap analysis from your perspective from the last time we spoke about a quarter ago into now. What are the main themes that have transpired from your perspective? Yeah, I think the big one obviously",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=0"
    }
  },
  {
    "text": "pretty meaningfully. So I figured that we could start with a little bit of a gap analysis from your perspective from the last time we spoke about a quarter ago into now. What are the main themes that have transpired from your perspective? Yeah, I think the big one obviously is that the economy is showing more weakness. It's showing signs of slowing down and inflation is also trending down. So, you know, we came into this year expecting that first quarter surprise people with higher inflation numbers and everybody went from expecting seven six or seven cuts this year to, you know, more recently, are we going to even get a cut. So I think what's happened in the last couple months is you've gotten softer economic news again and again, I keep stressing this that nothing is a straight line. So, you know, you're not winning your things and so the economy isn't either you're going to get statistics and as well as with seasonal adjustments, it makes it harder to get real numbers. But you're going to have ebbs and flows and all these data and yet, both the street and the Fed tend to, you know, look at this data as if it's a given. Look, inflation is ticking up so we got to go the other way and so they they went from, you know, six cuts or at least that was what the street was expecting six or seven. I can't remember to where",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 57,
      "start_timestamp": "00:00:53",
      "start_timestamp_seconds": 53.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=53"
    }
  },
  {
    "text": "look at this data as if it's a given. Look, inflation is ticking up so we got to go the other way and so they they went from, you know, six cuts or at least that was what the street was expecting six or seven. I can't remember to where the Fed was talking about maybe we won't have a cut this year. Most of them were still talking one or two cuts, but. And then all of a sudden, you know, in May and June, we've had into July, we've had some numbers that confirm that the economy is continuing to slow and moving towards recession, in my opinion, and then inflation is ticking down. You've got that true, inflation number out there, which is a private number that supposedly has had better track record than the government figures and that's coming in at just under the Fed's target of 2. You know, the PC PCE deflator, which is the Fed's favorite inflation gauge came in at 2.6. So we're not far away and Paul's stressed over and over through the year. And before that we're not going to wait until we get to 2 because by then we've probably waited too long. In fact, he just said that again this past week. So I think that's pretty much telling you you were at the level where rate cuts can happen. I've even said we could see a rate cut in Joel at the July meeting, which is the",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 57,
      "start_timestamp": "00:02:12",
      "start_timestamp_seconds": 132.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=132"
    }
  },
  {
    "text": "probably waited too long. In fact, he just said that again this past week. So I think that's pretty much telling you you were at the level where rate cuts can happen. I've even said we could see a rate cut in Joel at the July meeting, which is the last day of this month. You still got two weeks of data to come. So we'll see it's not the expectation of the streets, the streets expecting a September cut. And I think the probabilities there are 80 or 90. Yeah, it's at 100. Yeah, so, but what's the July number? Do you know? Yeah, right now it's showing 6.7 probability of an ease 93.3 probability of no change 0. Yeah, so that's that's where the street is. I would not be shocked to see a cut. It would surprise, but I don't think Paul's not going to wait until July 31st and then spring it on you. I think the odds are if we're going to see a cut, we'll know it as we move into the end of the month. So, you know, if we get if we continue to get some weaker numbers here, then I think it cut as a real possibility. If we don't get numbers that really say that, you know, they're kind of marking time. Then I think we just wait till September, but you know, again, it's a, but likelihood is it's a quarter point. It's possible if we wait till September",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 57,
      "start_timestamp": "00:03:30",
      "start_timestamp_seconds": 210.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=210"
    }
  },
  {
    "text": "it cut as a real possibility. If we don't get numbers that really say that, you know, they're kind of marking time. Then I think we just wait till September, but you know, again, it's a, but likelihood is it's a quarter point. It's possible if we wait till September to have point, but the likely is quarter point. People are, you know, I've seen that narrative around that if they do it in July, it's going to send the signal that they're panicking and something's wrong. You know, the economy is worse than expected or something. For a quarter point cut, come on people, you know, it doesn't matter really all that much. It just would be starting the clock a bit earlier. And I do believe the fed is overly restrictive and that we are running the risk that they've stayed the party too long here on the on the tight side. So, if it were up to me, I would say they should do in July. Obviously, that's not where the street is right now. That's, you know, the fed has not sent a signal to the street that that's likely. But, you know, I think in the next couple of weeks, we could see us build towards that. I would count on it, but I think it's possibility. Yeah, I see your angle there. Two questions to probe into from a general learning perspective for people. You mentioned that the PCE deflator is kind of like",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 57,
      "start_timestamp": "00:04:30",
      "start_timestamp_seconds": 270.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=270"
    }
  },
  {
    "text": "the next couple of weeks, we could see us build towards that. I would count on it, but I think it's possibility. Yeah, I see your angle there. Two questions to probe into from a general learning perspective for people. You mentioned that the PCE deflator is kind of like the feds go to tool. Why is that? It tends to be more stable, you know, consumer price index bounces around a lot. So the makeup of the PCE tends to be less up and less down, you know, not as volatile. So I think they feel it's a more representative number. You can react to these big swings and, you know, it isn't probably the best thing to do. So it's just over the years been the one that they feel is probably a better indicator. Yeah, that makes sense. And then the other thing I wanted to ask you about was last time we spoke you had mentioned that you had felt that we might have been getting to the point of being over tightened. And that was about a quarter ago. How do you think we've fared since then and what impact do you think maintaining the current policy that additional quarter and then potentially, you know, another couple months before we do cut. Do you think that that drastically increases probability of some sort of whipsaw effect? Do you think it's like moderate probability? How do you view the impact of keeping rates where they have",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 57,
      "start_timestamp": "00:05:40",
      "start_timestamp_seconds": 340.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=340"
    }
  },
  {
    "text": "current policy that additional quarter and then potentially, you know, another couple months before we do cut. Do you think that that drastically increases probability of some sort of whipsaw effect? Do you think it's like moderate probability? How do you view the impact of keeping rates where they have been for the duration they've been? Yeah, this is an interesting one because there are lots of people out there still saying we don't need cuts. You know, why would they cut? And then you got people like me saying, no, I think what closer to recession than people realize in fact, I would not be surprised at all that when the NBE are the national bureau of economic research who are the official determiners of when our recession starts, they don't really date it until after the fact. And once we're recovery, they'll look back. But I would not be surprised at when they go back that they'll say the recession began before this. So we could have been recession in June even where we're on the verge. I think a recession is, you know, anytime between June of this year and this fall, we may already be in it or maybe just heading towards it. But the problem is leads and lags. And by the time you react to that, if you wait, you're basically a year late, you know, at least eight or nine months late, maybe a year late. So and with the momentum of something,",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 57,
      "start_timestamp": "00:06:42",
      "start_timestamp_seconds": 402.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=402"
    }
  },
  {
    "text": "it or maybe just heading towards it. But the problem is leads and lags. And by the time you react to that, if you wait, you're basically a year late, you know, at least eight or nine months late, maybe a year late. So and with the momentum of something, if it starts deteriorating, it just starts picking up speed like a snowball going downhill. And so by the time you're policy starts gradually. And then you know, you increase it as you go, you know, you're just you're just stretching out the pain. And if you're if your objective is soft landing, which Paul claims it is and it should be. And you know, you're running a risk when you wait too long that not only is it not going to be a soft landing. That the amount of stimulus required to pull you out of that hard landing is going to jack me on jump up another inflation cycle much, much bigger. So, you know, if you do it kind of right, which is not not probably realistic because the Fed never does it quite right. But they did, you know, you're you're easing just as things are slowing down to that almost to the recession point, but you turned it before you got there. And you don't need super stimulus to get you out of it, just turns it back in the other direction. And then it doesn't ever happen we've seen cycle after cycle the fence",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 57,
      "start_timestamp": "00:07:48",
      "start_timestamp_seconds": 468.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=468"
    }
  },
  {
    "text": "slowing down to that almost to the recession point, but you turned it before you got there. And you don't need super stimulus to get you out of it, just turns it back in the other direction. And then it doesn't ever happen we've seen cycle after cycle the fence stays a party too long on the tight side. And then over Jesus, because of the crisis that create and it leads to another inflation cycle. So that's that's my concern is that that's where we're at. Now, again, it's a quarter point is it going to make a drastic difference whether they cut now or wait till September. Probably not. But if you can get it started now, you might avoid some of the real downside that I think it's coming out. You know, I'm calling for a global bust in the next year. So I don't have a lot of optimism that they're going to manage this correctly, but, but, you know, that's the whole. I thought it. Recently, there was a couple of Fed speakers that were even talking about potentially raising rates. And we saw a few comments of that in the last couple of weeks, which I thought to me looked more like messaging, but I didn't fully understand the comments and why they would come through that way as compared to maintaining the very data driven decision making that really Powell has been focused on. So I'm surprised to see that. Did you take",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 57,
      "start_timestamp": "00:09:09",
      "start_timestamp_seconds": 549.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=549"
    }
  },
  {
    "text": "which I thought to me looked more like messaging, but I didn't fully understand the comments and why they would come through that way as compared to maintaining the very data driven decision making that really Powell has been focused on. So I'm surprised to see that. Did you take anything from that? Does it mean anything to you when some of the other committee members say stuff like that? Well, I will say there are, you know, different voices on the FOMC. I truly enough said this to you before I truly believe Powell and I think same thing pretty much for all of the FOMC members. I think they're straight shooters. They are giving you their their view of things and rightfully so there should be different views or what you don't want is group things. So I can understand. I don't agree with it, but I can understand the narrative, the concern for those people is if we don't get inflation down and get it down for good or you'll get it down to a level where it's really been taken care of. We run the rest that we ease prematurely and inflation heats up quickly and we're going to have a harder time second time getting getting the GD back in the bottle. So I get the sentiment I think they're wrong. I think because of my 50 years of watching cycles and watching the Fed. History tells you the leads and legs are longer than",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 57,
      "start_timestamp": "00:10:13",
      "start_timestamp_seconds": 613.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=613"
    }
  },
  {
    "text": "we're going to have a harder time second time getting getting the GD back in the bottle. So I get the sentiment I think they're wrong. I think because of my 50 years of watching cycles and watching the Fed. History tells you the leads and legs are longer than they realize and that they you know they react too slow and and it ends up being elites to extremes of boom and extremes of bust. So I also think there is when they admit it or not there is a little hangover effect of worrying that hey we were we were slow to tighten the last thing we want to be is too soon to ease you know we don't want to be criticized that we let inflation get out of hand again. So I think they're fighting the last war a little bit those that are worried about that. Now Austin Goalsby is the one that gives me most confidence that he understands that you know you're right on the verge of waiting too long if you haven't already gone too far. You know he's he's careful not to kind of go against the chairman or go against the narrative that's out there right now from the Fed. But if you read between the lines I think he is one that's growing concerned that they can't wait much longer. He's probably the guy if anybody it's going to speak up in the meeting and make the argument that",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 57,
      "start_timestamp": "00:11:29",
      "start_timestamp_seconds": 689.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=689"
    }
  },
  {
    "text": "the narrative that's out there right now from the Fed. But if you read between the lines I think he is one that's growing concerned that they can't wait much longer. He's probably the guy if anybody it's going to speak up in the meeting and make the argument that we could go as soon as now meeting joy 31st. You know whether he'll have enough company doing that I don't know there are a couple of my think in his camp and you know bunch of them kind of on the fence I think. Yeah the the variance and I think you highlight a good point there specifically with regards to building a committee that has diverse viewpoints because I see a lot of people latching on to that and saying oh you know like they don't agree with one another. And I think your perspective in the way that you frame that is probably just good for people to hear and put that in their back pocket to understand that the concept of not agreeing is kind of good in a committee to have a cross flow of information and perspectives now. But when we finish let me just say Paul gets a lot of criticism you know it's the kind of comes with the territory. But I have to say not only have I said this before he's a straight shooter that is not playing politics or not not trying to tell you one thing and doing",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 57,
      "start_timestamp": "00:12:40",
      "start_timestamp_seconds": 760.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=760"
    }
  },
  {
    "text": "just say Paul gets a lot of criticism you know it's the kind of comes with the territory. But I have to say not only have I said this before he's a straight shooter that is not playing politics or not not trying to tell you one thing and doing another he's really telling you what he's thinking what the group is thinking. Secondly I think he's not a guy with a big ego that needs to group to agree with him he's more than happy to have diverse opinions on there he obviously knows it's his role at the end to make the ultimate decision. But I think people are selling him a short if they don't understand that we're lucky he's in that role that big sound I mean I have I have lots of criticism of what I think policy is going to lead to so but I think he's trying his darness to do it right let's put it that way. Yeah and I'm actually also glad that you mentioned that because I think especially for somebody with your kind of the experience obviously you can find little chinks in the armor and things that you're kind of like you know I don't know if that's the way I would have done it or what makes sense but at least to take a moment and reflect on the effort that somebody's putting into something like genuine effort I think that that's typically good to do just",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 57,
      "start_timestamp": "00:13:44",
      "start_timestamp_seconds": 824.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=824"
    }
  },
  {
    "text": "kind of like you know I don't know if that's the way I would have done it or what makes sense but at least to take a moment and reflect on the effort that somebody's putting into something like genuine effort I think that that's typically good to do just for a general health of conversation and whatnot it's so easy to get too entrenched and kind of trounce people for everything. Now when you look at the way that the Fed is likely to navigate this going forward now that we seemingly are getting closer to a cut what's your expectation for how that goes and how the market kind of flows with it. Let's put this way I do think you're probably going to get three cuts this year at least so in other words if it happens in July then you get July and September and you might get a couple more if it waits till September you might get one July and November and December so I would not be surprised to see at least three cuts this year. I don't know whether they're going to be quarter to point cuts or whether they'll start with a quarter and then have to move to a half because things are getting rockier. It's hard to know beyond the first cut what it's going to look like I will say this I think the markets are gearing up here as you know I've had this meltup forecast for",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 57,
      "start_timestamp": "00:14:40",
      "start_timestamp_seconds": 880.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=880"
    }
  },
  {
    "text": "a quarter and then have to move to a half because things are getting rockier. It's hard to know beyond the first cut what it's going to look like I will say this I think the markets are gearing up here as you know I've had this meltup forecast for a long time and whether people understand or not this is meltup when you see meltup. When you see meltup that came from me there wasn't anybody talking meltup you know when I start talking about it years ago so and now it's coming true we're in a meltup as I have said we we really started a meltup last October and it will just get steeper as we go along so there's a parabolic stage into the top that is coming and I think it's coming in August and September might even start you know in August and September. We can start now so I think FETE's or the anticipation of the end of fed tightening and then followed by FETE's is a big reason why we're we're seeing this thing move up because it allows investors particularly institutional investors to start looking over the trough and start raising earnings estimates for next year and the year beyond. Because if the Fed is easing the windows that have not the economies back and you have a better economy and therefore better earnings that's that's essentially what's really going on now with that comes obviously the anticipation's already started in",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 57,
      "start_timestamp": "00:15:52",
      "start_timestamp_seconds": 952.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=952"
    }
  },
  {
    "text": "earnings estimates for next year and the year beyond. Because if the Fed is easing the windows that have not the economies back and you have a better economy and therefore better earnings that's that's essentially what's really going on now with that comes obviously the anticipation's already started in terms of fed ease so the bond markets already been rallying we're down to 417 I think today on the 10 year I expect the 10 year to get down to 2 and a half before the election so that's you know you get a lot of money. We're going to have falling rates in which helps stock market helps valuation stocks that comes because of the anticipation of the Fed as I've said I didn't find item. It doesn't matter whether the Fed cuts or not because the bond market's going to do the cutting bond market's going to do the easing whether the Fed gets it or not the bond market's already seeing that we need to ease that's why rates have fallen from you know 5 last October. To 417 now you know they went from 5 down to 380 back up to 470 and now we're down to 417 on a way below that 380 at some point in the next month but I think so so rates are coming down because the street does it in the aggregate not individual strategist rain buddy but the street in the aggregate aggregate and the bond market in",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 57,
      "start_timestamp": "00:16:50",
      "start_timestamp_seconds": 1010.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1010"
    }
  },
  {
    "text": "down to 417 on a way below that 380 at some point in the next month but I think so so rates are coming down because the street does it in the aggregate not individual strategist rain buddy but the street in the aggregate aggregate and the bond market in the aggregate is understanding that the Fed needs to ease and the thing that's going to be going on. So that low rates obviously stimulate some activity it'll help housing it'll help auto sales etc and with rates I think coming down a lot more from here I think that will be some buffer against the slow down we're getting right now. Even though I think a hard landing is coming in the next year it's possible that we get an ambient flow here where it looks like things are going into recession and all of a sudden because of you know the drop in rates you get a little bounce in housing a little bounce in auto sales and the next month's numbers look better so it's not going to be a straight line into a trough field or a straight line into a recession it can bounce around because there are offsetting things going on in terms of policy. That opens up kind of a stream of questions to take a step back to a more mechanically focused one. Can you walk through the mechanics behind the concept of bonds cutting rates ahead of the Fed. How does",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 57,
      "start_timestamp": "00:18:18",
      "start_timestamp_seconds": 1098.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1098"
    }
  },
  {
    "text": "because there are offsetting things going on in terms of policy. That opens up kind of a stream of questions to take a step back to a more mechanically focused one. Can you walk through the mechanics behind the concept of bonds cutting rates ahead of the Fed. How does that actually play out? So just to go back to real basics you know interest rates and bond prices move in virtually so when the bond market rallies rates coming down the bond market in the aggregate means when all investors that are in the bond market act together so a lot of large numbers so it doesn't mean that you know any individual has figured it all out and is doing it right. It means the bond market in its aggregate is probably a better predictor of interest rates than the Fed so when the bond market is rallying it's already anticipating that the economy slowing down it's going to mean fed ease at some point to not do this in the future so that's how when I make the comment that the bond market leads the Fed it's because it can in its aggregate look at all the data coming in you know the the massive of all the people playing in the bond market all the institutional bond players and bond traders all the you know everybody in the bond market when you put them all together at such a large number it's an efficient discounting of",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 57,
      "start_timestamp": "00:19:07",
      "start_timestamp_seconds": 1147.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1147"
    }
  },
  {
    "text": "data coming in you know the the massive of all the people playing in the bond market all the institutional bond players and bond traders all the you know everybody in the bond market when you put them all together at such a large number it's an efficient discounting of what's going on right it's an efficient discounting sometimes to get it wrong they may discount wrong but but at this point what they are discounting is a slow down economy Fed has probably overtighten their release has tightened and it's not going to be a good example. And it's leading to we're seeing in many different economic pieces of data it's leading to a slow down in the economy maybe a soft landing but maybe deeper than that and so the bond market in its infinite aggregate wisdom is rallying and pushing rates down the Fed which has other concerns you know the one jump the gun too soon you know it's human being a small group of human beings trying to. Call the economy is not as typically I mean most of the time is not as good a predictor of the future as is an aggregate market so I think the bond market is better predictor of what's coming and and in discounting rates at lower rate in discounting the market at lower rates it is saying we think this is going to continue the slow down is going to continue we we're optimistic that inflation is",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 57,
      "start_timestamp": "00:20:26",
      "start_timestamp_seconds": 1226.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1226"
    }
  },
  {
    "text": "so I think the bond market is better predictor of what's coming and and in discounting rates at lower rate in discounting the market at lower rates it is saying we think this is going to continue the slow down is going to continue we we're optimistic that inflation is going south not north. So whether the Fed agrees with that yet or not I think they do but the bond market seeing that and that's that's where I put my faith more than I do individual economists or the Fed etc. Got it and then do you think that there's a reason why if in your opinion we might have waited a little bit too long. Do you why wouldn't have the bond market essentially started to do this earlier because I noticed that like 20 years we started to see a little bit of a tick up kind of almost like monthly it started the beginning of January then we saw a tick up drop down back up and Fed back down back up early March back down. And then we kind of fell off a cliff a bit and then in essentially throughout April so the summary of that question is if the hypothesis is the bond market is kind of forecasting slash executing their own version of rate adjustment based on the aggregate intellect of participants and their forecasting of things. How does that work with your assessment of thinking that we might have waited too",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 57,
      "start_timestamp": "00:21:54",
      "start_timestamp_seconds": 1314.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1314"
    }
  },
  {
    "text": "of that question is if the hypothesis is the bond market is kind of forecasting slash executing their own version of rate adjustment based on the aggregate intellect of participants and their forecasting of things. How does that work with your assessment of thinking that we might have waited too long already wouldn't we have expected to see the bond market then rallying sooner than now. Well keep in mind I'm big picture looking out longer term and have done this for 50 years so I maybe anticipate things ahead. Where's the bond market is day by day looking at that and trade a traders are looking at that and so it's going to have been flow you like I said the first quarter we came into the year expecting better inflation numbers expecting a slow down in the first quarter we had much worse inflation numbers for a couple of for three months in a row and so the bond market reacted to that negatively because expectations coming in we're looking for the opposite. Then you got some better numbers you know and it was up and down for a couple months where you got some better numbers but not every number was better so it kind of had to adjust and wasn't sure which way to go and then finally in June and July we've had much you know much more consistently slower economic data and or data in the game economic slowing and the inflation numbers have",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 57,
      "start_timestamp": "00:23:09",
      "start_timestamp_seconds": 1389.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1389"
    }
  },
  {
    "text": "not every number was better so it kind of had to adjust and wasn't sure which way to go and then finally in June and July we've had much you know much more consistently slower economic data and or data in the game economic slowing and the inflation numbers have come down and look like they're heading south again. The bond market is gaining confidence so it's you know it's not that the bond market can see out a year and say hey we know what's going to go on it's it's constantly readjusting day by day based on you know data but but it is does have kind of a common expectation as it goes along it it summarizes it again it's not it's not a machine or you know it's not a computer that's putting it all together and splitting out an answer. And the aggregate when all the traders and all the bond investors act together they come tend to efficiently kind of discount what's going on. I see yeah that's super helpful thank you. Next question I had for you is looking at the cut scenario you were talking about the probability of you know success of cuts in a row my expectation was whenever we see this first cut even if it's 25 basis points based on Powell's messaging I just had this innate instinct that he would cut and then pause and then see about resuming cutting but based on the timeline that you're",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 57,
      "start_timestamp": "00:24:24",
      "start_timestamp_seconds": 1464.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1464"
    }
  },
  {
    "text": "of cuts in a row my expectation was whenever we see this first cut even if it's 25 basis points based on Powell's messaging I just had this innate instinct that he would cut and then pause and then see about resuming cutting but based on the timeline that you're talking about potentially. Up to three almost there's only four meetings left this year so my timeline wouldn't work well in that case if especially if we skip this coming meeting so I assume I'm obviously much smaller scope than you so the reason why I've arrived at that conclusion or at least the current hypothesis is just from Powell's messaging but obviously you're able to kind of look beyond just what he's saying and you're looking at the at the end of the day. And you're looking at the activity of things so do you think that the rationale for Powell potentially doing these excessive cuts is he would prefer these smaller cuts see how they feed into the system but kind of maintain progress and how would that differ then if he did a cut wait a month doing or wait a cycle do another cut. Yeah I obviously don't have any real insight into what really is going to happen but but I'm my assumption is or the or the reason I think it's possible I'm not saying it will happen this way the reason I think it's quite possible we could see three or four cuts",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 57,
      "start_timestamp": "00:25:36",
      "start_timestamp_seconds": 1536.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1536"
    }
  },
  {
    "text": "obviously don't have any real insight into what really is going to happen but but I'm my assumption is or the or the reason I think it's possible I'm not saying it will happen this way the reason I think it's quite possible we could see three or four cuts this year is because I think the economy is going to you know I think we've I think we've hit the point where the economy is very close to recession if it's done already and I think generally the data is going to continue to soften if that's the case. I think you could by the time you get to the fall be dealing with the fence and hey we're behind the curve ball we've got to get going we're behind the eight ball we've got to start catching up so and I have no like I said before I have no idea whether it will be three or four quarter point cuts or whether if things start to accelerate to the downside he says okay the first cut is a quarter but then we get to the next meeting it goes we need to be talking about bigger cuts because things are going to be good and we're going to be talking about bigger cuts. We start the heads out they do not want to recession right they've been pretty clear that they want to solve landing it's interesting think of America as a survey came out I think",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 57,
      "start_timestamp": "00:26:58",
      "start_timestamp_seconds": 1618.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1618"
    }
  },
  {
    "text": "because things are going to be good and we're going to be talking about bigger cuts. We start the heads out they do not want to recession right they've been pretty clear that they want to solve landing it's interesting think of America as a survey came out I think today they survey portfolio managers across you know institutional landscape and it's a pretty good indicator of where institutional investors are and right now institutional investors are mostly talking soft landing. 11 out of you know 100 11 are calling ours saying we could see hard landing I think it's in the next year it might be next 12 to 18 months but only 11 of portfolio managers in that survey are looking for a hard landing I'm looking for a hard landing I mean I think I'm looking for a very hard landing so that shows you that the vast majority are living in the world that we're in today which looks like a soft landing right they're not looking at it. Their head in seeing any problems that concern that are leading them to say yep it's going to get a lot worse I think the Fed's kind of that same boat of right now looking at today we're in the soft landing and let's again and they're extrapolating out that that is a very common thing in the markets and I think in the Fed is to extrapolate what's going on today I always say that if",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 57,
      "start_timestamp": "00:27:27",
      "start_timestamp_seconds": 1647.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1647"
    }
  },
  {
    "text": "of that same boat of right now looking at today we're in the soft landing and let's again and they're extrapolating out that that is a very common thing in the markets and I think in the Fed is to extrapolate what's going on today I always say that if you look at economic forecast mostly they're going to go back to the beginning of the market and then they're going to go back to the market. they're telling you what happened or what's happened behind you, not what's happening ahead, right? They're extrapolating what just happened. If you're on a very windy road and you're deciding you're gonna drive with the rear roof nearer, you're gonna be off the road, right? Well, that's why economists get a bad name or oftentimes their forecasts don't come close because they're looking at data, which is by definition backward looking, but then they're looking at data, which is backward looking. And then they're pretty much extrapolating it. Now they're not dummies, they can kinda factor in other things if they have reason to, but generally that's why you get what you get. And then if you get an inflection point where things start changing rapidly, they've gotta change their forecast and they will. So I'm, you know, some of my bet that we could see three or four cuts this year is obviously a bet but the second half's gonna be much slower than the first half. I could be wrong. Yeah,",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 57,
      "start_timestamp": "00:28:57",
      "start_timestamp_seconds": 1737.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1737"
    }
  },
  {
    "text": "start changing rapidly, they've gotta change their forecast and they will. So I'm, you know, some of my bet that we could see three or four cuts this year is obviously a bet but the second half's gonna be much slower than the first half. I could be wrong. Yeah, I'm not. I don't really pride myself on being able to call the next few months or, you know, that's not my game. So, but I still have an opinion, but it doesn't mean, you know, that's not worth my confidence lies. Right. Now it seems like the scenario laid out for the meltup idea is still highly likely predicated on the market shifting, it's forecasting whenever it sees a different picture going forward. So we've been in a pretty restrictive scenario for some time now that kind of suppresses a lot of things. So I feel like the idea for the meltup as you've described it before seems to, like I get the catalyst for it. When we look at the transition though, from the meltup to a peak, what is it at the peak now that you see as the catalyst, the turning point for the follow on bust? Yeah, I don't know. I mean, I can throw out scenarios, I can throw out possibilities, but I don't have any pre-judgment right now about exactly what it is because what I'm still in the meltup. I mean, we've got the Russell by target on the Russell is 3300,",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 57,
      "start_timestamp": "00:30:10",
      "start_timestamp_seconds": 1810.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1810"
    }
  },
  {
    "text": "bust? Yeah, I don't know. I mean, I can throw out scenarios, I can throw out possibilities, but I don't have any pre-judgment right now about exactly what it is because what I'm still in the meltup. I mean, we've got the Russell by target on the Russell is 3300, that's 50 above here. My target on the NASDAQ is 24,000. I did, by the way, I raised it by last letter from 23,000. So that's 30 from here. My target on the SP is 7,000. So you'd probably 25 from here. So those are returns you normally get over two, three, four years, right? And I'm saying they might happen over the next few months. So yes, we're getting closer, but we're not anywhere near in terms of the runway. The runway is still a long runway to get there. It's a steep runway, I think it happens fast. But so I'm not seeing anything right now other than policy mistakes or potential policy mistakes in terms of being too restrictive for too long. And again, what leads to me calling for instead of a plane ordinary recession, a global bust is 320 trillion in global debt. Quadrillions and no-shall value of derivatives. We have never, no cycle in all my 50 years, the previous cycle, obviously, 2007-08 was the biggest leverage cycle we have had. This one's far beyond that one in terms of leverage. Leverage is not something that leads to soft landings or calmness. When you",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 57,
      "start_timestamp": "00:31:30",
      "start_timestamp_seconds": 1890.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1890"
    }
  },
  {
    "text": "no-shall value of derivatives. We have never, no cycle in all my 50 years, the previous cycle, obviously, 2007-08 was the biggest leverage cycle we have had. This one's far beyond that one in terms of leverage. Leverage is not something that leads to soft landings or calmness. When you have leverage and you make a mistake, that mistake gets magnified manyfold. So that's why, I mean, very simply, that's why I am calling for a bust. Do I know that the bust starts before the end of the year or really next? I don't know that. I think that's the best timing I can have is to say if we've started a recession already or we're about to get into a recession, then that recession will ultimately morph into a bust where the recession starts getting worse and that triggers some big financial problems, bank failures and things. And I'm just guessing it's gonna take the several months to get there. So I'm saying towards the end of this year or early next year, you could start the bust. And there's no recession. You can go back a day. A global bust, my definition of bust is just it's an extreme recession, right? But it's a recession that's accompanied by a financial crisis unlike any we've seen before. So that's why I call it bust. We haven't had a bust in the post-World or two era. 2007-08 was pretty close to one, but I don't think we really quick",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 57,
      "start_timestamp": "00:32:54",
      "start_timestamp_seconds": 1974.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=1974"
    }
  },
  {
    "text": "an extreme recession, right? But it's a recession that's accompanied by a financial crisis unlike any we've seen before. So that's why I call it bust. We haven't had a bust in the post-World or two era. 2007-08 was pretty close to one, but I don't think we really quick got there. So I'm calling for something financially that's worse than that, meaning bigger bank failures, bigger crisis in the financial world. And I'm not talking about the market. I'm talking about the financial crisis sector of the economy. And so it's hard to say exactly when that's gonna happen. But I do think there's a pretty good chance it happens. Sometime after the election, probably, and between then and sometime in the first quarter of next year. And then I think it happens fast. It's accompanied by what I'm calling an 80 bear market. So peak to drop an 80 decline in the indexes, which means most of everything is going down. If you have 80 down in your indexes, there's not many stocks that are gonna be holding up, right? So I mean, it's both a bust, which is the economic and financial side of it, and a bear market, which is the market side of it. Got it. Yeah, and just to make sure that the question is clarified, the timeline you laid out makes sense. The main thing I was honing in on specifically is the catalyst. And it sounds like the catalyst is leverage. It",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 57,
      "start_timestamp": "00:34:06",
      "start_timestamp_seconds": 2046.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=2046"
    }
  },
  {
    "text": "bear market, which is the market side of it. Got it. Yeah, and just to make sure that the question is clarified, the timeline you laid out makes sense. The main thing I was honing in on specifically is the catalyst. And it sounds like the catalyst is leverage. It sounds like that's the main thing that we'd... Yeah, I wouldn't call leverage catalyst. I think it's the reason why it's worse and why it is more extreme. I see. And it certainly will be why we have the magnitude of the kind that we have. Cattle is could be a lot of things. Cattle is could be a bank fails here overseas and starts a domino effect. It could be an assassination. It could be all kinds of things that can start the process, but ultimately I think it's the process itself. And also from a market standpoint, you reach top and then you go, what determines why it tops and goes the other way. It may be policy to some extent and it may be just it burns itself out. You get to a point where you've got such extreme speculation at the top that it rolls over a little bit and then you think, well, it's roll over, but it'll come back and then it doesn't come back. It goes down another leg or another bit and then bounces, but not all the way back again and then goes down further. So it can kind of, it",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 57,
      "start_timestamp": "00:35:24",
      "start_timestamp_seconds": 2124.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=2124"
    }
  },
  {
    "text": "a little bit and then you think, well, it's roll over, but it'll come back and then it doesn't come back. It goes down another leg or another bit and then bounces, but not all the way back again and then goes down further. So it can kind of, it can kind of the market itself can kind of start on one winding on its own without any true catalyst. Ultimately you'll look at the catalyst being the bust. The bust delivering very poor earnings. I mean, the earnings are gonna go through the floor. So but initially it's how it starts is you can have them kind of organically. Got it. And that part I actually find fascinating where you'd say it could happen organically. I think I get your meeting there. I think the reason I'm so fascinated about understanding the catalyst or the severity part makes sense. The way you delineate those two I'm following kind of breaking out leverage as a severity metric as compared to the forcing function of things. But based on the way that you describe the global bust to me, it doesn't sound too organic. It sounds like something that 80 to your point is something we haven't seen essentially post-war two. So I find it fascinating. I get the idea of a market top. I get the idea of natural pullbacks like you're talking about. But for a natural pullback to then turn into this depressive events. I don't know if",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 57,
      "start_timestamp": "00:36:46",
      "start_timestamp_seconds": 2206.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=2206"
    }
  },
  {
    "text": "your point is something we haven't seen essentially post-war two. So I find it fascinating. I get the idea of a market top. I get the idea of natural pullbacks like you're talking about. But for a natural pullback to then turn into this depressive events. I don't know if you go as far as calling it a depression. It seems like 80 crushed earnings probably a decent duration that we might spend there. So I guess to maybe reframe the idea to try to understand better, when you look at the concept of us potentially hitting a market top, starting a pullback, when in your mind does it turn from pullback into this global bust? Yeah, okay. So you're mixing things because I'm putting it right to this all the time. Keep the bust entirely, bust refers to economy. That's what I'm referring to the market. So bear market, when does it turn from a pullback to a bear market? First of all, let me say, when I say it can start organically, it could start with some catalyst. But if it starts organically, all I mean is to say is that it could start rolling over just like some of our pullbacks do. And you don't have any real thing to pin it on until after effect, look and say something's happening. The bear market itself won't be organic. The bear market will be driven by the bust. The bust means a very awful economic cycle, down cycle",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 57,
      "start_timestamp": "00:37:55",
      "start_timestamp_seconds": 2275.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=2275"
    }
  },
  {
    "text": "some of our pullbacks do. And you don't have any real thing to pin it on until after effect, look and say something's happening. The bear market itself won't be organic. The bear market will be driven by the bust. The bust means a very awful economic cycle, down cycle company by potentially the worst financial crisis in our history, worse than 2007, 2008 in other words. And what that does is it turns earnings far south. So we'll have pretty low-sounding earnings, and stocks are really awful earnings. Interest rates will be low. Now there is a period where rates could back up, as I said, turn the melt of rates come down. You could have for any number of reasons of bouncing rates that could coincide with the turning in the stock market. So that can happen. We don't know what the Fed's gonna do. The Fed may react wrongly in my opinion, but they may react to the stock market. I've said this before, where if you get them a stock market up 7,000, Paul may go back to that Dudley idea that, hey, stock market's part of our process. If we let that run away, it's gonna lead to inflation or hyperinflation. So he might tighten even though the economy's not looking great. I have no idea, because in the past, he's paid too much attention to the market. Lately, he hasn't been. Lately, he's let it go. But if he goes back to saying, hey,",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 57,
      "start_timestamp": "00:39:07",
      "start_timestamp_seconds": 2347.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=2347"
    }
  },
  {
    "text": "gonna lead to inflation or hyperinflation. So he might tighten even though the economy's not looking great. I have no idea, because in the past, he's paid too much attention to the market. Lately, he hasn't been. Lately, he's let it go. But if he goes back to saying, hey, the stock market's way up on stilts. We need to tighten. He could bring on the bust by zicking when he should've sacked, by tightening when the economy's about to go into a hard landing. I then just exacerbates it. So I think all of that is still to come. I don't worry too much about. It's kind of taken one step at a time, trying to jump ahead and anticipate exactly what's gonna cause what. More often than not, the scenario you draw up isn't the one that happens. It's something else. So I'm always looking at potential catalysts or potential problem spots. But I recognize it if we're still as far away from the top as we are, let's take it. Let's worry about that first and then get there. As we approach, as we approach 7,000, you can be darn sure I'm gonna be saying, is this the top or do I have to extend my targets? And if I'm not gonna extend my targets, there must be danger signs. I'm able to see it this point. So between now and I think between now and October, I think there's gonna be a lot of that going",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 57,
      "start_timestamp": "00:40:31",
      "start_timestamp_seconds": 2431.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=2431"
    }
  },
  {
    "text": "the top or do I have to extend my targets? And if I'm not gonna extend my targets, there must be danger signs. I'm able to see it this point. So between now and I think between now and October, I think there's gonna be a lot of that going on. I see. It makes a lot of sense. And yeah, thank you for kind of just offering a glimpse into what you're looking at, totally understand the point of focusing on what's in front, near term, being more of the expansion phase. I think understanding a little bit about what you're looking at and what you just shared there is actually even that very helpful because you offer a wide array of things, right? You didn't come back and say, this is the only kind of thing that I see that could cause this. It sounds like a very broad potential that can be kicked off by several factors, which even that in and of itself, I think is quite informative, actually. Yeah, I've been pretty clear that I use a shorthand formula and say the global bust is caused by overleveraged, heavily overleveraged system, plus a fragility in the system, in the economy. And again, this is global. So it's not just here, but that was caused by the pandemic. I think we've gotten away from the pandemic far enough and obviously have a tremendous full market. That's easy to forget that there's still a lot of hangover",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 57,
      "start_timestamp": "00:41:48",
      "start_timestamp_seconds": 2508.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=2508"
    }
  },
  {
    "text": "the system, in the economy. And again, this is global. So it's not just here, but that was caused by the pandemic. I think we've gotten away from the pandemic far enough and obviously have a tremendous full market. That's easy to forget that there's still a lot of hangover effect from that pandemic. There's a lot of small businesses that are hanging on by a threat and many others that aren't hanging on anymore. There's labor issues. There's all kinds of things out there that I think under the surface are not being paid attention to because things look okay. But there's a fragile economy because, you know, four short years ago, we shut down the economy, the world economy. And it led to some things where lots of places are still trying to get back on their feet or do into things differently. So leverage plus fragility, plus a potential policy mistake, meaning probably overtighting on the part of central banks, not just as a Fed. And that's my shorthand of what causes the bus with the leverage being probably the biggest thing that makes it bigger. But, you know, there can be any host of things that kind of add into that that, you know, aren't necessarily apparent yet. Got it. Yeah, that makes a ton of sense. You mentioned before in passing that a potential thing to look at could be an assassination. And we almost saw one pretty recently this past weekend. I wanted to",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 57,
      "start_timestamp": "00:43:06",
      "start_timestamp_seconds": 2586.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=2586"
    }
  },
  {
    "text": "kind of add into that that, you know, aren't necessarily apparent yet. Got it. Yeah, that makes a ton of sense. You mentioned before in passing that a potential thing to look at could be an assassination. And we almost saw one pretty recently this past weekend. I wanted to get your thoughts on that. Like we talked about before, not looking to get political. It's not really about that. It's more about the impact that that event you may or may not think could have on either the election cycle and then the subsequent impact that the election cycle and whoever wins that would have on the markets. Yeah, I think there's certainly probably people out there that believe that this rally this week is a Trump rally. I don't know that. I mean, I'm because of my view that this was coming. And I saw this. I mean, I was getting two weeks ago. I was getting day by day people coming in and saying, you're crazy. Your your Russell forecast of 3,300 is never going to happen. You know, the Russell's going down, not up. And every day they, you know, the same people, I talk them off the, off the ledge. And they come back the next day because the Russell was down a couple points again. And they come right back and say, there's no way the Russell's going to rally. You know, what are you talking about? What, you know, it's all, it's a,",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 57,
      "start_timestamp": "00:44:19",
      "start_timestamp_seconds": 2659.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=2659"
    }
  },
  {
    "text": "off the, off the ledge. And they come back the next day because the Russell was down a couple points again. And they come right back and say, there's no way the Russell's going to rally. You know, what are you talking about? What, you know, it's all, it's a, it's a crummy AI rally. It's not anything else. And I'd say, no, this is going to broaden under the surface. We're already seeing some broadening. And the Russell looks great to me. And it did look great technically. And sure enough, you know, this week we've, we've taken off. You know, the Russell's up 10 or whatever. And all of a sudden those voices are silent. But you know, I saw, I saw this coming, you know, well before Trump was, you know, shot at. So, so I, it's hard for me to say the rally this week because technically it looked like it could be coming. It's hard for me to say this is a, you know, it's the result of Trump. But I think there's possibility that some of this is people seeing that the odds are increasing, that we're going to have Trump in the White House instead of Biden. And it's a more pro capitalist policy. So you may be getting some of that on Wall Street. But I really don't think that's the big story. Whether it's this week or not, it's not the big story of why I think we're going to be",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 57,
      "start_timestamp": "00:45:34",
      "start_timestamp_seconds": 2734.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=2734"
    }
  },
  {
    "text": "House instead of Biden. And it's a more pro capitalist policy. So you may be getting some of that on Wall Street. But I really don't think that's the big story. Whether it's this week or not, it's not the big story of why I think we're going to be in the White House. I've said pretty consistently, starting last year and into this year, that my forecast has zero to do with the election. I don't have even though, even though it's an election year and that, you know, you can look at election year statistics and stuff. I don't really think that what we're seeing has much to do with the election. And I'm, you know, I'm quick, quick, quick, clarifying question on that. sorry, I just want to explore the inverse causal relationship. So not so much the election having in, or this, the election essentially causing this scenario. But do you think that there's any sort of impact that the election can have on the severity or the magnitude of what you're seeing or expecting? I don't think so, like I said, my car gets been in place, and are in place, and they really aren't factoring in that. Now that's not to say, we're living in a crazy world. There's been one assassination attempt, and there's reasons to wonder whether it was just what it was presented as or whether this was, the other side has said many times, we have to do whatever we",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 57,
      "start_timestamp": "00:46:42",
      "start_timestamp_seconds": 2802.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=2802"
    }
  },
  {
    "text": "factoring in that. Now that's not to say, we're living in a crazy world. There's been one assassination attempt, and there's reasons to wonder whether it was just what it was presented as or whether this was, the other side has said many times, we have to do whatever we have to do to stop him from winning the election. The deep state theories and things. So I don't want to get into it too much, but it's not impossible that this was something that's far bigger than just one lone gunman that the Secret Service made some mistakes on. And if that's the case, it may not be a nice-ladied case. We may see another attempt. So, and who knows what happened. So I'm not saying that those things can't happen, and you wouldn't have an impact, but that's things stand right now. Everything I'm forecasting is based on the Fed, fundamentals, and the economy, and financial system. So whenever comes, I'll adjust to it, but I just don't think that's the real main reason for any of this. Got it, yeah, makes sense. Couple last questions for you. What is your, what are your thoughts on the performance of medals so far this year? And really commodities in general. I know a lot of times we'll spend some time talking about medals, but just to broaden it out beyond just medals and think about commodities as an entire group. Yeah, well, first of all, the medals have begun",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 57,
      "start_timestamp": "00:48:04",
      "start_timestamp_seconds": 2884.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=2884"
    }
  },
  {
    "text": "of medals so far this year? And really commodities in general. I know a lot of times we'll spend some time talking about medals, but just to broaden it out beyond just medals and think about commodities as an entire group. Yeah, well, first of all, the medals have begun a very big run. It's been a long time coming. I took a lot of abuse as a bull on the medals for a long time, but gold broke out about 2100 many, many months ago, and as you know, they reached a plateau and corrected from there as now on another run. I think we're going to 3,000 pretty quickly in gold, being the next few months. Silver's farther back from its all-time highs, gold's at all-time highs, but silver's got to get through a lot of various levels of resistance. So it's got longer ways to go, but I raised my target 75 on silver, and I think it could spill into next year, but I think it's potentially a 2024 target. So that's a long way. I mean, where are we 31 and change on silver? So you got a big run there, and the miners obviously will accompany that. So I'm a huge bull on both gold and silver. I'm also a bull on copper. I have a 6 target on a 6 earnings number on copper. So there's, I think copper producers are looking very good here. So the whole metal structure looks good. Other",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 57,
      "start_timestamp": "00:49:28",
      "start_timestamp_seconds": 2968.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=2968"
    }
  },
  {
    "text": "will accompany that. So I'm a huge bull on both gold and silver. I'm also a bull on copper. I have a 6 target on a 6 earnings number on copper. So there's, I think copper producers are looking very good here. So the whole metal structure looks good. Other commodities, Ag doesn't look so great. Weatz down at low, multi-year lows. Corn's head and south is pretty low in head and south. Beans are head and south. So I think the grains look very deflationary. And I think they will get hit harder, and they'll keep going in the bust. So there are aspects of commodities that are doing OK metals obviously, but other commodities, not so great. Cotton looks negative to me. Lumbars been weak. So you've got, I think basically, those are worried about inflation. I think they're worried about yesterday's problem. I think what I see a lot is more deflationary in the picture. And not that they're in deflation yet, but if we get a bust, this stuff's going a lot lower. Gold is over, I mean, copper is a temporary thing. Right now, I do think copper will get hit and could go as low as a dollar in the bust. So it's on its way. I think it got up over five and then corrected back to the mid-fours on the earnings on copper. Not earnings on the price copper. And I think it's going to six. From six, probably later this year,",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 57,
      "start_timestamp": "00:50:51",
      "start_timestamp_seconds": 3051.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=3051"
    }
  },
  {
    "text": "low as a dollar in the bust. So it's on its way. I think it got up over five and then corrected back to the mid-fours on the earnings on copper. Not earnings on the price copper. And I think it's going to six. From six, probably later this year, I think it can go down maybe as low as a dollar in the bust. So that's kind of a last to rot, but I think it's, you know, looks good here. I think some of the oil, oil, okay, oils one that kind of doesn't fit the metals. I mean, oil I'm bearish on as you know, I'm bearish on oil. When most people are bullish, I'm still calling for 60 oil, probably this year. And then, you know, in the bust, I think it can go down to 30. So, and then, you know, the commodity story, the real commodity story is post bust. Once we get beyond the bust with all the money, then it'll be pushed into the system, the same the system, you know, 20 trillion here and big amounts everywhere else. You will see inflation get up to 25, I think, by the end of the decade. And as a result, I think you're going to see, you know, commodities go through the roof. And all that money is going to stimulate demand for commodities, demand for industrial products. And so commodities are going to run, run, run very high. I mean, you're going",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 57,
      "start_timestamp": "00:52:27",
      "start_timestamp_seconds": 3147.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=3147"
    }
  },
  {
    "text": "of the decade. And as a result, I think you're going to see, you know, commodities go through the roof. And all that money is going to stimulate demand for commodities, demand for industrial products. And so commodities are going to run, run, run very high. I mean, you're going to, like I said, oil can get the 500. Silver can get the 500. Gold can get the 20,000. Natural gas, maybe could go to 50. I don't know. I mean, I think natural gas is 2 now. And probably going to be a dollar in the bust. So, I mean, there's, there's a big change coming after the bust in terms of commodities. I have to say, one of my favorite things about talking to you to be completely honest is, I'm crazy. It's not. That's the funny thing. I haven't been in markets anywhere near as long as you have. I've been trading for 16 years now. But it's a, our cry from, you know, your experience. But what I have noticed over my time in markets is that weird things or things that are seemingly impossible or improbable happen all the time, literally all the time. And they happen way more than they statistically should. So, one of the things that I love hearing from you is when you run through these different ideas, you know, when you say something like oil to 500, it's like, my brain is racking, trying to even like understand what that",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 57,
      "start_timestamp": "00:53:44",
      "start_timestamp_seconds": 3224.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=3224"
    }
  },
  {
    "text": "they happen way more than they statistically should. So, one of the things that I love hearing from you is when you run through these different ideas, you know, when you say something like oil to 500, it's like, my brain is racking, trying to even like understand what that could look like. So, it's like eye-opening for me, to even think about the numbers, to think about what the landscape would look like in that scenario. So, a quick question then I know that we're coming up on time. I don't want to keep you too long. But when you look at the flow of commodities through that, what do you think the impact would then be on the broader economy? And then how, again, and I know I just want to be really clear, I know that you're talking about focus on the move first. And then this is all. I don't know. I'm talking the bigger picture on this. Okay, got it. Because I'm just fascinated by how this would work. So, what would the picture between the commodities look like and the economy as the basket of commodities kind of goes to two different spots? How does that impact the economy while it's like that? While things are that defunct, while oil might be up to 500, while inflation could be at 25. It's a huge thing because keep in mind, we're going from, we had an inflation worry, then the Fed reacted. And now I'm",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 57,
      "start_timestamp": "00:55:01",
      "start_timestamp_seconds": 3301.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=3301"
    }
  },
  {
    "text": "does that impact the economy while it's like that? While things are that defunct, while oil might be up to 500, while inflation could be at 25. It's a huge thing because keep in mind, we're going from, we had an inflation worry, then the Fed reacted. And now I'm saying that I could be wrong, but I'm saying next year, because of the violence of the boss, because of how extreme it will be, it will take us actually into the broad-based deflation. So next year we'll actually have negative inflation. Then all that money gets created to get us out of that. And it will be money and that. There'll be issuing all kinds of treasury bonds and bills. All that stimulus will then jumpstart a recovery with a lag. So let's say the bus lasts all next year. Sometime in 2026, we begin recovering. We may not feel like it, but we will begin recovering statistically. We'll see GDP moving up. And usually the first couple of quarters out of a trough, GDP is up pretty big. I can remember in the early 80s, we had GDP up 10 in that quarter. So when you stimulate like crazy, and you're coming off a low base, numbers can jump pretty fast. So we'll have a period there where you have a pretty good recovery. Inflation will lag. Usually inflation is a 12 to 18 month lag, more like 18 month lag. So if you're in deflation, there'll probably",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 57,
      "start_timestamp": "00:56:11",
      "start_timestamp_seconds": 3371.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=3371"
    }
  },
  {
    "text": "crazy, and you're coming off a low base, numbers can jump pretty fast. So we'll have a period there where you have a pretty good recovery. Inflation will lag. Usually inflation is a 12 to 18 month lag, more like 18 month lag. So if you're in deflation, there'll probably be 2027 before inflation starts really looking like, it's starting to pick up speed. It might be low single digits for the next year, and then five or six percent on its way to double digits by 2028. So it'll start accelerating, I think, because of how much money we're talking, it may accelerate faster, so it could come sooner, but it'll be a year or two anyway, before you get into double digits and probably longer. But then once you get there, you'll double and then double again. So price are just gonna go through the roof, because you've pumped all this money in that creates demand for our products, demand for, you know, it'll be an industrial recovery because the consumer's gonna be still digging out from the bust. You know, they're gonna get hard if their wealth goes down 80, you know, their real estate goes down 30 or 40. So they're not gonna be in a mood to spend a lot, but we're reassuring and we're doing a lot of things that are gonna be pro-industrial. So industrial spending, capital good spending, is gonna be, you know, strong. That means you're gonna have demand for steel,",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 57,
      "start_timestamp": "00:57:27",
      "start_timestamp_seconds": 3447.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=3447"
    }
  },
  {
    "text": "30 or 40. So they're not gonna be in a mood to spend a lot, but we're reassuring and we're doing a lot of things that are gonna be pro-industrial. So industrial spending, capital good spending, is gonna be, you know, strong. That means you're gonna have demand for steel, you're gonna have demand for copper, you're gonna have demand for nickel, you're gonna have demand for, you know, all kinds of commodities. And yeah, you're gonna get, because we've sized down commodities over the last few decades, because it was, you know, a consumer economy, and we didn't have the demand for commodities we used to have. So we've rationalized down the capacity, all in, and you've also run out of a lot of minerals and metals and things are hard to find now. It takes years to develop new sources, right? New minds and things. You're gonna have a case where you're gonna ramp up the man fast in a year or two, and you can't ramp up supply for 10 years, seven or eight years. So that means you're gonna have demand and layout stripping supply, and that's in true of oil, that's true of metals, that's true of a lot of commodities. And so the price, the only thing you can give when you have demand way above supply is the price. And the price will go through the roof. So that's why you get that. Now, the problem is, in reality, you can't, you know,",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 57,
      "start_timestamp": "00:58:42",
      "start_timestamp_seconds": 3522.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=3522"
    }
  },
  {
    "text": "true of a lot of commodities. And so the price, the only thing you can give when you have demand way above supply is the price. And the price will go through the roof. So that's why you get that. Now, the problem is, in reality, you can't, you know, you can't adjust incomes fast enough to keep up with that, right? So if inflation's double digit and moving to high double digits, people's incomes are gonna get just like we saw at a lesser degree in the last few years. You know, people's incomes are stretch because inflation's eaten them alive. You know, food prices are up, and price of cars are up, and the price of travels up, and price of gasoline is up. That's gonna be that on steroids. You're gonna have gasoline prices that would owes what, 15 or 20 a gallon. You're gonna have, you know, heating oil prices through the roof. You're gonna have, you know, car prices probably high because of the cost of goods to build them. So you have all those things, and at the same time, you have a consumer who's kind of flat and still on his back because of what happened in the bus. So it's not gonna be an easy time for people. Now there's gonna be a, you know, half economy, of course, there's gonna be, you know, 10 or 20 of the people are gonna be saying, hey, I'm a good shape. What are you",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 57,
      "start_timestamp": "00:59:49",
      "start_timestamp_seconds": 3589.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=3589"
    }
  },
  {
    "text": "of what happened in the bus. So it's not gonna be an easy time for people. Now there's gonna be a, you know, half economy, of course, there's gonna be, you know, 10 or 20 of the people are gonna be saying, hey, I'm a good shape. What are you worried about? But the half-notch, there's gonna be a lot larger component than even today, which is a large component, you know, 40 or 50. So that's a problem. The other problem is that if you get inflation up to 15 on its way to 20, on its way to 25, you're gonna have T-bills up to 15 on the way to 20 on the way to higher. And you're gonna have T-bills up to 15 on the way to 20. When you have rates like that, and you already have a 34 trillion debt, right? The 34 trillion in Treasury debt, that's just US Treasury debt. If we get 20 trillion in new money, we're probably gonna have 20 trillion in new debt because they'll put it out with one door and then buy it, the federal buy it, monetize it in the other door. So you could be up to 50 or 60 trillion in debt. We can't service 34, we probably can't really service 20 trillion. And we can't service it at 5. What are we gonna do when it's 15 or 20? It's already a larger, servicing our debt is already larger than our military budget,",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 57,
      "start_timestamp": "01:01:05",
      "start_timestamp_seconds": 3665.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=3665"
    }
  },
  {
    "text": "up to 50 or 60 trillion in debt. We can't service 34, we probably can't really service 20 trillion. And we can't service it at 5. What are we gonna do when it's 15 or 20? It's already a larger, servicing our debt is already larger than our military budget, right? Imagine if it's four or five times this. That's our whole budget, then some. So what I'm describing is an equation that doesn't balance. And that's what we're gonna collapse. At some point in the 2030s, we're gonna collapse. And not just the US's global collapse. And what I call it is the end of a 80 year Ponzi scheme. We've borrowed and printed, borrowed and printed for 80 years. And each cycle, we had more imbalances, more excesses. So it required more money and more printing, more printing of money, more debt to keep things going. And then it required, so that's why when you say, things in, you wouldn't ever think would happen where are happening. And things you would think were impossible happened. It's because we're at the end of a super cycle. We're at the end of an 80 year long cycle, 80 or 90 year long cycle. So we're in the last decade. And in that last decade, things just get much more extreme in both directions. So you go from bus to boom, you go from boom to bus. So it's not a pretty picture. It's really the guidepost for me in terms",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 57,
      "start_timestamp": "01:02:12",
      "start_timestamp_seconds": 3732.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=3732"
    }
  },
  {
    "text": "year long cycle. So we're in the last decade. And in that last decade, things just get much more extreme in both directions. So you go from bus to boom, you go from boom to bus. So it's not a pretty picture. It's really the guidepost for me in terms of why I'm so confident in pushing out things that seem crazy is because I saw this coming years ago, I saw where we were at what was probably going to be the end game, how the last, that couple of decades we're going to play out. And they're pretty much playing out according to my script, unfortunately. Well, I got to say, I mean, what a mic drop to end on because there's a million questions I have to go off of that. But I'm sure you have other things to do. So I'll let you run. Obviously, I will share a link to your Twitter account, the correct one. I know that there's some imposter is out there. As if they could be you, no chance. So I'll throw the link to the, to the crack spot. And I also know that you do your newsletter. So if anybody's interested in that, they can shoot you a DM and then you can give them details on your newsletter. But I really want to thank you for spending a little time going into some of the weeds. I know some of this stuff is duplicative, triplicative for you. I",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 57,
      "start_timestamp": "01:03:36",
      "start_timestamp_seconds": 3816.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=3816"
    }
  },
  {
    "text": "anybody's interested in that, they can shoot you a DM and then you can give them details on your newsletter. But I really want to thank you for spending a little time going into some of the weeds. I know some of this stuff is duplicative, triplicative for you. I know that you've talked about this stuff a lot. But what I like to do is after the podcast that we do, I try to collate what people are curious about, what elements. And to be honest, I throw out 90 of it because I always say he said that thing 65,000 times. You can go find that on his Twitter. But I try to bring some of the nuanced questions. So thank you very much for spending a little bit of time going into some of those details, sharing more about your thought processes. I try to remind everybody of really massive thing is to just listen to the way that you synthesize information, what details you're connecting in what way. It's super informative. It helps people understand how to think about things and it gives them another model to use. So thank you very much for sharing all that. And thanks for hanging out for a while. Yeah, if I could just say at the end, that's because we are getting so much longer into this, so much closer to the end. That as I say, it's a unique period, or unique thing to say that we're still",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 57,
      "start_timestamp": "01:04:47",
      "start_timestamp_seconds": 3887.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=3887"
    }
  },
  {
    "text": "that. And thanks for hanging out for a while. Yeah, if I could just say at the end, that's because we are getting so much longer into this, so much closer to the end. That as I say, it's a unique period, or unique thing to say that we're still 30, 40, 50 away from the top in some of these indexes. And yet to say it could be just a few months away that we're at the end of this. So you have to understand that this is an unusual period where normally I would be the first one to say, you're a few months from the top, nobody's smart enough to pick the top. You ought to get your, you ought to start getting defensive now or you ought to start planning for the other side of this now. The problem is the way psychology works, if people do that, and then you have another 20 or 30 upside, they're gonna get drawn back in, or most people are gonna get drawn back in, say, well, how does he know that's the top? Maybe there's gonna be plenty of narrative out there saying this thing has a long ways to go. So you can get out, let's say, 5,600 on the SP, and then you're gonna be forced back in because of the pressures on yourself psychologically, 6,500 or 7,000, and then regret that you bought at the top. So it's easy to say, well, I'm not smart",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 57,
      "start_timestamp": "01:05:44",
      "start_timestamp_seconds": 3944.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=3944"
    }
  },
  {
    "text": "ways to go. So you can get out, let's say, 5,600 on the SP, and then you're gonna be forced back in because of the pressures on yourself psychologically, 6,500 or 7,000, and then regret that you bought at the top. So it's easy to say, well, I'm not smart enough to pick the top, so I'm gonna, I'm gonna get out early and just sit on it. If you do that, and that's fine, if you do that, know what you might be missing. As long as you're aware of what you're missing and you're happy to do that, because you don't wanna take the risk, cause the risk, as we get this close, the risks are getting high. I mean, we could have a president shot tomorrow, and the market would go down, go down, you know, a thousand points. So I'm not, you know, I'm not forecasted that anyway. But I'm just saying, yes, we're closer to the end, so the risks are rising, but it is that unique period where we've never had this kind of a magnitude of rally coming in the last stages. I mean, this is a very unique historical rally, I think. In my opinion, this is gonna be the biggest rally in history, in the short time, so. Cannot wait to see it. I literally cannot wait to see how this plays out. I really enjoy learning from you. Thank you so much for sharing your experience. Obviously, I will reach",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 57,
      "start_timestamp": "01:06:48",
      "start_timestamp_seconds": 4008.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=4008"
    }
  },
  {
    "text": "In my opinion, this is gonna be the biggest rally in history, in the short time, so. Cannot wait to see it. I literally cannot wait to see how this plays out. I really enjoy learning from you. Thank you so much for sharing your experience. Obviously, I will reach back out to invite you back on to get another update. It'll be about a quarter, so we'll see. That could be a really spicy time to do a full lot. We might be right hanging out at this inflection point, which would be really fascinating to explore together. Of course, October's always got some historical significance in markets, and we'll be interesting. Well, awesome, David. Thank you so much for hanging out, and for everybody else, thanks for watching and listening, and don't forget being outlier out there, pay attention to what you're doing, stay safe with your risk. We are in a busy time coming up per David, so thanks everybody. Hey, have a good summer here.",
    "metadata": {
      "video_id": "dtpj5VcLnjg",
      "title": "End of Year Melt Up w/ David Hunter | The Outlier Podcast Ep70",
      "url": "https://www.youtube.com/watch?v=dtpj5VcLnjg",
      "upload_date": "",
      "duration": 4138.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 57,
      "start_timestamp": "01:07:58",
      "start_timestamp_seconds": 4078.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dtpj5VcLnjg&t=4078"
    }
  }
]