[
  {
    "text": "you you you you you you you you you you you you you you you you you we percent plus lower. So with these defined terms, then we can fill in some blanks, right? We can figure out what we personally would define as a drawdown. I would first start though by understanding what is normal market behavior. And the way we can figure out what normal market behavior is is we can go to a place that provides data downloads. I don't know if Yahoo Finance does maybe one of you can throw into the chat if they do where you can download stock data for free. But there's because it used to be, I think you used to be able to get it from Yahoo Finance. I don't know if they took it down and I think it might be only one other place that does free data. I'm honestly not sure. But okay, so James says no longer free last I checked. Yeah, I think there is still one. I don't know if it's investing.com. You guys, I'm sure can find it. But what we can do is we can literally go into some sort of data source, free or paid. And we can download the actual performance data metrics for the underlying that we happen to be looking at. So we can grab the performance data metrics or something like SPX or NDX. And again, the reason why I start with these from the market perspective",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "source, free or paid. And we can download the actual performance data metrics for the underlying that we happen to be looking at. So we can grab the performance data metrics or something like SPX or NDX. And again, the reason why I start with these from the market perspective is because of the history. SPX has been around the longest. So this is absolutely the tool to use in any of these broader market studies. So then what we could do is we can download that data and then we can create a distribution plot distribution plot simply looks at all of these individual data points and these data points that you look at here actually weeks. It's not even individual days, but we can look at all of these individual data points and then we literally create a frequency plot. So we say how often is there a move that's zero to 0.5 and so on and so forth. You can do this for negative values as well and you can combine them. So then you can have a frequency plot that looks like this where this is your zero line. And then this is your again, zero to 0.5 on the negative zero to 0.5 on the positive. And they just plot all the price performance. And what you will find is under the central limit theorem in the law of large numbers, even things that can be log normally distributed. Once you have a large enough",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "to 0.5 on the negative zero to 0.5 on the positive. And they just plot all the price performance. And what you will find is under the central limit theorem in the law of large numbers, even things that can be log normally distributed. Once you have a large enough sample size, they typically become they approximate towards a normal distribution. So what you'll notice is the curve will look something like this. And one of the important notes here though is that these tails are fatter than a standard distribution might assume. The fatter tails corresponds to a frequency. So here your y-axis would be the percent of occurrences or the count of occurrences. The thing to keep in mind is the majority of the time, the market will fall within this nice one standard deviation range here. And then the overwhelming majority of the time it will fall within this nice two standard deviation range here. And the even more overwhelming amount of the time it will fall within three standard deviations. However, it will have instances where it moves outside of both of these into four, five, even six standard deviation moves. Why does all this matter? It matters because of the problem that we're trying to solve today, which is how do we behave during market drawdowns? Well, the first thing we have to do and that is define a drawdown. And I can tell you one thing, I personally wouldn't want to define a drawdown",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "It matters because of the problem that we're trying to solve today, which is how do we behave during market drawdowns? Well, the first thing we have to do and that is define a drawdown. And I can tell you one thing, I personally wouldn't want to define a drawdown based on this range, meaning where price tends to behave because that's where we expect price to be. So when I'm looking at something like a market drawdown, that's when I start looking at outside of one standard deviation moves, specifically isolating the lower end of this distribution, because we're effectively saying for this sake of this conversation, we're not worried if we have an excessive move to the upside. Maybe our portfolios are positioned to take advantage of that. We're okay. So we're more worried about when we start to see excessive moves to the downside outside of an expected range. And depending on the time frame you look at, you're going to get different measures for what we might consider a drawdown. But in this case, I would argue plus minus 5, that's kind of normal. That's nothing outside the realm of what actively happens, particularly, again, depending on the time frame that you're looking at. So I think once you start looking at things that are kind of like 8 plus, this is where you'll find that we start to operate outside of a normal distribution. We start pursuing larger in larger moves towards the tails. So",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "on the time frame that you're looking at. So I think once you start looking at things that are kind of like 8 plus, this is where you'll find that we start to operate outside of a normal distribution. We start pursuing larger in larger moves towards the tails. So when I'm thinking about how we want to manage a portfolio during these different conditions, when we have 5 moves plus or minus, we don't really care. Again, that's just normal. That's normal market movement. As soon as we start seeing this move expand, let's call it 8 plus, then we start thinking of things differently. The reason why I attach a percent move to it is because the way that I would prepare for these different phases changes. The reason why I have a phased approach is because there can be instances where the market goes to 8 down, but then rallies back up. It can go to 10 down and then rally back up. So what I'm saying is these serve as early warning signals that something different than usual is happening. We don't know what yet. And I've done an insane amount of statistical analysis to take a look at what is the frequency if we experience an 8 drawdown that it then turns into x future drawdowns, all of that ad nauseam. So specifically with the SPX data said, I am supremely familiar with and it's because I base a lot of ideas off of it.",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "a look at what is the frequency if we experience an 8 drawdown that it then turns into x future drawdowns, all of that ad nauseam. So specifically with the SPX data said, I am supremely familiar with and it's because I base a lot of ideas off of it. This analysis is important to conduct, especially for you as a trader because it gives you a ton of insight into how things move. Now for the pro members during the case study tomorrow, I'm going to talk to you a little bit more about these different thresholds and some of the descriptive statistics around them because we can use them to preemptively start building our portfolio to look a certain way based on the probabilities of a subsequent move that's not limited to just simple descriptive probabilistic analysis such as if we hit a percent drawdown, how frequently does it go to greater than a percent drawdown? There's other overlaying statistics and filters criteria that we can add on top of it that give us a much better picture. So all of that is stuff aside though keeping this at a higher level. Let's now talk about what this then means. 8 drawdown. It means that depending on how your portfolio is structured, the market, the undertones of the market is starting to change. Now what it's turned into, we don't know yet, but we do know it's starting to change. So this means that if you're holding some",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "then means. 8 drawdown. It means that depending on how your portfolio is structured, the market, the undertones of the market is starting to change. Now what it's turned into, we don't know yet, but we do know it's starting to change. So this means that if you're holding some sort of just generally long portfolio that when we start experiencing near correction moves, you kind of have to start thinking about, okay, what's the game plan here? Because got to do something and depending on what I think the market is going to do, it's going to look different. Now I want to take a second and I want to talk about the other end of the spectrum. Like we talked about drawdowns, maybe starting 6 to 8, then we get into corrections 10, then we get into bear markets. Let's take a look at bear markets because this is useful context for you to have as it pertains to bear markets and here they are. You didn't notice anything? There's really not a lot of them and you'll notice a couple traits as we look at these bear markets. Now one really important note is this is looking at the trading year and that's on purpose. This is not looking at peak to trough moves in a vacuum. So I have two different ways that we can look at this in timestamp it. The reason why I'm looking at it in this context of an annual frame is",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "at the trading year and that's on purpose. This is not looking at peak to trough moves in a vacuum. So I have two different ways that we can look at this in timestamp it. The reason why I'm looking at it in this context of an annual frame is because I think it gives you some descriptive statistics from the idea of holding a portfolio, meaning how long if I start trading might I look at a bear market that could be consuming the portfolio. One of the things you'll notice is that as time has progressed the duration of these bear markets on average has declined and so is the severity. Why would that be? Well there's a couple things you'll notice on this little list below the graphs that are useful for you to know and it's that there are a lot, a whole lot of different evolution components to the stock market that have happened from the 20s literally over the last century just about. So you'll notice there's eight things that I want to talk about from the lens of a bear market quickly. Now this is all going to be part of a video I'm doing in the future actually. So you're getting a bit of a sneak peek on some of the stuff. The video is going to talk about a little bit more than just the bear markets it'll talk about corrections, but I think understanding the extreme is useful because it",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "I'm doing in the future actually. So you're getting a bit of a sneak peek on some of the stuff. The video is going to talk about a little bit more than just the bear markets it'll talk about corrections, but I think understanding the extreme is useful because it gives us a lot of context. So if we think about investor psychology during a bear market this really impacts people broadly. The thing to note is that generally people become really nervous. This is hedge fund managers because their jobs depend on their ability to maintain people's money. This comes from high frequency trading firms that might have positions that could be going against them or liquidity is widening out and they're not able to run their book the way that they might. This is retail traders that are watching. There are 401ks or their retirement accounts evaporate becomes pretty widespread. And if you'll remember a big part of the stock market is actually the human element. So you can't just not pay attention to the psychological factor of what's happening right there across the board. The next thing on this list is volatility. Valtility will expand across the board that will lead to decreasing of liquidity which actually serves as a natural breaking function for market declines. You'll also find as volatility is coming up as the market is starting to drop uncorrelated returns become more and more correlated. This means that if you're holding some sort of",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "board that will lead to decreasing of liquidity which actually serves as a natural breaking function for market declines. You'll also find as volatility is coming up as the market is starting to drop uncorrelated returns become more and more correlated. This means that if you're holding some sort of diversified stock portfolio, you're following kind of fundamentals. You have eight different stocks and eight different sectors. Well, they can start acting a lot like the same thing which is always funny because people build these portfolios in the context of well, I should have at least X number of stocks, 15 stocks to decrease my total correlation risk. But during things like bear markets, they become generally very correlated. And we've seen this in a lot of different instances. We've seen this with equities in gold. In the mid 1900s and a big reason for that is people were liquidating gold positions to have cash on hand. So even though the equities were dropping and most people will say, well, gold typically is a flight to quality and people are trying to move their money into safer assets. Gold even plummeted. And again, it's because people were like, shit, I need money. I need cash. I don't need the gold right now. So those kinds of relationships can become broken. And again, really important for us to know because if you're a trader that's trying to maintain a book that's based on simply diversification of the underlines that you're",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "I need money. I need cash. I don't need the gold right now. So those kinds of relationships can become broken. And again, really important for us to know because if you're a trader that's trying to maintain a book that's based on simply diversification of the underlines that you're trading, then your correlation approach actually might not withhold the way you think, especially as it becomes tested in more severe environments. Next thing, during draw downs, we tend to see more bear market. Sorry, during bear markets, we tend to see more mean reversion specifically for extended downside moves. So what you'll notice is that when we look at big, big changes in names during extended down moves, you still will find bear market rallies. Bear market rallies are actually quite robust, meaning they're sharp, but then they tailor off pretty quick and then the downside resumes. Things that are more defensive and low beta tend to outperform. These are your staples, healthcare utilities. And that's typically because they have better cash flow and they're more resistant to recessions, right? That's the nature of staples. People need staples. That's where they go and get products to live their day-to-day lives. Growth stocks tend to crash because they tend to have higher PE, higher future expectations that have now come under fire. And then we have the last involvement of things like central banks and broader fiscal policy that tries to intervene. And the tools that central banks and broader",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "lives. Growth stocks tend to crash because they tend to have higher PE, higher future expectations that have now come under fire. And then we have the last involvement of things like central banks and broader fiscal policy that tries to intervene. And the tools that central banks and broader fiscal policy has to intervene has gotten more sophisticated as time has developed, which is a big reason why you see the 2020 bear market literally was one day that then rallied up soon thereafter. So this is what inside of a bear market looks like. And again, the whole purpose of doing this exercise is so that you at least have a general understanding of what this could look like, both in terms of severity, which you can see here, in terms of duration, both from peak to trow and then trow to recovery, so that then we can inform what our approach might be. This is one of the overwhelmingly skipped steps by the vast majority of traders because they don't want to do this work. But this work is so important, because if you don't do essentially what I'm showing you here, then you have no idea what you're preparing for or how to adjust your approach to be able to exist through it. So this is as always why the step of defining things is so important in something I quite literally insist that we do, because now we have some ideas on how bear markets",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "what you're preparing for or how to adjust your approach to be able to exist through it. So this is as always why the step of defining things is so important in something I quite literally insist that we do, because now we have some ideas on how bear markets work specifically. And the reason why I'm focusing on bear markets is because they tend to be a little more dangerous to traders than something like a pullback. So the first thing now as we're talking about approach is this. What does my portfolio look like and what is my risk profile? Here's why this matters, because if I'm trading a long futures portfolio that's leveraged to the long side as we think about that gradient for drops that I explained earlier, we know that 8 is when things start to change, 10 is when we enter a correction and funky market behavior starts ramping, and then 20 is when we're actually in the throes of things. If I have a leveraged long portfolio, I need to be more ready to act earlier in these stages, whereas if I'm trading a wheel, a coverage strangle, those kinds of things, then I actually can kind of use these as opportunities to do different things to the portfolio, meaning maybe scale in a little bit, those kinds of effects. I'm not really over-underreacting. I can just kind of play it as far as I want. So understanding your portfolio structure, not just",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "I actually can kind of use these as opportunities to do different things to the portfolio, meaning maybe scale in a little bit, those kinds of effects. I'm not really over-underreacting. I can just kind of play it as far as I want. So understanding your portfolio structure, not just at what it is right now, but the different ways that you run your portfolio, because we can experience these broader drawdowns pretty quickly. They tend to take a little while. So what I mean by that is if we take a look at, let me hide this really quick, if we take a look at SPX and let's zoom these in now, let's do a three year, now it's a little bit longer now, let's do a five year. So if we take a look specifically at the 22, I called the 22 a bear market, it technically isn't, but I call it that, the reason why it's technically isn't is because it was down 19.4 on the year. But if we take a look at even this down move that happened during 22, you notice that these are weekly candles. This didn't just happen like that. It takes a little time for it actually to materialize. That's important information for us, because it means we have time to act if we're paying attention. So then when we're defining our approach, first we need to define what our portfolios typically look like. These are things like what kind of",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "a little time for it actually to materialize. That's important information for us, because it means we have time to act if we're paying attention. So then when we're defining our approach, first we need to define what our portfolios typically look like. These are things like what kind of strategies are in there. What kind of time frames, especially with options. What kind of beta-weighted delta is? This is something like SPI. We also care about allocation and utilization. The reason why we care about utilization is because this tells us, depending on what different strategies we have, how much more money we have to use as condition shift. One of the things that most of you know about my approach by now is that when we're sitting near all time highs, I actually tend to be slightly less invested, not massively so. But depending on what I'm trading and how much it's moving, I'm not going to be 80. Let's say in the T-Triple Cues coverage strangle, I'm not going to be 80 equity during that period. And it's because I know the way that T-Triple Cues can move. And if I was that invested during that time frame, if there's a pullback, I also know that I'm kind of stuck. There's not a whole lot I can do other than sit and wait and just hope that it eventually works out, which is not in efficacious approach to trading. So this is your first step. Is to",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "frame, if there's a pullback, I also know that I'm kind of stuck. There's not a whole lot I can do other than sit and wait and just hope that it eventually works out, which is not in efficacious approach to trading. So this is your first step. Is to actually look at your portfolio and see what's in there. The second step is to actually conduct an analysis of market and economic themes. Now this can be done before this stat, these are essentially interchangeable, and they both happen in parallel with one another. But the reason for the analysis is to help bolster our internal probabilistic assessment of how probable is it that this gets worse. Because again, one of the things to remember is as a trader, we should have different phases we're paying attention in early warning systems. So I'm not sitting here thinking about what am I going to do with my portfolio when things are down 25. Guess what? Way too fucking late. Way too late. It's already happening. So you have to be prepared to do things before we get to that step. Understanding the opportunity costs that will come with it, which we'll talk about. So let's use the current landscape for an analysis. It's a great example. The markets have been teetering around a correction. They close below it already. And we know that what we did just get the FOMC statement. So the economy still looks strong, but there's a",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "we'll talk about. So let's use the current landscape for an analysis. It's a great example. The markets have been teetering around a correction. They close below it already. And we know that what we did just get the FOMC statement. So the economy still looks strong, but there's a lot of holes in the economy. We're seeing unemployment rise a little bit. We're seeing the terror of conversation expanding and so on and so forth. So all of that leads me to say not that markets crashing, but the same thing I've been telling you guys for literally two months now. I think that the market is in a transition period and we have to be really careful. Because I still think that the market can roll either way from this breadth of evidence. This is exactly what I'm doing here. I'm analyzing all these different things and I'm coming up with a conclusion. Based on that conclusion, I'm going to position my portfolio appropriately. So here we need to adjust the portfolio to fit our analysis. So here's what this means. With the market as it is now, again, using current day as an example, there are a handful of things I can tell you definitively. One of them is I do not want to be long lots of small caps. I know this. The other thing is I actually don't want to be long autos. Big part of this is because of the tariffs and so on",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "handful of things I can tell you definitively. One of them is I do not want to be long lots of small caps. I know this. The other thing is I actually don't want to be long autos. Big part of this is because of the tariffs and so on and so forth. So all I'm doing is I'm analyzing what the portfolio currently looks like. I'm seeing how I view the total market economic force. And then I'm reconciling those two. I'm saying does my portfolio reflect my broader idea in understanding about what's happening here. Now, this adjustment the portfolio is kind of the first step to make sure if this move does become more severe, we're positioned okay for it. This isn't the end state here. There's still a couple more steps that are super important. But this is the next step to make sure that we are alive throughout the rest of this process. Because again, go back to this. If we're leveraged long futures and we get a 15 down move over the course of a few weeks, that could send a portfolio insolvent. So the rest is moot. If we're too worried about what opportunities we want to take advantage of, if we have no portfolio. Well, that's why this is now. And then after this, how to profit. So once our portfolio is positioned in a way that's logical, given the current market conditions, then we can say, okay, my portfolio is set,",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "opportunities we want to take advantage of, if we have no portfolio. Well, that's why this is now. And then after this, how to profit. So once our portfolio is positioned in a way that's logical, given the current market conditions, then we can say, okay, my portfolio is set, it's robust. If this drawdown continues to expand, my portfolio is well positioned to at least deal with it. How can I now take advantage of the current market behavior? Because again, towards the beginning of this, I gave you a list of things that happens that we know tends to happen. So we can trade a lot of those different ideas. So then it turns to what do we think we can do to profit from it? And some again, examples from the current market environment. One of them is volatility. I am running way more different kinds of SPX volatility capture strategies. I told you all not that long ago that I had slowed down on their production. And it's because volatility had siphoned out and there really wasn't as much money to be made based on the risk I was taking. And it's the exact opposite. Today's a great example. I was trading volatility almost all day with FOMC because it's such a lucrative event. So that's one method to profit from the current market conditions that have us placed somewhere around that 10 mark. The other things that I do in these time frames is I",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "a great example. I was trading volatility almost all day with FOMC because it's such a lucrative event. So that's one method to profit from the current market conditions that have us placed somewhere around that 10 mark. The other things that I do in these time frames is I trade things directionally, but I shorten my durations and the types of directional ideas that I trade look a lot different. So for example, if I'm trading something from a post earnings announcement drift lens, which I do, I still will not hold those things as long as I typically would, which a lot of times post earnings announcement drift will happen over the next quarter. And I'll show you. Let's run a quick scan. And then I just want to eyeball the performance of some of these things with you. Do we have a post earnings announcement? We don't. We can build one really quick. It's easy. So the first thing for post earnings announcement drift, we know that we want something that's at least a few bucks. Normally I would filter this to be at least like 10 bucks, but I normally use a lighter filter for the streams and stuff simply because the cheaper stuff can actually provide pretty good opportunity for people. I prefer things that have options. So I'm adding another filter that I wanted to have at least 500 open interest, which is very, very light. Now the next thing we need to take",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "streams and stuff simply because the cheaper stuff can actually provide pretty good opportunity for people. I prefer things that have options. So I'm adding another filter that I wanted to have at least 500 open interest, which is very, very light. Now the next thing we need to take a look at two different things. We need to take a look at earnings. So we need, I forgot if it's most recent or latest. I don't remember. One of these will give us the correct one of them won't. So let me just fact check it really quick. So we want to do at least we just want to look back over yesterday. Let's see if these look correct. 319, 1919, 18, these look correct. This is great. Okay, good. So then this is accurate so far. So this is essentially looking at things that have had earnings in the last day. Now the next thing is I want something that has had a gap. Following earnings. So in this case, we want something that gaped. We're looking for post earnings announcement drift to the positive for this example. So we'll look for things that have had a gap of at least 5 and then we also need surprise. So the last earnings release, we need something that had at least a greater than 0 surprise. So nothing fits the filter for this. So all I'm going to do is open up the time a little bit again, just",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "of at least 5 and then we also need surprise. So the last earnings release, we need something that had at least a greater than 0 surprise. So nothing fits the filter for this. So all I'm going to do is open up the time a little bit again, just for the example. Let's move this up. I just want to find a name that actually fits the criteria. Okay, so something seems off with this. Turning surprise last. Let me get rid of this and see if that's it. Dig. Let's take a look at sig. Yeah, see, oh, no, it's looking at a correct. It had a really terrible surprise. It actually missed to the downside. So this is actually looking. Actually looking correct. So this is just saying that right now there are really just very few things that are meeting this criteria. Let's look back over the last month. I know that there would be something at some point. And then if not, I'll just eyeball some stuff. Okay, yeah, I will abandon ship on this. Let's just take a look at think or swim really fast. What I want to show you is the type of moves that happen. So let's go to the calendar. And let's look at something that had good earnings. M-R-V-L looks like they had good earnings. So let's take a look. They had good earnings, but they fell off a cliff. Let's take a look at some of their previous",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "of moves that happen. So let's go to the calendar. And let's look at something that had good earnings. M-R-V-L looks like they had good earnings. So let's take a look. They had good earnings, but they fell off a cliff. Let's take a look at some of their previous earnings. So if we go back to to their December 3rd earnings, you can see that after this massive gap, there's this drift that occurred essentially from the 4th of December peaking out to the 24th of Jan. So what, like six weeks? One of the things that I noticed for post earnings announcement drift in any sort of consumable form for this most recent earnings cycle is that one, it's way fewer and further in between. But the second thing is that the duration of the positive move is much lower. Now, one thing to remember is you can trade things like post earnings announcement drift either to the upside or downside. It's just slightly different criteria. But the point here is that I modify my current tool bag so that I can trade things that make the most sense given the current market conditions and the suite of things that thus changes with. Other things that change is very basic sector rotation strategies. Those come down right now. They're not suitable things like that. So to summarize what we've covered about managing an options portfolio at a high level. And then I want to talk about some specific",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "things that thus changes with. Other things that change is very basic sector rotation strategies. Those come down right now. They're not suitable things like that. So to summarize what we've covered about managing an options portfolio at a high level. And then I want to talk about some specific tendencies quickly is that it's super important to take a look at the actual portfolio. What it's doing? We then need to conduct an actual analysis of the market and broader economic themes to inform our decision making. Then we adjust our portfolio. This can include things like taking trades down, balancing our deltas by adding short deltas to the portfolio if we're too long or adding long deltas if we're too short. This can be done by finding individual opportunities and structuring trades off of those or it can be done via managing the risk via index positioning. So selling calls, selling puts, buying calls, buying puts, again, depending on what you're trying to capture. One of the things I notice during the profit function here is most of the time frames that I'm trading start to siphon down and I start to conservatively position my core allocation and then more strongly pivot into my speculative allocation. So that is the general concepts about managing an option portfolio during a market drawdown. Any questions that you guys have on that? I'm going to pop the door for the way. All right. Beautiful. Lawrence is the volume on a lot",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "then more strongly pivot into my speculative allocation. So that is the general concepts about managing an option portfolio during a market drawdown. Any questions that you guys have on that? I'm going to pop the door for the way. All right. Beautiful. Lawrence is the volume on a lot of stocks I watch have been very low recently. That'll definitely happen depending on the names. Sometimes you'll actually find certain stocks can get way more active now because what ends up happening is a lot of money will siphon out of the more speculative names and it'll migrate into the more defensive or safer names, which is a really interesting thing. So if we take a look, I'll clear all this stuff off. If we take a look at this, this is looking at the different sectors, take a look at the average volume. You'll see that the average volume in builders is going down. The average volume in XLC, comm services is kind of going down and peeking up a little bit. You can see that for energy, it ramped up and it went down, but on average, it's still drifting up. You can see for things like healthcare actually starting to slow down, which is a little antithesis. It's not always perfect, obviously. But then you can also see staples has seen a massive surge and that surge really correlates with the broader market drawdown. So this is super common. And it's a really tradable effect actually",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "healthcare actually starting to slow down, which is a little antithesis. It's not always perfect, obviously. But then you can also see staples has seen a massive surge and that surge really correlates with the broader market drawdown. So this is super common. And it's a really tradable effect actually to find the things where money we call it flows. So finding where money is flowing into and out of can be really, really effective. So I think one of the things to keep in mind with the broader market right now is that as the market is in like this decision mode, volatility looks really attractive to me. And volatility is still at attractive levels. It's still above 20. So there's definitely a lot to do. But the position sizing for me tends to come down and I tend to start throwing more stuff out there. There's actually a great example of one of the approaches I use is actually a trade that I ran today is in AI. So AI is C3 AI. And the thing that really stuck out to me here is what do you notice about the call versus put volume today? What sticks out to you here? There's a couple things that should be really, really drawing drawing your eye in a pretty big way. The first thing is Jordan says it's skewed. It is. That's correct. You want to click in a little bit though because that's where a lot of the information",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "to you here? There's a couple things that should be really, really drawing drawing your eye in a pretty big way. The first thing is Jordan says it's skewed. It is. That's correct. You want to click in a little bit though because that's where a lot of the information is. So the fact that there's big call versus put skew is definitely our first indicator that something's going on. The next thing is if you take a look at the actual transactions, the unbelievably overwhelming number of these calls were bought. 46 came in at the offer above. Of the 2700 puts, the overwhelming majority were sold. Interesting. If I take a look at the total call volume today, 91,000 against the total call open eye of 300,000, it's almost a third of the entire existing OI traded just today. So then that for somebody like me, that draws my eye. Why and where? So then if we come in here, we can see that in the 20 June, there was 37,000 of the 25 traded out in 30 June. And then we can also see in 21 March at the 35,000, there was 36,000 traded huge numbers traded today. So then we can say interesting. It's in those two explorations, 20 June and then 21 March. So let's go look at those. 20 June here. Take a look. The 25s with 37,000 contracts traded, it's 96 times volume over OI. Really interesting to me. And then if you",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  },
  {
    "text": "today. So then we can say interesting. It's in those two explorations, 20 June and then 21 March. So let's go look at those. 20 June here. Take a look. The 25s with 37,000 contracts traded, it's 96 times volume over OI. Really interesting to me. And then if you take a look at 21 March, or I'm sorry, was it 21 March or yeah, I already forgot. Well, it should be 21 March. The 35s. Here. There's 36,000 that traded today against 43,000. So massive, massive volume build out here is just interesting. So then you can use these as different trade ideas. There's a couple of other steps that I typically follow to take a look at the vol curve and stuff like that. But these ideas become very interesting during markets like this, right? Where the coverage triangle is kind of mellow, not really doing a whole lot, but this stuff can provide really solid returns in the meantime. So that's all I got, gang. As always, if you need anything, let me know. Be an outlier. See you all later.",
    "metadata": {
      "video_id": "dW3sNQFVTgA",
      "title": "Managing an Options Portfolio During Market Drops | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=dW3sNQFVTgA",
      "upload_date": "",
      "duration": 2745.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 28,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dW3sNQFVTgA&t=0"
    }
  }
]