[
  {
    "text": "Option buyers that are unfamiliar will come in here and buy the 90s because they think they have to buy the option that the stock is going to go to. It's not the case at all. What's up, outliers? Here are 11 options trading tips to make more money when trading options. Let's get straight into it. The very first bucket of things we're going to talk about is how we can use options for information. This is something that a lot of people overlook and you can look at things like put call ratios implied volatility and the probabilities provided by options to come up with ideas for what you think something may or may not do. So what does this look like? Put call ratio specifically gives us an idea of the number of puts transacted relative the calls. Normally, we will see more puts than calls because people tend to hedge the downside, but not always. Sometimes we will actually see calls have more open interest than puts that typically means that we're speculating upside move for one reason or another. So put call ratio puts this into a simple context. Normally, we will use the front expiration cycle, the front primary expiration to provide this number. Sometimes we can use it just for the volume on an individual day. It is completely dependent on your platform, but here essentially we take the total number of puts divided by the total number of calls. And in this",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=0"
    }
  },
  {
    "text": "expiration cycle, the front primary expiration to provide this number. Sometimes we can use it just for the volume on an individual day. It is completely dependent on your platform, but here essentially we take the total number of puts divided by the total number of calls. And in this case, we can see that we actually have some pretty heavy call skew, meaning in Walmart as it sits today, people are speculating to the upside. That's actually the second tool that we can use for information is this down here at the bottom in the platform. Different platforms will have different ways to display this, but this is showing us total open interest. It's showing us for calls and puts. We can look at it in individual expiration cycles. We can look for it in different series to have ideas on how people are positioning in different time frames. The other thing we can use here is implied volatility. So we can use implied volatility for the product or the security itself. In this case, the implied volatility for Walmart is 23. Now, we can use something like IVP implied volatility percentile to put this into context of is this 23 implied volatility high relative to Walmart or low. And in this case, it's actually pretty high. So what does this tell us? Well, it means that we're expecting Walmart to have higher relative movement going forward. And it doesn't really surprise us because we have earnings coming up",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 14,
      "start_timestamp": "00:01:08",
      "start_timestamp_seconds": 68.22,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=68"
    }
  },
  {
    "text": "this 23 implied volatility high relative to Walmart or low. And in this case, it's actually pretty high. So what does this tell us? Well, it means that we're expecting Walmart to have higher relative movement going forward. And it doesn't really surprise us because we have earnings coming up on the 19th of next month. So you can use implied volatility as an expectation of movement. And then you can also use implied volatility percentile to understand if we're expecting more or less movement relative to the individual security that you're looking at. The other thing you can use is implied volatility for different expiration cycles. It's the same exact concept, but we get more specific. So we can see that there are periods where implied volatility expands relative to other expiration cycles that tells us something is expected in that expiration cycle. So you can use options to gain a lot of information. This is just the tip of the iceberg on that. And that's just the tip of the iceberg. If you ever want to explore these more in depth, just let me know and we'll take a look. Now I do want to talk about probabilities because that's one of the coolest parts about options. So let's say that you wanted to put on a trade in Walmart and let's say that you want to be bullish. You just think Walmart's going to go up and you're doing your technical analysis and you think Walmart might",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 14,
      "start_timestamp": "00:02:12",
      "start_timestamp_seconds": 132.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=132"
    }
  },
  {
    "text": "because that's one of the coolest parts about options. So let's say that you wanted to put on a trade in Walmart and let's say that you want to be bullish. You just think Walmart's going to go up and you're doing your technical analysis and you think Walmart might go to 84 for whatever reason. We actually can use options to see what's the probability of Walmart hitting 84. Options markets are highly, highly informed. And there's a few ways we can do it. We can either use the options chain itself so I can say, what's the probability of Walmart hitting that 84 handle within the next 26 days? I can come in here. I can go to something close to the 84 call. There isn't one. So we would just use the 85 and we can look at literally the probability of a touch. The probability of a touch is what is the probability of the underlying touching that strike sometime before expiration? And right now it's priced at 42. And the probability of it expiring in the money is 21.5. So this is the probability of Walmart closing above in this case 85 in 26 days. So option markets are highly informative and you can use it to come up with ideas, even for a directional assumption, even if you're not looking to trade options, you can still use them for information. The other thing you can do is if your platform has it, some of",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 14,
      "start_timestamp": "00:03:23",
      "start_timestamp_seconds": 203.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=203"
    }
  },
  {
    "text": "So option markets are highly informative and you can use it to come up with ideas, even for a directional assumption, even if you're not looking to trade options, you can still use them for information. The other thing you can do is if your platform has it, some of them will have these probability projections. Now this uses one standard deviation move as it's plotted here. And this is right now looking at the probability of something being in the money. And we can change this to be the probability of something touching a certain strike price. This is really useful if you use stops or if you have a profit target that you're planning on taking profit at. And then on the X axis, we can see that this is just different days to expiration and it even highlights the expiration cycle. So let's say we're interested in again trading Walmart. We think it might hit 84. So what's the probability that it hits 84 by 25 October? Well, if we go in here and we take a look, it's about 20 chance. Now the cool part is if we go further out in time, let's say that we have a two month thesis, what's the probability of hitting 84 in the next 60 days? Well, 74 chance. So now you can quantify some of what you're doing, whether you're trading options or not. So they can provide a lot of information. And as I said, that's literally",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 14,
      "start_timestamp": "00:04:18",
      "start_timestamp_seconds": 258.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=258"
    }
  },
  {
    "text": "we have a two month thesis, what's the probability of hitting 84 in the next 60 days? Well, 74 chance. So now you can quantify some of what you're doing, whether you're trading options or not. So they can provide a lot of information. And as I said, that's literally just a tip of the iceberg. Options provide leverage. So you gain cheaper exposure to things and it's a way to amplify your returns. So let's look at an example here. If we go to the risk profile and we take a look and again, we want to be long Walmart in this scenario. If we buy 100 shares of Walmart, you control 100 shares and you're going to pay 8,132. However, you can buy this call that's in 17 Jan 2025. It's the 7667 call. Don't worry about the strike price here. I'm just using something that's slightly in the money. This costs 700 and this provides up to the same exposure as those long shares, except instead of paying 8,132, you're paying 700. That's leverage at work. So that seems like a really sweet deal. Why wouldn't we always use this forever? And it leads us into this next component, which we're going to bounce back and forth between these. All options expire and they decay. So the reason why sometimes shares might be a smarter place, if you're planning on holding something for multi-year periods, your options are going to expire. So there is a time-bound element",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 14,
      "start_timestamp": "00:05:19",
      "start_timestamp_seconds": 319.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=319"
    }
  },
  {
    "text": "next component, which we're going to bounce back and forth between these. All options expire and they decay. So the reason why sometimes shares might be a smarter place, if you're planning on holding something for multi-year periods, your options are going to expire. So there is a time-bound element now to our ideas. Now, there's also a relationship. Options that are further out in time are going to be more expensive than options that are closer to expiration. That's just simply because there's more time in the contract. But options that are nearer in time will actually have some other effects like heightened gamma, which is the rate of change of delta. So gamma tells us how fast the delta of an option is going to change. And as you know, if you follow the options 101 series, anything like that, as options get close to expiration, their delta is going to be either a zero or a one. So both delta and gamma get very active as we get closer and closer to expiration. So what does that mean? Well, you have to figure out what makes sense for you, whether you're buying or selling an option. If you sell, maybe you want something that could have a little bit more time for more extrinsic value, but if you go further out in time, you might actually notice that it has a lower theta. Theta decay picks up as you get within 60 DTE. So why does that",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 14,
      "start_timestamp": "00:06:27",
      "start_timestamp_seconds": 387.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=387"
    }
  },
  {
    "text": "you sell, maybe you want something that could have a little bit more time for more extrinsic value, but if you go further out in time, you might actually notice that it has a lower theta. Theta decay picks up as you get within 60 DTE. So why does that matter? Well, it tells me that if I'm buying options, I actually might want to go greater than 60 DTE, even if I'm not planning to hold it to expiration. It's a common misconception. You don't have to take it to expiration. You can trade something like I do all the time and come out to like this 80 90 DTE. And then after three weeks pass, I can close the trade down. But what I'm doing by going further out in time here is I'm decreasing my theta. This is if I'm buying the option. It's totally up to you. If I'm selling an option, I actually want more theta decay, but if you're selling an option and you come too close in time, you're also going to get more gamma. Do you have to find the balance that's right for you? So the other thing to keep in mind when trading options is you can be right and wrong at the same time. This trips a lot of traders up. What does that mean? Well, unless you are hedging for direction, gamma hedging, delta hedging, then you have exposure to these different profit factors. Now the dominant profit",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 14,
      "start_timestamp": "00:07:27",
      "start_timestamp_seconds": 447.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=447"
    }
  },
  {
    "text": "mind when trading options is you can be right and wrong at the same time. This trips a lot of traders up. What does that mean? Well, unless you are hedging for direction, gamma hedging, delta hedging, then you have exposure to these different profit factors. Now the dominant profit factor or impact to your option is going to be direction almost always. Again, unless you are hedging your deltas, then you're isolating another one of these variables. And there's more than this to be clear. These are just the primary ones. So if you sell an iron condor, people do that for kind of a neutral play, which looks like this. Most people think that they're going to make money from IV contracting. And that's one of the ways you can make money here. However, the main thing that has to happen is price has to stay within your strikes. That's how this trade makes money. So even though you might have a directional bias in terms of not wanting to see a lot of movement, it doesn't matter even if implied volatility does contract. If you get big movement in one direction, you still lose. So this is still very directional in nature, even though a lot of people put this on thinking that they're directionally neutral. They're not. This needs to remain within a range. That's a directional disposition. And again, unless you're hedging the deltas away as it moves, you still have a directional disposition. So",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 14,
      "start_timestamp": "00:08:24",
      "start_timestamp_seconds": 504.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=504"
    }
  },
  {
    "text": "still very directional in nature, even though a lot of people put this on thinking that they're directionally neutral. They're not. This needs to remain within a range. That's a directional disposition. And again, unless you're hedging the deltas away as it moves, you still have a directional disposition. So that's an example where let's say implied volatility contracts on your iron condor. That would help your trade, but if price moves up as it's doing that too far, you still lose. So your hypothesis was correct. Implied volatility might go down, but your direction input was off. So you have to always keep in mind what impacts your option. And in the majority of time, it's going to be delta, primarily, even if you're directionally neutral in your thesis, it still is going to be the dominant impact in most cases. Implied volatility via Vega, time via theta, these become secondary inputs. Because for example, another great scenario here to look at is, let's say time passes and Walmart, we can simulate time passing. And Walmart doesn't move. Your iron condor is looking really, really solid. It's looking great. Well, there's a problem that arises. This is your profit rising in relation to your max profit. But there's a problem here, because even if time passes and you're making money because it's remaining range bound, then if it starts to move, even if you're up a bunch of money, you can then lose all of it. Because again, direction",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 14,
      "start_timestamp": "00:09:25",
      "start_timestamp_seconds": 565.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=565"
    }
  },
  {
    "text": "rising in relation to your max profit. But there's a problem here, because even if time passes and you're making money because it's remaining range bound, then if it starts to move, even if you're up a bunch of money, you can then lose all of it. Because again, direction is going to be the primary input here. So that applies if you're buying a call, selling a call, selling a put, buying a put, buying straddle, strangles, iron condors, all of it, is going to have a massive directional component via delta that you have to pay very close attention to. Things like changes in implied volatility are temporary. Going back to this same example another time, let's say again that we think implied volatility is going to go down. And let's say implied volatility doesn't go down. Let's say it actually goes up. Well, that would temporarily hurt us. But as long as price remains within this range, this would still be profitable, regardless of what implied volatility does. It's a secondary input. Same thing with respect to time. Time as time passes, like I showed you in the example just before, this time can pass. But then if before expiration, there's a directional move that will impact your delta's, you can still lose on your trade, even if a bunch of time passes. So for vast majority of trades, this is going to be your dominant input. The last thing that I want to highlight here that",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 14,
      "start_timestamp": "00:10:33",
      "start_timestamp_seconds": 633.78,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=633"
    }
  },
  {
    "text": "if before expiration, there's a directional move that will impact your delta's, you can still lose on your trade, even if a bunch of time passes. So for vast majority of trades, this is going to be your dominant input. The last thing that I want to highlight here that I see is a really, really common mistake, especially for option buyers is I see option buyers commit two things that really hurt them. The first one is option buyers tend to stay closer in time because it's cheaper. You don't have to do that. You can go further out in time, but plan to close it earlier. So even though you're laying out a larger amount of money up front, you're expecting to recoup most of it, even if it doesn't go in your direction. That's the first thing. Now, again, doesn't always work out like that. If you get a really big directional move that's the wrong side of the trade, then you can lose a lot more money than if you buy a cheaper option. But if your analysis is good, your trade management is good. By going further out in time, you give the trade a little bit more time to work in your favor. The other thing I see option buyers do is they buy the strike that they think the stock is going to go to. So an example here is Walmart. Let's say we think Walmart is going to go up and we",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 14,
      "start_timestamp": "00:11:35",
      "start_timestamp_seconds": 695.06,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=695"
    }
  },
  {
    "text": "little bit more time to work in your favor. The other thing I see option buyers do is they buy the strike that they think the stock is going to go to. So an example here is Walmart. Let's say we think Walmart is going to go up and we think it's going to go to 90. Option buyers that are unfamiliar will come in here and buy the 90s because they think they have to buy the option that the stock is going to go to. It's not the case at all. In the example that I just showed you here, if we take a look at this option that I bought, which was the 7667, notice how it goes to 90. I still make money. Even though I'm buying an option that's in the money, there's a specific reason why I do this. And if you're interested in learning more, check out the video at the end of this video. It'll pop up and it'll take you to a video about buying options smarter, which will dive into all of this. But just know that if you're an option buyer, you don't need to buy the strike that you think the stock is going to go to. As always, if you need anything, let me know. Be an outlier. See y'all later.",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 14,
      "start_timestamp": "00:12:35",
      "start_timestamp_seconds": 755.14,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=755"
    }
  },
  {
    "text": "you think the stock is going to go to. As always, if you need anything, let me know. Be an outlier. See y'all later.",
    "metadata": {
      "video_id": "dYfq58DkY5c",
      "title": "Options Trading Secrets: 11 Ways to Maximize Your Gains",
      "url": "https://www.youtube.com/watch?v=dYfq58DkY5c",
      "upload_date": "",
      "duration": 809.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 14,
      "start_timestamp": "00:13:22",
      "start_timestamp_seconds": 802.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=dYfq58DkY5c&t=802"
    }
  }
]