[
  {
    "text": "You're going to trade them. I'm going to trade them. So let's talk about how we trade them. What exactly? Zero DTE options. I'm going to walk you through a guide on some of the things that I think she'd keep in mind. Pros and cons. First, second, I want to walk you through the downfall of retail traders, integration of them into their strategies via data from a handful of studies that I really like that I also juxtapose against my own data set. But nobody should trust my data set. I think it's better to use the stuff that you can find that's peer reviewed. So we're going to go through that. But I'll integrate some of the things that I found personally along the way. And then at the end of the video, I'll walk you through exactly how I integrate zero DTE expressions into my trading style and how I like to trade them. So without further ado, what's up everybody? Eric here. Welcome back to all the outliers. A huge shout out to the Patreon family and the YouTube members. You guys make this all possible. This takes a lot of time to put together to give you good information. So let's get straight into this video. The very first thing that I want to talk about some pros and cons. And what you're going to notice from this list is it's not labeled as a pro or a con. And it's because it really",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=0"
    }
  },
  {
    "text": "to give you good information. So let's get straight into this video. The very first thing that I want to talk about some pros and cons. And what you're going to notice from this list is it's not labeled as a pro or a con. And it's because it really depends on the side of the trade that you're on. So for example, gamma, this really helps long options. So if we're on expiration day, gamma is super high because every single option needs to approximate to one or two spots, either a zero or a one delta, meaning it's out of the money or in the money. That's what's happening on expiration day. So gamma is very high because all options need to do that. That benefits buyers. It hurts sellers. What's the trade off here? Well, theta is also fast moving like gamma that benefits sellers, not buyers, because all of the options that are out of the money need to approximate to zero. So that means theta is going to decay very, very fast. So for a great example of this, let's hop over to the platform. If we take a look at SPX here and we go to four main, which is today's expiration, notice how everything that's out of the money is now essentially bid zero offered at five, which means that's the minimum bid I spread. These are all worthless. And then if we go to one day to expiration, notice how much premium",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 18,
      "start_timestamp": "00:01:37",
      "start_timestamp_seconds": 97.15555555555557,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=97"
    }
  },
  {
    "text": "go to four main, which is today's expiration, notice how everything that's out of the money is now essentially bid zero offered at five, which means that's the minimum bid I spread. These are all worthless. And then if we go to one day to expiration, notice how much premium is still in these options. But what I really want to hone you in on is this gamma. That's this column here. It's a little difficult to see, but gamma for at the money options relative to the cost here is going to be pretty high. And it's because they need to make that decision. If they're out of the money, they're going to zero. If they're in the money, they're going to whatever their intrinsic value is. So again, that kind of depending on what side of the coin here, whether you're buying or selling and it's really the same for calls or puts this fast moving theta and gamma benefits both or hurts both. The volatility edge really is going to benefit the sellers out there. And this is an important concept too, though. And this is actually going to be one of the things we talk about later. But this really just falls into theta decay. In some case, if you're a seller and that's it, the fast moving component is what draws people to these products. But depending on what side of the trade you're on, it's going to have a different impact. This, however, is",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 18,
      "start_timestamp": "00:03:14",
      "start_timestamp_seconds": 194.31111111111113,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=194"
    }
  },
  {
    "text": "later. But this really just falls into theta decay. In some case, if you're a seller and that's it, the fast moving component is what draws people to these products. But depending on what side of the trade you're on, it's going to have a different impact. This, however, is universal. No overnight risk. If you put on these trades, you can go to sleep and just chill out because there's no overnight risk. Now a super important note here, though, is I think traders perpetually look for a boogie man. They're looking for something to justify a behavior. And overnight risk is not as scary as it is. What I mean by that is if you look at portfoliovisualizer.com, you throw in a 10,000 portfolio and you look back 30 years, whatever the case is. That has a lot of overnight risk. There's a lot of nights over the course of holding that product. But somehow it turns out, okay, it makes money. The point being is overnight risk is not the boogie man here. And there's ways to overcome that by the way we structure the trades, what's I'm going to get into in a minute. So while this is a benefit to be very clear, not having overnight risk is a benefit, I would not permit your mind to say, oh, I should only trade zero DTE options because they have no overnight risk. And that's where all the risk is. It is not the case. The",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 18,
      "start_timestamp": "00:04:51",
      "start_timestamp_seconds": 291.4666666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=291"
    }
  },
  {
    "text": "this is a benefit to be very clear, not having overnight risk is a benefit, I would not permit your mind to say, oh, I should only trade zero DTE options because they have no overnight risk. And that's where all the risk is. It is not the case. The risk is actually in your shitty strategy. That's it. So with that little disclaimer aside, let's take a look now at what the con is. What's the con? This is the largest drawback of zero DTE options. And I cannot emphasize this point enough. We're going to talk about this at length. Now you might be saying to yourself, Eric, the cost is only the 40 cents per contract that I'm putting on. That's not so bad. Not the case. So coming back over here again to the platform, if we go here to one data expiration and you take a look at the bid-esque spread, there's slippage involved in where you actually get your fill. So this is the 4060 at the money put is bid at 19 offered at 1950. That's 50 cents right there right out of the gate in addition to your fees that you pay on top. And we're relative comparison. If we go out here to 16 June and we go to this at the money, these are worth the same 4060s. Their bid 91 80 offered 93 50. So as a percentage, these are massively more expensive. That's like a 2 plus bid-esque",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 18,
      "start_timestamp": "00:06:28",
      "start_timestamp_seconds": 388.62222222222226,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=388"
    }
  },
  {
    "text": "on top. And we're relative comparison. If we go out here to 16 June and we go to this at the money, these are worth the same 4060s. Their bid 91 80 offered 93 50. So as a percentage, these are massively more expensive. That's like a 2 plus bid-esque spread based on the relative value of this compared to out here. This is like 1.85. So the point being is the spreads you're paying on these again on a relative basis is massive. And that's important because we're going to talk more about cost in a minute. But this is this is really what we're fighting against here. And we're going to talk about how we can do that. Okay, so this is going to be the paper I'm referencing, whichever way should point in this scenario. This is the paper we're going to be talking about. And there's a bunch of other details that I'm baking into this from both my own data set and then a couple of other ancillary information sources. But I wanted to use a peer reviewed data source because there's no reason for anybody to really put a whole bunch of weight on my data, although I certainly do. It is still worthwhile, I think to draw some parallels between these two. But this is a pretty well done paper. There's to be very clear. There's holes in any paper that's done. So I do not want you to look at this as",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 18,
      "start_timestamp": "00:08:05",
      "start_timestamp_seconds": 485.7777777777778,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=485"
    }
  },
  {
    "text": "my data, although I certainly do. It is still worthwhile, I think to draw some parallels between these two. But this is a pretty well done paper. There's to be very clear. There's holes in any paper that's done. So I do not want you to look at this as if this is the end all be authority on everything. It's not they make assumptions. They have to. But we can still learn a lot from this paper. So with that aside, let's get straight into it. What do traders do? Well, we can tell that traders in general have really started taking on to this idea of zero DTE expiration. So you can see a zero DTE here orange and notice how wide of a space this is taking up in monthly trading volume. I guess you can't do that. My stupid face is in the way. Maybe you can now. But as you can see, this is a massive space that they're consuming. This means that the demand is huge. The same thing is if we take a look at zero DTE one DTE two, so on and so forth, notice how prevalent this is compared to everything out there. And if you take a look at just short term duration, so essentially zero and one DTE, that is also massive. So overall, there has been a huge spike in monthly trading volume centralized in zero DTE stuff. Now, we're going to look at slim trading volume and",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 18,
      "start_timestamp": "00:09:42",
      "start_timestamp_seconds": 582.9333333333334,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=582"
    }
  },
  {
    "text": "out there. And if you take a look at just short term duration, so essentially zero and one DTE, that is also massive. So overall, there has been a huge spike in monthly trading volume centralized in zero DTE stuff. Now, we're going to look at slim trading volume and the blift notes version of what the hell slim is. It's a way for us to look at trade level data from CBO and identify the highest probability of retail trades. This does not mean that every trade listed in here is retail, but we know with relative confidence that most of it is going to be. And this is something that I also track personally. So I'm familiar with this concept, but the again, Clifft notes version is there was a price improvement protocol put in a place for small orders and indices and whatnot. And most of retail orders fall into that bucket of essentially 10 lots or less. So this is how we're drawing on that. It's not perfect, but it's pretty good. So what I want to highlight here, though, is the monthly you can essentially insert retail trader volume in general here, the monthly retail trader volume. Take a look at the total volume, which is blue and how much of that total volume is zero DTE. It kind of explains itself. Ever since we had COVID, we started launching more explorations. There's a demand for it. And it's just been maintained to a pretty",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 18,
      "start_timestamp": "00:11:20",
      "start_timestamp_seconds": 680.088888888889,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=680"
    }
  },
  {
    "text": "trader volume. Take a look at the total volume, which is blue and how much of that total volume is zero DTE. It kind of explains itself. Ever since we had COVID, we started launching more explorations. There's a demand for it. And it's just been maintained to a pretty significant order. And you can see the slim share compared to total volume. So we have it breaks down zero DTE, non, and then total, so on and so forth. The point being is it's extremely popular and it's not slowing down. That's not a good thing or a bad thing. It just means that it's very common. Now, this is where we start getting into kind of more of the specific details that I think is pertinent to most people. And this is breaking down zero DTE trading volume from again, non retail versus retail. And there's a few notes here that I think are important to you. And I've highlighted them here. When we talk about the breakdown between calls and puts, it's essentially same same for retail versus non retail light ever so slight variants between the two. Nothing noteworthy. If we look at the size again, you can see that the gross centralization for retail is in single contracts. And that's not the case for non retail. It's still overwhelming single contracts, but there's a bigger breakout between two to five and so on and so forth. So when we look at these though, this is",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 18,
      "start_timestamp": "00:12:57",
      "start_timestamp_seconds": 777.2444444444445,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=777"
    }
  },
  {
    "text": "you can see that the gross centralization for retail is in single contracts. And that's not the case for non retail. It's still overwhelming single contracts, but there's a bigger breakout between two to five and so on and so forth. So when we look at these though, this is where it starts to get important. When we look at the direction, whether we're buying or selling, you can see that there is a kind of centralization in buying for retail, but selling for institutions. Now, I want to be super clear before all of the theta gang people out there start saying like, oh, shit, yep, I got it right. This is all I should be doing. Let me put my stupid face right in the middle of the screen to hopefully intercede that thought process. That is not the case. Selling is not some sort of magic potion that fixes everything. It's really important not to understand why selling works and when selling works. I'm not going to go super far into detail on this video. I will throw a link to a really great video that I made in the notes below on this exact concept, but it is important to note that in general, Belling does have a benefit if it's properly deployed, which is why you will see this breakdown where non retail tends to favor selling a bit. Now, whether it's call or puts, you can see that this is slightly inverted and there's",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 18,
      "start_timestamp": "00:14:34",
      "start_timestamp_seconds": 874.4000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=874"
    }
  },
  {
    "text": "it is important to note that in general, Belling does have a benefit if it's properly deployed, which is why you will see this breakdown where non retail tends to favor selling a bit. Now, whether it's call or puts, you can see that this is slightly inverted and there's going to be more selling of both on this side, but if you'll notice, when we look at the buy versus sell calls versus puts, it's nothing too crazy to walk away from here other than you could tell that we prefer selling and from a non retail perspective and on a retail perspective, they're looking to buy. So, that aside, I want to start getting into some other specifics. And this is one of the funny things, right? We get to joke about this because it is funny, but it's also sad to me at the same time, which is the people on Wall Street bats love them. I am a fellow ate myself and a degenerate in a lot of instances, but in this case, it's killing them. And the part that makes me sad is a lot of these people don't have a bunch of money to lose. What this means is this is just looking how popular zero DTE mentions on Reddit has become and you can see essentially from COVID. Somewhere in here on, it's exploded. And what does this mean? It's lottery. People really want to use these as lottery. They want to be",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 18,
      "start_timestamp": "00:16:11",
      "start_timestamp_seconds": 971.5555555555557,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=971"
    }
  },
  {
    "text": "lose. What this means is this is just looking how popular zero DTE mentions on Reddit has become and you can see essentially from COVID. Somewhere in here on, it's exploded. And what does this mean? It's lottery. People really want to use these as lottery. They want to be able to make a lot of money very fast. And that's not that's not what's happening here. You can see this is actually looking at net and gross profits. Remember before when I was really harping on this concept of cost, well, this is where it's coming to bear. Take a look at the orange gross profits. Even in the periods where retail was doing okay with gross profits, it's about cut almost in half after fees. Even in this peak where they did really well, fees took out a giant chunk, something to the tune of 40, 50, 60 percent depending on which exact way you're looking at. And it gets worse because when retail traders are gross losing money, meaning they're just wrong, the net after fees is massive. These are killing these people and it's a bummer to see. So what's going on here? Well, again, the fees are not relegated to just the commissions you pay. There are also fees that you get from slippage, transaction costs, payment for order flow, non, not super competitive pricing. All of these sorts of things start to hurt you. Now, the SIBO did institute that price improvement program back",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 18,
      "start_timestamp": "00:17:48",
      "start_timestamp_seconds": 1068.7111111111112,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=1068"
    }
  },
  {
    "text": "fees are not relegated to just the commissions you pay. There are also fees that you get from slippage, transaction costs, payment for order flow, non, not super competitive pricing. All of these sorts of things start to hurt you. Now, the SIBO did institute that price improvement program back in 2020 and that did help, but it doesn't fix the problem because payment for order flow still exists. So all of this summarized up just means fees are hurting. So if we take a look at net profits of 100,000, this is looking at month by month. There's a 25 sample size. There are four profitable months net profits. There are nine profitable months, gross. So we literally are cut in half in terms of our aggregate profitable trades month over month after we include fees. You cannot underestimate the cost of doing business as a retail trader. This is also why when retail traders talk about, oh, I like to scalp one. You don't because retail traders really were not equipped to scalp. Scalping is like seconds. It is when you are in and out super fast. That is what high frequency trading algorithms are doing to essentially capture bit-ass differences, mispriceings, arbitrage, stuff like that. In general, retail is not going to be fast enough, but the bastardized version of scalping we do, which really is just intraday trading. We think it sounds cool. We heard, you know, Tom Sausanoff say it, who I like, but everybody",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 18,
      "start_timestamp": "00:19:25",
      "start_timestamp_seconds": 1165.8666666666668,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=1165"
    }
  },
  {
    "text": "capture bit-ass differences, mispriceings, arbitrage, stuff like that. In general, retail is not going to be fast enough, but the bastardized version of scalping we do, which really is just intraday trading. We think it sounds cool. We heard, you know, Tom Sausanoff say it, who I like, but everybody wanted to start doing it so it's cool. The problem is it doesn't work well, especially once you add in fees, not just to mention how difficult it is to get small time frames correct, directionally. That is one of the hardest time frames to get direct, directionally correct. What do you mean? It's such a short-term time frame. Why is it so difficult? Because that's when randomness is at the highest probability. If you think about where the stock market is going to be 10 years from now, what do you think? Higher or lower? I would bet higher. And if somebody wants to make that bet, hit me up. I do think it could be an interesting thing to follow along. And the point being though, most people probably would be confident that it's going to be higher in 10 years relative than it is today. But if you talk about whether or not the SP 500 is going to go up within a five-second increment or a 10-second increment, very difficult. And then you add fees on top of that because scalping typically includes a lot of very small profits and then not just, again, commissions, but",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 18,
      "start_timestamp": "00:21:03",
      "start_timestamp_seconds": 1263.0222222222224,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=1263"
    }
  },
  {
    "text": "you talk about whether or not the SP 500 is going to go up within a five-second increment or a 10-second increment, very difficult. And then you add fees on top of that because scalping typically includes a lot of very small profits and then not just, again, commissions, but the cost associated with doing it very difficult to make money. Okay, now that that horse is beat thoroughly to death, let's just talk about this concept of expensiveness. This is actually pretty cool to me. So from this paper, they actually found that retail orders do better in high-vict's environments. And this is typically when people are attempting to sell, but over the duration, traders actually became more sensitive to the expensiveness of options, which I actually think is super cool. So let's talk now very quickly about kind of the somewhat of all of this. Well, it's pretty simple. That retail traders really like lottery-like assets, which is a bummer, but it's to no surprise, there's a reason why the lottery makes so much money. And zero DTE options enable that. And right now retail traders, again, in aggregate essentially lose 358,000 a day on zero DTE SP 500 options. That's awful. This is the most disturbing part. Our findings indicate that more than 60 of the lost each day comes in the form of transaction costs. Easier enemy. I think that we have that point down. So let's talk about what I do. The very first thing",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 18,
      "start_timestamp": "00:22:40",
      "start_timestamp_seconds": 1360.177777777778,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=1360"
    }
  },
  {
    "text": "500 options. That's awful. This is the most disturbing part. Our findings indicate that more than 60 of the lost each day comes in the form of transaction costs. Easier enemy. I think that we have that point down. So let's talk about what I do. The very first thing is now that we understand the fight that we're fighting, we now understand that we need to be very careful of costs, and we need to construct strategies that enable us to do that. So what does that mean? Well, if you like to trade spreads, which I don't, especially in this context, if you're trading iron condors and verticals and zero DTE stuff, you are literally getting chute alive. So I typically prefer simple single options, whether it's short calls, short puts, short straddles, short strangles, it's typically going to be short straddles. And notice how I emphasize short on all of those, I tend to sell. And the reason why I tend to sell is because there is a delta range that is really beneficial to sell, especially in short term time frames, because of this, the IV HV variance is very large and it needs to approximate. So if you are trading in a period where the variance between implied and short volatility is very high, you start to stack the deck in your favor. And again, that video I linked to before will go through this in more detail. But this is really important because notice",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 18,
      "start_timestamp": "00:24:17",
      "start_timestamp_seconds": 1457.3333333333335,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=1457"
    }
  },
  {
    "text": "So if you are trading in a period where the variance between implied and short volatility is very high, you start to stack the deck in your favor. And again, that video I linked to before will go through this in more detail. But this is really important because notice how I didn't say when implied volatility percentile is high or when implied volatility is high or when implied volatility rank is high. It's because that's not the period that actually matters. What we're trying to capture is the variance risk premium in this scenario. And that is when IV is overstated compared to HV that can happen when implied volatility percentile is high, when it's low, what we want to avoid is when it's in a transition period. That's bad. So this is when we really try to benefit from the clustering properties of volatility. So the other thing here is limit frequency. This isn't my go to, I trade and I actually traded it this week on the Fed rate announcement. I traded zero DTE options. That's because there's a clear catalyst things like Fed announcements, things like earning statements, earnings releases. Those are all great catalysts that really give us a bigger kind of piece of the pie that we potentially can chew off. And then the other scenarios when there's a large IV HV variance because again, I'm going to tend to sell and that's what I want to see. Notice how there's only really two",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 18,
      "start_timestamp": "00:25:54",
      "start_timestamp_seconds": 1554.488888888889,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=1554"
    }
  },
  {
    "text": "really give us a bigger kind of piece of the pie that we potentially can chew off. And then the other scenarios when there's a large IV HV variance because again, I'm going to tend to sell and that's what I want to see. Notice how there's only really two conditions here. This isn't because I think I can make money faster. I don't. This isn't because I'm scared of overnight risk. I'm not. This is really the two scenarios where this makes sense for me to integrate into my overall approach. So if this video is helpful, don't forget to comment below what you found useful. Like, subscribe, be an outlier, share with some friends, and I'll catch you guys later.",
    "metadata": {
      "video_id": "e7RklZt2PjE",
      "title": "Master 0DTE Options",
      "url": "https://www.youtube.com/watch?v=e7RklZt2PjE",
      "upload_date": "",
      "duration": 1043.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 18,
      "start_timestamp": "00:27:31",
      "start_timestamp_seconds": 1651.6444444444446,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=e7RklZt2PjE&t=1651"
    }
  }
]