[
  {
    "text": "what's up all quick market update we're going to talk about the market as a whole super fast then I want to talk about djt and then I want to talk about GameStop because we had some news pop today that's actually pretty cool so from a broad Market perspective we saw a little bit of downturn today the interesting part about this downturn is that it's mixed within the sectors from within the SP 500 this simply means that it's not like this Universal broad scale selloff because we can see things like xlc XLF xli all hit highs today so there are sectors within the SP 500 that actually are still hitting highs even though we saw a bit of a rotation over so what really led to that rotation over because if we take a look at xly XLV xlu all of those were up slightly on the day XL re was up on the day xlp was up on the day so was xlb so if you look at it most of the sectors were up generally on the day we have XLF and xli which were red on the day but both still gapped up and started much higher so this is the problem Tech we saw xlk had a pretty significant down day today so technology continues to be a bit of a pain now taking a quick look at just the heat map again you can see an elements of what I'm talking",
    "metadata": {
      "video_id": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "title": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "url": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 0,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?&t=0"
    }
  },
  {
    "text": "and started much higher so this is the problem Tech we saw xlk had a pretty significant down day today so technology continues to be a bit of a pain now taking a quick look at just the heat map again you can see an elements of what I'm talking about in terms of what's doing well what's not energy in and of itself is generally red we're not seeing like massive sell-offs but definitely downside pressure and Consumer Staples looks like it's performing well well financials performing well Schwab had a pretty big gap up today even though it was red on the day it still very much is up so overall we're getting into earnings and the market looks quite mixed so if we take a look at City group and Goldman Sachs from yesterday they both performed well with respect to EPS versus estimates versus actual and then today we saw a continuation of that so PNC BAC even Schwab Schwab had a really interesting move if we pull up schw we can see again had a a pretty big gap up but then ended down on the day so from a broad Market perspective all this means keep risk front of mind we are not in this really calm persistent bull market we are hovering near highs here and people start to get really jittery and Things become slightly tenuous if we take a look at vix on a 6-month time frame we can see that",
    "metadata": {
      "video_id": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "title": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "url": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 1,
      "total_chunks": 13,
      "start_timestamp": "00:00:59",
      "start_timestamp_seconds": 59.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?&t=59"
    }
  },
  {
    "text": "means keep risk front of mind we are not in this really calm persistent bull market we are hovering near highs here and people start to get really jittery and Things become slightly tenuous if we take a look at vix on a 6-month time frame we can see that the average price is about what is this 1951 relatively high if I look at this on a 5-year weekly time frame which does include 2020 the average in this is like 1515 so what I'm flagging for you it's a little higher actually I'm sorry it's like 16 and a quarter I was using the point of control like yeah maybe 16 what I'm flagging for you is volatility is expanding at this point even though we're hovering at all-time highs that kind of Divergence is something to be aware of okay cool now let's take a peek at djt really quick because we came across some interesting stuff yesterday during the live stream that I want to highlight for everybody and djt has been essentially this big proxy for Donald Trump potentially winning the election and if we take a look at the prediction markets as it sits it does look like that's right now the favorite outcome so I'll grab poly markets for us and we literally can look at it together so here's poly market and if we take a look at the presidential election we can see that the winner right now and this actually",
    "metadata": {
      "video_id": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "title": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "url": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 2,
      "total_chunks": 13,
      "start_timestamp": "00:02:07",
      "start_timestamp_seconds": 127.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?&t=127"
    }
  },
  {
    "text": "it does look like that's right now the favorite outcome so I'll grab poly markets for us and we literally can look at it together so here's poly market and if we take a look at the presidential election we can see that the winner right now and this actually went up over yesterday so their pricing winner is Trump 57 a half Cala is 42.1 is the winner so the reason why I use prediction markets for this is because prediction markets aren't Laden with different political bias like prediction markets don't care necessarily who wins we're just trying to be able to price it as efficiently as possible and then to trade it that's a Trader's mindset you should like whoever you like that's cool I still want to try to make money on the event itself so that's why this is actually a really really great tool to forecast probability of thing probabilities of things because really smart people that are trying to make a lot of money are going to be here and you can see there's 570 million in here so well that's just on the Trump side by the way so the market here is liquid there's definitely people participating you can see up here it's 1.9 billion to total volume in this so lots and lots of people interested in the outcome so that takes us back then to djt being this proxy for Trump winning the election now it contracted massively today",
    "metadata": {
      "video_id": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "title": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "url": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 3,
      "total_chunks": 13,
      "start_timestamp": "00:03:16",
      "start_timestamp_seconds": 196.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?&t=196"
    }
  },
  {
    "text": "is liquid there's definitely people participating you can see up here it's 1.9 billion to total volume in this so lots and lots of people interested in the outcome so that takes us back then to djt being this proxy for Trump winning the election now it contracted massively today who knows this is essentially a meme stock at this point this will EB and flow as its popularity es and flows but what I can say is it's made a move from 11 and 34 and it almost hit 35 I mean we're not that far off from 35 here so people are playing this for the general movement now if we take a peek at the options chain we can see a few things that it's kind of a even split calls and puts we can see 421,000 calls against 445k puts and you can see that the Lion Share of these bigger positions are 15 no which is obviously following the election so if we limit this by the election expiration you can see that it's 158 versus 153,000 for both um calls and puts respectively so yeah people are speculating here here lots of people are selling calls as we can tell 25 of the volume today was calls being transacted at the bid or below typically a sale so this is overall just an interesting thing to follow along and if we grab unusual whales really quick we'll take a look at just the options",
    "metadata": {
      "video_id": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "title": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "url": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 4,
      "total_chunks": 13,
      "start_timestamp": "00:04:25",
      "start_timestamp_seconds": 265.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?&t=265"
    }
  },
  {
    "text": "selling calls as we can tell 25 of the volume today was calls being transacted at the bid or below typically a sale so this is overall just an interesting thing to follow along and if we grab unusual whales really quick we'll take a look at just the options volume in here to give you a sense of how that's been going on a recent basis so what I'm going to do is flag month to date which is today's the 15th so let's let's see what kind of Trades we have coming in so there's one really big trade 935,000 in the 15 nove 24 21 calls so these would have been up quite a lot yesterday uh I don't know where they're at today but this person obviously this looks like a speculative play to the upside and we can see elements of that both to the upside to the downside and we can see that this option chain has gotten really active in the last month or so so that is djt it's exhibiting pretty significant volatility implied volatility percentile is literally at 100 pegged up and it's at 33.6 IV super super high now over to GameStop we can see that it had a little bit of an inside day it was down just about a quarter point but there was some cool news now I am not going to pretend to know much about any of this because I don't but it's cool to",
    "metadata": {
      "video_id": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "title": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "url": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 5,
      "total_chunks": 13,
      "start_timestamp": "00:05:30",
      "start_timestamp_seconds": 330.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?&t=330"
    }
  },
  {
    "text": "to GameStop we can see that it had a little bit of an inside day it was down just about a quarter point but there was some cool news now I am not going to pretend to know much about any of this because I don't but it's cool to see some activity and for anybody looking to understand what this means more the only person I could think of that would be the guy to talk to is Richard Newton so go check out his YouTube channel for sure because I'm positive I haven't looked but I'm positive he's going to be talking about this and he knows a lot about Collectibles cards and stuff like that I do not so anyways though this does look cool where we can see that there's a collaboration that's started between GameStop and PSA and you can see that it's going to become an authorized PSA dealer and PSA will provide grading servic for trading cards through select GameStop stores so this doesn't look like massive news but it looks like some sort of activity which is what people are trying to see we're trying to see what the future looks like for gametop based on different pieces of trickled out information like this that gives some insights into what the future is going to look like because it's been very quiet we do know that they're sitting on quite literally billions in cash so they have tons of money to do",
    "metadata": {
      "video_id": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "title": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "url": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 6,
      "total_chunks": 13,
      "start_timestamp": "00:06:42",
      "start_timestamp_seconds": 402.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?&t=402"
    }
  },
  {
    "text": "for gametop based on different pieces of trickled out information like this that gives some insights into what the future is going to look like because it's been very quiet we do know that they're sitting on quite literally billions in cash so they have tons of money to do things and what the structure of this deal is going to look like I'm not sure yet I haven't seen a lot of detail on it but you can see that GameStop is now starting to make a little bit of action and that's awesome to see so I'm keeping an eye on the news to see if there's any you know really big takeaways from it I haven't seen anything that pops out to me yet and just from a market perspective I haven't really seen a a really significant change in price so typically if this is like a massive announcement you would see price start flying all over the place but this this Pikachu looks really cool I can't read any of that I'll be completely honest and I also have to be honest this Pikachu looks a little chubby we might need to get Pikachu some salad but I do like Pikachu maybe he's getting bulked up maybe it's because we're rolling into fall season thus winter bulking season trying to get massive for then the summer cut I would accept that as an answer but who knows so yeah I am really really interested to",
    "metadata": {
      "video_id": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "title": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "url": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 7,
      "total_chunks": 13,
      "start_timestamp": "00:07:43",
      "start_timestamp_seconds": 463.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?&t=463"
    }
  },
  {
    "text": "salad but I do like Pikachu maybe he's getting bulked up maybe it's because we're rolling into fall season thus winter bulking season trying to get massive for then the summer cut I would accept that as an answer but who knows so yeah I am really really interested to see what this grows into it wouldn't be overly surprising to see some sort of different card offerings they I'm sure GameStop could start their own if they were so inclined and people chew it up kind of like what we've seen somebody like Trump do with his collectible cards the fact that people are buying those astonishing to me but people really like the stuff that they like so I could see that being a future Direction I have no idea which way it's going to go and the other thing is I honestly have absolutely no idea if this is what what this means in terms of price you guys will have to tell me in the comments is this expensive is this not expensive I've never done this so I have no reference for how impactful this is but it does look like an an interesting thing and it gives the stores a physical purpose now because again like peripherals and stuff like you can argue there a physical purpose for sure but they can still be shipped and a lot of this stuff could be shipped but there's actually a lot more risk in shipping your",
    "metadata": {
      "video_id": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "title": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "url": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 8,
      "total_chunks": 13,
      "start_timestamp": "00:08:50",
      "start_timestamp_seconds": 530.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?&t=530"
    }
  },
  {
    "text": "and it gives the stores a physical purpose now because again like peripherals and stuff like you can argue there a physical purpose for sure but they can still be shipped and a lot of this stuff could be shipped but there's actually a lot more risk in shipping your precious card that's collectible I would be really nervous to ship something like that around so this is actually kind of cool to me that you can find more of these locally that PSI PSA is pretty widely accepted and you can go walk in and have them evaluated again I don't know if this is expensive or not but to me 20 bucks a card seems a little steep especially if the card is you know comes out to not be worth a whole lot but my guess is they probably have some sort of effective way to make this palatable for people to go get their cards looked at but you guys will have to let me know more about it from an options perspective GameStop has been relatively quiet so let me grab the options chain and I'm going to look at I don't care about the sales here I want to look at um transactions for calls people accumulating so there was was a pretty big trade yesterday for 500 of the 10 calls but these are out in 2026 2025 for the next biggest so these are people building out longer term positions which again",
    "metadata": {
      "video_id": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "title": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "url": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 9,
      "total_chunks": 13,
      "start_timestamp": "00:09:53",
      "start_timestamp_seconds": 593.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?&t=593"
    }
  },
  {
    "text": "sales here I want to look at um transactions for calls people accumulating so there was was a pretty big trade yesterday for 500 of the 10 calls but these are out in 2026 2025 for the next biggest so these are people building out longer term positions which again that's a little more um overall price accumulation style play versus this really near-term focus that we tend to see in GameStop options so if we take a look at the trade tab for GameStop and we look across open interest for everything still a ton of calls 712 713 th000 against 290k on the put side and if we take a look at what concentration of those is in the front expiration 338,000 half so there's still just this massive massive exposure to front expirations which I cannot help but find that to be so curious because um for those that don't know on Saturday I've been doing a live stream looking at all of roaring Kitty old trades and I'm grabbing the workbook right now so that I can show you because this activity of playing this front expiration so heavy is so interesting to me because for the people that are trying to emulate what the cat did that's really not what he's done so if we take a look at his options plays what I started to do is actually build out a view over here that shows me the nearest expiration for all of these",
    "metadata": {
      "video_id": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "title": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "url": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 10,
      "total_chunks": 13,
      "start_timestamp": "00:10:51",
      "start_timestamp_seconds": 651.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?&t=651"
    }
  },
  {
    "text": "the people that are trying to emulate what the cat did that's really not what he's done so if we take a look at his options plays what I started to do is actually build out a view over here that shows me the nearest expiration for all of these different options plays that he's made again this is now literally going back to the very beginning the very first post that he made and we're still working through the 2024 stuff what I want to highlight from what I've seen so far is he did a 3 DTE trade one time and that was around an earnings event so this was a event driven near-term play and he ended up essentially having that option expire worthless so I just bring that to people's attention because as I go through the rest of all these different trades that I've seen him made you can see 94 DTE these are 107 DTE these are 52 DTE he first put these on at 495 DTE so a lot of these trades that he's building even later into the time here like this one 137 DTE he's building things with pretty longterm expirations that's playing the value up which again I just find it slightly interesting when I look at how most people are playing GameStop here which is playing it like all the front week which is just a way to light money on fire and for a smarter way to buy",
    "metadata": {
      "video_id": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "title": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "url": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 11,
      "total_chunks": 13,
      "start_timestamp": "00:12:13",
      "start_timestamp_seconds": 733.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?&t=733"
    }
  },
  {
    "text": "that's playing the value up which again I just find it slightly interesting when I look at how most people are playing GameStop here which is playing it like all the front week which is just a way to light money on fire and for a smarter way to buy options I'll link to a video below it's literally just to give you other ideas on how to potentially play this versus just buying super cheap far out of the money options and hoping something happens as always if you need anything let me know be an outlier see you later",
    "metadata": {
      "video_id": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "title": "Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "url": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 12,
      "total_chunks": 13,
      "start_timestamp": "00:13:19",
      "start_timestamp_seconds": 799.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Earnings_Reports,_DJT_Move,_&_GME’s_Next_Big_Shift_|_What’s_Driving_the_Stock_Market_Today?&t=799"
    }
  }
]