[
  {
    "text": "Option volatility, it's super straight forward. There's really no need for a video on it because you already know the difference between implied realized, future realized, forecast, historic altilities. That all makes sense to you. Am I right? You're anything like me when I first started out trading that all probably sounds like a bunch of nothing. So the goal of this video is to walk through all of those to give you at least a surface level understanding of these different kinds of volatility because they are different things so that you understand how this all fits into options markets. What's up everybody? Eric here. Welcome back to all the outliers and shout outs of the Patreon family. You guys make content like this possible. If what I do helps you out, consider signing up. Let's get started. So we have option volatility. What is volatility? Well, really it's just a fancy term for deviation or dispersion. What does this mean? Simple. If you take a look at this chart of Microsoft, you see these linear regression channels. I have a video on those actually I'll throw in the notes below, but this middle line here is kind of like a line of best fit for all of the data on this chart. So when we move up above or down below, that's dispersion from whatever this mean is. So that's what we're talking about. The variance of something. And in this case in trading, we're specifically referring to",
    "metadata": {
      "video_id": "efWEgEzrBAI",
      "title": "Option Volatility Explained | What is IV Rank (IVR) and IV Percentile (IVP)?",
      "url": "https://www.youtube.com/watch?v=efWEgEzrBAI",
      "upload_date": "",
      "duration": 616.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=efWEgEzrBAI&t=0"
    }
  },
  {
    "text": "like a line of best fit for all of the data on this chart. So when we move up above or down below, that's dispersion from whatever this mean is. So that's what we're talking about. The variance of something. And in this case in trading, we're specifically referring to different securities. So let's talk about the common types of volatility. There is implied historic realized future realized and forecast. We're going to go through all of these quickly so that you have a working understanding of these. And then at the end of the video, I'm going to walk you through some of the common scales for implied volatility because if you're an obfuscist trader, that will be important to you to understand the difference between implied volatility rank and implied volatility percentile because they're not the same thing. So let's start with implied volatility. In short, this is expected volatility for various time frames that we infer from an options price. So because I was looking at Microsoft before, we're going to keep looking at Microsoft. And we can figure out what the implied volatility is for every single one of these options. That's what this column is here for the put side and this column here for the call side. The reason why this matters is because if you think about trading options, they have two different pieces to their premium. They have intrinsic and extrinsic value. Implied volatility lives in the extrinsic value, the time value",
    "metadata": {
      "video_id": "efWEgEzrBAI",
      "title": "Option Volatility Explained | What is IV Rank (IVR) and IV Percentile (IVP)?",
      "url": "https://www.youtube.com/watch?v=efWEgEzrBAI",
      "upload_date": "",
      "duration": 616.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:01:32",
      "start_timestamp_seconds": 92.3111111111111,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=efWEgEzrBAI&t=92"
    }
  },
  {
    "text": "here for the put side and this column here for the call side. The reason why this matters is because if you think about trading options, they have two different pieces to their premium. They have intrinsic and extrinsic value. Implied volatility lives in the extrinsic value, the time value of an option. So we can isolate what the implied volatility is per strike. We can look at the implied volatility per expiration cycle. So for example, again, looking at Microsoft, the 15 December expiration cycle, the implied volatility there is a 21.25 percent that infers a 12.96 expected move within one standard deviation. That's all this is. So it is the expected movement of something. So implied volatility has a lot of uses to us. Now what is historic volatility? It measures the realize volatility for a specific period. So if we go back here and we look at Microsoft and we look at something like this, this little handy dandy volatility thingscript that I use and kind of modify it quite a bit over time. But if you notice there is hv2 hv5 hv21, this is historic volatility for different time frames. So you can isolate what the volatility was for specific time frames. Now realize volatility in can be a couple things. When we're talking about realize volatility in general parlance in general speak, it is the volatility that's realized in the underlying. It's also known as the statistical volatility. A lot of times these two will",
    "metadata": {
      "video_id": "efWEgEzrBAI",
      "title": "Option Volatility Explained | What is IV Rank (IVR) and IV Percentile (IVP)?",
      "url": "https://www.youtube.com/watch?v=efWEgEzrBAI",
      "upload_date": "",
      "duration": 616.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:03:04",
      "start_timestamp_seconds": 184.6222222222222,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=efWEgEzrBAI&t=184"
    }
  },
  {
    "text": "volatility was for specific time frames. Now realize volatility in can be a couple things. When we're talking about realize volatility in general parlance in general speak, it is the volatility that's realized in the underlying. It's also known as the statistical volatility. A lot of times these two will be used interchangeably and that's okay as long as we understand that realize volatility can also be future realized volatility. What the hell is that? Well, this is the realized prediction of future vol and this is different than forecast volatility, which is the prediction of future volatility. So think of it this way, we can forecast volatility if you have an implied volatility surface and you're a sophisticated trader, you create your own assessment of volatility of just forecast volatility. Most options traders, especially on the retail side, we are dealing with implied volatility. This is volatility that is derived from the options price. So the smart people in the market are looking at their forecasted volatility and then us retail traders are looking at what's implied via the pricing of an option. Then you can assess future realized volatility, which tells us how accurate the prediction was of fall. Makes sense? Good. Great. Let's now talk about some implied volatility scales. The reason why this matters is if we take a look at Microsoft here and we look at the current implied volatility, which is 21, 21.29, is that higher low? You can't really tell because if there's",
    "metadata": {
      "video_id": "efWEgEzrBAI",
      "title": "Option Volatility Explained | What is IV Rank (IVR) and IV Percentile (IVP)?",
      "url": "https://www.youtube.com/watch?v=efWEgEzrBAI",
      "upload_date": "",
      "duration": 616.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:04:36",
      "start_timestamp_seconds": 276.9333333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=efWEgEzrBAI&t=276"
    }
  },
  {
    "text": "fall. Makes sense? Good. Great. Let's now talk about some implied volatility scales. The reason why this matters is if we take a look at Microsoft here and we look at the current implied volatility, which is 21, 21.29, is that higher low? You can't really tell because if there's nothing to compare it against, you can have things that have 130 implied volatility that's actually not very high relative to what that specific products implied volatility typically is. Again, if you think about volatility as the dispersion of things, if we look at the implied volatility for Microsoft, it's 21.29. And then if you look at it for Tesla, it's 49. So we expect Tesla to be a little bit more volatile than Microsoft. But when we look at this 49 is this high relative for Tesla, well, this is exactly why we need things like IV rank and IV percentile. Now there's a big difference between these two. And in my opinion, IV percentile is a much better metric that is less prone to skew. Why is that? Well, let's take a look at how implied volatility rank is calculated. We have the current IV. We subtract the 52 week IV low. Then we divide that by the 52 week IV high less the 52 week IV low. So what you'll notice is we're using the extremes. We're using the high. We're using the low. Now in typical markets, the difference between IV rank and IV percentile is",
    "metadata": {
      "video_id": "efWEgEzrBAI",
      "title": "Option Volatility Explained | What is IV Rank (IVR) and IV Percentile (IVP)?",
      "url": "https://www.youtube.com/watch?v=efWEgEzrBAI",
      "upload_date": "",
      "duration": 616.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:06:09",
      "start_timestamp_seconds": 369.2444444444444,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=efWEgEzrBAI&t=369"
    }
  },
  {
    "text": "52 week IV low. Then we divide that by the 52 week IV high less the 52 week IV low. So what you'll notice is we're using the extremes. We're using the high. We're using the low. Now in typical markets, the difference between IV rank and IV percentile is not that crazy. However, when we are in more extreme markets, this can be massively different, which I'll show you in just a second. But before that, let's take a look at what IV percentile is. Instead of using the extremes, we take account of trading days that are below the current IV. Then we divide that by the number of trading days. So typically you use something like 252. So this is just looking at a pure tally. It doesn't really care what the extremes were, what it cares is where we are relative to its previous performance. Now, a fun fact. This is from think or swim. And the current IV percentile here actually is IV rank. This is completely wrong. And you'll see that in just a second because I want you to do the math for both of these. Why do we why do we have to go through this every time? This one's a little more difficult. You kind of can do the math on your own. I have a think script for it. But I do want you to do the math for the IV rank for this. And then throw it in the",
    "metadata": {
      "video_id": "efWEgEzrBAI",
      "title": "Option Volatility Explained | What is IV Rank (IVR) and IV Percentile (IVP)?",
      "url": "https://www.youtube.com/watch?v=efWEgEzrBAI",
      "upload_date": "",
      "duration": 616.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:07:41",
      "start_timestamp_seconds": 461.55555555555554,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=efWEgEzrBAI&t=461"
    }
  },
  {
    "text": "to go through this every time? This one's a little more difficult. You kind of can do the math on your own. I have a think script for it. But I do want you to do the math for the IV rank for this. And then throw it in the comments below what you got before I click on to see if you are correct. Now, you'll see that if we do the math on this, the IV rank for this scenario, the current IV is 19.38. So that's this here. Then we're going to take the 52 week IV low, which is from here 0.177. Then we're going to divide that by the 52 week IV high, which is 0.442 less 52 week IV low again 0.177. And you're going to get 6.3. Notice that this happens to be the same in this scenario. So what am I referring to then when we're talking about them being quite different? Simple. In this example, the IV percentile currently for this product, which was Apple is 5. So if this is actually IV percentile, this should be 5, not 6. But this is actually IV rank. Now, this doesn't seem like that big of a difference because it's not. The market has been relatively consolidated for periods of time now. However, if you look at old performance, this is an OG video of Eric. Check that out. Some Eric conception. This was during COVID. And I don't remember what product I",
    "metadata": {
      "video_id": "efWEgEzrBAI",
      "title": "Option Volatility Explained | What is IV Rank (IVR) and IV Percentile (IVP)?",
      "url": "https://www.youtube.com/watch?v=efWEgEzrBAI",
      "upload_date": "",
      "duration": 616.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:09:13",
      "start_timestamp_seconds": 553.8666666666666,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=efWEgEzrBAI&t=553"
    }
  },
  {
    "text": "that big of a difference because it's not. The market has been relatively consolidated for periods of time now. However, if you look at old performance, this is an OG video of Eric. Check that out. Some Eric conception. This was during COVID. And I don't remember what product I was looking at here. But the important part is if you look at the IV rank in this scenario, whatever it was, it was 30.26. However, IV percentile was 66. So during COVID, when there's a lot of volatility, this is literally two times. That's a massive difference. When we're looking at things now, it's not that big of a difference because things are relatively low. So you're not going to see that big of a skew. But it's important for you to know that IV rank is much more skew prone than IV percentile. You are going to get a better assessment of IV's performance against itself in an individual product via percentile versus IV rank. That is the long and short of it. So as always, if you have any questions, hit me up. Let me know. Make sure you hit up think or swim. Let them know that they're wrong. I've let them know this a million times. They don't change it. But who knows? Maybe Schwab will get it together and fix it for us. But otherwise, you should know that that is not IV percentile. That's rank and it is prone to skew. If there's",
    "metadata": {
      "video_id": "efWEgEzrBAI",
      "title": "Option Volatility Explained | What is IV Rank (IVR) and IV Percentile (IVP)?",
      "url": "https://www.youtube.com/watch?v=efWEgEzrBAI",
      "upload_date": "",
      "duration": 616.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:10:46",
      "start_timestamp_seconds": 646.1777777777778,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=efWEgEzrBAI&t=646"
    }
  },
  {
    "text": "that they're wrong. I've let them know this a million times. They don't change it. But who knows? Maybe Schwab will get it together and fix it for us. But otherwise, you should know that that is not IV percentile. That's rank and it is prone to skew. If there's anything I missed, throw it in the comments below. Don't forget like, subscribe, share, be an outlier. It's the only way to be. Catch you all later.",
    "metadata": {
      "video_id": "efWEgEzrBAI",
      "title": "Option Volatility Explained | What is IV Rank (IVR) and IV Percentile (IVP)?",
      "url": "https://www.youtube.com/watch?v=efWEgEzrBAI",
      "upload_date": "",
      "duration": 616.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:12:18",
      "start_timestamp_seconds": 738.4888888888888,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=efWEgEzrBAI&t=738"
    }
  }
]