[
  {
    "text": "This is the side of trading that all those fake ass influencers, fake influencers don't want you to see. I want to walk you through some very specific habits that I adopted in my early trading career back in 2007 that led to a massive change in my outcome. For those that don't know, I grew up in an area with two and a half times the national rate of violent crime. Fun fact, I actually got stabbed in my hand while in high school between classes. The reason why I bring that up is not for a sob story. I'm proud of my background. It shaped who I am today. However, it wasn't really that advantageous for making a bunch of money. So when I was looking at starting trading, it was very focused on changing my circumstance. It was more than just making money so I can buy a nice t-shirt or some shit. I was really focused on changing what my lot in life was going to look like. So I want to walk you through those habits right now. What's up everybody? Eric here. Welcome back to all the outliers and shout out to the Patreon family. If what I do helps you out, consider signing up in the notes below. All right, let's take a look at some foundational information. On the left hand side, these are just some recent news articles about my Alma Mater high school NFA. And I walk through metal detectors",
    "metadata": {
      "video_id": "eHurZBXO5ck",
      "title": "How to Stop Losing Money Trading Options",
      "url": "https://www.youtube.com/watch?v=eHurZBXO5ck",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eHurZBXO5ck&t=0"
    }
  },
  {
    "text": "family. If what I do helps you out, consider signing up in the notes below. All right, let's take a look at some foundational information. On the left hand side, these are just some recent news articles about my Alma Mater high school NFA. And I walk through metal detectors every single day. And there's a ton of violence there. It was what it was. However, I went from that to this where I was interviewed and business insider to talk about how I went about making a bunch of money in my 20s so that by my late 20s I was already a millionaire and then in my early 30s, 32 now, I'm just snowballing it. How did all of this happen? I want to walk you through the exact habits that I've deployed. The first one. Understanding the challenge. What does this mean? I talk about it all the time, but I reiterate it because it's probably one of the most important points on here. Trading is hard and not easy money. The reason why this is so important because when most of us start this, we start with the exact opposite mindset that it's a way to make fast money. It probably is more apropos to say this is a really fast way to lose your money as compared to make it. And I have a couple things I want to show you on that point specifically. On my website, I have a bunch of studies that",
    "metadata": {
      "video_id": "eHurZBXO5ck",
      "title": "How to Stop Losing Money Trading Options",
      "url": "https://www.youtube.com/watch?v=eHurZBXO5ck",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 12,
      "start_timestamp": "00:00:55",
      "start_timestamp_seconds": 55.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eHurZBXO5ck&t=55"
    }
  },
  {
    "text": "make fast money. It probably is more apropos to say this is a really fast way to lose your money as compared to make it. And I have a couple things I want to show you on that point specifically. On my website, I have a bunch of studies that I listed out because I think these are good references. That's why I'm starting to build out some of the references on my website, things that I commonly cite so that you can find them. And people throw out statistics all the time that they don't look up because they're lazy, but I actually do. And when we look at this first side over here, seven percent of traders remain in the markets after five years. So that means 93 quit within five years. Why am I saying all of this to you if I'm on a trading channel trying to help people trade? Well, in order to figure out how to do this successfully, it's important we understand the landscape. Now, a couple notes. You have to be really thoughtful about your reference benchmark because a lot of these 93 that quit, they're lazy. They don't care. They're not putting an effort. So that doesn't necessarily detract me. What I mean by that is I still see a chance because I know the majority of these people are average-ass people doing average-ass things and like this quitting. So I understand even though the most quit, there's a smaller subset",
    "metadata": {
      "video_id": "eHurZBXO5ck",
      "title": "How to Stop Losing Money Trading Options",
      "url": "https://www.youtube.com/watch?v=eHurZBXO5ck",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 12,
      "start_timestamp": "00:01:48",
      "start_timestamp_seconds": 108.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eHurZBXO5ck&t=108"
    }
  },
  {
    "text": "putting an effort. So that doesn't necessarily detract me. What I mean by that is I still see a chance because I know the majority of these people are average-ass people doing average-ass things and like this quitting. So I understand even though the most quit, there's a smaller subset in there that are probably trying and still failing. So it tells me that this is something that's possible, but probably pretty difficult. So what does this mean? It means that we have to shift our focus from how much money we're going to make. Getting enough money so that we could buy a nice car and we need to shift our focus from the outcome that we want and really emphasize the process we are going to leverage to get there because I cannot tell you how frequently I see traders say things like, oh, do you think it's possible to make 20 per year? I don't know for you. I know for me it's possible, but I also know the amount of effort I've put into doing this. Have you done that? So it's impossible for me to rationally say what is possible for you. You might be able to blow my returns out of the water which would be awesome. The fact of the matter is you have to figure out how to get yourself through this process. And the sooner you accept the fact that the only thing you can control in the markets is yourself",
    "metadata": {
      "video_id": "eHurZBXO5ck",
      "title": "How to Stop Losing Money Trading Options",
      "url": "https://www.youtube.com/watch?v=eHurZBXO5ck",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 12,
      "start_timestamp": "00:02:47",
      "start_timestamp_seconds": 167.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eHurZBXO5ck&t=167"
    }
  },
  {
    "text": "able to blow my returns out of the water which would be awesome. The fact of the matter is you have to figure out how to get yourself through this process. And the sooner you accept the fact that the only thing you can control in the markets is yourself and taking complete ownership of all of your interactions with the markets, this is the direct step you can take to start affecting your outcomes in a positive way. I have a thing on my website again that walks through some of the things I think new traders should be focusing on as it pertains to this concept of a process. Rufles accountability has got to be there. There can be no excuses. You are the boss. There's nobody that's looking over your shoulder. Maybe if somebody a partner that wants to know how you're doing in your wife cares if you lose it all the money, that's actually good. That's a forcing function. Again, the average person requires external forcing functions to do the right things that doesn't work in trading. If you need somebody to tell you what to do, when to do it, how to do it, to do it well, to go into detail, to do the hard things, this is not going to be for you. Because you are the only person that holds yourself accountable. So unless you have astronomically high standards, which you should, you're probably going to accept a lesser output, which",
    "metadata": {
      "video_id": "eHurZBXO5ck",
      "title": "How to Stop Losing Money Trading Options",
      "url": "https://www.youtube.com/watch?v=eHurZBXO5ck",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 12,
      "start_timestamp": "00:03:54",
      "start_timestamp_seconds": 234.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eHurZBXO5ck&t=234"
    }
  },
  {
    "text": "to do it well, to go into detail, to do the hard things, this is not going to be for you. Because you are the only person that holds yourself accountable. So unless you have astronomically high standards, which you should, you're probably going to accept a lesser output, which doesn't both well in trading. How do we do this? Simple. Tracking. This is the ultimate way we can objectively review our performance. I can't tell you how many times traders that I talk to you, they say, oh, I think I'm doing well, or I don't think I lost that much, but they don't know. They don't even look. And it's because their ego doesn't want to be confronted with the reality that they might suck at this and that the thing that they've been doing for five years might not be working as well as they think it might, and they don't want to address it. The sooner you throw that out and you abolish your ego and you instead value truth, the sooner you can hold yourself to the correct standard and start doing the things to get you closer to you objective as compared to hiding like a fucking ostrich, which are head in the sand, which gets you exactly nowhere. Okay, I think we got that point done. The easy route doesn't exist. That is just a fact of trading. So on Reddit, which I love checking out because it's a great way to see",
    "metadata": {
      "video_id": "eHurZBXO5ck",
      "title": "How to Stop Losing Money Trading Options",
      "url": "https://www.youtube.com/watch?v=eHurZBXO5ck",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 12,
      "start_timestamp": "00:04:58",
      "start_timestamp_seconds": 298.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eHurZBXO5ck&t=298"
    }
  },
  {
    "text": "like a fucking ostrich, which are head in the sand, which gets you exactly nowhere. Okay, I think we got that point done. The easy route doesn't exist. That is just a fact of trading. So on Reddit, which I love checking out because it's a great way to see how people think about this stuff. Somebody says this was in a post that I was responding to, but the person said, I don't understand how people are continually trading and yet don't expect to earn a basic amount like 5 a month, basic amount. This might be possible for somebody. The only person that can figure that out is you. What are you capable of producing? I can tell you up until this point, I've never even exceeded this. This will be my first year trading that I beat 60. This is the first one I've been doing this for 16 coming on 17 years now. Again, that's what I'm capable of. Somebody else might be capable of more, but what I can tell you objectively is that the sooner you accept the fact that for me to achieve my returns, I've spent somewhere in the ballpark of 34,000 hours on this stuff. Easy is not in the conversation here. There is so much information out there that unless you take some sort of approach to funneling down what you're focusing on, there is a extreme chance that you are going to be bouncing all over the place, not",
    "metadata": {
      "video_id": "eHurZBXO5ck",
      "title": "How to Stop Losing Money Trading Options",
      "url": "https://www.youtube.com/watch?v=eHurZBXO5ck",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 12,
      "start_timestamp": "00:06:09",
      "start_timestamp_seconds": 369.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eHurZBXO5ck&t=369"
    }
  },
  {
    "text": "hours on this stuff. Easy is not in the conversation here. There is so much information out there that unless you take some sort of approach to funneling down what you're focusing on, there is a extreme chance that you are going to be bouncing all over the place, not really absorbing much. So we'll get to this a little bit later, but I cannot overemphasize enough how important it is to create a learning plan so that you are moving in the right direction efficiently and not looking at whether or not you should use 1226 or 1227 on your MACD indicator. Discipline is what underpins all of this. If you are not a disciplined human being, this is not for you. Again, you have to hold yourself accountable. You have to be the person that forces yourself to do the hard things to violate what your ego would prefer and to spend a lot of time doing this. Most people do not have that level of discipline. And trading is kind of an anomaly because discipline in and of itself will not make you successful. You still have to find an edge, but discipline is what will likely be the tool that forces you to fill out your trading log. That forces you to review the results so that you can see even though you think you might be doing well, that you're actually not and that you have to make some adjustments. Discipline is what puts this",
    "metadata": {
      "video_id": "eHurZBXO5ck",
      "title": "How to Stop Losing Money Trading Options",
      "url": "https://www.youtube.com/watch?v=eHurZBXO5ck",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 12,
      "start_timestamp": "00:07:09",
      "start_timestamp_seconds": 429.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eHurZBXO5ck&t=429"
    }
  },
  {
    "text": "be the tool that forces you to fill out your trading log. That forces you to review the results so that you can see even though you think you might be doing well, that you're actually not and that you have to make some adjustments. Discipline is what puts this whole thing into process. So there are a ton of studies out there, but take a look at this one. This is from Confidence and Investors Reliance on Discipline Trading Strategies. This I thought was interesting. This says, thus, investors may lack the discipline to rely on profitable trading strategies, particularly when recent trading successes increase their confidence in their own judgment. What this is saying, this is an entire study about investors, even when they have a profitable trading strategy, they still don't follow it. That ideally goes to show you how important it is to be discipline and accountable in this space. Your typical way of viewing the world and thinking about things does not work in trading. For example, let's take a look at the stock on the left hand side. In general, you are taught to bargain by. If I'm going to buy socks, I would rather buy them cheaper than more expensive. I might wait until there's a sale that does not apply well in trading. Because if you like buying things that are discount, there's a reason why things are going down. So if you're a really long-term investor five plus years, this might",
    "metadata": {
      "video_id": "eHurZBXO5ck",
      "title": "How to Stop Losing Money Trading Options",
      "url": "https://www.youtube.com/watch?v=eHurZBXO5ck",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 12,
      "start_timestamp": "00:08:18",
      "start_timestamp_seconds": 498.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eHurZBXO5ck&t=498"
    }
  },
  {
    "text": "rather buy them cheaper than more expensive. I might wait until there's a sale that does not apply well in trading. Because if you like buying things that are discount, there's a reason why things are going down. So if you're a really long-term investor five plus years, this might be part of your model that actually works really well. But if you are a trader entering an exit in sub-year periods, this is a way to throw most of your money away. Rather, we should be looking at buying things here as things are going up, as things are more expensive than reason, because this is where things are moving in the correct direction for our assumption being bullish. So that's just one example about how your standard thought process does not apply well to trading. Bargain buying doesn't work well. Next up, last one, let's take a look at details and why they matter. So like before I was telling you about this idea of creating a plan to focus your learning, there's a concept I refer to called 10X activities versus 1X. And here's the idea. When you are in the beginning of trading, I would focus far more of my time on things that take one unit of effort and give me 10 units of output as compared to the inverse. And the example I gave you earlier is whether using 26 or 27 days on your MACD indicator will make a break you. Do you",
    "metadata": {
      "video_id": "eHurZBXO5ck",
      "title": "How to Stop Losing Money Trading Options",
      "url": "https://www.youtube.com/watch?v=eHurZBXO5ck",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 12,
      "start_timestamp": "00:09:29",
      "start_timestamp_seconds": 569.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eHurZBXO5ck&t=569"
    }
  },
  {
    "text": "far more of my time on things that take one unit of effort and give me 10 units of output as compared to the inverse. And the example I gave you earlier is whether using 26 or 27 days on your MACD indicator will make a break you. Do you think that that one day difference in your MACD indicator is a 10X activity or 1X activity? Probably a 1X. My point there is I'm not saying that that one day difference doesn't have any impact at all, but that's probably not going to lead you to a gross output. Why do I care so much about the details? It's for this right here. If we take a look at this account, this is looking at a 15 return over 20 years. And I think we're starting with 150,000 right there. If you earn that return, you're going to make about 2.5 million. If you make just 1 above that in your return, you are now at 2.9 million. Half a million dollars more on 1. This is exactly why the details matter. This is why you have to emphasize the entire process and then your capacity to track your progress in that process. None of this is easy. However, these undoubtedly are nine of the habits that took me from my starting point of getting shanked in my hand in high school to being a multi-millionaire in my early 30s. Like, subscribe, be an outlier. See y'all later.",
    "metadata": {
      "video_id": "eHurZBXO5ck",
      "title": "How to Stop Losing Money Trading Options",
      "url": "https://www.youtube.com/watch?v=eHurZBXO5ck",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 12,
      "start_timestamp": "00:10:39",
      "start_timestamp_seconds": 639.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eHurZBXO5ck&t=639"
    }
  },
  {
    "text": "progress in that process. None of this is easy. However, these undoubtedly are nine of the habits that took me from my starting point of getting shanked in my hand in high school to being a multi-millionaire in my early 30s. Like, subscribe, be an outlier. See y'all later.",
    "metadata": {
      "video_id": "eHurZBXO5ck",
      "title": "How to Stop Losing Money Trading Options",
      "url": "https://www.youtube.com/watch?v=eHurZBXO5ck",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 12,
      "start_timestamp": "00:11:43",
      "start_timestamp_seconds": 703.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eHurZBXO5ck&t=703"
    }
  }
]