[
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "What's up everyone? Welcome back to the Outlier podcast. We have you and some clear back. I actually reached out to him for this podcast with a little bit more of a specific idea in mind. A lot of times we talk a little more broadly about markets and volatility, but I was recently having a couple conversation with folks and it still strikes me. The misinformation and the misunderstanding that exists between the overlap and then glorious lack thereof between institutional and retail traders. So I immediately thought of you and to have a conversation about this because he's done both. He's done institutional, then you took a break, you did your personal account for a little bit, then you went back. So you have like a very deep level of experience on both sides of this equation at a professional level. So I'm actually really really stoked to talk to you about this because I think I refer to these things as like trap tasks where it's like you could think you're doing the right thing, but in thinking you're doing the right thing, you can kind of hurt yourself. So I want to explore that world a little bit with you, but before is always thanks for coming to hang out for a little bit and share in your knowledge. No problem, I just got the constant winding in the background. I don't know what his deal is. Anyway, thanks for having me back. Let's see if",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 87.6,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "little bit with you, but before is always thanks for coming to hang out for a little bit and share in your knowledge. No problem, I just got the constant winding in the background. I don't know what his deal is. Anyway, thanks for having me back. Let's see if we can disappoint some people who don't like the stuff we're saying to them literally for free. That was good. I showed people because we were just winding about it. Right. Yeah. No, and they're going to be there. So I'm excited to hear what they got. But first, I thought we could start just like a very high level. If you were to summarize what institutions are doing versus retail and I know even institutions is kind of an annoying way of frame-exters so many different things going on there. But at like a super high level, if you were to explain to a second year trader, what's the difference between institutions and retail, what would you say? I mean, that's, that is really tough actually because we talk about the differences in sort of the way they're set up, the way they're funded. I mean, okay, we could just before I go on, we could start there, right? It's like sometimes people say, you know, what's your track record? And that's kind of an indication that they don't have any idea what institutional trading is like. Because I could tell you the track record of the firm I",
    "start_timestamp_seconds": 69.36,
    "end_timestamp_seconds": 158.2,
    "start_timestamp": "01:09",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=69",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "just before I go on, we could start there, right? It's like sometimes people say, you know, what's your track record? And that's kind of an indication that they don't have any idea what institutional trading is like. Because I could tell you the track record of the firm I worked for, but I can't tell you my track record because that involved doing a whole bunch of different things all the time and moving around from place to place and you're literally working for someone. And you never, you don't know what your return on capital is because you're given a, it's not like even at a hedge fund, you're given there. There's $100 million at the end of the year, you've got $110 million. Easy math, right? If you work in a trading firm, you don't get an account like that. Like you see your account equity go up or down, but you don't know how much risk capital is being allocated to it. So when someone's like, what's your track record? The answer is really, I see you don't understand what professional institutional and by that I largely mean sell side stuff. And that's the other thing between buy side and sell sides and normal. Buy side is almost like retail. Whereas most of the big option firms, actually, pretty much all of them are largely sell side. Most of them are providing liquidity market making in one shape or another. And it's obviously there are people",
    "start_timestamp_seconds": 144.76,
    "end_timestamp_seconds": 235.84,
    "start_timestamp": "02:24",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=144",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "between buy side and sell sides and normal. Buy side is almost like retail. Whereas most of the big option firms, actually, pretty much all of them are largely sell side. Most of them are providing liquidity market making in one shape or another. And it's obviously there are people who are pure market makers to people who trade positions, but only get in on a bit of the offer or something. And that whole bunch of stuff in the middle. But I would say most institutions are not taking the sort of risks that retail always thinks you need to take to make money. Because they can do it with much, much bigger size in much, much smaller edges. So I mean, almost by definition, professionals are better than retail. And we're going to be honest about that, right? There's no other performance oriented thing in the world where amateurs can beat professionals. That's why the professionals are the professionals. So in their sphere, they are definitely better. Having said that, you take a professional out of his seat. So there's a million bucks sitting in front of your right be screened makes some money. Most of them can't do that either. It's just, it's a very, very different job. Sorry, to start in a row, that's such a fantastic point that I don't think is talked about enough. Could you double click on that? The fact that if you take somebody that it was operating in an institutional",
    "start_timestamp_seconds": 212.4,
    "end_timestamp_seconds": 313.72,
    "start_timestamp": "03:32",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=212",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "do that either. It's just, it's a very, very different job. Sorry, to start in a row, that's such a fantastic point that I don't think is talked about enough. Could you double click on that? The fact that if you take somebody that it was operating in an institutional capacity doing some function, and then you give them the full suite of just retail and what that is in compasses, how their performance might look there. Well, for a lot of them, they wouldn't have the first clue where to start because there are a piece of a team, right? They might be at the end of a chain of sales groups where they have to make a market, that they're making a market to a structured disc, which is then decomposing it, talking to a sales guy, pitching it to the customer, and then it comes back to them. That's totally different to me saying, there's the S&P option chain. Makes some money. So often they will be literally one part of a production line. But also, even if they're trading, right? They're the Goldman Sachs, equity options trader. How much money is there due to them, and how much money is it because customers are trading with Goldman Sachs? Like you take that guy and you say, you're now trading for ABC Corp. He's not going to get the calls from customers anymore. So even if he acknowledges, I'm making all this money because I'm making markets",
    "start_timestamp_seconds": 301.4,
    "end_timestamp_seconds": 390.88,
    "start_timestamp": "05:01",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=301",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "how much money is it because customers are trading with Goldman Sachs? Like you take that guy and you say, you're now trading for ABC Corp. He's not going to get the calls from customers anymore. So even if he acknowledges, I'm making all this money because I'm making markets to customers and the markets are wider, that's not you. That's gold, but now you can do it better than other people, maybe, but you've got to sort of come up with, and this is something I did when I was working at the market making firm. When it came to paying traders, you have to kind of come up with a almost like a replacement level trader, like in baseball. You know, so you've got dollars above replacement, and you're like, look, this is a really, really easy product this year. This guy made 5 million bucks. That's great. But I think a good trader, like that we could pull off one of the other deaths, might have made 10 million bucks. So this guy actually didn't have a very good year and didn't make the money he should have. And there's other guys, you're like, look, this guy's a great trader, but a dispersion, which goes in and out of fashion quite a lot, had a shitty year. So I'm not going to stiff him too much on his bonus, because I know he did really well relative to what he could have done. So I kind of",
    "start_timestamp_seconds": 375.28,
    "end_timestamp_seconds": 458.8,
    "start_timestamp": "06:15",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=375",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "a great trader, but a dispersion, which goes in and out of fashion quite a lot, had a shitty year. So I'm not going to stiff him too much on his bonus, because I know he did really well relative to what he could have done. So I kind of feel like I've gone in circles there. Basically, institutional guys, there's a lot of money they get given because they're at the institution, not because of anything they do. The seat in the franchise has a lot of value. Where is a retail guy has none of that? And then you were also talking about the function, which I think is a, is a really, really important component to double-click, because trading is also one of those really weird things in my opinion, where typically speaking when you're trying to play rugby or if you're trying to get good at jiu-jitsu, you're looking at people that are really, really good, and you're saying, like, how can I emulate them? How can I take pieces of this and try to onboard it? And I think retail traders sometimes struggle with figuring out the pieces that make sense to take and emulate, and then the pieces that don't. And to give you an example here, a lot of times you'll hear retail traders talking about hedging. You'll hear them talk about hedging all the time. And they want to hedge the risk, they want to reduce their downside, which sounds smart, and",
    "start_timestamp_seconds": 442.08,
    "end_timestamp_seconds": 525.6,
    "start_timestamp": "07:22",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=442",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "and then the pieces that don't. And to give you an example here, a lot of times you'll hear retail traders talking about hedging. You'll hear them talk about hedging all the time. And they want to hedge the risk, they want to reduce their downside, which sounds smart, and they're hearing a lot of different kind of institutions talking about that kind of stuff. But then they kind of forget the actual game that they're playing and what that does to their performance. So if you were to think about the functions that institutions do, that you do think are good examples and good elements that retail traders should take and try to integrate it into their trading. What are some of those things that might come to mind? It's not so much the techniques as the general principles. So going back to your hedging example, if you go to a firm like a Jane Street or a Sasko Hanna, their idea of hedging isn't so they don't lose money. Their idea of hedging is so they take away all the risks that they don't want, so they can isolate the exposure to the one thing they do what. So they are literally trying to isolate that edge. Whereas I think with most retail traders that are like, oh, I'm hedging either because it the worst case they think I make money on my hedges, which is, you know, you can't think of a hedges separate from the option.",
    "start_timestamp_seconds": 511.36,
    "end_timestamp_seconds": 602.0,
    "start_timestamp": "08:31",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=511",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "So they are literally trying to isolate that edge. Whereas I think with most retail traders that are like, oh, I'm hedging either because it the worst case they think I make money on my hedges, which is, you know, you can't think of a hedges separate from the option. There's a thing called a hedged option that you're doing. So that's the first big confusion. But the second thing is, I'm going to hedge to stop my catastrophic loss, which isn't really a hedge at all. That's kind of you know, it's, I'm not saying it's not the thing to do, but it's not what a professional firm would think of as a hedge. That's like a different layer of risk management above that. So I would say that your average retail person gets that wrong and they try to hedge in a way that can't possibly be cost effective for them. Could you give it an example of that? Yeah, hedging. Anything you do. Basically, most jobs to get better at them, you do more of them. You become a better baker by baking more cakes. With trading, you become a better trader by taking your hands off the keyboard and letting things play out. Because every time you touch the keyboard a cost you money, and it's really insidious, right? Because you're thinking, oh, I might make 5000 bucks on this trade. Why do I care that I paid 50 bucks and spreads to give in? Then",
    "start_timestamp_seconds": 588.08,
    "end_timestamp_seconds": 681.52,
    "start_timestamp": "09:48",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=588",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "the keyboard and letting things play out. Because every time you touch the keyboard a cost you money, and it's really insidious, right? Because you're thinking, oh, I might make 5000 bucks on this trade. Why do I care that I paid 50 bucks and spreads to give in? Then it's because it's always 50 bucks. You might make 5000, but whether you make 5000 or lose 5000, you've got that 50 bucks always and it adds up. It can never be in your favor. So I think the professional spend a lot more time focusing on cost reduction. And I mean, that's one of the things, one of the boring things you actually do inside a professional organization has spent time on the phone talking to your clearing agent and stuff, trying to negotiate half a penny better commissions on options. Because that's for money. If you can get that down, that's huge. Whereas I don't think most retail spend, I don't think they have the amount of fear of transaction costs that they really should. Especially now when there are tons of brokers saying, you know, commission free. Well, commission. Yeah. Well, the CBOE are giving you commission free. And sit down a lot, making buckets on all that stuff out of the goodness of Ken Griffin's heart. So, you know, you always pay somewhere. And I think your average retail person trades way too much. When I first started trying to teach other people about anything, I",
    "start_timestamp_seconds": 663.44,
    "end_timestamp_seconds": 758.16,
    "start_timestamp": "11:03",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=663",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "free. And sit down a lot, making buckets on all that stuff out of the goodness of Ken Griffin's heart. So, you know, you always pay somewhere. And I think your average retail person trades way too much. When I first started trying to teach other people about anything, I kind of thought that the best way for a retail person to not lose money was to do more stuff like the professionals. And I still think that's true in some regards. You've got to treat it like a business. And I don't mean even if it's not your business. But I'm saying you have to almost have a business plan. And you have to be really detail oriented. And professionals are, right? Like you get to the office two hours before the market opens and go through all your clearing statements to make sure there was no mismetchers. And you make sure everything's in the right account. And it's all just detailed bullshit like that. Whereas I don't think most retail people go through that. So that kind of detail oriented business plan thing. You definitely can learn from the professionals. The other things psychology. Right? How many sort of beginning traders do you talk to who are like, oh, I've got traders block. I just couldn't pull the trigger on that one. It was like, greedy. If you if you pull that bullshit as a professional trader, you lose your job. Like no one cares, you didn't quite",
    "start_timestamp_seconds": 733.44,
    "end_timestamp_seconds": 828.16,
    "start_timestamp": "12:13",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=733",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "of beginning traders do you talk to who are like, oh, I've got traders block. I just couldn't pull the trigger on that one. It was like, greedy. If you if you pull that bullshit as a professional trader, you lose your job. Like no one cares, you didn't quite feel it today. Do you job, right? And that's something that I think instead of reading all this nonsense about trading psychology, it's just actually like a goddamn adult come to work, do you job? Don't be a dickhead and then go home. That's what professionals have to do. And I think amateur could learn a lot from that. Most trading psychology problems go away if you're like, I'm thinking of myself as a professional. I just come here, I do what I meant to do if I feel bad about it, if I feel good about it, don't care, pull the trigger, go, just do it. So I think that's something really people could learn a lot from. And a quick blog on that on your behalf, and I'm still trying to get you to release this book, but the FedPACs talks about that exact thing. And it's actually a fantastic section in there. So that's why I attempt to get you to release that book still. Well, I'm not releasing it. I mean, I don't care if people give it to other people. I doubt that I'll ever publish it because publisher who reached out to me wanted",
    "start_timestamp_seconds": 816.08,
    "end_timestamp_seconds": 899.52,
    "start_timestamp": "13:36",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=816",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "a fantastic section in there. So that's why I attempt to get you to release that book still. Well, I'm not releasing it. I mean, I don't care if people give it to other people. I doubt that I'll ever publish it because publisher who reached out to me wanted me to make it three times as long. And I don't want to make it three times as long because I don't think this is the right time. So that section in there was perfect on that. Retail options trading does have a section on that stuff as well. I think a lot of traders like to sort of think of themselves as uniquely heroic workers who no one else understands the stress and pain I'm in. Clearly, these people have never worked McDonald's at lunchtime or taught a bunch of kindergarteners. There's a lot of stressful jobs out there. Trading isn't unique. It's not even a stressful job I've had. It's just a job just do it. I think retail could learn a lot from that kind of attitude. Where I think they go wrong is they sort of see what they think pros do from the outside. And there's a lot of people on Twitter who play into this who should know better. But they'll be talking about Greeks here and implied vols here and skew and sticky strike and all that stuff. That's important if you're Ben I for it and you're trading cardal variants swaps against",
    "start_timestamp_seconds": 883.04,
    "end_timestamp_seconds": 982.32,
    "start_timestamp": "14:43",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=883",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "there's a lot of people on Twitter who play into this who should know better. But they'll be talking about Greeks here and implied vols here and skew and sticky strike and all that stuff. That's important if you're Ben I for it and you're trading cardal variants swaps against VIX futures. But retail can't trade cardal variants swaps anyway. If all you're doing is going to be banging out a one week SPY Strangle, none of that stuff is really, that's not going to make you money. That's sort of that's lopping is being a pro. And I think that's the impression a lot of people give that that's what you should take from the pros. And it really isn't. If you're trading the stuff retail can trade that stuff isn't the important stuff. And then it leads on to the real shit. I don't know if I can call anyone a scammer now without listening to their side of the story. But a lot of the the gamma feedback guys, I think that plays into it. Because everyone's oh this gamma feedback makes me feel like a pro. And there's a lot of things wrong with that whole process. So anyway, I feel like we're sort of going around the circles a bit. No, you hit a couple super like super high level items in there that are really important in terms of things that retail can pull. One that you didn't talk about that I'm curious your",
    "start_timestamp_seconds": 964.4,
    "end_timestamp_seconds": 1063.28,
    "start_timestamp": "16:04",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=964",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "process. So anyway, I feel like we're sort of going around the circles a bit. No, you hit a couple super like super high level items in there that are really important in terms of things that retail can pull. One that you didn't talk about that I'm curious your take on is a prox to risk. I think retail are two of this to small risks and leave themselves open to catastrophic risks. Whereas the professionals, the suscohanners of the world, they don't think of losing a million dollars and a day as a risk. That's just what happens if you're tossing a coin. It comes up heads 55% of the time. Well, you know, 45% of the time you're going to be losing money. That's not a risk. That's just part of the business plan, right? That's but where they want lose. They won't lose a billion dollars. Whereas there's tons of retail who look at a strategy and they say, oh, you know what, on average, I make $1,000 a week. That's great. But there's some weeks where I lose $1,000. I don't like that. I'm going to stop myself out so I can only lose $2,000. And by doing that, all they've really done is they've hedged away the risk by getting paid for. You've got to accept that every strategy you've got has a sort of an intrinsic risk reward profile. You know, and if you're winning on average, $1,000 a week, look, legitimately winning",
    "start_timestamp_seconds": 1043.52,
    "end_timestamp_seconds": 1142.4,
    "start_timestamp": "17:23",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1043",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "And by doing that, all they've really done is they've hedged away the risk by getting paid for. You've got to accept that every strategy you've got has a sort of an intrinsic risk reward profile. You know, and if you're winning on average, $1,000 a week, look, legitimately winning that on average, well, if it takes you a $5,000 loser every couple of months, just deal with it. I mean, that's part of that game. But what you shouldn't ever do is like lose your house. You know, it's like you should never be in a situation where you can go bankrupt. And I think that the other risks people should be ensuring themselves against. Not the, I lost a little bit of money, I feel sad. I mean, that's part of the game. I mean, this is something some people should do. I really encourage everyone to learn how to program at least enough to do Monte Carlo simulation. And now there's chat GPT. You don't need to really need to learn. Just ask it how to do it. Um, simulate a sharp force strategy and see how many days in a year that loses money. You know, and by the way, if you genuinely have a sharp force strategy that scales, you are like an all-time super legend, better than Steve Cohen, better than Kim Griffin. You know, Kim Griffin isn't really a trader. I mean, he's made a lot of money and I'm not criticizing him",
    "start_timestamp_seconds": 1123.44,
    "end_timestamp_seconds": 1219.76,
    "start_timestamp": "18:43",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1123",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "and by the way, if you genuinely have a sharp force strategy that scales, you are like an all-time super legend, better than Steve Cohen, better than Kim Griffin. You know, Kim Griffin isn't really a trader. I mean, he's made a lot of money and I'm not criticizing him because what he does is fine, but he's probably not a very good example. Um, if you have a sharp force strategy and you're not making some mistake and you just haven't seen the big risk it, you're doing great. But see how many days a year you'd losing. And I think the pros are much better at accepting that as part of the overall risk package. Um, but the pros are never exposed to, you know, I can lose my business, lose my house, that kind of thing, which is why it's such a big news when it's one of them blows up. Right. It's almost always a particular trader who's hidden something. I mean, it's almost never the firm deliberately took that risk. There's one case I know where they did, but usually it's, it's kind of a, sort of, it's a failure of process between the trader and the risk management and the, the sea sweet. Right. Right. You mentioned something in there that I want to double click into the, just sequence over turn the path where you can have something that on average makes a thousand, every once in a while will lose five. Retail",
    "start_timestamp_seconds": 1202.8,
    "end_timestamp_seconds": 1288.48,
    "start_timestamp": "20:02",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1202",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "and the risk management and the, the sea sweet. Right. Right. You mentioned something in there that I want to double click into the, just sequence over turn the path where you can have something that on average makes a thousand, every once in a while will lose five. Retail in my opinion sometimes, if they don't know a strategy well enough, when they see the first five pop up, five thousand dollar loss. And then let's say that the next five thousand dollar loss happens in two weeks versus, you know, another couple months. Then they say to themselves, like, oh, shit, I've lost 10, that just wiped out, you know, the last 10 months or 10 weeks. I'm sorry of gains. Right. I don't like this anymore. I'm going to switch. Could you talk about that? Yeah. Um, for two reasons, you shouldn't monitor with a things of working by watching your PML. Um, obviously your PML at the end of the day is the most important thing. But we're really talking about at the end of the day being at the end of your trading career. We're not talking about any given day. Because what will happen is people will do a very careful analysis they'll go over five years of data, you know, thousands of data points come up with a strategy. And then I'll trade it for two weeks and go, oh, shit. But if I told you, I've got a trading strategy and I've",
    "start_timestamp_seconds": 1272.0,
    "end_timestamp_seconds": 1371.12,
    "start_timestamp": "21:12",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1272",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "is people will do a very careful analysis they'll go over five years of data, you know, thousands of data points come up with a strategy. And then I'll trade it for two weeks and go, oh, shit. But if I told you, I've got a trading strategy and I've tested it on two weeks of data, you'll be like, there's nothing. I mean, what the hell? That's nothing. So people tend to massively overwate the very short period they've been trading something relative to all the time that they've tested. So statistically, that's a massive problem. And I don't know why people do that, but they do. And that's we probably shouldn't be saying retail as if retail are bad and pros are good. Because I know a lot of, I don't know a lot. I know some very good retail traders. Some of the best traders I know are definitely on the retail side. Retail isn't amateur. The opposite of retail's institutional, not, it's not amateur and professional. So we should say sort of beginning retail traders maybe. But they definitely make that mistake where they they're moved experience massively overwhelms the statistics that they've got. And if you set them down and talk them through it, they, these people aren't dumb. They would say, oh yeah, you're right. But when they're in the midst of it, they feel that way. And I feel like a lot of the communities they've got around them, which can be really",
    "start_timestamp_seconds": 1352.96,
    "end_timestamp_seconds": 1442.56,
    "start_timestamp": "22:32",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1352",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "you set them down and talk them through it, they, these people aren't dumb. They would say, oh yeah, you're right. But when they're in the midst of it, they feel that way. And I feel like a lot of the communities they've got around them, which can be really good. I think other people in their desire to help screw that process up even more by sort of saying, oh, well, that's because of this, it's because of this. So they're going to nice simple strategy. And then they start overlaying all these things based on a very short time period. Like, oh, God, this thing doesn't work on a Thursday, obviously, because I don't know natural gas inventorys come out or something, whatever. But also, so doing that statistically is bad. But doing that cycle, that's terrible for your psychological health. You can't attach any degree of self-worth to something that's almost a random process. You know, because if you're going to be like, either great day today, everything's happy. Oh my God, everything's terrible. Well, again, the best traders in the world, you're going to be losing them awful lot. You can't do that. You've got to, and I think if you hang around this game long enough, you get kind of used to that, you know, like, I'm not saying I enjoy losing money, but like, my typical day, you lose money, you're like, all right, whatever, it's still decent week, I still, you know, you're",
    "start_timestamp_seconds": 1428.96,
    "end_timestamp_seconds": 1517.6,
    "start_timestamp": "23:48",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1428",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "and I think if you hang around this game long enough, you get kind of used to that, you know, like, I'm not saying I enjoy losing money, but like, my typical day, you lose money, you're like, all right, whatever, it's still decent week, I still, you know, you're a count might swing around 2% a day, right? But at the end of the week, you know, oh, I'm not 1%. You know, so it's not, that 2% is just a lot of it's just noise, and you've got to sort of see how I'm attracting over the long run. So that's a big problem. I think people get into as well. Speaking of that problem specifically, if you were to recommend or at least give some ideas on how you can approach that, I think a lot of people will find themselves in the scenario where they, they're comfortable. They think it's good. Then they see those bad couple days that just happen to happen in that sequence, and then like the fear hits, then it's all the questions of like, oh shit, did I do this right, did I miss something and so on and so forth? So if you were to just talk to somebody about how they might even attempt to navigate that, what might you say? I'm going to assume that the person has done all the backtesting properly and they've got a strategy that really as comfortable as you can be, you know,",
    "start_timestamp_seconds": 1505.52,
    "end_timestamp_seconds": 1590.64,
    "start_timestamp": "25:05",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1505",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "So if you were to just talk to somebody about how they might even attempt to navigate that, what might you say? I'm going to assume that the person has done all the backtesting properly and they've got a strategy that really as comfortable as you can be, you know, because that's the other thing. There's almost always a million things you don't know, right? And it doesn't, I think it's better that someone understands, I've done the strategy and it tests really well, but in the real world, who the hell knows, right? You know, a comment could hit the exchange, something. So as long as you acknowledge that real life is a lot messy of an any-back test. I think after that, there's a few things, you probably know this if you've done martial arts, it's an old samurai trick, I guess actually, a lot of soldiers might feel this way. I don't know, Marines don't like to say their soldiers, but, you know, we give you grace. As soon before you've done a trade that you're going to lose, you know, and then it's kind of like before you go into a battle of samurai, I would sit down and convince themselves they would go to die. And that's the worst thing, they don't accept that that's the worst thing that can happen. And so when they don't die, it's all upside. And that sounds like a really stupid trick. Funny thing about psychology is we're really",
    "start_timestamp_seconds": 1572.0,
    "end_timestamp_seconds": 1655.44,
    "start_timestamp": "26:12",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1572",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "sit down and convince themselves they would go to die. And that's the worst thing, they don't accept that that's the worst thing that can happen. And so when they don't die, it's all upside. And that sounds like a really stupid trick. Funny thing about psychology is we're really good at tricking ourselves with practice enough. So you can use all these stupid bullshit tricks. I mean, largely they're called together if you want to make it scientific, that's behavioral, you know, cognitive, behavioral therapy. So you can convince yourself like that. So one of the tricks I like to do is like if I'd missed an earnings trade and I know it's blown right through earnings and I'm short to struggle and I know it's going to suck. I'm like, okay, I think and I know intellectually, maybe I'm going to lose 20,000 bucks. But I'll convince myself before I open the trading screen. I'm like, I've got to probably lose 100,000 dollars here. I've got to probably lose 100,000 shit. And then you open it and you're like, wow, I've only lost 20,000 bucks. That doesn't feel nearly as bad. And you know this from trading, right? When you're you're having a shitty day and you've lost, I don't know, $10,000 and then the market comes back and you're only end up losing 2000. Like today, for example, right? Sure. And then you're like, that was actually a pretty good day. But if you had a day",
    "start_timestamp_seconds": 1646.96,
    "end_timestamp_seconds": 1731.92,
    "start_timestamp": "27:26",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1646",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "When you're you're having a shitty day and you've lost, I don't know, $10,000 and then the market comes back and you're only end up losing 2000. Like today, for example, right? Sure. And then you're like, that was actually a pretty good day. But if you had a day when you were making 20,000 and you were that I'm losing 2000, you'd be totally different mood. So it's like how you get to that loss actually matters psychologically and awful lot. So that's a trick I like to use on myself at works. Also, just don't trade big enough that it's going to kill you. You know, if you legitimately can't handle for any reason financially or emotionally, if you can't handle or losses you're getting, well, stop doing that. You know, it's like, it hurts when I do this. Well, stop doing that. I mean, that's not really a magic thing, right? It's like if anything else is like that, you know, you don't have to trade as big. If you get to the point where you really can't trade big enough to make any money at all. I mean, that's okay. Maybe trading's just not for you. I mean, if you're thinking of this as like a part-time thing, there's a hobby, something that's fun, you don't have to do it if it's not fun. That's one of the big advantages retail do have. Like I said, a pros got an advantage because they just come in",
    "start_timestamp_seconds": 1714.4,
    "end_timestamp_seconds": 1799.44,
    "start_timestamp": "28:34",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1714",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "I mean, if you're thinking of this as like a part-time thing, there's a hobby, something that's fun, you don't have to do it if it's not fun. That's one of the big advantages retail do have. Like I said, a pros got an advantage because they just come in and act like it's their job. Retails got the other advantage. They don't have to do it. You know, if it's making you feel sick, just take up another hobby, take the dog for a walk, go surfing. There's a lot of other things you can do in life. And then finally, obviously, there's one's experience really helps. Once you've lost money a lot of times, it's just another day. You know, the losses come along, the wins come along. You know, it all fades away in the end. You mentioned something before that I think is probably commonly overlooked, which is sizing things so that it doesn't necessarily kill you or cause too much pain. And I wager a lot of those instances come from cases where traders are too focused on how much they're trying to make. And I know personally, my largest percent drawdown on my account came from exact such a trade where I was trading this super wide iron condor in the rut. And I was just trying to make like a few hundred bucks over a week or two. I don't remember it was back in college. And I was just so focused on",
    "start_timestamp_seconds": 1782.72,
    "end_timestamp_seconds": 1872.64,
    "start_timestamp": "29:42",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1782",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "came from exact such a trade where I was trading this super wide iron condor in the rut. And I was just trying to make like a few hundred bucks over a week or two. I don't remember it was back in college. And I was just so focused on how much I was trying to make that I didn't really fully appreciate the risk side of the equation. If you were to walk through and for a folks familiar with your work, you share frameworks on how to think about this with like fractional Kelly and tools like that to actually help inform sizing. But if you were to walk through the major muscle movements on that person, let's say placing that earnings trade. And we know every once in a while, you're going to get a forced interdiviation move. It's going to pop up sometime. Right. How do you walk them through that sizing protocol? Okay, well the only the ultimate sizing rule, however you express it mathematically, is you want to, if you lose, you don't want that loss to kill you. And if you make money, you want it to be enough money to make the whole thing worthwhile. So if you can't come up with that balance, and there's a lot of stuff you could mathematicize on that, right? When I say worthwhile, you could turn that into a utility function, or it's kind of stuff. But if you can't come up with a healthy",
    "start_timestamp_seconds": 1854.72,
    "end_timestamp_seconds": 1936.16,
    "start_timestamp": "30:54",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1854",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "whole thing worthwhile. So if you can't come up with that balance, and there's a lot of stuff you could mathematicize on that, right? When I say worthwhile, you could turn that into a utility function, or it's kind of stuff. But if you can't come up with a healthy sort of happy balance between, you know, if I make a thousand bucks, I'd really happy with that. It's worth doing. And if I lose on the same trade, $2,000, I can handle that. If you can't come up with that balance, you can't do that trade. And I think, again, it goes back to this idea that trades have a intrinsic risk profile of their own. And at a certain point, you can't really change that. You can't change it by putting in stops or adding options or something. You kind of have to be pretty comfortable with what the market's giving you. And I think where people really go wrong with this is selling the iron condolking, people decide they want to make a certain amount. It doesn't, you can't make a certain amount. You can only make what the market's giving you. If the if the ball is like 30%, you know, you might be able to sell one option and make a thousand bucks. But if all five percent, you might be like, I have to sell 20 options to make a thousand bucks. The problem with that is, for normal movements, your risk is described",
    "start_timestamp_seconds": 1925.6,
    "end_timestamp_seconds": 2009.68,
    "start_timestamp": "32:05",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1925",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "is like 30%, you know, you might be able to sell one option and make a thousand bucks. But if all five percent, you might be like, I have to sell 20 options to make a thousand bucks. The problem with that is, for normal movements, your risk is described by the Greeks. For big movements, there's only one risk and that's the net number of options. Because for big movements, that's the only thing that matters. Like if you're short 20 options, I don't care what your Greeks are. You've got 20 times as much catastrophe risk as if you're short one option. And if you go basically yield hunting and try to make the same amount of money each time, you are going to blow up. I guarantee it. Actionable inside for you. You don't do that. It's one of the worst things you can do. And that's one of, when I said the only institutional case I know of where they did this knowingly, that's what they were trying to do. Absolutely. Sorry. Option sellers.com, the net gas. Oh, no, I kind of you just let pass that one. I think if him more is retail, this is what I mean. No, this was a, this was a hedge fund called LKM. And they lost, they say they lost billions, billion dollars in two days. But I saw their position beforehand and I know what the market did. They lost basically a billion dollars in 10 minutes.",
    "start_timestamp_seconds": 1996.48,
    "end_timestamp_seconds": 2092.64,
    "start_timestamp": "33:16",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=1996",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "is what I mean. No, this was a, this was a hedge fund called LKM. And they lost, they say they lost billions, billion dollars in two days. But I saw their position beforehand and I know what the market did. They lost basically a billion dollars in 10 minutes. And that was because as they were selling options, which is fine. I mean, for a start, selling options usually has the edge. Right? We all know that. Also, there's no trade that's always good or bad. It's the price you get in there. So if I'm selling it up, go back to your own condoler, right? When you're like, oh, I just sell our condols. Really? Would you sell it for a cent? No. So you don't just sell our condols. Right? You've got some sort of lower price limit. So everyone, you basically have to have that. You can't just be totally price and sensitive and say the edge is in iron condols. There's always a price where you should buy stuff too. And I think that's another mistake retail make as they think their edges in the structure. So they become price in sensitive around that structure. I'm going to sell all iron condor, zero DTI in condor. And you know, every money vols 5%. You've probably got a edge. But you've got a lot of risk here. And you're not going to make much money if you're right because the amount of premiums minuscule. So maybe",
    "start_timestamp_seconds": 2069.76,
    "end_timestamp_seconds": 2165.2,
    "start_timestamp": "34:29",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=2069",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "I'm going to sell all iron condor, zero DTI in condor. And you know, every money vols 5%. You've probably got a edge. But you've got a lot of risk here. And you're not going to make much money if you're right because the amount of premiums minuscule. So maybe you just don't want to do that trade. And a lot of people won't take that on board. There's another action more insight. Don't trade zero DTIs. I mean, the amount of money you can make is pretty small because the premiums are pretty low. And the costs relative to the amount of money you can make are huge. Because your age is in volatility spread, but your costs are in dollars. Your costs on that are the same with vols 4%. As if it is 40%. So I'll trade zero DTIs of vols over 20. I mean, I'm not going to trade them a vols under 7 or 8 or something. I mean, there's no, there's it just doesn't make sense. It's not from a risk perspective, but just because I've cost perspective. How much money can you make? So could you? Why people do want to trade zero DTIs to be honest? You know exactly why. Well, okay, true. It's a quick hit of dopamine. You get to do something every day. You feel active. There's just not much engine it. And everything you do in zero DTIs, if you're doing it in a sensible way, you can",
    "start_timestamp_seconds": 2144.72,
    "end_timestamp_seconds": 2249.6,
    "start_timestamp": "35:44",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=2144",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "DTIs to be honest? You know exactly why. Well, okay, true. It's a quick hit of dopamine. You get to do something every day. You feel active. There's just not much engine it. And everything you do in zero DTIs, if you're doing it in a sensible way, you can do that in one week options as well. It's not different. It's the same thing. It's just you're not doing it every day. So if you've got a thing that works in zero DTIs and it's a legit thing, it's going to work in weeklies too. Or monthlys. You said something earlier that I want to hone in on with respect to just vol, right? You're saying, vol 7 versus 20, which scenario would be more appealing to you. I noticed there that you didn't say something like implied volatility rank is high, which I think is another really, really common mistake when people hang all the way around things like volatility rank always, not even understanding like the scoop potential for something like that. Could you talk about why in that instance you were looking at raw vall and you were already set it by the way with respect to premiums, but just to elucidate the point a little bit more. Okay, so volatility, this is something that's, it's not tricky, but it might be, I don't know, people, it's difficult sometimes to explain this correctly. Volatility behaves differently when you're looking at a rank across different stocks as",
    "start_timestamp_seconds": 2225.28,
    "end_timestamp_seconds": 2332.56,
    "start_timestamp": "37:05",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=2225",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "to premiums, but just to elucidate the point a little bit more. Okay, so volatility, this is something that's, it's not tricky, but it might be, I don't know, people, it's difficult sometimes to explain this correctly. Volatility behaves differently when you're looking at a rank across different stocks as opposed to how a volatility works in a single stock. So when you say, when I say in the cross section volatility is high, that's when I take every stock that has options on it and I rank them by IV. So you know, the highest one is some biotech company, none of us have ever heard of it. And the lowest ones, I don't know, camera suit or something. There is definitely edge there in selling the ones with the highest vall and buying the ones with the lowest vall. As a cross sectional thing, that works. It doesn't work as well as it used to for very clear reasons. Back when it worked really well, you had to go and make all those calculations yourself. You had to pull in all the options days, I calculate the implied vall, keep track of all the stuff in a massive database, huge amount of work. Now you can sign up for almost any, you know, $30 a month service and they'll do it all for you. You would expect the edge to have gone away. Hasn't gone away completely, edges like that rarely completely go away, but it's not as",
    "start_timestamp_seconds": 2310.4,
    "end_timestamp_seconds": 2394.8,
    "start_timestamp": "38:30",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=2310",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "database, huge amount of work. Now you can sign up for almost any, you know, $30 a month service and they'll do it all for you. You would expect the edge to have gone away. Hasn't gone away completely, edges like that rarely completely go away, but it's not as good as it was. But the other thing is, if you have a, if you're just looking at the vall of a single stock through time, selling it when it's vall gets high is usually the wrong way around. When it's vall gets high, it's usually a very low variance premium. Because people, you can't just look at the level of vall, you have to look at the variance premium. And usually implied vall is understating, you know, implied vall might do this when the realized vall is doing that, which means when implied vall's low, there tends to be a pretty high volatility edge and when it's high, it's the other way around. So, can we, sorry, sorry to interrupt. I just talking about rank over time or in the cross section, totally different. Got it. Yeah, and so, and sorry to interrupt. I wanted to, and really emphasize the point that you just made and draw it out a little bit more. A lot of times when people are saying like, oh, I'm going to sell vall when IVR is high. And you were talking about the difference between vall itself, ranked against itself versus the risk premium.",
    "start_timestamp_seconds": 2378.96,
    "end_timestamp_seconds": 2478.08,
    "start_timestamp": "39:38",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=2378",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "the point that you just made and draw it out a little bit more. A lot of times when people are saying like, oh, I'm going to sell vall when IVR is high. And you were talking about the difference between vall itself, ranked against itself versus the risk premium. I can talk about the difference of a stock's vall compared to its historical, what has been in the past. And a stock's vall versus all the other stocks. So, that ranking scheme works in the way you would think it would. The ranking thing based on where it's been through time is a much, much slippery and I don't think there's a great deal of edge in that and if you're just treating that mechanically, chances are you're on the wrong side of that. If what you're doing is selling and this is, no one said this stuff was easy, right? But that's not true. A lot of people say it's easy, but it's not. One of the problems you get is if you're selling vall, you can often be wrong and still make money, right? Because the edge is naturally on that side. So, this is one of the reasons it's difficult to convince people that selling iron condols when implied vall is five is bad. It's difficult to convince someone that doing the wrong thing if they're making money. Right? So, if you're selling 10 delta 2 delta iron condols, you're going to make money most of",
    "start_timestamp_seconds": 2455.04,
    "end_timestamp_seconds": 2546.0,
    "start_timestamp": "40:55",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=2455",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "the reasons it's difficult to convince people that selling iron condols when implied vall is five is bad. It's difficult to convince someone that doing the wrong thing if they're making money. Right? So, if you're selling 10 delta 2 delta iron condols, you're going to make money most of the time. So, anyway, the, a lot of things in the volatility world that you think should be true just really aren't. And that's selling something, selling vall when it's high. So, like, I mean, if anything you should buy vall when it's high. Now, the traditional thought process behind that and I think it's really, really important to double-click into this is the thought process typically, and I know you know this, when implied volatility rank is high, people are told volatility is mean reverting. And they're told that the rubber band is stretched and then they're essentially selling the expected collapse of that rubber band. Can you explain why that dynamic doesn't work the way that they think it does? Well, same volatility's mean reverting is true, but the mean's also change. You know, so if you, if you sold volatility in, I don't know, March 2020, right? Volatility didn't go back to 15 for about a year, right? Volatility had a new normal. So, just because something's mean reverting doesn't mean you'll make money because it comes back. The other thing that can be wrong is you're not directly trading volatility. You're trading the spread between implied",
    "start_timestamp_seconds": 2528.64,
    "end_timestamp_seconds": 2637.44,
    "start_timestamp": "42:08",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=2528",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "Volatility didn't go back to 15 for about a year, right? Volatility had a new normal. So, just because something's mean reverting doesn't mean you'll make money because it comes back. The other thing that can be wrong is you're not directly trading volatility. You're trading the spread between implied and realized. And that doesn't have to be mean reverting and it doesn't have to be negatively correlated with the level of volatility either. So, just because the implied vol comes down, that's not necessarily going to help you if the realized vol still is higher than the implied. So, you can do things that sort of mitigate that, like you can trade options, they have more Vagre exposure and less gamer exposure, but the market's not stupid. They're not going to have gone up nearly as much as the ones at the front of the curve. So, yeah, that's one of the problems people get wrong. It's selling volatility spikes isn't as appealing as it looks as when you look at the VIX graph over time and you're like, oh, the VIX, these spikes that always comes down again. Yeah, but you're that's not what you're trading when you're trading options. That part I think is probably completely foreign, especially for new traders to hear, or a new trader they think when they're selling premium that when Vol goes down, they've now made money. You made a really important point with respect to the relationship between implied vol and",
    "start_timestamp_seconds": 2618.96,
    "end_timestamp_seconds": 2717.52,
    "start_timestamp": "43:38",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=2618",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "trading options. That part I think is probably completely foreign, especially for new traders to hear, or a new trader they think when they're selling premium that when Vol goes down, they've now made money. You made a really important point with respect to the relationship between implied vol and realizable. So, for that same new trader, what's a specific way that they could gauge when a good time to sell might instead be, instead of using IVR? Well, forget about volatility, all right? volatility is just a way of turning option prices into another thing. It relies on model. Forget about all the. Right? Let's see you've got a straddle and the straddle is trading at five bucks and that straddle normally is trading at two bucks. So, you're like, oh, that's really high. I'll sell it. And then as soon as you sell it, it moves by $10. You know, the stock moves by $10. So, you've just got hammered, right? But, you know, the straddle drops down to a dollar. So, you will rise about the price of the straddle, but you won't really just trading that. If the stock hadn't moved in the straddle of drop, just buy it back and you made money. And that's what's happened. It happens over earnings. But I think in general, people have to remember that implied volatility is the price of the straddle at any point. But the thing that's going to be important to you is, okay, but",
    "start_timestamp_seconds": 2693.6,
    "end_timestamp_seconds": 2786.8,
    "start_timestamp": "44:53",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=2693",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "just buy it back and you made money. And that's what's happened. It happens over earnings. But I think in general, people have to remember that implied volatility is the price of the straddle at any point. But the thing that's going to be important to you is, okay, but think it in the simplest possible terms. What you've done is you've made a bet that we're not going to move by more than the straddle at the price you sold it. The volatility changing just means you might be able to buy it back later on. But you should always kind of think, I've done this trade. I'm going to have to hold it to exploration. What happens then? So, going back to when people should be confident about selling things? I mean, that's kind of a... people aren't going to like hearing this answer either. But the variance premium is just sort of something you have to buy into that exists on average. It's really hard to time. It looks like it should be easy because you look at the vets. But if you look at the actual variance premium itself, it's got way less of a pattern in it. Timing it is really hard. So you'll default position has to be unless something nuts is happening. I'm going to have a core short-volt position. And buy something nuts. It's easier. Again, don't get tied up in the math so much. Don't be like looking at a specific,",
    "start_timestamp_seconds": 2770.48,
    "end_timestamp_seconds": 2863.2,
    "start_timestamp": "46:10",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=2770",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "in it. Timing it is really hard. So you'll default position has to be unless something nuts is happening. I'm going to have a core short-volt position. And buy something nuts. It's easier. Again, don't get tied up in the math so much. Don't be like looking at a specific, you know, garge model or something. Forget about all that. You know when something is nuts. Right? I'm not talking about the difference between v-vix of 85 and 88 going through some moving average or something. I'm saying, okay, if v-vix is 120, that market's crazy. If the... the... if the contender of the vix futures has done that, that market's crazy. And all of these the market's crazy indicators tend to come along at the same time. So, you know, vix spikes, the term structure's going to flip. v-vix is going to go up. The equal weighted vix is going to go up. The nine-day vix, you see what I mean? Like all these things will do the same thing. So it doesn't really matter which one you're watching. As long as you have a good idea of the difference between normal and crazy, and then basically, you just avoid crazy. That's pretty much as good as you can do unless you go full time and spend all your time building a really complicated v-v-v-v, which I wouldn't recommend. And the same way that I wouldn't recommend anyone doing that cross section or across all the stocks thing. It's",
    "start_timestamp_seconds": 2841.52,
    "end_timestamp_seconds": 2949.12,
    "start_timestamp": "47:21",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=2841",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "avoid crazy. That's pretty much as good as you can do unless you go full time and spend all your time building a really complicated v-v-v-v, which I wouldn't recommend. And the same way that I wouldn't recommend anyone doing that cross section or across all the stocks thing. It's just a really hard way to get a one-and-a-half sharp strategy. There are easy ways to approach the world than that. So if you just want to basic rule, you should be selling v-v-v-v as a core position, stick to indices because they have a much more consistent volatility premium than stocks. Don't try and pick and choose between stocks that much more difficult than much more videos and credit. With an exception, I'm going to come to one second. When the market goes nuts and volatility is really high, just relax. You don't have to sell v-v-v-v at the top tick. Don't sell it when it's going up. So when it's coming down. And you don't even have to worry about, say, when the vix went to like AC, you don't even have to worry about, I want to sell it at 60 on the way down. You can relax. Sell it 30 because you're going to make more money selling vull when vull is in medium to low levels. So that's when I say about the zero DTE when they're trading a five vull, there's going to be edge there. The problem is you have to weigh that",
    "start_timestamp_seconds": 2930.0,
    "end_timestamp_seconds": 3015.28,
    "start_timestamp": "48:50",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=2930",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "relax. Sell it 30 because you're going to make more money selling vull when vull is in medium to low levels. So that's when I say about the zero DTE when they're trading a five vull, there's going to be edge there. The problem is you have to weigh that edge against the cost. So that's slightly different issue. But generally stick to selling vull when the vix is in 25 to 15 range. When it's much lower than that, you don't get enough premium to cover your costs. When it's higher than that, this probably not much variance premium at all. The one thing I would say about stocks is when stocks go into bubbles, there are definitely there's a death of opportunity there. The difficult thing with this is you have to be patient and it has to really be a bubble. And it can't be a bubble like Tesla is a bubble. I'm not talking about being disconnected from its fundamental valuation. What's the PE of Tesla now? I don't know. 100. Millia. You know, how long here is like 600 plus? It's really high, right? But Tesla's had a high PE forever. I'm not talking about that. I'm talking about the sort of bubble where the stock just goes like this. I'm talking about GM E, AMC, all that kind of stuff. When you're in that kind of thing and vull is really high, you've almost got a free bit. But the worst thing you can",
    "start_timestamp_seconds": 3001.6,
    "end_timestamp_seconds": 3092.16,
    "start_timestamp": "50:01",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3001",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "that. I'm talking about the sort of bubble where the stock just goes like this. I'm talking about GM E, AMC, all that kind of stuff. When you're in that kind of thing and vull is really high, you've almost got a free bit. But the worst thing you can do is to sell the calls. Because remember, you probably do remember when GM E started off, I think it was about eight. Went to 16, went to 32. You would completely be legitimately okay to say, I think it's now on a bubble. I'll sell calls. So you sell 50 calls, right? Then it goes to 500. Once something's in a bubble, it can continue to be in a bubble. Like it's doing something stupid. And once someone's stupid, this stupidity knows no bounds. Right? Once it's become unmoored from reality. So selling calls is insane. Buying calls is probably the second worst thing you can do, because you're paying way too much money. The opportunity here is to sell ports. Because if you're selling ports, when implied vull is super high, the implied vull is now correlated with the stock move. Like GM E, the vull when it started, I don't know, probably like 50 or 60. When it went nuts, I don't know what it was, because my system topped out in a thousand. So it was above a thousand, right? So we know vull has gone up as the stock's gone up. So what happens when",
    "start_timestamp_seconds": 3071.84,
    "end_timestamp_seconds": 3168.48,
    "start_timestamp": "51:11",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3071",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "started, I don't know, probably like 50 or 60. When it went nuts, I don't know what it was, because my system topped out in a thousand. So it was above a thousand, right? So we know vull has gone up as the stock's gone up. So what happens when the stock comes down? Vull comes down. So I'm selling ports. I'm getting a huge premium for those because vull's high. If the stock keeps going up, well that's fine, right? Those ports are going to expire worthless. But if the stock goes down, I've got a huge cushion there because vull's going to come in. So if the stock drops, if let's say I sell the 40% so I'm selling the 200 strike puts when the GM E's 500. And it implied vull's a thousand. If it drops back to 200, then implied vull is probably going to drop back to 200. It's quite likely I'll make money because the viga is made up for any delta effect. So that's the other, that's a, that is a really, really good trade. Actionable trade. The problem is you can't force that. Don't go out now and look around on a stock screen if the stuff that's in a bubble. It's not going to be in a big enough bubble if that's what you have to look for. If it's all people are talking about all the time, that's when it's in a bubble. So I can't even think of an",
    "start_timestamp_seconds": 3150.0,
    "end_timestamp_seconds": 3244.72,
    "start_timestamp": "52:30",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3150",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "stock screen if the stuff that's in a bubble. It's not going to be in a big enough bubble if that's what you have to look for. If it's all people are talking about all the time, that's when it's in a bubble. So I can't even think of an example right now. Is there one we're talking about? I mean I think that example there was perfect. No but I'm saying if people are going to go look for it. Oh, yeah. Yeah. And it turns up. It's a wonderful, wonderful thing. But literally it might turn up on every three or four years. Yeah. I was going to say there's, there's definitely, there's nothing that sticks out to me right now. That's at those kind of levels. There probably is in the crypto world, but I don't know if crypto vull behaves in that way. Crypto vull. Yeah. I was going to say the other thing that I will see sometimes that would probably be good to discount is the the biotech names because you can see that going into specific events for biotech, but typically it's for a reason. It's not. Okay, that's another really good example. Options before earnings events are systematically overpriced. Why? Because we know the stock's going to have a big jump. And there's a decent chance you're going to lose a ton of money. On the other hand, on average, it's overpriced. Selling options right before earnings is a good trade. Selling",
    "start_timestamp_seconds": 3227.52,
    "end_timestamp_seconds": 3322.08,
    "start_timestamp": "53:47",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3227",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "Options before earnings events are systematically overpriced. Why? Because we know the stock's going to have a big jump. And there's a decent chance you're going to lose a ton of money. On the other hand, on average, it's overpriced. Selling options right before earnings is a good trade. Selling biotech options right before FDA announcements is the same thing. Selling zero DTE's right before a big economic announcement. Again, there's an edge in there. So selling it on Thursday night, sell the Friday options if there's a non-farm payroll release. So Friday one. I think Thursday, but anyway, you sell there's a premium over those big announcements always. And again, though, don't push this too far. Don't say, oh, I'm going to do it when Michigan sentiment's being released or something. It's going to be one of the really big ones. Like even GDP's a bit iffy. Right now, CPI and non-farm payroll have that premium. It's big enough. So whenever there's an event and you don't know what the outcome's going to be, but you know when the event is sold. Oh, and there's one of biotechs sold by a TETVOL. You know the number of people who trade options on everything, but they're like, I won't touch biotech because that's risky. What do you think selling VOT? Why do you think you make money selling VOT? Because it's risky. Biotechs are more risky. Works through this to the logical conclusion. There is a depth that distinct biotech",
    "start_timestamp_seconds": 3302.32,
    "end_timestamp_seconds": 3404.56,
    "start_timestamp": "55:02",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3302",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "trade options on everything, but they're like, I won't touch biotech because that's risky. What do you think selling VOT? Why do you think you make money selling VOT? Because it's risky. Biotechs are more risky. Works through this to the logical conclusion. There is a depth that distinct biotech bowl premium above and beyond what is with a normal stop. So if you're going to sell VOT, so the stuff that makes you think it's a stupid thing to sell. If following the biotech example, understanding that sometimes after, you know, they go through their phase trial release or whatever, there can be 10 times moves, right? Whatever. If you're thinking about sizing something like that, how do you size it so that you can make something that makes sense for the portfolio? But then for those exceedingly five standard deviation plus moves, when they do happen, it doesn't blow you out. Yeah, you have to do each individual one small because you can get a 10-sick move, right? I can't remember the biggest loss I've ever had on earnings thing like that, but it's absolutely enormous, right? Like 30% move when it was priced then it like eight or something. You've really just, it's one of those things you can't just nibble at. You can't just pick and choose each one because I've been doing that trade for 15 years now. I really don't know any way of picking the ones that are more likely to blow through",
    "start_timestamp_seconds": 3387.04,
    "end_timestamp_seconds": 3480.08,
    "start_timestamp": "56:27",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3387",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "or something. You've really just, it's one of those things you can't just nibble at. You can't just pick and choose each one because I've been doing that trade for 15 years now. I really don't know any way of picking the ones that are more likely to blow through them not. I will tell you that if implied bowl has gone up a lot before earnings, it's usually a better sale than the ones where it hasn't gone up as much, but that effect isn't enough to override the general idea of just selling everything. So you have to accept you're going to get a 10-s-d loss. You can't expect to do that risk reward thing on one stock, right? You have to do that over a whole bunch of stocks and say, on average if I do this on 100 stocks, I'm not going to get a 10-s, the whole thing is not going to be 10-s-d. So on 100 stocks maybe your real risk is too SD and then you size it based on that. So where you'll go wrong is if you do too few of them. That's one of the things that makes that hard for people is they find it difficult to manage that many things and that really is just a matter of practice because after you've been doing that for a while you can easily put on 30 or 40 of these in 10 minutes, take them off in the open, not",
    "start_timestamp_seconds": 3468.64,
    "end_timestamp_seconds": 3560.56,
    "start_timestamp": "57:48",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3468",
    "chunk_index": 46,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "for people is they find it difficult to manage that many things and that really is just a matter of practice because after you've been doing that for a while you can easily put on 30 or 40 of these in 10 minutes, take them off in the open, not a big deal. When you're starting that idea it is a big deal is beginning anything is. So that's what you've got to do. That implementation hassle, that's important. Don't buy wings because when you buy wings you're buying options that are even more overpriced and wings very rarely help. It's very unlikely that the wings are going to be the saviors and you're going to throw away a ton of money in all the cases that I'm not. If you insist on tapping your losses due calendar spreads, sell the fronts and buy the backs. Don't buy one week or two week because those have got big jump premium in them as well. Buy like the longest dated ones that have any liquidity at all. So like two months. So, problem with that is if you blow through the strikes, both of these things end up in the money. It's a pain in the ass to get out of that long dated one because the front one will expire in the money. You'll get stock, no big deal. You're still hedged and you're long gamer. If anything goes wrong, you're long. So that's a decent position but you're going",
    "start_timestamp_seconds": 3539.6,
    "end_timestamp_seconds": 3637.52,
    "start_timestamp": "58:59",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3539",
    "chunk_index": 47,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "It's a pain in the ass to get out of that long dated one because the front one will expire in the money. You'll get stock, no big deal. You're still hedged and you're long gamer. If anything goes wrong, you're long. So that's a decent position but you're going to be holding that until expiration because you're not going to be able to get out of a deep in the money option. They're going to have a really wide bid ask spread. So it does tie up quite a bit of money if you, if that happens. Yeah. But yeah, it does a little way to hedge that. So I don't know how how many more direct pieces of information you could give people before they're happy but I feel like trade is a never happy. That's okay. I'm not going to try and make trade as happy. I just want them to be unhappy with me in specific ways. So the best looking hopeful. Well fair enough and honestly thank you a lot for doing this. I know again a lot of this stuff is very elementary for you but one of the big projects that I'm working on is trying to serve is a little bit of like a middle ground, right? Like trying to pull information from you at a level that newer traders can operationalize. And generally like I genuinely think you didn't insanely awesome job on this one which leads me to kind of",
    "start_timestamp_seconds": 3618.48,
    "end_timestamp_seconds": 3701.84,
    "start_timestamp": "01:00:18",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3618",
    "chunk_index": 48,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "on is trying to serve is a little bit of like a middle ground, right? Like trying to pull information from you at a level that newer traders can operationalize. And generally like I genuinely think you didn't insanely awesome job on this one which leads me to kind of a fun follow on project at some point that I want to do with you is actually more at like the intermediate to advanced level so that there's an opportunity to talk about slightly more complex things for folks. But first I just want to thank you for for doing this and hanging out and sharing some of your information. Yeah, I actually think you're going on the wrong direction there. I think the underserved the underserved part of this educational process is telling beginners stuff that's actually true and does have edge in a way that doesn't have all the heavy math behind it. The extra stuff. Because you can trade vol without knowing about black shows. You don't need to know about Greeks. You can get most of it from payoff diagrams. So I think that's the I think that's the underserved part of the market. Something legit, something serious but also something it can't be condescending but it also has to be true. So my example is Guy Fieri. Okay, Guy Fieri is legit chef. No's what he's doing but he also does this thing, you know his steak is he goes round diners and you know",
    "start_timestamp_seconds": 3686.0,
    "end_timestamp_seconds": 3785.36,
    "start_timestamp": "01:01:26",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3686",
    "chunk_index": 49,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "something serious but also something it can't be condescending but it also has to be true. So my example is Guy Fieri. Okay, Guy Fieri is legit chef. No's what he's doing but he also does this thing, you know his steak is he goes round diners and you know talks to his genuine all-round people and he just enjoys it. He just talks about food with people at that level. So that's the thing I think finances missing is something true legit not condescending but also kind of entertaining. I love that. That gives me some homework. I have a couple of ideas actually that pop up immediately for that but yeah, thank you. I love that. I think that's awesome. I think you're here. I have a 1968 camera. If I bleach my hair too much. Well, I don't know. My hair gets pretty blonde in the summer so I might be all right. You just need the 68 camera convertible and you're good. GT500 will probably be the muscle car rebuild. 6A camera sec but I heard I like old muskings. I'll never get one right? But I do like them. I've heard the 350's better because they've heard the 500 is really front heavy and basically just a drag car. You mean for the new ones? Oh, you're talking about a new one. I'm talking about one of the old ones. Like yeah, I was talking about the old ones. Okay, got it. Yeah. Because I",
    "start_timestamp_seconds": 3762.24,
    "end_timestamp_seconds": 3858.72,
    "start_timestamp": "01:02:42",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3762",
    "chunk_index": 50,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "they've heard the 500 is really front heavy and basically just a drag car. You mean for the new ones? Oh, you're talking about a new one. I'm talking about one of the old ones. Like yeah, I was talking about the old ones. Okay, got it. Yeah. Because I know that the boss 429 is no one nearer's good a car so the 302. But I think that's true of the shell visas. Well, but it was in gone in 60 seconds. I can't like. Yeah. And so many nice cars have been ruined by trying to make a ripple car of that thing. I know. Yeah. Well, such as life. All right, you and um, for folks they can. Well, you're not really on X anymore. Are you? Or you know, I mean, I've still have an account. Okay. Guy who hacked to my account is possible for me to delete my account. But the only reason he hacked it was to do crypto scamming. Yeah, nice. If I don't post anything nothing happens. So my account is just dormant. Got it. So if folks did want to find your work, they can find your books and stuff off of Amazon, but anywhere else that you want to direct into? I don't really have anything going on right now. Um, are you still writing for a whole? Yeah. I've got a blog on the whole technical. So if you just write do whole technical blog, little point you",
    "start_timestamp_seconds": 3844.8,
    "end_timestamp_seconds": 3933.6,
    "start_timestamp": "01:04:04",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3844",
    "chunk_index": 51,
    "word_count": 250,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "off of Amazon, but anywhere else that you want to direct into? I don't really have anything going on right now. Um, are you still writing for a whole? Yeah. I've got a blog on the whole technical. So if you just write do whole technical blog, little point you know, the right thing. Um, I think technically I'm on LinkedIn, but I'm not allowed to post there. I've just allowed to forward stuff from whole technical. Fair enough. Well, nobody should go on LinkedIn anyways. That's, that's a sad place. So avoid LinkedIn at all. I mean, like I said, feel free to give people that. The least is if you feel like it. Yeah. I would be more than happy to. I purposely have an honestly just out of respect. Like I wouldn't shuffle your work around, but yeah, I'm more than happy to share that now. Because I really do think it's it's good. It's really good. It was just vanity project. I didn't never expect it to get to be sold or anything. So yeah, shit, send it around. Got it. We'll do. Well, thank you for, for letting me share that and thank you for making that for folks. I think it's awesome. And it's always, thank you for your time. And I'm sure we will sync up again in the near future. Yeah, you too. Be guys.",
    "start_timestamp_seconds": 3917.28,
    "end_timestamp_seconds": 3992.48,
    "start_timestamp": "01:05:17",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3917",
    "chunk_index": 52,
    "word_count": 233,
    "upload_date": null,
    "duration": 3996.0
  },
  {
    "video_id": "EjD6KPo3OZs",
    "title": "Euan Sinclair on Retail vs Institutional Trading | The Outlier Podcast",
    "text": "making that for folks. I think it's awesome. And it's always, thank you for your time. And I'm sure we will sync up again in the near future. Yeah, you too. Be guys.",
    "start_timestamp_seconds": 3983.68,
    "end_timestamp_seconds": 3992.48,
    "start_timestamp": "01:06:23",
    "video_url": "https://www.youtube.com/watch?v=EjD6KPo3OZs",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EjD6KPo3OZs&t=3983",
    "chunk_index": 53,
    "word_count": 33,
    "upload_date": null,
    "duration": 3996.0
  }
]