[
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "you you you What's up outliers happy? Friday we have the outlier options trading beginner lab and the topic for today came up in the discord early hours just asking for some financial topics for folks as we come into the end of the year. And one came up that I think is always worth the conversation we're actually talking about it yesterday and the day before so it falls along in the same thread which is sizing. I want to talk about this in the context of what traders can expect and then how to approach sizing. Has always got to say hello to everybody that's hanging out with us on a Friday night to talk about some options because there's no where else I would rather be funny enough. I actually really enjoy doing this so it's always good to see you guys. I see I are too bad. Rease Kirk, great to see you find gentlemen. Hope the evening is going splendid so far. And let's start with a quiz. First question is up for your consumption. First question here is a trader should never risk more than 1% of their total account on a single trade true false A or B true false. I see B false B. Okay. So it seems like we might have a bunch of heavy risk open people. Is that what it is? Or is there something more for somebody that says B. Could you explain why hopefully they give you",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 146.0,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "true false A or B true false. I see B false B. Okay. So it seems like we might have a bunch of heavy risk open people. Is that what it is? Or is there something more for somebody that says B. Could you explain why hopefully they give you some characters for touch like give a response? It's annoying in YouTube because they literally limit you guys to not be able to type it all. Think of Kirk has it. Kirk has it literally perfectly depends on strategy. You will come across a ton of different Framings don't risk more than 5% don't risk more than 8% don't risk more than 10% don't don't don't don't do this don't do that. You'll come across tons of them. The reality is it's way more dynamic than that what we do. And it is very much up to the individual trader to figure out what works for them. That said, there is a core component that we have to pay attention to, which is you need to survive. And it's not survive any one single bad trade. You need to survive more than that and longer than that. There are things we refer to as bad path. That's how things happen to happen. What is the sequence of returns? There can be instances where you experience bad path. So if you're trading something and we literally just recently had an example of it, I did a video earlier today talking about",
    "start_timestamp_seconds": 124.0,
    "end_timestamp_seconds": 234.0,
    "start_timestamp": "02:04",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=124",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "we refer to as bad path. That's how things happen to happen. What is the sequence of returns? There can be instances where you experience bad path. So if you're trading something and we literally just recently had an example of it, I did a video earlier today talking about the exact topic. If we're trading something where our probability to win is really high and you happen to start trading and you just happen to go through a couple bad trades. But let's say that you were planning on only risking 5% of your account total on each individual trade. But you did that because you think it'll work out over the long run. But let's say that you eat four of those losses in a row. And then you say to yourself, well, shit, I was not expecting to lose 5% 4 times. I was more or less planning on 5% per. So when we're talking about sizing, it's a little bit more dynamic than that. Let's take a look at the next question. If your strategy is an 85% win rate does that mean you're profitable. You all will absolutely know the answer to this. I have to ask it because it's compulsory because of how wide spread the bullshit is. I are too bad. Has it right out of the gate. We don't need to spend a lot of time belabering this one. If anybody doesn't understand this concept of win rate and profitability, please please",
    "start_timestamp_seconds": 213.0,
    "end_timestamp_seconds": 309.0,
    "start_timestamp": "03:33",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=213",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "to ask it because it's compulsory because of how wide spread the bullshit is. I are too bad. Has it right out of the gate. We don't need to spend a lot of time belabering this one. If anybody doesn't understand this concept of win rate and profitability, please please please ask please say can you explain it? Please say can you go into further detail? Please tell me because I want to make sure you understand my my guess is most people already know. So I won't automatically go into it. But if you don't, there is literally zero shame. Just tell me and we will explain quickly. Otherwise, you can always look up on the YouTube channel. Just look on my channel for the key word expected return or expectancy. And you'll see exactly what you need to see. But the group is exactly correct. It could be or it could not be. We have absolutely no idea. And people often absolutely mistake high win rate with profitability. A lot of times people will actually brag. That's actually one of the best possible ways you could spot a fellow content creator that's out there trying to be a good person that's absolutely a guy. And if you're talking about high win rates and that's their proof of concept, they are fucking you. That's it. That's all there is to it. Even if what they're saying is accurate, it's good, the thing works. They're still fucking you because they're",
    "start_timestamp_seconds": 293.0,
    "end_timestamp_seconds": 394.0,
    "start_timestamp": "04:53",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=293",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "good person that's absolutely a guy. And if you're talking about high win rates and that's their proof of concept, they are fucking you. That's it. That's all there is to it. Even if what they're saying is accurate, it's good, the thing works. They're still fucking you because they're not giving you the actual information you need in order to identify anything about that strategy. We literally just looked at a strategy yesterday. Was it yesterday or Wednesday? Was it yesterday or Wednesday? Yesterday or Wednesday? We looked at, I think it was Wednesday. Okay, I'll stop trying to guess. But recently, we looked at selling the tails in SPX options. And what we found is the win rate for the strategy we ran was like 84%. But it was very negative, like very negative. That can happen. So let's move on to the next question three. Risk defined spreads are automatically safe. True or false. If you put on a spread to define your risk, you are automatically safe. Okay. You name a answers. Beautiful. Love to see it. Absolutely. Love to see it. Kirk going for the qualitative follow up, which is a fair, is a fair ask, but that's not the question. Kirk, when we do these quizzes, you got to think of it. Like the quizzes that you got in high school, where it's choose the best answer. And it looks like everybody did, which is false. It's absolutely not automatically safe. It's not even",
    "start_timestamp_seconds": 366.0,
    "end_timestamp_seconds": 494.0,
    "start_timestamp": "06:06",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=366",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "ask, but that's not the question. Kirk, when we do these quizzes, you got to think of it. Like the quizzes that you got in high school, where it's choose the best answer. And it looks like everybody did, which is false. It's absolutely not automatically safe. It's not even safe from the things that people think it's safe from. The entire idea behind a vertical spread is to take whatever your return profile is, and to alter it slightly. For example, if we have a risk diagram, and let's say we have this configuration, who can tell me what this is. What is this option strategy that I just drew? Anybody have an idea? What strategy did I just draw? Long call. Long call. IR2Bed says poor man covered call. It's not a covered call just because you can see that there's upside that goes on into perpetuity. But it is a long call. So it's the base of the the poor man covered call. The way we know this is because as price increases our profitability increases, but we have capped downside. So you can infer right out of the gate what this is. Now funny enough, you can use other structures to recreate this, so it could be other things, but the simplest answer is obviously a long call. If we want to adjust our long call, because when we put the long call on, we say, well, I don't want to spend that much on the",
    "start_timestamp_seconds": 470.0,
    "end_timestamp_seconds": 589.0,
    "start_timestamp": "07:50",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=470",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "can use other structures to recreate this, so it could be other things, but the simplest answer is obviously a long call. If we want to adjust our long call, because when we put the long call on, we say, well, I don't want to spend that much on the long call. Or I don't want to deal with as time passes. Let's say that your original P and L curve might look more like that. It won't be exactly like that, but let's pretend. And you might say, well, I don't want to deal as time passes with this going down here, because this dashed line will approximate this solid line. That trader might favor a spread. So in order to turn this into a spread, we can put on a put call spread, a put debit spread, whatever spread you like for different purposes. They're effectively all interchangeable based on what volas and what not. But in this case, when we turn this into a spread, what we do is we exchange some of this risk. We decrease this risk, and we give ourselves now, cap to profit. Anytime you're capping profit, you should be increasing your probability of having some sort of successful trade. That's the way to think about it. What's the issue with a vertical spread? A few things. The first issue with a vertical spread is you can have, like we were talking about before, a high win rate, but negative expectancy. Let's your",
    "start_timestamp_seconds": 581.0,
    "end_timestamp_seconds": 690.0,
    "start_timestamp": "09:41",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=581",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "of having some sort of successful trade. That's the way to think about it. What's the issue with a vertical spread? A few things. The first issue with a vertical spread is you can have, like we were talking about before, a high win rate, but negative expectancy. Let's your first issue. We literally looked at an iron condor, which is two vertical spreads put together in SPX where this exact thing happened. We did that on Wednesday. So that's the first issue. The second issue, who can tell me another issue with this thing? Any guesses? The second issue sometimes is not as well thought through, and there's more than two. But we'll see if you guys come up with. There's a specific one I'm looking for. What's another issue? With vertical spreads. To simplify, another one is just the number of legs. So we would call this execution risk. Your ability to get in and out. What's a third? Richie says your insurance can lose value while your main leg gains value. That is fair. I would say that's not necessarily an issue that's more, I wouldn't call it a bug. I would call it a feature. That's what they're designed to do. So it's not wrong at all, but I wouldn't consider that one necessarily an issue. Oh, synonymous is more commission. That's correct. No one says the further out leg is more overpriced in or one on average. That's fair. But then we could say why",
    "start_timestamp_seconds": 660.0,
    "end_timestamp_seconds": 771.0,
    "start_timestamp": "11:00",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=660",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "what they're designed to do. So it's not wrong at all, but I wouldn't consider that one necessarily an issue. Oh, synonymous is more commission. That's correct. No one says the further out leg is more overpriced in or one on average. That's fair. But then we could say why don't we sell the further out and buy the inner one, right? You don't have to be long. You don't have to be short. The vertical all the time. So if we follow that logic, no one, then we should just. We really should just invert that, right? We should buy the closer and sell the further. So there's a little more to it than that, but it's not a bad guess. What else can you guys think of? It's really important, like I said, it's one that a lot of people skip over. And it's just because it's not necessarily super popular or a thought through until it happens to you. I want you to think about settlement. I sell to open a put. Richie says you'll need to have buyers of both options at the same time. Yep, that's absolutely accurate. I would put that into the number of legs execution. So that includes commissions, slipage, your ability to actually get in, get out. That's fair. Think about settlement. I sell to open a put and then I buy to open a call. We come up to expiration. We get to expiration Friday. And this option is in",
    "start_timestamp_seconds": 754.0,
    "end_timestamp_seconds": 842.0,
    "start_timestamp": "12:34",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=754",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "of legs execution. So that includes commissions, slipage, your ability to actually get in, get out. That's fair. Think about settlement. I sell to open a put and then I buy to open a call. We come up to expiration. We get to expiration Friday. And this option is in the money. This option is out of the money. What happens if I carry that? There you go. So Oston, honestly, you could be a sign on the put. Absolutely. You can be a sign on your short leg at any point. That isn't always catastrophic. If you still have your long leg, it's more of an inconvenience than anything. But that also does happen. The last risk that's commonly overlooked nonetheless is assignment. There is still assignment risk in this. Kirk says that kid on Robin Hood deleted himself over that. I believe so. And I think that was in UV XY with box spreads. I have a video that goes through box spreads because I use them all the time. But it's absolutely pivotal that if you trade box spreads that you do it in European Style options, literally for that exact reason because of early assignment risk. So it's just part of the trade that you can't forget. And again, just most people do forget because it's not really super common. It's not a big deal. But if you're not paying attention to it, it can literally cause you problems that you're not even really prepared for",
    "start_timestamp_seconds": 819.0,
    "end_timestamp_seconds": 919.0,
    "start_timestamp": "13:39",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=819",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "So it's just part of the trade that you can't forget. And again, just most people do forget because it's not really super common. It's not a big deal. But if you're not paying attention to it, it can literally cause you problems that you're not even really prepared for it. Just because you didn't think about it. So that's your third one there. Okay. Let's take a look at our last question. What is better for sizing of a trade than using the number of contracts? Should we use vibes? Should we use Delta? Should we use dollar risk? Bives Delta or dollar risk? What's better for sizing? I see vibes to get start. Some good vibes go a long way. I see dollar risk. See dollar risk from recent richie. Dollar risk from Reggie. Curk. Dollar risk. Okay. So all of you are wrong. I'm with no one. It's all about vibes. Good. I'm just obviously kidding, but it is. I do like having good vibes. So. I guess we'll have to agree to this in right here. Joking aside. Dollar risk. How much money you're putting up in terms of the cost of the position? And then also how much you're risking is way more important than sizing than an arbitrer. Number of contracts that you're choosing to put on. Delta is absolutely reasonable as a response. But your dollar risk is telling you that. So it's same same. A little bit different, but same same. When",
    "start_timestamp_seconds": 910.0,
    "end_timestamp_seconds": 1010.0,
    "start_timestamp": "15:10",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=910",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "also how much you're risking is way more important than sizing than an arbitrer. Number of contracts that you're choosing to put on. Delta is absolutely reasonable as a response. But your dollar risk is telling you that. So it's same same. A little bit different, but same same. When you're putting on an option straight very frequently, there are two numbers that are really important to you. There's the cost for the position. And then there's whatever you plan to manage that position at. Let's take a look at an example. Let's what's stock do we have up my current. Let's do something in my current really fast. And let's say in my current, we want to buy a at the money call. So we're going to buy the 280 49 Delta will pull this up. This trade itself will cost us 2,045 bucks. That is the cost for this position. However, we can choose to manage this. At any point that's relevant to us. So let's say we choose to manage this. If it drops to 244. We can look at what the price will be. If the underlying is sitting at 244. So we're putting up 2,045 bucks to get the trade on. And if it hits 244, we're really going to lose about 1076. That's not a perfect number. As vol moves. That will change a little bit. But it gives you a perfectly reasonable planning factor in terms of the size of the position. How",
    "start_timestamp_seconds": 991.0,
    "end_timestamp_seconds": 1096.0,
    "start_timestamp": "16:31",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=991",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "bucks to get the trade on. And if it hits 244, we're really going to lose about 1076. That's not a perfect number. As vol moves. That will change a little bit. But it gives you a perfectly reasonable planning factor in terms of the size of the position. How much capital it needs, which is 2045, 2045 bucks versus how much risk you have in the trade. Total risk in this as we just defined here is something around 1100. Again, it's now going to be perfect. You could have all spike up a little bit, which might help you, or you can have all contract a little bit, which might hurt you. It'll move left and right, minorly. But the base idea, this will be pretty close. Kirk says, how would you manage an overnight gap? Get fucked. Sometimes it'll happen. There's nothing you can do. There are some small things you can do in terms of buying shares or selling shares. You can always trade things that are extended hours. You can try to use futures to maybe offset some of it. But if you're trading a naked option, you can absolutely experience a gap. It's called idiosyncratic risk. And it's part of the game. Which actually leads beautifully, Kirk, into the follow-on discussion that I want to talk about, or the core of the video today. Which is discussing a massive gap between why beginners often lose a bunch of money. There's a ton of reasons.",
    "start_timestamp_seconds": 1072.0,
    "end_timestamp_seconds": 1174.0,
    "start_timestamp": "17:52",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=1072",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "idiosyncratic risk. And it's part of the game. Which actually leads beautifully, Kirk, into the follow-on discussion that I want to talk about, or the core of the video today. Which is discussing a massive gap between why beginners often lose a bunch of money. There's a ton of reasons. The first one I want to synthesize really, really fast, because we've talked about it a few times, especially in the pro sessions. But I think we also hit it a little bit on the Wednesday session, but while we're on the topic, I will reiterate it quickly. And then we'll move on to the thing that's more specific to Kirk's point. Here, if we think of any other endeavor that's skilled, there are things like apprenticeships. You've got to go be an apprentice for a while. There are degrees. You've got to go to school for four years or six years or eight years. Then you get to go to your job. There are things that have OJT. So if you're going to be a doctor, you get your degree and as you're getting your degree, you then go and you shadow people in a medical facility and get hands on practice. There's all this shit that goes on in any other profession. Most people when it comes to trading, they begin trading with no experience. Their expectations are effectively that they're going to outperform professionals. So they're going to beat professionals. So if we're going to synthesize the",
    "start_timestamp_seconds": 1150.0,
    "end_timestamp_seconds": 1249.0,
    "start_timestamp": "19:10",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=1150",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "hands on practice. There's all this shit that goes on in any other profession. Most people when it comes to trading, they begin trading with no experience. Their expectations are effectively that they're going to outperform professionals. So they're going to beat professionals. So if we're going to synthesize the top line reason why traders lose money, it's this right here. It's literally this. It's this massive gap between where they begin and what they're on their initial expectations are. And then can follows up with exactly what this leads to, which is taking on way too much risk trying to make is much money as they think that they want to make. So here's what this ultimately looks like. We did a quick example and I'll go through it really fast to reiterate it, but if we have, oh, it might still have it actually in here. Literally think it might still be here. We look really quick. We get my ideas, we get my eyeballs framed. Think I deleted it. Okay, looks like it's gone. Okay, that's fine. The core concept for what we did look at was really, really simple. If you have a hundred thousand dollar account and your goal is to make a certain percentage 10% 20% 30% and so on, right, whatever your target is. The simple way to think of this is as you are trying to make more, you're going to have to do more and have more risk on. Pretty self",
    "start_timestamp_seconds": 1217.0,
    "end_timestamp_seconds": 1342.0,
    "start_timestamp": "20:17",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=1217",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "account and your goal is to make a certain percentage 10% 20% 30% and so on, right, whatever your target is. The simple way to think of this is as you are trying to make more, you're going to have to do more and have more risk on. Pretty self explanatory, right? If I need to make $500 in a month versus $2,000 in a month, I'm going to need more positions to do this. Those positions are also going to have to be sized in a particular way in order to make this possible. A good example of this is if we use a common beginner option strategy vertical spreads. So again, let's take a look at the scenario. We have a new trader that wants to make $2,000 a month, whatever the number is. I think most, that's even probably not that applicable. I would say the most common scenario I come across is this one where you have like a five hundred or five thousand dollar portfolio. And that person's trying to make like $100 a week. This one is pretty common to see. First, let's see what's going on here underneath the hood. If we do this in terms of non compounding returns, that means you need to make 2% on your portfolio every single week. And then obviously that will go down if your number stays the same as your portfolio grows. So I'm not going to bother with the compounding element to this. At",
    "start_timestamp_seconds": 1316.0,
    "end_timestamp_seconds": 1426.0,
    "start_timestamp": "21:56",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=1316",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "this in terms of non compounding returns, that means you need to make 2% on your portfolio every single week. And then obviously that will go down if your number stays the same as your portfolio grows. So I'm not going to bother with the compounding element to this. At a really high level though, if I just check out a 2% return over the course of a week. And we do that consistently and actually compound. We're looking at like multiple thousand percent return annualized. We're literally talking about a if it's like on time every time. Super short duration. If you do it weekly over that duration and compound, it's like a hundred eighty percent. So here's. Here's the key takeaway. At least to this part of the conversation. Your expectations can have a massive impact on. What you're doing in. Oh, that we did have it. It's down here. You guys been boozelled me. Here it is. There's the artwork. Same idea that we're just talking about. So let's go back to this five thousand dollar account trying to make a hundred dollars a week. Let's just take a look at what that might look like right in practice. I'll go in on demand and we'll just go back in time. Let's go to the towards the beginning of the year. Just pick something February. It looks fine. I'm just going to do some individual stocks really fast. If we pick some individual stocks, Palantir was a",
    "start_timestamp_seconds": 1405.0,
    "end_timestamp_seconds": 1517.0,
    "start_timestamp": "23:25",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=1405",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "in practice. I'll go in on demand and we'll just go back in time. Let's go to the towards the beginning of the year. Just pick something February. It looks fine. I'm just going to do some individual stocks really fast. If we pick some individual stocks, Palantir was a pretty big one. Let's see. Let me clear out whatever's in here. Let's get this option to chain up. Once this loads, I'm just going to put on a short put vertical. Just going to pick something. So if we short to 75 and we go along the 73. You get the trade on for somewhere between 65 and 70 cents. Probably the probability of getting it at the mid precisely is low. So on this one trade, you get somewhere around there. The issue with the trade as you might guess is more two points wide. So it means we're risking a hundred and change in order to make 60 bucks. Fine. That doesn't necessarily look awful compared to this. Especially if you can get a few of those on and hit this target. But what's the risk of doing it that way? And having this unrealistic annualized return expectation is really simple if you think of it in terms of sample size. If we have three trades on. We're looking to make 65 bucks. And in that scenario, that means we're willing to risk what 135. If we repeat this a few times. This trade has a high",
    "start_timestamp_seconds": 1498.0,
    "end_timestamp_seconds": 1624.0,
    "start_timestamp": "24:58",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=1498",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "expectation is really simple if you think of it in terms of sample size. If we have three trades on. We're looking to make 65 bucks. And in that scenario, that means we're willing to risk what 135. If we repeat this a few times. This trade has a high probability of winning. Let's just say that we've replicated across a couple similar names. High probability of winning. But the first issue you want you should identify is that the probability of winning. But the probability of all of these winning. If we're just blindly selling these spreads is not super high. The probability of one of these losing is fair. Even if you have pretty high conditional probabilities of each one of them winning. You start to walk into a world called compounding probabilities. Because you can have a 50 50 prospect. But the probability of different distributions around that 50 50 prospect, depending on what it is. Not a coin flip because that would be pure 50 50. But even if you do a coin flip, there's a possibility for streaks. And then you need in the long run. It'll approximate if it's a fair balanced coin. Taking this back to the idea of expectations and then position sizing. A trader might look at this and say in order to make this return, I have to get on at least two of these if not three. And then they all need to work for me. That's not super",
    "start_timestamp_seconds": 1584.0,
    "end_timestamp_seconds": 1706.0,
    "start_timestamp": "26:24",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=1584",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "this back to the idea of expectations and then position sizing. A trader might look at this and say in order to make this return, I have to get on at least two of these if not three. And then they all need to work for me. That's not super unrealistic, but it's improbable that that will maintain long term. The probabilities that you will have one or two of these that lose. And then you play the game with ketchup. That sets you back further and further because now instead of needing your hundred dollars, you now need a hundred and fifty dollars because you have to overwhelm the prior loss. And that means you need an even better percent return because your account value is lower than what it was. So your target return goes up, your percent return target goes up, your account value goes down. That's a losing prospect long term when we're doing something like this. It leads to what hopefully should be in obvious question. How should we size things? The answer is actually way simpler than you might expect, but as always, simple doesn't necessarily mean easy. It means that you need to do some homework. You need to look at stuff for a little while. That could be something as simple as figuring out what these vertical spreads might look like. If I trade them in high-vol stocks and I put on five-volume at a time and I just track them. And",
    "start_timestamp_seconds": 1688.0,
    "end_timestamp_seconds": 1780.0,
    "start_timestamp": "28:08",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=1688",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "do some homework. You need to look at stuff for a little while. That could be something as simple as figuring out what these vertical spreads might look like. If I trade them in high-vol stocks and I put on five-volume at a time and I just track them. And I do that over a long enough sample. What you need is some sort of data. The way you get the data is from tapertrading or back testing. Both of those exactly what I would do. Back testing, some version of live testing, forward testing, all of those are exactly how you get your base layer of data. Instead of saying for that account, I need to have this many trades on. If you have some back tested data, live tested data of your strategy, in this case we're talking about some vertical spreads. Let's say instead you have a data point like on average my per trade P&L is positive $22. This takes into account your losses over the long run. And then let's say that my standard deviation on this is plus or minus $5. You have an actual planning factor now. You know in order to even have a remote chance at this, you need to have at least five of these on. And the probabilities will shift a little bit as things move around and based on how good your sample size is. Sizing can't be random. If you say to yourself, I'm going to trade",
    "start_timestamp_seconds": 1759.0,
    "end_timestamp_seconds": 1869.0,
    "start_timestamp": "29:19",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=1759",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "have a remote chance at this, you need to have at least five of these on. And the probabilities will shift a little bit as things move around and based on how good your sample size is. Sizing can't be random. If you say to yourself, I'm going to trade some sort of strategy and I'm comfortable losing X number of dollars. You are setting yourself up for utter failure. The solution is way easier again than you think, but you have to do the work. The solution is to paper trade for a little bit get an idea of what the strategy is that you're doing and how that strategy behaves. Then you can make good decisions. Another example of this is let's say that you're playing a slightly more asymmetric style strategy. So this would be like my long call stuff when I'm trading things directionally to the upside. And let's say that my average win is $1,000. In my average loss is like $200. But the probabilities are 50 50. The 50 50 shot. If I have this kind of data and let's say that I have this for 3,000 trades. What I do with this then is I analyze the individual trades and I take a look at things like dispersion. So if I plot my P&L and let's say that this is the minus 200 and let's say that this is the 1000. What we would expect to see is a certain number hanging around",
    "start_timestamp_seconds": 1851.0,
    "end_timestamp_seconds": 1961.0,
    "start_timestamp": "30:51",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=1851",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "is I analyze the individual trades and I take a look at things like dispersion. So if I plot my P&L and let's say that this is the minus 200 and let's say that this is the 1000. What we would expect to see is a certain number hanging around here. Then we would expect to see on this side. Whatever something like that. And then I can look at this data and I can say like how representative do I think this data is of what this strategy actually does. If I think that the data is pretty representative that's awesome. What that means then is I can use that logically to size my trades. If I look at the data and I'm like man the dispersion is like way up here to weigh down here. Like what's going on at the tails at these extremes. I don't know what's leading to those so I can't really control for them. That's a completely different conversation that you have with yourself that means you need more data. But if you're approaching the game of trading by effectively saying like oh for this one vertical spread I'm comfortable losing $500 on this one trade. That is literally meaningless. It is a complete and utterly random guess. If you don't have the skill or the knowledge to do better back testing that's okay you can start more simply. You don't necessarily need to have all of that. Understood from the jump. I",
    "start_timestamp_seconds": 1945.0,
    "end_timestamp_seconds": 2049.0,
    "start_timestamp": "32:25",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=1945",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "this one trade. That is literally meaningless. It is a complete and utterly random guess. If you don't have the skill or the knowledge to do better back testing that's okay you can start more simply. You don't necessarily need to have all of that. Understood from the jump. I will always remind you if you're going to take trading seriously you should learn how to do that stuff. If you're using trading is like more of a secondary thing and it's something that you're trying to find a couple small things you can do to make money. But you're not necessarily trying to run it as a quote unquote profession. That's a different scenario. What you can do is examine a simple strategy. You can run your own test in something like think or swim on demand. Doing it this way is always going to be more time consuming. But you can set up your own little log and I would add a couple more things in here like maybe the wall per option or whatever else you think is relevant to the strategy. And I would go back and click through. So let's just do a really really really quick iteration of this. We won't click through a bunch. But what I want to do is just give you a sense of what this process could look like. If you wanted to actually do this on your own. So I'm going to type in the dates all that",
    "start_timestamp_seconds": 2015.0,
    "end_timestamp_seconds": 2120.0,
    "start_timestamp": "33:35",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=2015",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "really quick iteration of this. We won't click through a bunch. But what I want to do is just give you a sense of what this process could look like. If you wanted to actually do this on your own. So I'm going to type in the dates all that stuff. Just like I would just like this is my actual portfolio and the first trade that I'm looking at in my portfolio. This specific position in Pond here. And I'm saying I'm going to go into seven March. My short or we'll start with the long put. It's going to be at the 73. It's a point two seven delta. And then my short put is the 75. My short put is at a point three delta. I'm going to get when I'm looking at the premium for these. It really depends on how you want to track it a good way to track it is to include the bit as spread so that you can see what the strategy behaves across. So here's what I mean by that rather than just having the premium. If instead of premium. You have the bid. If you want to refer or the ask whatever you want to refer to it as if you track those. Then you can track the PNL you can do a mid PNL and then you can do a bit or offer PNL. What that gives you is actually a really useful data point in terms of",
    "start_timestamp_seconds": 2106.0,
    "end_timestamp_seconds": 2198.0,
    "start_timestamp": "35:06",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=2106",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "the ask whatever you want to refer to it as if you track those. Then you can track the PNL you can do a mid PNL and then you can do a bit or offer PNL. What that gives you is actually a really useful data point in terms of how sensitive is the current strategy that I'm running to being filled at the mid. If you find that your strategy is hyper sensitive to that it means that you're probably trading something that's pretty thin. The other thing you can do is just always penalize yourself and you can just go to the bid or the offer and transact either on that or close to that. So for something like Palantir that's pretty liquid. I don't think you have to go all the way to the natural. I think that's a little excessive, but you could definitely tend towards that direction. So if I were to put this on I would say again like maybe 60 cents a spare the probability of me getting filled at 60 cents is probably pretty high. We can see again what our total risk will be in this trade. So we're going to have $140 out in order to make this. There's our first trade. So we can find a couple more who has a ticker that you think we should put a trade on. It could be whatever you want long call short call. We're back in three Feb trying not to",
    "start_timestamp_seconds": 2184.0,
    "end_timestamp_seconds": 2265.0,
    "start_timestamp": "36:24",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=2184",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "have $140 out in order to make this. There's our first trade. So we can find a couple more who has a ticker that you think we should put a trade on. It could be whatever you want long call short call. We're back in three Feb trying not to cherry pick anything that you think does something in particular ideally just pick random shit that just moves however so fly. Okay. We'll do so five first. What do we want in so five. Go 30 days. Reice do we want give me the structure that we want here. And then same thing okay so Kirk gave me a specific so we'll go with that. And Kirk do you want a put credit or call credit. Put credit copy. So we'll run this like shorts. We'll do. Dollars like with the two dollars. So like what's we'll do two dollars wide. We'll get our 55 cents or so. Okay. So we're in the same date three Feb. This one is I ren. Pop prices 1028. We'll do one lot. Exploration will be seven March. I'm just picking the same as we were before. Our put will be the seven which is a 10 delta. Our short put will be the nine. Which is a 29 delta. We're going to get about 55 cents for that. And again we on this one are two dollars wide. So we're risking a buck 45. And then Reese did not get back in terms",
    "start_timestamp_seconds": 2253.0,
    "end_timestamp_seconds": 2381.0,
    "start_timestamp": "37:33",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=2253",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "is a 10 delta. Our short put will be the nine. Which is a 29 delta. We're going to get about 55 cents for that. And again we on this one are two dollars wide. So we're risking a buck 45. And then Reese did not get back in terms of so five so I'll just pick something random in there. And then you just want to give you the stats for the portfolio. Let's go long. Let's go the 15 13. We'll do another two points wide. So five. This is 15 54. A one lot. We're going to be seven March again. And we'll be at the 13 for our long and a 13 delta. Our short put is at the 15, which is a 38 delta. And on this one we're going to make like 56 cents. So this one we're $2. Why making 56. So we're risking a dollar 44. So here's the portfolio as it said. The total risk of the portfolio. What? Switching to some product. Just want some dog. Is 429. So this in respect to our portfolio. Is we have about 8.6% total risk out. If over the course of a month. We're trying to make $400. We're trying to make a total of $400. If we look at what our total credit is so far. This needs to go from BQ. 61. 81. 81. We are way off. We still have a long ways to go. So we need to put",
    "start_timestamp_seconds": 2355.0,
    "end_timestamp_seconds": 2516.0,
    "start_timestamp": "39:15",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=2355",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "We're trying to make $400. We're trying to make a total of $400. If we look at what our total credit is so far. This needs to go from BQ. 61. 81. 81. We are way off. We still have a long ways to go. So we need to put more on. Let's do a few more. I see Rivian. So Ocenano. What do you want to do in Rivian? Could be vertical. Could be iron condor. Could be long option. Whatever you want. And then same thing for you. TCM. Would you want to put on a game stop? Because we will also need whatever that is. Put credit copy. We boys on it. We'll do another 2.5. So we'll do the 119. This real quick. I can't figure out which way I want to move it. Okey, dogs or in Rivian now. Well, 30 is our spot price. We'll be out in 7 March. Long putt is at the 9, which is a 10 delta. Short putt is at the 11, which is a 28 delta. And we are going to get like 44 cents. That gives us about 56 in risk. So far. Who 15 in credit? We're halfway there. And then TCM says ratio call diagonal. Okay, so let's see what we can make happen with that. So right now we have 11.7% of the account out. But we don't have like a tremendous amount of room to move here. So let's do a quick ratio",
    "start_timestamp_seconds": 2477.0,
    "end_timestamp_seconds": 2628.0,
    "start_timestamp": "41:17",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=2477",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "We're halfway there. And then TCM says ratio call diagonal. Okay, so let's see what we can make happen with that. So right now we have 11.7% of the account out. But we don't have like a tremendous amount of room to move here. So let's do a quick ratio call diagonal in here. We'll go out like 90 days. We'll get something like standard. Maybe a striker too in the money. So we can get maybe two of these. So for GME, which is at 2632, we'll get two of this 17 April. And the long call will be at 25, which is 62 delta. 63 delta I lied. And we are going to pay like 455. So the total cost for this position is 910. Let's figure out where we would manage risk to the downside. Let's call it at like the 24 handle 2472. Where would that put us? That'd be very, very, very, very. They said we're at. Play. What the phone was February 3. Yeah, okay. February 3. And we said that we're going to. Call the trade wrong at like 24 and a half. Let's say. So that means our expected risk is like 120. All right. Now. Let's see. Oh, yeah, we need the short call site. We'll go to seven march just like the other ones. And we'll get like something like this. 31. And we'll just do one there. Seven march. Our short call will be at the 31. Delta is",
    "start_timestamp_seconds": 2601.0,
    "end_timestamp_seconds": 2772.0,
    "start_timestamp": "43:21",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=2601",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "120. All right. Now. Let's see. Oh, yeah, we need the short call site. We'll go to seven march just like the other ones. And we'll get like something like this. 31. And we'll just do one there. Seven march. Our short call will be at the 31. Delta is 0.28. And on this, we expect to get like 90 cents. And our risk will be the same as the other. Margin is the same as the other. But you don't have to track a twice. Okay. So here's what we have right now. We're at $300. We still don't have enough in order to hit the total risk that we want. So I'm just going to go through and add a couple two lots. We just hit the risk that we need by running a few too lots. You could, you know, try to. Why the spreads or whatever. And then let's just fast forward really quick. I'm going to go to seven march where all this stuff. Most of this stuff is going to go down. And I just want to see literally how the mix happens to go. The point here, though, is that the expectation for this $5,000 account to make 2% per week, $400 in a month requires you to put on a fair number of things. Right now, in terms of total risk, there's 14% risk out. In terms of total account utilization, there's $1500 of the account out being used. Let's click through",
    "start_timestamp_seconds": 2726.0,
    "end_timestamp_seconds": 2860.0,
    "start_timestamp": "45:26",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=2726",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "this $5,000 account to make 2% per week, $400 in a month requires you to put on a fair number of things. Right now, in terms of total risk, there's 14% risk out. In terms of total account utilization, there's $1500 of the account out being used. Let's click through these really quick. And I'm just going to pretend that we flatten them. So the call. We're going to get full profit for. For the long call, which is in 17 April, we had the 25. It's now for like 230. Or Rivian. We had the 7 March 9, 11. So we get not full profit. We can let the 9 go because it's not worth anything. But we have to close this one for 27 cents. So if I. We had the 1315. That's going to be. Again, you can't take it in an expiration. You have to take it down. Let's see what it costs us to buy out of this. It's going to be about the full width of the spread. Unless you have to pay any liquidity, which you probably would, but we'll just call it the full loss of 2 bucks. Iron. We had the 7 9. So you can let the 7s go, but the 9, you have to take those down. And we get those down for let's call it a dollar 75. And Palantir. In Palantir, we had the 7375s. Those look like a full profit. So those will come down for",
    "start_timestamp_seconds": 2832.0,
    "end_timestamp_seconds": 2983.0,
    "start_timestamp": "47:12",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=2832",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "7 9. So you can let the 7s go, but the 9, you have to take those down. And we get those down for let's call it a dollar 75. And Palantir. In Palantir, we had the 7375s. Those look like a full profit. So those will come down for zero. Oops. But that in the wrong spot. So how do we do? We won on 1, 2, 3. So it's about 50% 50% wins. We lost $600. We were trying to make $420. This is the issue with this kind of approach. If you go through and you're just trying to find stuff to sell some options in, hoping that it works, hoping that it's going to position you where you want. The reality is the market is going to do what the market's going to do. And this kind of approach, unfortunately, is absolutely nothing to fall back on. If things start going haywire, and it requires them to put on a lot of things. So then the mix of what you're doing is going to step up. This is why hayprotating is so important. It's why having data around strategies is the way you decide how to size positions. So for example, if I'm trading my breakout strategy, let's look at literally a live example right now of one of those. Like I'm going to find one, not one that's on at the moment. I'm going to find one that looks reasonable. I'll do it with you",
    "start_timestamp_seconds": 2957.0,
    "end_timestamp_seconds": 3077.0,
    "start_timestamp": "49:17",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=2957",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "size positions. So for example, if I'm trading my breakout strategy, let's look at literally a live example right now of one of those. Like I'm going to find one, not one that's on at the moment. I'm going to find one that looks reasonable. I'll do it with you guys now. So the first thing I'm doing is just I'm going to scan for things that have had a gap. Also give me one sec, beer beat. All right. Let's find something that had a gap. We're doing like a 2% gap up. I'm just going to move it off, so that we can poke through and just, I'm not like going to spend a ton of time trying to find something. I just want something. Definitely not that. Literally just I'm hoping for something that looks even reasonable. Okay fine, this will do. So we have win a bago and for my kind of strategy and win a bago, we're going to pretend that there's liquidity and all that stuff. What I would do is understand the qualities of my strategy and I'll literally tell you what they are. We're like the last, I'll tell you the last duration. Okay. So the expected return for the long call strategy for a look back period is average P&L per lot is positive 78. The average loss is 640 and the average win is 663. Except right now it has a 55.1% win rate. That's for this sample of the",
    "start_timestamp_seconds": 3050.0,
    "end_timestamp_seconds": 3222.0,
    "start_timestamp": "50:50",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=3050",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "duration. Okay. So the expected return for the long call strategy for a look back period is average P&L per lot is positive 78. The average loss is 640 and the average win is 663. Except right now it has a 55.1% win rate. That's for this sample of the period. So when I put this trade on, I need to keep that into context because I know what the dynamics of the strategy currently sit at. Let's take a look. If I were to set where I'm going to consider myself wrong, I'm going to say something below this. So let's say like the 43 handle. Let's see what we could do at the 43 handle. At the 40th would a minute. What the fuck is going on right now? What the? 19. The analyze in the wrong date. Yeah, this is back in time. I was like, what the fuck is going on here? There we go. I lose 61 bucks. So I already know that my average loss is around 600. But the way that the strategy is working is I'm right 55% of the time. So it means that I'm picking things in this subset of the strategy. About 50 50 chance. Slight tilt to profitability in terms of average win and then also the win rate. If I wanted this trade to make sense for the strategy, I need to size this up somewhat. If I size it up to a 10 lot, that means",
    "start_timestamp_seconds": 3180.0,
    "end_timestamp_seconds": 3327.0,
    "start_timestamp": "53:00",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=3180",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "the strategy. About 50 50 chance. Slight tilt to profitability in terms of average win and then also the win rate. If I wanted this trade to make sense for the strategy, I need to size this up somewhat. If I size it up to a 10 lot, that means that I'm risking 68. Okay, that falls in with the average loss bucket. What is the upside target? Let's say that it's a recovery to 4763. Yes, what does that give me? 4763. That means I make 2352. So what I'm doing is I'm sizing the strategy in accordance or the trade in accordance with the strategy. And then making sure that it still fits the portfolio. So let's say that the size of the portfolio is much larger. And let's say you look at this and you say, well, the 618 is this is way too small for this specific portfolio per trade versus, you know, per contract. Then you just need to size things up. So then it actually makes $1 for the portfolio. But the main thing that I'm trying to express here is that what I'm doing is looking at the individual trade, understanding the qualities of the strategy, bidding the trade loosely to size things out, understand positioning. Then I'm saying, how does this fit within the portfolio? And does it make sense for the portfolio? What I'm not doing is saying I think WGO is going to go up and if it drops 5%",
    "start_timestamp_seconds": 3303.0,
    "end_timestamp_seconds": 3411.0,
    "start_timestamp": "55:03",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=3303",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "of the strategy, bidding the trade loosely to size things out, understand positioning. Then I'm saying, how does this fit within the portfolio? And does it make sense for the portfolio? What I'm not doing is saying I think WGO is going to go up and if it drops 5% I'm wrong and I'm going to get out. That's not what I'm doing. There's a little bit more of an analysis that's going into figuring out the actual position sizing. So any questions on any of that? To summarize the core element. Setting good expectations is your first job. Building experience is your second job. Your third job is setting targets that make sense for your skill and experience. After that, it's learning how to size positions so that they may sense with respect to the strategy that you're executing. And then making sure that it fits inside the portfolio at that size. It's a much more logical approach to putting on positions versus the haphazard random, put stuff on and then people again often wonder why there return suck. That is a primary reason. Alright. I see no questions for me. I have no questions for you. So that wraps me up for tonight. If you guys need anything, I am in the discord. Be an outlier.",
    "start_timestamp_seconds": 3396.0,
    "end_timestamp_seconds": 3499.0,
    "start_timestamp": "56:36",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=3396",
    "chunk_index": 36,
    "word_count": 218,
    "upload_date": null,
    "duration": 3502.0
  },
  {
    "video_id": "EkAxyxtD0hc",
    "title": "Why Most Beginners Lose Money - Position Sizing Explained | Outlier Options Trading Beginner Lab",
    "text": "wraps me up for tonight. If you guys need anything, I am in the discord. Be an outlier.",
    "start_timestamp_seconds": 3495.0,
    "end_timestamp_seconds": 3499.0,
    "start_timestamp": "58:15",
    "video_url": "https://www.youtube.com/watch?v=EkAxyxtD0hc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=EkAxyxtD0hc&t=3495",
    "chunk_index": 37,
    "word_count": 18,
    "upload_date": null,
    "duration": 3502.0
  }
]