[
  {
    "text": "all right what's up everybody so we um back again we got chris here um we had a chance to catch up a little bit but um first off welcome to the channel again it's great to have you back thank you appreciate it um so we were talking just a little bit about some of the things that you've been working on and some of you know what you're doing with your your channel and whatnot potentially opening up the lens a little bit do you want to share a little bit about that yeah so i recently did a video called i need your help and i basically just talked i made a video just asking my audience you know what they thought of expanding the focus of the channel to stuff that's a little bit broader than options because for the past five years my youtube channel was strictly about options trading but over the years my personal philosophy has changed and i've learned a lot myself about all these other ways to manage your money and invest and i just wanted to kind of branch out and start talking about some of those things but not necessarily a hard shift away from options just you know still doing the options stuff but having the opportunity to make videos here and there about other things so i got pretty overwhelming responses and pretty much everyone was on board with talking about other stuff and i kind of",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 0,
      "total_chunks": 57,
      "start_timestamp": "00:00:01",
      "start_timestamp_seconds": 1.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1"
    }
  },
  {
    "text": "necessarily a hard shift away from options just you know still doing the options stuff but having the opportunity to make videos here and there about other things so i got pretty overwhelming responses and pretty much everyone was on board with talking about other stuff and i kind of had validation already from that because in youtube analytics you can see uh what your audience watches so it tells you your audience watches these videos your audience watches these channels and so my audience was already watching you know stuff that i would want to talk about so broader financial topics mostly within the investing niche maybe some some personal finance stuff here in there but it all kind of ties together but yeah i decided to just go ahead and broaden the scope so rebranding from project option to project finance and like i said a lot there will still be lots of options focused content and i'll still be doing live streams which will be options focused since i'll you know be sitting there with my trading platform open talking about positions i have on right and yeah so still going to be a lot of options stuff just you know going to start sprinkling other topics in that have been exciting me and that i definitely want to make videos on just to you know help spread the word so i'm really excited about just broadening the scope and having everything under under one channel because",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 1,
      "total_chunks": 57,
      "start_timestamp": "00:01:04",
      "start_timestamp_seconds": 64.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=64"
    }
  },
  {
    "text": "stuff just you know going to start sprinkling other topics in that have been exciting me and that i definitely want to make videos on just to you know help spread the word so i'm really excited about just broadening the scope and having everything under under one channel because before i was you know contemplating having a second channel but as we know if you if you build an audience once on youtube and you have the audience on one channel and it's still similar content then it doesn't really make sense to make a second channel because you'll get way less views on those videos and then you know it's just not as efficient so and from a a focus perspective too it's really hard for me to focus on two different projects at once so i'm really happy that everyone was on board with broadening the scope and just keeping it all on one channel so long as there are playlists separating at all so people can navigate and find everything easily so yeah super excited that's awesome to hear honestly just because i i think one of like the things i have found most valuable same as you i'm 30 kind of going through a similar series of learnings and a big thing that i've started picking up is just the value of looking at other business ventures and it can be as simple as like we were just talking about like if you wanted to",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 2,
      "total_chunks": 57,
      "start_timestamp": "00:02:14",
      "start_timestamp_seconds": 134.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=134"
    }
  },
  {
    "text": "as you i'm 30 kind of going through a similar series of learnings and a big thing that i've started picking up is just the value of looking at other business ventures and it can be as simple as like we were just talking about like if you wanted to trade and then maybe have some interest rates or something like something really simple that you were trying to earn a risk free return on but we're we'll get into that in a minute you know just that's starting to look a little different it's helpful to find other things to start looking at and include into your overall i like to call just an overall wealth portfolio so um i'm actually really excited to see some of the stuff that you talk about it's something that i think especially digging into things like real estate ton there's just a ton of really really great information out there for traders that might want to be dabble and stuff like that so i think yeah i think it's really cool that you're kind of opening that that band a little bit and then the other really neat thing i think people get out of that is they get to go along that experience with you right and kind of see the stuff that you're currently interested in while you're interested in it i think there's a ton of value in that too so super super cool to hear glad glad to",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 3,
      "total_chunks": 57,
      "start_timestamp": "00:03:16",
      "start_timestamp_seconds": 196.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=196"
    }
  },
  {
    "text": "get out of that is they get to go along that experience with you right and kind of see the stuff that you're currently interested in while you're interested in it i think there's a ton of value in that too so super super cool to hear glad glad to hear that everybody was really supportive of that because i mean honestly i'm definitely looking forward to seeing your perspective on some of that stuff it was a big relief for me as well yeah i as soon as you said the two channels thanks i mean i'm i'm obviously a small channel i've got like 5 000 subscribers but still i can only imagine you know trying to like apply that effort equal effort to run another channel just as get like just as well man that would be exhausting yeah so uh yeah that's that's really good to hear so we were actually just kind of you know having a conversation and i shared a little bit of what we were discussing and it pertains to kind of like the current markets and how things are currently situated what we're seeing as traders and investors one of those things that we were talking about was some issues or really just a change of paradigm really as it pertains to returns on risk reinvestments or lower risk investments stuff like that and you were sharing your perspective on that so i actually thought it'd be cool to dive into",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 4,
      "total_chunks": 57,
      "start_timestamp": "00:04:11",
      "start_timestamp_seconds": 251.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=251"
    }
  },
  {
    "text": "things that we were talking about was some issues or really just a change of paradigm really as it pertains to returns on risk reinvestments or lower risk investments stuff like that and you were sharing your perspective on that so i actually thought it'd be cool to dive into that a little bit further and kind of see what you're seeing as it pertains to that and you know just where we're going from here well yeah i'd love to talk about that um so i'm working on a video right now that should be out this week so this is the week of the 26th um so yeah this video will be out this week but the premise of the video is talking about how this is a tricky investment environment for investors because typically you have different choices of investment products with lower risk lower returns to higher risk higher returns so lower risk lower returns would be something like a a cash position would typically be your safest position savings account would be basically cash but it's still it's earning you a little bit of return then you have government bonds or different types of bonds it could be corporate bonds um and then you go to the higher risk spectrum which is stocks uh maybe real estate you could consider higher risk and then you have stuff right now in the new age world like cryptocurrencies including you know bitcoin ethereum or dogecoin if if",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 5,
      "total_chunks": 57,
      "start_timestamp": "00:05:07",
      "start_timestamp_seconds": 307.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=307"
    }
  },
  {
    "text": "it could be corporate bonds um and then you go to the higher risk spectrum which is stocks uh maybe real estate you could consider higher risk and then you have stuff right now in the new age world like cryptocurrencies including you know bitcoin ethereum or dogecoin if if you're so inclined but the interesting thing is right now on the lower the lower end of the risk spectrum you actually you can't get positive real returns so for those who may not know real returns are when you take the return of something and then you subtract inflation so if inflation is two percent excuse me if inflation's two percent and you earn three percent then you're said to have a positive real return of one percent and if inflation's two percent and you earn zero percent so like if you have a cash position that earns zero percent but if inflation's two percent you have a negative real return because your dollars have actually lost purchasing power so your dollars next year if prices go up which is inflation then your dollars that didn't grow at all can buy fewer things and so that would mean you have a negative real return so it's it's a tricky environment right now because um wealthfront actually just sent me an email the other day and they said we're dropping the interest rate on your high yield cash account okay from 0.35 to 0.1 so if you have ten thousand",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 6,
      "total_chunks": 57,
      "start_timestamp": "00:06:17",
      "start_timestamp_seconds": 377.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=377"
    }
  },
  {
    "text": "have a negative real return so it's it's a tricky environment right now because um wealthfront actually just sent me an email the other day and they said we're dropping the interest rate on your high yield cash account okay from 0.35 to 0.1 so if you have ten thousand dollars in a wealth front cash account then you're going to earn nothing you're going to earn like 10 bucks a year which is you know and if inflation as i said if inflation is expected to be two percent which has kind of been the federal reserve's target that's the higher end of their target inflation is two percent and you earn 0.1 percent in your cash account or your savings account then it's the same problem i discussed before where you have a negative real return where prices are rising faster than that investment position and you see the same thing if you look at a 10-year bond so the 10-year bond yield is less than two percent the 30-year bond yield is just over two percent but the thing is if the 30-year bond yield is at 2.2 percent and inflation is expected to be percent or that's the target then you're barely you know you're barely keeping up with inflation in that position but right now we are kind of in uncharted territories because we have never seen so much money printing in the history of you know of our country so if you look at",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 7,
      "total_chunks": 57,
      "start_timestamp": "00:07:36",
      "start_timestamp_seconds": 456.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=456"
    }
  },
  {
    "text": "that's the target then you're barely you know you're barely keeping up with inflation in that position but right now we are kind of in uncharted territories because we have never seen so much money printing in the history of you know of our country so if you look at the the chart of the money supply it's literally like it's a straight up line over the past year and naturally if you create more units of something it dilutes the the value of each unit that currently exists and so i think right now there's a lot of high inflation fears so we're not talking about two percent inflation that's kind of the normal world expectation people are worried about you know three four five percent maybe even higher and so i think if you're an investor and you're looking at a 30-year bond which has a two and a quarter percent yield and you're expecting inflation to potentially go higher than two percent then you're not going to comfortably put your money into that position because number one you're getting paid your coupon payments back in u.s dollars and then at the end of that 30-year term you're getting your principal back in u.s dollars and if you don't trust that the u.s dollar is going to hold its purchasing power then you're not going to comfortably put your money into that position and so with the lower the lower end of the risk spectrum basically off the",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 8,
      "total_chunks": 57,
      "start_timestamp": "00:08:53",
      "start_timestamp_seconds": 533.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=533"
    }
  },
  {
    "text": "getting your principal back in u.s dollars and if you don't trust that the u.s dollar is going to hold its purchasing power then you're not going to comfortably put your money into that position and so with the lower the lower end of the risk spectrum basically off the table in terms of getting positive returns on your investments you have to look to higher risk assets such as stocks we could say real estate's in there um cryptocurrencies or something like art if you know you're you're savvy and you know how to invest in art but you basically are forced into these higher risk assets and i think when we talk about the markets you're actually seeing that fear and you're seeing that firsthand because we were talking about this before if you look at where the s p 500 was at the high before coronavirus and then you look at where it is now it's over 20 percent higher than it was when the whole global economy was open and before the corona virus started and now the world economy is not yet fully reopened but the stock market is 20 higher than it was before all the mayhem started and so i think that's partially a function of people not having any return potential in the lower risk assets and so they're basically being forced into the higher risk assets which is causing the prices to increase and the same thing with the real estate",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 9,
      "total_chunks": 57,
      "start_timestamp": "00:10:06",
      "start_timestamp_seconds": 606.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=606"
    }
  },
  {
    "text": "all the mayhem started and so i think that's partially a function of people not having any return potential in the lower risk assets and so they're basically being forced into the higher risk assets which is causing the prices to increase and the same thing with the real estate market i was looking up some data today and from january 2019 to january 2020 based on the housing index that i was looking at um the price is their price index increased like six percent from january 2019 to january from january 2020 to january 2021 that same index has increased 12 and i've experienced this firsthand because i've been looking at the real estate market in denver over the past few months and i actually started working with a realtor and i got connected with the mls system so i could see all the new listings come up and there were there were a couple properties that i favored it and they went off the market in like five days and they went for 50 to 75 000 over the asking price yep and so i think there's just there's a ton of demand to get out of cash and any cash denominated investment product like i described earlier with you pushing up asset valuations across the board on the higher end of the risk spectrum so getting back to what i think about markets i'm actually bullish on the stock market i'm actually bullish on pretty much",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 10,
      "total_chunks": 57,
      "start_timestamp": "00:11:18",
      "start_timestamp_seconds": 678.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=678"
    }
  },
  {
    "text": "cash and any cash denominated investment product like i described earlier with you pushing up asset valuations across the board on the higher end of the risk spectrum so getting back to what i think about markets i'm actually bullish on the stock market i'm actually bullish on pretty much everything that's not cash based on the monetary policy that we're seeing i think for as long as we have as long as we have the money supply increasing as quickly as it is and rates are extremely low like mortgage rates are at historic lows and you know loans you could take out you can take out loans and you can buy that house the the payments on that debt are so low and it's actually a strategic thing to take out debt right if you think the the currency is going to lose value because inflation kills debt so i don't want to be a doomsayer about hyperinflation and say that we're right behind venezuela's footsteps for those who don't know venezuela saw hyperinflation where you know their currency basically it loses 90 of its value every few months essentially it was crippling yeah yeah so that's that's what happens in a hyper-inflationary environment because people lose faith in the currency and if that's the case then people aren't going to accept that currency has payment or they're going to accept way higher units of that currency so right but anyways i don't want to be a doomsayer",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 11,
      "total_chunks": 57,
      "start_timestamp": "00:12:34",
      "start_timestamp_seconds": 754.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=754"
    }
  },
  {
    "text": "what happens in a hyper-inflationary environment because people lose faith in the currency and if that's the case then people aren't going to accept that currency has payment or they're going to accept way higher units of that currency so right but anyways i don't want to be a doomsayer i don't want to say that hyperinflation or a venezuela type event is coming for the u.s but i think that right now based on the monetary policy it is creating rapid increases in all these asset prices so as long as we have a monetary policy like we do right now then i am bullish on high risk positions so i'm bullish on stocks so what are some changes in multi and monetary policy that would make you change your thoughts well if they so right now we're in a an easy money monetary policy which basically means that they're just you know they're printing as fast as they can i think if they if they said that we are going to start contracting the money supply then that would change you know that would change the minds of a lot of investors that also we would have we would see higher interest rates because of that too because there'd be less money in circulation um but yeah i don't i don't i don't know if we're gonna see that at least in the next few years it seems it's i'm glad you bring that up honestly because that",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 12,
      "total_chunks": 57,
      "start_timestamp": "00:13:52",
      "start_timestamp_seconds": 832.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=832"
    }
  },
  {
    "text": "would see higher interest rates because of that too because there'd be less money in circulation um but yeah i don't i don't i don't know if we're gonna see that at least in the next few years it seems it's i'm glad you bring that up honestly because that like that's the one thing i've been telling people that i'm just watching like a hawk whenever i see any of the fed talking about money is to see how they're talking about printing money everybody's curious about interest rates and stuff rightfully so but i do think there's a lot of predictive capability in just production of currency one of the one of the things that um i also was talking about i was i forgot what uh what the video was but it was essentially just talking a little bit about the fed and how they've been and i'm curious to hear your thoughts on this but for me it seems like we've been in what at least eight quarters now almost where like the fed has been talking about doing something and it seems like they're kind of backing it up they're continuing on what they said that they were going to do whereas there definitely has been a period of time before that and i shared a couple examples in the video where the fed was kind of talking one thing and then pretty quickly down the line something else came out that just you know",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 13,
      "total_chunks": 57,
      "start_timestamp": "00:15:06",
      "start_timestamp_seconds": 906.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=906"
    }
  },
  {
    "text": "that they were going to do whereas there definitely has been a period of time before that and i shared a couple examples in the video where the fed was kind of talking one thing and then pretty quickly down the line something else came out that just you know shocked a few people in terms of the overall approach so i'm just curious what are your thoughts in terms of the the fed's consistency lately as it pertains to you you know we're saying we're going to do this and this is what's going to happen sort of thing it's an interesting question and i have to i have to say that i'm not by any means a macro economic expert but i have been trying to get into more of this and understand how all the pieces fit together but the main concept that i've kind of bit into recently is just the concept of if you rapidly inflate the supply of money there there aren't going to be there are going to be consequences like yeah what they're saying is we can we can just inflate the money supply and we can create all of these additional units of us dollars and there's not going to be any negative side effects which you can't you can't get you can't get something for nothing so there are there are going to be side effects and i just i think to answer your question i don't i don't see",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 14,
      "total_chunks": 57,
      "start_timestamp": "00:16:08",
      "start_timestamp_seconds": 968.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=968"
    }
  },
  {
    "text": "units of us dollars and there's not going to be any negative side effects which you can't you can't get you can't get something for nothing so there are there are going to be side effects and i just i think to answer your question i don't i don't see them reversing course abruptly because they've already gone down this path far enough and a lot of people in this space that are much smarter than i have said that they they basically have their corner they have no easy way out of this and they have to basically continue on this path because if they did reverse course abruptly that would you know that would send shockwaves through the whole financial system yeah and i think it's a it's completely accurate and something that whenever i i always like to read the minutes and and some of um some of what i was picking up is it it really doesn't seem like they're they even identify viable alternatives for what they're doing so i think that that kind of just reinforces what you were sharing you know just in terms of this is kind of what they think is the best path and that's why i'll have some people come up and just have conversations about the the fed's history in terms of continuing to execute the policy as stated and that's more or less i i think the the punch line here is that they just it doesn't",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 15,
      "total_chunks": 57,
      "start_timestamp": "00:17:10",
      "start_timestamp_seconds": 1030.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1030"
    }
  },
  {
    "text": "the best path and that's why i'll have some people come up and just have conversations about the the fed's history in terms of continuing to execute the policy as stated and that's more or less i i think the the punch line here is that they just it doesn't seem like there's a lot of really great alternatives for them to drastically switch gears too so it's like yeah it's interesting to hear um you kind of seeing the same thing so on that same vein we're kind of just talking about the markets and some of the layout on on what we're seeing one of the questions that i got in was what are some of your kind of preferred strategies for the current market for the current environment i know for myself it's definitely been doing my best to to find opportunity where i see it luckily there's been enough um volatility and things like index etfs in a lot of instances so i can kind of stay in a bigger product but still collect what i need to collect primarily sell premium like a lot of people yeah um but curious to see you know what's been working for you so the main strategy that i've been using for the past like six months i would say this this started last year too when we were deeper in the correction and kind of ascending out of the the depths of the correction is i started i",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 16,
      "total_chunks": 57,
      "start_timestamp": "00:18:20",
      "start_timestamp_seconds": 1100.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1100"
    }
  },
  {
    "text": "been working for you so the main strategy that i've been using for the past like six months i would say this this started last year too when we were deeper in the correction and kind of ascending out of the the depths of the correction is i started i started buying out of the money calls in the furthest expirations that were available and i was doing this in select names and i've actually done it in the s p 500 as well but the whole backdrop for that decision was first of all at the trough of the stock market correction and when we started to bounce off of the lows in march i was assuming that we were that we were just bouncing and we were going to see another cratering to the downside and so i started betting against the market pretty heavily and i started to burn a lot of money very quickly because i was paying all this money for these downside profit positions such as buying upside vxx calls so vxx is a volatility product and as the market goes down the vix index will typically go up and the vix index going up will bring the futures with it and vxx tracks the vix futures so vxx is essentially going to have very similar movements to vixx with some nuances but i was buying out of the money calls in vxx with the assumption that we were going to see another deep",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 17,
      "total_chunks": 57,
      "start_timestamp": "00:19:22",
      "start_timestamp_seconds": 1162.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1162"
    }
  },
  {
    "text": "up will bring the futures with it and vxx tracks the vix futures so vxx is essentially going to have very similar movements to vixx with some nuances but i was buying out of the money calls in vxx with the assumption that we were going to see another deep correction to the downside probably even lower than the lows that we saw previously and so the market kept going up and this was when the fed started to come out and you know started saying that they were gonna put all this money into the system and the markets responded very favorably to that and now i understand why is because they basically were they they call it the fed put so the the federal reserve was kind of the backstop on the market right and they would come out once a week and every time the market was down they would come out and they would say something that would re-encourage investors and so i realized that it was probably a foolish game to bet against the market and i completely flipped the cards i said i'm not going to bet against it i'm going to you know i'm going to be bullish in this environment just because it's very clear that what the government says what the fed says that's what the market's going to follow and it's more likely that they're going to come out and say stuff to you know sued the market as opposed",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 18,
      "total_chunks": 57,
      "start_timestamp": "00:20:42",
      "start_timestamp_seconds": 1242.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1242"
    }
  },
  {
    "text": "i'm going to be bullish in this environment just because it's very clear that what the government says what the fed says that's what the market's going to follow and it's more likely that they're going to come out and say stuff to you know sued the market as opposed to lead to more chaos in the markets and so i completely flipped the cards and i also started doing research on some individual stocks and i found some compelling cases for tesla so tesla was one stock that i bought out of the money calls super far out expirations just to give those positions a lot of time to work out wasn't like i was doing you know short term right you know seven day bullish calls so i was going far out in time to give myself time to be right and i was choosing kind of crowd favorite stocks such as tesla i also did one of these positions in nvidia i had one of these on an amazon which i got out kind of prematurely but i also did the same strategy in spy which is the s p 500 etf so i basically put on all these long call positions out of the money so i got a lot of leverage so i could buy a lot of contracts with the same amount of money that you could buy with um you know if you bought an in the money contracts right so if you",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 19,
      "total_chunks": 57,
      "start_timestamp": "00:21:46",
      "start_timestamp_seconds": 1306.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1306"
    }
  },
  {
    "text": "all these long call positions out of the money so i got a lot of leverage so i could buy a lot of contracts with the same amount of money that you could buy with um you know if you bought an in the money contracts right so if you buy and in the money you're gonna pay way more for it but with that same dollar amount if you go out of the money you can buy more contracts and therefore get more leverage and that's what i wanted because i you know since i was so far out in time i figured that there there was a pretty good chance that if this trajectory continued then those calls were going to make a lot of money right i had i didn't anticipate the extent of the upside movement that we saw but that strategy worked out really really well in the coming months and then i started to actually build on that strategy so instead of just buying out of the money calls and sitting on it i actually realized that if you get to a certain profit point not a specific profit percentage but if you're right on that play and your long calls that you purchase become really profitable then that means you can find higher strike call options that are trading for the same amount of money if not more than you initially paid for those long calls so for example if i buy an",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 20,
      "total_chunks": 57,
      "start_timestamp": "00:22:55",
      "start_timestamp_seconds": 1375.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1375"
    }
  },
  {
    "text": "on that play and your long calls that you purchase become really profitable then that means you can find higher strike call options that are trading for the same amount of money if not more than you initially paid for those long calls so for example if i buy an out of the money apple call for ten dollars and it goes to twenty dollars then i know there's a call option at a higher strike price somewhere that's worth ten dollars right and so if i can sell or short a call option against the one i already own but i can short it for the same premium that i paid initially for the long call or even collect more then i create a risk-free trade right and so that was a no-brainer for me and that's become my favorite strategy is to essentially buy call options you can do this on the put side as well but if you're bullish if you have a bullish assumption you buy call options and if you're right about that prediction and the stock price goes up in quick fashion and you get a really healthy profit on those calls then you can actually you can short a higher strike call and collect the same amount or more premium than you actually paid for the initial long and that creates a risk-free trade or if you collect more on the short then you paid for the long option you get a guaranteed",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 21,
      "total_chunks": 57,
      "start_timestamp": "00:23:57",
      "start_timestamp_seconds": 1437.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1437"
    }
  },
  {
    "text": "can actually you can short a higher strike call and collect the same amount or more premium than you actually paid for the initial long and that creates a risk-free trade or if you collect more on the short then you paid for the long option you get a guaranteed profit scenario and so that's that's what i've been doing essentially and another benefit of that is you are able to stay in the trade without closing it so you can stay in the trade and allow for more profit potential but it's not the same as closing the whole trade such as just selling the calls outright so a lot of people will ask me why don't you just sell the calls for the profit why'd you spread it off and it's because i can allow for more profit potential since these options or spreads at this point they have so much time until expiration if i have a risk-free call spread where i can make twice the profit that i already have on it but it has 600 days to go that's a pretty good situation in my opinion yeah one layer deeper than that is if you do that strategy so for example let's say i bought an out of the money call on tesla tesla shot up i shorted a higher strike call and i created the risk-free spread i sit on that and if tesla keeps going up then my spread will continue appreciating in",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 22,
      "total_chunks": 57,
      "start_timestamp": "00:25:02",
      "start_timestamp_seconds": 1502.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1502"
    }
  },
  {
    "text": "do that strategy so for example let's say i bought an out of the money call on tesla tesla shot up i shorted a higher strike call and i created the risk-free spread i sit on that and if tesla keeps going up then my spread will continue appreciating in value and i'll see more and more profits come in right or what can happen is tesla might crash and then that short option that i sold will have lost a ton of value and so i could buy back that short option and basically that would be sort of a wouldn't be a day trade but it would be trading in and out of that short call that initially was to remove all of my risk in the trade and if the stock price collapses after i've shorted that call then i can buy it back for a big profit and then i can i'm right back where i was right one except i've actually reduced the cost of my long calls so to speak right so i'm trying to give some numbers here so the actual trade that i did was i purchased the 900 strike calls in tesla and they had two plus years to expiration and this was when tesla was at like you know four or five hundred dollars a share so they were way out of the money then tesla shot up to eight or nine hundred it was probably like 800 and then",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 23,
      "total_chunks": 57,
      "start_timestamp": "00:26:04",
      "start_timestamp_seconds": 1564.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1564"
    }
  },
  {
    "text": "tesla and they had two plus years to expiration and this was when tesla was at like you know four or five hundred dollars a share so they were way out of the money then tesla shot up to eight or nine hundred it was probably like 800 and then i shorted the 1500 call but i paid 100 for the 900 call and i was able to short the 1500 call for 230 right so basically i i created this call spread where i had collected 13 000 for for entering a call debit spread right but it wasn't a debit because i legged into both trades but then what happened is tesla actually tanked so i was actually able to buy back this 1500 short call i bought it back for like 130 bucks which means i profited by 10 000 on that short call portion and since i made a ten thousand dollar profit on that short call and 10 000 was the initial outlay for the 900 call i effectively removed all of my risk from the trade because i did a little uh in and out trade on that short call by shorting it tesla went up and then once tesla went back down i was able to close it out and then what happened is actually tesla went back up and then i shorted it again for a higher price so one of the cool things with that strategy is that you can actually",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 24,
      "total_chunks": 57,
      "start_timestamp": "00:27:13",
      "start_timestamp_seconds": 1633.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1633"
    }
  },
  {
    "text": "went up and then once tesla went back down i was able to close it out and then what happened is actually tesla went back up and then i shorted it again for a higher price so one of the cool things with that strategy is that you can actually trade in and out of that short option that you add to the trade to remove all your risk but you actually have you're in a really good position in terms of your chess moves because if the stock price keeps going up as i said before your spread price will continue to increase and you will continue to make money on that position but if the stock price cl crashes then you can actually exit that short call position harvest some profit from it and then if you still have 600 days or whatever on your long call and the stock price goes back up you can sell it again and so you can kind of trade in and out of that short option so i think it's uh it leaves a lot of room for having a stress-free position that you can trade in and out of strategically so yeah i think there's a lot made sense i know i know i covered a lot of information there it's probably pretty confusing but yeah i think most people will probably be able to to keep up with it um especially because um for me one of my favorite",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 25,
      "total_chunks": 57,
      "start_timestamp": "00:28:23",
      "start_timestamp_seconds": 1703.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1703"
    }
  },
  {
    "text": "so yeah i think there's a lot made sense i know i know i covered a lot of information there it's probably pretty confusing but yeah i think most people will probably be able to to keep up with it um especially because um for me one of my favorite strategies is a it's a leap diagonal so it's a very similar setup to what you're talking about obviously the big difference normally is for my short it'll be a little closer um in expiration but like the way that you kind of talk about setting it up it's really beautiful to kind of give it a little time before offering that short because of exactly that benefit i think that honestly it's a really really good approach for me um i've always done kind of i guess a derivative of that where a lot of times when i'm setting up a leap diagonal the first set of shorts that i offer might be like a third of the overall position something like that so it's a similar idea i i actually i thought it was hilarious two things though when you talked about kind of the covey drop and kind of thinking that we were going to go down further so then you started buying you know and that i did the same exact thing so i had like some short pretty much i always carry some sort of short puts in iwm and it's more or less a",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 26,
      "total_chunks": 57,
      "start_timestamp": "00:29:28",
      "start_timestamp_seconds": 1768.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1768"
    }
  },
  {
    "text": "kind of thinking that we were going to go down further so then you started buying you know and that i did the same exact thing so i had like some short pretty much i always carry some sort of short puts in iwm and it's more or less a covered strangle play so i'm always modulating you know what i'm offering to that but as soon as we started rallying out of the bottom i didn't believe it so i was like well i'm not going to start adding more you know short puts here and getting you know stuck holding a bunch of positions waiting for it to unwind so i did the same exact thing i started buying leaps and then kind of again doing my leap diagonal strategy but um i i think that like exactly the the approach that you shared makes a ton of sense when there's like those really strong rallies yeah it's it's a really really good way to go i was always yeah i and i honestly commend you for being patient enough to let that happen for me i was always like i was waiting for the drop that's why i immediately put the shorts back out on top of it i was like this is going to go back down so that's like really good on you for being able to do that yeah thank you that brings up a good point and i want to clarify a couple",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 27,
      "total_chunks": 57,
      "start_timestamp": "00:30:22",
      "start_timestamp_seconds": 1822.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1822"
    }
  },
  {
    "text": "i immediately put the shorts back out on top of it i was like this is going to go back down so that's like really good on you for being able to do that yeah thank you that brings up a good point and i want to clarify a couple things too so first of all yeah you have to be patient with that strategy because you obviously need a big movement in your favor before it will be possible to create that risk-free spread second thing i want to say is that i go into those long call positions accepting the fact that i could lose a hundred percent of what i paid for the option so this isn't something where um you know if i have 25 000 in an account i might not i'm not going to put 25 000 into one long call strategy i would probably put like 10 percent of the account into it right knowing that that's a highly leveraged position that that it can even though it's a small portion of the account it can still drive super strong overall account returns right and so that's another thing is yeah with these positions it's not like um i'm not putting 100 of the account into these long call trades they make up a small portion of the overall account value right but they still they still have a lot of potential to drive really strong overall account returns and i think also",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 28,
      "total_chunks": 57,
      "start_timestamp": "00:31:16",
      "start_timestamp_seconds": 1876.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1876"
    }
  },
  {
    "text": "positions it's not like um i'm not putting 100 of the account into these long call trades they make up a small portion of the overall account value right but they still they still have a lot of potential to drive really strong overall account returns and i think also since they are a smaller portion of the account value that gives me peace of mind in being able to hold them longer whereas if you had a much larger position like you put your whole account into a long call trade and it goes you know in your favor for a few days maybe a few weeks you are probably going to be inclined to spread off that position prematurely when you can get a much better position overall if you're just a little more patient right but at the end of the day like you still need that movement in your favor i'm not gonna try to make it sound easy sure but it was just a really really well performing strategy over the past year or so yeah and then another thing i wanted to talk about is people ask me well how do you choose the stocks to do this in and it's a really hard question to answer because like i said you have to be right about that directional movement and therefore you should be putting it putting it on in a stock or company that you have a high conviction will actually move",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 29,
      "total_chunks": 57,
      "start_timestamp": "00:32:19",
      "start_timestamp_seconds": 1939.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=1939"
    }
  },
  {
    "text": "stocks to do this in and it's a really hard question to answer because like i said you have to be right about that directional movement and therefore you should be putting it putting it on in a stock or company that you have a high conviction will actually move in your favor not immediately but over the course of that trade and this is why i like to go super far out in time is that people will say well you're buying those options that are 750 days out but you're paying so much for them and i'm comfortable paying the higher premium for those longer term options because i know that it's much easier on me psychologically yeah and there's another benefit to not have to to not have to pearl that that prediction and and be 100 right about you know tesla going up a hundred dollars in the next seven days otherwise yeah and the other the the other really good benefit there too that's definitely worth mentioning is just for a lot of people if they're buying far out of the money options that expire in two weeks sure they're cheaper but theta is not doing any favors whereas once you're out that far realistically you're doing a great job minimizing the impact of theta so yes it's you know more out of your pocket up front but you have a higher expectation to at least collect something on on what you're putting out there",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 30,
      "total_chunks": 57,
      "start_timestamp": "00:33:27",
      "start_timestamp_seconds": 2007.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2007"
    }
  },
  {
    "text": "doing any favors whereas once you're out that far realistically you're doing a great job minimizing the impact of theta so yes it's you know more out of your pocket up front but you have a higher expectation to at least collect something on on what you're putting out there right and i think if and in that same vein i would i would choose companies that are pretty well known like the the companies that i've done this exact strategy in are tesla i have an open position like this in apple but this is the apple position is um it's not super successful right now but you know i um actually with the apple position i bought calls and apple went down and those calls went down 50 in value but i still had a lot of cash on the sidelines because that position was small which is what i got back to what i was telling you about before and when those options were down fifty percent what i did is i actually bought more of those contracts so i initially had five contracts bought them for nine dollars each they went to five dollars and then i bought five more contracts at five dollars each and i actually went one expiration further so these options had like 730 days at the time of entering and so now i own a total of 10 contracts but the average cost per contract is somewhere around seven to seven",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 31,
      "total_chunks": 57,
      "start_timestamp": "00:34:32",
      "start_timestamp_seconds": 2072.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2072"
    }
  },
  {
    "text": "i bought five more contracts at five dollars each and i actually went one expiration further so these options had like 730 days at the time of entering and so now i own a total of 10 contracts but the average cost per contract is somewhere around seven to seven dollars and fifty cents as opposed to nine dollars and getting back to what i said before i'm very comfortable having that position on an apple because everybody loves apple and i think also with the the upcoming 5g revolution i think apple stands to benefit immensely from that and so i'm comfortable having that long-term position on in apple let me tell you if they don't bring back the thumbprint i'm going to throw a riot because they need to bring the bumper back yeah i actually i forgot that they got rid of that i have the face id the face id phone now it doesn't even have the thumb button anymore uh-huh um but yeah so the stocks have done it in is tesla i have done it in apple but as i said my apple position is not super successful right now it's probably around break even maybe up very slightly um i have positions like this in square i did this in microstrategy which was a bitcoin related play i have some of these in nvidia um i have some in visa and i do have some in spy so when in doubt if if",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 32,
      "total_chunks": 57,
      "start_timestamp": "00:35:40",
      "start_timestamp_seconds": 2140.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2140"
    }
  },
  {
    "text": "even maybe up very slightly um i have positions like this in square i did this in microstrategy which was a bitcoin related play i have some of these in nvidia um i have some in visa and i do have some in spy so when in doubt if if you have the assumption that the market is going to go up on average each year and you're comfortable with that thesis that overall the market goes up long term then i think spy is a great product for this exact strategy because it's a very liquid product so you have tons of activity in there in the options and it's not like you're trading some penny stock where nobody knows about it and the options have no liquidity and you're just putting on these long calls just to kind of throw a hail mary so i think when in doubt if if people just stuck to the indices so spy qq iwm i think that would be you know that's a good piece of advice that i can give but other than that if you have a specific company that you're you have a high conviction on over the next one to two years then i think this strategy works nicely but as i as we talked about before you have to have a small enough position sizing where you don't care if it goes to zero so you have to be able to hold and also you have",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 33,
      "total_chunks": 57,
      "start_timestamp": "00:36:45",
      "start_timestamp_seconds": 2205.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2205"
    }
  },
  {
    "text": "next one to two years then i think this strategy works nicely but as i as we talked about before you have to have a small enough position sizing where you don't care if it goes to zero so you have to be able to hold and also you have to you know have that conviction and be patient if it does move in your favor because if you spread it off too early then what's going to happen is you're going to have a narrow call spread and if you have a really narrow call spread that has 700 days expiration it's really not going to move much right you really need all of that time decay to come out and you're basically going to have to sit there and wait for 700 days even if that spread gets fully in the money to see that spreads value increase so that's why i like waiting longer is because if you're spreading off the trade when the stock price has gone up a really good amount and you're able to get a really wide call spread that's my ideal situation so in the tesla example i bought the 900 call and then i was able to short the 1500 call so that's a really wide call spread and that's what i want for a position that has 600 days or more to go i wouldn't want to buy the 900 call and then spread it off with you know the",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 34,
      "total_chunks": 57,
      "start_timestamp": "00:37:58",
      "start_timestamp_seconds": 2278.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2278"
    }
  },
  {
    "text": "and then i was able to short the 1500 call so that's a really wide call spread and that's what i want for a position that has 600 days or more to go i wouldn't want to buy the 900 call and then spread it off with you know the the 950 call because to me that's basically you're basically just selling the option at that point but the closer is actually an interesting interesting thing to think about the closer you sell the if you're if you're going to spread a trade or you buy an option and then you're going to short an option against it the closer the short option is to your original strike the closer represents just closing the your original option because if you think about if you think about the same strike if you buy the 900 call stock price goes up and then you short the 900 call you're effectively just closing your original position right but if you shorted the 905 call you didn't close your original 900 call but you've shorted an option that's so close to your original strike that it almost represents just selling the original position right so what you can think about is the further away the strike is or the wider the spread it's basically like taking a a profit on a smaller portion of that trade if that makes any sense yeah i think and it's a good way to describe it it's similar",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 35,
      "total_chunks": 57,
      "start_timestamp": "00:39:01",
      "start_timestamp_seconds": 2341.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2341"
    }
  },
  {
    "text": "so what you can think about is the further away the strike is or the wider the spread it's basically like taking a a profit on a smaller portion of that trade if that makes any sense yeah i think and it's a good way to describe it it's similar a lot of stuff that i talk about with like the my leap diagonal approach is um like integrating deltas for that exact you know display so i think i think that makes a lot of sense for for folks um that are kind of keying and uh keying into this so you named a couple things that you've you've been trading with this strategy one of the questions that i got um was what are some products that you typically trade that you haven't favored quite as much just in the current markets and you had an interesting answer when i asked you that before so i'm curious i'm curious you know to explore that a little bit with you yeah my answer before was i've always kind of had a small universe of stocks that i've traded and products that i've traded pretty much i only trade companies that you would see in in the headlines like really well-known companies that have lots of activity in the options market um those are the companies that i trade i don't really venture off into more exotic companies that you know are off the beaten path my approach is just",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 36,
      "total_chunks": 57,
      "start_timestamp": "00:40:13",
      "start_timestamp_seconds": 2413.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2413"
    }
  },
  {
    "text": "that you would see in in the headlines like really well-known companies that have lots of activity in the options market um those are the companies that i trade i don't really venture off into more exotic companies that you know are off the beaten path my approach is just to stick to the companies that i know and not not like know them in terms of how the stocks move or stuff like that because sure obviously no one knows that but just like the companies that if you were walking down the street and you mentioned a company name any average person would know what company you're talking about those are the companies that i stick with primarily um one thing that's come to mind though is i used to trade a lot of svxy svxy is an inverse volatility product if anybody remembers xiv rip if anybody remembers xiv svxy is essentially the same thing as xiv except xiv never had tradable options xiv people just traded the shares but svxy had tradable options so i used to trade a lot of svxy however when the whole volpocalypse happened when xiv was terminated because it lost 95 percent of its value overnight they actually reduced the leverage on svxy so it used to be a negative one times leverage which meant essentially if v x x it's essentially the opposite is v x x so if v x x went up ten percent in one day s",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 37,
      "total_chunks": 57,
      "start_timestamp": "00:41:15",
      "start_timestamp_seconds": 2475.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2475"
    }
  },
  {
    "text": "percent of its value overnight they actually reduced the leverage on svxy so it used to be a negative one times leverage which meant essentially if v x x it's essentially the opposite is v x x so if v x x went up ten percent in one day s v x y would go down 10 one day right but after that whole volatility calamity i should say they actually cut svxy's leverage in half so now it's a negative 0.5 x so what's the fun in that if v x x goes up ten percent then s v x y will go down five percent and if v x x goes down five percent s v x y will go up two and a half percent see i wasn't a big fan of the the leverage cut and they actually did the same thing in uv xy too yeah uv xy was was 2x and now it's uh 1.5 so they they reduced the leverage in those products and that kind of eliminated some of the interest in it for me so these days if i'm trading a volatility product it's most likely vxx actually very recently i had a nice trade in vxx which i talked about a little bit on a live stream but um via vix the vix was at like 20 and the near-term vix futures were at like 25 and what happens is the vix futures over time will converge to whatever index",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 38,
      "total_chunks": 57,
      "start_timestamp": "00:42:37",
      "start_timestamp_seconds": 2557.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2557"
    }
  },
  {
    "text": "had a nice trade in vxx which i talked about a little bit on a live stream but um via vix the vix was at like 20 and the near-term vix futures were at like 25 and what happens is the vix futures over time will converge to whatever index that they're tracking where futures traders will say the futures will converge to spot so vix is the spot volatility vix futures are kind of the future expected volatility or what traders will have to trade if they want to trade the future and not actual spot which if you want to trade spot fix you actually can't trade it you have to trade the options which are tied to the futures but anyways vixx was at 20. the vix futures were at 25 and i was like if if the vix stays here or goes lower then these futures are going to converge down to the vix index and they're going to lose like 20 of value so what i did is in vxx i purchased a hundred contracts of out of the money puts and this was before the split i think vxx was at like 13 or 14 and i bought a hundred of the 10 strike puts in vxx for like seven cents each or 17 cents each and what happened was exactly what i said so the market was trending upwards and the vix index was trending downwards but there was such a premium in",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 39,
      "total_chunks": 57,
      "start_timestamp": "00:43:46",
      "start_timestamp_seconds": 2626.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2626"
    }
  },
  {
    "text": "14 and i bought a hundred of the 10 strike puts in vxx for like seven cents each or 17 cents each and what happened was exactly what i said so the market was trending upwards and the vix index was trending downwards but there was such a premium in the futures to the vix index that what happens is since vxx is actually tracking the basket of these near-term vix futures since they had so much value to lose to get to the vix index i thought it was extremely bearish for vxx and so i just put on this long shot put option trade in vxx and i purchased 100 contracts at 17 cents each and i ended up closing all those out for more than a dollar so that was that was a really sizable trade and that was probably the biggest winner i've had in vxx in a while but that was the first speculative trade that i use in vxx that wasn't actually a hedge because sometimes i'll use vxx and buy some out-of-the-money calls just to have some portfolio insurance sure because as we talked about earlier if the market crashes the vix index will shoot up and that'll bring the futures with it and since vxx is tracking the vix futures that means vxx will go up as well right so if you look at what happened to vxx um in the coronavirus meltdown vxx went from like 12 all the way up",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 40,
      "total_chunks": 57,
      "start_timestamp": "00:45:02",
      "start_timestamp_seconds": 2702.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2702"
    }
  },
  {
    "text": "will shoot up and that'll bring the futures with it and since vxx is tracking the vix futures that means vxx will go up as well right so if you look at what happened to vxx um in the coronavirus meltdown vxx went from like 12 all the way up to like the 80s yep and there are stories on on reddit where people made hundreds of thousands of dollars from that actually it's funny my brother had a position on he's not gonna like this he had a position on where he actually bought a ton of vxx out of the money calls and he spread off the risk way too early and he eventually got out of the position and if he would have held those options he would have made like a quarter million dollars at any at any of the prices where vxx was you know 50 plus but he i mean he did 10x his account he went from like he turned like a five five thousand dollar an account into like 25 000 so it wasn't it wasn't a 10x it was many multiples but if he would have held those options it would have been a quarter million dollar trade the good old traders hindsight man yeah but that gets back to what we said before if you if you have conviction and something happening you gotta you can't take your risk off too soon otherwise you know and that's that's not even",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 41,
      "total_chunks": 57,
      "start_timestamp": "00:46:14",
      "start_timestamp_seconds": 2774.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2774"
    }
  },
  {
    "text": "have been a quarter million dollar trade the good old traders hindsight man yeah but that gets back to what we said before if you if you have conviction and something happening you gotta you can't take your risk off too soon otherwise you know and that's that's not even options trading that's also investing in stocks like you know those headlines that say if you would have invested in an amazon 2000 and you held till today you would have turned a thousand dollars into 2.5 million or something like that but what people miss is for that one thousand dollars to go to two million you had to watch the 1000 go to 10 000 without selling and then you had to watch that that 1000 go to 10 000 and then you had to watch it go to 50 000 without you selling so the only way you get to that 2 million is if you actually had the conviction to hold the whole time and i think that's a really important concept just to throw into this conversation because that's my exact philosophy with um with bitcoin because i bought a bunch of bitcoin last year and right after the the depths of the coronavirus i didn't get to buy bitcoin at like 5k but i bought a bulk of my position at um like nine to fifteen thousand and i went into that position with a very long-term mindset and it's gone really well thus",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 42,
      "total_chunks": 57,
      "start_timestamp": "00:47:28",
      "start_timestamp_seconds": 2848.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2848"
    }
  },
  {
    "text": "and right after the the depths of the coronavirus i didn't get to buy bitcoin at like 5k but i bought a bulk of my position at um like nine to fifteen thousand and i went into that position with a very long-term mindset and it's gone really well thus far but because i bought so much of it and because it's gone up in value now it represents a really a really big portion of my overall wealth right and most people would say oh you got to sell like you got to take your profits but i went into it with a certain with a certain goal in mind which was to hold it long term and getting back to the amazon example you can't turn a thousand dollars into two million without watching the thousand go to ten thousand to fifty thousand without you know selling it out so i'm holding strong in my bitcoin position and it's it's it's deeply rooted in that exact same thought process as you know those headlines where they say you turn this into this but they don't talk about the in-between would you do you integrate any like partial profit taking because for me like i actually traded bitcoin back in like 2013 and i i held it for a while just because i like just randomly heard of it was kind of curious and as soon as i started seeing it you know four years down the line five",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 43,
      "total_chunks": 57,
      "start_timestamp": "00:48:35",
      "start_timestamp_seconds": 2915.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2915"
    }
  },
  {
    "text": "taking because for me like i actually traded bitcoin back in like 2013 and i i held it for a while just because i like just randomly heard of it was kind of curious and as soon as i started seeing it you know four years down the line five years down the line making kind of crazy moves i started pairing the position until i eventually paired myself out of it all the way but one of the things that i integrate in a lot of my trading plans is partial profit taking so you know and obviously the idea is to secure some realized gains based on risk offered and then still leaving a good portion on for future potential returns and one of the things that i also like to highlight why i've gone that way is because for everybody you know exactly like you said write the mx amazon example if you take 1k would it be you know two plus million if you held the whole time and then you know if you kind of zoom that out if you you know picked a basket of 30 stocks and did that 1 000 in all of them one of them maybe amazon maybe not too likely you know what i mean so there's also that piece to it so i'm curious if you integrate any like aspect of profit taking or you that resolute in this money's going in and it's staying there that's pretty",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 44,
      "total_chunks": 57,
      "start_timestamp": "00:49:46",
      "start_timestamp_seconds": 2986.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=2986"
    }
  },
  {
    "text": "of them one of them maybe amazon maybe not too likely you know what i mean so there's also that piece to it so i'm curious if you integrate any like aspect of profit taking or you that resolute in this money's going in and it's staying there that's pretty much what you just said so it the money went in and it's __ awesome i don't have any plans to sell it anytime soon so this is a this is a good point like that's a good argument too is that i would never look at a stock right now a publicly traded company and say this is the next amazon right but i think in the case of bitcoin i think probably like weighting the probabilities i think bitcoin has the highest probability of anything right now of being the next amazon over the next 10 plus years like long longer than that decades and i fully i also fully expect or accept sorry not expect i accept the risk that i have and if it goes to zero then i've actually i actually thought about this some people might think this is stupid but um if bitcoin were to go to zero yeah i would lose a bunch of money but i will have put money where my mouth was and i will have stood for something and i will also come out the other end much smarter because learning about bitcoin has made me learn about",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 45,
      "total_chunks": 57,
      "start_timestamp": "00:50:51",
      "start_timestamp_seconds": 3051.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=3051"
    }
  },
  {
    "text": "were to go to zero yeah i would lose a bunch of money but i will have put money where my mouth was and i will have stood for something and i will also come out the other end much smarter because learning about bitcoin has made me learn about a new technology and expand my mind and also learn about some some big macro economic topics like we've talked about with information and inflation being kind of the primary one and look into the history of currencies and and understand you know why do they do it this way and why don't we have a different approach where you know we keep the money supply the same uh i i think bitcoin overall for me has been a net positive and if i don't have a huge financial gain from it at the end of the day you know that's fine i accept the risk that i have and i'm in it yeah that's awesome it's honestly really really cool to hear stories like that um and obviously i'm i'm rooting for you i would love nothing more than to to see a you know big video about you in 10 years how you just you know bought some island and are now sailing around on a yacht that would be that would be dope i'm not the winklevoss twins unfortunately i think the the bitcoin billionaire ship has sailed yeah um and that that definitely is a important",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 46,
      "total_chunks": 57,
      "start_timestamp": "00:52:04",
      "start_timestamp_seconds": 3124.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=3124"
    }
  },
  {
    "text": "in 10 years how you just you know bought some island and are now sailing around on a yacht that would be that would be dope i'm not the winklevoss twins unfortunately i think the the bitcoin billionaire ship has sailed yeah um and that that definitely is a important part to bring in is you know it's yeah i do think it's really difficult to price something like bitcoin right some people might say well isn't it priced in and then you know you kind of ask well what what's priced in you know it's still it's still being figured out how they're going to integrate it in the economy you know i think um i think the the comparison that people always use is kind of the most common valuation metric for valuing or at least a big milestone for valuing bitcoin is people compared to gold because it has all the characteristics of gold except it's better on basically every metric with the exception of having a multi-thousand year history of being used as a store value that's really the only thing bitcoin does not have that gold has because bitcoin has all the other characteristics except for that track record well you could argue that gold has a has a physical purpose not saying that it's like that's true that's true so that's another argument too is that gold is has a physical use case whereas bitcoin doesn't have any physical use cases because it's it",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 47,
      "total_chunks": 57,
      "start_timestamp": "00:53:15",
      "start_timestamp_seconds": 3195.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=3195"
    }
  },
  {
    "text": "for that track record well you could argue that gold has a has a physical purpose not saying that it's like that's true that's true so that's another argument too is that gold is has a physical use case whereas bitcoin doesn't have any physical use cases because it's it lives in the atmosphere essentially but what i always pair with that is that that's where bitcoin's true value could be derived is from that that yeah exactly because there is no physical component to it and the privacy components to it right anyways that's an interesting way to interpret it too is that like in the us we have the us dollar and in the eu they have the euro right so there's all these currencies forms of money that are used in all these different countries and if you were to kind of zoom out on if you just think of a kind of like a international space station view of earth and you're you're watching all these countries come by and then you see you know the different currency symbols on each country yeah but then you have the bitcoin symbol which is like in the atmosphere around the whole globe so that's kind of the whole idea is that __ you just got a sales pitch right there you need to get that on a marketing thing it's it's borderless yeah maybe i should uh reach out to them and tell them to use that in",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 48,
      "total_chunks": 57,
      "start_timestamp": "00:54:22",
      "start_timestamp_seconds": 3262.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=3262"
    }
  },
  {
    "text": "around the whole globe so that's kind of the whole idea is that __ you just got a sales pitch right there you need to get that on a marketing thing it's it's borderless yeah maybe i should uh reach out to them and tell them to use that in some marketing materials but where i was going with this is people compare bitcoin to gold the market cap of gold is around let's just say 10 trillion i think it's like 9 trillion i don't know the exact figure but the market cap of bitcoin is around 1 trillion and so if you if you increase bitcoin's market cap to be the same as gold then you get 500 000 per bitcoin so that's the the winklevoss twins made a big write-up about that and that was their case and that's how they backed into the 500k per bitcoin was if bitcoin matches gold and overtakes its market cap it will be 500 per bitcoin but the interesting thing is earlier we were talking about asset prices and their performance so i this video that i'm writing that will be out this week i was actually looking at the year-to-date performance of certain assets so i looked at the s p 500 it's up about 12 year-to-date bitcoins up 84 year-to-date real estate i couldn't find a year-to-date metric but i told you earlier i was looking at real estate a real estate pricing index by the fh fa",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 49,
      "total_chunks": 57,
      "start_timestamp": "00:55:28",
      "start_timestamp_seconds": 3328.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=3328"
    }
  },
  {
    "text": "year-to-date performance of certain assets so i looked at the s p 500 it's up about 12 year-to-date bitcoins up 84 year-to-date real estate i couldn't find a year-to-date metric but i told you earlier i was looking at real estate a real estate pricing index by the fh fa federal housing finance agency and they have a single family home price index based on sales and january 19 2019 to january 2020 that index went up six percent january 2020 to january 2021 that went up 12 percent right so let's just say real estate year to date is up about 12 or like 10 sure the interesting thing is if you look at gold gold is actually not doing well at all right gold is let's see where was the uh so gold is down year to date and that's very interesting for bitcoin because a lot of people there's there's a lot of people that are big believers in gold but they don't believe in bitcoin but as i said earlier bitcoin has all the characteristics of gold except improvements in the characteristics and it's very interesting that something like bitcoin if it's up 84 this year then why is gold down and if gold is seen as a inflation hedge then why is gold down this year given what we've seen in all other asset prices and with gold being kind of like the go-to inflation hedge that's an interesting thing so yeah the argument there",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 50,
      "total_chunks": 57,
      "start_timestamp": "00:56:39",
      "start_timestamp_seconds": 3399.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=3399"
    }
  },
  {
    "text": "then why is gold down and if gold is seen as a inflation hedge then why is gold down this year given what we've seen in all other asset prices and with gold being kind of like the go-to inflation hedge that's an interesting thing so yeah the argument there is people the argument is that um bitcoin is eating gold so people are selling gold to buy bitcoin and that's why gold is down um again i'm not a macro expert and i don't know a ton about the gold market but i do think it is very interesting that giving gold's characteristics and given the monetary policy and just the the policy environment that we're seeing right now and looking at all the other asset prices year to date that everything is up except for gold right yeah it's honestly that's a really interesting perspective i can't say that something i've personally thought about much is kind of the relationship between bitcoin directly and that's it's a really good question because right i've heard a lot of people speculating on you know a lot of people are moving from things like gold into real estate with rates being as low as they were and things like that but i think i honestly think there's a really good argument to say something like bitcoin could absolutely be starting to take away a good portion of you know gold's quote-unquote market share as people are kind of starting to adopt",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 51,
      "total_chunks": 57,
      "start_timestamp": "00:58:07",
      "start_timestamp_seconds": 3487.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=3487"
    }
  },
  {
    "text": "as low as they were and things like that but i think i honestly think there's a really good argument to say something like bitcoin could absolutely be starting to take away a good portion of you know gold's quote-unquote market share as people are kind of starting to adopt that kind of thing i yeah that's a really really curious curious question so i'm not you know like i said i'm not an expert on that but i do think it is very interesting that based on our conversation earlier of you know where do you put your money if you're trying to hide from potential high levels of inflation yeah and we've seen all these other asset prices increasing exponentially and it seems like that's happening uh it seems like that's happening because you can't you don't have any real returns in these low-risk assets you would think that gold would be up this year right you would think gold would be up 10 to 15 this year uh based on what we've seen in all the other assets and based on the the monetary policy environment but that's not the case so i think it is very interesting yeah no it's super curious that's actually really good good note to to end off on too because i think um i would i would be curious to hear what other people think about that yeah we have any yeah any gold experts watching if we have any gold",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 52,
      "total_chunks": 57,
      "start_timestamp": "00:59:22",
      "start_timestamp_seconds": 3562.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=3562"
    }
  },
  {
    "text": "interesting yeah no it's super curious that's actually really good good note to to end off on too because i think um i would i would be curious to hear what other people think about that yeah we have any yeah any gold experts watching if we have any gold experts watching they're probably oh they're probably like right they're probably like six beers deep right now um yeah they're probably they're probably not happy with this conversation but i would be super cute i honestly have i'm not a gold hater i just think um yeah i don't know i think i think bitcoin is a much more elegant solution and i think for me too another thing to think about is that in bitcoin they say not your keys not your bitcoin right so what that means is that if you're not self-custing your bitcoin private keys like you don't have a hardware wallet where you're storing your private keys you're not keeping that safe then it's you actually don't own the bitcoin so if you're keeping your bitcoin on an exchange like coinbase technically they are the ones that are holding the keys to your wallet and therefore you don't really own that bitcoin the same thing is true for gold i've actually looked into buying gold historically and the only true way to really own gold is to buy physical bars of gold right and put it in a safe in my closet yeah it seems",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 53,
      "total_chunks": 57,
      "start_timestamp": "01:00:27",
      "start_timestamp_seconds": 3627.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=3627"
    }
  },
  {
    "text": "therefore you don't really own that bitcoin the same thing is true for gold i've actually looked into buying gold historically and the only true way to really own gold is to buy physical bars of gold right and put it in a safe in my closet yeah it seems that seems seems like way more of a pain in the ass than um having bitcoin and having you know these little salt key or something yeah these little usb drives i tell you what man if you wanted to make a you know build a bed frame out of bitcoin kizo that's not going to do it so you need you need the gold bars man yeah i guess so i don't know man it's a very interesting thing so it's like yeah you want to physically actually hold the gold then you got to actually buy the physical thing because if you buy something like gld you actually don't you have kind of a paper receipt for gold but like like i said if the gold is not in your possession then technically you don't really you don't really own it so right it just seems like uh comparing bitcoin to gold in terms of custody it's it's much more of a pain in the ass to actually hold physical gold absolutely and then you also have the you also have the liquidity issue you don't even exactly like now now you have your you know closet full",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 54,
      "total_chunks": 57,
      "start_timestamp": "01:01:33",
      "start_timestamp_seconds": 3693.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=3693"
    }
  },
  {
    "text": "comparing bitcoin to gold in terms of custody it's it's much more of a pain in the ass to actually hold physical gold absolutely and then you also have the you also have the liquidity issue you don't even exactly like now now you have your you know closet full of gold and you're like well i want some money for that take me it would take me multiple days if not weeks to actually convert that into to a different medium of exchange absolutely whereas bitcoin you can settle any basically any transaction value i could literally move a billion dollars or send a billion dollars with a bitcoin across the whole globe and you know it could be final settlement in less than an hour yep so you know that's that's pretty compelling the fee might be a little brutal but the liquidity will be there no yeah for sure yeah so anyways yeah super super good to connect with you again being sensitive time as always you know it's a pleasure to kind of just talk a little bit about what we're seeing now it's yeah it's fascinating man there's a lot of really curious things going on it's really good to hear you know the direction that you're kind of taking your brand i'm excited to see you know what that turns into and follow along and then as always thanks for coming on looking forward to chat with you again sometime yeah i'm super excited",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 55,
      "total_chunks": 57,
      "start_timestamp": "01:02:41",
      "start_timestamp_seconds": 3761.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=3761"
    }
  },
  {
    "text": "on it's really good to hear you know the direction that you're kind of taking your brand i'm excited to see you know what that turns into and follow along and then as always thanks for coming on looking forward to chat with you again sometime yeah i'm super excited thanks for having me and yeah like you said really nice chatting and let's do it again at some point all right man take care",
    "metadata": {
      "video_id": "EMzsNLXZ1bc",
      "title": "Chris from projectfinance Pt2 | Money Talks",
      "url": "https://www.youtube.com/watch?v=EMzsNLXZ1bc",
      "upload_date": "2021-04-27T02:18:21Z",
      "duration": "PT1H4M6S",
      "channel_name": "",
      "description": "Chris and I connect on the current markets and discuss some opportunities we're finding. \n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris and I connect on the current markets and discuss some opportunities we re finding. Stay in touch. Twitter   Instagram    esInvests \nDiscussion Question Submission  \nFB Group",
      "chunk_index": 56,
      "total_chunks": 57,
      "start_timestamp": "01:03:44",
      "start_timestamp_seconds": 3824.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EMzsNLXZ1bc&t=3824"
    }
  }
]