[
  {
    "text": "Make it a habit. One of the best possible ways to make meaningful progress on things is to tie it to something that you already enjoy doing regularly. Motivation is utter bullshit. It doesn't last. It comes in. It goes. It cannot be relied on if you're trying to make meaningful progress in something. However, consistency is one of the most underappreciated superpowers that exist. It's how I've made the progress that I have. I don't do anything spectacular, but I do things moderately well, super consistently. Make it a habit. It's a super power. Be an outlier. See you all later.",
    "metadata": {
      "video_id": "ErVmL1U0qpU",
      "title": "It’s a SUPERPOWER #investing #trading #stockmarket",
      "url": "https://www.youtube.com/watch?v=ErVmL1U0qpU",
      "upload_date": "2023-02-20T01:01:55Z",
      "duration": "PT36S",
      "channel_name": "",
      "description": "📩Join the Outlier Insights Investing Newsletter:  https://www.esinvests.com/contact\n🌍Shorten the Learning Curve and Create Your Edge. Join on Patreon: https://www.patreon.com/erik_esinvests\n\nRESOURCES:\n►1 on 1 Coaching: https://www.esinvests.com/coaching\n►Options Omega Backtesting: https://optionomega.com/register/esinvests\n►Benzinga Pro - Get 35% Off using Promo Code esInvests35: https://benzinga.sjv.io/esin\n►Grab Some Outlier Merch: https://www.bonfire.com/store/the-outlier-store/\n\nSOCIAL:\n►Follow on Twitter for Investing News & Stock Market Updates. https://www.twitter.com/esInvests \n►Join the FREE Outlier Community Discord.  https://discord.gg/hYGZUEJpve\n\n VIDEO DETAILS:\n#investing #stockmarket #trading \n\nABOUT:\nMy name is Erik, I'm a Marine veteran and self-made millionaire investor. I've spent over 30,000+ hours honing my craft and outpaced the market for the last 15 years. My goal is to share quality information and connect others to resources - without the BS. \n\nThe Outlier Community is built to connect you with other driven people who are pursuing or have achieved financial outlier status. We get together to capitalize on the hive mind to share ideas, explore stock market news, cover investing basics, options trading, portfolio management, investing psychology, strategy, money management, live trading ideas, workshops, and more. None of us find success solely on our own - here we create it together. Welcome to the Outliers!\n\nI am not a financial advisor. All content is shared for educational and entertainment purposes only.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 1,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ErVmL1U0qpU&t=0"
    }
  }
]