[
  {
    "text": "What's up everyone welcome back to the outlier podcast. I have a new friend with us. This is actually the first time I'm having the opportunity to meet options with Davis, but welcome to the podcast man. Thanks for coming to hang out for a little bit. Thanks for having me very happy to be here. Absolutely cool and I'm really excited to talk to you. This is kind of one of the beautiful components of technology is the fact that right now you're over in Singapore. I'm here in California and we're able to have a pretty low latency conversation, which is really sick. But yeah man so typically in the beginning of the day before we started I like to just get a bit of background right so specifically I would love to hear a little bit about how you got interested in trading and then the other piece to that is how you got specifically interested in trading options because that's an uncommon offshoot for most of us so I thought we start there. Sure so I started trading sometime back in 2005 2006 I was 24 I was doing my university days and I remember going to the bookstore one day and came across this book about financial freedom right so I was very interested so I bought the book and one of the vehicles that they mentioned is to use trading right so I got very interested in trading and started to get you know",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 44,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=0"
    }
  },
  {
    "text": "to the bookstore one day and came across this book about financial freedom right so I was very interested so I bought the book and one of the vehicles that they mentioned is to use trading right so I got very interested in trading and started to get you know as many books as I can. Remember attending this seminar whereby it was co hosted by a broker and some education company and this education company I think was selling some kind of a software where there was this trading signal buy and sell like a bot kind of thing so I remember he was calling out to the audience to just shout out some stocks right so the audience was shutting out the stocks and then he would show the stock on his screen and show the buy sell signal and it was like almost every stock that the audience caught up. So I was a winner so I kind of thought that you know I had to get this but so that was my first introduction to this so I remember it was pretty expensive but especially I was a university student so I had to take up you know part time jobs and I had to work extra shifts just so that I could you know making out to afford that system and also fund my first account so I remember funding my first account and then trading using the system and of course you know it",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 44,
      "start_timestamp": "00:00:56",
      "start_timestamp_seconds": 56.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=56"
    }
  },
  {
    "text": "you know part time jobs and I had to work extra shifts just so that I could you know making out to afford that system and also fund my first account so I remember funding my first account and then trading using the system and of course you know it always works well during the presentation but never in group. So I was like, I'm not going to go live right so what I found out later on is that this system kind of repaint so I decided that you know I don't think this is the way that it should be so I started to dive more into trading reading other books and I came across this book on options trading and I go very interested and also at the part time. I had a few books but the one that really got me interested was get rich with options I think was probably low well and yeah and because I was doing finance right it kind of interested me right especially with the probabilities and numbers so I started to open an account with think of stream and back then they weren't bought over by TD Ameritrade yet right and yeah so I funded their account as well and I remember I was asking for lower rate of trading. I was asking for lower commissions because back then it was much more expensive right they had this ticket fee at the start and then public is cheaper so",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 44,
      "start_timestamp": "00:01:54",
      "start_timestamp_seconds": 114.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=114"
    }
  },
  {
    "text": "right and yeah so I funded their account as well and I remember I was asking for lower rate of trading. I was asking for lower commissions because back then it was much more expensive right they had this ticket fee at the start and then public is cheaper so I remember I had to ask lower the commission and it was one of the founders of of think of stream back then they actually replied. Can you remember was it Tom source novel was it one of them. Oh I see you didn't know which one yeah yeah yeah yeah so he told me that he would be willing to give me a commission public so it was like very happy about that very appreciated because it makes things so much better. So I started to get into options trading and I went to all the webinars that they have all many of the webinars so for me was past midnight my time so I was still up late just to attend their webinars download their training because options can be quite complex right definitely much more than outright trading so I started to plan my very first year remember my very first trade was a boot with spread on Google and Google was about back then was about 400 to 400. So the first trade was winner I got hooked and I started to you know keep trading and at the point of time I would say that",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 44,
      "start_timestamp": "00:02:44",
      "start_timestamp_seconds": 164.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=164"
    }
  },
  {
    "text": "remember my very first trade was a boot with spread on Google and Google was about back then was about 400 to 400. So the first trade was winner I got hooked and I started to you know keep trading and at the point of time I would say that I'm doing pretty okay for university student I was making maybe a thousand or two you know each month and I thought that you know this is something that I want to do right I'm going to graduate not get a job just do options right but of course you know thanks never turn out the way you wanted to because I place the trade that pretty much block my account right so I'm going to do that. So I still remember it was on OEX OEX and it was the prime crisis so the market had came down quite a bit yeah crash and I put on this trade where the construct was about 99 right wind rate and I thought you know I mean 99 to make a few hundred bucks in a few days what could happen pretty much a done deal but you know as a Murphy's law will have it anything that can go wrong will go wrong with the market. So that's kind of what happened right the problem with that trade is that I pretty much reached the whole account because I didn't think that you know it was possible kind of go",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 44,
      "start_timestamp": "00:03:43",
      "start_timestamp_seconds": 223.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=223"
    }
  },
  {
    "text": "Murphy's law will have it anything that can go wrong will go wrong with the market. So that's kind of what happened right the problem with that trade is that I pretty much reached the whole account because I didn't think that you know it was possible kind of go over confident at the point so I remember after I placed the trade I think was the next day or so the news came out that the sub prime crisis had spilled over to the Europe side and remember looking at the screen the market continued to tank even further way past my construct and I was losing a lot of money and I was like I didn't accept the risk at the point of time because I was going to be a little bit more careful. So I think it was just a very big mistake so I panicked and I just closed up my trade earlier than I should and thinking I could save you know some money but the ironic thing was that if I helped to exploration it would have been a it would have expired worthless but you know it could easily work out the other way as well where you know could have blown out the whole account. I realized that you know I didn't know as much about options as I thought I did I think couldn't do this full time after I graduated so this when I started to dive more about",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 44,
      "start_timestamp": "00:04:41",
      "start_timestamp_seconds": 281.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=281"
    }
  },
  {
    "text": "other way as well where you know could have blown out the whole account. I realized that you know I didn't know as much about options as I thought I did I think couldn't do this full time after I graduated so this when I started to dive more about you know risk management learn a little bit more yeah that's pretty much how I got started in options. Yeah man I I laugh a lot because the story about your high probability trade that you put on an OEX it's essentially the same thing I did in rut I had a really wide iron condor and I started trading a little bit after you actually started trading in 2007 but that was the largest percent drawdown on my account and. What made your story hit even closer to home is exactly like you I exited the trade it was like a 30 plus percent drawdown on the account which is the biggest drawdown I've ever had which better than some people but still like that's a lot of money to just evaporate and I closed it and I was like okay I got to get it together and then dude it's the same thing it was a short term trade and sure a shit if I just left it alone but would have been what I'm telling you dude so it's so funny to hear it it's like literally the same thing. We had the same exact experience which",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 44,
      "start_timestamp": "00:05:41",
      "start_timestamp_seconds": 341.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=341"
    }
  },
  {
    "text": "dude it's the same thing it was a short term trade and sure a shit if I just left it alone but would have been what I'm telling you dude so it's so funny to hear it it's like literally the same thing. We had the same exact experience which then leads me to be super eager to understand the way that you reacted that experience so after you had your you know your oh shit moment this is not going is I thought it might how did you react to that and then what did you do to navigate around it. Yeah so I realized that you know risk management was a very big part and that I had to really understand more about trading that's what I thought so the next thing I did was I thought I graduated I wanted to get a job as a trader that's what I thought that you know is the best way for me to learn about it you know so I managed to get a job at a proprietary trading firm and from there I learned even more about you know risk management. So from there, that kind of, I would say really gave me quite an eye opener as to, you know, how professional traders really trade. Yeah, so pretty much that's it. After that, I went to the platform, did that for a while, and then from there, I would say the risk management part, I kind of",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 44,
      "start_timestamp": "00:06:39",
      "start_timestamp_seconds": 399.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=399"
    }
  },
  {
    "text": "would say really gave me quite an eye opener as to, you know, how professional traders really trade. Yeah, so pretty much that's it. After that, I went to the platform, did that for a while, and then from there, I would say the risk management part, I kind of pretty much kind of was able to navigate the market more safely compared to before because it was, the pro firm was very, what is the word, very sharp on risk or very hard on risk, right? If you had a loss limit for that day, you had to actually stop trading closer all your position and stop for the day, right? And the person next to you, he has to also know that if you had lost limit, he has to make sure that you stopped trading for the day. And there was this, one of the, the, the thing that happened at the pro firm was the very first day where I was there. I would say that's the most momentous occasion, so to speak, whereby it's not because I was still, it was the first day there, but rather the senior trader there actually got fired on the very first day I was there. And the senior trader had been there for quite a while and he was actually profitable, but he was fired because he made a very big mistake whereby he let a losing position go way past what it should be. So I remember",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 44,
      "start_timestamp": "00:07:58",
      "start_timestamp_seconds": 478.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=478"
    }
  },
  {
    "text": "the very first day I was there. And the senior trader had been there for quite a while and he was actually profitable, but he was fired because he made a very big mistake whereby he let a losing position go way past what it should be. So I remember that day, he was stuck in this position, then we didn't know exactly what happened, but the boss had all this screens in his room where he knows every trader's PNL. So what happened that day he came out of his room and he was just standing there and staring at one trader at the end. And it's very rare that the boss actually comes out of his room, right? So we knew something was not right. So he was staring there and then he just shouted over to the senior trader and just said something like, you know, when are you going to get out? So the senior trader was just saying soon, he just said the word soon. So the boss was saying, okay, you said soon, the boss went back to his room and a few minutes later, the boss came out again and it was a very big guy, big towering guy. So you know, you don't want to mess with him. And he started to hold vulgarities at the guy and told him to get out of his seat, get out of his seat and he sat in his place and exited his position for",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 44,
      "start_timestamp": "00:09:10",
      "start_timestamp_seconds": 550.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=550"
    }
  },
  {
    "text": "very big guy, big towering guy. So you know, you don't want to mess with him. And he started to hold vulgarities at the guy and told him to get out of his seat, get out of his seat and he sat in his place and exited his position for him. So you know your job as a trader is done. If you know, the boss have to sit at your seat, exit your position for you and then the boss told him to, you know, get out that day. So there he was that day, you know, I was a bit shocked because he is a profitable trader who had been there for many years, but because of one mistake, right? He didn't add her to his loss for that day. He got fired. And after that, there was even this talks whereby the boss wanted to implement some sort of system whereby if we hit the loss limit for the day, there'll be sirens that goes off so that he will alert people beside you and those people beside him have to make sure that he stops trading for the day. But that's pretty much, you know, how the risk is very important for the firm. Yeah, well, I think that that's really cool too because it highlights obviously a very thoughtful approach to learn about trading, right? Because you're like, this is what I want to do. I obviously need to learn more because a lot of",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 44,
      "start_timestamp": "00:10:00",
      "start_timestamp_seconds": 600.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=600"
    }
  },
  {
    "text": "the risk is very important for the firm. Yeah, well, I think that that's really cool too because it highlights obviously a very thoughtful approach to learn about trading, right? Because you're like, this is what I want to do. I obviously need to learn more because a lot of people I find that get into trading, they'll make a mistake like that. And then they'll just somehow think it'll be different in the future. And I think people sometimes forget that if you trade like that where you personally have to make every single mistake sooner or later, you're going to blow up. Like there's only so many mistakes that you can get your way through. That experience at the prop firm is really interesting to me. I have two follow-ons. The first one is based on that happening your very first day. Always your impression. What were you thinking as you were sitting in your desk watching this thing happen? Yeah, that I better not have the same thing happen to me. Otherwise, I'm going to get fired. But the funny thing was that later on after I got my account, so when we started out, we wouldn't have our own account, right? We have to trade the company's account. We have to show and prove that we are consistent before we get the account. So after I got my account, I think it was only just the beginning few months. I got into a very similar position",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 44,
      "start_timestamp": "00:10:55",
      "start_timestamp_seconds": 655.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=655"
    }
  },
  {
    "text": "have our own account, right? We have to trade the company's account. We have to show and prove that we are consistent before we get the account. So after I got my account, I think it was only just the beginning few months. I got into a very similar position as that senior trader. And should we remember, oh, oh, I better stop trading for the day. So once I had the loss limit hit for the day, I quickly closed my trade. So one thing also is that my mentor, so every junior trader there always have senior traders kind of like overlooking them. So my mentor was this senior trader who was very good at risk as well. So I learned quite a bit from him. So once this loss limit hit for me, I remember I had to close up my trade immediately. And then I went straight to the boss's room. Instead of waiting for him to come to me, I went to him. So I went to him and then I told him that boss, I hit the loss limit for the day. So I'm here. So I remember the boss was saying something to me, like, I'm glad you came. I was actually wondering when you would come to me. So I was a sigh of relief because he was waiting. So then he asked me, could you have done anything? Could you have done it better? So I thought to myself, that is",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 44,
      "start_timestamp": "00:11:59",
      "start_timestamp_seconds": 719.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=719"
    }
  },
  {
    "text": "me, like, I'm glad you came. I was actually wondering when you would come to me. So I was a sigh of relief because he was waiting. So then he asked me, could you have done anything? Could you have done it better? So I thought to myself, that is a question. I'm not sure is it a test or to see my honesty. So I thought to myself, no point smoking came. So I told him that yes, I could have done better if I could have existed at market. But instead, I didn't want to exit the market. I wanted to queue in order to get a lesser loss. But I had a plan, right? If you didn't take me out at my limit order, I would just cut. So you went further south, so I cut it. And I told my boss that I couldn't have cut off earlier, but I didn't because I didn't want to lose that much. But with that said, I did try to cut off after that. So the boss said, I'm glad you make that decision because I'm still waiting for the other traders to come in. So he showed me on his screen that there were other people in the same position. So I didn't feel that bad after that. So then he went on to say that you will have days like this and that managing it like this right now will help you in the long term. And",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 44,
      "start_timestamp": "00:12:57",
      "start_timestamp_seconds": 777.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=777"
    }
  },
  {
    "text": "on his screen that there were other people in the same position. So I didn't feel that bad after that. So then he went on to say that you will have days like this and that managing it like this right now will help you in the long term. And then he posted it to say, stop trailing for the day, but you can watch a movie. So in the pro film, you have one screen that you could do have to trade, you can just relax. So yeah, pretty much that's how I kind of handled the reason for that. Yeah, that's massive. And what a great infrastructure to, because that really promotes just a great environment to learn in that you weren't punished for going to him. You were essentially rewarded. And I think that that gives you massive, positive reinforcement to make hard decisions. It's like a big thing that we do in the military as well is in the military make tons of really difficult decisions. And a lot of them, they all have bad outcomes. It's just like, which is the better bad outcome for me? And if you have really good leadership that will help you acknowledge the fact that, yeah, like this was a bad outcome. It was going to be bad. But you made the right decision with what you had. That's massively, massively influential. I could see how positive that can be on your longer term trade and career. How long",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 44,
      "start_timestamp": "00:14:01",
      "start_timestamp_seconds": 841.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=841"
    }
  },
  {
    "text": "help you acknowledge the fact that, yeah, like this was a bad outcome. It was going to be bad. But you made the right decision with what you had. That's massively, massively influential. I could see how positive that can be on your longer term trade and career. How long did you stay at the pro firm for? And what was some of the bigger pieces that you took away beyond risk management while you were there? I was there about, I had told her about four years or so. And the biggest pieces, I would say, would be really, really only the incidents about managing risk, because the way that we trade is pretty straightforward. And that profits will come. The profits are always smaller than the losses. So the losses will always be something that you need to know how to manage. And also being very honest with yourself. That's one thing I found out. Because a lot of time people might tell that some certain stories to make themselves feel better. So one of the other things that happened at the pro firm was there was another trader that joined around the same time as me. What happened was that he also got fired but for another reason. Because he had a losing stock that he had a very big loss on. But on his screen, we would have all the stocks where it's shown on our screen. But the boss one day came out of his",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 44,
      "start_timestamp": "00:15:03",
      "start_timestamp_seconds": 903.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=903"
    }
  },
  {
    "text": "happened was that he also got fired but for another reason. Because he had a losing stock that he had a very big loss on. But on his screen, we would have all the stocks where it's shown on our screen. But the boss one day came out of his room at the end of the training day and went over to his screen. And he was not at his screen. So he took a look at his screen and couldn't find the stock that was losing a lot of money. Because on his and on his risk monitor, he saw that this trader had a huge loss on a particular stock. And for us, we usually put all the stock on the screen so the boss can actually see it. But on his screen, the stock was missing. So he was wondering what's happening. So he's asking the tech team, is there something wrong with this risk monitor? Only later on to find out that this trader actually removed the stock from the screen to show that everything is nice. And because of that, the boss fired him. Because it was like painting a picture like not really being honest with himself. So from that day on, yeah, I kind of felt that the first thing is always to be really honest and risk management. Yeah, yeah, that makes a lot of sense. It's been, it's so funny too, because you think about like what a juvenile move on",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 44,
      "start_timestamp": "00:16:13",
      "start_timestamp_seconds": 973.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=973"
    }
  },
  {
    "text": "honest with himself. So from that day on, yeah, I kind of felt that the first thing is always to be really honest and risk management. Yeah, yeah, that makes a lot of sense. It's been, it's so funny too, because you think about like what a juvenile move on that person's behalf as if the dude can't see it in the office, right? Like the dude can see the accounts. So it's just, yeah, that's I could totally see why he would fire him. So you were crop from trader for four years. And when you made the transition after that, what was next? Yeah, so after that, I started to do trading on my own. Pretty much, yeah, all the way on my own. I did. Yeah, the transition was quite tough, I would say, in a sense, because studying of you were trading with the firm's money, right? And even though it was a loss, it was still the loss of the firm. But when you start to trade on your own, right? The loss affects you much, much, much more, especially psychologically. So during that time, although I've, you know, built up quite a sizable capital back then, also because of the profits I made from the firm, but I also went to do some, you know, like a side hustle kind of thing. So at least I still have, you know, I'm not fully reliant on just options trading. But yeah, after that, I did",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 44,
      "start_timestamp": "00:17:14",
      "start_timestamp_seconds": 1034.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1034"
    }
  },
  {
    "text": "back then, also because of the profits I made from the firm, but I also went to do some, you know, like a side hustle kind of thing. So at least I still have, you know, I'm not fully reliant on just options trading. But yeah, after that, I did it for a while. I grew my confidence, my account size, gradually grew. Talk to me about, talk to me about like the tools that you took from prop trading into your own trading. Yeah, so basically one thing I found about prop trading when I was there is that nobody really uses technical analysis. There was no talk about hidden shoulders pattern, no candlestick, no, it's all about looking at price levels. So that's how I kind of took my approach in options trading whereby, you know, instead of looking at all this technical analysis stuff more towards price levels, and then just using the probabilities to play out to trade. And the other thing is also looking at risk first. So a lot of times, you know, what I found out, especially through some of my YouTube audience, whether email me, a lot of times they focus on, you know, what they want to make first, right? The premium to receive and they decide their position size based on how much they want to make. And they don't really look at, you know, the risk. So I would take the opposite approach. I would look at risk first,",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 44,
      "start_timestamp": "00:18:21",
      "start_timestamp_seconds": 1101.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1101"
    }
  },
  {
    "text": "you know, what they want to make first, right? The premium to receive and they decide their position size based on how much they want to make. And they don't really look at, you know, the risk. So I would take the opposite approach. I would look at risk first, rather than, you know, the see how much you make. Yeah, yeah. That's absolutely awesome. It's funny too because that's just so common for all of us. I mean, think about even, you know, one of the first books you read that got you interested in options trading, right? Get rich with options or trading options, right? It's like, obviously we're focusing on that part. That's huge, I think. So focusing on the risk side is a big part. Talk to me in terms of the specific strategies you would use from prop trading into personal trading and like the specific products. So obviously you're analyzing more so just through price levels and you're using the options, change themselves to decipher probabilities and things like that. Talk to me about like strategies and products. Yeah, so the strategies that I'm trading in my portfolio are a number of strategies, right? I would say I would group them between growth and income. So growth strategies are more like, you know, leaps slightly more longer term. I would even categorize a real strategy also, growth plus income because when I get a sign on the stock, I actually hold them rather than",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 44,
      "start_timestamp": "00:19:33",
      "start_timestamp_seconds": 1173.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1173"
    }
  },
  {
    "text": "I would say I would group them between growth and income. So growth strategies are more like, you know, leaps slightly more longer term. I would even categorize a real strategy also, growth plus income because when I get a sign on the stock, I actually hold them rather than immediately sell the cover call, right? So I'll hold them until it goes up before I sell the cover call. And then for the income side, I would have strategies like strangles, you know, jade lizards, racial spreads and butterflies. Yeah, got it. And so talk to me about how you split your portfolio between those two. Yep. So generally it's more towards growth just because of the size of the underlines that I'm trading. So they're much more expensive. So in order for you to get a sign, you do need more capital. So I put much more towards there on 60 plus percent. And then to the income side, the remainder got it. And when you're trading stuff like the wheel, for example, I have a bunch of material because I trade a slate variant of it's called a coverage strangle. So it's similar in context, but a slightly different methodology. Talk to me about the way that you run the wheel. Specifically, you were talking about one part that I want to hone in on, which was that when you take a sign man, that you obviously try to wait for it to show a profit before,",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 44,
      "start_timestamp": "00:20:44",
      "start_timestamp_seconds": 1244.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1244"
    }
  },
  {
    "text": "slightly different methodology. Talk to me about the way that you run the wheel. Specifically, you were talking about one part that I want to hone in on, which was that when you take a sign man, that you obviously try to wait for it to show a profit before, you know, either sell calls or take your asset. How do you manage something where you're trading the wheel in, you sell your short put, you get assigned, and then the underlying just continues down. Sure. So this actually happened back in the COVID as well as 2022. So first of all, when I choose the underlines for the real strategy, for me, I tend to choose what I think are fundamentally sound companies. That means I do not mind actually holding them for the long term. So these are companies where they are profitable. And, you know, at least they have been around for a number of years. Right. I want to see that they have at least survived some of the major crashes. Like, for example, financial crisis, 2007, 2008, and even pandemic. So these are the stocks that I journey tend to choose. And then I will take a look at their valuation. Right. So there are many sites for this. Right. So I'll just go to the sites and all of the valuations, I'll just kind of pick the most conservative one. And that's where I'll start to plan getting into the wheel. So the way",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 44,
      "start_timestamp": "00:21:55",
      "start_timestamp_seconds": 1315.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1315"
    }
  },
  {
    "text": "take a look at their valuation. Right. So there are many sites for this. Right. So I'll just go to the sites and all of the valuations, I'll just kind of pick the most conservative one. And that's where I'll start to plan getting into the wheel. So the way I treat the wheel slightly, maybe different than the conventional wheel trading wheel, whereby I would have an allocation to the stock. Like if I want to allocate to this stock, maybe I can put on, say, based on my size, I can put on four cash to cut put. For example, but instead of going all four cash to cut put at one level, what I'll do is that I will stagger in the entry. So enter them in trenches. So enter them below the valuation. And then I'll speed them up into the, you know, four different. So this way as the market goes down, right, at least, you know, I won't all be hit all at once. Right. So if I had hit all at once, then I'll be holding on to the stock for a long time because I may not even be able to sell a cover call because it will be very low entry price. So instead, I'll stagger them down. So if the market comes down, I will get to the next cash to cut put. And then so on and so forth. And then finally, when it goes back up, I would",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 44,
      "start_timestamp": "00:23:04",
      "start_timestamp_seconds": 1384.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1384"
    }
  },
  {
    "text": "a cover call because it will be very low entry price. So instead, I'll stagger them down. So if the market comes down, I will get to the next cash to cut put. And then so on and so forth. And then finally, when it goes back up, I would sell the cover call, usually above where the valuation line is. So let's say if I think the valuation is at a certain level, I will wait until it goes above that, especially I had a sign or quite a number below that. So that would have quite a bit of a capital gain on the way up. And then I will stay good. My cover call on the way up this well. So then how do you navigate the opportunity cost associated with that kind of strategy where the COVID market was really accommodating. It was like a three day bear market before we started that crazy rally out. So if you have a stock, you staggered your short puts, you start getting hit, you're assigned, you're assigned, you're assigned. So is there, is there a point at which you're like, okay, I've been in this thing for six months and I'm still super far underwater. Do you manage the loss by time or by other price levels? Or is it literally just, I still think this is a fundamentally sound company. I don't care how long I have to wait. Yeah, I take the approach whereby I mean",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 44,
      "start_timestamp": "00:24:00",
      "start_timestamp_seconds": 1440.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1440"
    }
  },
  {
    "text": "months and I'm still super far underwater. Do you manage the loss by time or by other price levels? Or is it literally just, I still think this is a fundamentally sound company. I don't care how long I have to wait. Yeah, I take the approach whereby I mean to this for the long term. So I do not trade it more of a short term whereby I try to get a cover call at the entry price. I kind of wait until it goes up. So if I have a firm belief in the stock, then I will just wait for it to eventually come back up. And then is there a condition that would make you not believe in the stock anymore? Yeah. So that is if some changes happen to the company structure and I'm not very sure of the outcome, then I might just take the loss and exit. But so far, it hasn't, I haven't done anything like that so far. And also most of the underlying that choose tend to be very big kept stocks in a sense whereby, you know, they are kind of widely traded. So it's not like very, you know, the world price stocks where, you know, it's uncertain or it's not profitable. Yeah, got it. Because that's always been one of my fascinations with stuff like the wheel is because I noticed a lot of people who like to trade it. They'll essentially run it very similar in",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 44,
      "start_timestamp": "00:24:57",
      "start_timestamp_seconds": 1497.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1497"
    }
  },
  {
    "text": "know, the world price stocks where, you know, it's uncertain or it's not profitable. Yeah, got it. Because that's always been one of my fascinations with stuff like the wheel is because I noticed a lot of people who like to trade it. They'll essentially run it very similar in that sense where they'll kind of just wait. And then it circles me back then to the original thought of how do you navigate then the opportunity cost of that capital? Yeah, very good question. So this is something that also I've been thinking about. But basically, I will park them into fixed income securities. Right. So what I'll do is that in my own bank, I would put in them into fixed income securities first. And when the need arises for me to actually get to the next level, then I will actually transfer it. Now, it may not be that efficient, but recently, I've been speaking with some people and they talk about using like money market funds. So that could be an alternative whereby you park some money in the market, money funds, but I do have some in tea bills as well, but tea bills are un-as-liquid because you have to wait until it, you know, kind of matures before you can use the funds. Have you tinkered with box spreads? I know. I haven't. It's exactly what I use. So are you familiar with the coverage strangle? Yes. Yeah. OK. So it's essentially almost same",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 44,
      "start_timestamp": "00:26:00",
      "start_timestamp_seconds": 1560.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1560"
    }
  },
  {
    "text": "un-as-liquid because you have to wait until it, you know, kind of matures before you can use the funds. Have you tinkered with box spreads? I know. I haven't. It's exactly what I use. So are you familiar with the coverage strangle? Yes. Yeah. OK. So it's essentially almost same process as the wheel. The primary difference is, as I'm assigned, I'm typically selling more cash secured puts and then I almost will always sell the calls at a ratio so that I don't cap my upside potential. But to the same point, and it's actually fascinating talking to you, to be honest, because there's so many parallels. I find this every time I talk to traders that have been trading for a while. It's like we do shit the same way. Like there's small differences, but it's like the same stuff. It's hilarious. But when I'm trading something like the coverage strangle, I'll have the same idea of a certain amount of allocation. That's ready to go to it. But any of that money that's not being used, that's allocated to the trade, I'll put it in a box spread. So it's a way for me to earn a slight premium over the risk-free rate for whatever duration I put it in. And I use something like SPX to run those. So it's also section, well, in the US section 1256 tax code. So 6040 long term short term capital gains. There's no early exercise European style option. And",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 44,
      "start_timestamp": "00:27:04",
      "start_timestamp_seconds": 1624.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1624"
    }
  },
  {
    "text": "slight premium over the risk-free rate for whatever duration I put it in. And I use something like SPX to run those. So it's also section, well, in the US section 1256 tax code. So 6040 long term short term capital gains. There's no early exercise European style option. And you can always exit it early if you have to. But yeah, that just might be something worth because if you're talking to me about like T bills, money market, you'll make more for sure. That's interesting. So that means if you let's say you set aside a certain amount money for the stock. And if you have unused portion, you use that unused buying power to put into this cover strangle on the SPX. Is that correct? The box spread. Yeah. Oh, okay. And what if there's a loss? Wouldn't that eat into the amount that you need to put into the? It's so if you put the trade on as you should, it's impossible for it to be a loss. For a cover strangle. No, for the box spread. For the box spread. So the covered strangle will have whatever variance it has again, you can. Oh, okay. Okay. Okay. Yeah. Okay. Got it. Got it. Yeah, because I run box spreads almost all the time with unused capital in the account. Just because you earn a slight excess over the risk-free rate. So for example, right now, I'm running one that's given me 0.71 over the risk-free",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 44,
      "start_timestamp": "00:28:07",
      "start_timestamp_seconds": 1687.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1687"
    }
  },
  {
    "text": "Okay. Okay. Yeah. Okay. Got it. Got it. Yeah, because I run box spreads almost all the time with unused capital in the account. Just because you earn a slight excess over the risk-free rate. So for example, right now, I'm running one that's given me 0.71 over the risk-free rate for the corresponding time frame that I'm in. So it's you're not like out there rolling in money, right? It's not crazy. But that is still almost three quarters of a point of excess that I get over doing something like short-term tea bills or stuff like that. Yeah, definitely have to look into that. Yeah, I think that's pretty good. Yeah, sure. Yeah, dude. Well, anytime if you want to set up a call, otherwise, you know, you and I can just bullshit a little bit, but I'd be happy to walk you through what I do with them. I just find them when I'm trading something like the covered strangle, which is really capital intensive. It's kind of a way for me to triple dip almost so that I can be a little bit leaner. So it sounded like you're working down the same path. That's why I offer that up. When you look across your different strategies, what do you tend to use the most? You mean place the trips most often or you mean the allocation amount? I can't tell you how much I love that clarifying question because I'm not kidding. It's the exact",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 44,
      "start_timestamp": "00:29:15",
      "start_timestamp_seconds": 1755.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1755"
    }
  },
  {
    "text": "I offer that up. When you look across your different strategies, what do you tend to use the most? You mean place the trips most often or you mean the allocation amount? I can't tell you how much I love that clarifying question because I'm not kidding. It's the exact clarifying question I would ask. But the first one would just be the bulk of the capital, which I'm assuming are just the more capital intensive strategies, but we'll start with that. Correct. Yeah, correct. Yeah, so the more capital intensive strategies are the lips and the real strategies. But the one that I do more often is generally the income one because they're generally a shorter time frame trade. So those cycle much faster. So you you take them off and put them on much, much more often. Got it. And then talk to me then about frequency, which strategy do you tend to cycle in and out of a lot? Yeah, so there are two types of style of strategies that are used in terms of income. So one of the type of strategies that we're using on cash settle and I'll kind of hold them to expiration. And so these are trades like the bookoming butterfly and mainly because they are very slow spreads in a sense. So if you were to exit at 21 dt based on what the Tasty Trade Mechanics are, if it gets inside the tent, chances are that the profit will be",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 44,
      "start_timestamp": "00:30:11",
      "start_timestamp_seconds": 1811.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1811"
    }
  },
  {
    "text": "And so these are trades like the bookoming butterfly and mainly because they are very slow spreads in a sense. So if you were to exit at 21 dt based on what the Tasty Trade Mechanics are, if it gets inside the tent, chances are that the profit will be very minimal because it's a very slow spread. You won't kind of realize the potential of that tent the profit until close to exploration. Then the other type will be on the like strangles and jade lasers. These are more towards 45 days around there and then I'll exit latest at 21 dt. All right, so profit around 50. Yeah. Okay, so you you kind of mirror Tasty Mechanics. Correct. Mirror got Tasty Mechanics. Yeah. Got it. Okay. Now, when you first were working in the proffirm, what kind of strategies were they having you use there? Yeah, so the profit was in we were only treating equities. So it was not on options because I wasn't at least aware of any options from at least at the point of time in my country, but maybe there were, but there weren't the openings because proffums are very, you know, the jobs are very sought after. One has once it's opened there, people would so we were doing equities. So the style of trading at the proffirm was very market maker style of trading where we would be on every, you know, level, every bit in our level and we'll be",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 44,
      "start_timestamp": "00:31:24",
      "start_timestamp_seconds": 1884.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1884"
    }
  },
  {
    "text": "jobs are very sought after. One has once it's opened there, people would so we were doing equities. So the style of trading at the proffirm was very market maker style of trading where we would be on every, you know, level, every bit in our level and we'll be basically just scalping the spread. So yeah, so it's very fast in and out kind of strategy. So we are basically managing the queue system so the speed. So for example, if I was to queue on the bit, I will be the last position until, you know, the people in front of me would get filled, then it would be my turn. So all we're doing is just managing the queue position and we will be on all the levels. Right. Yeah, which funny enough, I find it interesting that so many retail traders think when they transition that they'll be able to essentially try to provide markets like that. Can you talk about some of the reasons why you don't do that now and you've migrated over to options? Yeah, so the way the proffirm traded was actually to set things up is a little bit difficult because firstly, to set up with the broker, you need a very large capital. They are looking at at least at the point of time. Maybe I think about a few million, one, two million to start things up as a startup capital and the software which we use is actually",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 44,
      "start_timestamp": "00:32:44",
      "start_timestamp_seconds": 1964.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=1964"
    }
  },
  {
    "text": "firstly, to set up with the broker, you need a very large capital. They are looking at at least at the point of time. Maybe I think about a few million, one, two million to start things up as a startup capital and the software which we use is actually customized. I'm not saying customized is built from scratch by the software team. So the platform which I was at, we had a team of software engineers to do it and you need to set up the server, at least from what I understood. You need to have the server, you know, just beside the exchange. So the whole setup itself was too expensive for a retail person, one person to do it. Yeah, so you couldn't exactly do it on your on your own, even though you wanted to. But now I'm not too sure whether it's possible because the other thing we also need is level three. I'm not too sure whether level three is accessible for retail traders. At least it wasn't back then, whereby you could, you know, level one is the inside bit and ask. Level two is the other levels. Level three, you get to see the actual breakdown of the orders on the level. So at least I will know, you know, let's say if an order is about say 50,000 shares. I will know whether this 50,000 shares through level three is it one person or is it maybe 20 people. So",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 44,
      "start_timestamp": "00:33:52",
      "start_timestamp_seconds": 2032.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=2032"
    }
  },
  {
    "text": "to see the actual breakdown of the orders on the level. So at least I will know, you know, let's say if an order is about say 50,000 shares. I will know whether this 50,000 shares through level three is it one person or is it maybe 20 people. So with that, we are able to, you know, manage our queue positions much better, our orders better because if you just see level two, you're in the blind. You have no idea what's going on, whether it's a spoof or is it, you know, because they start training a lot of manipulation, a lot of spoofing. So level three really is needed for you to treat this strategy very efficiently. Yeah, yeah. And then also another add on for that talk about like the friction via commissions, like the cost to actually transact. Yeah, I think that's important to highlight. Yeah, that's a very big one as well because with the profit from because of the science which they have, they are able to get, you know, very little commissions, especially in and out. But as a retail trader, I don't think you can, at least back then now it's all commission free of your stocks, right? But back then it was a very big thing to have very, very commissions. Well, and the other thing on top of that is what I try to remind retail traders now is like it might look like it's free because to your",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 44,
      "start_timestamp": "00:34:47",
      "start_timestamp_seconds": 2087.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=2087"
    }
  },
  {
    "text": "all commission free of your stocks, right? But back then it was a very big thing to have very, very commissions. Well, and the other thing on top of that is what I try to remind retail traders now is like it might look like it's free because to your point, there's no cost upfront, but your orders being routed via payment for order flow. So your ability then to rest orders on multiple markets is essentially relegated to who they choose to bundle your order with. So then you kind of get broken off that way. That's fascinating. So when you look at your trading career so far, what's been kind of your average return that you've been able to sustain through your approach? Yeah, the average will be around 20. All right, 20 plus. So far this year is slightly better. At least as of this point is about 24. But mainly because the market has gone up. So because I have a big portfolio towards a bigger allocation towards more of the leaps and real strategy whereby if the market goes up, it tends to do well. So these are the times where it tends to do better. It's funny to hear you say that because my compound annual growth rate from when I started is very similar to that. It's slightly higher end of the 20s, but that's mostly because it got skewed from last year. I had my first like really strong year last year,",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 44,
      "start_timestamp": "00:35:56",
      "start_timestamp_seconds": 2156.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=2156"
    }
  },
  {
    "text": "better. It's funny to hear you say that because my compound annual growth rate from when I started is very similar to that. It's slightly higher end of the 20s, but that's mostly because it got skewed from last year. I had my first like really strong year last year, but before that it was always low 20s. So I'm realizing that essentially you're my single-porian brother. And I think essentially we just do ship the same. And I did the military as well. So yeah, I'm telling you, I could just tell. I just the vibe check is there and based on the way that you talk about this stuff. So talk to me now a little bit about how your approach has evolved over time because obviously going through the prop firm, you have your basic experience. Then you get out, you decide to trade for yourself. Walk me through that point specifically when you started trading for yourself and how your approach to markets has evolved from there from that point till now. Sure. So when I started off, it was much more at the point just focusing on one specific strategy rather than looking on a more holistic view. So back then I tried to just one strategy all the time and that had its limitations because the strategies don't work under all different conditions. So there will be times whereby it doesn't do well. So right now I have positions whereby different positions will do",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 44,
      "start_timestamp": "00:36:58",
      "start_timestamp_seconds": 2218.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=2218"
    }
  },
  {
    "text": "more holistic view. So back then I tried to just one strategy all the time and that had its limitations because the strategies don't work under all different conditions. So there will be times whereby it doesn't do well. So right now I have positions whereby different positions will do well under different market conditions. So if the market tends to go all the way up, that's where I would say what I call positive delta strategies, they tend to do well as the market goes out. Then I do put on some strategies where it's more neutral. If I have the market just go sideways, then that's where the positions will do well. And then slightly semi-barry strategies, like for example, the put-brookling butterfly, put racial spreads. If you shift the 10 much, much lower. So this is where if the market does take a deep, at least it can have an opportunity to get into the zone, the profit zone. So right now it's much more where I try to have positions to kind of cover where the market could go rather than just one singular strategy. Got it. And how many positions do you typically have on in your book at a given point in time? Or can be quite a bit. So is this you're talking about the whole portfolio as a whole, everything? Or it can be about 30 to 50 depending on how volatility. The bulk of it, the most position would generally be",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 44,
      "start_timestamp": "00:38:12",
      "start_timestamp_seconds": 2292.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=2292"
    }
  },
  {
    "text": "in your book at a given point in time? Or can be quite a bit. So is this you're talking about the whole portfolio as a whole, everything? Or it can be about 30 to 50 depending on how volatility. The bulk of it, the most position would generally be the income side. All right. The next question after that is how old are you now? How old? 42. So the next question, which is what I imagine based on your time for him starting is how the fuck have you managed to reverse age? Because 33 and you literally look 10 years younger than me, which is complete bullshit. I guess I have no idea for that, but maybe good genes. Maybe Asians kind of look, I don't know, maybe I kind of look maybe younger than. Yeah, we could call it a spade of spade, man, like white dudes, we age the worst. We have the genetics that make us look 60 by the time we're 35. I'm close to it. I was just curious because I feel like I'm talking to a fucking immortal dude who's freaking me out a little bit. The next question though with respect to the portfolio is what kind of time frames do you like to train? Time frames in what sense? You mean the DTE's free of positions? Okay. Yeah, so for the DTE's is different for the wheel, the leap, and the income sort of strategy. So for the income",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 44,
      "start_timestamp": "00:39:23",
      "start_timestamp_seconds": 2363.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=2363"
    }
  },
  {
    "text": "respect to the portfolio is what kind of time frames do you like to train? Time frames in what sense? You mean the DTE's free of positions? Okay. Yeah, so for the DTE's is different for the wheel, the leap, and the income sort of strategy. So for the income style strategies, like I mentioned, it's according to the TST traits mechanic. All right. So they did a study where they show that, the expected move has an edge over the, you know, the realized move is oftentimes lesser than expected move if you go for around 45 days in a burp. So usually that's the time frame I stick to for the income style strategy. Now for the leaps, this will be go, I will go much further out. All right. So this will be over a year in terms of DTE. Yeah. And for the real strategy, this will be slightly shorter time frame. So I can go for something like maybe a week to a week that kind of time frame because I actually do want to get assigned on the positions, right? Because sometimes the market could come down, touch your cashier cupboard, and then it just shoots all the way back up, doesn't come back down. Then in that case, if you actually had just gotten field, you would have done better in capital gains term rather than just get the premium. So I tend to go for a shorter time frame for the real",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 44,
      "start_timestamp": "00:40:36",
      "start_timestamp_seconds": 2436.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=2436"
    }
  },
  {
    "text": "just shoots all the way back up, doesn't come back down. Then in that case, if you actually had just gotten field, you would have done better in capital gains term rather than just get the premium. So I tend to go for a shorter time frame for the real strategy. Yeah, I totally see that. And for something like the wheel strategy, I imagine you're probably a little more aggressive on your short putt deltas to increase probability of assignment. Correct. Because I do have many levels. Yeah. So I tend to have higher deltas, right? At times could it even be at the money? Well, the yeah. And the reason I ask that is again, because there's so many people that I talk to that trade the wheel. And I feel like so many of them fuck it up terribly because they want to sell puts at like 30 deltas, 20 deltas, something that obviously is a high probability of winning. But then they don't get the underlying and then that exact scenario happens that you're talking about where they're bullish holding something with defined profit, watching the thing they're bullish and just go to the moon. And they're just like, wow, that looks cool. I'm going to take my one dollar that I collected and go screw myself because that's about what I get here. When you think about the way that you manage your portfolio, you sound you were talking about your deltas. So it sounds",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 44,
      "start_timestamp": "00:41:50",
      "start_timestamp_seconds": 2510.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=2510"
    }
  },
  {
    "text": "they're just like, wow, that looks cool. I'm going to take my one dollar that I collected and go screw myself because that's about what I get here. When you think about the way that you manage your portfolio, you sound you were talking about your deltas. So it sounds like you used in like beta weighted deltas to some capacity. And then it sounds like you're using some different strategies. You're using some different time frames. Do you have any sort of portfolio level mandate with respect to risk? So kind of like your time at the prop firm, if your total portfolio exceeds a certain percent drawdown, you do something about it. So I don't really look too much in terms of drawdown. But rather, I manage it up front through the maximum usage of the capital allocation. So that means I try not to go past 50. So if I do not have more than 50 invested at any one time, then I know that you know a drawdown can be kept fit in that. And also like some of the management of the strategies, I tend to exit at 21 DTE if that's the longest if it's a loss. So this way, the loss also kind of get reduced to what it could be if you hold on to much longer. So the TST trade guys, so I lean a lot on their studies because you can see the statistics back decades. And they did many",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 44,
      "start_timestamp": "00:42:42",
      "start_timestamp_seconds": 2562.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=2562"
    }
  },
  {
    "text": "it's a loss. So this way, the loss also kind of get reduced to what it could be if you hold on to much longer. So the TST trade guys, so I lean a lot on their studies because you can see the statistics back decades. And they did many pieces on 21 DTE whereby if you manage it at that point, then the chances of you actually losing the actual buying power that you put on for the trade has been reduced a lot, especially if you trade the indices as opposed to individual stocks. So in that sense, that's how I manage the risk on a portfolio level. I see. Yeah. And then just a couple of other questions. When you're trading these different strategies, obviously you're probably looking at some different securities and stuff that you like to trade. But what do you tend towards? You were talking about larger cap or even mega cap style stocks. But yeah, what are some of the things that you like to put positions on in? Yeah, right now I have Google, Meta, Adobe, Amazon. And I do have some smaller speculative positions in Palantir. But yeah. So you really, you like kind of the the tech side right now, it seems. Yeah. Yeah. And then do you spend any time playing with other sectors like when they're in favor, do you kind of stick to that same book of products that you like? I tend to stick to this,",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 44,
      "start_timestamp": "00:43:53",
      "start_timestamp_seconds": 2633.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=2633"
    }
  },
  {
    "text": "you like kind of the the tech side right now, it seems. Yeah. Yeah. And then do you spend any time playing with other sectors like when they're in favor, do you kind of stick to that same book of products that you like? I tend to stick to this, this products. Yeah. Because for me, I can't really go towards dividend stocks in a sense because they are techs at the maximum rate for me as outside of US. So it doesn't really make sense for me to go more for like dividend stocks kind of for the wheel. So I go for stocks where they don't actually pay a dividend, right? Although Google recently just did. Yeah. But so this way in terms of the the movement at least the tech side will not have the dividend to kind of like soften the kind of the return. Yeah. I see. Yeah, man. Dude, absolutely awesome. Like I got to say, thank you for hopping on. It's been really, really neat. Having a chance to learn a little bit about your background. The way I typically find people for the podcast is like different people from my community. They'll be like, hey, can you go talk to this person? So obviously somebody wanted to learn a little bit more about you. And I'm honestly really enjoying learning a little bit about the way you think about markets and stuff. There's a lot of parallels, which is kind of fun.",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 44,
      "start_timestamp": "00:45:06",
      "start_timestamp_seconds": 2706.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=2706"
    }
  },
  {
    "text": "be like, hey, can you go talk to this person? So obviously somebody wanted to learn a little bit more about you. And I'm honestly really enjoying learning a little bit about the way you think about markets and stuff. There's a lot of parallels, which is kind of fun. So definitely would love to, you know, have another conversation at some point. But in the meantime, for people that want to get a hold of you, where would you like them to go? And then I can throw those links also in the notes below. Sure. Just to my YouTube channel or to options with davis.com. Got it. Easy then. Yeah, man. I definitely would love to keep in touch. And then maybe we can even do like a live stream or something sometime. I think that would be a lot of fun. I love interacting with the community's lives. So that would be a blast. But thanks for hanging out, man. Great to great to meet you and great to have you on. Thank you, Eric. It's a pleasure. Thanks for having me. Bye-bye.",
    "metadata": {
      "video_id": "EvZE2RIwFE4",
      "title": "Prop Firm to Options - @optionswithdavis  | The Outlier Podcast Ep76",
      "url": "https://www.youtube.com/watch?v=EvZE2RIwFE4",
      "upload_date": "",
      "duration": 2833.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 44,
      "start_timestamp": "00:46:13",
      "start_timestamp_seconds": 2773.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EvZE2RIwFE4&t=2773"
    }
  }
]