[
  {
    "text": "What about Liars? Quick market update. We have two things on the agenda for today. The first one is going to be Wells Fargo. The second one is going to be Adobe. And then I guess there's a third bonus item, which I want to take a look at GameStop because on the dark pool side of things, there are just a lot of transactions that I find slightly curious and topical that I want to share with you. So let's start with Wells Fargo. What's going on in here, the stock dropped 4 today for probably the most classic Wells Fargo reason on earth, which is it continues to break the law. It's kind of like part and parcel for Wells Fargo. It's one of the best reasons to be in Wells Fargo is because you know that they don't care about the rules that they're just going to kind of do whatever they want. They might open accounts to show account openings that don't exist. They might in this case not really care about their internal mechanisms that they need to fight financial crimes. They're just doing whatever they want out here. And you got a respective bank that somehow stays in business behind a litany of different investigations and pretty much continuing to get in trouble for breaking the law. I just I find a hilarious. So shout out to Wells Fargo for continuing to do whatever it is that they do. But right now they are",
    "metadata": {
      "video_id": "EzfR61qH4DI",
      "title": "WFC, ADBE, GME Stock Market News",
      "url": "https://www.youtube.com/watch?v=EzfR61qH4DI",
      "upload_date": "",
      "duration": 827.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EzfR61qH4DI&t=0"
    }
  },
  {
    "text": "that somehow stays in business behind a litany of different investigations and pretty much continuing to get in trouble for breaking the law. I just I find a hilarious. So shout out to Wells Fargo for continuing to do whatever it is that they do. But right now they are in a steep decline, which funny enough, it's not super fortunate because I do have a long position right now in Bank of America. That's not exactly playing ball as I wanted. But the financial sector is a whole is starting to turn over a little bit here. So if we jump over to XLF, we can see that it's grabbing a bite, which is good. But you know, I want for a while, financials were really holding things up. But now it looks like it's rotating over a little bit. So yeah, got to love us some Wells Fargo news. We'll see where this one goes as always absolute blast. The next thing I want to take a look at is Adobe. And this is because it feeds into the broader tech picture. So they had earnings today after the close and they had a massive, massive beat. So if you take a look, they came in 363 was estimate 465 actual. And then let's take a look at the old Adobe price and it's closed at 586 and is trading at 532. Another example of where good is just not good enough. So if we take a look",
    "metadata": {
      "video_id": "EzfR61qH4DI",
      "title": "WFC, ADBE, GME Stock Market News",
      "url": "https://www.youtube.com/watch?v=EzfR61qH4DI",
      "upload_date": "",
      "duration": 827.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EzfR61qH4DI&t=0"
    }
  },
  {
    "text": "if you take a look, they came in 363 was estimate 465 actual. And then let's take a look at the old Adobe price and it's closed at 586 and is trading at 532. Another example of where good is just not good enough. So if we take a look at some of the news here specifically in Adobe, there's a couple things that stuck out to me. First one is it crushed on revenue. So that seems great news. But this is one of the issues I think it didn't really like it being the market is the forecast. And again, I try to remind people when we're coming into earnings, forecasts are so important. And it's because we have a sense of the performance of a company coming into earnings. We can kind of see how they're broadly doing. But the forecast is new information to us. And it's the first time that we get a glimpse at how a company is expecting to perform for the remainder of the year for the next quarter. And that gets priced in pretty heavily. And you can see how tight these margins are, right? Because you can see that the company says it's forecasting 5.5 build a 5.55 for Q4. And it's just shy of 5.6. And they just don't like that. So these kind of softer forward guidance, I think is really important for us as both investors and traders. Because we've seen this in a few companies now",
    "metadata": {
      "video_id": "EzfR61qH4DI",
      "title": "WFC, ADBE, GME Stock Market News",
      "url": "https://www.youtube.com/watch?v=EzfR61qH4DI",
      "upload_date": "",
      "duration": 827.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EzfR61qH4DI&t=0"
    }
  },
  {
    "text": "company says it's forecasting 5.5 build a 5.55 for Q4. And it's just shy of 5.6. And they just don't like that. So these kind of softer forward guidance, I think is really important for us as both investors and traders. Because we've seen this in a few companies now and in technology companies specifically, we're getting to a really interesting part of the market where as we're coming up on rate cuts, which will be very soon, at least for the first round, those are generally priced in at this point. The market is trying now to figure out how do we proceed through this rate cut picture. And I think one of the bigger risks we have if we start cutting rates too fast, which it doesn't look like that's going to be the case upfront. We're still looking at a pretty conservative starting cycle at least. But right now to me, it looks like the market is grasping to see how this thing plays out like we all are very curious about. And the reason why I say grasping is because we have no period in history that's like a really close reference for what we've seen starting from the COVID drop, then the overall fiscal policy deployed by the Fed during that period to combat that drop. Like we've not seen what has happened before to this degree. So this is very much a first of its kind kind of scenario. So from a trading perspective,",
    "metadata": {
      "video_id": "EzfR61qH4DI",
      "title": "WFC, ADBE, GME Stock Market News",
      "url": "https://www.youtube.com/watch?v=EzfR61qH4DI",
      "upload_date": "",
      "duration": 827.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EzfR61qH4DI&t=0"
    }
  },
  {
    "text": "starting from the COVID drop, then the overall fiscal policy deployed by the Fed during that period to combat that drop. Like we've not seen what has happened before to this degree. So this is very much a first of its kind kind of scenario. So from a trading perspective, I continue to do what I always do, which is remain sensitive to current information trading the market as it is, not how I think the market should be. That leads us into the fan fave game stop. So a couple of things jump out to me here with the new offering. We can see that volume definitely has spiked over the last couple days. And part of this is also because of earnings, but a really big contraction in volume here. So I think right now a lot of people are curious how far does this go? When are we going to be done with the shares because that obviously will suppress price ever so slightly. But again, what I find most intriguing here is following its earnings release. We beat on earnings. We came down. We also have news of the offering and it's still holding tight here. This is not a new line that I've drawn at the 1981 handle. This has been here for some time. And I do think that this is kind of meaningful support at this point. We've been hitting it a few times recently. So we have to see how the overall",
    "metadata": {
      "video_id": "EzfR61qH4DI",
      "title": "WFC, ADBE, GME Stock Market News",
      "url": "https://www.youtube.com/watch?v=EzfR61qH4DI",
      "upload_date": "",
      "duration": 827.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EzfR61qH4DI&t=0"
    }
  },
  {
    "text": "This is not a new line that I've drawn at the 1981 handle. This has been here for some time. And I do think that this is kind of meaningful support at this point. We've been hitting it a few times recently. So we have to see how the overall behavior of game stop flows here. But again, I find myself looking at it the same way I typically look at it. Looks like we're coming into a more quiet period and it's quiet until it's not. So the other thing I wanted to take a look at with you is the options. So we haven't done this a little in a little while. So if we take a look at the overall volume for today, it's 119,000 against 54,000 calls to put so very, very quiet on a relative basis. But this strikes me different. There's 700,000 calls against 350,000 puts. That's a lot of calls. And it's still barely at a 2 to 1 ratio, which is good. But the other thing that I is very striking to me about the way that the options chain looks right now is that of those 700,000, the majority clearly is not in this front expiration. This front expiration is 146,000 of those. So it's a lot, but not all of them. And this represents a shift. What this shift ultimately means, I don't know yet. I have to keep an eye on it. But from an options trading perspective, I",
    "metadata": {
      "video_id": "EzfR61qH4DI",
      "title": "WFC, ADBE, GME Stock Market News",
      "url": "https://www.youtube.com/watch?v=EzfR61qH4DI",
      "upload_date": "",
      "duration": 827.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EzfR61qH4DI&t=0"
    }
  },
  {
    "text": "not in this front expiration. This front expiration is 146,000 of those. So it's a lot, but not all of them. And this represents a shift. What this shift ultimately means, I don't know yet. I have to keep an eye on it. But from an options trading perspective, I notice changes like this. And typically speaking when we're looking at the front expiration, we tend to see really, really heavy option, concentrated option value as a percentage of the total OI. That's not what I'm seeing right now. The other thing I'll notice, I'll point out is that there is decent exposure already in this 20-sep expiration, 135,000. That makes sense to me. 20-sep is the next primary expiration. Options are typically more liquid there. Very, very normal. So the main anomaly I see here is just the variance across all these different expiration cycles for the call side. I find that interesting. Not a direct takeaway just yet, but interesting. When I look at the overall volatility, we're still very front heavy, right? So we have 121 for this week. It drops down to 98, 96, 95, 95, 99. So obviously 18 ought becomes slightly interesting because that four point wall increase here, it could just be because this is the next primary expiration cycle. Or it could be that the market is starting to anticipate something coming out here. So that's an expiration cycle I'm keeping a close eye on because that is anomalous to go from",
    "metadata": {
      "video_id": "EzfR61qH4DI",
      "title": "WFC, ADBE, GME Stock Market News",
      "url": "https://www.youtube.com/watch?v=EzfR61qH4DI",
      "upload_date": "",
      "duration": 827.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EzfR61qH4DI&t=0"
    }
  },
  {
    "text": "four point wall increase here, it could just be because this is the next primary expiration cycle. Or it could be that the market is starting to anticipate something coming out here. So that's an expiration cycle I'm keeping a close eye on because that is anomalous to go from 95, 95, 99, 95, essentially. That's strange. Then it plummets right after that to 69, get a backup to 90. So this is also really interesting to me. How soft the volatility is here so far in one no. So this continues to lead to a massive, massive host of crazy opportunities to trade relative volatility and something like GameStop. It's something that I've ran for some time now. We can see for the first time in some time that for the 20 step expiration, we have massive, massive call implied volatility skew. Again, normally you'll see the put side priced more heavily than the call side, but that's not what's happening right now. We're actually seeing everything out. Typically the 50s would be the highest still, but like this kink is tradable to there, to their relative to here. There's a lot of different ways that that can be traded. But the main note is that volatility as an outright asset class is very tradable in GameStop, even though the price so far has been a little bit slower going. All right. So the last thing I want to show you is what I alluded to at the beginning",
    "metadata": {
      "video_id": "EzfR61qH4DI",
      "title": "WFC, ADBE, GME Stock Market News",
      "url": "https://www.youtube.com/watch?v=EzfR61qH4DI",
      "upload_date": "",
      "duration": 827.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EzfR61qH4DI&t=0"
    }
  },
  {
    "text": "traded. But the main note is that volatility as an outright asset class is very tradable in GameStop, even though the price so far has been a little bit slower going. All right. So the last thing I want to show you is what I alluded to at the beginning of the video. And it's this. We have almost 100 transactions today across the entire day separated by very, very little time frames if any of 5,000 share by blocks. And if we go back in time, I wanted to actually open this up a little bit and like let's look over the last month together and let's see what this looks like. So if we start, sorry, I want to do for the last 30 days, not last month, right? Here we go. So if we start from the 12th of September, you'll notice again that there's almost a hundred of these. That's a ton. And it's like throughout the entire day. So again, it's hard to tell who or what this is or what series of entities this is. There's never anybody that outright owns 5,000 share contracts or not contracts purchases because this is shares, not options. Obviously, used to talking about options. But what I find most interesting is this. If we look, there's about 90 high 90s here, then if we go to the 11th, we see that that's about cut in half ish. So the 11th, there's still a ton of them. If we",
    "metadata": {
      "video_id": "EzfR61qH4DI",
      "title": "WFC, ADBE, GME Stock Market News",
      "url": "https://www.youtube.com/watch?v=EzfR61qH4DI",
      "upload_date": "",
      "duration": 827.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EzfR61qH4DI&t=0"
    }
  },
  {
    "text": "Obviously, used to talking about options. But what I find most interesting is this. If we look, there's about 90 high 90s here, then if we go to the 11th, we see that that's about cut in half ish. So the 11th, there's still a ton of them. If we go to the 10th, there's maybe a third of that. There's much less. Then if we go to the ninth, even less still, we go to the sixth, it opens back up. The fifth, like none, fourth, like none, will not like none, but very far less. So what I'm highlighting is that this is ungelating. These purchases are ungelating. And I can't quite put my finger on why. There's no real answer to this. It's very difficult to tell is to why we're moving in 5,000 share blocks because here's the other thing I find interesting is that if we sort this by size, we can move way more. If somebody wanted to take all of those 5,000 share blocks and essentially throw them at once or twice or three times, meaning across a few orders, they can, if they're so inclined. Because if you look at this, the size that we're trading for the larger positions here, 150,000, 145,000, 100,000, even, 93, 87, so on and so forth. So there's really big transactions flowing through here, no problem. So the fact that there's so many of those at the five, I find just interesting because I also don't",
    "metadata": {
      "video_id": "EzfR61qH4DI",
      "title": "WFC, ADBE, GME Stock Market News",
      "url": "https://www.youtube.com/watch?v=EzfR61qH4DI",
      "upload_date": "",
      "duration": 827.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EzfR61qH4DI&t=0"
    }
  },
  {
    "text": "size that we're trading for the larger positions here, 150,000, 145,000, 100,000, even, 93, 87, so on and so forth. So there's really big transactions flowing through here, no problem. So the fact that there's so many of those at the five, I find just interesting because I also don't see that same kind of repeat buying behavior in any other relative size so far. So yeah, hard to say is per usual, but something I just can't help but find interesting. And that's one of the things I try to do for all of us here on the channel is find things that look interesting to me and that does look interesting. I don't have it there at conclusion yet. Perhaps we can dive a little bit further into it on the GME live stream on Saturday at 5 p.m. Pacific time, looking forward to that actually. We have a couple things to get into, which is the rest of roaring kiddie's old trades. We have maybe about a quarter to a third left of them to go last week and we got super far in detail on them, which I'm actually pretty excited to get back into those. That was very fun. So yeah, interesting stock behavior, generally quiet options behavior. And it is a continue to monitor for me right now. I am trading it very conservatively. I've already told those, I think it was during the live session, I've already paired down my stock position a",
    "metadata": {
      "video_id": "EzfR61qH4DI",
      "title": "WFC, ADBE, GME Stock Market News",
      "url": "https://www.youtube.com/watch?v=EzfR61qH4DI",
      "upload_date": "",
      "duration": 827.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EzfR61qH4DI&t=0"
    }
  },
  {
    "text": "That was very fun. So yeah, interesting stock behavior, generally quiet options behavior. And it is a continue to monitor for me right now. I am trading it very conservatively. I've already told those, I think it was during the live session, I've already paired down my stock position a little bit. And it was just because of essentially we're getting to a decent spot, I was making okay money based on what I had. And then this is kind of like an accumulation zone depending on how it behaves. But for me, I will always continue to remind everybody like I'm a trader, I participate in holding game stop stock to participate because I like the community and I want to support it. But this is not where I know a lot of people are parking like all of their money. It's not even close for me. And it's simply because I trade the markets differently. And I have to my livelihood. So yeah, interesting thing to follow along though, I am really eager to see how it handles kind of this high 19 low 20 handle and see what it doesn't hear, especially when the offering a baits. And then I want to see if we start springing from there. T B D also still waiting to hear if we get any guidance soon on what the master plan is behind the capital that's raised. Still very, very eager to hear that as well. So as always, anything",
    "metadata": {
      "video_id": "EzfR61qH4DI",
      "title": "WFC, ADBE, GME Stock Market News",
      "url": "https://www.youtube.com/watch?v=EzfR61qH4DI",
      "upload_date": "",
      "duration": 827.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EzfR61qH4DI&t=0"
    }
  },
  {
    "text": "And then I want to see if we start springing from there. T B D also still waiting to hear if we get any guidance soon on what the master plan is behind the capital that's raised. Still very, very eager to hear that as well. So as always, anything I should look at let me know be an outlier. See you all later.",
    "metadata": {
      "video_id": "EzfR61qH4DI",
      "title": "WFC, ADBE, GME Stock Market News",
      "url": "https://www.youtube.com/watch?v=EzfR61qH4DI",
      "upload_date": "",
      "duration": 827.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=EzfR61qH4DI&t=0"
    }
  }
]