[
  {
    "text": "you you you you you you you you what What's up outliers? Happy Friday. So we recently wrapped up a pretty big series actually that talked about trading options in a slightly different way and I introduced it as kind of the outlier approach to trading options and the goal of that is to try and help people think differently about options because options really can be used in a lot of different ways and I think that they're widely misunderstood. I just did a first I had a jolly rancher in my mouth but I didn't want it sloshing around while I was talking so I just swallowed it whole. I don't know if anybody's ever done that before. Hasted fine but it's a it's a life choice. Now the plan was to talk with you all to figure out what we wanted to focus on next and I didn't make it up for you. I literally asked you. So if we take a look we can see the community post and I essentially said here are a few ideas. I wouldn't say it's limited to these ideas but here's a few choices and you can see that there's 38 voted for surviving options trading with a 5K account and then a very close second was a deep dive into my strategies which will actually kind of be able to do a little bit of both because this won't apply like my strategies definitely won't apply to a 5K",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 80,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=0"
    }
  },
  {
    "text": "38 voted for surviving options trading with a 5K account and then a very close second was a deep dive into my strategies which will actually kind of be able to do a little bit of both because this won't apply like my strategies definitely won't apply to a 5K account but the concepts of those strategies will. So that's the goal. Now I'm viewing this very first episode of this more so as an orientation and a conversation with you. It's this is designed to be a back and forth dialogue because I have a rough idea on what I want to cover across eight episodes so it'll be about two months but I want to make sure that what I kind of thinking of is still applicable to you and it's the stuff that genuinely addresses your concerns, the struggles that you have for those that specifically voted or not even necessarily have a 5K account but folks that are just interested in that as a topic whether regardless of the you know amount of capital you have. So what I thought would be a great beginning point here. Hey, what up Lauren good to see you. I thought what a great beginning point would be is to brainstorm a little bit have like an actual conversation and to track ideas. So I'm actually grabbing the very first page of this and I want to open with a question which is in the context of trading a 5,000",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 80,
      "start_timestamp": "00:01:39",
      "start_timestamp_seconds": 99.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=99"
    }
  },
  {
    "text": "thought what a great beginning point would be is to brainstorm a little bit have like an actual conversation and to track ideas. So I'm actually grabbing the very first page of this and I want to open with a question which is in the context of trading a 5,000 account what is your largest pain point. So largest pain points in trading a 5K account. The reason I'm asking this is because what I'm going to do is literally make sure that every single one of the things that we come up with together are going to be addressed across the series. And then I'm going to add a couple on as we go through if you guys hit them or don't hit them but I don't want to start by giving you what I think I would rather start with what you think and then layer on on top. So in the chat please give me some ideas. Again, whether you personally identify with it or not doesn't actually matter that much. The way I want to approach this is just in general. If you were to think about trading options with a 5K account what are the largest pain points you could conceive of whether they're your own whether there's something that you've experienced previously but don't anymore which is great. Or if there's something that you really haven't experienced but maybe you've seen somebody else experience that kind of thing. Lauren says mine was making small",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 80,
      "start_timestamp": "00:03:18",
      "start_timestamp_seconds": 198.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=198"
    }
  },
  {
    "text": "largest pain points you could conceive of whether they're your own whether there's something that you've experienced previously but don't anymore which is great. Or if there's something that you really haven't experienced but maybe you've seen somebody else experience that kind of thing. Lauren says mine was making small trades that didn't make much or lose much like that. So I guess that one gives me a couple ideas actually. So for Lauren your idea gives me two. It gives me something like dollar return expectations. I think that's a fair one. And then there's also sizing trades relative to the portfolio which I love that. Zach says based off the balance it's a cash account. So if you're thinking day trades would have to wait for cash to settle. That's a great one. So and to be honest I'm actually really glad you brought that up because the concept of pattern day trading really has generally left my sphere. And I'm not saying that like, oh look at me. I'm not subject to it's not that at all. I actually say it more is like it it's a bit of guilt because I should be more plugged into like what most people are going through. So for me I don't I literally don't even fucking think about it. I have no idea. It's like when I pay for gas. I couldn't tell you how much gas is I know it's expensive in California but I have no idea",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 80,
      "start_timestamp": "00:04:57",
      "start_timestamp_seconds": 297.23999999999995,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=297"
    }
  },
  {
    "text": "like what most people are going through. So for me I don't I literally don't even fucking think about it. I have no idea. It's like when I pay for gas. I couldn't tell you how much gas is I know it's expensive in California but I have no idea what it costs to fill up a car. It's like those kinds of things were like I identify that I've become a little too detached and part of it is like I want to get back. So that's actually really like really great point. The idea of PDT restrictions. What else can you guys come up with? See 23 folks in here. So do not be shy. The again the thing is the more you guys give me here, the more personalized it will be for you. Whereas if I'm left to my own devices, I might come up with a bunch of shit that everybody hates. Hopefully not but it could be that could happen. H says how to assess and deal with the tradeoffs of account size introduces to one's use of profit mechanisms when to size up and use defined risk for smaller undefined positions would be one. That's a really good one. So it's kind of like understanding trade offs with a small account versus large account. And then there's a second one in there as well which is kind of directly tied to profit mechanisms. So how call it like profit mechanisms accessible and inaccessible.",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 80,
      "start_timestamp": "00:06:36",
      "start_timestamp_seconds": 396.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=396"
    }
  },
  {
    "text": "one. That's a really good one. So it's kind of like understanding trade offs with a small account versus large account. And then there's a second one in there as well which is kind of directly tied to profit mechanisms. So how call it like profit mechanisms accessible and inaccessible. Small account. That's it. This one by the way, this one is a motherfucker. That's why it's in there. That one is a pain in the ass to deal with. That's a really, really good one. Lauren says I had a question about different accounts. I only get three day trades in a week and I kept running out. Oh, interesting. Yeah, that sucks. PDT PDT is in bad in my opinion. I don't like regulation in the fact that like if somebody wants to light their money on fire, they should be allowed to light their money on fire. But so I don't like PD from that PDT from that sense. But I think a lot of traders look at PDT and they're like, Oh man, pattern day trade. And this is out to get me. They're just trying to keep they're trying to keep the little guy down. And it's like, it's kind of like require and see belts. They're trying to keep you from fucking yourself up because the overwhelming majority of people go that way. So yeah, Moody Blues says limited choices in what stocks I love that. So security selection. And finding good candidates. I",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 80,
      "start_timestamp": "00:08:15",
      "start_timestamp_seconds": 495.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=495"
    }
  },
  {
    "text": "And it's like, it's kind of like require and see belts. They're trying to keep you from fucking yourself up because the overwhelming majority of people go that way. So yeah, Moody Blues says limited choices in what stocks I love that. So security selection. And finding good candidates. I love that. Zack says if you want to trade a mag seven in any sort of time, you're usually looking at one option maybe two at the most same concept, which shares on higher price stocks. Yeah. So I also like that. So specific to mag seven access via options. And there's a bunch of stuff we can do for that actually, but it's a good one. Valerity says stock doing the opposites of what's needed immediately after entry. Fun fact. Blary. That shit doesn't go away. That's always going to be there. So small account, big account, we all get kicked in the nuts the same. And I am literally convinced that if you and I were on a phone call and we were like, yo, I'm going to put this one on you put the exact opposite on the market will find a way to fuck us both near guaranteed near guaranteed. So I appreciate that as a point will definitely talk about it. But this is this is our reality as traders is no matter what you do. The market is immediately going to not it's immediately going to fuck you. And there's nothing you can do",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 80,
      "start_timestamp": "00:09:54",
      "start_timestamp_seconds": 594.4799999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=594"
    }
  },
  {
    "text": "near guaranteed near guaranteed. So I appreciate that as a point will definitely talk about it. But this is this is our reality as traders is no matter what you do. The market is immediately going to not it's immediately going to fuck you. And there's nothing you can do about it. It's awesome. Literally the greatest. Corey says wrist management. Can you expand on that a little bit more? It's a really good one. But I want to know if there's anything specific to wrist management that you're thinking of is it utilization of the portfolio? Is it trade sizes? Is it stuff like that? Because I can see a bunch of different angles. And we'll talk about wrist management actually pretty comprehensively. But if you have a specific tight stops and profit ratio got it. Yeah. So wrist reward ratios. Stop requirements. That's a good one. I dig that one. This is a good list. Okay. So next couple of things I want to do. I'm going to layer on some of mine. You can agree or disagree like genuinely. Let me know if it's something that's like that. It's not super relevant or like yeah, that's a good one. Well, you don't have to tell me if it's a good one. Just tell me if it's a bad one. But I'm going to lay around some ideas that I have now. And then after this, what I want to do is actually talk a little bit about",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 80,
      "start_timestamp": "00:11:33",
      "start_timestamp_seconds": 693.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=693"
    }
  },
  {
    "text": "good one. Well, you don't have to tell me if it's a good one. Just tell me if it's a bad one. But I'm going to lay around some ideas that I have now. And then after this, what I want to do is actually talk a little bit about the markets. Because there's some interesting stuff going on that beginner traders may or may not be paying attention to that I think are worth discussing. Random skate says I'd love to know more about stop loss and taking profits got it. Stop loss selection and profit taking approach. Those are great. These will depend heavily on the trading approach. But there's absolutely stuff that we can do. Definitely stuff that we can do to manage it. So for me to add on a couple more, one of them is portfolio correlation. I think that's really difficult to manage because with a smaller portfolio, you're kind of stuck into some smaller names. Unless you do some other stuff, which we'll talk about. And a lot of times, those smaller names can have pretty strong correlation. So then you're actually building a portfolio that might be a little more exposed than you might think. So that's one that I see a lot. The next one is strategy hopping. This is where I see traders. And again, like what you got, you guys know the drill. One of my favorite things to do is literally just go on to Reddit and just",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 80,
      "start_timestamp": "00:13:12",
      "start_timestamp_seconds": 792.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=792"
    }
  },
  {
    "text": "you might think. So that's one that I see a lot. The next one is strategy hopping. This is where I see traders. And again, like what you got, you guys know the drill. One of my favorite things to do is literally just go on to Reddit and just see what people are saying. So I'm going to type in the search bar, small account. And let's just see what pops up here. I'm going to keep it split. Oops. Sure, we'll look at that one. That one, I'll look at both of these. Let's see, I have a 500. God. Hey, 500. Count, that's fucking nuts. Jesus. Guys, this is the kind of thing where if you're in this, just save. Please, just save your money. Don't trade it. There's nothing you're going to do with that amount of money that's constructive. Just don't trade it. Okay. Anyways, that's not the word. That's not where we're here for. Eric, stay to task. Is that this one? Let's see. You want a bunch of research day trade and particularly scalping, scalping. That's one that we actually have to talk about. Now, back to this strategy hopping thing that's worth talking about right now is traders have to be aware of things like path dependence. And they have to or path dependence, if you prefer that one, they also have to be resistance to streaks and then strategy development that goes into that. Scalping is bad. Okay. Next. Count of",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 80,
      "start_timestamp": "00:14:51",
      "start_timestamp_seconds": 891.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=891"
    }
  },
  {
    "text": "talking about right now is traders have to be aware of things like path dependence. And they have to or path dependence, if you prefer that one, they also have to be resistance to streaks and then strategy development that goes into that. Scalping is bad. Okay. Next. Count of capital, 1,500 is it better to go trading your DTE options for scalping or one to two e-minis? Got it. Okay. We got that from there. Random says, I've heard you probably fit target. Wait, hold on, I'm fucking confused. I've heard you probably fit target. Should be three extra stop loss to make it worth trading. I see sort of, but I think I get your general. I think I get your general just here. So stop loss selection is stuff here also like always risk xx to yy gain always exit at xx point. Good. Okay. I like that idea too, actually. You didn't really mention it outright, but I think it's one that's worth talking about, which is this idea of like worth trading. What makes it worth trading? This one's going to piss everybody off when we talk about that one, so I can't wait. I heard you that says suggesting limited options when adjusting trades are a pain point for small accounts, suggesting limited options. Sometimes you need more money to adjust. I see. So kind of like trade adjustments with limited capital. Because that's a great point. A big part of planning a trade",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 80,
      "start_timestamp": "00:16:30",
      "start_timestamp_seconds": 990.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=990"
    }
  },
  {
    "text": "heard you that says suggesting limited options when adjusting trades are a pain point for small accounts, suggesting limited options. Sometimes you need more money to adjust. I see. So kind of like trade adjustments with limited capital. Because that's a great point. A big part of planning a trade with a small account exactly to your point is not just thinking about the trade that's going on, but then also how you'll be able to manage that trade. So that's good. All right. I have a couple more that I actually want to to put on here. One of them is euphoria and despair. The other is money focus. It's funny because oh, oh, fuck, there's a huge one. There's now this one has an underlying assumption BTDubs. If we're talking about trading with a 5K account that we're probably talking about a smaller like a newer trader, I should say, but the thing that's worth emphasizing here is trading before understanding options. This is great. I love these. Now, if you have any other ideas that you think would be pain points with respect to trading a 5K account, please throw them in throughout the rest of the chat. That's totally cool. What I want to do though is actually start with a little bit of a practical application quiz together. And this is not something I built ahead of time, but I want to get a baseline for for people. So first things first, let me I",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 80,
      "start_timestamp": "00:18:09",
      "start_timestamp_seconds": 1089.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=1089"
    }
  },
  {
    "text": "chat. That's totally cool. What I want to do though is actually start with a little bit of a practical application quiz together. And this is not something I built ahead of time, but I want to get a baseline for for people. So first things first, let me I need to do a poll. I want to know for the folks that are watching now is like account size, account size. And there's only going to be two choices. Is either going to be less than 5K, or greater than 5K. I have no idea why I would put the dollar sign there and the whatever. Listen, y'all don't know me. 5K. Okay. Do me solid. Take that poll. Let me know if you have less than 5K greater than 5K because what I want to get a sense of when I go through the next general questions I have with respect to options trading. I want to see. I want to see like the breakdown between people that have larger accounts, well, larger than this versus smaller than this. Damn, this is I'm not even going to lie. This is actually shocking to me. Maybe this makes maybe this makes sense because most of the people that filled there was 90 people that filled out the survey that wanted to do this the trading with 5K. But as I look at this, the overwhelming majority of you have more than 5K. So it makes me curious like why",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 80,
      "start_timestamp": "00:19:48",
      "start_timestamp_seconds": 1188.9599999999998,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=1188"
    }
  },
  {
    "text": "this makes sense because most of the people that filled there was 90 people that filled out the survey that wanted to do this the trading with 5K. But as I look at this, the overwhelming majority of you have more than 5K. So it makes me curious like why the fuck did we pick trading options with 5K? Or is it that the people that attend the live streams kind of get a sense of what the fuck they're doing so that they're not stuck with 5K? And then the people that filled out that poll on YouTube might be the more aspirational group that's hoping to figure out how to learn, but then they don't actually show up to learn. Maybe that's it. 88 of you. So then this does beg the question, are we doing? Are we doing the right focus for the beginner series? Age says I think it might be the latter to be honest. I kind of think it might be. Like, I actually might think that could like I do think that might be the case. So then let me let me close this one. I'm actually now super curious. And I'm going to launch another poll. And in this poll, I literally want to look at these choices. And I'm curious what the subset is between the people on the stream versus the people that took the poll. Take this poll, please. I have to modify someone because it doesn't let me",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 80,
      "start_timestamp": "00:21:28",
      "start_timestamp_seconds": 1288.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=1288"
    }
  },
  {
    "text": "to launch another poll. And in this poll, I literally want to look at these choices. And I'm curious what the subset is between the people on the stream versus the people that took the poll. Take this poll, please. I have to modify someone because it doesn't let me use as many words. Okay. And y'all just fucking didn't like profit mechanisms. That sucks. Very disrespectful. I think that's a fun one. 13 of people didn't like. That's it. It looked crazy. If there's typos, it's because I ran out of space. It doesn't let you have that many words. So please take this poll. So this is the poll that I posted on YouTube. That's effectively asking what topic do you want to focus on for the next eight episodes? I might still do this one, but I might condense it down from eight episodes and do like two episodes. And then depending on what the group picks here that actually shows up to the streams, then I might pivot. This is so for those that don't know, I did a lot of stats in my undergrad and grad. So shit like this is actually super interesting to me. And that hypothesis that I gave you is quickly made, but I do think it might be reflective. It could be the case that the people that filled out this poll here, the 90 people that filled out this poll, where the majority of them wanted to cover this,",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 80,
      "start_timestamp": "00:23:07",
      "start_timestamp_seconds": 1387.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=1387"
    }
  },
  {
    "text": "me. And that hypothesis that I gave you is quickly made, but I do think it might be reflective. It could be the case that the people that filled out this poll here, the 90 people that filled out this poll, where the majority of them wanted to cover this, it might be the kind of people that have a small account. And they're like, I want to grow a small account, but they might not actually be actively doing the things. They might be watching the recordings not physically on the stream. Like there's a million different things, but I wouldn't expect there to be that big of a disparity because that's a big disparity, like less than 20 of you, almost less than 10. It's literally like 11 of the sample size, small sample size 17, have less than 5K. That's crazy. Like I wouldn't expect that kind of variance between these because I also got rid of these two buckets. So it's only between these two. So the discrepancy between, yeah, the discrepancy between account sizes there is kind of crazy. Okay, so this is deep dive into option strategies that's 15 votes, pretty clear majority. This makes sense to me. This is exactly what I would expect you guys honestly to want. Man, I thought I was like super disconnected there for a second because this, this shocked the shit out of me. Very interesting. Okay. So then that changes our gameplay in a little bit.",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 80,
      "start_timestamp": "00:24:46",
      "start_timestamp_seconds": 1486.1999999999998,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=1486"
    }
  },
  {
    "text": "makes sense to me. This is exactly what I would expect you guys honestly to want. Man, I thought I was like super disconnected there for a second because this, this shocked the shit out of me. Very interesting. Okay. So then that changes our gameplay in a little bit. As always, this is the fun part about what we do here is that like this little, this stuff is for you, like literally for you. So what I'm seeing is that the majority of people on the stream have over 5,000 account. So then what we're talking about here is not super relevant to everybody, although again, a lot of the concepts are. So then what I intend to do actually then, we could literally just, we'll literally just work through this today together right now. We'll talk about this concept since we're here and we already listed this stuff out. And then the next one will literally start deep diving strategies. I think that would make sense. Jared says, I feel like profit mechanisms is a big part of the deep dive of your strategy. Sort of. Now when I, when I explore deep diving strategies, I'm not going to go into the knit and wait detail. And it's for a few reasons. But we absolutely will discuss profit mechanisms in there, but we're not going to go into like the analysis of the profit mechanism, the measuring of it, the traits, the qualities, like all that kind",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 80,
      "start_timestamp": "00:26:25",
      "start_timestamp_seconds": 1585.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=1585"
    }
  },
  {
    "text": "going to go into the knit and wait detail. And it's for a few reasons. But we absolutely will discuss profit mechanisms in there, but we're not going to go into like the analysis of the profit mechanism, the measuring of it, the traits, the qualities, like all that kind of stuff. Because if I do that with the strategies, it that literally could be a year long series. It's, it's that amount of depth. That's one of the difficult parts with making content about trading is that in order to give you guys quality stuff, it, it, there's just so much to it. It's so funny. I literally recorded a video like two days ago. And the video is about the basics of back testing. It was following an outlier pro stream where we talked about this. And I said, oh, let me just make a quick video that talks about literally the bare bones basics. That video is 23 fucking minutes long. The bare bone basics. Like the absolute bare bones. So I'm senior, it's like, there's just so much detail on this stuff. But yeah, well, we definitely will talk about propped mechanisms for sure. You have to, but not, not in super far detail. If we talked about profit mechanisms by its own thing, which we can still do in the future, that would be based way more on how to find them and like on your own and how to measure them on your own,",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 80,
      "start_timestamp": "00:28:04",
      "start_timestamp_seconds": 1684.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=1684"
    }
  },
  {
    "text": "to, but not, not in super far detail. If we talked about profit mechanisms by its own thing, which we can still do in the future, that would be based way more on how to find them and like on your own and how to measure them on your own, like that kind of stuff. Well, random says, what would you say to someone that has 5K, but is only comfortable trading 500, because they are new and not confident in their abilities, but are having fun making small trades and learning. I don't hate that. I don't hate that at all. I think that person would probably be better off paper trading for a little bit. I think then if they've paper traded for at least three months and they're enjoying that process, they're getting value out of that and then decide to move it to production and go live with a small amount of money. That's cool. But the thing is, is I really do believe not just like practicing hard, but practice like you play. And one of the downsides is if you do that, the path to being comfortable trading in actual account becomes more difficult. And I'll show you why. So your brain is pretty neat. It does a lot of cool things. One of the things it does, though, that fails you is that it doesn't adequately measure losses and gains the same. It doesn't, these are not equal. And this makes biological sense.",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 80,
      "start_timestamp": "00:29:43",
      "start_timestamp_seconds": 1783.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=1783"
    }
  },
  {
    "text": "And I'll show you why. So your brain is pretty neat. It does a lot of cool things. One of the things it does, though, that fails you is that it doesn't adequately measure losses and gains the same. It doesn't, these are not equal. And this makes biological sense. If I am a Neanderthal, which is funny enough, I did a couple of those DNA tests and I have a disproportionate amount of Neanderthal, which makes sense because I'm a fucking idiot. So as a caveman with a stick, I think my stick would look a little better than that. I would probably have like a Tomahawk. I bet. I would be more inclined to have a Tomahawk. Which might look like a bow tie to some or like a pencil with a bow tie, but it's not, that's a Tomahawk. And if I have the choice between getting food, adequate amount of food, or if I have the choice of getting more food, I'm going to pick adequate food. Okay. So then if we progress to the next series and I have the adequate food, I have this. If I have the choice between keeping my four food cubes, or if I have the choice of gaining a food cube, however, at the outset or at the conclusion of this, I'm either going to lose my four food cubes or I'm going to gain the five food cubes on top and get to nine food cubes. I don't",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 80,
      "start_timestamp": "00:31:22",
      "start_timestamp_seconds": 1882.5199999999998,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=1882"
    }
  },
  {
    "text": "cubes, or if I have the choice of gaining a food cube, however, at the outset or at the conclusion of this, I'm either going to lose my four food cubes or I'm going to gain the five food cubes on top and get to nine food cubes. I don't view these the same. And it's because if I have the four cubes, I survive. I live to fight another day. And I am still able to go continue living. The marginal gain of getting the extra five cubes doesn't matter that much because my baseline is met. The risk of losing this baseline becomes much more important to me than the prospects of marginally gaining more. This applies to trading because as developed as we think we are, we are still vertical monkeys. That's it. We are nothing more than that. What that means is if I start trading with a five hundred dollar account, because that's what I feel comfortable with. But let's say that I have a hundred thousand dollars. What ends up happening is I need to then get myself comfortable moving from, let's just say that you're sizing stuff at one percent just to pick a number. So in this case, I'm seeing five dollars of risk. That's all I'm seeing here. Whereas in this scenario, I go to what a thousand dollars of risk. I need to make this change in my mind. And I need to be comfortable with this. This is a",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 80,
      "start_timestamp": "00:33:01",
      "start_timestamp_seconds": 1981.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=1981"
    }
  },
  {
    "text": "a number. So in this case, I'm seeing five dollars of risk. That's all I'm seeing here. Whereas in this scenario, I go to what a thousand dollars of risk. I need to make this change in my mind. And I need to be comfortable with this. This is a big fucking distance. So what ends up happening is if you start with a small amount of money and you get used to seeing those numbers, they become comfortable. You're used to them. Then the prospects of moving up to the next rung is difficult because then you have to get comfortable with seeing new numbers. Now this is a balance because I would never say for a brand new trader to start trading with all your money. That's crazy. But that is why I like paper trading so much. Because if you paper trade with an account that's relative to whatever your real money is, you get used to seeing these numbers and they become more and more relative to you. You're comfortable with them. You're like, oh, I just lost a thousand dollar on this trade. Your typical brain would say, oh, fuck, that's a thousand dollars. I could have used a thousand dollars to get this that the other thing. But then you condition that where it's like, no, man, this is a percent of the portfolio. This is okay. And this is sized appropriately. You condition yourself to be okay with this. This goes all the",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 80,
      "start_timestamp": "00:34:40",
      "start_timestamp_seconds": 2080.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=2080"
    }
  },
  {
    "text": "could have used a thousand dollars to get this that the other thing. But then you condition that where it's like, no, man, this is a percent of the portfolio. This is okay. And this is sized appropriately. You condition yourself to be okay with this. This goes all the way back to randoms question of somebody that has 5K only comfortable trading 500. When you do those kinds of things, you make this journey harder, longer term. And this does not apply to everybody. This applies to people like me that grew up without much and scarcity, big scarcity mindset. Whereas people that typically grow up with a little bit more or other people that grow up without much, but are just more risk open, that's a little tricky because this applies more so to scarcity. Whereas people that are risk open, this process is not that difficult. So I'm just giving that caveat. Okay. So let me see. There was a couple others in here that I wanted to, let me see. Lauren says, maybe you can touch on common mistakes at some point. I'd like to think I special, but don't think I am. When you say common mistakes, what do you mean? Common mistakes and what? Random says, what's your favorite paper trade to use? I've used Wee Bowl. Anybody who knows me, what's my answer to that? There will be people in the chat that will be able to tell you pretty quickly what my",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 80,
      "start_timestamp": "00:36:19",
      "start_timestamp_seconds": 2179.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=2179"
    }
  },
  {
    "text": "common mistakes, what do you mean? Common mistakes and what? Random says, what's your favorite paper trade to use? I've used Wee Bowl. Anybody who knows me, what's my answer to that? There will be people in the chat that will be able to tell you pretty quickly what my favorite is. I bet. I feel comfortable making that bet. I'll take the under. Any guesses? So far all are wrong. This is actually hilarious. Maybe maybe I took the wrong bet. Ah, thank God. Ricky, thank God. I thought that I was about to be, I don't know what the bet was going to be, but I was about to be fucked. That's it. Ricky has it. It's not using a platform. You do not need a platform. Actually, I think using a platform is suboptimal, literally suboptimal. I think putting it in Excel, Google Sheets, something like that is always the right choice. Always the right choice. The reason is because it allows you to analyze stuff. You cannot analyze stuff when it's in a platform interface. You can just see it there. Whereas if I put it in Excel or Google Sheets, I can track the trades that I made at different points. I can track my thought process at that point in time, not knowing what the future looks like. I can track the adjustments that I made and what impact that had on the profitability. I can test different kinds of signals that might be",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 80,
      "start_timestamp": "00:37:58",
      "start_timestamp_seconds": 2278.8399999999997,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=2278"
    }
  },
  {
    "text": "that I made at different points. I can track my thought process at that point in time, not knowing what the future looks like. I can track the adjustments that I made and what impact that had on the profitability. I can test different kinds of signals that might be relevant that I think might be relevant to the strategy. Then I can literally measure how effective those signals are at predicting the profitability, predicting the profitability of the strategy. I can't do any of that if I do it in a platform. The secret, and thank God for Ricky, otherwise my bet was going to be terrible, is literally just put it in something that you can track. Now, I generally would insist not on a Google doc, not on a piece of paper. It's because you can't do data analysis on those. You can do data analysis in Google Sheets. You could do data analysis in Excel, that kind of stuff. However, you don't have to make this stuff super crazy because when it comes to Google Sheets and whatnot, I don't fucking know what I'm doing. I just figure it out as I go. But you can start with stuff that's really, really simple and then build it out over time. I've done a couple of versions where I've shared basic trade logs and stuff. We actually worked through one of those in one of the pro livestreams not that long ago. The secret to making a",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 80,
      "start_timestamp": "00:39:37",
      "start_timestamp_seconds": 2377.9199999999996,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=2377"
    }
  },
  {
    "text": "start with stuff that's really, really simple and then build it out over time. I've done a couple of versions where I've shared basic trade logs and stuff. We actually worked through one of those in one of the pro livestreams not that long ago. The secret to making a good trade log is taking the time to define stuff first. If you take the time to define stuff first, the making of a trade log is it genuinely is super easy. Here's what I mean. If I don't even know what all this stuff is, this is all old video stuff. We can get rid of this one. We can get rid of this one. Oh fuck. This is all just giant mess. This is great. This is literally perfect. This is literally perfect. So this literally is the start of a log. Now, the way that I typically would build a log, though, before doing any of this stuff, pretend none of this is here. As a matter of fact, to help you to pretend there, it's not there. You cannot see it. Therefore, it's not there. Kind of like, if I close my eyes, the Boogeyman isn't there. That's what's happening right now. The Boogeyman is gone. Let's say that I need to build trade log. And I'm trading a, what kind of strategy you guys want to trade? Pick a random strategy. I don't mean an option structure. I mean, a strategy. I need a profit",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 80,
      "start_timestamp": "00:41:17",
      "start_timestamp_seconds": 2477.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=2477"
    }
  },
  {
    "text": "there. That's what's happening right now. The Boogeyman is gone. Let's say that I need to build trade log. And I'm trading a, what kind of strategy you guys want to trade? Pick a random strategy. I don't mean an option structure. I mean, a strategy. I need a profit mechanism for me to be able to do this with you. Otherwise, I have, I've nut them for you. So what kind of profit mechanism? What kind of strategy do we want to trade? Positive drift. Beautiful. So we're going to trade positive drift. And we're going to call this longer term. So we're going to define that by at least six months. Okay, great. What kind of signals are relevant to this? Maybe stuff like prior, one year, six month, three month, one month, return, percent return. Maybe I think another thing that matters is percent off 52 week high. Maybe I think something else that's relative is spot price relative to moving averages and so on and so forth. So what I'm doing here is I'm before I even worry about what the fuck I'm going to put into Excel Google sheet. None of it matters yet. What I'm doing is I'm figuring out what is the stuff that I think allows me to trade this. And then once I have this, then I can worry about building a log that's logical that is efficient for me to work through that kind of stuff. So it literally starts",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 80,
      "start_timestamp": "00:42:56",
      "start_timestamp_seconds": 2576.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=2576"
    }
  },
  {
    "text": "I'm doing is I'm figuring out what is the stuff that I think allows me to trade this. And then once I have this, then I can worry about building a log that's logical that is efficient for me to work through that kind of stuff. So it literally starts by defining these things. So now let's take a look at building, well, let's keep that up. Let's talk about building something relative to this. So we know that we need the basic stuff that applies to everything, right? So like we need day, we need ticker, we need all that bullshit. Don't worry about that. I'm literally going to build inputs though. So I'm going to say trailing one year percent return, trailing six month, percent return. And so on and so forth, right? So I'm going to build these out. So then what I can do is, okay, the trailing one year return is 45 the trailing six month is 32. And then what I can do is I can say, all right, as I'm analyzing the performance of all of these entries over time that eventually get built out, I can say, I wonder which one of these is more important, which one of these is more predictive of my profitability in holding these. Is it one year, six month, three month, one month? That's usable information that allows me to understand maybe one of these doesn't even matter. Maybe I run a random forest test to",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 80,
      "start_timestamp": "00:44:35",
      "start_timestamp_seconds": 2675.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=2675"
    }
  },
  {
    "text": "these is more important, which one of these is more predictive of my profitability in holding these. Is it one year, six month, three month, one month? That's usable information that allows me to understand maybe one of these doesn't even matter. Maybe I run a random forest test to check assignment for the variables and strengths. And I find that six months, well, it would in this context, so it's a bad example, one month, one month, trailing one month. And I might find that trailing one month for this profanacism literally doesn't matter. So I track it for six months. I run this study once I have a decent sample size. I find that there's nothing there. So guess what I do? Get fucking rid of it. Don't have to track that anymore. That's not a question I have anymore. I know it doesn't because I tracked it. I saw it with my own eyes. I ran the study. I could see it. So then I know that when I remove it from my list, there's not like this question mark in my mind of like, oh, shit, maybe I'm missing something that could have been great. Maybe I just need to track this other thing that's better. I know it's not the case. I really could see it. So this is the way that I would be able to trade log. Now, one of the things to pay attention to is notice how I'm using numbers. You",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 80,
      "start_timestamp": "00:46:14",
      "start_timestamp_seconds": 2774.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=2774"
    }
  },
  {
    "text": "I just need to track this other thing that's better. I know it's not the case. I really could see it. So this is the way that I would be able to trade log. Now, one of the things to pay attention to is notice how I'm using numbers. You have to be thoughtful as you're building the trade log so that you're building something that you can conduct good data analysis on. If you conduct data, you can't conduct data analysis on like a note section where it's like I felt sad because I'm a sad boy. I can't do shit with this other than the fact that make fun of somebody for being this. I can't do anything with it. It's literally useless. Now, if you are doing something where you think your input is a big enough variable to disturb the outcome, you can track it. And then you can still look at it, but you'll have to conduct a qualitative data analysis or you just have to be smart with the kinds of things that you put into your notes. So you can do stuff like rate on a scale of one to 10, whatever it is that you're trying to qualify and quantify. Then you can add a word picture next to it for your own reference, but then your rating is a number. So then you can see, well, when I rate myself as a seven, I tend to do better than when I",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 80,
      "start_timestamp": "00:47:53",
      "start_timestamp_seconds": 2873.3199999999997,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=2873"
    }
  },
  {
    "text": "is that you're trying to qualify and quantify. Then you can add a word picture next to it for your own reference, but then your rating is a number. So then you can see, well, when I rate myself as a seven, I tend to do better than when I rate myself as a two. So I know that if I'm about to put a two in the trade as I'm about to enter it, I might say to myself, I'm a fucking two right now. I mean, well, I'm always a two. So that's where I'm at. But maybe I'm maybe I'm a one. And I said, well, I'm a one now. So can't do anything. Maybe I'll just pass on this one. It's not worth it. Tens not to work out for me. That's the process of building a trade log, something that's actually relevant for you. Okay. Freak-a-leak. Any signs of upcoming bone cone? That's a great question. I don't think so. It actually looks like we're going the wrong way, but as you know, it's always tomorrow, even on the weekend, it could be tomorrow. EHUDGE says, I have a larger account. I'm comfortable with trading with a smaller account investing with the additional funds. And that could be the case, right? Like if somebody doesn't necessarily have a great trading skill set, they're very likely to be more comfortable with investing with most of the money and then trying to build the skill set with",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 80,
      "start_timestamp": "00:49:32",
      "start_timestamp_seconds": 2972.3999999999996,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=2972"
    }
  },
  {
    "text": "with a smaller account investing with the additional funds. And that could be the case, right? Like if somebody doesn't necessarily have a great trading skill set, they're very likely to be more comfortable with investing with most of the money and then trying to build the skill set with the subset of the account. That's completely okay. And for a lot of people, that's probably going to be better for them than trading with the full account because, yeah, like when you're trading with a full account, you have to show up. And until you have a good proven track record with yourself that you can develop that trust, I think that kind of approach makes a ton of sense. I like that. Nascar says, trade logs make me think of that mark, twain quote. History doesn't repeat itself, but it often rhymes. Yeah. I think that that's, I think that that's very fair. And I think by having a good log, it gives you so much usable information that funny enough, it answers most of the questions that traders have. Seriously, if you think about traders when they ask stuff like what DTE is best, what Delta is best, all of that is solved. If you paper trade for a while, if you back test, if you paper trade, and you track the results, like you literally answer your own questions with that kind of stuff if you just do the work, but a lot of people not",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 80,
      "start_timestamp": "00:51:11",
      "start_timestamp_seconds": 3071.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=3071"
    }
  },
  {
    "text": "best, all of that is solved. If you paper trade for a while, if you back test, if you paper trade, and you track the results, like you literally answer your own questions with that kind of stuff if you just do the work, but a lot of people not so much. Random says, do you have an old video where you make a trade log from scratch? Going to try to make one over the weekend. I don't know. I don't know if I do one where it's like kind of like this practical application style. Like I said, we definitely did one with the pro. This one is maybe try that video. I don't think there's a ton in there, like with respect to like a specific log. But what I do, I think I do remember some of that video that talks about the two components of a trade log, which I think are really important. Really is for trade log inputs. There's like two buckets as far as I'm concerned. One bucket is stuff that applies to everything. And I would start with this bucket first. The second is strategy specific. So an example of stuff that applies to everything that's going to be ticker. Spot price. Eight. No matter what you're doing, all of these are going to be relevant in every single one of them every single time. So you have this group of stuff that's relevant to everything. Then you have this group",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 80,
      "start_timestamp": "00:52:50",
      "start_timestamp_seconds": 3170.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=3170"
    }
  },
  {
    "text": "that applies to everything that's going to be ticker. Spot price. Eight. No matter what you're doing, all of these are going to be relevant in every single one of them every single time. So you have this group of stuff that's relevant to everything. Then you have this group of stuff that's specific to a strategy, kind of like this stuff here. If I'm trading earnings releases, none of this shit matters. But if I'm trading positive drift over the long run, expecting at least the six month holding period, this stuff is relevant to that. So then that's where it's strategy specific. So I would split it up into those two buckets personally. I think that's a good way to go about it. All right. Let's talk about these. Because this really isn't going to take that long. And then this will prime us to be able to look at the next topic next week. This we've talked about actually a million times. There's a super simple way to explain this. So when we talk about the return expectations for a small account, for the dollar expectations, I should say. And this is always worth talking about. This is on the website. You can go to it whenever you want. But let's say you have a 5,000 account. Let's say you're not saving anything because I actually know it's used that example. You have a 500 account. You can't save anything. And let's say that you're going to",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 80,
      "start_timestamp": "00:54:29",
      "start_timestamp_seconds": 3269.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=3269"
    }
  },
  {
    "text": "is on the website. You can go to it whenever you want. But let's say you have a 5,000 account. Let's say you're not saving anything because I actually know it's used that example. You have a 500 account. You can't save anything. And let's say that you're going to trade it for 20 years. And let's say that you get a crazy return of 30. In 20 years, what do you have? Nothing. You have nothing of interest after 20 fucking years. Now, if you notice, if you literally saved 100 a month, you would have 851,000 compared to this 10 times the amount. So the point that I'm making here is that for a really small account, the percent return has to be the focus, not the dollar return. And here's why. If we have that 500 account, and let's say that we have a 500,000 account. And let's just do like a quick year breakout. And let's use, I have something on my screen. I don't like it. Let's use a couple different return profiles, but we'll start with a basic one. Let's just say 10. So in order to figure out what this will look like, there's a bunch of different ways to do the math, but we're just going to figure out what our return would be. The account size, I should say. And I'm going to add a column here so that we can measure what the nominal return was. A key. And let's",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 80,
      "start_timestamp": "00:56:08",
      "start_timestamp_seconds": 3368.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=3368"
    }
  },
  {
    "text": "there's a bunch of different ways to do the math, but we're just going to figure out what our return would be. The account size, I should say. And I'm going to add a column here so that we can measure what the nominal return was. A key. And let's put this in dollar, so that it penetrates. We need good penetration. Same return, 10 return. This 500 account becomes 550. You literally make 50. Couldn't possibly care less. 550,000 is a 50k return. That's something. That's not a ton, but it's something. So then if we chart this out over time, take a look at the difference between these accounts. Now it's like, yeah, no shit. If you have more money, you make more money. Here's the problem. The people with small accounts, they're so disenfranchised by this 50 year, by this 55 year, by this 60 year. That they're not paying attention to what the impact can be as their account grows. And they're completely inherently devaluing how important saving is. Saving is so unbelievably important in this conversation. Because let's say in year one, you are able to save 100. Completely detached from the return. I'm not going to bother adding it to the return and stuff. I don't care that much. But what I want to show you is what this is relative to your total return. 18. So even though you return 10 on the year, by saving 100 over the course that entire year,",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 80,
      "start_timestamp": "00:57:47",
      "start_timestamp_seconds": 3467.7999999999997,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=3467"
    }
  },
  {
    "text": "going to bother adding it to the return and stuff. I don't care that much. But what I want to show you is what this is relative to your total return. 18. So even though you return 10 on the year, by saving 100 over the course that entire year, that equates an 18.2 return, essentially doubling what you're able to produce. Now this differs. As your account grows, this number doesn't matter. Your savings rate represents 0.02 of your account. So in the beginning, savings is literally your superpower. And it only applies to when you have a small account. Savings becomes way more boring when you have a bigger account and you realize that you're not really doing a whole lot. But with this small account, even all the way out here, when you have this 12, 1300 account, saving 100, that gives you 7.7. That's a 7.7 return by just saving 100. So what ends up happening is small accounts are so disenfranchised with this return that they don't pay attention enough to their savings rate. And in the pursuit of trying to get a much bigger dollar return, they're pursuing a much bigger percent return and the risk of ruined skyrockets and the probability of them blowing up goes parabolic. So then instead of this 10 return, they want this to look like a bigger number. So they're like, well, I need to get maybe 100 return. Then maybe they're happy. But the problem is the",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 80,
      "start_timestamp": "00:59:26",
      "start_timestamp_seconds": 3566.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=3566"
    }
  },
  {
    "text": "the risk of ruined skyrockets and the probability of them blowing up goes parabolic. So then instead of this 10 return, they want this to look like a bigger number. So they're like, well, I need to get maybe 100 return. Then maybe they're happy. But the problem is the probability of hitting this 100 return is so low, especially early on. And then the probability of being able to hit 100 return multiple times is even lower still. And the probability of coming into a massive problem, meaning a count drawdown or blowing up an account in pursuit of 100 return is astronomically high. So this is why for small accounts, their dollar return expectations are completely fucked. And they should be focused way more. Simply on percent returns and understanding that those percent returns are not designed to grow your small account. What's going to grow your small account is saving. Those percent returns are designed for as your account starts to hit a higher value based on savings growing your income, the other wealth levers that we talk about. That changes everything. So for those that are unfamiliar, I refer to it as the three levers of wealth. I guess this is a triangle. Three levers. Maybe we'll do... Here's a wall. That's level one. That's level two. That's level three. Except they should be inverse. So here's your wall. That's level one. That's level two. That's level three. So this first one is savings. Next one's",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 80,
      "start_timestamp": "01:01:05",
      "start_timestamp_seconds": 3665.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=3665"
    }
  },
  {
    "text": "wealth. I guess this is a triangle. Three levers. Maybe we'll do... Here's a wall. That's level one. That's level two. That's level three. Except they should be inverse. So here's your wall. That's level one. That's level two. That's level three. So this first one is savings. Next one's income. Next one's return. Slash investing. So the point is for these small accounts, this is the focus. This is the thing that you're working on in the background, not for the immediate impact it's going to have on your small account, but the synergistic effect it will have when these two tie together. That's the point. So most traders with a small account just have a completely broken model. Now, sizing trades relative to the portfolio is super easy. You size trades relative to the portfolio based on as if it was any other size portfolio. It has to make sense. So one of the things to keep in mind is a small account is very frequently going to be oversized even slightly. So an example is if... Let's just go back to this little model that we built since it's here and it's fun. Let's say that we were going to risk one percent of the portfolio. You're not going to get that far. That's the reality for a really small account. You're not going to get that far with that amount of money. So with a small account, you are literally forced to take more risk relative",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 80,
      "start_timestamp": "01:02:45",
      "start_timestamp_seconds": 3765.0399999999995,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=3765"
    }
  },
  {
    "text": "were going to risk one percent of the portfolio. You're not going to get that far. That's the reality for a really small account. You're not going to get that far with that amount of money. So with a small account, you are literally forced to take more risk relative to the portfolio, but that does not mean that you get to take a bunch of risk. It still has to be logical. So and this answer is actually a couple of the other things in here. What we're about to talk to. This one, it's going to answer this one. It's going to answer this one. This one. This one. This one. It's going to answer all those. What we need to do with a smaller account is accept the reality of what this is. So you can't risk five, five bucks. You literally can't put anything on in that case. A great starting point is to figure out what's in the realm of possibility. So if we go to Tesla, Tesla's fine. And let's take a look at the option chain. And let's say that we want to... That's a lie. Tesla's not finding. It doesn't have dollar increments. Maybe it does here. It doesn't. Maybe here. Do one half. Not what I want. I want some of the with dollar increments. Maybe Apple. Again, I'm answering one of those other questions in terms of product selection. Tesla wouldn't work. Apple so far isn't working, but it might.",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 80,
      "start_timestamp": "01:04:24",
      "start_timestamp_seconds": 3864.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=3864"
    }
  },
  {
    "text": "increments. Maybe it does here. It doesn't. Maybe here. Do one half. Not what I want. I want some of the with dollar increments. Maybe Apple. Again, I'm answering one of those other questions in terms of product selection. Tesla wouldn't work. Apple so far isn't working, but it might. Don't worry, it might. It doesn't. Fun fact. What I'm... Well, I'll show you in a second. Let's do Ford. Because I know Ford is like the quintessential broke boy stock. And let's say that you want to sell puts. Okay. So if we sell a vertical, we can assess what the sizing might look like. So you can get 17 bucks and you're risking 83. So now if we go back, this is using a dollar wide spread. So then just... This is just to get context. So now we're saying for this account, I'm just going to move this down here. And let's say that you find a trade where your risk is 83 dollars. Or not 83 percent. That would be crazy. 83 dollars is what we want. So what's that risk represent of the portfolio? 16 percent. It's a big risk. It's a big risk no matter what. In a 500 account, it's a huge risk. You're putting nearly 20 percent of your account in a dollar wide vertical. So what does this tell us? In my opinion, this tells us that there is absolutely no logical way for a 5,000 account to trade. Now, I'm",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 80,
      "start_timestamp": "01:06:03",
      "start_timestamp_seconds": 3963.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=3963"
    }
  },
  {
    "text": "matter what. In a 500 account, it's a huge risk. You're putting nearly 20 percent of your account in a dollar wide vertical. So what does this tell us? In my opinion, this tells us that there is absolutely no logical way for a 5,000 account to trade. Now, I'm not just basing this on this vertical spread, because somebody could say, well, what if you buy an option? Well, if you buy an option and you have a stop in place, you are completely destroying your ability to make money in that thing, unless your timing is perfect. Absolutely perfect. So even if you sell this put and you say, well, I wouldn't let it be the full 83 loss, I would use a stop. Okay, fine. Let's just... Let's explore this scenario together. So in this case, we're looking to make 17. We're risking 83. Okay. So first, what's the probability of these different scenarios? Let's analyze. The first question is, what's the probability of Ford being above... Let's just call it our short strike of 10 for Max Profit. What's the probability of this being above 10 at expiration? Well, we can use the options to tell this. The probability of this option being in the money at expiration, 30. So it gives us the inverse. So this is probability of loss. This is good old Pp. probability profit. This is technically some probability profit. This is PMP. I'm a Pimp. This is probability max profit. So",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 80,
      "start_timestamp": "01:07:42",
      "start_timestamp_seconds": 4062.2799999999993,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=4062"
    }
  },
  {
    "text": "this. The probability of this option being in the money at expiration, 30. So it gives us the inverse. So this is probability of loss. This is good old Pp. probability profit. This is technically some probability profit. This is PMP. I'm a Pimp. This is probability max profit. So this is 72. Sorry. Okay. And we can figure out now what the expected return is for this by itself. We have 72 chance of making our 17. And then we have a 38 chance of losing 83. Out of the jump, this doesn't look great. Reese says, wasn't it 62? 62 for what? The dollar wide spread? If it's, oh, is it the... Did I fuck up the probability? No, the probabilities are good. No. Wait, what do we talk about? So anyways, yes, this is the expected return. So this means as a raw position with just the probabilities, the volatility, everything that price does is this is if you were to continue doing this long term, that's what you would be expected to make. Not great. So then you might find though, maybe you're good at timing the market. So then maybe the neutral probabilities don't represent your actual realized probabilities because you're good at determining direction. You have some sort of edge based in your approach that increases your probability of making money. So then rather than this being 72, maybe it becomes 90. And let's see if that will do it for you. Now you",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 80,
      "start_timestamp": "01:09:21",
      "start_timestamp_seconds": 4161.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=4161"
    }
  },
  {
    "text": "your actual realized probabilities because you're good at determining direction. You have some sort of edge based in your approach that increases your probability of making money. So then rather than this being 72, maybe it becomes 90. And let's see if that will do it for you. Now you make money, right? So if you're able to be more directionally correct based on some sort of timing component, then this can make sense. But the broader point is now let's take a look and you say, well, I'm not going to let it get to 83. I would exit as soon as this hits 50 bucks. That still doesn't fix it actually. So let's do 40 bucks. That still doesn't fix it. It's 30 bucks. That fixes it. Make a buck. However, our probabilities just changed because if we take a look at when we would lose 30 bucks, that puts us here at 9.40. So now we just need to figure out what's the probability of touch at 940 in the duration of our trade, which is 18 July here. What's the probability of touching 940? 43.7. So you now have a 43.7 chance of getting stopped out. What just happened? We just fucking flip negative again. So this goes back to why sizing stuff relative and making sure that when we're talking about things like risk reward ratios, placing stops where the stops go, we have to pay attention to the impact of the stop on the",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 80,
      "start_timestamp": "01:11:00",
      "start_timestamp_seconds": 4260.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=4260"
    }
  },
  {
    "text": "What just happened? We just fucking flip negative again. So this goes back to why sizing stuff relative and making sure that when we're talking about things like risk reward ratios, placing stops where the stops go, we have to pay attention to the impact of the stop on the probability of the trade because it's profound. So this absolutely would require a trader to be quite adept at their broader trading skill set. So this is one of the biggest trade offs with trading a small account is that you have to do this analysis and you are naturally going to be oversized no matter what. So let's say rather than a 500, we have 5,000 account. So now if we put on this one point wide spread, you're still risking 1.6. That's large relative to what this is, but that's tolerable. So one of the things is you have to start moderating and changing what you're doing to fit what makes sense. Now for me, if I was trading a 5,000 account, this is not what I would do. I would not sit here and try to trade vertical spreads because I would have absolutely no plan of trading vertical spreads longer term in this kind of capacity. And I would be putting that money into either stock replacements and stuff that I could afford or saving the money and paper trading this to get the experience. But this isn't going to grow your account. This isn't going",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 80,
      "start_timestamp": "01:12:39",
      "start_timestamp_seconds": 4359.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=4359"
    }
  },
  {
    "text": "trading vertical spreads longer term in this kind of capacity. And I would be putting that money into either stock replacements and stuff that I could afford or saving the money and paper trading this to get the experience. But this isn't going to grow your account. This isn't going to do shit because the other thing is we haven't even, we haven't even entered friction. There's still costs to trade options. And as soon as you start adding those other components on top of this, it starts to become a pretty ugly picture pretty fast. So one of the big things here is understanding again, the biggest trade off with a small account like this is that you're going to be out just oversized and off-sides way too fast. So you have to trade it with a completely different mentality, which is not trying to trade the small account to turn it into a ton of money. But trading the small account in the effort to refine your approach and build the skills so that as you continue to aggressively save and build your portfolio, that you're ready to deploy that larger portfolio in a way that's positively expected and would make money. So let's go through a couple more of these. Any one of these that you really want to take a look at relative to a small account because we kind of just that one hit on a bunch of these simultaneously. This one's easy. PDT restrictions",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 80,
      "start_timestamp": "01:14:18",
      "start_timestamp_seconds": 4458.599999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=4458"
    }
  },
  {
    "text": "and would make money. So let's go through a couple more of these. Any one of these that you really want to take a look at relative to a small account because we kind of just that one hit on a bunch of these simultaneously. This one's easy. PDT restrictions on strategy change your strategy. That's literally it. You don't need to trade, you don't have to trade that frequently. You don't need that many cycles. It's actually bad for you for a small account with friction because if we go back to just what's your guys' standard commission? Or let's just say a single option. I don't know what it is for people. What would you say it is? 60 cents got it. Okay. So at 60 cents relative to your profit first, you're given up three and a half percent relative to your loss in the case of an adjusted loss you're adding two percent to your loss relative to the account relative to the entire account you're at 0.12 cost. This is expensive. This is very expensive. So the point that I'm making here is for these your cost of doing businesses high. H says public offers a rebate. You get eight cents a contract. That's bad. If you're getting a rebate, that means that your fills are not going to be good. And I think that's you're not going to see the upfront cost, but you'll see it in terms of what you're quoted and what",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 80,
      "start_timestamp": "01:15:57",
      "start_timestamp_seconds": 4557.679999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=4557"
    }
  },
  {
    "text": "a rebate. You get eight cents a contract. That's bad. If you're getting a rebate, that means that your fills are not going to be good. And I think that's you're not going to see the upfront cost, but you'll see it in terms of what you're quoted and what you can get a fill at. So it's just the cost will be hidden for you. It will be on the back end. The point that I'm making here is that for a small account that's trying to scalp, the other thing is a small account trying to scalp isn't looking to make 17 bucks. If it's a 500 account, they're looking to make 5-10 bucks. The friction that you're paying in order to pursue that is astronomically high. So this is easy. Small account, just don't trade that fucking much. You're not doing yourself any favors. Just do other things simple. Let's see if there's any other stuff. EHUD says trading before understanding options, buying slash selling stocks before options. I don't think that's I don't think you have to do that at all. I think it's completely fine to start with options right out of the gate. I think the main thing is taking the time to understand how options behave. That's super important. But yeah, the impact of trading options versus trading equities first, I would call it trivial. I think that there's absolutely nothing wrong with starting with options. I think it's completely fine. Another one,",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 80,
      "start_timestamp": "01:17:36",
      "start_timestamp_seconds": 4656.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=4656"
    }
  },
  {
    "text": "think the main thing is taking the time to understand how options behave. That's super important. But yeah, the impact of trading options versus trading equities first, I would call it trivial. I think that there's absolutely nothing wrong with starting with options. I think it's completely fine. Another one, we just talked about this right. So the way that you have to find good candidates, even if you're going to trade the smallest thing that you can find a dollar wide vertical, you still need to be able to size it so that the risk makes sense. So that's you have to you have to restrict your sphere to stuff that makes sense relative to the size of your portfolio as you're trading the smallest thing that you could possibly trade. Again, like a dollar wide vertical and something. Mag seven via options for a super small account like that 500 account is not happening unless you just buy a share outright, which you could do. The other thing is adding wings is probably the only choice. Now again, relative to a 5,000 account, you're going to be oversized even on a 2.5 dollar wide spread that still is going to put you a little bit big, but it makes it accessible by adding the wing. Other than that, you get to go on a hodge and go enjoy finding other stuff that small accounts have to trade because they're small accounts. Notice how I knew forward off the",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 80,
      "start_timestamp": "01:19:15",
      "start_timestamp_seconds": 4755.839999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=4755"
    }
  },
  {
    "text": "going to put you a little bit big, but it makes it accessible by adding the wing. Other than that, you get to go on a hodge and go enjoy finding other stuff that small accounts have to trade because they're small accounts. Notice how I knew forward off the top of my head. That's because when I had a small account, that's one of the most common things I traded. And it's because it's one of the only things I could fucking afford. This we already talked about. This will never go away. This is your fate forever as a trader. So enjoy it. This one. I think the important thing I want to talk about actually for both of these is that stop losses are terrible with options in general, especially if you rest a stop loss the overwhelming probabilities you're going to get a terrible fill and you're going to be hit too fast. So most of the time what I do is use mental stops via alerts. I set an alert and then I if I hear the alert go off, I'll go in and manually enter. The other thing is if I have to place a stop and it's going to be a resting stop, it has to be a stop market. It can't be a stop limit. And you know with the stop market, you're going to get an absolutely awful fill, especially if you're in a period where you need to stop. So",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 80,
      "start_timestamp": "01:20:54",
      "start_timestamp_seconds": 4854.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=4854"
    }
  },
  {
    "text": "a stop and it's going to be a resting stop, it has to be a stop market. It can't be a stop limit. And you know with the stop market, you're going to get an absolutely awful fill, especially if you're in a period where you need to stop. So you have to place it at a point accepting the fact and planning for the fact that you're going to get a terrible fill. But the point of those kinds of trades is like, I'm not going to be able to be near the computer. But if it goes beyond this, I have to get out. The only way you can make sure you get out via market. So as we stop market. But those would be very seldom. It would be very infrequent where I would try to use something like that. If that's the kind of scenario that I'm facing where like I know I couldn't be near the computer and I have to rest something, I would much prefer just to buy a wing and then just let it go with the wing. Now if it's something that you're going to have to manage before expiration for assignment risk and stuff like that, you have to figure that out. You have to make sure that you schedule some time in order to get to the trade before expiration. But getting out at defined points is stupid. It doesn't make sense. And when I say defined points, I",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 80,
      "start_timestamp": "01:22:34",
      "start_timestamp_seconds": 4954.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=4954"
    }
  },
  {
    "text": "assignment risk and stuff like that, you have to figure that out. You have to make sure that you schedule some time in order to get to the trade before expiration. But getting out at defined points is stupid. It doesn't make sense. And when I say defined points, I mean defined points across different things. Let's go back to this. Let's say that I'm trading a breakout strategy that has a 35 chance of hitting. So this one will be our win rate. This one will be our loss rate. So we have a 65 chance of losing. But if we hit, let's say we make a thousand dollars. And if we lose, let's say we lose 200 bucks. And we run our standard expected return calculations on these. You'll notice that this is profitable. Even though this has a low hit rate, it doesn't matter. Because when it hits, it hits big enough that it overwhelms the higher frequency of these smaller losers. You make money. You make good money. This is another massive problem for small accounts, thinking like high win rates is the is the way. And it's absolutely not. It's whatever works. Now, let's say though that you say, no, I need to get stopped out at 5 max loss all the time. Well, what ends up happening with something like that, then is your loss rate will go up. Your max loss would go down to whatever. But then that means that your hit",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 80,
      "start_timestamp": "01:24:13",
      "start_timestamp_seconds": 5053.079999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=5053"
    }
  },
  {
    "text": "though that you say, no, I need to get stopped out at 5 max loss all the time. Well, what ends up happening with something like that, then is your loss rate will go up. Your max loss would go down to whatever. But then that means that your hit rate absolutely has to contract pretty meaningfully. And you'll notice that that just made you 100 less good. And there's a chance that it literally could put you again in the scenario of what we're talking about, having, having your loss. It wouldn't just move you 15 points. You don't just move from 65 to 80 if you cut your loss in half. This would actually be closer to like 90. So then you can start moving yourself to a point where by applying that management, you literally lose money. So the point I'm making here is that your exit. It has to be made relevant to the strategy. It can't just be always do blank. It's not going to work. Ricky says, why not stop limit again? I find it hard to believe you wouldn't get filled if it's liquid within the bid ask, even if it's towards the more unfavorable side. You can find it as hard to believe as you want. That's the reality. As things are moving, bid ask spreads wide now tremendously. And you're still going to be sitting in a queue of orders. So there is an overwhelming chance that if you have some",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 80,
      "start_timestamp": "01:25:52",
      "start_timestamp_seconds": 5152.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=5152"
    }
  },
  {
    "text": "more unfavorable side. You can find it as hard to believe as you want. That's the reality. As things are moving, bid ask spreads wide now tremendously. And you're still going to be sitting in a queue of orders. So there is an overwhelming chance that if you have some sort of stop limit, you might not get filled. And then you might just be holding the thing that you don't want to hold. And that you already said, I need to get out at x points that you were now far beyond because you were being cheap on the exit. That's the nature with stops. If we're saying I have to get out at this point for my strategy to make sense for this to make whatever it is, then you have to get out. So trying to be cheap on an exit like that is typically not going to work super low. So the main thing is with a stop limit. There's not and it's not an insignificant chance. It's not a huge chance. But there is absolutely a moderate chance you don't get filled. So you could run that risk for sure. It's obviously up to the trader. But if I'm in the scenario where I have to have a stop resting, that already tells me I'm in a rare position where I have some serious risk that would have to be managed versus allowing the trade to play out and stuff like that. So it tells",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 80,
      "start_timestamp": "01:27:31",
      "start_timestamp_seconds": 5251.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=5251"
    }
  },
  {
    "text": "trader. But if I'm in the scenario where I have to have a stop resting, that already tells me I'm in a rare position where I have some serious risk that would have to be managed versus allowing the trade to play out and stuff like that. So it tells me like, I have to get out. So if I know I have to get out, then how to get out? It is what it is. That's the that's the primary reason why. This one. This one's super important. So a lot of small accounts will say like, oh, is this worth my while? And it can be worth your while. But the point is if you start the process of trading from the perspective of is this worth my time? It's like, bitch, you don't even know what your time is worth. You might be awful at trading and your time in trading might not be worth anything. It might lose you money. The main thing here is that you have to think of the deeper game. Again, you have to go back to this scenario. The value is not in getting the 10 return on your 500 account. That doesn't even matter. The value is building the skill to be able to generate a 10 return, 15 return, 20 return. And when that applies to a larger account, then it's very worth your while. But it's a small account. It's not going to be worth your while at",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 80,
      "start_timestamp": "01:29:10",
      "start_timestamp_seconds": 5350.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=5350"
    }
  },
  {
    "text": "That doesn't even matter. The value is building the skill to be able to generate a 10 return, 15 return, 20 return. And when that applies to a larger account, then it's very worth your while. But it's a small account. It's not going to be worth your while at all relevant to the time you put in and the dollars you make. That's just the reality of it. So you have to just completely change completely change your perspective here. Now, for profit taking, that's also super simple because that's going to be relative to the strategy. Whatever the strategy is that you built, the one thing I can generally say, the less you have to do something as an obstetricator, the better. So what that means is if you're profit taking wraps around like a ton of market interactions, you're probably doing a little too much. And you probably need to chill out because again, of the cost associated with it, which is not insignificant. Portfolio correlation is actually a really fun one. And I need to grab another seltzer water really quick so that we can keep going. So give me a second. I'll be right back. And I will have I will have a new spin drift ready to rock and roll BRB. Hey, yo, look at us fresh, fresh, cold spin drift. We are on pineapple, which is so good. The best. I want to talk to you about portfolio correlation for small accounts because",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 80,
      "start_timestamp": "01:30:49",
      "start_timestamp_seconds": 5449.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=5449"
    }
  },
  {
    "text": "And I will have I will have a new spin drift ready to rock and roll BRB. Hey, yo, look at us fresh, fresh, cold spin drift. We are on pineapple, which is so good. The best. I want to talk to you about portfolio correlation for small accounts because it's very, very challenging. Super challenging. So when you're trading a small account, you already have a very limited pool of stuff you have access to like really, really difficult. Jared says drink in the same you really cheers. Cheers to you, Jared. Good choice. The pineapple is the way, man. You're already trading a very limited set of things right from the jump. So then on top of trading a very limited set of things, you can't put on that many things because then you end up having too much risk on too fast. So let's just look at a general scoping scenario on how to manage this. And it's not that difficult. It just takes a little bit of thought. So let's say we do have this 5,000 account. And let's take a quick look at what a perspective portfolio could look like for it. And let's just eyeball it quickly. I don't want to spend too much time trying to pick stuff that I actually like. Okay, so forward. Maybe we do short call spread. We want this to the downside. And so does the rest of the market. So we're not going to make any money",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 80,
      "start_timestamp": "01:32:28",
      "start_timestamp_seconds": 5548.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=5548"
    }
  },
  {
    "text": "eyeball it quickly. I don't want to spend too much time trying to pick stuff that I actually like. Okay, so forward. Maybe we do short call spread. We want this to the downside. And so does the rest of the market. So we're not going to make any money doing it. Great. Love that for us. So trade one. We're looking to make 15 bucks. And we're risking 85 doll hairs. This is bold. They are bold. That's trade one. So then we can track what our total profit potential is. Then we can track what our loss is. And then again, we can go through the effort, which I typically would do of including the expected return, right? So inputting the probabilities for these and that stuff. I just don't want to waste the time doing it right now. And I just want to talk to you about trying to find different stuff. So then if we think about this trade, we can speculate and we can calculate what the beta-weighted delta's are. So let's say that this gives us minus one beta-weighted delta. This is good. So what I would do is I would start with the 5,000. I would look at the entire market, the economy, the stock market. I would say, what do I think about things? Do I want to be generally long? Do I want to be generally short? What's most relevant to me? And let's say that you want to be generally",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 80,
      "start_timestamp": "01:34:07",
      "start_timestamp_seconds": 5647.5599999999995,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=5647"
    }
  },
  {
    "text": "5,000. I would look at the entire market, the economy, the stock market. I would say, what do I think about things? Do I want to be generally long? Do I want to be generally short? What's most relevant to me? And let's say that you want to be generally long. Well, this is a good start actually because you have something that's giving you some short delta's right off the jump. So then as we look at other trades to put on in conjunction with this. So we look at trade two. And let's see if we can find something that would generally fit appropriately. One of the things that I would do for this kind of thing is maybe we literally go super, super rudimentary. And we just do something like this, a vol based scan. And what I would do here is I would get rid of the weeklies because that's going to naturally limit you to two few things. Right? If you look at all optionable names, it's 5277. If you limit it to weekly, it's like less than 1,000. Now the other thing is of this 5277, we know we can't afford a whole lot. So we can only get to stuff that's a dollar wide. So you can either limit this down and keep yourself out of the names that are let's just call it 150 bucks plus. Which takes you to 4655, you still have a ton of choices. And we run the",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 80,
      "start_timestamp": "01:35:46",
      "start_timestamp_seconds": 5746.639999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=5746"
    }
  },
  {
    "text": "So we can only get to stuff that's a dollar wide. So you can either limit this down and keep yourself out of the names that are let's just call it 150 bucks plus. Which takes you to 4655, you still have a ton of choices. And we run the scan. Okay. So this is looking for stuff with that's at least in the 50 IV percentile range. And we have a handful of names, NLY. What's this NLY? Kind of range bound so we can see maybe what a short put spread might look like. 33 Delta's. Yeah, that's fine. So this now gives us, let's just call it maybe 22 bucks on your fill. Like if you actually get your 22 bucks, which you know would be a little bit sus 78 here. And let's say this gives you plus 1.2 beta weighted Delta's to spy. This is kind of the, this is the game that you have to play. Is you have to go through these different kinds of names and find different directional ideas so that your portfolio isn't all short put spreads and just different things that have a pretty high correlation. You have to move between different things. Otherwise, your portfolio can't handle shocks. This is different when you have a big report portfolio. This is not that big of a concern. But with the small portfolio, what a shock means is let's say you end up with your six trades on whatever you",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 80,
      "start_timestamp": "01:37:25",
      "start_timestamp_seconds": 5845.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=5845"
    }
  },
  {
    "text": "move between different things. Otherwise, your portfolio can't handle shocks. This is different when you have a big report portfolio. This is not that big of a concern. But with the small portfolio, what a shock means is let's say you end up with your six trades on whatever you can get on. And let's say that they're all long beta weighted Delta's again, not not big because you have a small account. But they're all generally long beta weighted Delta's. If you happen to go through a period where the market happens to drop and stay low enough where again, let's just copy these and pretend that they're not that you know, not that specific. And as you look at these, what you struggle with now is if the market does choose to do that on this 5,000 account, you're risking a now not insignificant amount of this account. And if the market just happens to have a bad path here, you're going to get fucked up. So you can't logically do this this way. You can't logically do it this way. Because again, you are not worried about it being only 574. The gross dollar amount doesn't matter that much. It's the fact that you're risking 11.5 of your entire portfolio on a certain size market down move, which doesn't even have to be that much by the way. It doesn't have to be like a COVID crash. It doesn't have to be like what we saw in",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 80,
      "start_timestamp": "01:39:04",
      "start_timestamp_seconds": 5944.799999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=5944"
    }
  },
  {
    "text": "that much. It's the fact that you're risking 11.5 of your entire portfolio on a certain size market down move, which doesn't even have to be that much by the way. It doesn't have to be like a COVID crash. It doesn't have to be like what we saw in all it like it doesn't have to be anything like that. It could be a 8 correction that puts you into this. So this is why the probabilities of this stuff is really important to help contextualize what this risk is. And then you can literally do the expected value for the entire portfolio and figure out if it makes sense to risk 11.5 of your portfolio to make 126. Because if we take a look at this on a comparative basis, you're trying to make 2.5 of your portfolio, but your risk in 12. So this is why the correlation component for a small account has to be treated with so much respect. And you have to carefully think through it. You really can't just fucking wing it and build a random portfolio and hope it's going to work. You have to pay attention to the relationship of the different things that you're putting on and how they're going to behave again. This is not how I would trade this. What I would do is accept the risk. And I would say I have 5,000. I'm going to find a stock that I like that I can either afford",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 80,
      "start_timestamp": "01:40:43",
      "start_timestamp_seconds": 6043.879999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=6043"
    }
  },
  {
    "text": "different things that you're putting on and how they're going to behave again. This is not how I would trade this. What I would do is accept the risk. And I would say I have 5,000. I'm going to find a stock that I like that I can either afford some shares or get into a ratio called diagonal. I would be going with ratio called diagonals. And it's because you can effectively get into stuff with a little bit of leverage. But again, you're still generally limited on what you can afford to get into. So let's see if we can find something that might be a reasonable candidate for that kind of idea just to show you. And there's something scratching at my door. I wonder if you guys have any idea what it might be, what could be scratching at my door. This is just looking for something that's like generally bullish. Oh, it looks good. Why don't you these look good? Group on looks good. Kim's looks dubious. It looks good. So it looks like hot trash. I've never seen a shity or looking. This is just so fucked up. These stupid lines and can't that's just let's just get out of that one. It's a fucking trash name to look at. Sorry for putting you guys through that. This one looks interesting. I don't want to fuck they are. What do you do? It's all for good. That means that they can say AI. Great.",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 80,
      "start_timestamp": "01:42:22",
      "start_timestamp_seconds": 6142.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=6142"
    }
  },
  {
    "text": "just let's just get out of that one. It's a fucking trash name to look at. Sorry for putting you guys through that. This one looks interesting. I don't want to fuck they are. What do you do? It's all for good. That means that they can say AI. Great. We think this one's going to go up. Cool. So I have a 5,000 account. I think this thing is going to go up. So I can go out here. And let's see what I can put on. Let's say that I want to risk maybe a percent of the portfolio for something like this. That's a little more speculative. I would try to take that in even more, but for a small account of percent is okay. So I'm risking 78 here. That puts me in a great spot to start. So if I take a look at 78 of risk, 1.56. That's okay. It's a little oversized. You're going to be a little bit oversized. But keeping it sub 2. I can put on several of these. And as long as I've paper traded it, and I know that I have a decent method for doing this. But remember, this is part of a strategy. I'm not going to base the risk based on this. I'm going to base the risk based on where I would get out based on my strategy. So maybe I would get out if it breaks below this perceived support line here. So",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 80,
      "start_timestamp": "01:44:02",
      "start_timestamp_seconds": 6242.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=6242"
    }
  },
  {
    "text": "remember, this is part of a strategy. I'm not going to base the risk based on this. I'm going to base the risk based on where I would get out based on my strategy. So maybe I would get out if it breaks below this perceived support line here. So 540. What would my loss be at 540? 50? 51? Right on target. Pretty damn close. So this is more so what I would be doing for kind of more speculative style plays. And I would still seek to build a core allocation for sure. And that would be to trade coverage strangles in different kinds of ETFs. You can start with leverage ETFs. I absolutely tinkered in and out of them. A bunch of them were in around when I first started trading. But there's stuff that I absolutely would have used. And to trade something like ratio called diagonal in a leverity ETF is not that difficult, but it's super risky. And that's you have to figure out what looks right for you. The point there though is you have to be thoughtful about how you build this portfolio and how it all coalesces together into something that represents risk you're comfortable with. Because I'm trading ratio called the agnose on leverage ETFs. That means that I got to have some decent short delta in there. Otherwise, I run pretty good risk of ruin if again I get a bad path. So when you're talking about the correlation",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 80,
      "start_timestamp": "01:45:41",
      "start_timestamp_seconds": 6341.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=6341"
    }
  },
  {
    "text": "represents risk you're comfortable with. Because I'm trading ratio called the agnose on leverage ETFs. That means that I got to have some decent short delta in there. Otherwise, I run pretty good risk of ruin if again I get a bad path. So when you're talking about the correlation of a portfolio, it actually deserves a lot of your attention especially for a small account. Let's talk about this one next strategy hopping. I got to get let the dude in. Hi guys. The boss is here. He is, he's in fatso mode because he just ate. I don't want to, I don't want you to lick my face. I'm like dog food. His chest is wet. Literally his chest has dog food going on. So, so, drop us some knowledge on strategy hopping. Talk to us about the probability of streaks. Do you have any ideas? Anything you want to let them know? So, what are you saying right now? In case you guys can't hear him, he talks kind of low. But what he's saying is when new traders get into the markets, a lot of times they don't understand enough about path. And if you don't pay attention to path, then there's a good chance that you might have something that's actually decent that you discard because you don't understand the way that path works. It's really good thoughts from him on it. So, hopefully I can expand on it slightly in a way that does",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 80,
      "start_timestamp": "01:47:20",
      "start_timestamp_seconds": 6440.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=6440"
    }
  },
  {
    "text": "pay attention to path, then there's a good chance that you might have something that's actually decent that you discard because you don't understand the way that path works. It's really good thoughts from him on it. So, hopefully I can expand on it slightly in a way that does service to his broader, the broader pointy's making. Well, you know, time will tell. But here's what we have to pay attention to. If I'm trading a strategy, and let's say the strategy calls for me to risk 5 of the portfolio on each trade. So, again, we go back 5,000 account. I thought it might understand what I meant. It looks like, wait, what the fuck? There you go. And I'm going to risk 5 of the account. We can get a sense of how many trades I would need to have on, or how many times I can withstand a trade going against me, subsequently. So, I can have an idea of what the total allowable path would be. So, let's just build a version of this together. So, if on trade one, this doesn't mean trades, trade one, two, three, and a portfolio. This just means a sequence of trades. It could be things that are on at the same time, or things that are not. It doesn't really matter. But what we're going to do is figure out how far we can go before we find ourselves in a problem. So, this is our starting point.",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 80,
      "start_timestamp": "01:48:59",
      "start_timestamp_seconds": 6539.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=6539"
    }
  },
  {
    "text": "sequence of trades. It could be things that are on at the same time, or things that are not. It doesn't really matter. But what we're going to do is figure out how far we can go before we find ourselves in a problem. So, this is our starting point. Just drag this down one more so we can get to 25, just because. So, now what we do is just continue this math. So, we now have a 4750 portfolio, right? Our portfolio went down. So, we can figure out what risk we have. I'm going to lock this one. And now we're down to 4512. So, what I'm showing you is that if we apply some sort of fixed sizing, we can figure out how many trades we have to run before we have a problem. So, in an example like this, if you're risking 5 of your portfolio, you draw down half the account if you have 13 losing trades. Does your strategy have a decent probability of losing 13 trades based on the frequency that you run it? So, the reason why path is so important is because in order to reap the benefits of a good strategy, you have to be able to endure the bad periods, which can be very difficult to do. And the only way to do that successfully is to build something robust enough that you're like, okay, I'm risking not 5 of the portfolio based on this strategy because there",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 80,
      "start_timestamp": "01:50:38",
      "start_timestamp_seconds": 6638.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=6638"
    }
  },
  {
    "text": "good strategy, you have to be able to endure the bad periods, which can be very difficult to do. And the only way to do that successfully is to build something robust enough that you're like, okay, I'm risking not 5 of the portfolio based on this strategy because there is a decent loss chance and the potential for a loss streak is not insignificant. Scalping is bad. We already talked about that. Trade adjustments. The main thing with this is based on the strategy because like, say for example, you're trading a ratio called diagonal, there's a bunch you could do with respect to trade adjustments. But the main thing to pay attention to is the idea of like rolling options and stuff like that because the effects that I talk about of rolling options in a small account become way more pronounced in terms of literally running out of cash. You can run to a point where you might have the net link in the portfolio, but you literally can run out of the money. You can run out of cash. That can be a problem. Now, you can circumnavigate that in a couple different ways if you use an actual rolling order that's executed simultaneously and stuff like that. But you can put yourself in a bit of a bit of a dangerous spot. And these last ones are actually really simple because when small accounts go through these emotional cycles, it's literally just because they're not",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 80,
      "start_timestamp": "01:52:17",
      "start_timestamp_seconds": 6737.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=6737"
    }
  },
  {
    "text": "use an actual rolling order that's executed simultaneously and stuff like that. But you can put yourself in a bit of a bit of a dangerous spot. And these last ones are actually really simple because when small accounts go through these emotional cycles, it's literally just because they're not focused on the right stuff. That's it. They're too focused on the dollar amounts and they're not focusing enough on the development of a strategy and thinking of it purely from the lens of getting data points to build out their strategy. If you can do that, you're going to be in a way better spot. The last thing, this is something all of us have done without a doubt. And this is when we start trading options before we actually understand how they behave. The reason why that's so important is because by understanding how they behave, it gives you an insane amount of information regarding how you might choose to set up your idea. So for example, if we're looking at this same long option thing, and let's say that I was trading something a little bit more like a breakout style. Let's say that I had caught it on this day here, for example. Well, if I had caught it on this breakout day here, then there's an important function for me to pay attention to, which is what strategy and what structure makes the most sense to make the most out of this breakout. Because if",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 80,
      "start_timestamp": "01:53:56",
      "start_timestamp_seconds": 6836.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=6836"
    }
  },
  {
    "text": "it on this day here, for example. Well, if I had caught it on this breakout day here, then there's an important function for me to pay attention to, which is what strategy and what structure makes the most sense to make the most out of this breakout. Because if it's a breakout, I'm probably not going to go out necessarily this far in a super small account. If it's a breakout that I'm expecting to hold maybe for a week, maybe two weeks, I might come in because take a look at the difference in price for these about half the price. You become very price sensitive with a small account. And if you don't understand options, you might instead say, oh, well, I'll come in here to the 21 days. They're even cheaper. But then if we take a look at Thaited-A-K for these options there in the third decimal, that's why it shows the same. But if we take a look at Thaited-A-K in these options relative to one another and also even take a look at the Delta relative to one another. If I get a 1 move, I'm only getting 27 cents on this side. If I get a 1 move, I'm getting 41 cents almost double because of the Delta. The gamma side of the equation can compensate for the Delta depending on how much of a move we get. But my broader point is all of that comes from a better understanding of",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 80,
      "start_timestamp": "01:55:35",
      "start_timestamp_seconds": 6935.599999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=6935"
    }
  },
  {
    "text": "If I get a 1 move, I'm getting 41 cents almost double because of the Delta. The gamma side of the equation can compensate for the Delta depending on how much of a move we get. But my broader point is all of that comes from a better understanding of options themselves so that you can make informed decisions on how you might choose to structure them. So taking the time to learn how options actually behave is always worth your while. It's actually something that I'm trying to work on right now. I'm trying to work on, there's a ton of free courses and stuff. I don't want to do a course. But what I'm interested in doing is trying to come up with an exercise packet so that you can test yourself and actually do something to explore your understanding of options in a bunch of different ways, hopefully to make you feel more confident if you're able to answer things successfully or to identify gaps in what you're doing and maybe not answering things as successfully as you might. So that's kind of like a crash course on surviving options trading with 5K. Sun says any options or general trading book recommendations. I'm looking for good technical or candlestick book specifically. I have no good recommendation for a technical or candlestick book that's not what I do at all. The kind of stuff that I would suggest would probably be very, very different than that. So I'm",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 80,
      "start_timestamp": "01:57:14",
      "start_timestamp_seconds": 7034.679999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=7034"
    }
  },
  {
    "text": "or general trading book recommendations. I'm looking for good technical or candlestick book specifically. I have no good recommendation for a technical or candlestick book that's not what I do at all. The kind of stuff that I would suggest would probably be very, very different than that. So I'm not sure that it would be stuff that you're looking for. But on my website, I literally have like a list of different books and stuff that I think are good, but very different stuff than that. For technical analysis, maybe some stuff about Cancelim if you like that style of trading, but technical or like specifically candlestick stuff, I'm really not bought into it. I use it for context, but I've not seen many successful like candlestick positioning. I've done a ton of testing on it and I don't see a lot of positive output from it. Cool. Good question though. The last thing that I wanted to talk to you all about now is here. So based on the poll we did before, now that we know for most of the people on the stream, we are interested in this. So do me a solid and the exercise that we did here, let's effectively mirror this exercise here. It doesn't have to be as thorough, but I want to get a sense of like what the primary questions and stuff you have relative to. So we can clear all that out and topics of most interest to you",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 80,
      "start_timestamp": "01:58:53",
      "start_timestamp_seconds": 7133.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=7133"
    }
  },
  {
    "text": "that we did here, let's effectively mirror this exercise here. It doesn't have to be as thorough, but I want to get a sense of like what the primary questions and stuff you have relative to. So we can clear all that out and topics of most interest to you relative to my option strategy. So this is again a chance to shape what I build the series into. I don't know how many episodes this one will be. I'll take a look based on like what you guys want to talk about what you're interested in and then kind of see what lines up the best. But my goal here would be to talk about stuff that's different than the playlists that I have. So I already have a playlist that talks about all of my, not all, most of my option strategies do a pretty fair degree. None of it will be all encompassing. It's nothing like that. But it gives you some good starting points. So I would like to know for those that said this topic specifically, what are the specific areas of interest that you have related to my option strategies, the stuff that you want to spend time with. Lauren says, Lauren says, I'm horrible with Black Sholes model questions. That's why that's what Grock told me anyway. Well, I guess it depends on like what kind of questions you're trying to solve with Black Sholes. Black Sholes really is, it really is nothing",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 80,
      "start_timestamp": "02:00:32",
      "start_timestamp_seconds": 7232.839999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=7232"
    }
  },
  {
    "text": "want to spend time with. Lauren says, Lauren says, I'm horrible with Black Sholes model questions. That's why that's what Grock told me anyway. Well, I guess it depends on like what kind of questions you're trying to solve with Black Sholes. Black Sholes really is, it really is nothing that crazy. Black Sholes simply gives us a way to deconstruct option prices. That's pretty much it anymore. Because when we look at Black Sholes in a broader context, it doesn't represent actual option pricing models anymore. It really doesn't. Because of that, I don't really think that it's worth a ton of like trying to deconstruct it to be able to run the differential equation yourself, for example. As long as you understand that it is a differential equation, there's important inputs to it that help you understand the option markets around. And stuff like that, I realistically think that's plenty good. And then you can tinker with maybe finding ways to optimize it a little bit or maybe coming up with your own pricing models. I used to do that, which is actually kind of fun. It's just a good, just a good exercise. But yeah, that's what I say. All right. I am getting my dinner order ready. None of this stuff. There we go. All right. Let's get more of the. Lauren says I'm terrified of selling calls and puts. I don't understand all the mechanics. Okay. Okay. Filling calls and put. Short. Naked options. Oh,",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 80,
      "start_timestamp": "02:02:11",
      "start_timestamp_seconds": 7331.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=7331"
    }
  },
  {
    "text": "I say. All right. I am getting my dinner order ready. None of this stuff. There we go. All right. Let's get more of the. Lauren says I'm terrified of selling calls and puts. I don't understand all the mechanics. Okay. Okay. Filling calls and put. Short. Naked options. Oh, that's a good one. Random says I know short dated options are risky. They're not risky. But are there any cons to long dated options? Is it possible to have an option that is too long dated? Definitely. So when to use long versus short dated options? Good one. H says I understand that it varies to trade to trade, but some generalized ideas for your thoughts on entry and more importantly managing exit when putting on a trade. That one you can find in the if you go to the strategy playlist on YouTube, because you're exactly correct. It does vary from trade to trade and more specifically strategy to strategy as well. But that playlist will actually go through a lot of that for you. But if there's any specific questions you have related to that after you check out some of those videos, then we can absolutely add that to the list for sure. So like if you're watching something on like the ratio called a Agnoles and you're like, I'm not exactly sure why we would enter exit here like that kind of thing for sure. Ricky says maybe tear your strategies that you would say",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 80,
      "start_timestamp": "02:03:51",
      "start_timestamp_seconds": 7431.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=7431"
    }
  },
  {
    "text": "add that to the list for sure. So like if you're watching something on like the ratio called a Agnoles and you're like, I'm not exactly sure why we would enter exit here like that kind of thing for sure. Ricky says maybe tear your strategies that you would say are easier to manage versus some of your more complicated strategies. That's a great one. Heard strategies with respect to ease of implementation. That's a really good one. I like that. H says also interested in volatility directly versus direction. When you, oh, you mean like that not direction of volatility but direction of volatility? No, you mean direction of the options like trading vol versus trading direction of options. Roach to trading volatility. I have a video on that as well. But that one, the video that I have is actually very specific to like earnings. So it's a little bit, it's honestly a little bit on the lacking side. So we can definitely expand on that for sure. Jared says dynamic sizing. Okay. Dynamic sizing. Is there is, is there a specific strategy that you're interested in dynamic sizing relative to because that would differ a lot based on strategy for me? Actually pretty massively. And then if not that's cool, we can, we can discuss it. In the money versus out of money, that's not really relative to, this is actually really useful. This is really useful because I'm realizing that it seems like for some of",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 80,
      "start_timestamp": "02:05:30",
      "start_timestamp_seconds": 7530.079999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=7530"
    }
  },
  {
    "text": "on strategy for me? Actually pretty massively. And then if not that's cool, we can, we can discuss it. In the money versus out of money, that's not really relative to, this is actually really useful. This is really useful because I'm realizing that it seems like for some of the group that might be interested in strategies like I actually think the way that I would talk about the strategies might be a little heavy for like the beginner, for the beginner format. I have to think on this a little bit more. Green star, this is just a note for me. Green storm, how to level this. Because as I'm thinking about like the stuff that comes to my mind to talk about, I think it will be like based on what I'm seeing in the chat, it probably will be a little bit heavy. Which is okay. I want to make sure that it's, I want to make sure that it's made relevant to the, to the theme of the, of the live stream for the Fridays. That's useful. In the money versus out of money, we can take a note on that. In the money versus out of the money use of option. Yeah. Ricky says, how do I dumb this down to the hips in the chat? Yeah. I mean, it is absolutely about leveling it appropriately because a lot of this stuff can be challenging. A lot of this stuff can be like really",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 80,
      "start_timestamp": "02:07:09",
      "start_timestamp_seconds": 7629.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=7629"
    }
  },
  {
    "text": "out of the money use of option. Yeah. Ricky says, how do I dumb this down to the hips in the chat? Yeah. I mean, it is absolutely about leveling it appropriately because a lot of this stuff can be challenging. A lot of this stuff can be like really challenging in the beginning to learn, but then as you learn it's really not, it's not in crazy, but it takes a little time to get there. So yeah, this is useful. It gives me a lot of ideas. And actually the most important thing that this gives me completely, completely straight up is the way that I naturally think about talking about this wouldn't work well. And I need to think about that actually quite a bit differently, which is good. Like that's actually really, really good for me to know so that I can make this actually useful to you guys. Alberto says, how about for example, scanning the market for opportunities? Yeah, that definitely counts. Scanning, you find trades. And for you, Alberto, do me a favor watch this video here. Watch this video here. And then after you watch that video, let me know what gaps there are. And then I'll be able to, I'll be able to tailor it to that for sure. Sweet, super fun session. Enjoy hanging out with everybody. We will have the meme stock watch stream tomorrow. So stay tuned for that. If you guys need anything, as always, hit me",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 80,
      "start_timestamp": "02:08:48",
      "start_timestamp_seconds": 7728.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=7728"
    }
  },
  {
    "text": "there are. And then I'll be able to, I'll be able to tailor it to that for sure. Sweet, super fun session. Enjoy hanging out with everybody. We will have the meme stock watch stream tomorrow. So stay tuned for that. If you guys need anything, as always, hit me up in the community. It's completely free to join. Be an outlier. See you guys later.",
    "metadata": {
      "video_id": "ezIUX7oWrTU",
      "title": "Surviving Options with a $5K Trading Account Pt1 | Options Trading Basics",
      "url": "https://www.youtube.com/watch?v=ezIUX7oWrTU",
      "upload_date": "",
      "duration": 7230.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 80,
      "start_timestamp": "02:10:27",
      "start_timestamp_seconds": 7827.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ezIUX7oWrTU&t=7827"
    }
  }
]