[
  {
    "text": "Sizing options trades can be a little bit tricky, but if we start with a simple scenario, which is if you typically trade bi-rexionally. And if you're going to establish directional trader, you normally, if you're doing a good job, are going to have predefined profit and loss targets before you enter your trade. Great example of this is, this is GM pulled up. So let's say that we thought GM might roll to the downside, post earnings, whatever, and you think tariffs are going to be awful and yada yada yada. Let's say that you defined your upside risk by saying, well, where would my idea be wrong? And let's just say that if it pops above this 4875 handle, that's where we would deem ourselves wrong. Well, all you do is define that point on the chart, then based on the long calls that you choose to buy the short puts, the call spreads, whatever, you look at what the cumulative loss of your position would be if GM trades at this 4875 handle. And then you size that risk. So it makes sense. So in this case, let's say this is a standard directional play. You don't want to risk any more than 5 on the high side of your portfolio. You typically stick between 1 to 3. So let's say that you size it so that it represents a percent and a half to percent loss of the portfolio. Then in options, you can take it",
    "metadata": {
      "video_id": "eZv7SNIMbLs",
      "title": "Sizing Options Trades",
      "url": "https://www.youtube.com/watch?v=eZv7SNIMbLs",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 2,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eZv7SNIMbLs&t=0"
    }
  },
  {
    "text": "want to risk any more than 5 on the high side of your portfolio. You typically stick between 1 to 3. So let's say that you size it so that it represents a percent and a half to percent loss of the portfolio. Then in options, you can take it once that further, you can then measure what the probability is of it getting there compared to the probability of hitting whatever your profit target is. Maybe that's 43 and a half. And you can measure the expected return for the bet that you are making. This is one way with directional trades, short options, completely different story. Being all our sealer.",
    "metadata": {
      "video_id": "eZv7SNIMbLs",
      "title": "Sizing Options Trades",
      "url": "https://www.youtube.com/watch?v=eZv7SNIMbLs",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 2,
      "start_timestamp": "00:01:07",
      "start_timestamp_seconds": 67.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=eZv7SNIMbLs&t=67"
    }
  }
]