[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you and this is and this is room Before and after省 kept Commission Odda again this is living very far Brazil a while ago on a stream. I did just change the amount of money slightly. I think we agreed originally on 600 K. It's six and a quarter literally just so that I could have 200 K for all of these that's literally the only reason it's so that stuff can be equal weighted. Because before it was like 225 of this, 175 of this. So I want that to be the same for these three names. TQs spy and I bet notice a big change there. Before, when we were doing this previously, we had started with TQs and SSO. We were looking at managing three times and two times leverage ETF. Then when we had that really hectic market period where things were going, hey, wire, I moved from SSO into Upro so that I could regain some liquidity. SSO is notoriously not very liquid and it also freed up some capital and stuff like that. So that's why we ended up in two three times levered ETFs, TQs and Upro. That wasn't designed to be the perpetual state going forward. It was actually something that I knew I wasn't going to want to maintain its perpetuity. So with all of that, I made a rebalance",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 35,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=0"
    }
  },
  {
    "text": "So that's why we ended up in two three times levered ETFs, TQs and Upro. That wasn't designed to be the perpetual state going forward. It was actually something that I knew I wasn't going to want to maintain its perpetuity. So with all of that, I made a rebalance today. So what I did was I flattened out the Upro position. So between Upro and SSO, those two combined are marked at down 1212. What this means is the coverage triangle in there is underwater. It didn't fully recoup the cost when I was rolling out. Part of it is because it's month six. Right. So halfway through the year wanted to just make the transition so that we have another six months essentially to look at this new variation. So I'm just giving you all these caveats because there are things in here that I'm doing literally for the purpose of creating content with you. They're not necessarily optimized decisions. So all that aside, that still is a massive performance from when we first got into things like SSO. It's still not back to break even from our original entry into it. And again, this simply stems from where the covered strangle is. We got into SSO when things were trading around 95 and things are still trading at 92. So on an overall basis, it's still outperforming, honestly. Again, it's nothing that I would write home about, but for something that otherwise would be down, that's a",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 35,
      "start_timestamp": "00:01:38",
      "start_timestamp_seconds": 98.38857142857142,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=98"
    }
  },
  {
    "text": "where the covered strangle is. We got into SSO when things were trading around 95 and things are still trading at 92. So on an overall basis, it's still outperforming, honestly. Again, it's nothing that I would write home about, but for something that otherwise would be down, that's a pretty good performance. So even though SSO would be down about, like I said, a few, a few percent. If we just plot this out really quick in terms of return on invested capital, I forgot what it had maybe like 225 or something. I want to say maybe 225. It's down 0.6. So again, the covered strangle is still down here across those two, but it's just a lot better than had it just been entered and then bienhold. So the gameplay and going forward is a little different now. And you can see the big change here again is I equal weighted these. This is again, just for comparison sake. But then I moved into spy. Now my vision for the spy position here is to give you another look. Now this other look is designed the entire purpose of this whole exercise is to give you a visual and practical application of the strategy in different forms. And with the levered covered strangle, there are some nuances that go with it. I already talked to you about a couple of them. For example, we know that three times leverage is actually a little high. It's a little",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 35,
      "start_timestamp": "00:03:16",
      "start_timestamp_seconds": 196.77714285714285,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=196"
    }
  },
  {
    "text": "visual and practical application of the strategy in different forms. And with the levered covered strangle, there are some nuances that go with it. I already talked to you about a couple of them. For example, we know that three times leverage is actually a little high. It's a little little little more than I would want for a longer term holding. We know something like 2.2 times leverage is actually more optimal for a long time long term bienhold or long term dollar cost averaging. It's based on just a bunch of different research you can look at at your own leisure. So by creating this now balance, if you take a look at these two together, they're all not that different anymore. They used to be way more different. But because spy is so tech heavy at this point, these are actually closer than they are different. So if we take a look at essentially waiting these, this would be three times leverage. This would be one times leverage. And I want these just as regular numbers. So we can figure out what the actual leverage is for these combined positions by doing a little bit of very simple math. And if you know what the answer is, what the combined leverage is, wrote in the chat. I'm going to open the door for a throw real quick. No guesses. One of you knows. One of you knows the answer. I'm convinced. Lauren, what's our answer? Come on",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 35,
      "start_timestamp": "00:04:55",
      "start_timestamp_seconds": 295.1657142857143,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=295"
    }
  },
  {
    "text": "simple math. And if you know what the answer is, what the combined leverage is, wrote in the chat. I'm going to open the door for a throw real quick. No guesses. One of you knows. One of you knows the answer. I'm convinced. Lauren, what's our answer? Come on now, Lauren. You know what this is. I'm trying to show you actually a really important concept more broadly, which is you have to be pretty agile when you're looking at individual positions versus when you're looking at portfolio level and striking a balance between what those are. There's actually a really, really important important series of trade-offs, but it's actually super simple. What we would do here is simply take whatever number of things we have, the number of positions we would wait it by the total capital. And then we would average it. And then we can figure out what our leverage is. Now this one's super simple because it's very straightforward. But let's say this is 200,000. And so is this. So all we would do is take an average of these that would be weighted against whatever the size is. But since they're equal weighted, you in this case just need to figure out what the average is here. So we can just read this one is four, divide by two, so we're sitting right around 2.0 leverage between these two positions. So that would represent our market exposure with respect to total market leverage. So",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 35,
      "start_timestamp": "00:06:33",
      "start_timestamp_seconds": 393.5542857142857,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=393"
    }
  },
  {
    "text": "in this case just need to figure out what the average is here. So we can just read this one is four, divide by two, so we're sitting right around 2.0 leverage between these two positions. So that would represent our market exposure with respect to total market leverage. So this would be a 400,000 position composite between those two that would be really behaving up to around 800,000. That's the way to think about it. So if we look at what, and again, that's assuming more pure relationship, not really the case, right? So again, if we do three times the 200,000 gives us 600,000. You add the 200,000 gives you 800,000, but it's not going to be that linear because the leverage actually is a little more shockingly advantageous than that. So you get a little bit of a positive bump, believe it or not. Does that make sense? Well, we just talked about how to calculate the leverage when you're looking at two different positions, one levered, one knot to create a composite leverage. The reason why, again, this is useful is because when you're trying to consider what you want your portfolio to look like longer term, this is absolutely a consideration to make, in my opinion, because you can set something up that achieves some level of leverage. And again, remember, in this context, the leverage really just gives you more risk. So it's not like this is some super secret edge that nobody else",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 35,
      "start_timestamp": "00:08:11",
      "start_timestamp_seconds": 491.9428571428571,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=491"
    }
  },
  {
    "text": "term, this is absolutely a consideration to make, in my opinion, because you can set something up that achieves some level of leverage. And again, remember, in this context, the leverage really just gives you more risk. So it's not like this is some super secret edge that nobody else can see. There's not really an edge here. What you're doing is just taking more risk. You're taking a higher market beta. But the cool part about it is that from a retail trading lens, you're not evaluated on your max drawdowns. It's whatever you want it to be. And if you're risk tolerant, something like this can actually perform pretty well. But again, you're going to expect it to have some issues. But this is the cool part about trading a covered strangle. Because if you take a look at the total PNL on T triple cues, the position is up around five grand. I think this might be in the context of, let me see if I have Roic. It doesn't look like I have Roic. Give me one sec. So I have return on capital here. But I actually want to add return on invested capital. So Roic would go here. I want to give you a comparison factor between what the buying hold equivalent is. So in this case, it would just be the total PNL divided by whatever the allocation is as a percent 2.54. So again, this isn't like some sort of super impressive",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 35,
      "start_timestamp": "00:09:50",
      "start_timestamp_seconds": 590.3314285714285,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=590"
    }
  },
  {
    "text": "Roic would go here. I want to give you a comparison factor between what the buying hold equivalent is. So in this case, it would just be the total PNL divided by whatever the allocation is as a percent 2.54. So again, this isn't like some sort of super impressive return on invested capital. Actually, if you take a look at worthy and impressive return on capital is you guys see what I see? It's literally hilarious to me because it's undeniable. It's absolutely undeniable, which is again, just generally humorous. When I'm looking at the total performance of GameStop, it is absolutely leading the pack in a pretty big way, which is actually very cool to see. Because in terms of trading volatility and stuff like that and the amount of all that's in it, GameStop with out of doubt punches pretty well above its weight, like solidly above its weight. And it's largely because of how much volatility there is, which is again, a general function of it. But I don't know if a lot of people would give it the credit. It otherwise deserves in this context, which is why I'm specifically calling it out. GameStop is crushing it. Joseph says, Roic equals RoCy, sort of, but not quite, because it depends on the way that you're viewing what you consider capital exposure versus Roic. So when we look at this, this 200,000, this entire 200,000 is not exposed at really any given point in time. You",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 35,
      "start_timestamp": "00:11:28",
      "start_timestamp_seconds": 688.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=688"
    }
  },
  {
    "text": "crushing it. Joseph says, Roic equals RoCy, sort of, but not quite, because it depends on the way that you're viewing what you consider capital exposure versus Roic. So when we look at this, this 200,000, this entire 200,000 is not exposed at really any given point in time. You can take a look at that right now. We're literally only using 40 or 79 of the 200,000. So this isn't exposed. This is simply money that's invested into a strategy. And right now, there's a pretty meaningful actually amount of this capital that's invested into the strategy that's technically just sitting there. Now, as you guys know, I put it into box spreads and stuff like that. So it's a completely great question. And the way that I would think about those two different metrics is, and the reason why I like to use Roic is because it keeps me honest, right? The better metric, if I wanted to make this look better, the better metric for me to use, hands down instead would be if I take the total utilization and calculate the return on investor capital off of the utilization, right? So if I show you what that would be just for an example, if we take the PL divided by the utilization, we'd go from that 2 in change to 6. Huge difference. But it's a disingenuous metric. And I think it's super important to show actual performance of things, which is exactly why I calculate",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 35,
      "start_timestamp": "00:13:07",
      "start_timestamp_seconds": 787.1085714285714,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=787"
    }
  },
  {
    "text": "that would be just for an example, if we take the PL divided by the utilization, we'd go from that 2 in change to 6. Huge difference. But it's a disingenuous metric. And I think it's super important to show actual performance of things, which is exactly why I calculate it this way. It's not the the pretty way, 2.54 on something that's been running for six months is nothing that I would be like, wow, that's crushing it. But this is what trading is. And for this strategy, especially given the broader landscape and context, that's completely fine. Again, it's not blowing the doors off, but I would absolutely take this over the buy and hold equivalent. So anyways, the reason why I'm running Spy here is because Spy gives us again that other look. Now when I'm trading the levered ETFs, there is a significant portion of what I do is going to be trend following. If you'll remember, and if we go back to this period in time, and let's do TQs, in TQs, we had, well, I had, I should say, I had a position built of long shares. So I had been accumulating shares into like the second of April here. So we're right in here, third of April, I should say, right here. And then all of a sudden, I start scaling out of the shares. And the scaling started on February 7th here. And this is as things started getting highly, highly congested,",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 35,
      "start_timestamp": "00:14:45",
      "start_timestamp_seconds": 885.4971428571428,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=885"
    }
  },
  {
    "text": "like the second of April here. So we're right in here, third of April, I should say, right here. And then all of a sudden, I start scaling out of the shares. And the scaling started on February 7th here. And this is as things started getting highly, highly congested, meaning it didn't really look like this was starting to break out above this. So it was a very conservative pulldown in the observation of just the broader market performance. And if you take a look, part of that has to do with the red flags that came from this period here. So what happens during this period here is the market is rallying, rallying, rallying. And then the market hits a local high. What do you notice about the net highs lows on the day that that high was made? They're trending down. That ain't right. That's completely abnormal. When we're seeing new highs posting, we would expect not necessarily mass participation, but definitely more broad participation than being net negative on net highs lows. And this was both for the New York Stock Exchange and the Nasdaq. The funny thing about this is it wasn't even on the day of that it flipped negative. It was negative for like two days, three days before it posted that high. So anyways, when I see that, that is a red flag that tells me have to be a little thoughtful here. And to see how this continues to trend both",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 35,
      "start_timestamp": "00:16:23",
      "start_timestamp_seconds": 983.8857142857142,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=983"
    }
  },
  {
    "text": "day of that it flipped negative. It was negative for like two days, three days before it posted that high. So anyways, when I see that, that is a red flag that tells me have to be a little thoughtful here. And to see how this continues to trend both the net highs lows metric, but also just the market performance. Long story short, that led to me taking an exit on those shares here. So the reason why I rolled out of the shares there is because of my standard approach. I can always get back in if I want always. So then as we start rallying here, again, I take a look at net highs lows. And as we start to see this day here and this day here. So we rally up. We get two to three semi sideways days. What do you notice about net highs lows? They start weakening. So on the latter half of these days, net highs lows is coming off heavy. Why would that be? That's abnormal. So that's why there wasn't a reentry here. Otherwise, I would have reentered here for sure and just bought shares, but it didn't. So I didn't. So then anyways, at this point, it's full shore puts. It's all that's being traded. And then you can see some of the lingering entries and stuff on these days. So anyways, this is what it looks like with respect to trading a levered ETF. There's a lot of",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 35,
      "start_timestamp": "00:18:02",
      "start_timestamp_seconds": 1082.2742857142857,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=1082"
    }
  },
  {
    "text": "didn't. So then anyways, at this point, it's full shore puts. It's all that's being traded. And then you can see some of the lingering entries and stuff on these days. So anyways, this is what it looks like with respect to trading a levered ETF. There's a lot of trend following in momentum being applied because what you don't want when you're trading any sort of leveraged product to the long side is you don't want to play this game. You don't want to go from there to there because that's an 82 drop that will absolutely kill the performance of your strategy for some time. Even with something like the coverage strangle, if you had held through this entire period, you would end up coming out all right. But there's a really long duration where this wouldn't look super great. And that's the point of being an active trader is to not do that. Same reason why I chose not to do it here. It looks like it sucks. Don't want to do it. So anyways, when trading this in something like spy, it's completely different. It's a completely different game. Why is it a completely different game? It's because of the way spy moves comparatively. This drop here is just touching 20. Just touching 20. And that's still a big drop. But in terms of overall metrics, that's very easy to work through. So when I'm trading the coverage strangle in something like spy that moves much",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 35,
      "start_timestamp": "00:19:40",
      "start_timestamp_seconds": 1180.662857142857,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=1180"
    }
  },
  {
    "text": "It's because of the way spy moves comparatively. This drop here is just touching 20. Just touching 20. And that's still a big drop. But in terms of overall metrics, that's very easy to work through. So when I'm trading the coverage strangle in something like spy that moves much more slowly. I actually have a much higher propensity to take on shares, to take a assignment of things and to wait stuff out and stuff like that. So by moving and keeping the TQ's position for more of a momentum style, take on the coverage strangle and then spy, which will offer a little bit more of like a dollar cost average style, coverage strangle. It'll give you a couple different visuals on different ways that this can be built to suit whatever the purpose is that you might have for the strategy. So that's what's going on there and a ton of context around it. As always, if you have any questions on that, let me know. Let's talk about the market. So today, as I was saying earlier, the market really does seem to generally be gathering strength, actually using this net highs lows. For an example, this is a perfect example. What do you notice the difference is here on net highs lows as the market is rallying here, as compared to what net highs lows look like when the market was rallying here. Significantly better. Significantly better. You can see net highs lows right now",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 35,
      "start_timestamp": "00:21:19",
      "start_timestamp_seconds": 1279.0514285714287,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=1279"
    }
  },
  {
    "text": "this is a perfect example. What do you notice the difference is here on net highs lows as the market is rallying here, as compared to what net highs lows look like when the market was rallying here. Significantly better. Significantly better. You can see net highs lows right now both gross highs are expanding pretty quickly, but net highs and lows are pretty strong. In terms of their placements with respect to a standard deviation, Nasdaq is at 1.3 standard deviation move to the upside. For net highs lows. And Nasdaq is at 0.6 standard deviation. So kind of within the expected bounds for the New York Stock Exchange, but not that far off of the upper bound. So this to me is showing pretty significant strength even from a statistical lens coming into it. And as you know, there's a bunch of other breadth indicators that we can look at things like put call ratios and yada yada yada. These are all random ones that I'll I'll track. So this is put call ratios for the Nasdaq. Then if we take a look at put call ratio for the SP here. And then there's also for the Russell here. And what you'll notice is put call ratio for SP is that 60 0.6. For the Nasdaq is at 0.58. So about the same. And then the Russell is at 0.41. Way off. Way, way, way off. So what would lead to that big of a discrepancy between put",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 35,
      "start_timestamp": "00:22:57",
      "start_timestamp_seconds": 1377.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=1377"
    }
  },
  {
    "text": "here. And what you'll notice is put call ratio for SP is that 60 0.6. For the Nasdaq is at 0.58. So about the same. And then the Russell is at 0.41. Way off. Way, way, way off. So what would lead to that big of a discrepancy between put call ratios of Nasdaq and SP versus something like Russell? Is everything to do with forward looking expectations? That's what you're seeing there. That's what the put call ratio is telling you. It gives you a really really useful insight to how the constituents are being placed, meaning the individual holdings within the sectors themselves. You can look at the actual constituents. And that's why you see here, it's the Russell 2000 constituents options. I want to be clear on that. This isn't looking at the index. The reason why that matters is because in the index generally speaking, you would expect to see just an overwhelming number of puts typically speaking because of the hedging that's going on. But what you're seeing here is a big discrepancy between SP, put call ratio between Nasdaq and Russell, which is something that, again, it's never any one of these like quote-unquote indicators that tells the story. It's always the grouping of them. And there's a lot that you can start to piece together. And I'll show you another piece of this puzzle. VIX. If you take a look at VIX, what do you notice? VIX is still at 17, even with",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 35,
      "start_timestamp": "00:24:35",
      "start_timestamp_seconds": 1475.8285714285712,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=1475"
    }
  },
  {
    "text": "indicators that tells the story. It's always the grouping of them. And there's a lot that you can start to piece together. And I'll show you another piece of this puzzle. VIX. If you take a look at VIX, what do you notice? VIX is still at 17, even with the market rallying as hard as it is. So with that, what does that tell us? It tells us that the market is still pricing in a certain level of risk, even with these various names rallying pretty hard. And again, if you pay attention to stuff like put call ratio, put call ratio of 0.4 is really, really low. And when you see put call ratios that low, it tells us that there's a lot of speculative positioning going on to the upside. And this goes exactly what I was talking about on the stream yesterday. And I've been talking about this for a little while now, where when you look at small caps from a pot odds perspective, they don't look bad. Again, who knows how it goes? I still would prefer to go the way by looking at the individual names. That's what I've positioned in. But I still think this as a general theme is worth acknowledging because it looks like the put call ratio that you're seeing an SP and what you're seeing in NASDAQ is a little light but not super light, still upside leaning. But here, this discrepancy is massive and this is",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 35,
      "start_timestamp": "00:26:14",
      "start_timestamp_seconds": 1574.2171428571428,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=1574"
    }
  },
  {
    "text": "I still think this as a general theme is worth acknowledging because it looks like the put call ratio that you're seeing an SP and what you're seeing in NASDAQ is a little light but not super light, still upside leaning. But here, this discrepancy is massive and this is pretty significant upside expectation. And you have to think of it in the context of this is likely people just looking at all of these various names in here and just starting to take directional bets because you can see stuff like MSTR, you all know what's up there, SMCI, IONQ, the tech sector within the Russell is starting to grow. And it's actually starting to grow pretty significantly relative to the other names that you see in here. And you can see utilities is just about starting to roll off. That's a little dramatic. But utilities is continuing to lag. Financials has always been a really big component industrials as well. But IT is starting to expand as the percentage of the overall index that it takes. IT is expanding everywhere. And it's because of what IT represents. Look at IT now. Like this is crazy. IT here plus again, you can wrap comm services, not the same as IT but close enough. And if you combine those two in the SP, I mean that is like an insane, insane portion of the index. Actually, let's see. So if you add IT and comm services, which is 9.76, it's",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 35,
      "start_timestamp": "00:27:52",
      "start_timestamp_seconds": 1672.6057142857142,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=1672"
    }
  },
  {
    "text": "again, you can wrap comm services, not the same as IT but close enough. And if you combine those two in the SP, I mean that is like an insane, insane portion of the index. Actually, let's see. So if you add IT and comm services, which is 9.76, it's like 42. 42 of the SP 500 now is tech overall tech. I don't think this gives us this view for the others. Does it? Yeah, I didn't think so. Kind of a bummer because I love that view that it gives you here. And I don't think it does it for the Russell. Yeah, unfortunate. Nonetheless, I think that there's a lot of really interesting plays right now in the Russell, which I actually want to spend a little time looking at. But the broad market here is showing a couple of those general signs that I'm kind of just walking you through. VIX still slightly elevated. So let's take a look at a couple of the scans from today. There was one that I already posted in the Discord because it deserves some attention. This is the one. So this scan here is me monitoring for moderate size trades and VIX. And I'm looking for stuff that's at slash out of the money. So stuff that's like very directional, especially in something like VIX. VIX is super nuanced. If you trade options in the indices themselves, the way that you trade an option changes completely when you're trading",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 35,
      "start_timestamp": "00:29:30",
      "start_timestamp_seconds": 1770.9942857142855,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=1770"
    }
  },
  {
    "text": "trades and VIX. And I'm looking for stuff that's at slash out of the money. So stuff that's like very directional, especially in something like VIX. VIX is super nuanced. If you trade options in the indices themselves, the way that you trade an option changes completely when you're trading something like VIX because of what the options, explorations are tied to, which is not spot VIX, it goes pretty deep pretty fast. And as we just casually, very casually poke through this. And we see a handful of 10,000 plus trades, which by the way is not a tonne. But a couple of these are a little more sized. And some of them are actually fairly near term in nature. So like this here, this is essentially a month, a month out. And these are the 20 calls we can see that the last was 1.97. And it came across pretty much right right in the middle of the market. So it's tough to tell discreetly like what side of the trade that came through on, which is why unusual whales is pretty useful. But anyways, I want to show you the net change there in VIX because it was interesting to me. We literally just looked at this yesterday, BB AI reminds me of whatever that thing is from Star Wars, the BB, whatever that robot was, BB AI always makes me think of that. The fuck was the name of that robot from Star Wars? I can't",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 35,
      "start_timestamp": "00:31:09",
      "start_timestamp_seconds": 1869.382857142857,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=1869"
    }
  },
  {
    "text": "was interesting to me. We literally just looked at this yesterday, BB AI reminds me of whatever that thing is from Star Wars, the BB, whatever that robot was, BB AI always makes me think of that. The fuck was the name of that robot from Star Wars? I can't remember. But when you look at the overall put volume in terms of premium, pretty big unwind, when you look at the call premium, starts off accumulation, but then turns into general unwind. This is the market expecting one thing and seeing something slightly different actually happen, which is kind of cool to see. Then if we take a look at just overall changes in the OIs, so this is build out, you can see that the put side I mean had the let me change this, I was wondering, X here. So you can see that the put side for like the super high strikes is really the main change. But in the near term, take a look at these. The 16 and a half's got actually quite interesting here, quite quickly. And if we take a look at OI changes here, the put side got active out and know, but then way out and feb, we see the calls change front not so much. So what this tells me is that near term expectation is still playing for expansion and vol. We're not seeing the unwind of these positions yet, although based on the price action we saw",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 35,
      "start_timestamp": "00:32:47",
      "start_timestamp_seconds": 1967.7714285714285,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=1967"
    }
  },
  {
    "text": "know, but then way out and feb, we see the calls change front not so much. So what this tells me is that near term expectation is still playing for expansion and vol. We're not seeing the unwind of these positions yet, although based on the price action we saw today, I do suspect we'll see some level of unwind in some of these VIX plays. Especially the real near term stuff. But so vol is not a sleep yet. Vol is what I would consider to be very, very active. And there's pretty strong positioning still still going on here. In terms of directional positioning, that's definitely slowing down a little bit. But in general, I think you can see a pretty strong, a pretty strong drift in the overall expectation with some caveat in terms of put side vol. But you can see that some of these trades, especially on the day, they're just massive. Like this was insane amount of movement just today, 35 mil in call premium, 23 mil, which is relatively high for something when the broad market is still making broad, broad up moves. So yeah, anyways, generally what I'm seeing from the the broad market. Now let's take a quick look at the individual sectors. Healthcare still can't catch a bid. Still the place to go looking for fades in my opinion. Utilities was crushing it, slowing down a little bit. This has become a picking ground for more neutral style plays. Same",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 35,
      "start_timestamp": "00:34:26",
      "start_timestamp_seconds": 2066.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=2066"
    }
  },
  {
    "text": "broad market. Now let's take a quick look at the individual sectors. Healthcare still can't catch a bid. Still the place to go looking for fades in my opinion. Utilities was crushing it, slowing down a little bit. This has become a picking ground for more neutral style plays. Same thing with real estate, same thing with staples. The relationship between staples and discretionary is been chaotic at best discretionary is now rolling off a little bit compared to staples staples is doing better at recapturing. And then you can see tech and comm services are generally leading the pack here. The other thing I want to show you quickly is the cop report. So here, I don't care about the rest of this. Here, I want you to pay attention to the positioning. And you can see that large speculators are still running net negative. And even though large speculators have come up a little bit in terms of net positioning, they're still that negative, which is funny because I actually view this as one of the very rare instances that at least for the move as we see it right now, retail called this way better way better because you can see small small speculators started phasing in here, right, buying this massive dip and sure as shit. So far, they're looking priced correct if they're taking profits quickly because it still seems like this here, right, notice just the general price behavior. We're seeing the high and",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 35,
      "start_timestamp": "00:36:04",
      "start_timestamp_seconds": 2164.5485714285714,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=2164"
    }
  },
  {
    "text": "because you can see small small speculators started phasing in here, right, buying this massive dip and sure as shit. So far, they're looking priced correct if they're taking profits quickly because it still seems like this here, right, notice just the general price behavior. We're seeing the high and then this hasn't really approached the high yet before already started trailing sideways. And as I showed you net highs lows is looking generally supportive, but we're not seeing big follow through volume yet. So if you take a look at overall volume here, you can see that on this day, we had outsize volume. But from that day into the last two trading days, volume has actually come off a fair amount. I would say so volume is not highly supportive here at least as of right now. Hey, yo, James, what up? Now, quick question before we go into scanning and just taking a look at that stuff. I talked about now on the Wednesday session, getting back to doing, you know, a quick market recap and then a skill development segment. Is there anything that you see on the list or anything that's not on the list that you might want to do a session on Wednesday for skill development? If not, I'm always happy to pick. But I try to take a look at stuff that you would like us to focus on to see if we can make it again a little more personalized and",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 35,
      "start_timestamp": "00:37:42",
      "start_timestamp_seconds": 2262.9371428571426,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=2262"
    }
  },
  {
    "text": "that you might want to do a session on Wednesday for skill development? If not, I'm always happy to pick. But I try to take a look at stuff that you would like us to focus on to see if we can make it again a little more personalized and focusing on what's most relevant to you at this point in time. And then as always, for the pro members on Thursday, we'll do the deeper dive in kind of the practical application of the concept. So feel free. I just kind of scroll around a little bit to let you eyeball and then throw it in the chat. Looks like Reese is interested in usual options activity. I actually think I have a video I'm going to do on that at some point. So that definitely could be one of them and open to whatever else you might want to take a look at. So feel free to let me know and then I'll grab whatever consensus is. All right. So now this doesn't look like anything. I'm just going through my my scans. These are ones that I haven't had a chance to catch up on for the day. So I'm just going to flip through a bunch of these really fast. One was this. Yeah. Okay. So this one is looking at funny enough actually unusual options activity. And this one looks like a pretty decent size play that came through. It looks like a little closer",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 35,
      "start_timestamp": "00:39:21",
      "start_timestamp_seconds": 2361.325714285714,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=2361"
    }
  },
  {
    "text": "day. So I'm just going to flip through a bunch of these really fast. One was this. Yeah. Okay. So this one is looking at funny enough actually unusual options activity. And this one looks like a pretty decent size play that came through. It looks like a little closer to the bid. Let's see. Yeah. It looks much closer to the bid. So this looks like unwinding into the strength. That's what I see. Yeah. I mean, still net. Net volume was strong. And let's see where this is all positioned. Yeah. So still bullish skew in terms of premium until you get out until July 25th. And then November 21st, the rest of it's pretty bullish in terms of overall skew. So this one looks interesting. I already have my alert set in here. It does look like it's wanting to break out. I don't love the amount of overhead and stuff. We'll take a look at a couple more GE GE. I've already talked about. I have a position in here. And yeah, I mean, this I talked about for a couple different reasons. This is involved in a lot. Lauren says, I can't see that list. Well, can you do more leaps on a skill dev? Not sure if that's applicable. When you say more about leaps, you mean talk to me about that idea, Lauren, is this like I assume it's some capacity of like using leaps? But give me a little more context on",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 35,
      "start_timestamp": "00:40:59",
      "start_timestamp_seconds": 2459.714285714286,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=2459"
    }
  },
  {
    "text": "Well, can you do more leaps on a skill dev? Not sure if that's applicable. When you say more about leaps, you mean talk to me about that idea, Lauren, is this like I assume it's some capacity of like using leaps? But give me a little more context on what is it about leaps? I think there's a couple different ways we could take that one, but I'll definitely add it to the list. James says plus one to spotting patterns. When you say spotting patterns is this in unusual options activity or is this just general patterns? James says, or I guess getting a better understanding of what's normal when it deviates from it. Okay, so you mean I assume you mean in terms of unusual options activity. H says how to identify a regime and how to figure out if ones changed would be interesting. Yeah, okay. Let's see if we have anything in here on regimes. We don't. That's great. So we can do identifying market regimes and botting or tea. I like that one. Market regimes are interesting too because there's a million different ways to classify them. You can classify market regimes based on all based on sectors based on interest rates based on economic factors. That's actually kind of fun. James says more general. I see. That's kind of tough. Let me see if I can figure something out for that one. So this would be like pattern. Because I have pattern spotting.",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 35,
      "start_timestamp": "00:42:38",
      "start_timestamp_seconds": 2558.1028571428574,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=2558"
    }
  },
  {
    "text": "all based on sectors based on interest rates based on economic factors. That's actually kind of fun. James says more general. I see. That's kind of tough. Let me see if I can figure something out for that one. So this would be like pattern. Because I have pattern spotting. I was going to change it to like pattern recognition. Yeah, so let me see if I can figure something out for this one. Pattern. Botting slash recognition. Developing baseline. And tracking deviation. Let me think on that one. Because that's an interesting one, but it's really, really difficult, especially if it's super broad. Like if I were to think about trying to teach somebody about spotting patterns, it would have to be done in the context of like looking at a certain thing. And it's just because obviously patterns vary so much. So I think that could be a fun one. I just have to think about. You just have to think about where to tie it to. Papa proper says would like to learn more about hedging downside risk with options. My biggest struggle is that I tend to overhead you my downside protection nearly offsets my gains. Yeah, that's absolutely going to be the case. That's about synthetic hedges. Okay, so I have one here. I'll build this one out. And then I'm just going to slot dates in for these so that we have them. So we'll do patterns. This one we could do pattern recognition",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 35,
      "start_timestamp": "00:44:16",
      "start_timestamp_seconds": 2656.4914285714285,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=2656"
    }
  },
  {
    "text": "Yeah, that's absolutely going to be the case. That's about synthetic hedges. Okay, so I have one here. I'll build this one out. And then I'm just going to slot dates in for these so that we have them. So we'll do patterns. This one we could do pattern recognition on 11. And then we can do unusual options activity. We'll do that one at some point. I don't know if I'm going to do the video first on that or not. And then for hedging hedging is a tricky one too. Because I honestly think hedging in options trading. I'm going to zoom this out. hedging in options trading. I think it's probably one of the most bastardized concepts that I can think of. Because retail traders really have this like extremely contorted idea that they're going to be able to have their cake and eat it too. Like pretty significantly actually, which is slightly confounding because what you're talking about is exactly correct. More often than not with hedging, you will find that it's really, really expensive on a relative basis. Intrating you get paid for taking risk. So then if we start to try an offset too much risk or even what might seem like not that much risk, but enough of it. And it'll really serve as drag on your returns. I think one of the most broken narratives I see retail traders have with respect to hedging is this idea that they're going to put",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 35,
      "start_timestamp": "00:45:54",
      "start_timestamp_seconds": 2754.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=2754"
    }
  },
  {
    "text": "much risk or even what might seem like not that much risk, but enough of it. And it'll really serve as drag on your returns. I think one of the most broken narratives I see retail traders have with respect to hedging is this idea that they're going to put on their hedge. Then they're going to somehow make money on their hedge and then make money on the base position, which is just so ignorant. Because in general context, like when you're putting your hedge on, that should be viewed literally as a cost. The cost of whatever the other position is that you want to put on for whatever reason. This is not to say hedging is bad or it doesn't have its use. It does. However, I think retail traders just have a completely broken view of hedging. So I actually really, really like that topic. That's good. Anything else that you guys can think of for our list or for building out the next several of these. Because I really like these two topics. Again, the unusual options activity will be in there somewhere. I'm just not sure if I'm going to do the video on it first or not. And then in the meantime, if you have any questions or if there's anything that you want to look at real quick, now's the time. I'm going to let Thor back in, but I got like maybe another four or five minutes. H says what the",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 35,
      "start_timestamp": "00:47:33",
      "start_timestamp_seconds": 2853.2685714285717,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=2853"
    }
  },
  {
    "text": "it first or not. And then in the meantime, if you have any questions or if there's anything that you want to look at real quick, now's the time. I'm going to let Thor back in, but I got like maybe another four or five minutes. H says what the most important tools are for a trader. That I love that one. I was literally just talking with somebody about this. I love this topic. I got to think on it. I don't really think about finding the best tools. This is a great topic. I think the topic is really, it's so interesting because like your question of most important or most important tools are for a trader. Best is really entertaining because in trading, there literally isn't one. It's just not how it works. So I will, oh man, I love that one. I have to think through this. Oh, shit. You guys didn't tell me. Joe just told me. It's BB-8. That's the fucking robot. Thank you, Joe. He just texted me. Now I got to look this thing up. BB-8. Yeah. This is what I was fucking talking about. You guys just straight up left me hanging. This is the dude. It's kind of like a less prone to get stuck R2-D2. It's just kind of fun. H says, highest impact might be the better term. No, no, no. I actually think the way that you're phrasing it is the most commonly way to phrase it.",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 35,
      "start_timestamp": "00:49:11",
      "start_timestamp_seconds": 2951.6571428571424,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=2951"
    }
  },
  {
    "text": "hanging. This is the dude. It's kind of like a less prone to get stuck R2-D2. It's just kind of fun. H says, highest impact might be the better term. No, no, no. I actually think the way that you're phrasing it is the most commonly way to phrase it. So I actually love that. The trick is it's kind of like looking for something that doesn't exist. So here, I'll give you an example. And then again, we definitely can go deeper in a detail, but I literally love this conversation. This will help me flesh out some of the ideas. If we were to think about like best or most useful. Here's how I would think about it. The very first thing would be option prices. The second thing would be price and volume. And then after that, it's all open. It's all entirely open. The reason is, let's say that I'm trading a breakout versus a drift. The indicators that matter to this versus this will be completely different. And that's what makes it such an interesting problem to solve for. But the cool part is it's actually not that hard ultimately to solve for and I'll show you. Because if we take a look at the absolutely insane deck that I've made, how long is this thing? This is crazy. This thing is getting nuts. But if we go to the ally or strategy process, notice what step two is profit mechanism behavior and signals. So",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 35,
      "start_timestamp": "00:50:50",
      "start_timestamp_seconds": 3050.045714285714,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=3050"
    }
  },
  {
    "text": "show you. Because if we take a look at the absolutely insane deck that I've made, how long is this thing? This is crazy. This thing is getting nuts. But if we go to the ally or strategy process, notice what step two is profit mechanism behavior and signals. So it's in these signals where we start to think of the tools that we're going to use to measure in effect in attempt to try to capitalize on the effect and monetize it. So this one's really interesting because there are definitely some tools that are just generally useful to have. But when you think about finding the best, and again, this was a question in the discord earlier, which is I understand it completely. That's why I don't say it's a dumb question or anything like that. It's exactly what I would be looking for as well. The problem is the way to think about like tools, signals, stuff like that is that it needs to be in service of something that's defined. So the way that I typically would think about it is not like what tool is the best. But I would literally start from the perspective of what is the profit mechanism we're talking about. Then I think we can start outlining what tools might be better than others. And that's where ads and takes a lot of shape is through that definition process. So I love that as a topic because it's one I think",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 35,
      "start_timestamp": "00:52:28",
      "start_timestamp_seconds": 3148.4342857142856,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=3148"
    }
  },
  {
    "text": "of what is the profit mechanism we're talking about. Then I think we can start outlining what tools might be better than others. And that's where ads and takes a lot of shape is through that definition process. So I love that as a topic because it's one I think that a lot of people have a very similar question on it. It's super common. So definitely can do something there. Justin says I'm not sure if it's on the list, but an overview of all the indicators you use. I think I have a video. Yeah, thank you James. Yeah, I think I have a video on I think there's a playlist called like analysis. It's really not a view of like all of the tools because anybody that's seen the channel long enough, you know, I move in between stuff, depending on what's going on in the market. But I definitely talk about like the main ones and stuff like that there. A lot of times what you see on the chart, it looks crazier than what it really is. Like all of these lines are just different moving averages. This is a standard deviation channel. This is a volume profile. I was pretty much it. That's up here. Then down here, it's volume average volume. These are kind of the weird ones. I'll give you. And these are more just because I like I like statistics and I enjoy tracking statistics. So this one is tracking stuff",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 35,
      "start_timestamp": "00:54:06",
      "start_timestamp_seconds": 3246.822857142857,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=3246"
    }
  },
  {
    "text": "a volume profile. I was pretty much it. That's up here. Then down here, it's volume average volume. These are kind of the weird ones. I'll give you. And these are more just because I like I like statistics and I enjoy tracking statistics. So this one is tracking stuff like price deviation spikes. This one is tracking vol deviation spikes. And that's pretty much it. So yeah, I think if you have any follow-ups on that, let me know. Wait, all right, gang. It is about time for me to hop off. As always, if you need anything, let me know. Be an outlier. See you guys later.",
    "metadata": {
      "video_id": "F7zoiv61ohM",
      "title": "Stock Market Update & Trading Recap | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=F7zoiv61ohM",
      "upload_date": "",
      "duration": 3780.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 35,
      "start_timestamp": "00:55:45",
      "start_timestamp_seconds": 3345.2114285714283,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F7zoiv61ohM&t=3345"
    }
  }
]