[
  {
    "text": "Well, well, well, what's up outliers? Happy Friday, great to be here with you all. I have everything set up ready for us to rock and roll actually a pretty light session in terms of presentation. Got to move the chat over here. So I keep an eyeball and also to say hello to everybody. So yeah, if you're here, don't forget to pop in the chat and say hi so that I can say hi back. I'm just like we have a handful of folks already to kick us off. I see there's Scott from earlier. I see Joseph Paul O'Tom fan of airplanes, Jay, lots of familiar faces, which is awesome. That's one of my favorite things about doing these Shrejay Justin, Shrejay, it's great to see you, man. It's kind of the fun part, Rude Abega. Can't forget that name. That's fucking hilarious. Zach, great to see you as well. Sweet. It looks like the the Gangs and Town. All right. So what are we doing today? Well, there's a handful of things that I want to cover. Mill Spectre to see you as well. In the past handful of sessions, we really have dove pretty deep into a lot of the basics of options trading. Kind of a lot of these random things that we should be aware of how they work, how they're priced, those kinds of things. So what I want to actually look at for some of this session is threefold. The first",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 96,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=0"
    }
  },
  {
    "text": "into a lot of the basics of options trading. Kind of a lot of these random things that we should be aware of how they work, how they're priced, those kinds of things. So what I want to actually look at for some of this session is threefold. The first thing is I want to take time to dive into any specific questions you guys have from any of the preceding sessions. That's the first thing. The second thing I want to look at a couple of questions that I've received previously, really two of them talked about the same exact thing and about five of them were about the same topic, which is this of defending positions. So we'll talk about defending positions. And then the last thing that I wanted to specifically cover today is looking at some trade examples. And I went back and forth on how I wanted to do that. I have a playlist on my YouTube channel about trade management, which is this one right here. So you can literally go through this playlist. You can find different strategies that I've used at different points and how I've managed different trades. There's also a couple other playlists that talk about management of individual style structures. So that's what this playlist is. What I'm highlighting is not to plug my own playlist. You guys are already on the channel. So plug in my own shit doesn't matter. It's mostly because I don't want to spend",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 96,
      "start_timestamp": "00:01:08",
      "start_timestamp_seconds": 68.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=68"
    }
  },
  {
    "text": "couple other playlists that talk about management of individual style structures. So that's what this playlist is. What I'm highlighting is not to plug my own playlist. You guys are already on the channel. So plug in my own shit doesn't matter. It's mostly because I don't want to spend a bunch of time looking at positions that I've had in armchair quarterbacking them. So I thought what might be more interesting for that section is to take a look at either trades that you guys have looked at yourselves or trades that you have on. And the reason why I think that could be interesting is because it gives us an opportunity to look at something novel, right? Something that I can't already speak all the way through because I know that's happened because it's my own position. The other thing I thought we could do is go back into on demand, which we've tinkered with before. And in on demand, we have the ability to go back in time and to trade different perspective positions. And then the third thing I wanted to cover with respect to this options trading kind of position section is to talk about a couple positions that I have on now that are in progress. And the reason I want to talk about in progress positions is because I don't know what's going to happen with them. And me not knowing what's going to happen with them is an important part of the",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 96,
      "start_timestamp": "00:02:32",
      "start_timestamp_seconds": 152.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=152"
    }
  },
  {
    "text": "a couple positions that I have on now that are in progress. And the reason I want to talk about in progress positions is because I don't know what's going to happen with them. And me not knowing what's going to happen with them is an important part of the discussion cycle about placing trades. Now the downside is there trades that I already have on, but I don't know what I'm going to do with them yet because I'm still figuring it out. So we have a bunch of different angles. We can approach that portion of this session, which we'll be looking at trades and actually to make sure that I keep us on track, I'm going to pop open a notepad real quick and jot down a few notes on how we're going to flow so that I keep us on track. So in the meantime, while I'm doing this, if you guys have relatively new positions or if you guys have, I'm sorry, if you guys have any specific questions that we want to start with taking a look at, I would love to start there. So we'll run through our QA. And then obviously the QA throughout the entire session, whatever there's something we're talking about that you want to learn more about, you just tell me. But if there's any specific topics that you guys want to start with, this is a great point to do that. Then we'll get into defending positions, which",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 96,
      "start_timestamp": "00:03:39",
      "start_timestamp_seconds": 219.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=219"
    }
  },
  {
    "text": "QA throughout the entire session, whatever there's something we're talking about that you want to learn more about, you just tell me. But if there's any specific topics that you guys want to start with, this is a great point to do that. Then we'll get into defending positions, which we'll need a couple ideas for that in terms of positions. We'll couple that I recently managed that I think will fit that bill pretty well. And then after that, we'll get into some trade examples. So that's what I got for us. For however long this goes, they've been typically about an hour and change. I think one of them is almost two hours. So all right. Timmy Peparoni, that is a hilarious name. Timmy Peparoni says, New here, just start off trading options a few weeks ago, feeling slightly overwhelmed. That sounds about right. I have, let me grab something for you specifically quickly. There's, I made a guide for people literally for this exact reason. And it's not, it's honestly not finished yet. I've told you guys this before. It's definitely work in progress, but it's something that I'm trying to use to like build out for you guys. So specifically for you, Mr. Peparoni, you can check out that Google sheet that I just shared. And that tries to add some structure around this to make it a little less overwhelming. So what this will look like is this document here on, that's hilarious. There's an",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 96,
      "start_timestamp": "00:04:49",
      "start_timestamp_seconds": 289.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=289"
    }
  },
  {
    "text": "you guys. So specifically for you, Mr. Peparoni, you can check out that Google sheet that I just shared. And that tries to add some structure around this to make it a little less overwhelming. So what this will look like is this document here on, that's hilarious. There's an anonymous bat. Love that. Hedgehog. Yo, these are cool animals. Okay. So the dinosaur is idle. There's a chipmunk. I like this bat. That's my favorite so far. And so anyways, you'll see that I kind of organize it into a couple primary clusters. That's what's noted in this section over here. These are just broad overarching topics that I think apply. Then I list primary learning objectives for each of them so that I think these are some of the more important components to take away from these. Click admin note. There's way more to trading than this. My goal, however, is not to add so much information to grossly overwhelm people. The reason for that is because there's no shortage of information available at this point. It's different than when I started. When I started trading, you were very much limited by the data you could find about options because there wasn't that much of it. Now it's the opposite. There's a million things that you can find and you don't necessarily know which one's good and which one's not. So what I'm trying to do is keep this comprehensive enough to focus on the important things but",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 96,
      "start_timestamp": "00:06:05",
      "start_timestamp_seconds": 365.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=365"
    }
  },
  {
    "text": "options because there wasn't that much of it. Now it's the opposite. There's a million things that you can find and you don't necessarily know which one's good and which one's not. So what I'm trying to do is keep this comprehensive enough to focus on the important things but not exhaustive so that if somebody opens this their eyes roll into the back of their heads and then they're overwhelmed. I add that caveat because this is not everything that goes into this. These are just some of the really big blocks that are here. On here, I offer some books that I would go through and order. I highlighted five of them that I think really, really makes sense to take a look at depending on your perspective and what you're trying to do. Then down here, I listed just some general steps, what I would be focusing on in order. I offer an outline of what I do and now I realize that this is not lined up with that. My OCD is just overwhelming. So we have to move away from that. And then on this page, the outlier options trading syllabus, the point of this page is to tie resources to each of these components. And what I mean by that is the resources I'm looking to share again are not necessarily comprehensive. These are definitely way more designed to be general to hit the high points as I think they make sense and then",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 96,
      "start_timestamp": "00:07:15",
      "start_timestamp_seconds": 435.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=435"
    }
  },
  {
    "text": "page is to tie resources to each of these components. And what I mean by that is the resources I'm looking to share again are not necessarily comprehensive. These are definitely way more designed to be general to hit the high points as I think they make sense and then to give you a launch pad. And specifically for the folks that are in the pros side of the Patreon, I offer kind of the ability to get a fact check, so to speak, on what you're learning and how that's going. But for everybody else, you don't need that, right? You can essentially look at the stuff I'm showing you, do it on the for free schedule and then get the vast majority of the benefit from it. So that's what this doc is and this is how to use it, essentially. Okay. Got to get caught up on the chat real quick. We got Roaring Titty. I always love to see that name, Big Ace. Coffee donuts and Homer. Do you get a chance to look at costs? Yeah, I looked at costs and it's anomalous. Now as you point out, it doesn't have options. I don't want to get super far down that rabbit hole because I'm really trying to keep these more about like learning options. But I'll take a look at that towards the end of this session if we have time. If we don't, that's totally okay. I think that we can also look",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 96,
      "start_timestamp": "00:08:22",
      "start_timestamp_seconds": 502.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=502"
    }
  },
  {
    "text": "to get super far down that rabbit hole because I'm really trying to keep these more about like learning options. But I'll take a look at that towards the end of this session if we have time. If we don't, that's totally okay. I think that we can also look at it Monday or we can go as deep into that stuff as we want. Rootabaga says, I don't even know what defending position means. That's a great question. It's actually a giant misnomer in my opinion. I think it's when traders are so scared of booking a losing trade that they have to call it something else to make themselves feel okay. So rather than saying, I took a losing trade down and I'm putting on a new trade or something like that or I'm adjusting a position we call it defending. But there's nothing inherently wrong with defending a position. The concept of defending a position is when you have something that's on and it's not going your way. You can do things in options like adjusting around the position and that's actually very cool about options. It's a unique thing that they offer. I don't love again calling it defending. I prefer to call it adjusting, but that's just semantics. So the main thing I draw the delineation there though is to try to avoid the emotional depth that goes into defending versus adjusting. It is pedantic as that might sound. There's a big difference between the",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 96,
      "start_timestamp": "00:09:46",
      "start_timestamp_seconds": 586.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=586"
    }
  },
  {
    "text": "calling it defending. I prefer to call it adjusting, but that's just semantics. So the main thing I draw the delineation there though is to try to avoid the emotional depth that goes into defending versus adjusting. It is pedantic as that might sound. There's a big difference between the psychology behind those two maneuvers. So I draw the distinction between them for that reason. Okay. Back up here. Elon Song says managing a trade synthetic long, CLSK, Jan 17th, 25, 75 calls. I sold out of the cash, I sold out of the cash secure put leg in order to free up cash waiting for 19 to 24 top to sell these. Okay. So first off, Elon Song's, I would absolutely remind you that synthetic stock, synthetic long is kind of a specific thing. So it looks like what you have is a long call. And again, this isn't to get overly pedantic, but this is we're talking about the fundamentals of trading, which is absolutely important to differentiate. So if I grab CLSK and we look at your example and we look at the 17 Jan 25 here, we go to the 7.5 calls and we analyze this trade a couple things. This is actually not synthetic stock because of this just to be very clear. If this was a synthetic stock position, we would have some sort of short put component added to it. Now this is synthetic stock just to be clear. And again, I'm not,",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 96,
      "start_timestamp": "00:10:48",
      "start_timestamp_seconds": 648.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=648"
    }
  },
  {
    "text": "trade a couple things. This is actually not synthetic stock because of this just to be very clear. If this was a synthetic stock position, we would have some sort of short put component added to it. Now this is synthetic stock just to be clear. And again, I'm not, I'm really not trying to like point this out to be pedantic. I'm trying to point out to make sure that we're being accurate because I know a lot of people that consume tasty content, which again, I love Tom Big fan, but I think it can muddy the waters when we use the term synthetics in places where it actually doesn't make sense. Elon Song says I already had, I originally had that short put. Now I just have the long call. Yep. Okay. So point though, exactly to your point that your position absolutely started as a synthetic, is synthetic shares. But then now it represents a long call is all and that's okay. The again, the only reason why I'm drawing the distinction, especially because clearly as you're talking about it, you know that difference. I'm drawing the distinction for other people that might not know the difference because as you guys may or may not know in the trading space, we use a lot of terms in different ways. And there's a lot of colloquial uses and then there's a lot of kind of like super accurate uses by definition of sorts. So I'm just making",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 96,
      "start_timestamp": "00:12:29",
      "start_timestamp_seconds": 749.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=749"
    }
  },
  {
    "text": "difference because as you guys may or may not know in the trading space, we use a lot of terms in different ways. And there's a lot of colloquial uses and then there's a lot of kind of like super accurate uses by definition of sorts. So I'm just making sure that that's clear for folks. So this is synthetic long down here. Now our position is long calls. So going back up though to your question, waiting for 19 to 24 to sell these. Let's see. I think that's so we're talking about managing long calls to be very clear about kind of this section here. And the first thing that I would do is see what I think about the underlying because I think there's nothing wrong if your target is something between 19 and 24. That's okay. And it looks like it's generally oscillating in that direction pretty slowly, but it's also important to remember that there is an opportunity cost to capital and you kind of need this thing to do what you want it to do. And just because we want it to go there doesn't mean it's going to go there. So the next question I would have for you, Elon songs, is if it doesn't go there, what is your management approach? So let's say for example, as I'm just kind of eyeballing this, let's say for example, it starts to go down to whatever degree that makes sense for us. But what's",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 96,
      "start_timestamp": "00:13:48",
      "start_timestamp_seconds": 828.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=828"
    }
  },
  {
    "text": "question I would have for you, Elon songs, is if it doesn't go there, what is your management approach? So let's say for example, as I'm just kind of eyeballing this, let's say for example, it starts to go down to whatever degree that makes sense for us. But what's the move there if it starts going down? Elon song says what I'm confused about is how quickly Theta or valuable melt versus selling it. That's a great question. And then Elon song says what that's what I don't have clear if it goes below 15 all close. Yes, literally perfect. So the very first thing I would offer to you is whenever we place a trade literally every single time we need to have profit and loss defined before entry that before entry component is so important. It's because it is one we are the most objective we can possibly be as a trader is at that point before the trade is on before the risk is on before any emotion before any hopes dreams enter the equation before all of that in my opinion is just it's a non-negotiable. I have this corny little saying that I use that I actually believe in though to a pretty significant degree, which is in trading, there's so much bullshit right people will say, well use this one indicator and make a good 1 trillion or all you have to do is trade for five minutes a day and make 5,000",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 96,
      "start_timestamp": "00:14:59",
      "start_timestamp_seconds": 899.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=899"
    }
  },
  {
    "text": "that I actually believe in though to a pretty significant degree, which is in trading, there's so much bullshit right people will say, well use this one indicator and make a good 1 trillion or all you have to do is trade for five minutes a day and make 5,000 a day. Like it's all bullshit. But there's one thing that's legitimate and there's one thing you can do that will legitimately transform your trading and that is defining your profit and loss before you enter a trade. Because if you do that and you track it and you will be able to observe trends that can then feed your system to then optimize the system. So the very first thing is to do that. Now that that points aside, let's answer your specific question though about how quickly theta will impact the position and then just in case you guys didn't know YouTube wants me to insert an ad now it says now's a good time. What you guys already know the answer to that the answer is we hit close and I finally have learned how to not let YouTube do this. So there's another thing that it pops up that says focus on your live stream and let YouTube insert ads for you. I'm pretty sure that like YouTube hates me because I actively turn off all of these ads. It's kind of actually hilarious. So I don't want to disrupt you guys with it, but I",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 96,
      "start_timestamp": "00:16:21",
      "start_timestamp_seconds": 981.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=981"
    }
  },
  {
    "text": "pops up that says focus on your live stream and let YouTube insert ads for you. I'm pretty sure that like YouTube hates me because I actively turn off all of these ads. It's kind of actually hilarious. So I don't want to disrupt you guys with it, but I find the pop ups are hilarious. So let's talk about exactly that. And for anybody in the chat that knows can you walk me through how we can answer Elon Song's question specifically about how quickly the theta or value will melt versus selling it, which is a great question. How can we do that? There's a few things that we can easily do. The first one is navigate to our options chain, get rid of this. So what can we do in here? So that means that it's actually quite, quite spelled out for you. You go right here, you go to the option chain and you look at theta. That right there tells you exactly the answer to that question. So that means ceteris parabis, everything else remaining the same as a day passes, you will lose a penny on your options. Now again, it's not a penny, right? It's a dollar because you got to, it's per share. You have to multiply it out by a hundred. That's what it decays on a daily basis, everything else remaining the same, a buck. So this is essentially the cost of leverage for you. That's what this is showing",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 96,
      "start_timestamp": "00:17:32",
      "start_timestamp_seconds": 1052.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1052"
    }
  },
  {
    "text": "right? It's a dollar because you got to, it's per share. You have to multiply it out by a hundred. That's what it decays on a daily basis, everything else remaining the same, a buck. So this is essentially the cost of leverage for you. That's what this is showing you. Rudeabag has a great question. Does theta change over time? Fantastic question. And I actually preemptively expected these questions, one like that, and I grabbed this. Here. So this is theta decay in the top right. So to answer Rudeabag's question, does theta decay change over time? Absolutely. And this is exactly how. So as you get closer and closer into time, your theta decay, theta decay will accelerate. And we can look at an example. One of the things that you'll hear me talk about when I'm analyzing options chains is this concept of surrogate options. And I actually don't know if that's proper at all to use. I've used it my whole life, but it's exactly what I do is I use different options to simulate different scenarios in my brain. Now as special as that might sound, let's take a look at these seven and a halfs and let's pretend that we hold those seven and a halfs until the equivalent of the 20 December expiration cycle. So what that means is I would simply pretend that time has passed. And rather than our options having 190 60 to E, this 17 Jan expiration cycle will",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 96,
      "start_timestamp": "00:18:59",
      "start_timestamp_seconds": 1139.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1139"
    }
  },
  {
    "text": "halfs and let's pretend that we hold those seven and a halfs until the equivalent of the 20 December expiration cycle. So what that means is I would simply pretend that time has passed. And rather than our options having 190 60 to E, this 17 Jan expiration cycle will now look like this 20 December, meaning rather than having 190 60 to E, where our 17 Jan's now have 160 80 to E. So I'm going to look at this one. And then I'm going to see if there's seven and a halfs and there's not, which is kind of annoying, but it doesn't really matter because I can also just take a look between the difference between seven and eight to get a sense. So what I'm looking at is where does my theta go in this scenario? What happens to theta if essentially this time frame passes a little over 20 days or whatever? And we can see theta if we wait for 20 days is still essentially a penny a day, dollar a day in total. So you can do this to get an idea of what your position might look like as time passes. Now there's not always perfect, right? Like your seven and a halfs are not in here. So you can't do that to the same degree in here. So this is one way. Another way to look at this is to go into some sort of risk profile tool. You can either",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 96,
      "start_timestamp": "00:20:23",
      "start_timestamp_seconds": 1223.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1223"
    }
  },
  {
    "text": "there's not always perfect, right? Like your seven and a halfs are not in here. So you can't do that to the same degree in here. So this is one way. Another way to look at this is to go into some sort of risk profile tool. You can either make your own. It's very simple to do genuinely in Excel. It's not difficult to model all of the different Greeks for an option given a certain amount of information. You can eyeball what the total theta of a position could be or you can just fast forward time. So you can say right now we're looking at the 5th of July if we go fast forward two days. You can see this line is moving. It's just not moving very much because the theta is so low. So if I zoom this in really, really far, that's what I'm doing by kind of this annoying dragging process. I'm zooming us in almost to a microscopic level. I just want you to be able to see this line move as I click the days. So this is the 5th of July. Now watch as I fast forward time. Watch that purple line. Notice how it moves. I just fast forwarded us 20 days. That's how much it moved over the course of that 20 days. So this is another way that you can see how much your theta will decay or the options will premium will decay due to theta.",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 96,
      "start_timestamp": "00:21:44",
      "start_timestamp_seconds": 1304.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1304"
    }
  },
  {
    "text": "purple line. Notice how it moves. I just fast forwarded us 20 days. That's how much it moved over the course of that 20 days. So this is another way that you can see how much your theta will decay or the options will premium will decay due to theta. So that's the kind of two easy ways to do this. And that's essentially what I would do. If I wanted to know how much theta am I giving away or getting chewed up by this is exactly what I would do. I would just go into the option chain and I would look. I would say, okay, I have the 7.5. There are 91 delta. I know something that's really deep in the money is going to have less extrinsic value. It's going to decay less quickly. I'll take a look at the theta specifically. This is a penny a day. And you can even get this out down to a third decimal place if you want in something like thinkorswim so that you can see like more precisely what it is. But I would look at that and say that's simply not much. That's the cost of my leverage. So that is the overall process I would follow. And Elon songs if you have any follow-ons to that. Let me know. All right. Get back through. I just got to get caught up. Zach says, is there a free website you'd recommend for options? I have fidelity but",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 96,
      "start_timestamp": "00:22:46",
      "start_timestamp_seconds": 1366.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1366"
    }
  },
  {
    "text": "leverage. So that is the overall process I would follow. And Elon songs if you have any follow-ons to that. Let me know. All right. Get back through. I just got to get caught up. Zach says, is there a free website you'd recommend for options? I have fidelity but can't see where they have delta gamma listed. I was the taint on it only looked at cost basis my first couple of times. When you say for option Zach, do you mean for trading options? If so, most brokerages have like decent platforms. If you want to analyze options, chains like thinkorswim here is what I use. But you can use a bunch of other stuff. IB interactive brokers has their platform. Fidelity has their own platform. I'm pretty sure I think they even have one that you can download if I'm not mistaken because I had some capital with them at some point. They have like their thing like fidelity pro, which is their own little trader platform like this. So that's what I would do. Oh, it looks like growing titty. You already got you. You probably need to go into the settings. Actually, trade of pro and customize your window. Yep, exactly right. It's perfect. Anthony says high friends. What's up Anthony? God says smooth brain question. When I'm seeing the bid and ask is the ask the seller and the bid the buyer or is there a different way to look at it? That's exactly",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 96,
      "start_timestamp": "00:23:45",
      "start_timestamp_seconds": 1425.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1425"
    }
  },
  {
    "text": "and customize your window. Yep, exactly right. It's perfect. Anthony says high friends. What's up Anthony? God says smooth brain question. When I'm seeing the bid and ask is the ask the seller and the bid the buyer or is there a different way to look at it? That's exactly right. The only difference I would offer you when you look at the bid and the ask is more often not. It's actually the same person. It's a market maker that's resting orders. And they're essentially saying what they're willing to transact at. That's what this is. Now you can even go a step further if you're so inclined and you can add up here, another tab would be the size. And you can see what market they're specifically offering. I'll see if I can add it without like completely crushing how deep this is already. So there's the size. It's kind of difficult to see. And it doesn't look like this lets me expand the window. That's slightly annoying. Maybe if I hover on it. Perfect. So in this case for Elon songs position actually, if we look at it right now, it's bid at 950 offered at 980. The difference between these is the bid asked spread. And this is predicated on the market maker and what they're willing to offer you. Right now they're willing to offer 501 at the 950 for 91 at the 980. Why is that? Why would they have a difference? It's because",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 96,
      "start_timestamp": "00:24:50",
      "start_timestamp_seconds": 1490.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1490"
    }
  },
  {
    "text": "The difference between these is the bid asked spread. And this is predicated on the market maker and what they're willing to offer you. Right now they're willing to offer 501 at the 950 for 91 at the 980. Why is that? Why would they have a difference? It's because they might have a different perception of risk or depending on how the rest of their book looks like, they might want to take a different profile. These are not in the context when a market maker is offering you a position. It's not in the context of this one individual strike. They are looking at it from the perspective of their entire book. What makes sense based on my entire portfolio of shit and what I'm trying to do with their risk? That is what a market maker is most concerned with is managing their risk effectively so that they can capture their primary profit mechanism, which is the bid asked spread. So that's why you'll see different numbers here. You'll see these numbers move. They can spoof orders. That's more for high frequency trading. I'm kind of bastardizing the term for this. But essentially they can flash orders that don't actually represent what they want to trade at. They can flash orders that are worse than they want to trade at that they would improve if an order comes in at to not divulge what they're calculating IV for. For example, if they know that they're competing with",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 96,
      "start_timestamp": "00:25:57",
      "start_timestamp_seconds": 1557.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1557"
    }
  },
  {
    "text": "that don't actually represent what they want to trade at. They can flash orders that are worse than they want to trade at that they would improve if an order comes in at to not divulge what they're calculating IV for. For example, if they know that they're competing with other makers in that space, that goes down obviously a very specific ribo hole that we do not need to go crazy, crazy into. But just general context there. So when you're looking at the bid asked spread, that is the way you're looking at it is exactly correct. The bid is what you could sell something at right now. The offer or the ask is what you can buy something at right now. Now, most traders, especially on the retail side because we tend to trade in much smaller size on a relative basis, you should always target the mid first or even something that's slightly advantageous to you. So what that means is let's say that like Elon songs, I want to buy this option. Well, I know I could buy it at 980. I want to pay 980. I want to I know that they're building themselves a big buffer here. So I'm going to be a cheap bastard. And maybe I'll come in at like 955 or 960. Maybe if you getting a fill there is unnecessarily great. But I also have literally nothing to lose by not giving them exactly what they want to start",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 96,
      "start_timestamp": "00:27:02",
      "start_timestamp_seconds": 1622.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1622"
    }
  },
  {
    "text": "a big buffer here. So I'm going to be a cheap bastard. And maybe I'll come in at like 955 or 960. Maybe if you getting a fill there is unnecessarily great. But I also have literally nothing to lose by not giving them exactly what they want to start and working actually closer from the bid over to the offer. What's the trade off here? Well, I'm sacrificing speed of fill. I'm letting my order be known by the market. So then they could slowly ratchet the price up if they want. They can adjust their market as I'm adjusting my order. So that's the perspective downside. But in general markets are pretty competitive. So you're not necessarily going to give up a whole lot. The main thing that you're giving up there is speed of execution. And if you're not in a giant rush, that's okay. You can give up a little bit of speed. So let me know if that answers your question. The warranty he says are these lessons you're doing for Patreon? No, no, no, no. So from that document that I was showing you guys, that's literally they're open for everybody. The purpose of that document is to give you guys an outline for things. I'm just grabbing it back up because I think I accidentally closed it. Yeah. So the whole purpose of this document is not to give it to anybody or anything. This is to give you something to work through",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 96,
      "start_timestamp": "00:28:07",
      "start_timestamp_seconds": 1687.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1687"
    }
  },
  {
    "text": "that document is to give you guys an outline for things. I'm just grabbing it back up because I think I accidentally closed it. Yeah. So the whole purpose of this document is not to give it to anybody or anything. This is to give you something to work through like a little bit of structure. And then these are just videos that are available for everybody. The part that I offer the Patreon folks is as they finish a module, there's a spot you can drop in and say, hey, I just finished module one. And as soon as I see that, I pop in there and essentially I quiz you. I asked some questions about the content in this to then attempt to try and help the detail sink in more deeply to make sure that there's kind of a practical understanding of the key points in there. But the videos and stuff in there, that's for everybody. Joseph says, just want to tell you that they have a lot of respect, have an amazing work ethic, provide a lot of information, take and submit. Yeah, absolutely. That's awesome. I'm stoked to hear that. Lauren, a kid, what up, Lauren, a kid? So yes, bid is the buyer and you can get filled there, but very unlikely because ask is what they want and it's higher than a bid. You can buy in the spread as well between the two, but it's a medium fill chance. Yeah, I",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 96,
      "start_timestamp": "00:29:22",
      "start_timestamp_seconds": 1762.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1762"
    }
  },
  {
    "text": "up, Lauren, a kid? So yes, bid is the buyer and you can get filled there, but very unlikely because ask is what they want and it's higher than a bid. You can buy in the spread as well between the two, but it's a medium fill chance. Yeah, I think that's a fair way to put it. Like, the chance of getting filled between the bid asked spread is actually very high. You do not need to go to the extremes. That's the only time you would go to the extremes, meaning transact at the bidder offer is if you need to trade right now. It's like submitting a market order. I need something right now. But if you take any time to play the bid asked spread, you'll overwhelmingly number of cases get a fill somewhere in there. So maybe you don't get exactly at the mid, but maybe you get something a little towards the offer, but not the offer itself. Like that, that'll happen literally all the time. Tampa Bay Buck I says, Hey, Eric, what's your opinion on flowing Siri? We can take a look at that. I looked at that not too long ago. And I want to keep these more kind of educational concepts. So if there's time at the end of the video, remind me and happy to take a look at it. If not, we can dive into that way more deeply on the Monday live session. Happy to do that.",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 96,
      "start_timestamp": "00:30:28",
      "start_timestamp_seconds": 1828.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1828"
    }
  },
  {
    "text": "And I want to keep these more kind of educational concepts. So if there's time at the end of the video, remind me and happy to take a look at it. If not, we can dive into that way more deeply on the Monday live session. Happy to do that. Peyton says, can you explain how somebody in 1123 correctly predicted the stocks recent movements based off of some log view of the chart? I don't understand your question at all. It's yeah, Peyton, could you clarify your question a bit because that one does not make sense to me. It sounds like you're talking about somebody back in November of 23 predicting a stock movement that recently happened. And if that's the question, I can absolutely work through that with you. But the answer's probably going to disenfranchise you. Tampa Bay says Eric love the tax and profile, US and R and some for five brother. Well, cost Ali, can you please show me to place a limit order in toss? Sure. Really, if you want to place a limit order for shares, it's just down here limit. And that's it. There's your limit order. If you want to do it for options, it's the same exact thing. So by this limit order and then input the price that you want to limit at right there. Ruta, Vegas says does theta change over time? It does. So theta as we were kind of talking about. So if we look",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 96,
      "start_timestamp": "00:31:30",
      "start_timestamp_seconds": 1890.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1890"
    }
  },
  {
    "text": "do it for options, it's the same exact thing. So by this limit order and then input the price that you want to limit at right there. Ruta, Vegas says does theta change over time? It does. So theta as we were kind of talking about. So if we look at the surrogate option scenario, if we go way out here to 560 days in this and we look at 91 delta option, the theta is literally so low you need to go to a third or fourth decimal place to even see it. So then if we come in here to 18 July and you go to that same 91 delta, you can see it's the same scenario. It's so far out of the money you need a third decimal place. Then if we come in here to 17 Jan, now it's out of penny, you can see it. Then if we fast forward to 42 days, you'll see now it's at two pennies. And then if we come in here to 14 days to that same 91 delta, which is somewhere probably around here, it's four pennies or so. And the reason why it gets lighter is you go further in the money because there's less extrinsic value to even have theta to K. There's so far in the money. So yeah, theta definitely changes over time. Ruta, Vegas says so basically theta is a function of time and has nothing to do with the stock movement. Not",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 96,
      "start_timestamp": "00:32:44",
      "start_timestamp_seconds": 1964.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=1964"
    }
  },
  {
    "text": "go further in the money because there's less extrinsic value to even have theta to K. There's so far in the money. So yeah, theta definitely changes over time. Ruta, Vegas says so basically theta is a function of time and has nothing to do with the stock movement. Not necessarily. Because theta is a function, theta measures in options decay due to the passage of time. But theta applies to the extrinsic value of an option, which is dependent on the stock movement. So that's the tricky part. When you talk about options in general, is that there's a lot of correlations between things. You talk about individual concepts in a vacuum because it's easier to understand them if other things aren't changing. But yeah, so theta in a vacuum simply measures the passage of time and the impact that has on the premium of an option. That's absolutely correct. In a practical sense, theta applies to extrinsic value, which cares tremendously about the movement of the underlying. So I wouldn't decouple them mentally is all I'm trying to explain there. Joseph Apex writes as what platform this is think or swim. Joseph says so when Roryne Kitty made those crazy gains on his options, people said he didn't have enough money for them. This has me confused. If you make gains on options, you have to have money to buy them. No, you absolutely don't. Yeah, you don't have to worry about that at all. So what they're",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 96,
      "start_timestamp": "00:33:46",
      "start_timestamp_seconds": 2026.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=2026"
    }
  },
  {
    "text": "those crazy gains on his options, people said he didn't have enough money for them. This has me confused. If you make gains on options, you have to have money to buy them. No, you absolutely don't. Yeah, you don't have to worry about that at all. So what they're what those people are referring to is the ability to take assignment. So let's say for example, using this same ticker since we've been on it for a hot minute and why not. Let's say that Elon Songs has a one lot at seven and a half. Well, in order to put this position on, she's using 965. That's all it takes to buy this option. However, she has access to a different size position. So when you're looking at two, there's two different scenarios. You have whatever the cash secured amount is for an option. And then you have whatever the option is trading for. Now this is an anomalous trade. And the reason why this is anomalous is because there's more intrinsic value baked into these options than is actually here. And that happens in really extreme cases. And I don't want to get too too stuck on that point. So let me use something a little more appropriate to at least share that specific point. I'm going to use something that's cheaper so that it doesn't have as many spots, meaning decimal places so it's less congested. Why the freak disease have super weird options? That's annoying.",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 96,
      "start_timestamp": "00:35:14",
      "start_timestamp_seconds": 2114.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=2114"
    }
  },
  {
    "text": "that point. So let me use something a little more appropriate to at least share that specific point. I'm going to use something that's cheaper so that it doesn't have as many spots, meaning decimal places so it's less congested. Why the freak disease have super weird options? That's annoying. That's counting for like a special dividend. I'm trying to find like a simple example to give you guys and everything I'm opening up has diamonds. This also has adjustments for different special dividends. What the hell? I need like a simple ticker that doesn't have a bunch of man. What let's use X okay, let's get into sector's yet. This 200 that's too much money. Let's use XLF. This should be cheaper. Here we go. All right. We're on to something. This is great. Okay, this is great. So now that we can finally give you guys an example, even though this is super illiquid, let's not pretend we're going to transact here because I'll be a terrible idea. But let's go along with this example. If you buy this option and you get it at the mid, you're paying 520. It gives you access to 3,700 of shares, right? Because this is per share. Now when you buy an option, you don't have to have the 3,700 to take this position. That's the leverage gained by options. Now what you could not do unless you have enough margin space in your portfolio, but let's just pretend you didn't.",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 96,
      "start_timestamp": "00:36:32",
      "start_timestamp_seconds": 2192.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=2192"
    }
  },
  {
    "text": "right? Because this is per share. Now when you buy an option, you don't have to have the 3,700 to take this position. That's the leverage gained by options. Now what you could not do unless you have enough margin space in your portfolio, but let's just pretend you didn't. You could not exercise your calls and then take on the shares because you would not have enough capital. Again, you could do it if you could onboard via margin, which is again, a slightly other nuance conversation. But that's what you were hearing when people were saying that his position was too big essentially. And it was. I did the math in a couple videos on his position because it was just really, really interesting to me. And I think what was it like 120 million or it's so ridiculous to me that I'm talking about a dude that goes by named roaring kitty. And I'm talking about over 100 million position. It's so crazy. But yeah, I think that that's about what it was. Oh no, it was more than that. It was like 240 million or some shit. And he only paid like 68 million for his options or something like that. Again, as you could tell, I don't fully remember. That's the point is that he didn't have enough capital in the account to take on the whole position that we know without definitely or that what we know with certainty. All right, let me know",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 96,
      "start_timestamp": "00:37:41",
      "start_timestamp_seconds": 2261.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=2261"
    }
  },
  {
    "text": "options or something like that. Again, as you could tell, I don't fully remember. That's the point is that he didn't have enough capital in the account to take on the whole position that we know without definitely or that what we know with certainty. All right, let me know if that answers your question. Peter says, what are the modules that's back on this? The modules are just groupings of lessons essentially. So like module one looks at basics of investing, investing 101 module two talks about like market structure module three looks at like behavior of traders and tendencies. So the modules just break down the topics into sub topics is all it makes it I try to organize it a little bit is all. Ian says, do you trade P and for those that don't know what P is, that's not what you and your significant other do on the weekend to each other. This is post earnings announcement drift. And yes, I do trade P for sure. Absolutely. Is it a part of earning specific allocation or what does it sit similar question for long straddles 10 days before earnings announcement? Yeah, great questions. So P is definitely part of a drift momentum play for me. It is absolutely after the fact. And when I look at post earnings announcement drift, the whole idea there is to try to capitalize on the continuation of a move. And there's actually a lot of ways you can search",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 96,
      "start_timestamp": "00:39:03",
      "start_timestamp_seconds": 2343.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=2343"
    }
  },
  {
    "text": "is definitely part of a drift momentum play for me. It is absolutely after the fact. And when I look at post earnings announcement drift, the whole idea there is to try to capitalize on the continuation of a move. And there's actually a lot of ways you can search and scan for post earnings announcement drift, but a really easy example is something like Nvidia. So Nvidia had big massive gap up for earnings. It also had a significant beat on expectations. It came in at 6.12 versus 5143 expected. There's very specific criteria that go into post earnings announcement drift. So this ticked some of those boxes. And then the hypothesis is over the following quarter, you tend to see out performance given those conditions. So yeah, and you can also trade post earnings announcement drift to the downside. It's not always positive. A lot of times I'll refer to it as positive earnings announcement drift because that's kind of the lens I typically trade it through to the upside, but you can trade post earnings announcement drift to the downside. But there's specific criteria that have to be met that tie to gap of the position, meaning gap on the release. And then the level of beat that ensues or miss to the downside, that's what needs to be in place here. There also needs to be some other criteria that have changed a lot over time, which is how efficacious it is given the size of",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 96,
      "start_timestamp": "00:40:21",
      "start_timestamp_seconds": 2421.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=2421"
    }
  },
  {
    "text": "gap on the release. And then the level of beat that ensues or miss to the downside, that's what needs to be in place here. There also needs to be some other criteria that have changed a lot over time, which is how efficacious it is given the size of the product. So let me grab this for you guys. You guys can grab this off of SSRN. I'll grab the zoom out here for you. So this is one of the very many studies that I will cite and talk to you guys about. And this is where you can get a lot of good basis information on post earnings announcement drift. And it quantifies it. It shows different effects, but here's the punch line. So you essentially can see about an abnormal return. That means access. This is alpha of over 9. This changes over time. It's not like you just do this and get 9 per quarter, but it's not that far off. Post earnings announcement drift is a big part of my book. And that's very, very purposeful. Crypteta, what's up, man? Thank you so much. I literally am just about to order dinner. I actually think we're going to do Buffalo Wild Wings again. I think I've been on like a boneless wing kick. I went through a really strict diet period for a while. So I think my body is just craving trash and carbs right now. So I am very thankful. Thank you",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 96,
      "start_timestamp": "00:41:33",
      "start_timestamp_seconds": 2493.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=2493"
    }
  },
  {
    "text": "think we're going to do Buffalo Wild Wings again. I think I've been on like a boneless wing kick. I went through a really strict diet period for a while. So I think my body is just craving trash and carbs right now. So I am very thankful. Thank you very much. My B-Dubs will be even more delicious. Thank you. Back up to the questions. Joseph says, what does it mean to exercise them? Is that the only way? No, it's not the only way. It's actually a suboptimal way to transact there. I should have, let me see, this should be from the OIC. Let me one sec. I think I have a screenshot somewhere from the OIC on this exact topic, but I want to make sure about the settlement of options. Here we go. And now I did. Yo, I'm like a freaking encyclopedia. Yo, look at me. Go. Got to shift for everything. So this looks at the settlement of options. And it says, you'll hear people mistakenly cite literally all the time. Most options expire worthless. This is why you should sell them, which is literally complete trash. It's not accurate. 72 of all option contracts are closed out prior to expiration. So the overwhelming majority of options are traded. This is the primary way that we close options positions. It's just way more efficient. There are 22 that expire worthless. And then there are 6 that get exercised. Exercise is generally an inefficient",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 96,
      "start_timestamp": "00:43:06",
      "start_timestamp_seconds": 2586.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=2586"
    }
  },
  {
    "text": "option contracts are closed out prior to expiration. So the overwhelming majority of options are traded. This is the primary way that we close options positions. It's just way more efficient. There are 22 that expire worthless. And then there are 6 that get exercised. Exercise is generally an inefficient modality with options. We overall want to avoid this. So the vast majority of instances we want simply to trade the options. There's a bunch of reasons why it doesn't make sense to exercise. From the option buyer's perspective, you give up any residual extrinsic value. So if we go back to Wells Fargo. And let's say that you bought these 60, let's say you buy something that's in the money, something that has intrinsic value. Let's say that you have these 18 October, 55 calls. And let's say that you bought them for whatever. Something cheaper than what they are now. Let's say you got them for 5. And let's pretend Wells Fargo's gone up a bunch and you're making money. So what you don't want to do unless you really want the shares is exercise your options early. Why do I say that? What can you find from this scenario? Why would that be disadvantageous? Other than the fact that perhaps you really want the shares. And there are absolutely new on circumstances where it still can make sense. But there's a specific reason why we don't want to do that here. Any guesses? Jay, you are becoming",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 96,
      "start_timestamp": "00:44:30",
      "start_timestamp_seconds": 2670.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=2670"
    }
  },
  {
    "text": "this scenario? Why would that be disadvantageous? Other than the fact that perhaps you really want the shares. And there are absolutely new on circumstances where it still can make sense. But there's a specific reason why we don't want to do that here. Any guesses? Jay, you are becoming really well versed in options. If I'm not mistaken, you're relatively new to this stuff. And you're doing an incredible job so far. It's exactly correct. You give up the extrinsic value. This is actually why going back to a GameStop example. I don't think Warren Kitty exercised his options. The reason why I don't think he exercises options is because he would have given up over 3 million in extrinsic value that he could have recaptured by trading the options. Now there's always competing interest. You could say, well, I really don't want to deal with buying options. If the market's going to move a lot, if there's low flow, I just want to exercise in this case. And that's okay. You can do that. But you are absolutely leaving money on the table when you make that choice. So in that case, you would be sacrificing optimizing the profitability of the position for a convenience-based reason. Which again, that's okay. You can do that. But it is a noteworthy trade off to make. So yeah, absolutely. That was 100 correct. We have to do a speed reload. We now have watermelon, seltzer water, which is definitely my favorite.",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 96,
      "start_timestamp": "00:46:06",
      "start_timestamp_seconds": 2766.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=2766"
    }
  },
  {
    "text": "profitability of the position for a convenience-based reason. Which again, that's okay. You can do that. But it is a noteworthy trade off to make. So yeah, absolutely. That was 100 correct. We have to do a speed reload. We now have watermelon, seltzer water, which is definitely my favorite. This one has not been as good. The blood orange tangerine, spin drift. One I really like is like the mango orange one. That's way more refreshing. This one's not bad. But I think it might be just because the oranges are small, the tangerines, I feel like I just need a big orange. Maybe they just taste better. That could be it. Back up top. Joseph says, what does it mean to exercise that? Okay. So I think we answered that. That one you can absolutely, you can trade the option. And that's probably the better choice. Abdullah says, any thoughts on AMD and Tesla? I'm going to skip on those for this session. Again, we can look at those on Monday. I want to focus this way more on the fundamentals of trading. Audi says, hey, I thought you would have said howdy, man. I was wondering if you have a series on YouTube for options 101, extremely new to options. Yeah, you know it. They're literally, if you go back into this other document that I've shared with you guys. And if you go to down here where it says options 101, there's literally a playlist, the",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 96,
      "start_timestamp": "00:47:31",
      "start_timestamp_seconds": 2851.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=2851"
    }
  },
  {
    "text": "you have a series on YouTube for options 101, extremely new to options. Yeah, you know it. They're literally, if you go back into this other document that I've shared with you guys. And if you go to down here where it says options 101, there's literally a playlist, the very first one. And fun fact, this options like introduction video, the one that's pretty long, I have a new one that I'm trying to launch next week. Literally that I shot all the way straight through. It's an hour and 40 freaking minutes that I just sat in my office talking to myself about options. It's crazy. But I'm trying to turn that into like a really, really good staple video that I'm proud to put in front of you guys. The last one that I did, the last couple that I did, like they're okay, but they're not, yeah, I mean, I'm not proud of them. So Zach says, love it if you go over your GME option purchase from today. I did not purchase any GME options today. I've had a GME position for a little while now. I got into. I'll tell you one. Well, it's loading. I'm looking at thinkorswim on the web base platform. Here we go. And then you can't search. Here we go. And then I'll just show you on the chart. I want like a three month something easier to see rid of all this stuff. All right. So we were",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 96,
      "start_timestamp": "00:48:46",
      "start_timestamp_seconds": 2926.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=2926"
    }
  },
  {
    "text": "loading. I'm looking at thinkorswim on the web base platform. Here we go. And then you can't search. Here we go. And then I'll just show you on the chart. I want like a three month something easier to see rid of all this stuff. All right. So we were in out. I'm just trying to see where I got into the latest. So it looks like we started scaling in right, right here and here. These two spots. So the 20th, the first, and then the second as well. That's when this latest position's been on. But I've told you guys before, Zach says my bad misunderstood video. Yeah. So the reason is is like when I'm doing stuff like this, I use an IRA account that has no money or no positions in it so that it's not messed up by all my positions. Because a lot of stuff that I have on, like it lights up like a Christmas tree and it gets really noisy and especially when you're clicking into things. So a lot of times when I'm making really any video, I use this, this account that I use for passing through money to other things. So that's why sometimes you'll see like the position thing there and sometimes not. So plus the other thing is I just don't like the idea of people trying to like follow what I'm doing. I think that's the, it's like the antithesis of what I stand for. My",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 96,
      "start_timestamp": "00:49:56",
      "start_timestamp_seconds": 2996.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=2996"
    }
  },
  {
    "text": "things. So that's why sometimes you'll see like the position thing there and sometimes not. So plus the other thing is I just don't like the idea of people trying to like follow what I'm doing. I think that's the, it's like the antithesis of what I stand for. My entire hope is to get people to a point where they're competent and comfortable enough to make their own trading decisions. So yeah, that's another at least consideration that I have when I think about it. So yeah, all good. All right, back up top to the next question. So yes, how do you fn I do a series. I shared that with you in the Excel document in the chat. You can grab that. Scott says why is slapping the ask considered more bullish or is it necessarily it's considered bullish because it just means that you're trying to get in in a pressing amount of time or you want to get in at size. So you're not even trying to play the mid. You're just immediately going in and you're playing the offer and you're scooping it up for whatever they'll give it to you for. So it's like the same thing if you're trying to liquidate a position and you go through and start submitting a bunch of market orders, that typically is fairly telling. The other thing is when you're analyzing options chains, whether we transact at the bitter offer is just informative in terms of",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 96,
      "start_timestamp": "00:51:27",
      "start_timestamp_seconds": 3087.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=3087"
    }
  },
  {
    "text": "like the same thing if you're trying to liquidate a position and you go through and start submitting a bunch of market orders, that typically is fairly telling. The other thing is when you're analyzing options chains, whether we transact at the bitter offer is just informative in terms of telling us where what what the disposition of a position is. Right. If you watch the GME video today, I use that exact tool because you can't tell like if I just go into this options chain and I look at the 24,519 calls here in GME at 25. Now because it's GME and I can make some inferences, I have some ideas is to whether or not these were bought or sold. But let's just pretend it's a different product, a different name. You can't tell if these 24,000 options were either bought to open or sold to open and if based on that difference, you want something different to happen. If you bought to open, you want them to go up. If you sold to open for the option specifically, you want it to go down. So using things like analyzing where options are transacting at helps us understand. So for example, these 239,000 calls that transacted today in GameStop, they happened at the bid or below. You can't buy at the bid. You can sell at the bid. So this tells me that 37 of the volume today were people selling calls, which doesn't surprise me. Because",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 96,
      "start_timestamp": "00:52:33",
      "start_timestamp_seconds": 3153.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=3153"
    }
  },
  {
    "text": "understand. So for example, these 239,000 calls that transacted today in GameStop, they happened at the bid or below. You can't buy at the bid. You can sell at the bid. So this tells me that 37 of the volume today were people selling calls, which doesn't surprise me. Because if we take a look at the volume where it was happening today, take a look at how much of it was in the five July expiration. These are people exiting options left and right to try and unwind their position because they're trying to salvage what value they can because it's the last day and most of them are going to expire worthless. So that's how you can kind of use that to understand what's happening with the transactions. All right, back up to the top. The chosen one, great name. What is the most important factors you should know before committing to a long options play like two, three months out? I have a video for you. And I actually made this video for specifically the GME folks, but it applies to anybody. It's just about buying call options smarter. I'm going to drop this in the chat for you, the chosen one. That video will walk you through the exact process. The reason why I'm giving you that video is because it's kind of a detailed answer. So there's not like an important factor in my opinion. It is, well, I guess, okay, well, not to be",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 96,
      "start_timestamp": "00:53:35",
      "start_timestamp_seconds": 3215.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=3215"
    }
  },
  {
    "text": "for you, the chosen one. That video will walk you through the exact process. The reason why I'm giving you that video is because it's kind of a detailed answer. So there's not like an important factor in my opinion. It is, well, I guess, okay, well, not to be annoying, but the important factor is whether or not you think the stock is going to go up. That is the important factor. But beyond that, there's a million, not a million, that's dramatic. There is quite a few other factors that matter, but they're not, no one of them matters the most necessarily. They have a lot of different weighing factors. Which if that's an example that you all want to go through, let me know. And we can, like we can go through an example of buying a call option. I'm completely down to do that. Ravish, is there good idea of how to manage risk if it goes against us? That's a great question. So there's nothing wrong inherently with selling naked puts. They have a place, but I think they need to be treated with respect. And I unfortunately think a lot of people on places like this on like Thadegan. I think these people just really, really miss out on a lot because they get too focused on selling options. And I think that there's benefits to selling things like short puts, but like this right here. This person is making a fatal, fatal attribution",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 96,
      "start_timestamp": "00:54:58",
      "start_timestamp_seconds": 3298.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=3298"
    }
  },
  {
    "text": "like this on like Thadegan. I think these people just really, really miss out on a lot because they get too focused on selling options. And I think that there's benefits to selling things like short puts, but like this right here. This person is making a fatal, fatal attribution error. And they're being supported because they posted it in a community that wants to bolster this thought process. This is not because they bought options. This is a complete attribution error. This is not because they bought options. This is not because they sold options. Might have been the strategies they were using. That's not what results in this. You can buy an option or sell an option. And if the correct profit mechanism isn't there, you lose money. So in this example on the selling options. If they're selling puts in this scenario, they could buy calls and do this or better if they're buying calls smartly. Same thing on this side. If they're buying calls and it's not working, selling puts wouldn't magically fix this. So this is an attribution error. It's not as simple as this. So when I think about the process of selling naked short puts, it's completely okay. But you have to have a broader thing that that's aligned to. The process of just selling short puts doesn't, it doesn't matter, right? You need the profit mechanism first. So the way that I think about this exact process is I have a video",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 96,
      "start_timestamp": "00:56:06",
      "start_timestamp_seconds": 3366.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=3366"
    }
  },
  {
    "text": "short puts, it's completely okay. But you have to have a broader thing that that's aligned to. The process of just selling short puts doesn't, it doesn't matter, right? You need the profit mechanism first. So the way that I think about this exact process is I have a video on how to create profitable strategies. And I'll share that in here with you guys. The reason why I think this video matters is because it goes through this exact process in depth. We have to start with a completely different question, which is what is the profit mechanism we're trying to action on? And then what is the supporting structure slash strategy that makes sense? So for example, who asks this question? Let me find your name again. The chose is it's the chosen, no, I like ravish. ravish you still in here? ravish did you leave me? We have to we have to might check ravish see if ravish is here. So we can finish this example with him or her. I can't tell what the name ravish. It could be either or ravish. If you bailed on me and I've been talking about your question, I'm going to be so sad and disappointed. Still a good question though. So I'm really not that mad or disappointed. It's a good conversation. Okay, we're going to need a we're going to need a ravish stand in. So whoever wants to be the surrogate ravish. If you wanted to sell",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 96,
      "start_timestamp": "00:57:28",
      "start_timestamp_seconds": 3448.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=3448"
    }
  },
  {
    "text": "to be so sad and disappointed. Still a good question though. So I'm really not that mad or disappointed. It's a good conversation. Okay, we're going to need a we're going to need a ravish stand in. So whoever wants to be the surrogate ravish. If you wanted to sell a put can you guys pick a ticker that we might want to sell a put in? And then I'll walk you through kind of a little bit of this process. And in the meantime, I'm going to open my door real quick. I. Roaring Titty says M I'll go with M that's slightly different than the rest of these ones. Take a look at M some macy's. So let's say you want to sell a put in macy's and let's use on demand. We'll go back in time and work through an example. Kind of find a point that would like look good. Here we go. Let's go back to 15 November of what is this a year ago? Yeah, okay. So go back to 15 November 23. And we will look at Tampa. Tampa, I don't know, it's up to you guys. Tampa is really set on looking at Syria and they want a real world which I mean, kind of they just want some help placing a trade which is okay. I don't mind that. But the real world example actually wouldn't work well for this at all. So you won't get your ask on this one.",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 96,
      "start_timestamp": "00:58:37",
      "start_timestamp_seconds": 3517.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=3517"
    }
  },
  {
    "text": "at Syria and they want a real world which I mean, kind of they just want some help placing a trade which is okay. I don't mind that. But the real world example actually wouldn't work well for this at all. So you won't get your ask on this one. However, we can take a look at it if the rest of the chat supports you. If they don't support you, then you're on your own. We could look at it Monday like I said before. But if everybody else here, if the other 61 people that are here right now, want to take a look at it, then I'm down. Okay, now let's take a look at this example though. On the difference between selling calls or puts because I think I do think that this is a good example. And since ravish left us, I am down and I need to make a series of assumptions for them. So let's say that we want to sell naked puts in here because we think that this thing is going to go up and let's say that we apply. Arjun says go tasty works route, do the theta decay selling 45, close to 21 days. Yeah, that's that's okay. We can simulate something like that here. So let's say we sell a put. So let's say in this case, we have this option that goes out and then I'll buy an option that I typically would something like this. And",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 96,
      "start_timestamp": "01:00:23",
      "start_timestamp_seconds": 3623.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=3623"
    }
  },
  {
    "text": "45, close to 21 days. Yeah, that's that's okay. We can simulate something like that here. So let's say we sell a put. So let's say in this case, we have this option that goes out and then I'll buy an option that I typically would something like this. And if I want it to go up, I'm going to go somewhere like here. Damn, I forgot you can't do them both separately. So we have to do this, analyze. And then we have to do this. And analyze. Okay. Perfect. Now the analyze tab in this doesn't work. I really just want us to look at the prices. That's why I have this. It's a place for me to keep both the prices while I move the time forward. So now let's fast forward what two weeks. We'll give it two weeks. We had a bit of a pop. So we got in somewhere right around here. I actually already forgot where we entered exactly. But it went up that we know. So if we go to the analyze tab and we see where we originally transacted in these. Right. So we have 310 and then 64 cents. So our 29 December. This strike is now it's the 10. Or let's look at the puts first. 29 December 11 and a half put. So let for 64 cents. Now it's worth 5 cents. So in this case. What I'm looking at is this option. We got a accommodating move",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 96,
      "start_timestamp": "01:01:23",
      "start_timestamp_seconds": 3683.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=3683"
    }
  },
  {
    "text": "our 29 December. This strike is now it's the 10. Or let's look at the puts first. 29 December 11 and a half put. So let for 64 cents. Now it's worth 5 cents. So in this case. What I'm looking at is this option. We got a accommodating move in our favor. And on this 11 and a half put, we collected 64 cents, which is 64 in its entirety to start. And now we can buy them back two weeks later for a nickel. So in this case, that means that we essentially would have made like 59. Something like that. Now let's look at the long calls. We had the 16 Feb 24, which is out here. And we had the 10 calls that we got for 310. So the 10 calls for 310. These are now trading for 582 and a half. So we made 270 bucks on this trade. Same move, same product, same timeframe. This is the difference between selling puts and buying calls if you get a move in your favor. This is the trade off between defined versus undefined profit. Because here's the other scenario. If we have something like this, this timeframe in here, and we do that same trade, the same comparison of those trades. The short put would make money. The long call would not make money. And it's because it didn't go down to hurt you, but it also didn't go up to help you. The short put",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 96,
      "start_timestamp": "01:02:43",
      "start_timestamp_seconds": 3763.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=3763"
    }
  },
  {
    "text": "timeframe in here, and we do that same trade, the same comparison of those trades. The short put would make money. The long call would not make money. And it's because it didn't go down to hurt you, but it also didn't go up to help you. The short put is okay with that. The short put doesn't care if it doesn't go up. It just doesn't want it to go down. So all the way back to the original question, is there anything wrong with selling puts? Absolutely not. I think that there needs to be a clear plan in place, like if I'm trading something directionally, I'm not going to sell puts typically. And it's because I don't want to cap my profit. However, I much prefer to sell puts as part of trying to trade putsk you, trying to trade volatility versus with variance versus premium, trying to play earnings collapses, stuff like that. So there's nothing wrong at all with short puts. I like them, but they have to be bucketed at least in my opinion logically. So yeah, that's the way I think about that one personally. Rudebegg is says theta people often say that selling is safer. Maybe not naked. I mean, less risky. It's not. It's a completely misguided concept. And it's because they focus too much on win rate. And they don't focus on expected returns. So the reason why a lot of them would argue that it's safer is because they",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 96,
      "start_timestamp": "01:04:10",
      "start_timestamp_seconds": 3850.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=3850"
    }
  },
  {
    "text": "selling is safer. Maybe not naked. I mean, less risky. It's not. It's a completely misguided concept. And it's because they focus too much on win rate. And they don't focus on expected returns. So the reason why a lot of them would argue that it's safer is because they win more frequently. But that's not a great thing to rest on if you're a trader. It doesn't matter necessarily how often you're correct. That's only part of a very important question, which is that of expected return. So yeah, good question, but not correct. Like not a correct way to focus that I should say. I back up to the top. Let's see what we got. Budget Spinner says could you cover GameStop price action in the last two days and show how we're market makers hedge and how it moves the price? I mean, there's not much movement here to show you. I would be down, but there's just not. It's been flat the last two days. Like I don't actually think the market makers are doing much, much hedging at all. Look how light the volume is. The volume is like anemic at this point. Down to 13 mil. When it's more active, it's like 35 plus. So I don't actually think that this is a great example right now of price action or where a hedge, or market makers might be hedging to be honest. It just looks kind of flat. I think. Big A says",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 96,
      "start_timestamp": "01:05:21",
      "start_timestamp_seconds": 3921.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=3921"
    }
  },
  {
    "text": "13 mil. When it's more active, it's like 35 plus. So I don't actually think that this is a great example right now of price action or where a hedge, or market makers might be hedging to be honest. It just looks kind of flat. I think. Big A says bro script. Oh, dude, where was your question? Sorry. Wait, I didn't get to it yet. I didn't get to your question yet. I'm still catching up on the other questions. But I didn't skip your question at all. I just not there yet. I'm like way up here. Okay. Anthony says, I like the way you break things down. Some of these things are quite complex. Theta and time to have correlation. Yep, exactly. James says you have mentioned ratio spreads. Can you walk through what you look at when choosing a position? Sure. So I primarily trade in the context that you're referring to there. I do trade other kinds of ratio spreads for volatility. But that's less the context of what I would have been talking about that you would be referring to. Well, you would be referring to are things like ratio-called diagonals, which is one I have on right now in T-Triple Cuse. And the premise of the ratio-called diagonal is designed to be a leveraged bullish upside play. So this position, this is one that I've been working with for, oh, wait, no, I'm straight up lying. I'm sorry. This is a covered strangle.",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 96,
      "start_timestamp": "01:06:46",
      "start_timestamp_seconds": 4006.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=4006"
    }
  },
  {
    "text": "I have on right now in T-Triple Cuse. And the premise of the ratio-called diagonal is designed to be a leveraged bullish upside play. So this position, this is one that I've been working with for, oh, wait, no, I'm straight up lying. I'm sorry. This is a covered strangle. I'm an idiot. I'm a complete idiot. That is not that is not that at all. What do I have? I guess XSP is a good example of a ratio-called diagonal. Sorry, guys. So XSP is same kind of style idea, though. This is, I have a ratio-called diagonal on in here. So right now the position and I'll build it for you. Is I gotta open this? Okay. So the longs are in 27. Here. And we have the 535s. I'm gonna condense this down. The 535s. And then we got into these for 25. And I always do these at a ratio. So I'll use a smaller ratio to start for the sake of the example. So we'll do like 15. And then I am short. The nine, I just rolled these today. This is also a good example of defending a position. Because these were in the money. These were in the money short calls that I rolled out. So a slightly different scenario, but I can show you the position as I have it now. Which is this, the 557s. Call it six of those. And then these went out for three. Wait, I'm messing something",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 96,
      "start_timestamp": "01:08:08",
      "start_timestamp_seconds": 4088.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=4088"
    }
  },
  {
    "text": "money. These were in the money short calls that I rolled out. So a slightly different scenario, but I can show you the position as I have it now. Which is this, the 557s. Call it six of those. And then these went out for three. Wait, I'm messing something up here. 557s. Yeah, I was gonna say that's not right. These ones. And then these went out for 365. So this is a ratio called the Agile. It's a leveraged bullish play. That's what I'm showing you. So here's kind of a breakdown of what you're looking at. You can see the equivalence of the position. Let's say there's no underlying for XSP. It's an index, but you can essentially use spy as a surrogate. So let's say you could buy shares of XSP. 15 lot gives you control over 1500 shares. And right now, well, you could do Delta adjusted, but to not bother with that. The total position that it would take up to is 802,500. The cost to put this position on is just the 25.7 times 1500. So it's 38,550. So it is a leveraged play to the upside. I'm trying to trade this directionally. Tampa Bay. I don't want to time you out, bro. I'm trying to help the people learn about options. I know that you're stoked on CERARITY. It's all your bro. I'll look at it. But that's not the purpose of the session today. We can look at it Monday. Exhibit",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 96,
      "start_timestamp": "01:09:53",
      "start_timestamp_seconds": 4193.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=4193"
    }
  },
  {
    "text": "Tampa Bay. I don't want to time you out, bro. I'm trying to help the people learn about options. I know that you're stoked on CERARITY. It's all your bro. I'll look at it. But that's not the purpose of the session today. We can look at it Monday. Exhibit patients. Back to this, though, on the question about the ratio diagonals. So why do I do it at a ratio? It's very specific. So if we look at an alternate universe where I do a one for one, in this case, it's a little nuanced because I was really careful with the Delta selection. Yada, yada, yada. So this doesn't have upside risk. But in a lot of standard diagonals, so let's just go in here. And actually, I think this has like a diagonal thing, right? I think you could do like diagonal by. I never use these combined orders. Yeah, there you go. Better diagonal. Great. So this is like a standard diagonal. Notice what that looks like. It is completely, completely different, completely different than what you see in the ratio called diagonal. So what happens with the standard diagonal is it's more of a play on volatility. You actually don't want things to move a whole lot based on wherever you choose your strike. And you have both upside and downside risk. So the way that I'm trading diagonals. Is to give me leveraged upside potential that is uncapped. Right. So notice how this almost",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 96,
      "start_timestamp": "01:11:33",
      "start_timestamp_seconds": 4293.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=4293"
    }
  },
  {
    "text": "on volatility. You actually don't want things to move a whole lot based on wherever you choose your strike. And you have both upside and downside risk. So the way that I'm trading diagonals. Is to give me leveraged upside potential that is uncapped. Right. So notice how this almost looks like long stock. Not quite, but almost. It's uncapped upside profit potential. I collect a bit of a credit with some short options against it. But this is the exact premise of the strategy. It is a leveraged directional play. And I actually have an entire playlist on the ratio diagonal strategies. I have a video coming out soon, specifically on ratio put diagonal strategies. Because people ask for a little more detail on those, which you know I'm a man of the people. So that video will be out in the not so distant future. But that's the concept of diagonals. Obviously, I'm happy to dive further into detail as always. Just let me know if you have any specific questions. All right. Back up. Back up here. Okay. We're making good a headway. This is great. Jawab says appreciate the streams. How much positive negative effects do weekends have on the Greeks? They have no negative effects. Remember, the Greeks simply are ways to view impacts of options due to different factors. So depending on what Greek you're referring to specifically, we'll have different impacts based on the weekend. One of the most commonly interest one people",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 96,
      "start_timestamp": "01:12:56",
      "start_timestamp_seconds": 4376.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=4376"
    }
  },
  {
    "text": "weekends have on the Greeks? They have no negative effects. Remember, the Greeks simply are ways to view impacts of options due to different factors. So depending on what Greek you're referring to specifically, we'll have different impacts based on the weekend. One of the most commonly interest one people are interested in is they did a K. And markets are smart. Markets will adjust the pricing of options, leading into a weekend so that a lot of the theta decay associated with the weekend actually comes out before the weekend. There's still theta decay over the weekend, but it is not a pure expression. So the weekends will impact things differently because things can move on the weekends, but it's generally a muted impact because unless there's something big that happens, the weekends tend to be pretty quiet. All right, back up here. Fan of Airplane says, I've been selling my options way too early recently. What should I be looking at to maximize gains? Great question. Now, I'm assuming fan of airplanes. One, I assume that you are a fan of airplanes. Let me know if that's a safe assumption. Two, second question is, or I guess the second input to that, is I would focus first on the profit mechanism. So this is a great example in like TeachableQs. In TeachableQs, I have long shares. You can essentially replace long shares with long calls, right? Long options. Same thing. And in this scenario, I've talked to a",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 96,
      "start_timestamp": "01:14:22",
      "start_timestamp_seconds": 4462.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=4462"
    }
  },
  {
    "text": "second input to that, is I would focus first on the profit mechanism. So this is a great example in like TeachableQs. In TeachableQs, I have long shares. You can essentially replace long shares with long calls, right? Long options. Same thing. And in this scenario, I've talked to a litany of people that thought that it was overextended here, that it was overextended here, that it was overextended here, that it was overextended here. In this case, they were kind of right. That it was overextended here, here and here. What I'm highlighting is that it is so important as a trader to trade what the market is doing, not necessarily what you think it's going to do. Now, it's a delicate dance, as you could imagine, because it's like a chicken and the egg problem. But what I'm highlighting is that I do my best to stay sensitive, to current market environments. So what that means is notice how I have these different stops in place. Well, these are just alerts. But what I do is I set triggers. And I essentially say, okay, it's still going in the direction that I want. I don't want to take the trade off because it's doing what I want. But I also don't want to give up a bunch of money that I've made. So what I'll do is I'll set different thresholds. So then I will start to exit as it stops doing what I want, regardless of what",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 96,
      "start_timestamp": "01:15:54",
      "start_timestamp_seconds": 4554.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=4554"
    }
  },
  {
    "text": "the trade off because it's doing what I want. But I also don't want to give up a bunch of money that I've made. So what I'll do is I'll set different thresholds. So then I will start to exit as it stops doing what I want, regardless of what I think it should do. Do I think that this thing has made a massive move in a relatively short period of time? Abs of freaking Lutley. Look at this. It started the year down here at 48. It's up at 81 and we're halfway through the year. That's a crazy move. Does that mean it can't go higher? No, it can go higher. It has been going higher. Does that mean that it's going to go up forever and never come down? Also, no, I know it's going to come down at some point. That's absolutely going to happen. So it's about balancing those two scenarios. There's a lot of things you can do. You can start phasing out of a position. You can set stop losses. You can set trailing stop orders. You can set alerts like I do so that you're not flashing your order to the market because you are a little over conservative in terms of what you show the market. And then exit a trade that way or phase out of it that way. This completely, completely up to you. But what I think is you should not trade inherently on what you think",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 96,
      "start_timestamp": "01:17:05",
      "start_timestamp_seconds": 4625.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=4625"
    }
  },
  {
    "text": "market because you are a little over conservative in terms of what you show the market. And then exit a trade that way or phase out of it that way. This completely, completely up to you. But what I think is you should not trade inherently on what you think some things value should be and you should be far more open to what the market says the value is. Because people thought this was too high. Guess what? They missed a ride from 66 on the 28th of May to 81 85 the 5th of July. It's a massive move in not a lot of time. Now, again, not all that glitters is gold. This will be brutal. This can be brutal to the downside. Look at this. It went from 91 down to 16. And this was from the course of 22 November of 21. To what? 2023 essentially like right at the start end of 2022. So again, if you're not being market sensitive and you think, well, it should go up. It's gone down so much and you thought that here and you thought that here. And you thought that here and you thought that here and you thought that here. Sooner or later, it was right and it stopped going down. But guess what? You just lit your money on fire taking a ride from 91 down to 16. So the short answer to your question in my opinion is literally stay open to what",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 96,
      "start_timestamp": "01:18:11",
      "start_timestamp_seconds": 4691.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=4691"
    }
  },
  {
    "text": "and you thought that here. Sooner or later, it was right and it stopped going down. But guess what? You just lit your money on fire taking a ride from 91 down to 16. So the short answer to your question in my opinion is literally stay open to what the market is doing and follow along. That's it. All right, back up here. Joseph says when you roll over an option, are you basically just repurchasing it? What are the benefits, pros and cons? Great question. I have a video on this exact thing that I will drop for you. The short answer, Cliff Notes version of that video, is when you are rolling an option, you are simply closing a position and opening anyone. That's all. This is a video about a bunch of myths that I see related to it. And then the second video is a like a much more in depth, the analysis of rolling options. And then there is another video I have coming out actually this month on just like a general guide to rolling options, so different considerations to make and stuff like that. So in the simplest forms, rolling an option is simply closing a trade and opening a new one. That's literally it. People, they again, they tie so much ego to it, not wanting to have a losing trade. So they focus a lot on the potential to make the money back and all that kind of stuff. And",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 96,
      "start_timestamp": "01:19:29",
      "start_timestamp_seconds": 4769.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=4769"
    }
  },
  {
    "text": "is simply closing a trade and opening a new one. That's literally it. People, they again, they tie so much ego to it, not wanting to have a losing trade. So they focus a lot on the potential to make the money back and all that kind of stuff. And it is a giant, giant mistake. Tampa says, hey, Eric, they're already attacking you. I don't know who's attacking me. It seems pretty mellow here, but it wouldn't surprise me. We stay under attack. I don't know. My dog doesn't seem concerned. Back up to the top. Tampa says, explain to folks that if they buy a call option and want to exercise for shares and don't have the actual cash, you can have your broker do a cashless exercise without running capital. You can only do that though if your option is showing enough profit. So yeah, the scenario that Buck is referring to is if you buy an option, call specifically. And it shows enough of a profit to cover the cost of taking assignment, which your portfolio would already show that in terms of the net lick that you could take the position, then you can do a cashless exercise. You even need to do a cashless exercise at that point though. You can exercise the option and it will inherently be cashless. But what he's referring to is that if the profit on your options is large enough to cover the cost of it, then you",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 96,
      "start_timestamp": "01:20:49",
      "start_timestamp_seconds": 4849.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=4849"
    }
  },
  {
    "text": "a cashless exercise. You even need to do a cashless exercise at that point though. You can exercise the option and it will inherently be cashless. But what he's referring to is that if the profit on your options is large enough to cover the cost of it, then you are then you're able to exercise the option without putting up more cash as all. Captain Chris says you got Eric Check in his windows. Yo, I'm just saying I literally have cameras all around my house and I'm getting ready to put on my kit and start looking around the house. I back up to the top. I think we're catching up here. Timmy Papparoni, that name is so funny. I bought a few days ago. I bought some out of the money calls that expire the 19th, sold one up 20 then to up 40. I don't really have an extra strategy for this one now in the money. I didn't really think I'd get this far. Yeah. So then I actually I think we covered a lot of that already. So Tony Papparoni, if you have any follow on questions, let me know. But yeah, I think we can always say we hit most of that. All right. The big ace, the question that I was accused of skipping, which I would never, would you ever be able to exercise enough options for the gamma of buying shares to cause an offset of the loss of action",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 96,
      "start_timestamp": "01:22:04",
      "start_timestamp_seconds": 4924.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=4924"
    }
  },
  {
    "text": "we can always say we hit most of that. All right. The big ace, the question that I was accused of skipping, which I would never, would you ever be able to exercise enough options for the gamma of buying shares to cause an offset of the loss of action as a value? They're kind of different things. Yeah. I see your point. The probability of that happening, though, is very, very low. So yeah, it's an interesting idea, but it's unlikely. A Tampa Bay says, what is your version of one shot one kill on options flow gamma vague along calls? I don't follow your question there. When when looking at options flow for me, it's like it's very, very much a position that's built. It's stuff that you kind of build little pieces of the puzzle. It's like filling in a puzzle, I guess, is the the best way I could describe it. There's not really like a one, a one set thing. Agents says his position might have tested that 120k near-term options. Yeah, that's a great question. And it could have caused a movement, but the problem is is that the very movement, it would cause would be very, very difficult to purely isolate to the exercise of those options themselves because here's the other thing. If it's anything other than GameStop, typically, as you have options that are in the money getting closer to expiration, the market makers hedging their position. So if you think",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 96,
      "start_timestamp": "01:23:13",
      "start_timestamp_seconds": 4993.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=4993"
    }
  },
  {
    "text": "would be very, very difficult to purely isolate to the exercise of those options themselves because here's the other thing. If it's anything other than GameStop, typically, as you have options that are in the money getting closer to expiration, the market makers hedging their position. So if you think about something like this, and let's say that you bought options that were 30 delta right here. And at the 85s, the 129, let's say you got them for 129. And they're 32 delta. Let's say then you get a big move in your favor. And now your options look more like these in here that are like 88 delta's. The market maker is hedging their position as this is going in the money. They're not just watching it, hoping that it's going to go back out. They're going to have shares, especially as he gets close to expiration to cover this if it's in the money. Now, it gets a little bit muddied when we look at the profit incentives for market makers and the way that they think about it. Tampa says this dude is hedging his way not yours. I don't follow. This is like just standard market making hedging. Yeah, this isn't how I would hedge. I'm not taking the other side of these positions. But for a market maker, their primary profit modality is the bit ask spread. Their goal is to isolate that. So I don't know if your point there, Tampa is the",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 96,
      "start_timestamp": "01:24:41",
      "start_timestamp_seconds": 5081.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=5081"
    }
  },
  {
    "text": "market making hedging. Yeah, this isn't how I would hedge. I'm not taking the other side of these positions. But for a market maker, their primary profit modality is the bit ask spread. Their goal is to isolate that. So I don't know if your point there, Tampa is the scenarios where you can have market makers that are bending the rules. And that does happen with GME, which is what makes GME special to be very clear is what I'm talking about is general approach. The reason I'm sticking with general approach is compared to talking about anomalies or anomalies in the markets is because you're a bull BSC bow. Well, I want whatever you've had to be honest. You remind me of Howard Terrence from that Joe Rogan episode with Eric Weinstein. It's hilarious. But with stuff like GameStop, a lot of times if you have a really greedy market maker, which greedy market makers don't stay in business for too long. And looking at their behavior, sometimes they will purposefully under hedge with the hope of being able to squeak out more profit. But funny enough, and I actually talked to dudes in the discord about this, when I was having this conversation. And during the conversation, I reached out to a guy that I had on the podcast that runs a multi-billion dollar ETF and ETF business. He connected me with one of his friends that works on one of the options markets part of his",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 96,
      "start_timestamp": "01:26:12",
      "start_timestamp_seconds": 5172.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=5172"
    }
  },
  {
    "text": "when I was having this conversation. And during the conversation, I reached out to a guy that I had on the podcast that runs a multi-billion dollar ETF and ETF business. He connected me with one of his friends that works on one of the options markets part of his book that is ex-institutional side that turned kind of into his own business. And he worked at Susquejana. He went through their whole program. And for them, I asked them about Roe and Kitty's specifically. And when I looked at the position I asked them, I was like, what would happen here? What would you do? And he was saying that for that option position specifically, the 120,000 long calls, he said that he would be hedged. He would be fully hedged. The other thing he said is that if he thought that it was an informed trader, which we know market makers can do this, they can piggyback off the order flow. They know that there's going to be a bunch of order flow coming in. So they literally can move with the order flow to make some money via surrounding long calls. So there's a lot of different games that they can play. But yeah, I think that this is an interesting example for an anomaly. But this is not how market makers typically will make markets, especially if they want to stay in business. I backup, backup to the top. A little more, a little more. A",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 96,
      "start_timestamp": "01:27:33",
      "start_timestamp_seconds": 5253.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=5253"
    }
  },
  {
    "text": "games that they can play. But yeah, I think that this is an interesting example for an anomaly. But this is not how market makers typically will make markets, especially if they want to stay in business. I backup, backup to the top. A little more, a little more. A little more. Okay, here we go. Zach says, I'd in the money call options, if I closed out, it would be at a loss. His premium paid was six, 10. And as of today was 475, generally speaking, better off rolling them, preference is not to exercise. I would just reestablish the position. So if I was in that scenario, there's no reason to necessarily roll them at all. Like if you still like whatever you have to the upside, but you want to take them down and reestablish your deltas or whatever, I would literally just take the position down and change it. Move it to the position that you want. That's all. Alfonso says during the GME friends, I bought some puts, which actually increased in value, even though the underlying share price was increasing rapidly, the IV was insanely high, not complaining. Yeah, that's awesome. And that's that's exactly right. You're attributing it to the to the precise thing. That's good. Joseph says, I bought one leap for GPS at 28. The reason why I got because there was high volume of calls for it, am I right? What would be considered high volume or unusual volume?",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 96,
      "start_timestamp": "01:28:46",
      "start_timestamp_seconds": 5326.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=5326"
    }
  },
  {
    "text": "that's exactly right. You're attributing it to the to the precise thing. That's good. Joseph says, I bought one leap for GPS at 28. The reason why I got because there was high volume of calls for it, am I right? What would be considered high volume or unusual volume? That's a great question. So for Joseph Pa, where was that question? I want to be able to refer to it. Here we go. Okay. So Joseph Pa, let's take a look at this. Joseph, what was the expiration? And we literally can build a trade real quick to take a look at it together. All right. All right. I just love seeing very titties name pop up. It makes me so happy. Okay. 19 July. Let's take a look at some GPUs. And let's go to 19 July. Wait, did I miss up? 19 July. Oh, so these are short dated. Whatever reason I thought that these were going to be longer dated. I don't know why. And the 28 strike. I hate that position. I think it's a terrible position personally. I think it's a terrible position for a bunch of different reasons, but that's not your question. Your question is more about like anomalous flow and stuff like that. And what this doesn't look, am I looking at the right thing? This looks dead. There's literally 2000 OI. It looks like nothing's happening here. Do you mean like volume in the underlying? Is that what you meant?",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 96,
      "start_timestamp": "01:30:15",
      "start_timestamp_seconds": 5415.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=5415"
    }
  },
  {
    "text": "Your question is more about like anomalous flow and stuff like that. And what this doesn't look, am I looking at the right thing? This looks dead. There's literally 2000 OI. It looks like nothing's happening here. Do you mean like volume in the underlying? Is that what you meant? Even that looks dead. What Joseph, what were you looking at that felt like anomalous to you? It does have bigger call volume. That's for sure. But it's out in 16 August. And it's the 23s. Joseph says I thought that was a lot. Okay. Got it. Yeah. No, it's definitely not. This is this. This to me is dead. There's really not much going on here. This is slightly big, like in terms of the discrepancy between these two, but 8000 options trading is like like an individual can do that. It's such small fries that it doesn't matter really. The total open interest here is like 129K. So this overall is tiny. Yeah, not much. Shout out to Roy Titty. That's probably my favorite comment. One, thank you again very much. You have no idea. I really, really appreciate the generosity. It means a lot. Thank you. But to the fact that that just puts Roy Titty's name on blast because it's hilarious. That is good as it could possibly get. So yeah. Anyways, when I look at this, there's really not much that I see going on. All right. Back up here. All right. Being gaming might",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 96,
      "start_timestamp": "01:31:52",
      "start_timestamp_seconds": 5512.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=5512"
    }
  },
  {
    "text": "to the fact that that just puts Roy Titty's name on blast because it's hilarious. That is good as it could possibly get. So yeah. Anyways, when I look at this, there's really not much that I see going on. All right. Back up here. All right. Being gaming might be a stupid question. We love those. Man, we're always here for some questions. How does Theta Decay work for longer length calls versus short term? Yeah. It's a great question. So the we actually talked a little bit about that earlier. So I don't want to double tap too much. And I also go through this heavily in that video that I posted on buying calls smarter. But the Clifnotes version is Theta Decay is highest for at the money options and as you get closer to expiration. So Theta Decay will expand as you get closer in. Now there's a little bit of relativity that needs to come into play because you can have options that are further out in time with a moderate size Theta. And then you can compare that to something that zero DTE. And you can say, well, wait a minute. The Theta here is zero. But you said it gets higher as it gets in. Well, the problem is, is these have no more extrinsic value to come out. It's gone. So what ends up happening is as a percentage of the remaining premium Theta will be very high as you come in.",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 96,
      "start_timestamp": "01:33:11",
      "start_timestamp_seconds": 5591.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=5591"
    }
  },
  {
    "text": "is zero. But you said it gets higher as it gets in. Well, the problem is, is these have no more extrinsic value to come out. It's gone. So what ends up happening is as a percentage of the remaining premium Theta will be very high as you come in. But again, like you can look at this and you could say, well, wait a minute. This 17 delta, it only has two Theta. Well, it's because there's just not much extrinsic value left to come out of those. Whereas if we look at, you know, again, a 17 delta in here, which might still be about a two Theta as a percentage of the remaining premium is much smaller. So yeah, your instinct is correct. It is the punchline. Nice job. Paul says, here's a trait of thought of placing when Tesla is around 180 short strangle 152 45 nine aug. It would be a precarious position today. How would you go about adjusting it? That's a great question. So first, let's take a look at Tesla and see what see what the dealio is. Yeah. Okay. And when did you think of this? Earlier this week. What do you mean like the first? Because honestly, like to me, I think your eyeball is way off. If anything, literally anything from here, we thought about like placing a short strangle. I think that that's nuts. This would be what we would call a terrible, terrible trait. But anyways, in",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 96,
      "start_timestamp": "01:34:36",
      "start_timestamp_seconds": 5676.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=5676"
    }
  },
  {
    "text": "you mean like the first? Because honestly, like to me, I think your eyeball is way off. If anything, literally anything from here, we thought about like placing a short strangle. I think that that's nuts. This would be what we would call a terrible, terrible trait. But anyways, in this case, like to succinctly answer this question, I would close the position for a loss. Like you would just be getting murdered. So yeah, this is not what I would trade at all. I have I had a position on in Tesla that I took off too early because I'm a paper handed pansy. I hate myself. But I ended up catching a really nice move in here, but I was trading it to the upside. So this is not something I would trade a short strangle. If I were to trade a short strangle, the hypothesis would be typically imply volatility trending over realize volatility, which is literally not what has happened since the first at all. If it got blown out, I would have predetermined P and L. P and L targets. So the way I would look at it as let's say that I put the trade on the first because I'm crazy. Apparently, I would figure out what loss I'm comfortable taking on the position. So let's see if we can do on demand. If it lets us go this close. I don't know. I think typically it lags by like a full week, but",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 96,
      "start_timestamp": "01:35:41",
      "start_timestamp_seconds": 5741.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=5741"
    }
  },
  {
    "text": "trade on the first because I'm crazy. Apparently, I would figure out what loss I'm comfortable taking on the position. So let's see if we can do on demand. If it lets us go this close. I don't know. I think typically it lags by like a full week, but let's see. It does. Damn it. Wait, what's today? The fifth. No, it does. We can go here. It's a great. And so let's say that I wanted to model shorting a strangle. And let's say what were you looking at? I have to go back up. Where is it? Where is it? Where is it? Damn it. I lost the question. Here it is. Nineog. So you would have gone out to the nineog. Okay. So the first piece of input I would give you is I wouldn't go to nineog. The reason being is it's a weeklies. Unless there's a very specific reason for me to go into the weeklies, I'm just going to go to the next to the nearest primary expiration. There's nothing wrong with the weeklies. But the problem with the weeklies, let's look at this. The 150 and then 245. If I go to the 150, they're 20 cents wide here. And that is a four delta, which I also hate very, very low delta. Well, let's look at a four delta here. These are a penny wide. Right? So this is the very first thing is when you're trading in stuff like this,",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 96,
      "start_timestamp": "01:36:56",
      "start_timestamp_seconds": 5816.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=5816"
    }
  },
  {
    "text": "the 150, they're 20 cents wide here. And that is a four delta, which I also hate very, very low delta. Well, let's look at a four delta here. These are a penny wide. Right? So this is the very first thing is when you're trading in stuff like this, you are giving up so much, so much, because it's very low volume. It's not that liquid in here. So that's the first thing I would change. I would go to at least the 16-og. The second thing is five delta is way too low in my opinion, because you're not collecting enough for the risk that you're taking. You're essentially selling tail risk, which is a tough way to make business. You'll make money most of the time, but when you get caught, it will be murderous and it will happen every so often, which funny enough, it's happening here. I won't be able to fast forward through the week, because it's just done and they don't have it in here yet. But to play the scenario out, we have the 245s, which you're a madman. I just realized what's going on here. You're crazy. So you did a 30 delta on this side and a five delta. Did I miss read? No, you said the 150s. You did a four delta. You're a madman. I would love to go to Vegas with you, because I can only imagine the bets you'd be placing out there. It would be",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 96,
      "start_timestamp": "01:38:12",
      "start_timestamp_seconds": 5892.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=5892"
    }
  },
  {
    "text": "30 delta on this side and a five delta. Did I miss read? No, you said the 150s. You did a four delta. You're a madman. I would love to go to Vegas with you, because I can only imagine the bets you'd be placing out there. It would be something, something magical. But in this case, I would model this trade. I would say I stand to make 800 bucks. Here's my risk profile. When does this start to lose too much money relative to what I can make? If I go all the way out to the break evens of the trade, I run a specific risk. And the reason why I run a risk here is because even though this position would be fully profitable here, I technically would potentially lose just 3. If I don't hold to expiration, the unrealized PL, if it moved there in the near term would be almost 1,600, 1,700. Roy Titty says Tampa needs to be kicked out of here. I really try not to do that. I don't like to do that. You run a risk because people think you are FOS. That's okay. Yeah, that's okay. I think Buck guy is fine. I would just leave them alone. Let them do their thing. There's no problem. I try to be open for people being here. I don't like censoring people and I don't like pushing people away unless they're like egregiously obnoxious or disrespectful. But I think we're getting",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 96,
      "start_timestamp": "01:39:17",
      "start_timestamp_seconds": 5957.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=5957"
    }
  },
  {
    "text": "guy is fine. I would just leave them alone. Let them do their thing. There's no problem. I try to be open for people being here. I don't like censoring people and I don't like pushing people away unless they're like egregiously obnoxious or disrespectful. But I think we're getting close, but we're not there yet. So I would avoid, look to avoid it. See if we can get through the next 10 minutes amicably. That would be my hope here. But back over to this, I would say maybe here. Let's say that I stand to make 800 bucks. And I'm okay if I lose 1,600, whatever that is. So in this case, that would take me to like 253, and then down here, it would take me much lower. Actually, I forgot because the Delta is so skewed. Okay. Sorry, Buck. That's no bono. So we're going to kill that. And then we're going to do that. So unfortunately, because I forgot, I don't even know who we tried to insult, but I don't deal with that. So sorry, brother, we're not playing that game. Chase says Tampa is special emphasis on the special. Yeah, you never know what somebody's going through, right? So like I said, I really try to give everybody the benefit of the doubt. I don't even I've literally already forgot who they were trying to insult, but like I don't do that. Oh, it was roaring. Titty. I can see the deleted message.",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 96,
      "start_timestamp": "01:40:43",
      "start_timestamp_seconds": 6043.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=6043"
    }
  },
  {
    "text": "what somebody's going through, right? So like I said, I really try to give everybody the benefit of the doubt. I don't even I've literally already forgot who they were trying to insult, but like I don't do that. Oh, it was roaring. Titty. I can see the deleted message. I don't know if you guys can, but I can. I have to like click a little button. And I just realized that it was roaring to like the one person I'm not going to play that came. That's hilarious. Yeah, in a way, that's the Louis go. That's hilarious. So yeah, back to this, what I would do in this case is just set a range. It would be something like this. It would be to the 253 and then something down here, let's just call to the 134. So what I would do is I would say, okay, if we get up here to 253, I would set an alert, but for the sake of this, I will just drop a bar. And then what I say to the bottom, like 154, something like that. So then it's that simple. If I hit either of those, my hypothesis is wrong, meaning that implied will trend over realized. And at that point, there would be the accumulation of a realized move, not necessarily over implied if it's all one directional, but it's enough that it would cause me to generally doubt my thesis. And then simply accept being wrong",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 96,
      "start_timestamp": "01:42:08",
      "start_timestamp_seconds": 6128.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=6128"
    }
  },
  {
    "text": "is wrong, meaning that implied will trend over realized. And at that point, there would be the accumulation of a realized move, not necessarily over implied if it's all one directional, but it's enough that it would cause me to generally doubt my thesis. And then simply accept being wrong and move on. That's what I would do in that scenario. That's a great question. John says, high AF in an options learning live stream. Yeah, that's a great place to do it, man. Like you never know, that might be the right mindset to be in, especially on a Friday night. That's my favorite part is I do these on a Friday night where most people are like trying to go out and go go to the bar or whatever. That's the best. All right. Diswag says, also I've been wanting to build my GME strangle, but there is always a piece of me that's afraid of missing out on something important. The good thing is a good basis. Yeah, that's awesome. Captain Chris says, I saw a Reddit post somebody purchased 4,000 VSC of 15 call. It does not have a lot of volume. Do you see any future potential with this call hitting money? Well, it's a good question. So a couple things. The first one is it's important to remember. It doesn't need to go in the money to make money. Right. So this position, let's replicate it. The 816 you said so here and the",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 96,
      "start_timestamp": "01:43:13",
      "start_timestamp_seconds": 6193.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=6193"
    }
  },
  {
    "text": "future potential with this call hitting money? Well, it's a good question. So a couple things. The first one is it's important to remember. It doesn't need to go in the money to make money. Right. So this position, let's replicate it. The 816 you said so here and the 15. Which I actually like that by. It's an 80 delta. That's a good trade. And it looks like this trade would have went on semi-recently. I actually, I think I've told you guys this already, but I started an affiliate relationship with unusual whales because they have a slick platform for this kind of stuff that's a little more user-friendly than what I do. So there's a discount code in the video description for folks that are interested. But let's take a look. And what is this? The 15. So if we grab the 15 strike. So I'm going to take. Thor, leave yourself alone. At the old my dog. Sorry, you guys know what goes. And. So I'm looking at essentially the last. Oh, that's not what I meant last month. Oh, interesting. So it looks like most of the activity would have been like the last week, right? Yeah. So this is all activity within the last week, which I do find that interesting. This is this is an interesting trade. So what I'm looking at right now is the size of the positions that are going on, which is here. I'm looking at the frequency. So",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 96,
      "start_timestamp": "01:44:33",
      "start_timestamp_seconds": 6273.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=6273"
    }
  },
  {
    "text": "right? Yeah. So this is all activity within the last week, which I do find that interesting. This is this is an interesting trade. So what I'm looking at right now is the size of the positions that are going on, which is here. I'm looking at the frequency. So when they went on. So it looks like a lot of these are multi-leg. Which I don't feel as strongly about. The trade was to open as determined by the size. Only trades that can be positive, identify, marked as such. Yeah, okay. Yeah, that's interesting accumulation. For sure. So there's a couple other things now that I would look at. Let me get this out of the way for now. And let's take a look at some other stuff. I get this out of the way. So the open interest is not exciting at all. The open interest indicates a pretty big balance between calls and puts. The interesting position really is this one that went on that we were just talking about those 15s. These are like sad little. This is so funny. So what I'm right now doing is kind of assessing the volatility smile. And these are interesting because the put side is heavy, which I would expect. But the call side obviously was gaining a little bit of traction. And the 15s. They went on a little bit cheap. It looks like. Which is good. It means that they wouldn't have gone on super expensive.",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 96,
      "start_timestamp": "01:45:57",
      "start_timestamp_seconds": 6357.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=6357"
    }
  },
  {
    "text": "are interesting because the put side is heavy, which I would expect. But the call side obviously was gaining a little bit of traction. And the 15s. They went on a little bit cheap. It looks like. Which is good. It means that they wouldn't have gone on super expensive. So that looks interesting to me. But a lot of what I see in here is kind of not a whole lot. So the other thing I would want to keep an eye on is the influx of volume. And then the other thing I would want to keep an eye on is any news. Because it looks like something's going on here. Yeah. What happened today in here? Do you know? Roryntitty says, wait, Temple is going on about me. I'm not the cat. I don't think anybody knows. Well, what was going on? But you definitely had a comment director towards you, which we were not again. I'm happy to take abuse. You guys have been on enough live streams where people want to talk. And I don't really care. Man, it doesn't bother me. But I don't let people talk disrespectfully towards other people. That ain't going to be it. And then if it gets too a threshold with me, I also won't tolerate it. But I have no problem taking more of it because I don't care. Yeah. So I don't see a bunch of news. Which is funny because of this. I literally was going",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 96,
      "start_timestamp": "01:47:51",
      "start_timestamp_seconds": 6471.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=6471"
    }
  },
  {
    "text": "to be it. And then if it gets too a threshold with me, I also won't tolerate it. But I have no problem taking more of it because I don't care. Yeah. So I don't see a bunch of news. Which is funny because of this. I literally was going to show you guys this other study. This and this. So these are two two studies you guys should look at. This one is fascinating. What this is highlighting is that there is absolutely an observable abundance of this kind of activity where people that have insider information, you don't have to look any further than Nancy Pelosi for that joking, but not joking. We'll use options. And it's because they're more efficient. So you can see that this is really interesting. That 25 of takeovers have abnormal positive values short dated out of the money calls. That's expectation of big move, right? If you know a company you're in has the potential of being taken over, buying out of the money calls is a great move. And the fun part is if you look at the bottom, it says that the SEC litigates only 8. So there is a massive, massive number of these kinds of positions that go through with no litigation. So it's kind of a low risk way to, I guess be shitty or take advantage of things. But anyways, you guys should check out that study as well. It talks about that kind of stuff",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 96,
      "start_timestamp": "01:49:20",
      "start_timestamp_seconds": 6560.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=6560"
    }
  },
  {
    "text": "massive, massive number of these kinds of positions that go through with no litigation. So it's kind of a low risk way to, I guess be shitty or take advantage of things. But anyways, you guys should check out that study as well. It talks about that kind of stuff a little bit. All right, see what else you guys got. Crypteto says what would be the most beginner-friendly book to start with? The most beginner-friendly book to start with would be this one probably. Options is a strategic investment, I believe. That's why I recommend it to most people. That's why it's kind of the standard go-to book. It's because it gives you enough to go off of. It's a decent summary of a lot of high-level topics. I like this book a lot. The, this one here is also a must-have in my opinion by Sheldon Natenberg, falsely imprising. And then this one too, optional option trading. This is a good one. But these get a little more nuanced than necessary, I think. So the short answer is this one would be my beginner, special or my beginner, beginner option trading book. All right. Oh, that's a weird name. Joe Sway. Is that like, Hossway? I don't know that one. Interesting name. I don't know how to say your name. I'm doing my best out here. But, shit, now I lost it. Where was it? I think it was in here. There it is. Usually what strategy do",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 96,
      "start_timestamp": "01:50:39",
      "start_timestamp_seconds": 6639.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=6639"
    }
  },
  {
    "text": "name. Joe Sway. Is that like, Hossway? I don't know that one. Interesting name. I don't know how to say your name. I'm doing my best out here. But, shit, now I lost it. Where was it? I think it was in here. There it is. Usually what strategy do you use the most? Buying calls, covered calls, buying puts, selling puts? The most frequented strategies for me are the coverage strangle and ratio diagonal sandstown. So those are two videos that I kind of have a playlist on. I'm actually working on a video soon. That's just like how I trade options a little more broadly. But those two are definitely the the go-to's for me. Captain Chris says you strike me as a shroom and stocks kind of guy. I really don't like drugs. So that is not so much my go-to. Diswags as congrats on the usual whales. I mean, honestly, not a great deal for me. I don't really care about the affiliates. The reason why I sign up for affiliates is straight up for people that want it to give them a discount. That's literally it. I don't even know what the what the kickback is for it for me. They're typically not good. So like, but that's the beauty with a lot of the people that will join the the Patreon and stuff like that. Because then it lets me not worry at all about affiliates and shit. So I kind of can just",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 96,
      "start_timestamp": "01:52:07",
      "start_timestamp_seconds": 6727.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=6727"
    }
  },
  {
    "text": "is for it for me. They're typically not good. So like, but that's the beauty with a lot of the people that will join the the Patreon and stuff like that. Because then it lets me not worry at all about affiliates and shit. So I kind of can just try to find stuff that I think is decent. But anyways, I appreciate all the same. Two lures says I have 50 GME calls with 20 strike, 19 July, and 23, 50 for each date, costs a little over 50. Do you think it's a good idea? I think it's a good idea based on your hypothesis. It'll be a good idea if it works. It'll be a terrible idea if it doesn't work. The jokes aside there really what determines a good idea is like if it's a good expression of your idea, that's all. Now in terms of the structure of what you bought we can take a look at. And the first thing is I think the 19 July is a giant mistake because it is way too short dated. I like that they're in the money. So that will help offset some of the theta decay that you're going to get in this really short term timeframe. However, you're going to also experience not like you need a pretty big move here, but you'll move dollar for dollar, which is good. So in that sense that's all good. I like the 16-og way better. And the",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 96,
      "start_timestamp": "01:53:32",
      "start_timestamp_seconds": 6812.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=6812"
    }
  },
  {
    "text": "that you're going to get in this really short term timeframe. However, you're going to also experience not like you need a pretty big move here, but you'll move dollar for dollar, which is good. So in that sense that's all good. I like the 16-og way better. And the reason why I like the 16-og way better, even though it's a little more expensive, a little more extrinsic value, the trade has some time to work. Now if you tell me that your thesis is something is going to fly off the handle in the next week and that's part of your hypothesis, then yeah, I think being closer makes sense. I also like that you use the primary explorations. I like that you didn't use any of these weird little half strikes that the weaklies have or anything like that because they're less liquid. So from those from that standpoint and from those perspectives, I think it's fine. I don't love the 19 July, but it's just because there's just not a lot of time left is all. So orange guy says, can I show you something on a certain stock chart and ask for your opinion? Yeah, of course. Happy to take a look. I still got a few minutes. Back up to the top though. Moody blues, good to see you. I haven't seen you in a minute. I heard this somewhere that the market tends to drop or month or two before election day. Is",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 96,
      "start_timestamp": "01:54:45",
      "start_timestamp_seconds": 6885.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=6885"
    }
  },
  {
    "text": "of course. Happy to take a look. I still got a few minutes. Back up to the top though. Moody blues, good to see you. I haven't seen you in a minute. I heard this somewhere that the market tends to drop or month or two before election day. Is that rumors? Or do you try to trade it by placing longer shorter days' aspirations? A great question. So what that would kind of fall into is the thing we would call seasonality. And you can find all different kinds of seasonality. I don't know that one off the top of my head. I do have a data set that could tell me so that's something I can follow up on for sure. In the discord, I'll take a note on that right now. That's a really easy one. That'll take me straight up just a couple minutes. But we'll take a look at market behavior. Five days, two days, and one day, pre and post election. And we can break that out too by like who's elected and that kind of stuff, which is typically useful. So yeah, definitely. I just don't want to give you a bad answer up front. The other thing we could do realistically, and I bet that there's something on it already is this. Let me take a look. Quick look. This is our end stock market election year. Yeah. Most of this stuff has been researched to some degree. I am a little",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 96,
      "start_timestamp": "01:55:49",
      "start_timestamp_seconds": 6949.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=6949"
    }
  },
  {
    "text": "up front. The other thing we could do realistically, and I bet that there's something on it already is this. Let me take a look. Quick look. This is our end stock market election year. Yeah. Most of this stuff has been researched to some degree. I am a little bit of a data control freak. I like understanding what I'm using. So I typically look at my own stuff and essentially only my own stuff. But I always will look for what exists already. So here's one right here that we can look through together very quickly. Okay, never mind. This one is from good old Bangladesh, which I actually am less interested in. Let's test this one. That's Nigeria. It's good. Maybe we have to do like in the US. Here's another one we can take a look at real quick before I abandon ship. What country are you from? They use commas in their decimal points. Let's see. I don't really like this so far what I'm reading. The United States, the exact day every even year. Here you go. Positive drift starts as soon as the fifth day before the election. Ends at the day of election with almost two and a half percent performance on average. There you go. And obviously you'd want to do a bunch more research about the quality, the distribution, like those kinds of things. But yeah, there's at least a pre-limancer before I have a chance to look at it",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 96,
      "start_timestamp": "01:56:55",
      "start_timestamp_seconds": 7015.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=7015"
    }
  },
  {
    "text": "election with almost two and a half percent performance on average. There you go. And obviously you'd want to do a bunch more research about the quality, the distribution, like those kinds of things. But yeah, there's at least a pre-limancer before I have a chance to look at it myself, which again, we'll do because I prefer to look at my own shit. Beach dreaming says, dang, I never catch these on time. Thanks for all you're doing. Great at teaching. That's awesome. I love I literally love teaching. It's teaching, it's funny because like it's not just teaching this stuff. It's teaching anything that I have a skill set in. I really, really value the process of teaching. A big reason behind that I try to give people like the motivations for stuff. And like I grew up with a single mom and I knew my dad and I loved my dad, but it was a weird relationship and it wasn't super healthy. Long story short, the way that I learned how to become like a man and learn things is from a lot of different people. I had people teach me about cars. I had people teach me about basketball. I had people teach me about cooking steaks. And it's all these different dudes that help teach me a bunch of different things. So I derived a tremendous amount of value from that. And I think that's why I'm so passionate about teaching is for that exact",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 96,
      "start_timestamp": "01:58:28",
      "start_timestamp_seconds": 7108.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=7108"
    }
  },
  {
    "text": "me about basketball. I had people teach me about cooking steaks. And it's all these different dudes that help teach me a bunch of different things. So I derived a tremendous amount of value from that. And I think that's why I'm so passionate about teaching is for that exact reason. Crypteto, thank you so much. I hope you have a killer rest of your evening and weekend. And I'll see you during the market prep session on Sunday. Thank you very much, man. Back up the, John says, I'm fairly new. Would you say there's a certain time of year when stocks perform the best like summers? Yes and no. There are broad answers you could apply to that, but the very situation dependent. So there is absolutely a seasonality to a lot of different things that you can observe. But there's enough variance in it that it makes sense to learn the variance, I would say. Captain says, does it make sense to exercise these close to expiration because some sort of movement towards earnings or something? I'm unsure. Typically not. If you're talking about your options, typically it's most logical to just trade them. Reese says, I know what a standard deviation implies, but how is that number calculated? So there's a few different ways you can think about standard deviation specifically with respect to volatility, which is essentially that. But it uses the square root of the variance from a mean. And the reason why you",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 96,
      "start_timestamp": "01:59:32",
      "start_timestamp_seconds": 7172.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=7172"
    }
  },
  {
    "text": "know what a standard deviation implies, but how is that number calculated? So there's a few different ways you can think about standard deviation specifically with respect to volatility, which is essentially that. But it uses the square root of the variance from a mean. And the reason why you do, well, it's technically the variance squared then you do the square root of that. And that just creates positive integers for everything and then it magnifies it a little bit when you square it. And then you square root it to get back to the unilateral base metric. So yeah, that's kind of it. So one key rep says, how come my question's gone? I didn't see it. If you have one, they'll feel free to drop it in. I'm about to hop off in a minute because my B-dub just got here, but I am happy to take a look. Oh, let's see. Okay, let me get through these last two. Orange says BBBY. So the problem with stuff like this is I don't think you can apply standard technical analysis is what it boils down to. Like products like this are really anomalous. Their floats behave very differently. And also my chart's not loading it. So a little bit of an uneventful, but this doesn't, this typically doesn't follow standard rules is really the way I would boil that down. Alfa says, I have a stocks related question. Should I trade my shares in BDSM of stocks",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 96,
      "start_timestamp": "02:00:45",
      "start_timestamp_seconds": 7245.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=7245"
    }
  },
  {
    "text": "differently. And also my chart's not loading it. So a little bit of an uneventful, but this doesn't, this typically doesn't follow standard rules is really the way I would boil that down. Alfa says, I have a stocks related question. Should I trade my shares in BDSM of stocks for something more recent? I think you should do whatever you want. I'm really, I have no opinion or vested interest in what individual traders do with their positions. And I don't say that to defer or to not answer your question, but it's to force you to answer your own question. I think that that's why. And it's because like trading is going to be based on your own thoughtware. If you like whatever stock you have and you want to continue holding it, do that. If whatever stock you have isn't doing what you want it to do anymore, then don't hold it. Get rid of something else. Orange, guys, said I just had a question on the past patterns because something can be learned. And yeah, so I think, yeah, like I said, I would love to pull it up, but there's nothing going on here because I literally can't load it. But I was just kind of commenting on BBY anyways. Because one of the things to think about is like with prior patterns and stuff like this is because they're so anomalous, it's actually very difficult to like discreetly attribute them to things. So all",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 94,
      "total_chunks": 96,
      "start_timestamp": "02:02:15",
      "start_timestamp_seconds": 7335.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=7335"
    }
  },
  {
    "text": "I literally can't load it. But I was just kind of commenting on BBY anyways. Because one of the things to think about is like with prior patterns and stuff like this is because they're so anomalous, it's actually very difficult to like discreetly attribute them to things. So all right, you guys that officially sums me up. I think this is the longest one we've done. This is over two hours, but I had a blast with you guys. I'm going to go stuff my fat face and then walk my dog. But I will see you guys in the discord over the weekend. Be an outlier. I'll see you guys for part six next Friday. Catch you later.",
    "metadata": {
      "video_id": "F8Mpls7PWfs",
      "title": "Options Guide for Beginners, Settling Trades, Reading Chains | Options Trading for Beginners Pt5",
      "url": "https://www.youtube.com/watch?v=F8Mpls7PWfs",
      "upload_date": "",
      "duration": 7457.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 95,
      "total_chunks": 96,
      "start_timestamp": "02:03:28",
      "start_timestamp_seconds": 7408.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=F8Mpls7PWfs&t=7408"
    }
  }
]