[
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 14,
    "text": "What's up, allies? Time for a quick market update. We have a few things on the agenda. We're going to talk about quantum computing, quick market overview, PPI, which came in a little bit hot. We have a split coming up in a pretty well-known stock PNW. And then I want to take a look at Tesla and TWLO maybe TWLO if we have time. So I want to start with this though, because quantum computing is starting to gain a lot of traction. And it reminds me a lot of just what we've seen in AI, where AI was kind of quiet. Didn't hear too much about it. Then you started to hear a little bit about it. And then pretty damn quickly, actually yesterday, for me, I updated my phone and in iOS 18.2 or whatever it is. It's now integrated into the software itself that I can use Chatupot. So adoption for something like AI is moving super, super fast. Now, quantum computing has a very different use case. And I don't necessarily see the same spread as something like AI that can be in many different shapes and forms and really impact just about everybody. It's literally on my phone. You're not going to have that on quantum computing on a phone, at least in the near term, who knows what it might be in some years from now. Now, the interesting thing, though, is that now is typically the time to find things that we",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=0"
  },
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 14,
    "text": "literally on my phone. You're not going to have that on quantum computing on a phone, at least in the near term, who knows what it might be in some years from now. Now, the interesting thing, though, is that now is typically the time to find things that we think might be a big part of this quantum computing movement if we think that it's powerful. Now, for those that are curious what quantum computing is, I'm literally the last person on planet earth to explain it to you because I'm an idiot. Now, I can summarize it at a very high level, which it's essentially the ability to solve more challenging problems that an existing computer cannot. And it's a restriction based on the way standard computers now use bits. They exist in either a one or a zero state that adds a natural constraint to what they can compute. Quantum computers use something called qubits that can exist in multiple states. They can be one or zero or and zero, which is really cool. And it allows them to solve really big problems, simulations and things like that that your computer as it sits today cannot do, which is again, very neat. But let's listen to this from fast money. This is a couple days old, but this talks a little bit about some of the error correction component to it. I haven't listened to this yet. I'm actually going to listen to you right now with",
    "start_timestamp_seconds": 59.44,
    "start_timestamp": "00:00:59",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=59"
  },
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 3,
    "total_chunks": 14,
    "text": "which is again, very neat. But let's listen to this from fast money. This is a couple days old, but this talks a little bit about some of the error correction component to it. I haven't listened to this yet. I'm actually going to listen to you right now with you guys. This just looked interesting to me. I'm in the camp. I think consistent with what most of the panelists said, which is probably too much for today. I agree with Guy that this is more of a validation point for Google's tech, but this just a point in perspective, they started this Willow project 12 years ago. And so the potential around this being commercialized is probably 10 years away. And so it's a it's still a long time. That's interesting. I understand the point that he's making, which is very interesting overall. But I also am continually impressed at how fast things can move once there's the right incentive structure in place. Again, I'm sure for something like widespread adoption utilization, it probably is some time off. To me, 10 years just sounds like a long time for something like that, especially if there's enough opportunity. For example, if a company like Google really sees a huge opportunity as the technology starts to take shape, I wouldn't be surprised if that timeline is pretty severely accelerated. And this goes back to the point I was making just before that if these are the kind of things that",
    "start_timestamp_seconds": 122.32,
    "start_timestamp": "00:02:02",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=122"
  },
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 4,
    "total_chunks": 14,
    "text": "example, if a company like Google really sees a huge opportunity as the technology starts to take shape, I wouldn't be surprised if that timeline is pretty severely accelerated. And this goes back to the point I was making just before that if these are the kind of things that you want to try to trade in for me, it absolutely is because these kinds of technologies lead to these massive waves of movement that can quite literally give you a year, two years, three years worth of gains if you're in the correct stuff with the correct style trades to capitalize on the move it is unfold. So that doesn't mean it's happening right now today, but it does mean that keeping a really close on the movement of this technology and when it starts to catch fire, finding companies that we think are really going to be leaders or contributors. And another note on that is big companies like Google will be a big part of this also stuff like IBM will be a big part of this so on and so forth. However, the stuff that's going to move a lot is going to be small cap midstop, mid cap stocks that contribute to this in some way. So now is the time to build that watch list. It's the time to start going through what we think feeds into quantum computing in some way. And it might be a little bit early because here's the other",
    "start_timestamp_seconds": 191.36,
    "start_timestamp": "00:03:11",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=191"
  },
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 5,
    "total_chunks": 14,
    "text": "midstop, mid cap stocks that contribute to this in some way. So now is the time to build that watch list. It's the time to start going through what we think feeds into quantum computing in some way. And it might be a little bit early because here's the other thing. Even before there's widespread adoption, all of these smaller companies are going to have to get their supply chains in line. They're going to have to broker all these different deals in order to feed the commercialization. So a lot of that move is going to happen in those kinds of companies before the full scale adoption. There's something to be aware of. Let's keep going does speak. There is a piece where the stock should have been up today. I would add guest a few percent because I think it does speak to Google invested in the right areas for what will be continuing tech acceleration in the decades to come. I mean, this is a Google investor as a sleep well at night. Similar as Waymo is a sleep well at night business. It doesn't get a ton of attention. But I think collectively, Melissa, I would have expected the stock to be up a couple percent today, not 5 percent. Gene, I love when you're a growth. So thank you. I'll ask you this question and on the back of that. Who should be worried about this? I saw on your notes probably not Nvidia, not",
    "start_timestamp_seconds": 258.48,
    "start_timestamp": "00:04:18",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=258"
  },
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 6,
    "total_chunks": 14,
    "text": "have expected the stock to be up a couple percent today, not 5 percent. Gene, I love when you're a growth. So thank you. I'll ask you this question and on the back of that. Who should be worried about this? I saw on your notes probably not Nvidia, not AMD yet, but somebody has to be. I think there's some of the other quantum companies. There's private companies on that side. But I think on the public side, the worries are probably because this is again a so far away. I think the piece that the rest of the mag seven needs to be contemplating here and Nvidia needs to be thinking about is just what are they doing to have some sort of position within quantum computing? It is it's theory right now, but I think you have to. You have to imagine they already have thought through this and then some. So I understand this point again, but I don't think that this is Nvidia's time to like start thinking about it. I'm pretty sure Nvidia understands has ideas on how they want to get involved, what they think they can do. And then it's a matter of what's the right timing to execute against it and whatnot. But the reality is quantum computing is very likely the the next big thing. Now, I say that in a different context than something like AI for the reasons I described earlier, AI has the ability to show up",
    "start_timestamp_seconds": 316.88,
    "start_timestamp": "00:05:16",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=316"
  },
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 7,
    "total_chunks": 14,
    "text": "of what's the right timing to execute against it and whatnot. But the reality is quantum computing is very likely the the next big thing. Now, I say that in a different context than something like AI for the reasons I described earlier, AI has the ability to show up in many different forms and impact quite literally everything. Even super small use cases to people playing around with the voice version of chat GPT because it's funny to using it to accelerate the building of newsletters and collating news. All different kinds of things is a trader. You can use AI to review what you're doing and give you feedback. It's literally about as multivariate as you can get. You can load different files and query against that. I've done that with a bunch of different studies from SSR and it essentially becomes a super genius that can answer all different kinds of questions provide research from a giant library of studies I have. So it's like AI can impact lots of things. Quantum computing is going to have very specific use cases in the beginning is it's going to scale. It's going to move a little bit slower. Now, you can see that there is a couple companies that they highlight that are likely involved in this to varying degrees. So let's take a look at these. I'm going to move away from TWLO for now. The main reason why this is on the list is because they're",
    "start_timestamp_seconds": 376.64,
    "start_timestamp": "00:06:16",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=376"
  },
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 8,
    "total_chunks": 14,
    "text": "Now, you can see that there is a couple companies that they highlight that are likely involved in this to varying degrees. So let's take a look at these. I'm going to move away from TWLO for now. The main reason why this is on the list is because they're just crushing it. Take a look at this run. They've post earnings. They came in at a dollar to they were expected at eight cents. So smashed earnings and has just been floating up floating up to the sky. This is why post earnings announcement drift is such an important factor, especially for small cap mid cap stocks. Lots of money to be made on stuff like this. Now that aside, let's take a look at some of these other names from that article. So RGTI is one of them. And this obviously is moving a lot to do with the news from Google. I oh and cue this one's interesting because this is popped up on a lot of my scanners. And this is something I've been keeping an eyeball on for a little while now. This also had a pretty rough earnings, but the forecast was generally solid. And we are seeing a Taylor off a little bit here. So we'll just create an alert, keep an eyeball on this bad boy. Yeah, it goes. And then I thought there was one more there it is. UBTS. That's a good name. So this looks just about the same",
    "start_timestamp_seconds": 442.0,
    "start_timestamp": "00:07:22",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=442"
  },
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 9,
    "total_chunks": 14,
    "text": "And we are seeing a Taylor off a little bit here. So we'll just create an alert, keep an eyeball on this bad boy. Yeah, it goes. And then I thought there was one more there it is. UBTS. That's a good name. So this looks just about the same as RGTI. Like they're essentially the same charts, QBTS. These are a handful of names that you might want to keep an eye on. And you can tell that these are very early stage names because most of them are still running in the red. So this had negative earnings here. What did it produce here? It was also negative earnings here. This is very common for companies that are getting their feet on them and starting to grow. So definitely something to keep an eyeball on. Now from a broad market perspective today, we saw tech and large cap hold on. So the SP 500 and Qs about the same small caps still rolling over. Really interesting because we just reviewed the Fed watch. Yesterday, it's overwhelming probability of a 25 base point cut. And yet the market rolls over. So that I find slightly interesting discretionary is still absolutely crushing it. We can see things like healthcare not doing quite as well. Utilities not doing quite as well. Real estate is slowly basing a little bit. But I would not be surprised at all to see continued downside here and energy just running down. Industrial is running down.",
    "start_timestamp_seconds": 506.08,
    "start_timestamp": "00:08:26",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=506"
  },
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 10,
    "total_chunks": 14,
    "text": "absolutely crushing it. We can see things like healthcare not doing quite as well. Utilities not doing quite as well. Real estate is slowly basing a little bit. But I would not be surprised at all to see continued downside here and energy just running down. Industrial is running down. So we're seeing a rotation, which is really important. If you're too late to this party, then that's one you're overpositioned to the upside, even though there's a pretty big rotation going on within the indices themselves and within the sectors themselves. This doesn't mean crash. It doesn't mean that the market's going down, but it does mean pay attention to this stuff because it absolutely can go from slow to fast really quick. And you don't want to be cut on the wrong side just because we're not looking at stuff. It's typically a pretty bad reason to go down. Next up, we have PPI. And PPI came in a bit hot, 0.4 month over month compared to 0.2. And before is 0.3. And core PPI was 0.2 right in line with consensus. So inflation is looking a little weird here. It's looking like there's some artifacts of it actually expanding a little bit, not excessively. I don't think the market's freaking out about it. But it's also not necessarily tamped all the way down. And we saw this also with CPI from yesterday. So this is something that we really need to pay attention to because this inflation",
    "start_timestamp_seconds": 579.52,
    "start_timestamp": "00:09:39",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=579"
  },
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 11,
    "total_chunks": 14,
    "text": "actually expanding a little bit, not excessively. I don't think the market's freaking out about it. But it's also not necessarily tamped all the way down. And we saw this also with CPI from yesterday. So this is something that we really need to pay attention to because this inflation being in a holding pattern is a really, really big gimme in terms of the way that the market is performing. If that starts changing in any significant degree, that absolutely has the potential to start adding a lot of volatility to the market, even in the markets, very, very complacent right now. Next, let's take a look at PANW. And this is primarily because it does have a split coming up. The stock has had a really, really solid run. And a lot of times post split for stuff like this, we will see new money being able to find its way into the stock that people like. And I'm also, I don't know if good old Pelosi. Let's find out. This has been in Pelosi's portfolio for a while. I don't know if it still is. That'll probably completely dictate what all of us should do. And let's take a peek. I'm not affiliated with these guys. They have a really great tool for this. And let's see Tesla PAN. There it is. Options too. You got to love that Pelosi's out here slaying options. Take a look at this. Her strategies are just smashing. She's up over",
    "start_timestamp_seconds": 652.88,
    "start_timestamp": "00:10:52",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=652"
  },
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 12,
    "total_chunks": 14,
    "text": "take a peek. I'm not affiliated with these guys. They have a really great tool for this. And let's see Tesla PAN. There it is. Options too. You got to love that Pelosi's out here slaying options. Take a look at this. Her strategies are just smashing. She's up over 800 percent compared to a measly 200 percent over the same reference timeframe for the SP 500. It's almost it's almost like, almost like she might have information that other people might not. Really great positioning here though. And it looks like the last couple trades were in 21 Feb. But this is something I've seen pop up on our portfolio a few times. So you know what that means? Full port because in Pelosi, we trust at least in terms of our returns. Tesla absolute tear. Somebody asked me if I could take a look at this. And Tesla has been on a on a burner of a move. Now there's a lot of drivers I can see leading into this. But regardless of what all of them are, what I think here is sooner or later, there is extension. And I really prefer to follow momentum. But the way I saw it is getting in post this, it just becomes a really high risk entry. For a shorter term, swing slash momentum style trade, not for a long-term investment, long-term investment is whatever it is. Now one thing I try to remind people though, that if you go",
    "start_timestamp_seconds": 718.88,
    "start_timestamp": "00:11:58",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=718"
  },
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 13,
    "total_chunks": 14,
    "text": "way I saw it is getting in post this, it just becomes a really high risk entry. For a shorter term, swing slash momentum style trade, not for a long-term investment, long-term investment is whatever it is. Now one thing I try to remind people though, that if you go further out in time, this is going out to five years. Notice how we are now just getting back to the peaks that we saw at the end of 21. That's an important note. This isn't a lot of like brand new uncharted territory. We are now just getting to this. So all of this proceeding move while very impressive is still a recovery move. We don't start getting into new territory literally until today. So I think that context is really, really important when we look at this because this kind of move seems rip your face off impressive and it is. But that being said, it's still overwhelming majority recovery so far. And now we're just getting into new territory. So that's something else I keep an eyeball on. So lots of stuff going on. As always, if there's anything you want me to take a look at, let me know. Be an outlier. I'll see you all later.",
    "start_timestamp_seconds": 801.76,
    "start_timestamp": "00:13:21",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=801"
  },
  {
    "video_id": "FCHbsEEpzqw",
    "title": "FCHbsEEpzqw",
    "url": "https://www.youtube.com/watch?v=FCHbsEEpzqw",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 14,
    "total_chunks": 14,
    "text": "let me know. Be an outlier. I'll see you all later.",
    "start_timestamp_seconds": 869.44,
    "start_timestamp": "00:14:29",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=FCHbsEEpzqw&t=869"
  }
]