[
  {
    "text": "What's up outliers? I want to talk to you about a trade in CCJ where I used unusual options activity in conjunction with a thematic idea to effectively make over 200 return on the option itself and it was about 160 return on a vested capital so far. The trade's not fully over yet. So I'm going to talk to you about what the idea was, how I found it, those kinds of things. I want to start by setting the table with you all and this is the position we're going to be talking about. The first thing to know is that I've scaled this position so that it's similar sizing in my actual portfolio but using the 600,000 model portfolio. I'm trying to put everything in a common language. So effectively what this is is essentially saying if this trade was part of this portfolio, this would be the relative sizing used which ended up being 12,600 position for 50 lots. This represents about a 2 position which in my actual portfolio, this trade was larger but this is the same relative size. So that is we talk about the model portfolio and stuff like that. All of this carries over because the actual dollars amounts, none of it matters. That's why I'm not spending time showing like the actual position because it doesn't actually matter. I know that it's fun for like gain porn and seeing numbers but I care so much more about talking about the",
    "metadata": {
      "video_id": "fdjndtACm7Y",
      "title": "An Inside Look at How to Use Unusual Options Activity to Trade",
      "url": "https://www.youtube.com/watch?v=fdjndtACm7Y",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fdjndtACm7Y&t=0"
    }
  },
  {
    "text": "this carries over because the actual dollars amounts, none of it matters. That's why I'm not spending time showing like the actual position because it doesn't actually matter. I know that it's fun for like gain porn and seeing numbers but I care so much more about talking about the process. So I think it's useful to keep everything in that context. So let's start with the broader theme and let's listen to a few seconds of this. This is from a few months ago. From President-elected Donald Trump that he wants to drill baby drill but it's unclear if oil executives actually want to increase production while President-elect Trump has said that he wants to gut the inflation reduction act. So nuclear could actually be the biggest energy beneficiary for a few reasons. First of all, so you heard it and I think this is actually a pretty decent summary. The positioning for nuclear power is very strong so it put it on a watchlist for me and it's something that I knew that we were going to see policy eventually announced around and when we would see that policy, there likely was going to be an interesting change in price. So we're going to talk about this trade in the context of the outlier trade process and I will throw a link to this video in the notes below but this is effectively the major steps I go through mentally as I'm putting on a trade. So I",
    "metadata": {
      "video_id": "fdjndtACm7Y",
      "title": "An Inside Look at How to Use Unusual Options Activity to Trade",
      "url": "https://www.youtube.com/watch?v=fdjndtACm7Y",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fdjndtACm7Y&t=0"
    }
  },
  {
    "text": "in price. So we're going to talk about this trade in the context of the outlier trade process and I will throw a link to this video in the notes below but this is effectively the major steps I go through mentally as I'm putting on a trade. So I feel it relevant to talk about the trade in the context of this process. So I have different positions on in nuclear power themed trades right now but and even in CCJ I have multiple positions on but I'm actually focusing on a specific subset of those positions and it's because the entry for this series of trades was fueled again by unusual options activity which is kind of fun to look at and it helps me create tie-in actually for something I regularly use but combining it with the thematic play. So again ticker here with CCJ and it's because they produce uranium and they're very successful at it. They're one of the primary producers that we see and with all the domestication of things that the US is going through it seems like this company would be a pretty well position and this is more for a longer term idea. Again, this is the backdrop. The way that my brain works is I like to create different themes that I'm paying attention to and that as they see opportunities emerge in those themes I'm ready to bounce on them. So this started not as a portfolio need but",
    "metadata": {
      "video_id": "fdjndtACm7Y",
      "title": "An Inside Look at How to Use Unusual Options Activity to Trade",
      "url": "https://www.youtube.com/watch?v=fdjndtACm7Y",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fdjndtACm7Y&t=0"
    }
  },
  {
    "text": "term idea. Again, this is the backdrop. The way that my brain works is I like to create different themes that I'm paying attention to and that as they see opportunities emerge in those themes I'm ready to bounce on them. So this started not as a portfolio need but an opportunity. So again for my general screening process I want to know do I have something specific I need to put into the portfolio do I need long delta short delta long premium short premium long dated option short dated options all that kind of stuff. None of it applied. This was entirely driven by an opportunity as I saw it emerging. So for some general context in CCJ if we look out over the last three year time frame we can see that it's in a pretty aggressive growth phase. However, it had a massive sell off essentially from late 2024 and then it started bottoming around April. So the longer term trades that I'm using not going to go into detail on those here but actually started following earnings and it's using essentially two breakout periods from the second of May and then also on the sixth of May. But again that's not what we're going to discuss today. We're actually going to discuss a trade that started on the 14th and the 14th kind of quasi breakout but again it was the options component that led to the idea. So this is a broader thematic upside",
    "metadata": {
      "video_id": "fdjndtACm7Y",
      "title": "An Inside Look at How to Use Unusual Options Activity to Trade",
      "url": "https://www.youtube.com/watch?v=fdjndtACm7Y",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fdjndtACm7Y&t=0"
    }
  },
  {
    "text": "of May. But again that's not what we're going to discuss today. We're actually going to discuss a trade that started on the 14th and the 14th kind of quasi breakout but again it was the options component that led to the idea. So this is a broader thematic upside play in nuclear energy. The profit mechanism in this trade is going to be direction and the stuff that I was looking for really helped me identify momentum drift and positioning and again we're going to spend time looking at the actual options positioning that that peaked my interest. The trade itself was going to start with long calls and in the back of my mind it has the ability to turn into a ratio called diagonal again I have other positions on that already exhibit or the ratio called diagonal side. So this one was really designed to be a little bit shorter term again because of the options and just following the options flow. So this position was going to be managed not by time meaning duration and trade more so based on movement. However if enough time passed and the trade wasn't doing what I thought it should then I would have exited. So the actual trade that went on was super simple on the 14th of May. CCJ was about 52 53 and again relative to the 600,000 portfolio this represents a 50 50 lot the actual trade was larger than this and I went out",
    "metadata": {
      "video_id": "fdjndtACm7Y",
      "title": "An Inside Look at How to Use Unusual Options Activity to Trade",
      "url": "https://www.youtube.com/watch?v=fdjndtACm7Y",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fdjndtACm7Y&t=0"
    }
  },
  {
    "text": "should then I would have exited. So the actual trade that went on was super simple on the 14th of May. CCJ was about 52 53 and again relative to the 600,000 portfolio this represents a 50 50 lot the actual trade was larger than this and I went out to the 19-70 calls for 2.52 these were 37 delta this is a little bit different than when I'm typically trying to size these trades because if I'm going to go that far out of the money a lot of times I'm actually going to be closer in time. However this is mostly where I saw better liquidity which is what led me into that that strike versus something that was a slightly higher delta. So this represents a 12,600 debit and again this is a little bit large for a speculative trade based on what I typically would do normally would be less than a percent. However in this context I went for a little bit larger because of slightly higher conviction and the risk in the trade was defined by the size. I wasn't expecting to realize that full 2 loss if I started seeing not accommodating price behavior but that is what I was prepared to lose based on the trade. The reason why I always take the time to define risk whether it's going to be by size or by a hard stop is because it allows me to then plan successfully for the rest of",
    "metadata": {
      "video_id": "fdjndtACm7Y",
      "title": "An Inside Look at How to Use Unusual Options Activity to Trade",
      "url": "https://www.youtube.com/watch?v=fdjndtACm7Y",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fdjndtACm7Y&t=0"
    }
  },
  {
    "text": "behavior but that is what I was prepared to lose based on the trade. The reason why I always take the time to define risk whether it's going to be by size or by a hard stop is because it allows me to then plan successfully for the rest of the trade. So what led to the original entry? It's actually kind of interesting and I have some screenshots here to show you. We'll take a look on the platform but I really want you to just pay attention to the net premiums and notice what happens on this day. You see how there's just this massive spike in positive call premiums so people that are buying calls and then you also see that there's kind of a drop the next day in put premium meaning that these are people selling puts. Overall very interesting positioning and this is what originally caught my eye. Again it wasn't just this. It's this in conjunction with the broader theme that I'm paying attention to. The reason why I'm making that point is because this in and of itself would not lead to an entry for me but it's this in conjunction with that broader idea. So let's go over to the platform really quick and let's take a look specifically at two things. I want to show you what the options chain actually looks like and it's for two different things but I want to show you broader skew. So if we",
    "metadata": {
      "video_id": "fdjndtACm7Y",
      "title": "An Inside Look at How to Use Unusual Options Activity to Trade",
      "url": "https://www.youtube.com/watch?v=fdjndtACm7Y",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fdjndtACm7Y&t=0"
    }
  },
  {
    "text": "that broader idea. So let's go over to the platform really quick and let's take a look specifically at two things. I want to show you what the options chain actually looks like and it's for two different things but I want to show you broader skew. So if we take a look and we rank this by premium and we take a look over the next couple explorations. Now this is on the 27th of May. This is after some of the move has started. So this was a little more pronounced leading into the release but notice how strong the call premium is relative to the put premium 236,000 in put premium compared to 1.7 million on the call side. This is for this coming expiration 30th of May. Then if we go out to the next expiration you can see still really big call premium skew and then again really big call premium skew and so on and so forth. So this skew had been present for some time as I was looking at it. So then the other thing I monitoring is the percent change in open interest and again this is after the move a little bit so we're starting to see this winding down to a degree day over day but this was also really pronounced. So then what I do is I say okay I'm seeing interesting positioning going on coming into what might be some sort of known release of information at",
    "metadata": {
      "video_id": "fdjndtACm7Y",
      "title": "An Inside Look at How to Use Unusual Options Activity to Trade",
      "url": "https://www.youtube.com/watch?v=fdjndtACm7Y",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fdjndtACm7Y&t=0"
    }
  },
  {
    "text": "little bit so we're starting to see this winding down to a degree day over day but this was also really pronounced. So then what I do is I say okay I'm seeing interesting positioning going on coming into what might be some sort of known release of information at this point when I put on the trade on the 14th of May the executive orders that Trump announced had not been announced yet because that was on the 23rd. So it was still kind of quiet but I can see this positioning going on. Then if I take a look at the actual options feed from the 14th of May and I'm looking at the call side I noticed that the 60s are getting hit a lot and most of the larger trades are being bought which is bullish in nature. So I'm seeing this pretty strong positive build out based on options premium which again all of that ends up leading to my entry into that trade. Now interestingly enough the position itself really didn't need to be held for that long. I had originally target just outside 5775 in CCJ that's not where I'm actually going to exit but it's where I'm going to set profit taking and the reason for that is because it's outside this next volume node. So this is where the original entry was and then my expectation was hold as it's rallying and then the original profit target taking would be again",
    "metadata": {
      "video_id": "fdjndtACm7Y",
      "title": "An Inside Look at How to Use Unusual Options Activity to Trade",
      "url": "https://www.youtube.com/watch?v=fdjndtACm7Y",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fdjndtACm7Y&t=0"
    }
  },
  {
    "text": "exit but it's where I'm going to set profit taking and the reason for that is because it's outside this next volume node. So this is where the original entry was and then my expectation was hold as it's rallying and then the original profit target taking would be again about 5775. Downside risk management again fully defined by the size of the trade but would have been starting to scale out or at below the 48 and a half handle as it fell below this point of control. So it's just a pure directional play. So then we got to move much faster than expected. So in those kind of instances you'll notice what I did here on the 27th today is I don't actually take the whole thing down but I take a good portion of it down and given the size of the move and the velocity against what I already have existing this trade broadly served its purpose which is shorter term in nature compared to the other trades and it's based again on the flow that I saw leading to the position. So this represented a realized PNL of 20,720 again this is relative to the 2 sizing on the model portfolio I've been sharing with you the actual position a bit different sizing than here. Now the remaining risk that exists is 2520. So I've already more than paid for the risk that's on I've secured a profit. So now what I'm doing is",
    "metadata": {
      "video_id": "fdjndtACm7Y",
      "title": "An Inside Look at How to Use Unusual Options Activity to Trade",
      "url": "https://www.youtube.com/watch?v=fdjndtACm7Y",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fdjndtACm7Y&t=0"
    }
  },
  {
    "text": "the 2 sizing on the model portfolio I've been sharing with you the actual position a bit different sizing than here. Now the remaining risk that exists is 2520. So I've already more than paid for the risk that's on I've secured a profit. So now what I'm doing is just following the trend. And again I already told you where the profit taking would be done which is about 5775 for this leg of the trade that was entered here. So that's really what I'm going to monitor from here forward. The main thing I want to attach here for you is using a broader thematic idea coupling it with using options as some sort of alert my guess is people started understanding or getting ideas that we might be hearing about the nuclear energy policy with Trump again it's hard to tell but seeing that kind of options activity and then just this massive explosion in volume following it's telling that a lot of times people get pieces of information before it's fully released and that seems like what might have happened here. So we still have the 10 lot out we'll see how it goes. Like I said it'll be locked in for a profit no matter what at this handle provided that there's no massive gaps down overnight that puts me outside of that. As always if you have any questions let me know be an all-air. See you later.",
    "metadata": {
      "video_id": "fdjndtACm7Y",
      "title": "An Inside Look at How to Use Unusual Options Activity to Trade",
      "url": "https://www.youtube.com/watch?v=fdjndtACm7Y",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fdjndtACm7Y&t=0"
    }
  },
  {
    "text": "said it'll be locked in for a profit no matter what at this handle provided that there's no massive gaps down overnight that puts me outside of that. As always if you have any questions let me know be an all-air. See you later.",
    "metadata": {
      "video_id": "fdjndtACm7Y",
      "title": "An Inside Look at How to Use Unusual Options Activity to Trade",
      "url": "https://www.youtube.com/watch?v=fdjndtACm7Y",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fdjndtACm7Y&t=0"
    }
  }
]