[
  {
    "text": "Do you know the difference between good and bad risk as a trader? My guess is most traders out there have an idea on a spectrum, but it's not really well-defined. So the goal of this video is to walk you through in detail good risk versus bad risk with examples. And then at the end of the video, I'm going to go through some best practices that I've learned from trading over the years. What's up everybody? Welcome back to all the outliers and a shout out to the Patreon family. You guys make content like this possible for everybody else. So thank you for the support. Let's get straight into it. So first let's start with level setting. How do we make money in the markets? Well, really there's these two broad buckets. You can either earn the risk-free rate, so kind of government bond investing, something like that, which is seen as very, very low risk, which typically will correspond to pretty low returns. Or you can take risk of some sort. You can take speculative risk and guess on a direction. You can offload risk for another trader by assuming their risk via selling cash-secured puts, where somebody's buying puts for protection and you're selling them. There are lots of different ways to take risk. But the idea here is for us to understand the difference between good and bad risk and then most importantly, to understand what our individual risk profiles are. So for the",
    "metadata": {
      "video_id": "felr_mdjCKI",
      "title": "The Trader’s Guide to Effective Risk Management",
      "url": "https://www.youtube.com/watch?v=felr_mdjCKI",
      "upload_date": "",
      "duration": 585.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=felr_mdjCKI&t=0"
    }
  },
  {
    "text": "where somebody's buying puts for protection and you're selling them. There are lots of different ways to take risk. But the idea here is for us to understand the difference between good and bad risk and then most importantly, to understand what our individual risk profiles are. So for the next part of this, I want you to think about yourself. How do you think about risk? Because most people fall closer to one of two spectrums. Either you're very risk-averse. You don't want to take risk. You look to hedge risk at most opportunities. And unfortunately, this typically means you're not going to make any money. Because as you hedge all of this risk, all of that incurred cost, which pretty much moves you closer to this risk-free rate. Or you could be the kind of person that's very risk-open. You don't really think about it, probably not as much as you should. And sooner or later, you put on risk that you didn't fully think about and it runs you over and eviscerates your account. The idea here is to fall somewhere in the middle. Because notice here how I have R to R. This is risk and this is reward. Risk and reward are intimately tied to one another. It's not a one-to-one relationship. You can find really great risk opportunities, which we're going to talk about. Whoa, whoa, whoa, whoa. Here I come. Oh, here I come. Oh. But in general, you would do well to",
    "metadata": {
      "video_id": "felr_mdjCKI",
      "title": "The Trader’s Guide to Effective Risk Management",
      "url": "https://www.youtube.com/watch?v=felr_mdjCKI",
      "upload_date": "",
      "duration": 585.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:01:04",
      "start_timestamp_seconds": 64.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=felr_mdjCKI&t=64"
    }
  },
  {
    "text": "this is reward. Risk and reward are intimately tied to one another. It's not a one-to-one relationship. You can find really great risk opportunities, which we're going to talk about. Whoa, whoa, whoa, whoa. Here I come. Oh, here I come. Oh. But in general, you would do well to assume, if you see a big reward, there's probably a correspondingly-sized risk somewhere close by that you may or may not see. So the idea here is to see where you fall on this scale and then to create structures that allow you to operate effectively, given how you feel about these two extremes. So remember, as we go through this, not all risk is created equal. And the markets are indifferent to your perception, your preferences, none of that matters. The risk is going to be whatever the risk is. So let's talk about bad risk. The very first thing I have for you here is undefined risk. So what does that mean? Does that mean that I think every trade you put on has to be a vertical spread or something that has structurally defined risk? No, that's not what I mean. So take, for example, this vertical that we have in AMD. Instead of trading a vertical spread, which if you know anything about me, you know, actually don't like these. What do you hate me? You can manage risk a lot of other ways. You could define a period that if it gets to that point,",
    "metadata": {
      "video_id": "felr_mdjCKI",
      "title": "The Trader’s Guide to Effective Risk Management",
      "url": "https://www.youtube.com/watch?v=felr_mdjCKI",
      "upload_date": "",
      "duration": 585.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:02:07",
      "start_timestamp_seconds": 127.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=felr_mdjCKI&t=127"
    }
  },
  {
    "text": "that we have in AMD. Instead of trading a vertical spread, which if you know anything about me, you know, actually don't like these. What do you hate me? You can manage risk a lot of other ways. You could define a period that if it gets to that point, you get out. So let's say in this example, you sell this short putt. Let's say it's not cash secured. And you're not wanting to take assignment. You can pick a point that you say, okay, if it gets below 80, I'm going to get out. And then you can validate that point. You could say, okay, if I look at a chart, do I think this gives the trade enough room to move? And if it gets down here, do I think that I'm adequately proven wrong? This happens to be below six month lows. In that case, that would probably be a really effective place to define your risk. So even in undefined risk trades, you can define your risk. The next is unknown risk using AMD again. Let's say in this trade, you wanted to put on this 24 November vertical short putt, whatever it is. But you didn't know I had earnings today. That is an unknown risk that you exposed yourself to. So we have to work around that. We have to think about different common sources of risk that you might not know about and make sure we check for them. You can create",
    "metadata": {
      "video_id": "felr_mdjCKI",
      "title": "The Trader’s Guide to Effective Risk Management",
      "url": "https://www.youtube.com/watch?v=felr_mdjCKI",
      "upload_date": "",
      "duration": 585.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:03:17",
      "start_timestamp_seconds": 197.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=felr_mdjCKI&t=197"
    }
  },
  {
    "text": "you didn't know I had earnings today. That is an unknown risk that you exposed yourself to. So we have to work around that. We have to think about different common sources of risk that you might not know about and make sure we check for them. You can create a trading checklist that allows you to look for these things. Another great example of unknown risk is let's say that you wanted to trade intraday SPX options and you didn't know FOMC was that day. That's another unknown risk that you're stepping in front of that you're not acknowledging. You don't know it's there. That's a problem. So we have to make sure that in our trading process, we have a way to identify most sources of risk. There is going to be risk you cannot control. That's okay. That's part of the game. But the idea is we want to know about almost all of it if possible. Then we have misunderstood risk. This comes in many different forms. So for example, a common misunderstood risk is that if we look at this vertical in AMD, people will assume that this is a safer trade than just selling the short putt. That's not necessarily the case because the cost to hedge via this long putt in the long run, this trade might actually not even be positively expected, meaning it can lose money in the long run compared to this one. So when we're thinking about risk, you",
    "metadata": {
      "video_id": "felr_mdjCKI",
      "title": "The Trader’s Guide to Effective Risk Management",
      "url": "https://www.youtube.com/watch?v=felr_mdjCKI",
      "upload_date": "",
      "duration": 585.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:04:21",
      "start_timestamp_seconds": 261.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=felr_mdjCKI&t=261"
    }
  },
  {
    "text": "the short putt. That's not necessarily the case because the cost to hedge via this long putt in the long run, this trade might actually not even be positively expected, meaning it can lose money in the long run compared to this one. So when we're thinking about risk, you have to think about this idea of catastrophic risk. If there's a big move, but then also the systematic risk. What does this do if we deploy it in the long run? This is also very akin to the common idea that really high probability strategies make money. That's also not so much the case. You can have something with the 90 plus percent win rate. But if the metrics of the trade in terms of average win size versus average loss size don't make sense, even with the 90 percent win rate, you can still lose money. So that leads us to this idea of good risk. I was sprinkling this in as we ran through the other scenarios. So the very first thing, a good risk is one that is defined. So if we're to trade this cash secured put or naked short putt in AMD, defining that risk, that's a good risk to take because then we can analyze that defined risk that we're setting compared to the profit potential and see if it makes sense. Next is unknown risk. I call this research risk, but essentially this is just where we don't have things sneaking up",
    "metadata": {
      "video_id": "felr_mdjCKI",
      "title": "The Trader’s Guide to Effective Risk Management",
      "url": "https://www.youtube.com/watch?v=felr_mdjCKI",
      "upload_date": "",
      "duration": 585.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:05:34",
      "start_timestamp_seconds": 334.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=felr_mdjCKI&t=334"
    }
  },
  {
    "text": "risk, that's a good risk to take because then we can analyze that defined risk that we're setting compared to the profit potential and see if it makes sense. Next is unknown risk. I call this research risk, but essentially this is just where we don't have things sneaking up on us. So again, if I'm trading AMD, I know to look. When does it have earnings? Does it have any big news that's on the roadmap that's going to happen while I'm in the trade? And then we have misunderstood versus accepted risk. You can have, for example, risk in an earnings play, where there's an overnight move that's really big. If you accept that risk as part of a broader system and it still makes sense, that's a great example of accepted risk. It's something that you've analyzed, even if that risk is realized in a broader system, it still works out okay. It still makes sense. That is an example of good risk. Another great example of good risk is when you can create an asymmetric return profile. I have a recent trade that I talked about in another video in the VIX. That was a VIX ratio called diagonal where I was trading this to the upside. When I was placing this trade, it was on the 15th of September, just as the market started, well, the market was very, very relaxed, but the VIX fell below 13. So to me, that was as spot I",
    "metadata": {
      "video_id": "felr_mdjCKI",
      "title": "The Trader’s Guide to Effective Risk Management",
      "url": "https://www.youtube.com/watch?v=felr_mdjCKI",
      "upload_date": "",
      "duration": 585.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:06:44",
      "start_timestamp_seconds": 404.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=felr_mdjCKI&t=404"
    }
  },
  {
    "text": "ratio called diagonal where I was trading this to the upside. When I was placing this trade, it was on the 15th of September, just as the market started, well, the market was very, very relaxed, but the VIX fell below 13. So to me, that was as spot I was interested in getting long. Long story short, I looked at the upside potential, compared to what I considered to be the near term downside potential, where I was defining the risk in the trade. And this was essentially the downside risk I was accepting, about a dollar move in the VIX to the downside, compared to what I thought could be an 8 plus move to the upside. That's an asymmetric return profile that was created by defining the risk. That is another great example of good risk. So let's talk about some best practices. First, probably guess this. Every single trade that goes on needs to have risk defined. It doesn't always have to be structurally defined, but you have to define it as a trader. The second thing is we researched the potential risk to the trade, so that we know about them at least. And then we can assess the overall risk reward profile of the trade to make sure it makes sense. That is an idea that most traders forego, because they will look at something like a high win rate, and they're automatically on board, because they just think it's a high win rate.",
    "metadata": {
      "video_id": "felr_mdjCKI",
      "title": "The Trader’s Guide to Effective Risk Management",
      "url": "https://www.youtube.com/watch?v=felr_mdjCKI",
      "upload_date": "",
      "duration": 585.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:08:00",
      "start_timestamp_seconds": 480.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=felr_mdjCKI&t=480"
    }
  },
  {
    "text": "we can assess the overall risk reward profile of the trade to make sure it makes sense. That is an idea that most traders forego, because they will look at something like a high win rate, and they're automatically on board, because they just think it's a high win rate. How could you lose? You can still lose money long term. That's why it is so important to look at the risk reward profile and the expected return of that strategy over the long run. So that's a general rundown of good versus bad risk. If there's anything I missed, throw it in the comments below. Don't forget, like, subscribe, be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "felr_mdjCKI",
      "title": "The Trader’s Guide to Effective Risk Management",
      "url": "https://www.youtube.com/watch?v=felr_mdjCKI",
      "upload_date": "",
      "duration": 585.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:09:04",
      "start_timestamp_seconds": 544.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=felr_mdjCKI&t=544"
    }
  }
]