[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you there you u u program a sometime ca Actually, this kind of got crazier. So the front expiration has fallen off now. And before this was like 900 and something thousand calls, if I'm not mistaken, and I don't remember what the parts were. Maybe high twos. I don't think they were over three. I think it was like maybe high twos. And we are we're seeing like really, really interesting positioning. I think this 17 Jan expiration is going to be spicy. This is not the same thing. I hope it's not being perceived as the same thing as all these people that are calling like, you know, quote unquote, hype dates or whatever. Like that is not my bag. All I'm saying is that they're the reason why I say that is because there are a ton of fucking options in this expiration. A ton. That tends to lead to slightly skewed slash interesting market behavior. We tend to see moves get slightly more exacerbated because take a look at this of the remaining 829,000 calls. 485,000 of them are for this coming week. So this is why this is going to be a pretty spicy week, I think. Now I have no idea what the latest hype dates are. I have to",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=0"
    }
  },
  {
    "text": "more exacerbated because take a look at this of the remaining 829,000 calls. 485,000 of them are for this coming week. So this is why this is going to be a pretty spicy week, I think. Now I have no idea what the latest hype dates are. I have to be honest. I was tracking them for a little while and then I just stopped. I had a tracker that I built for it. And the reason why I stopped doing it is because I was having a hard time understanding the legitimacy of the hype dates as compared to people that are just throwing names out or dates out. The reason why I say that is when I see it on like Superstank, there's obviously a massive incentive for lots of people to try to guess when the next squeezes, right? Because then you look like genius. And it's also the kind of thing that you can guess 99 days and they can all be wrong. And if you get one, that's right. That's all you're going to talk about. That's what people will remember, right? So it's a really asymmetric way to try to gain glory, so to speak. But what I was doing is I was creating a tracker. I actually had a web scraper that was going through Superstank in pulling the name of the author down the hype date, whatever it was. And that's about all I could get and then a link to the",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 57,
      "start_timestamp": "00:13:28",
      "start_timestamp_seconds": 808.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=808"
    }
  },
  {
    "text": "speak. But what I was doing is I was creating a tracker. I actually had a web scraper that was going through Superstank in pulling the name of the author down the hype date, whatever it was. And that's about all I could get and then a link to the post. And one, there's a shit ton of different people, but people also regularly change their dates. So it was very difficult for me to come up with anything meaningful other than lots of people are guessing, lots of dates, right? Like that's genuinely what I clearly could come up with from a statistical perspective. Now what I wish I knew were some of the actors. I wish I knew what the different participants were, like who they were, and to try to discern between people that are actually doing research versus people that are just throwing dates out there. But I don't have that context. Shinnossu says, saw two contrasting theories. If we are printed for equal, volume or price should start picking up on Wednesday. If Rally is over, we might dip below 200 day moving average. What is this for equal? What is that? What's equal? Do you just mean equal in the standard term? Or does that mean something specific in this case? And why Wednesday? I want to understand both of those more. Zacharias says, geez, Herman Miller going top tier. Yeah. So here's the deal. The Herman Miller chair, honestly, is pretty nice. I",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 57,
      "start_timestamp": "00:14:29",
      "start_timestamp_seconds": 869.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=869"
    }
  },
  {
    "text": "you just mean equal in the standard term? Or does that mean something specific in this case? And why Wednesday? I want to understand both of those more. Zacharias says, geez, Herman Miller going top tier. Yeah. So here's the deal. The Herman Miller chair, honestly, is pretty nice. I had that one for a long time. I got my wife slightly different. One, it's kind of like a, like a bar stool one almost. And the chair that I'm sitting in right now is a steel case. And this one is okay. Here's the deal. When you have a little bit more money, you can tinker with stuff like this. But it doesn't make a fucking difference. I don't really, I think if I sat on five different chairs, I might be able to say like this one's comfortable, this one's not. But paying two grand for a chair, it's just, it's like the same thing with cars. Like get what you like. But I don't think that there's any significant value in like the hyper expensive stuff. One of the ones I do want to try is there's like these stools that put you in like a more upright posture. I actually really, really want to try one of those. I actually have one of those on the way. And probably what I'll do is I'll have two chairs. I'll have one like this for just, you know, this kind of sitting and then have the other one.",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 57,
      "start_timestamp": "00:15:52",
      "start_timestamp_seconds": 952.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=952"
    }
  },
  {
    "text": "upright posture. I actually really, really want to try one of those. I actually have one of those on the way. And probably what I'll do is I'll have two chairs. I'll have one like this for just, you know, this kind of sitting and then have the other one. But okay. So let's see. Jotatus is equal to the squeeze moving, being similar 2021, moving in dates from what I understand. Okay. A repeat of 2021. Got it. I see. I don't understand. I don't get that perspective. Yeah, I honestly don't get that perspective. Like what, let me see. Maybe, maybe I can understand better. Give me a second. I'm going to grab what's the fucking charting website trading view? And I'm going to go, this one's just easier to look further back. I want to see if I can see what everybody else is talking about here. All right. Let's see. We can put it like right there. So this is a one year daily. And right now we're saying that this looks similar to 2021. So let's see. I'm going to get that off. So what I'm doing is I'm just cutting off some of the squeeze parts so that we have a slightly more accurate view of stuff. And then what the hell? This is kind of the fun part of using this same Google sheet for like all these different notes and stuff is I get to come into like surprises of stuff that",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 57,
      "start_timestamp": "00:17:07",
      "start_timestamp_seconds": 1027.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=1027"
    }
  },
  {
    "text": "squeeze parts so that we have a slightly more accurate view of stuff. And then what the hell? This is kind of the fun part of using this same Google sheet for like all these different notes and stuff is I get to come into like surprises of stuff that I don't really know what it is. All right. So let's do this. And I'm going to add a new sheet. And let's take a look at this. This will be 2021 one year daily free. Okay. So here we have 2021 now. Let's go to present. We're way to like fast forward to present. Let's do it. It will. That's great. We'll grab the whole thing just like last time. And let's. We just down just a bit. What I'm doing right now is I'm going to try to compare these like actually compare them. One of the things I notice people do in general, this isn't just game stop people. This is just people I see in the market in general. They have really, really strong confirmation bias where there's something in our mind that we want to see. And then we go looking for that thing. That's exactly what happens a lot to people. And I want to see if that is the case here. So this will be 11 Jan 2025 year to date. I'm sorry. 11 year daily. And then this way we'll be able to look. I let's take a peek. And maybe I'll",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 57,
      "start_timestamp": "00:18:46",
      "start_timestamp_seconds": 1126.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=1126"
    }
  },
  {
    "text": "exactly what happens a lot to people. And I want to see if that is the case here. So this will be 11 Jan 2025 year to date. I'm sorry. 11 year daily. And then this way we'll be able to look. I let's take a peek. And maybe I'll take one more snap that gets red of the squeeze. So that we don't have that skewing the distribution of the chart. And then I'm just going to. So what do we notice? My first opinion is the entire basis of the chart looks completely different to me. And let's take a look together. This will actually be, oh, this will actually kind of an interesting use for this. Also my wrist feels so naked. When I sit down like this a lot of times I'll charge my watch. And it's so strange not having my watch on feels bizarre. What I'm going to do first is literally just start from here and draw a general line that follows price itself. This is meant to indicate a gap down. Because now if I scroll down to this. I can overlay it. So. This immediate looks completely different. This includes the squeeze though. So let's get rid of that. And let's chart it chart it on this one. So here's what I see from an eyeball that looks similar. The oops. I'll do it in like pink so that it's a comparison. This just the slope the broad slope. That's it.",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 57,
      "start_timestamp": "00:20:44",
      "start_timestamp_seconds": 1244.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=1244"
    }
  },
  {
    "text": "squeeze though. So let's get rid of that. And let's chart it chart it on this one. So here's what I see from an eyeball that looks similar. The oops. I'll do it in like pink so that it's a comparison. This just the slope the broad slope. That's it. That slope to that slope that looks similar. But as you can tell like it's missing very, very clear defining features. Right. If we were to overlay these against one another. The beyond the general slope that we're seeing. And then we're going to go back to this. The overall trend. I don't actually think these look. Accessively similar. So now. Let's see. What the volume looks like. So I'm going to go back up to this. Get our yellow line to match just like that perfectly. And then let's draw. Here we go. Let's draw volume now. In the case you guys didn't know. Obviously this is just an excuse for me to draw, which is funny enough. I hate drawing. I really, really. I'm like the least artistic dude on planet earth. And what I'm doing is I'm just going to denote days that have higher. Like higher than average volume like that. So like this. This is excessive volume. There's actually a smart way to do this. Oops. I'm just going to draw an actual line. Like that. And now what we'll do. Is grab the spots. We're volume is taking up. And I'm going to line",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 57,
      "start_timestamp": "00:23:18",
      "start_timestamp_seconds": 1398.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=1398"
    }
  },
  {
    "text": "than average volume like that. So like this. This is excessive volume. There's actually a smart way to do this. Oops. I'm just going to draw an actual line. Like that. And now what we'll do. Is grab the spots. We're volume is taking up. And I'm going to line this up generally with the access there. And then we're going to draw volume. Yeah. I mean, I don't see it. Just objectively speaking, I don't see it. What is the. Shannasu says not saying as any basis just repeating what I've heard. No, no, no, I appreciate it. That's that's exactly what I ask you guys to do. I want to be clear. Like I'm not in here to try to prove or disprove shit. I'm just trying to analyze and understand like that is my objective. Shannasu, you did exactly what I asked you to do, which is just share what you're hearing and seeing. So I'm very appreciative, right? Because we had a chance to take a look at this together and see, right? Because I don't know. And that's that's literally the entire point. The only way that we get to find out this stuff is by looking. So yeah, no, thank you very, very much for for sharing it. Mostly about RSI averages. And big op-x coming up, heard Newton and Michael looking at those points might have to ask them. Chris says looks the same. It really doesn't look the same though. The thing",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 57,
      "start_timestamp": "00:24:56",
      "start_timestamp_seconds": 1496.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=1496"
    }
  },
  {
    "text": "by looking. So yeah, no, thank you very, very much for for sharing it. Mostly about RSI averages. And big op-x coming up, heard Newton and Michael looking at those points might have to ask them. Chris says looks the same. It really doesn't look the same though. The thing that when we say look the same, we have to be thoughtful about what were what were actually looking at. Chris says overlay. I just did that. Here. We can overlay it on this one. So this is the one that includes the squeeze and then we'll look at the other one. And Joe Dirt says looks the same but different. That's exactly and I couldn't agree more. What what the chart shows us. You want to look at this one. Yeah, cool. Let's take a look at this one. What the chart shows us is something that's exhibiting positive drift. And I'll show you my point. I can grab a handful of different stocks. And Chris says back it up five candles. See like that's the thing. You can't you can't do that. Right. That's that's not how comparing things like this work. You have to keep it the same. So this one is this one is actually the same. This is analyzing this is comparing apples to apples. This is a one year daily before the last squeeze that we saw. This one and that's what this line is matched to. This one is a full one year",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 57,
      "start_timestamp": "00:26:58",
      "start_timestamp_seconds": 1618.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=1618"
    }
  },
  {
    "text": "same. So this one is this one is actually the same. This is analyzing this is comparing apples to apples. This is a one year daily before the last squeeze that we saw. This one and that's what this line is matched to. This one is a full one year daily. Up until today. Right. So like you can't you can't say oh, shift it. This amount or you know make it slide this way because that is exactly what I'm talking about in terms of pattern seeking and overfitting. That's one we're trying to make it look like what we want it to look like. Which again, like the true comparison here is drawing this line just like this. And then overlaying it with this. Chris says it's doing the same thing though. I mean it objectively isn't I don't know how you could I don't know how you could say that. So if I draw this one. And then we'll overlay it on the prior one. Oops. We're going to have to do that over again. Because we went. Parabolic. There. So let's take a peek at these two lines. And what I'll do to make it look a little clear is I'm just going to fill all this with black. Those two lines aren't doing the same thing. The only thing that these two lines are exhibiting that looks partially similar. Is this stage here. This stage represents positive drift right the overall trend. But if we",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 57,
      "start_timestamp": "00:28:36",
      "start_timestamp_seconds": 1716.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=1716"
    }
  },
  {
    "text": "a little clear is I'm just going to fill all this with black. Those two lines aren't doing the same thing. The only thing that these two lines are exhibiting that looks partially similar. Is this stage here. This stage represents positive drift right the overall trend. But if we look within this trend. Take a look at this kind of move completely missing from this. This kind of move completely missing from this. This peak and then try out completely missing from this entire section. This dip then run back up and I'm not looking to make it line up perfectly. I'm just looking at the overall size and scope of the movement on top of that. If I were to measure this size here. And then overlay it with this size down here. This is showing you the price movement of the stock. Right. So this is my point is that people have a propensity to try and make things be what they want it to be. What they want it to look like. And this is a normal human condition. It's a normal human trait. We all do it. The only way you. Short circuit it. You. Short circuit it. Is by knowing our brains want to do that and then doing something like this. Chris says the yellow line on the chart now chart is doing the same thing. It's not. Yeah, it's just not like I you can keep saying it but there's it's I",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 57,
      "start_timestamp": "00:30:23",
      "start_timestamp_seconds": 1823.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=1823"
    }
  },
  {
    "text": "Short circuit it. Is by knowing our brains want to do that and then doing something like this. Chris says the yellow line on the chart now chart is doing the same thing. It's not. Yeah, it's just not like I you can keep saying it but there's it's I just explained to you why it's not. The part that it is. Is the positive drift right so the fact that this is higher here and lower here right so this having this slope. And then this being lower here and higher here and this has this slope even from a slope perspective. It's different. Beyond the slope perspective what I want you specifically to key into is how the slope is occurring how it's showing up. This matters because this is showing you average daily range average true range which is volatility. If we take a look at this move comparatively it's way less volatile than this move comparatively completely different. So yeah the main thing is understanding like that the comment that I think who was it. Where is this. Yeah, Shinasu was saying they were the one that originally was saying that. You know people are saying that it looks like it's setting up like it did last time. So that's all we're looking to explore right like does that does that bear out does it look like it's setting up like it did last time. And I think from an objective standpoint it does not. This",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 57,
      "start_timestamp": "00:31:58",
      "start_timestamp_seconds": 1918.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=1918"
    }
  },
  {
    "text": "that it looks like it's setting up like it did last time. So that's all we're looking to explore right like does that does that bear out does it look like it's setting up like it did last time. And I think from an objective standpoint it does not. This does not look like what these two different lines look very very different in my opinion compared to what the prior squeeze looked like. Now what I am going to do though is kind of save this. So I'm going to get rid of all that and then I'm just going to add a couple labels. So this is 2025. And then this is 2021. And then we'll monitor it. Right we can keep an eyeball on it and see what it does actually look like because I again I genuinely am interested. So let's hide that now we should be able to paste it on like this. And then we'll keep it. We just have to get rid of all this. Resets there we go. Beautiful. BW says you were looking at the 24 squeeze not the 21 squeeze. This one. This is 21. Look, 2021. And then this is looking at today. So no BW I was looking at the this one is 2021. And then this one is GME today. Yeah. Anyways, the broader point is I think it's completely okay. Right. And this is what we should be doing. We should be analyzing this stuff. But",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 57,
      "start_timestamp": "00:33:42",
      "start_timestamp_seconds": 2022.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=2022"
    }
  },
  {
    "text": "is looking at today. So no BW I was looking at the this one is 2021. And then this one is GME today. Yeah. Anyways, the broader point is I think it's completely okay. Right. And this is what we should be doing. We should be analyzing this stuff. But the other thing I would definitely just offer to people is that the. I don't think trying to compare. And I think somebody else said it beautifully earlier. And I think that what I'm thinking is trying to compare what the setup looks like today. Compared to what the squeeze look like in 2021 it objectively doesn't really matter that. Pull up because the squeezes they're objectively not going to look the same. That's what makes them so interesting. So I think like even this lead in to this squeeze looked completely different than the lead in to the. And then the lead into the 21 squeeze right because the 21 squeeze is right after this right. It's it's up over here. And the lead in to the main squeeze was actually a declining slope that then rapidly accelerated up and out. So what's most important to me from just a charting perspective is just paying attention to what the chart is showing us at a point in time. Again, the most beautiful part about these kinds of movements and squeezes as a profit mechanism is they. They present similar traits every single time. One of those traits will be",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 57,
      "start_timestamp": "00:35:15",
      "start_timestamp_seconds": 2115.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=2115"
    }
  },
  {
    "text": "a charting perspective is just paying attention to what the chart is showing us at a point in time. Again, the most beautiful part about these kinds of movements and squeezes as a profit mechanism is they. They present similar traits every single time. One of those traits will be a price breakout. Another one of those traits will be massive spikes in volume. Another one of those traits is going to be the average daily range is going to expand across the overwhelming majority of these bars. Right. Same thing here. We come in quiet just like it was nice and quiet in here. The trend, the direction, the volatility, all that stuff looks slightly different. But the overall volatility, the overall volume looks very similar. Then all of a sudden we see a kick up in volume and we see the bars, meaning average daily range rapidly expanding compared to the prior timeframe, not comparing it to the 21 bars. And that's what we do here. We compare these bars against these bars. That's how we visualize volatility. That has happened for every single squeeze that has ever happened. But especially in GameStop because we analyzed every single squeeze that GameStop has had and what things looked like leading into the squeeze. This is actually why, in my opinion, the exploration of all these different cycle theories and these settlement theories and all of those functions are very interesting. But from a trading perspective, in my opinion, they're",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 57,
      "start_timestamp": "00:36:49",
      "start_timestamp_seconds": 2209.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=2209"
    }
  },
  {
    "text": "squeeze that GameStop has had and what things looked like leading into the squeeze. This is actually why, in my opinion, the exploration of all these different cycle theories and these settlement theories and all of those functions are very interesting. But from a trading perspective, in my opinion, they're completely useless. And the reason why I say that is because it's a really complex way to try to analyze something that we can see present much simpler. We can see it present much simpler when we see volume starting to break out when we see the candles starting to expand when we see price breakout from recent consolidation. We can see all that. So it doesn't matter what the settlement timeframe is. It doesn't matter if it's T 35 T 36 and if there was a holiday in it, it's here. I can see it. So while we go through these, I would just remind you of that fact because even though I truly am fascinated by the settlement and the cycle theories, I'm fascinated from that not from the perspective of how can I use that to predict the movement. I don't care to do that. I don't have to do that with that. I like analyzing that because I am just genuinely interested in those in the market mechanics behind it. You have to remember from my perspective, I've been trading. I just wrapped up my 18th year. This is kind of like people that do something",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 57,
      "start_timestamp": "00:38:08",
      "start_timestamp_seconds": 2288.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=2288"
    }
  },
  {
    "text": "have to do that with that. I like analyzing that because I am just genuinely interested in those in the market mechanics behind it. You have to remember from my perspective, I've been trading. I just wrapped up my 18th year. This is kind of like people that do something for a long time. You have to start looking at weird niche things to stay interested because you've seen so much of it so frequently. So that's why that the settlement and that stuff is so fascinating to me because that element of market mechanics is so curious. But from a trading perspective, it's much simpler than that. We track those three things. And between those three things, you're going to get stopped out a lot. It's not always going to work. But you'll, if you trade enough of them, you'll catch the bigger moves. That's the way that I look at it. So like, for example, there's a reason why for the game stop coverage strangle that I have on right now that I've been reporting out to you guys. I think it's still in here. Hold on. I literally think it might be in here. This. Keep forgetting like the links. Don't carry over for some. Take a look. 8 November 24. If we take a look at this chart and we say, where's 8 November 24? Where do we think? Right here. And why did I buy shares here? Well, I bought shares because it started rallying",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 57,
      "start_timestamp": "00:39:28",
      "start_timestamp_seconds": 2368.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=2368"
    }
  },
  {
    "text": "like the links. Don't carry over for some. Take a look. 8 November 24. If we take a look at this chart and we say, where's 8 November 24? Where do we think? Right here. And why did I buy shares here? Well, I bought shares because it started rallying up and out. It had a big breakout day on volume. That's why I bought shares. Did I know if it was going to be a squeeze or just a standard run up? No idea. But I'll play the move. So that's the point is if we apply the general methodology, it's going to serve you well, whether or not you catch a squeeze or not, whether or not you catch. So, I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 57,
      "start_timestamp": "00:40:35",
      "start_timestamp_seconds": 2435.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=2435"
    }
  },
  {
    "text": "a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one. I think it's going to be a good one In order to run one Stanley real short term price is actually anyone says Lei's 10,000 was a sharp asset. Even if he wants to refute these siblings from ANA or they're going to have any hand pick. It would be really a bad decision. I got a question. I picked up leaps in September. Do you think a certain kid he could have done the same still holding in September? When, uh, blond swasey, when did you get into him? We can take a look. Let me clear all this out and I have to close this program for now. September of this last year, I don't think so because I don't remember seeing anything that led me to believe he was sizing into anything like this at all. Let's take a look at all of September. And then let's look at all of that. Let's just",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 57,
      "start_timestamp": "00:41:24",
      "start_timestamp_seconds": 2484.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=2484"
    }
  },
  {
    "text": "program for now. September of this last year, I don't think so because I don't remember seeing anything that led me to believe he was sizing into anything like this at all. Let's take a look at all of September. And then let's look at all of that. Let's just look at the calls. Yeah, it's all baby size, literally for the whole month. So yeah, I don't think so at all. I don't, I don't see that. Um, you hold on, sorry. Did you mean in September? Yeah, okay. I'm just making sure I was looking at the same time for him. Yeah, no, I don't see this is all baby size. And a lot of this stuff is already gone. So yeah, I don't think so. Yeah, because a lot of this is already these bigger trades have already expired a long time ago. So I think this is way too small for anything that he would. These are, yeah, small trades. So no, don't see it personally. All right, cool. So back to the DD. Oh, yeah, I knew my notepad. Where we have 44. I'm starting to try to add timestamps during these to make it easier to follow along for you guys. This will be DD. Bro, hold on, give me one sec. Okay. So 808. 808. Hear me, please. Now this and then now we're at 4435. ED library review. Tweet. The hope is just to make the live streams easier for you guys",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 57,
      "start_timestamp": "00:42:28",
      "start_timestamp_seconds": 2548.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=2548"
    }
  },
  {
    "text": "easier to follow along for you guys. This will be DD. Bro, hold on, give me one sec. Okay. So 808. 808. Hear me, please. Now this and then now we're at 4435. ED library review. Tweet. The hope is just to make the live streams easier for you guys to follow along. All right. So let's take a peek. This is from Big Daddy Dave Lauer. I just did a podcast or a live stream with him last week. We do one typically like once a month together for urban finance. And as I always make sure to tell you guys, I am affiliated with them. I'm an angel investor in their company. I became an angel investor after I'd spoken with Dave a few times. He's just a super solitude. So I let that be known just because I think you guys should at least be aware of relationships and stuff like that. But it's literally just because I think what Irvin is doing is generally cool and I like Dave. Okay. So let's see. I'm just trying to get. Okay. Here we go. That's a. This is a very Dave intro. Lauren says Dave makes good pizza choices. Lauren, you are just trying to rage bait me and it's going to work. Dave has fucking ridiculously dumb pizza choices. And he also has completely, completely dumb, completely dumb expectations of steak, tall trash. So I think what we might have a problem with Dave is that he",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 57,
      "start_timestamp": "00:44:05",
      "start_timestamp_seconds": 2645.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=2645"
    }
  },
  {
    "text": "choices. Lauren, you are just trying to rage bait me and it's going to work. Dave has fucking ridiculously dumb pizza choices. And he also has completely, completely dumb, completely dumb expectations of steak, tall trash. So I think what we might have a problem with Dave is that he seems to be a general foodie and that's fine, but foodies tend to like everything. So you can't take his word for it because I had tried wagyu. I think I'm up to 12 times now because he has told me every time it's the greatest thing, it's so good. You got to get it. And every time I came back and I report back to him that it's straight trash, he's always just like, Oh, well, you got to try this. You got to get that. And then I'm like, bitch, I've tried every one of them now. I literally have tried one where they come out with like a sheet of paper that had pictures of the fucking cow, the individual cow and like the dude giving it beer and like massage is. And that was also straight trash. I take a Tomahawk every single day of the week over that, even a filet. So no way. Okay. And let's see. Thanks for joining. Okay. Okay. This is all his background. We already know that. So he went started. He traded at Citadel, which I think we know. Shinossu says wagyu is something I would try once if",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 57,
      "start_timestamp": "00:45:47",
      "start_timestamp_seconds": 2747.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=2747"
    }
  },
  {
    "text": "week over that, even a filet. So no way. Okay. And let's see. Thanks for joining. Okay. Okay. This is all his background. We already know that. So he went started. He traded at Citadel, which I think we know. Shinossu says wagyu is something I would try once if somebody else pays. Well, if you're out here in San Diego, I'll take you out for a steak dinner and you can try it and be disgustingly disappointed. I would actually rather pay for it than you pay for it because I wouldn't want to wait. I wouldn't want you to waste your fucking money on something like that. It's just rule. It's yeah. I'll take care of you if you come out here. Got the opportunity. Citadel. Yep. Went to New York, Chicago, wife, Citadel trading desk left. They went to he went to Austin trading, smaller firm, worked there for two years. I don't know if you guys know this stuff. I'm pretty familiar with his background. He and I have talked quite a lot. After trying to get involved making markets better, not really succeeding, intended on leaving finance, didn't like the industry, websites, CalBird, still in line. Hold the story of why I left high. If frequency trading, somebody on MPR heard an ask them to come on this program called market lace. Okay. So I did it was pretty cool. Suddenly people were really interested in talking to me, Senate SEC, some guys in New",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 57,
      "start_timestamp": "00:47:00",
      "start_timestamp_seconds": 2820.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=2820"
    }
  },
  {
    "text": "line. Hold the story of why I left high. If frequency trading, somebody on MPR heard an ask them to come on this program called market lace. Okay. So I did it was pretty cool. Suddenly people were really interested in talking to me, Senate SEC, some guys in New York. So he got sucked back in mostly just because of his background and his expertise and worked at IEX. Okay. Let's get. Oh, perfect. Here we go. Left for ethical reasons. What about your ethics makes you decide to leave after the flash crashes? Well, I went into high frequency trading with maybe an IV, naive, romantic notion. This is how you can make markets work. It's the lubricant on the gears of capitalism. If you're a believer in capitalism, which I was to a certain extent, still M, you believe that type of philosophy. The flash crash kind of opened my eyes to this idea that maybe the speed of technology in the incentives in the markets were making things a bit more fragile, rather than more stable and resilient, which is completely accurate. This is the entire crux and downside of high frequency trading is that their incentives grossly are not aligned with trying to build stability. And this is why we have things like spoofing, right? That doesn't add stability to anybody anywhere in any way. But nonetheless, it is a thing. So let's continue. Yep. CEO of Newfirm came out asking for any ideas regarding",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 57,
      "start_timestamp": "00:48:27",
      "start_timestamp_seconds": 2907.78,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=2907"
    }
  },
  {
    "text": "incentives grossly are not aligned with trying to build stability. And this is why we have things like spoofing, right? That doesn't add stability to anybody anywhere in any way. But nonetheless, it is a thing. So let's continue. Yep. CEO of Newfirm came out asking for any ideas regarding new regulations or thought at the markets. We're going to be getting involved. You're going to have to lobby and do this. So let me know if you have any ideas. Here are things I think we should change about markets. Literally, laughed me out of the office. Yeah. That's, that sounds right. So one of the reasons why you see this kind of behavior is because the incentives for markets still overwhelmingly line up with making as much money as you possibly can. And you don't really care if it's at the expense of you, somebody else, like as long as it's not at your expense, you don't really care. So this doesn't surprise me at all. This is a cutthroat industry. Okay. So Finra, the design, Finra's market regulation committee interested. We know about the SEC very tight-lipped regards, GME. What kind of role does Finra market regulation committee actually play in an advisory capacity for the market? So it's an advisory committee. It's not like the actual authority per se. There's some things that have to go through the committee before they can be proposed for public rulemaking. Just an opportunity to be in front of the",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 57,
      "start_timestamp": "00:49:43",
      "start_timestamp_seconds": 2983.38,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=2983"
    }
  },
  {
    "text": "committee actually play in an advisory capacity for the market? So it's an advisory committee. It's not like the actual authority per se. There's some things that have to go through the committee before they can be proposed for public rulemaking. Just an opportunity to be in front of the people of Finra who are policing markets, who regulate markets, who deal with enforcement and study markets. He likes it as an experience. Okay. So there are industry members who are broker dealers. So Finra is an organization that is funded by the broker dealers and regulates the broker dealers. The reason why Dave is saying it that way, he's making it clear. Right. There's an inherent conflict of interest there with those entities. You have industry members, non-industry, considered non-industry or independent meet three times a year, talk about rulemaking concerns for the Finra staff that they want the opinion on. Last couple of meetings have been very interesting. Not one to hold back or even be guarded about what I say because I don't care. Maybe this is what he felt like at the time, but this might have been before Irvin and stuff, but Dave is very thoughtful about what he says. And especially with Irvin. And the reason is because he has to be. There are different entities that are now involved with Irvin. One of the missions for Irvin finance is to try and connect the individual shareholders with the boards of the stocks that",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 57,
      "start_timestamp": "00:51:24",
      "start_timestamp_seconds": 3084.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=3084"
    }
  },
  {
    "text": "thoughtful about what he says. And especially with Irvin. And the reason is because he has to be. There are different entities that are now involved with Irvin. One of the missions for Irvin finance is to try and connect the individual shareholders with the boards of the stocks that they're a part of. So you can't, you can't be overly lost. I fear if you're trying to represent kind of that professional connection between verified stockholders and then the facilitating lines of communication between verified stockholders. And the companies that they actually hold. And okay, I don't make or lose money in any way from what happens. Just tell them what I'm thinking, which that makes sense. There are other members. They generally feel very differently and they can lead to some good conversation. He went on TV on BBC to talk about GameStop. First time been on live TV and the first time I had been on TV in quite a while. And if I'm on TV, you know, things are going weird or wrong. It's not like people call me up when things are going well. GameStop has been fascinating from the perspective of nutritional parts of the industry, which I tend to be tapped into. I've talked to lots of asset managers and other market trucker, ex-bit, fishy noddles, has been incredible to see it. So what he's just discussing here is the general interest and focus on GameStop. But here's what I've, here's what I've",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 57,
      "start_timestamp": "00:52:40",
      "start_timestamp_seconds": 3160.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=3160"
    }
  },
  {
    "text": "the industry, which I tend to be tapped into. I've talked to lots of asset managers and other market trucker, ex-bit, fishy noddles, has been incredible to see it. So what he's just discussing here is the general interest and focus on GameStop. But here's what I've, here's what I've generally picked up. It's like, it seems like stuff comes in vogue for a little while and then it just kind of disappears. This is like the standard US news cycle. This isn't really specific in my opinion to GameStop per se. So that part doesn't really surprise me to see him go on to these things and then come off of these things as the interest in the topics have been flow. But what is a little more interesting to me is the stuff that he talks about, it at least starts getting into the heart and soul of some more difficult conversations because talking about market manipulation and stuff like that is not easy and you have to have a pretty defensible position in order to be able to do it without getting crushed. So I, yeah, I think that stuff makes sense. Talk to a lot of people concerned about the way that apps are structured, the incentivized over trading. So this is talking about stuff like Robinhood, which anybody knows, anybody that knows what I'm about, you know that I hate Robinhood with a fiery passion. I think that they're straight garbage. So any opportunity to",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 57,
      "start_timestamp": "00:53:56",
      "start_timestamp_seconds": 3236.42,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=3236"
    }
  },
  {
    "text": "people concerned about the way that apps are structured, the incentivized over trading. So this is talking about stuff like Robinhood, which anybody knows, anybody that knows what I'm about, you know that I hate Robinhood with a fiery passion. I think that they're straight garbage. So any opportunity to reinforce that message of Robinhood being straight trash, I'm here for it. I think people have not been in a market crash, have no sort of understanding what that can be like. Yep, that's completely cracked. Um, he's not talking about game stop in that context, particular. Here we go. Predatory short selling or naked shortings a huge concern, which he and I have talked about quite a lot. Yep. I'm just going to flip to the TLDR on these because this just looks like he's kind of like recapping stuff, at least that most of us are aware of. If there's anything new in here for any of you, literally let me know. Tell me. Government regulators move at a snail's pace. It's not because they're corrupt necessarily, but because it's the way of doing things with regards. Yes. I agree here. Race to zero latency. So this talks about continuing to try and focusing on. Oh, this is cool. So he's talking about the overarching incentive for order flow to be much faster. And as that starts to happen, regulators have a hard time keeping up with it. They still employ archaic principles that made sense years ago,",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 57,
      "start_timestamp": "00:55:28",
      "start_timestamp_seconds": 3328.06,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=3328"
    }
  },
  {
    "text": "about continuing to try and focusing on. Oh, this is cool. So he's talking about the overarching incentive for order flow to be much faster. And as that starts to happen, regulators have a hard time keeping up with it. They still employ archaic principles that made sense years ago, but they hold back from having the best outcomes that we would achieve. Hypergoously trading in many ways can exacerbate extreme moves by people piling in. This is similar to when we talk about things like dealer gamma. It's very different in a nutshell, but it's a similar concept to dealer gamma where we have market participants from an institutional side, structural side that then exacerbate the very moves that their broader market is experiencing. Latency requirements and computational latency has increased over the last 15 years. There's a talk of microseconds for transactions. Yeah. BBO. Yeah, this one's funny. Shows quotes in the market. We got all these different exchanges, different bits and offers. The security information processor is the market data system for industry aggregates all that up. If it says, well, the best bid is on edge, the best offers on NIC. So the Mbbo is 0205. So it's just pulling the best quotes from different exchanges. That's the sip is the public data feed exchanges also have private data feeds are faster, show more information and high frequency firms all consume it. So these are lit exchanges. There's obviously you guys are familiar with these and",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 57,
      "start_timestamp": "00:57:01",
      "start_timestamp_seconds": 3421.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=3421"
    }
  },
  {
    "text": "So it's just pulling the best quotes from different exchanges. That's the sip is the public data feed exchanges also have private data feeds are faster, show more information and high frequency firms all consume it. So these are lit exchanges. There's obviously you guys are familiar with these and active price discovery. Yep. So the other exchange is providing a mechanism to do that. But then in dark pools and off exchange trading, you're trading within the Mbbo, you are free writing off that lit quote, you're taking advantage of it. So this is really interesting because the reason why he says this is the way dark pools operate. And this is a really broad misunderstanding for a lot of people in the broader trading community, specifically that follow stuff like GameStop. And let's let's talk about it. So what are you saying is that dark pools are using the lit exchange and BBO pricing as the basis for the transactions. So they're using that pricing, but they're not constraining themselves to the liquidity provided by that pricing. That's the whole point of going into a dark pool is you try to get larger orders filled all at once. So that you don't get pushed around in terms of your pricing. So what's really interesting about this is it's combining the benefits of two different things and you're literally using the lit quote as part of your negotiation process. But you're not penalized by using the lit quote because",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 57,
      "start_timestamp": "00:58:30",
      "start_timestamp_seconds": 3510.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=3510"
    }
  },
  {
    "text": "So that you don't get pushed around in terms of your pricing. So what's really interesting about this is it's combining the benefits of two different things and you're literally using the lit quote as part of your negotiation process. But you're not penalized by using the lit quote because you're going to try to transact through a dark pool which prevents you moving the market against yourself. Now one note is dark pools still have a really nefarious name. It sounds really bad and all that stuff. It does absolutely impact price discovery. However, dark pools still hit the consolidated tape. There is just a delay. So I'm not advocating for or against outright. There are pros and cons to dark pools and I understand why they exist. But it's not this black box that people think it is. Dark pool orders will still hit the consolidated tape. What does not hit the consolidated tape are internalized orders. That does not aid in price discovery whatsoever, at least in an immediate fashion. It still kind of does indirectly. But yeah. Okay. Did it a it can distance and advise market makers? Yeah. That's in fact what I think we're seeing market makers are disincentivized to post orders or post aggressive orders because they know if I post the best bid, then Citadel of Virtue is just going to execute an order based on my price and I'm not going to see it. So why should I improve the bid?",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 57,
      "start_timestamp": "01:00:04",
      "start_timestamp_seconds": 3604.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=3604"
    }
  },
  {
    "text": "seeing market makers are disincentivized to post orders or post aggressive orders because they know if I post the best bid, then Citadel of Virtue is just going to execute an order based on my price and I'm not going to see it. So why should I improve the bid? Yep. Completely completely agree. Lauren says they are only delayed a short time though, right? Yeah. Typically it's like six seconds. It's not long at all. Now it can be for like really big transactions. It can be longer than that. But the majority of the reporting from dark pools is pretty fast. I think it's very problematic leads to self similarity and does make markets more fragile because we incentivize speed. And we also, yeah, here, I'm glad he said this, captive order flow because it's not incentivizing price discovery. It's just essentially incentivizing the ability to transact. Completely agree. Let me see. You can imagine that when a broker do you like gets an order, they're going to be sending that order to all these dark pools at different places. The last place they send the order to is in exchange because the exchanges end up being the most expensive. Yep. They end up being called toxic venues, toxic exhaust venues, problematic. Here, this is the purpose of markets as we've talked about, especially if you're in the options 101, the options, the outlier options trading basics series that we just kicked off again last week. We talked",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 57,
      "start_timestamp": "01:01:37",
      "start_timestamp_seconds": 3697.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=3697"
    }
  },
  {
    "text": "most expensive. Yep. They end up being called toxic venues, toxic exhaust venues, problematic. Here, this is the purpose of markets as we've talked about, especially if you're in the options 101, the options, the outlier options trading basics series that we just kicked off again last week. We talked about the purpose of markets from the beginning. I'm seeing basically regulation, US, all the ex, this is a little bit different. It's more expensive to actually go direct to the exchange relative to go to a dark pool due to access fees. The fee cap of 30 cents per 100 shares implemented in 07 led to exchanges competing over rebates. IEX does not charge to the San only charge 8 cents per 100 shares on either side. This fee caps hasn't changed in forever leading to exchanges fighting over rebates. Let's see. Looks like Thor is ready to be let out, but before we let him out, I'm a grab him real fast so you guys can see him. Wait. Come here. Here he is. If you guys couldn't tell, he right now is all decked out. He has his sweater. He has his sweater cut. We also have these boots. Look at these boots. Hard to see. Look at these boots, bro. He looks so dumb. Look at these boots. He has these little tiny arms and then he has these blue fiasc feet. It's, I mean, this is like my favorite thing. I don't know. I've already",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 57,
      "start_timestamp": "01:02:54",
      "start_timestamp_seconds": 3774.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=3774"
    }
  },
  {
    "text": "these boots. Look at these boots. Hard to see. Look at these boots, bro. He looks so dumb. Look at these boots. He has these little tiny arms and then he has these blue fiasc feet. It's, I mean, this is like my favorite thing. I don't know. I've already said this. I don't know how I'm going to outdo myself next time with him to make him look even more ridiculous. I think it may be doing the mohawk with the boots. The boots just look absolutely absurd, which makes me interested in figuring out how to outdo it, but I got to pop the door from real quick. That's so awesome. I don't know how it could get better than that, but it's about as good as it could possibly get. Talk about short ladder attacks. Yes. Okay. Level two order books. You can grab that. I'm just going to skip to the end. Here we go. Press manipulation through short letter attacks are washing still active. Sure. Volume on a data, the daily basis, daily basis helps the tactic. Oh, here we go. This one we should, this one we should read. Okay. I think that spoofing and layering in markets is a big problem. So let me, I'm actually going to update the things. We're at an hour six thirty one, six thirty. Booping and layering. This one's important. So Dave says, I think that spoofing and layering is a big problem. I can say from",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 57,
      "start_timestamp": "01:04:38",
      "start_timestamp_seconds": 3878.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=3878"
    }
  },
  {
    "text": "and layering in markets is a big problem. So let me, I'm actually going to update the things. We're at an hour six thirty one, six thirty. Booping and layering. This one's important. So Dave says, I think that spoofing and layering is a big problem. I can say from the experience of constantly looking at a market data for those patterns and seeing them relatively regularly. Can you expand? So you're talking about looking at level two order book, which is the best bid and offer. The bid is the highest price somebody willing to pay. The offer is the lowest price somebody willing to sell and there's the spread between the bid and the offer. Trades will happen, but above that offer, you can have at each price level a certain amount of volume that somebody is willing to transact that. So as the price gets higher, you can imagine more and more people are willing to sell as the price get lower and more people are willing to buy. That's what makes an order book. So let me take a first pause here. Does this make sense? Can you visualize this in your brains? What does this say? Because if not, I can draw it out really quick. That's a really important point to understand how the order book actually sits. So what he's talking about is that at different prices, there's going to be different posted volume by whatever entities that are willing to transact at",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 57,
      "start_timestamp": "01:06:17",
      "start_timestamp_seconds": 3977.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=3977"
    }
  },
  {
    "text": "say? Because if not, I can draw it out really quick. That's a really important point to understand how the order book actually sits. So what he's talking about is that at different prices, there's going to be different posted volume by whatever entities that are willing to transact at those levels. And it will look different at different prices. So you can see that in a level two order book. I don't know if, let me see real quick. I'm just curious if... Yeah, okay. So here you go, right there. So this is for the equity itself, but this is literally a level two order book. And we can look through the broader book for different exchanges. But what this is showing you is from two different sides of the trade. This is showing you the bid. This is showing you the offer. This is showing you right now on the ARCA exchange. Somebody is offering 32-33 at two. So they're willing to trade two shares at 32-23. This is their bid. This is what they're willing to buy at. Right? So you can see it shows you the bid and the offer. The bid size, the ass size. Now take a look. If you take a look at the bid and the ask, it's these prices. 32-23 right there. And then 32-25 right there. So then it's showing you the relevant size for each of these positions. It's showing you that right now it's bid at two",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 57,
      "start_timestamp": "01:07:26",
      "start_timestamp_seconds": 4046.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=4046"
    }
  },
  {
    "text": "size. Now take a look. If you take a look at the bid and the ask, it's these prices. 32-23 right there. And then 32-25 right there. So then it's showing you the relevant size for each of these positions. It's showing you that right now it's bid at two offered at 16. That means you can get two shares at this price. You can get 16 shares at this price before it moves. Now the market's closed, which is why one, it's static and two. Why this is so empty. Normally this is much, much deeper than this. But yeah, there's actually exactly what the level to an order book looks like. So the, and then you can look at it for individual options and stuff too. So what I will do for that, if I'm interested, is I will send the individual option I'm looking at into the level two. So and this inherently is already showing you some of it, right? Because this is saying that for this 33 call, expiring 41 days to expiration, it's bid at 435 offered at 455. And then it gives me the size. I can get 55 of the bid at 435 before it will move. And then I can get 20 at 455 from the offer. That means I can lift the offer from there. So it shows you the depth of the market. So the reason why all of this matters from the context of this is because from",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 57,
      "start_timestamp": "01:08:44",
      "start_timestamp_seconds": 4124.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=4124"
    }
  },
  {
    "text": "435 before it will move. And then I can get 20 at 455 from the offer. That means I can lift the offer from there. So it shows you the depth of the market. So the reason why all of this matters from the context of this is because from a market making perspective and a market participant perspective, you want to be really, really careful with how much you show because not only are you presenting viable information for your ability to transact, but you're also showing other participants the information that matters. Okay, the trades will happen, but I think we already talked about that. Yeah, okay, we already talked about all this. So what's spoofing is so you can know the best, the way a high frequency trading system is calculating a micro price, for example, is the attempt. So say if the high frequency system says, okay, I think GME is worth 180 right now. And it's being bid at 179.80. I can say, well, I'm going to improve that bid right as I think it's worth 180. So I'm going to put a bid out there at 179.85. So a nickel above because I want people to sell it to me. And I want to buy it because I think it's going up to 180. And I think it's going to happen very quickly. So I'm only going to have to hold the inventory for a few minutes before it moves up a couple ticks",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 57,
      "start_timestamp": "01:10:02",
      "start_timestamp_seconds": 4202.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=4202"
    }
  },
  {
    "text": "people to sell it to me. And I want to buy it because I think it's going up to 180. And I think it's going to happen very quickly. So I'm only going to have to hold the inventory for a few minutes before it moves up a couple ticks as it does going to have my offers in there at 180. And as it ticks up, it's just going to lay off into that. I'm going to end up flat because most high frequency trading systems want to be flat. They do not want to take on inventory. They're operating on very tight, very tight time horizons, millisecond seconds, maybe minutes, but yeah, in high frequency trading, it's a long time. Does this next section make sense? What he's talking about is essentially the ability for high frequency trading algorithms to build a ramp for themselves. They already have a predetermined exit from their ramp. The one thing to keep in mind is that they still need price activity for the ramp to execute. Now what becomes really interesting is when there are multiple high frequency trading algorithms transacting against one another. What he's talking about in terms of high frequency trading, starting to add to overall market volatility and not adding a market resilience. Because if you have one system that's building a ramp for itself and you have another system that's trying to do something else and they're interacting with one another, it's essentially two robots going",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 57,
      "start_timestamp": "01:11:21",
      "start_timestamp_seconds": 4281.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=4281"
    }
  },
  {
    "text": "high frequency trading, starting to add to overall market volatility and not adding a market resilience. Because if you have one system that's building a ramp for itself and you have another system that's trying to do something else and they're interacting with one another, it's essentially two robots going back and forth. It's not actual price discovery. It's completely different. So this part is important to understand not only from the perspective of the individual high frequency trading firm and what it's trying to do, but then the broader point on the interaction between the high frequency trading firms. That's super, super important. Okay, let me get my dinner order launched off. We're already all set with it. Boom. We already hit all that. Okay, let me get caught up on the chat. Chicken nuggets says, hey, not sure if you already covered this, but what's up with the 125 put on GameStop? What do you think? We talked about the far out of the money's a few times. It's not real different from the other conversations with the far out of the money options. So that's a series of different behaviors. Part of it will be either used to create synthetic shares. Part of it will be used for hedging and offsetting positions. Part of it will be people speculating. So it's kind of a giant mixed bag of reasons why you'll see those being lit up pretty regularly. Michael says MFA closed at 95. I'm not worried",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 57,
      "start_timestamp": "01:12:32",
      "start_timestamp_seconds": 4352.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=4352"
    }
  },
  {
    "text": "to create synthetic shares. Part of it will be used for hedging and offsetting positions. Part of it will be people speculating. So it's kind of a giant mixed bag of reasons why you'll see those being lit up pretty regularly. Michael says MFA closed at 95. I'm not worried about MFA in this stream in particular. Once Waze says, I got another question. Why would a market maker offer 190 put for GameStop since October while the rest of the chain max is out in 45 in both ways. Okay, these days when you say max is out at 45 both ways. What do you mean by that? I don't know what that part means. Why would they offer? Could you rephrase your question? So the first question is what expiration are you talking about? You're saying since October. But what expiration are you referring to? And then I still don't know what both Waze means. I'm assuming you mean like 45 points up and down from at the money maybe. But I'm not positive. The answer anyways is easy. The answer is because there's demand for it. So market makers offer options that have demand. And the way that they gauge demand is by looking at what transactions are happening at what places. So Blondzweizi says it's laying in Schwartz European options. You've just added another complete layer of confusion. They are open end option. I literally have no idea what you're talking about now. What platform are",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 57,
      "start_timestamp": "01:13:47",
      "start_timestamp_seconds": 4427.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=4427"
    }
  },
  {
    "text": "that they gauge demand is by looking at what transactions are happening at what places. So Blondzweizi says it's laying in Schwartz European options. You've just added another complete layer of confusion. They are open end option. I literally have no idea what you're talking about now. What platform are you talking about looking at the chat? These guys? Okay. And so the reason why any sort of market maker offers options is because there's demand for it. So the answer remains the same. Now when it comes to max is out in 45 both ways. I don't really know what that means. I like because they will have more than that in other explorations. And I also don't know what expiration you're referring to. But yeah, that's the that's the cliff notes version is that it will absolutely just be because there's demand for it. I have no idea who these guys are though. I don't never use their stuff or it's so interesting because in other countries there's a lot more brokers in the US. It's very, very siloed. Okay. Back at it. Okay. Now if I know that okay. That's how an HFT works and I know it calculates a 180 micro price because it looked at all the bids on the market. Seems there are a lot more bids than offers. I can put in some bids and they're not the best bid. So I don't have as much risk of being executed on those orders.",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 57,
      "start_timestamp": "01:15:34",
      "start_timestamp_seconds": 4534.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=4534"
    }
  },
  {
    "text": "it calculates a 180 micro price because it looked at all the bids on the market. Seems there are a lot more bids than offers. I can put in some bids and they're not the best bid. So I don't have as much risk of being executed on those orders. But I could put in a huge number of shares a couple price levels down and create the appearance of demand. So this is where we're trying to manipulate where and why our counter parties. So in this case, if I'm a high for trading firm trying to compete against other high for trading firms, I can make their systems detect a large number of orders at a price that is just me trying to deceive them as they're being a lot of order there. So I actually don't want to transact at that level at all. I'm just laying that order in there with the expectation of taking it out before it moves there. So as he says, they're European options strikes don't go beyond 45. I don't see why there would be demand now. It could be a million reasons, but the demand is always relative to the individual. Right. So you have to take yourself out of your own perspective and then try to think of the board from other people's perspective and why they might want something like that. And probably some sort of hedging. Okay, that's going to make these all. Yeah, that's going to",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 57,
      "start_timestamp": "01:17:36",
      "start_timestamp_seconds": 4656.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=4656"
    }
  },
  {
    "text": "individual. Right. So you have to take yourself out of your own perspective and then try to think of the board from other people's perspective and why they might want something like that. And probably some sort of hedging. Okay, that's going to make these all. Yeah, that's going to make these automated systems think there is demand. So they're going to move up. But what I'm really trying to do is actually sell. So I'm trying to push the price up into my cell orders as a manipulator spoofer. That's why that's what the spoofing is layering is relatively similar. Yeah, boy. The broken part fallacy. Just like scanning through this. Okay, so in the flash class to say, oh, this guy is spoofing markets and that's why the market crash, but that's not how, yeah. I agree with this point, but that's not how nonlinear systems work. What he's talking about, and it's the same thing that I continually remind people of is markets are multifaceted. There's a lot going on at all different points in time. So this makes obviously a ton of sense to me because there's the illusion that, you know, one thing. That's greatly causes another thing. And that's just not how it works very frequently. There's multiple inputs into the system. Okay, there's a reason spoofing had that effect because the years regulation removed diversity for markets, led to a latency race fragment. Yeah, yeah. Flash crash is, yeah, okay. It doesn't have",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 57,
      "start_timestamp": "01:18:43",
      "start_timestamp_seconds": 4723.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=4723"
    }
  },
  {
    "text": "causes another thing. And that's just not how it works very frequently. There's multiple inputs into the system. Okay, there's a reason spoofing had that effect because the years regulation removed diversity for markets, led to a latency race fragment. Yeah, yeah. Flash crash is, yeah, okay. It doesn't have to be manipulative when we think liquidity, contagions or flash crashes are like these things you describe sometimes is just them pulling out. So of 90 of the quotes in the market are from high for goods or trading firms. Sometimes it's high is 99. And suddenly the volatility increases or the take on too much inventory. They need to stop trading, which is a little, which is a lot of what happened to an a flash crash. Proper in 2010. They'll just stop quoting and as soon as that. Suddenly that liquidity just starts disappearing. It's kind of like the facade of liquidity. It's not actually there. So I mean, maybe I'm not dismissing the possibility of manipulation because I see manipulation and markets, but sometimes it's also just sort of the feedback loop. Order types. Okay. As I said on Reddit, it's not limit and market. I was actually trying to put this picture, but I couldn't get it to work. So here is an ad liquidity only midpoint pass of liquidity. Intermarket sweep display limited to Tribunal non ISO. So very complex order types, many of which are dictated by the biggest customers of the exchanges, which",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 57,
      "start_timestamp": "01:20:27",
      "start_timestamp_seconds": 4827.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=4827"
    }
  },
  {
    "text": "actually trying to put this picture, but I couldn't get it to work. So here is an ad liquidity only midpoint pass of liquidity. Intermarket sweep display limited to Tribunal non ISO. So very complex order types, many of which are dictated by the biggest customers of the exchanges, which are those high for user trading firms. And it's not just retail that doesn't make use of them large broker dealers, trading for institutional firms don't make use of them the way they should. Do you know what an ad liquidity only post no preference blind order would do because not even NASDAQ knew what it would do NASDAQ got fine because they had some crazy complex order type that was messing with the priority in a way that they had not even imagined. That was discovered and self reported, but it's like that is complex. That is how complex things have gotten. So there are order types that do advantage firms. Yep, yep, yep, payment for order flow. I think we've probably beat this to an absolute bloody pulp. I don't think we need any of that stuff. Here we go. I think payment for order flow and the internalization of retail orders is terrible for markets and the thing about retail order flows that's referred to as uninformed. You're not informed about what's going to happen in the next 50 milliseconds when you think uninformed order flow. What it means what is about to happen in the market",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 57,
      "start_timestamp": "01:21:37",
      "start_timestamp_seconds": 4897.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=4897"
    }
  },
  {
    "text": "internalization of retail orders is terrible for markets and the thing about retail order flows that's referred to as uninformed. You're not informed about what's going to happen in the next 50 milliseconds when you think uninformed order flow. What it means what is about to happen in the market as far as high for user trading firm is concerned. And at that time, horizon, it's measured in milliseconds, maybe seconds, because the retail order flow is what market makers want to trade against. It's very profitable to trade against it. Obviously. And that's why these market makers pay the retail brokers for it because they want to get the order flow. An interesting paper just came out that showed the impact on markets is significant that when you take profitable order flow and you don't let it go to exchanges and interact with other orders on the exchange, you can be affecting this spread by as much as 25. Maybe more crazy. We can skip through this. So one thing to note about payment for order flow again that is worth noting is that payment for order flow has problems. It has no shortage of issues for sure. However, it does increase overall efficiency. It does to a degree. So I still think payment for order flow has a long way to go before it actually would make sense. But that's why you have market making firms fighting for retail order flow. Okay, here we go. This is the",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 57,
      "start_timestamp": "01:23:05",
      "start_timestamp_seconds": 4985.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=4985"
    }
  },
  {
    "text": "it does increase overall efficiency. It does to a degree. So I still think payment for order flow has a long way to go before it actually would make sense. But that's why you have market making firms fighting for retail order flow. Okay, here we go. This is the important differentiation here internalizers. So here we go. Long lines of internalization and dark pools. Two different things. Yeah, okay. So we already talked about all this. Off exchange volume 89 every time Citadel internalizes a trade it gets printed publicly every time Goldman Sachs of it. So we're going to execute a trade in their dark pool. It still gets printed publicly. So this is what I was talking about earlier about them hitting the consolidated tape. You guys already know that. Look at you guys go. You guys are already market wizards. Okay. No, so this is how much they're trading off exchange just OTC not ETF not dark pool. But I but I don't think Citadel is a material part of the ATS trading and GME. Interesting. Okay. You know markets simple. This is fucking crap. It's crazy. I X. Okay. You can get midpoint executions on I X. It's free for retail to trade on I X. They've really tried to do what they can do to incentivize retail brokers to come to them. It doesn't mean they are because they're are really fundamental conflicts interests in terms of payment for order flow. You can tell",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 57,
      "start_timestamp": "01:24:18",
      "start_timestamp_seconds": 5058.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=5058"
    }
  },
  {
    "text": "I X. It's free for retail to trade on I X. They've really tried to do what they can do to incentivize retail brokers to come to them. It doesn't mean they are because they're are really fundamental conflicts interests in terms of payment for order flow. You can tell your brokers and you should tell your brokers if you want to trade I. That's that they should route to I. So for those that don't know via a platform like think or swim, you can select your routing and you can you can pick I. X and a lot of times unfortunately it won't necessarily be the M.B. But you still know that you're getting a better overall fill. When flash voice came out created an uproar maybe is the second wave I wouldn't have gotten involved with I. X if I didn't believe what they're doing. Yeah, I agree. Oh, this so this part for we literally this is so funny we literally just talked about the I don't remember when this post is from but this post has to be like a couple years old. But the reason why I'm kind of chuckling here is we literally were just talking about this this last week. So the timing of this is hilarious to pop up on his his inclusion here also we're almost through this diamond handbook that's crazy we're going to have to get back to the broader news stand. Okay. If the exchange is faster",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 57,
      "start_timestamp": "01:26:07",
      "start_timestamp_seconds": 5167.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=5167"
    }
  },
  {
    "text": "were just talking about this this last week. So the timing of this is hilarious to pop up on his his inclusion here also we're almost through this diamond handbook that's crazy we're going to have to get back to the broader news stand. Okay. If the exchange is faster than it's fastest participants that repressing for peg order types will always happen before the high spree firms can adapt and pick off sale order types. That's why the 350 microseconds speed bump was put into place because it seemed like a good time for the exchange to be able to receive market data from all other exchanges updated price and shift for other firms could come in and pick off its sale prices, which makes a ton of sense. Very, very good. They did that. I think that kind of protection is valuable. I think execution quality and I X is very high we've seen the same thing in Canada with equitus and you believe in the model I'm a believer in the idea that you shouldn't offer rebates to track liquidity and I X does not do. Agreed. Okay. So. One of the things to know and I talk about this every time I talk with Dave is what Dave does is a discussed like just disgustingly. Thankless job and trying to do what they're doing with the SEC and with other government entities is unbelievably challenging like I literally don't envy him. I wouldn't do it. And",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 57,
      "start_timestamp": "01:27:08",
      "start_timestamp_seconds": 5228.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=5228"
    }
  },
  {
    "text": "talk about this every time I talk with Dave is what Dave does is a discussed like just disgustingly. Thankless job and trying to do what they're doing with the SEC and with other government entities is unbelievably challenging like I literally don't envy him. I wouldn't do it. And it's because it is the slowest most arduous process you can imagine, but for real change to occur that's the process. It's going to have to take it's going to be super super slow, which is annoying, but it is what it is. So I mentioned that because this is why I like Dave a lot and I like what he's doing because he's doing something that sucks. It's really long arduous arduous you don't get much out of it. So and then this I mean this is we've already talked about this looking through the prior dd library that the fines are absolute jokes. I made a video not that long ago hold on. This one. I don't know how to make the thumbnail show up. I shouldn't get copyrighted for this because this is my own shit. So I'm going to turn on the volume and we'll listen to part of this video together because it's. Oh, he sparred with Gaudio. Gordon smoked him. All right, you guys should have audio. What's up outliers quick market update and today it's a little bit of a somber one. We have some bad news. Unfortunately, our fan favorite Kenneth C",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 57,
      "start_timestamp": "01:28:14",
      "start_timestamp_seconds": 5294.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=5294"
    }
  },
  {
    "text": "to part of this video together because it's. Oh, he sparred with Gaudio. Gordon smoked him. All right, you guys should have audio. What's up outliers quick market update and today it's a little bit of a somber one. We have some bad news. Unfortunately, our fan favorite Kenneth C Griffin CEO of Citadel LC. It's a real bummer to see these kinds of things come down. It's a man Citadel securities are going to have to pay a one million dollar fine for allowed jid finra rule violations. And you think like how could this happen? Right. Ken obviously cares a lot. He's a man of the people and for me, I personally hate to see finra SEC bully people that take such good care of us. And see what this would look like for them. So we have Kenny G 43 billion. We have Citadel 64 billion. We have a regular US person might be about 100,000 right maybe total net worth something like that. And we have our really big bad fine right here. That's this one, which is a million dollars. So you this might look like the math hasn't started yet. It is it has we just actually need to add a couple more decimal places. So in putting this one million dollars in the context of Kenny G and or Citadel assets. This is what we have. So you click increased decimal places and you might think Eric there's an error with your formula.",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 57,
      "start_timestamp": "01:29:49",
      "start_timestamp_seconds": 5389.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=5389"
    }
  },
  {
    "text": "we just actually need to add a couple more decimal places. So in putting this one million dollars in the context of Kenny G and or Citadel assets. This is what we have. So you click increased decimal places and you might think Eric there's an error with your formula. Obviously that it's not mapping. You need to do the formulas. No, it's the formula is there. But we just actually just have to add more decimals to understand what percentage of their net worth this one million dollar fine represents. Let's let's just click it again. And it's like, oh no, Google sheets isn't loading at this point because it can't be that low. Could it? Then we'll click it again and there we go. So I told you it's working. I told you it's working just fine. 10. There's one million dollar fine would rep. So Dave's point. Obviously is wildly on point. So in that example for that million dollar fine, it literally represents 0.0016 of Citadel assets. I learned says Eric cracking himself up the funny thing like I'm actually not laughing at at me or the jokes I'm making. I'm laughing at how comical this it's a fucking it's a joke. It's an inherent joke by itself. The fact that they would come up with a million dollar fine on and like even if it went to Kenny himself right. The personal like a sold person. It's zero 0.0023 of his net worth like it's",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 57,
      "start_timestamp": "01:31:11",
      "start_timestamp_seconds": 5471.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=5471"
    }
  },
  {
    "text": "it's a fucking it's a joke. It's an inherent joke by itself. The fact that they would come up with a million dollar fine on and like even if it went to Kenny himself right. The personal like a sold person. It's zero 0.0023 of his net worth like it's crazy. So what I ended up doing is I'll show you equivalence here. Let's say that you're a no. So what I did for context is I still kept the 100,000 US basic person right seeing a person as a 100,000 net worth. I'm showing you what the fine what the equivalent fine is formal US equivalent. So much of which comes in at this percentage of. That's how much it would be. So it would be the equivalent of somebody who's worth a 100,000 paying a 1.56 for Citadel. And then it would be the same as a person worth 100,000 paying 2.33. In that nuts. That's some crazy shit. That is absolutely some crazy shit. So yeah, I mean. Dave's point here is so on point the fact that it is a it's just a straight joke. All right, here's our next leave off point. We will create a comment here. So this will be leave off point. And what is today 11 Jan. We'll get back at it. Sweet. All right, gang. That wraps me up. If you guys need anything, hit me up in the discord. Be an outlier, be an ape. Be whatever you want",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 57,
      "start_timestamp": "01:32:36",
      "start_timestamp_seconds": 5556.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=5556"
    }
  },
  {
    "text": "a comment here. So this will be leave off point. And what is today 11 Jan. We'll get back at it. Sweet. All right, gang. That wraps me up. If you guys need anything, hit me up in the discord. Be an outlier, be an ape. Be whatever you want to be. See you all later. Bye.",
    "metadata": {
      "video_id": "FfMgFRoJjzc",
      "title": "GME Top Theories Analysis Pt10 | GameStop Analysis Ep28",
      "url": "https://www.youtube.com/watch?v=FfMgFRoJjzc",
      "upload_date": "",
      "duration": 5690.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 57,
      "start_timestamp": "01:34:22",
      "start_timestamp_seconds": 5662.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FfMgFRoJjzc&t=5662"
    }
  }
]