[
  {
    "text": "What's up, outliers? Today we're going to talk about the weather, how nice the week was the fat. I'm obviously kidding. We're going to talk about GameStop today because things have gotten a little spicy. And I love this. I literally love this every time that it looks like GameStop starts slowing down, being a little bit sleepy. All of a sudden you get a day like this. And as you can tell, it just makes me smile. And we have to give shout out to my boy Jim Bulls from the discord who obviously dug this piece of gold up from one of the reddits. And I mean, it's beautiful, isn't it? It's exactly exactly what's going on here. So this move was really interesting, really interesting. And there are a few reasons why now let's start with what's been going on very quiet across the board, right? Volume quiet running below averages overall quiet. Then today we run into 61.8 million volume where the five day averages 18 mill and the 20 day average is 13 mill. So we got active. We got real, real active. And there's a lot of conjectures to what's going on because there's the at the market going on. And we don't know if where we're at in that process, we haven't really seen any information. So that could be part of what we're seeing here. But let's start with the dark pools. And then we will slowly, slowly move in because I",
    "metadata": {
      "video_id": "fGOxBtIqzBs",
      "title": "Analyzing Gamestop's Recent Surge",
      "url": "https://www.youtube.com/watch?v=fGOxBtIqzBs",
      "upload_date": "",
      "duration": 600.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fGOxBtIqzBs&t=0"
    }
  },
  {
    "text": "the at the market going on. And we don't know if where we're at in that process, we haven't really seen any information. So that could be part of what we're seeing here. But let's start with the dark pools. And then we will slowly, slowly move in because I also want to show you the options side of things because again, there's an interesting series of events going on. So let's grab GameStop. And then we're just going to look at today. And then let's sort this not by time, but let's sort it by premium. And you can see that we have some absolutely massive positions coming on today. There was 4.6 million shares traded to kind of kick us off in the morning. The overall premium there was 92 million dollars. And then we go 19 mills, 16 mill. And you can see a lot of this is throughout the day. But notice a lot of this starts kicking on in the afternoon. This is Pacific time, by the way. That's why you'll see like 1301, 1358. This is pretty much market close, which is very common to be clear. Like you'll very often see bigger orders towards market closes for liquidity reasons. This is very, very normal. But if we take a look at the kind of trades that came through, we see a lot of average price trades, which is really, really interesting because notice what the word picture here, it says a trade where",
    "metadata": {
      "video_id": "fGOxBtIqzBs",
      "title": "Analyzing Gamestop's Recent Surge",
      "url": "https://www.youtube.com/watch?v=fGOxBtIqzBs",
      "upload_date": "",
      "duration": 600.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fGOxBtIqzBs&t=0"
    }
  },
  {
    "text": "towards market closes for liquidity reasons. This is very, very normal. But if we take a look at the kind of trades that came through, we see a lot of average price trades, which is really, really interesting because notice what the word picture here, it says a trade where the price reported is based upon an average of the prices for the transactions and a security during all or any portion of the trading day. And it's because these are bigger positions. Like you're not going to put on, you know, a 4.6 million dollar position and just have it magically slide through, which is not how it works. So there were a ton, a ton of really big trades going on. Now a quick reminder, there's a difference between orders that go through dark pools versus lit exchanges versus orders that are internalized orders that go through dark pools still hit the consolidated tape. They're not internalized inherently. Now you can have internalized dark pool orders, but then you wouldn't see them because they're internalized. They don't hit any tape. So these will still hit the consolidated tape, which is exactly why we see the volume going absolutely bonkers as we look at this through like a time scale. Because again, this is going to track the cumulative volume as we move around. Right? So you see 34 million 56, but like it starts scaling meaningfully right into right into the end of the day. So fascinating, fascinating",
    "metadata": {
      "video_id": "fGOxBtIqzBs",
      "title": "Analyzing Gamestop's Recent Surge",
      "url": "https://www.youtube.com/watch?v=fGOxBtIqzBs",
      "upload_date": "",
      "duration": 600.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fGOxBtIqzBs&t=0"
    }
  },
  {
    "text": "bonkers as we look at this through like a time scale. Because again, this is going to track the cumulative volume as we move around. Right? So you see 34 million 56, but like it starts scaling meaningfully right into right into the end of the day. So fascinating, fascinating price movement here. Now this is what I'm also very excited about is if look at this, we have some pretty big trades coming on and they're not out into perpetuity. Right? This is looking at 18, on October 24th. And this is almost a half a million dollar in options. Somebody came in, they grabbed the 21 calls, they grabbed 2000 of them. And that is a not insignificant size trade. And then we can see essentially an hour directly before that, there was also something for the same expiration, the 18 ox. And we can see that it's a 250,000 trade. So we're starting to see some bigger trades in the front expirations. All three of these largest trades, options trades on the day are all in the front expiration 18, 18, oct. So now let's take a look at the options chain then and see what's going on here. First, let's take a look at volume. And you can see that big volume day, big volume day. So we have 516,000 calls traded against 107,000 puts. And the majority of the calls were at the offer or above, meaning we've bought them. And then the majority of",
    "metadata": {
      "video_id": "fGOxBtIqzBs",
      "title": "Analyzing Gamestop's Recent Surge",
      "url": "https://www.youtube.com/watch?v=fGOxBtIqzBs",
      "upload_date": "",
      "duration": 600.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fGOxBtIqzBs&t=0"
    }
  },
  {
    "text": "on here. First, let's take a look at volume. And you can see that big volume day, big volume day. So we have 516,000 calls traded against 107,000 puts. And the majority of the calls were at the offer or above, meaning we've bought them. And then the majority of the puts were actually at the bid or below, meaning we've sold them very bullish configuration across the board. Now, when I look across the volume, I can see a lot of concentration in 27, 27 set. This makes a ton of sense. I'm sure there are tons of people who are very, very happy that they were able to get a few dollars out of their calls that we're expiring today. Otherwise, and essentially save some of their position, right? Because that's essentially most of these we're going to expire worthless until we see a 12 up move on the day. Then a lot of these calls got pushed a little bit in the money. It's not a matter of whether or not they're in the money. It's just if, you know, underlying goes up, which it did. So it saves them. So love to see that rather than pouring one out for all the the homies we lost, which we still lost some, not a ton, but we get to pour one out for the homies that made a few bucks today, which is even better in my opinion. Then if we take a look at open interest,",
    "metadata": {
      "video_id": "fGOxBtIqzBs",
      "title": "Analyzing Gamestop's Recent Surge",
      "url": "https://www.youtube.com/watch?v=fGOxBtIqzBs",
      "upload_date": "",
      "duration": 600.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fGOxBtIqzBs&t=0"
    }
  },
  {
    "text": "pouring one out for all the the homies we lost, which we still lost some, not a ton, but we get to pour one out for the homies that made a few bucks today, which is even better in my opinion. Then if we take a look at open interest, this is getting even more interesting. So the put OI is not changing that much. It's still low three three three 13 right now call OI is changing a lot and notice how big this 18 oct expiration is becoming. Take a look at all these yellow boxes cropping up. Those are big positions being built out in this expiration. So we have some interesting things to look at here because notice, VAL has popped massively. These were all below 80 just yesterday and the day before. Now they're creeping up over 100 on overall. And then we can see that the option chain is starting to get built out. So right at the money's we have 5800 here 4000. Then we have 19,000 OI here with another 96 hundred traded today. We have 19,000 out here at the 30s. So this starts to look really interesting. Now as far as where we go from here, that's a great question because it's a little bit early to tell, but this obviously is the exact kind of stuff that I look for. So this popped up on a few of my scans primarily on a volume perspective with the volume exceeding",
    "metadata": {
      "video_id": "fGOxBtIqzBs",
      "title": "Analyzing Gamestop's Recent Surge",
      "url": "https://www.youtube.com/watch?v=fGOxBtIqzBs",
      "upload_date": "",
      "duration": 600.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fGOxBtIqzBs&t=0"
    }
  },
  {
    "text": "as where we go from here, that's a great question because it's a little bit early to tell, but this obviously is the exact kind of stuff that I look for. So this popped up on a few of my scans primarily on a volume perspective with the volume exceeding the five day end 20 day average intraday. It tells me that when that VAL when that hits intraday that we're going to run past it, right? Because when we're looking at the five day average of 20 day average that's looking back over the entire trading day for five days or 20 days. So if you exceed the entire day average before the days out, it's fairly telling that volume is picking up meaningfully. So now we get to see does this volume continue forward, but what I can tell you is that there was tons of shares traded today. And I can also tell you that the options market is also starting to get involved, which again, I'm very eager to see all this goes. So we'll keep an eye on it as usual. We do have the GME live stream tomorrow at 5 p.m. Pacific time. We're going to continue going through all of Roryne Kitty's old trade. So this will be part three. I don't know how many parts there are going to be. I actually thought we might get through them through it all in one video. Obviously that was completely wrong, but I'm happy",
    "metadata": {
      "video_id": "fGOxBtIqzBs",
      "title": "Analyzing Gamestop's Recent Surge",
      "url": "https://www.youtube.com/watch?v=fGOxBtIqzBs",
      "upload_date": "",
      "duration": 600.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fGOxBtIqzBs&t=0"
    }
  },
  {
    "text": "going to continue going through all of Roryne Kitty's old trade. So this will be part three. I don't know how many parts there are going to be. I actually thought we might get through them through it all in one video. Obviously that was completely wrong, but I'm happy it's wrong because I'm really enjoying looking at this stuff in detail with you all. So tomorrow at 5 p.m. Pacific time, we're going to be going through and we're getting to the point where he's starting to unwind some of his trades. And there's some really interesting behaviors that I'm picking up from him. One being that he's clearly not unwinding positions based on a profit target. It's actually right now looks like it's based on time in the trade. Good old tit. So I want to see if that holds up. And I'm most eager to see if I can detect a change in his approach because I have a pretty good fingerprint for the way that he's using options right now. And I'm so eager to see if there's a material shift in what he does. Because right now I think we're in like really 2021 ish. So we're getting to where things start getting very interesting. So that's the game playing for tomorrow. And then later today we have outlier options trading for beginners and come hang out. We're going to go over three common beginner mistakes in how to avoid them and then general open",
    "metadata": {
      "video_id": "fGOxBtIqzBs",
      "title": "Analyzing Gamestop's Recent Surge",
      "url": "https://www.youtube.com/watch?v=fGOxBtIqzBs",
      "upload_date": "",
      "duration": 600.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fGOxBtIqzBs&t=0"
    }
  },
  {
    "text": "So we're getting to where things start getting very interesting. So that's the game playing for tomorrow. And then later today we have outlier options trading for beginners and come hang out. We're going to go over three common beginner mistakes in how to avoid them and then general open Q and a. So we're out here. We're active. We're busy. As always, if there's anything you need or want me to take a look at, let me know. You can shoot me an email, drop it in a comment, whatever makes you happy. Makes me happy. Be an outlier. See you all later.",
    "metadata": {
      "video_id": "fGOxBtIqzBs",
      "title": "Analyzing Gamestop's Recent Surge",
      "url": "https://www.youtube.com/watch?v=fGOxBtIqzBs",
      "upload_date": "",
      "duration": 600.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fGOxBtIqzBs&t=0"
    }
  }
]