[
  {
    "text": "What's up, everyone? Welcome to the outlier podcast. I have my friend and doppelganger, Eric. What's up, Eric? You and I have connected for a while now, but I don't think we've had a chance to like actually get together for a podcast on my channel at least. So welcome. Thanks for coming to hang out for a bit. Yeah, absolutely. I know. Yeah, we've had a, we've been on my podcast a couple times. We've had a couple conversations that we wish we had turned into a podcast. And so it's always good talking to you and talk about our approaches. And this might be my first video podcast. So this will be interesting for me. But yeah, cool man. Glad to be here. You look great. And I always feel like I feel like I provide like a good benchmark, right? Like I'm the ugly friend. So I always make other people look better. Yeah. So you're welcome. I'm doing. Okay, thanks. I always thought I had a face for radio, which is why my, my show is always audio. Yeah, I mean, I don't disagree with you, but I definitely also have a worse face. So now, man, jokes aside, it's great to catch up. So I thought with you to kind of dive a little bit into your background. And we'll get into more recent stuff. But I think it would be useful context for people that may not be familiar with who you are, what",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 0,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=0"
    }
  },
  {
    "text": "man, jokes aside, it's great to catch up. So I thought with you to kind of dive a little bit into your background. And we'll get into more recent stuff. But I think it would be useful context for people that may not be familiar with who you are, what your background is. Or even your own audience that might not have all the blanks filled on what your background is. I thought that would be a cool place to start. So walk me through specifically when you got into derivatives and why. Okay. So from a background standpoint, I don't have any sort of financial background. How far do you want to go back? You want me to start wherever you started with derivatives? If that's rewound post. Go back a little bit further because so when I went to college here in Florida, I started out as a math major. And I ended up changing to education and taught like middle school, math, like algebra, that type of thing. And I did that for a few years. I was a musician. I was a percussionist and marching band type guy. I played drums at Disney around that time. And so this was This was the early 90s in Florida. And in case you didn't know, I think Orlando was like the rave capital of the world. So for a few years, I got into DJing and music and I had this drumming background. I ended up going back",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 1,
      "total_chunks": 54,
      "start_timestamp": "00:00:57",
      "start_timestamp_seconds": 57.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=57"
    }
  },
  {
    "text": "And so this was This was the early 90s in Florida. And in case you didn't know, I think Orlando was like the rave capital of the world. So for a few years, I got into DJing and music and I had this drumming background. I ended up going back to school for networking like Cisco networking IT stuff. And then I got into an IT career that I was an IT administrator for about 15 or maybe 16, 17 years. I did networking. We did all the physical to virtual transition and then virtual to cloud and was ultimately ended up being like an infrastructure manager. But when I started my IT job, where I got into or first learned about derivatives as I went to a seminar, I think it was called get motivated and it had like A bunch of different people like real estate people. I don't even know who who all the people were. But one of the guys was from think or swim. And they started talking about options. Remember who it was. I'm sorry. Do you remember who it was. I want to say it was Phil town. God, I'm that name rings a bell. And I remember he had this joke. It was like so he brought up his think or swim account. And I can't remember. So sorry, let me back up a bit. So they did this free thing. And then they offered a class for think or swim and",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 2,
      "total_chunks": 54,
      "start_timestamp": "00:02:10",
      "start_timestamp_seconds": 130.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=130"
    }
  },
  {
    "text": "a bell. And I remember he had this joke. It was like so he brought up his think or swim account. And I can't remember. So sorry, let me back up a bit. So they did this free thing. And then they offered a class for think or swim and an options course. So I my buddy and I they let you pair up. We bought like this sort of advanced class where we learned about options and we learned about credit spreads. And in that class, the guy and I think it I think it was Phil town and I could be wrong in that. But the I just remember this funny thing where he he brought up his think or swim account and he's like, okay, here's how you buy an option. And he's and you know he wasn't trying to trade. He was just you know mechanically how to do it. And he had his balance showing he had a million, he had a million dollar like a million dollar account and he was buying these options and any and he said he goes, oh, you know how you get, you know, how you get to a million dollar account. And he's like, oh, you start with two million. And I was like, everyone laughed. There's like this huge, you know, kind of funny things we were talking about, you know, losing money and and that type of thing. But I think this was around 2004 or",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 3,
      "total_chunks": 54,
      "start_timestamp": "00:03:35",
      "start_timestamp_seconds": 215.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=215"
    }
  },
  {
    "text": "million dollar account. And he's like, oh, you start with two million. And I was like, everyone laughed. There's like this huge, you know, kind of funny things we were talking about, you know, losing money and and that type of thing. But I think this was around 2004 or early 2000s when I took that class. And so I just started messing around with mostly SPY at the time and kind of doing more directional things like technical I got into technical analysis. So that was one of the things that they were sort of touting was there was an indicator and they called it the three green, you know, if you got three green arrows. It was a lot of things that I was going to do. And I was going to buy a signal. I can't remember exactly what it was. But that was kind of my introduction to all that whole world was was going to a seminar and basically paying money to take a class. Now when you first saw options, I find people have different experiences with it for me. It was immediate intrigue. I was just fascinated by these things. What was your initial reaction? I was familiar with basic equities and general start market knowledge. But when you saw options, what was your initial response? I thought it was in what I was told, I guess, was more about if you don't have a lot of money, this is a way you",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 4,
      "total_chunks": 54,
      "start_timestamp": "00:04:24",
      "start_timestamp_seconds": 264.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=264"
    }
  },
  {
    "text": "initial reaction? I was familiar with basic equities and general start market knowledge. But when you saw options, what was your initial response? I thought it was in what I was told, I guess, was more about if you don't have a lot of money, this is a way you can start trading to where it would be significant enough for you to do so. So if you had 1,000 and you want to buy a stock and you want to be diversified or whatever, like, you're not going to buy one share of this and one no one's no one has the interest. And it's harder to stay interested when you don't really have enough skin of the game or you don't want to put a lot of skin in the game. To me, the initial interest and intrigue was, oh, this is something I can do on the side where I can kind of define my risk. I don't have to risk that much. You know, I can, you know, practice, if you will, with, and that was another thing at the time, think or swim had a paper, and they still, they still did a paper trading. So you were able to sort of practice before you put real money to work and then you could put real money. But so for me, the thing that kind of interested me the most was doing like directional trades where you're using single options to basically as a stock",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 5,
      "total_chunks": 54,
      "start_timestamp": "00:05:34",
      "start_timestamp_seconds": 334.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=334"
    }
  },
  {
    "text": "So you were able to sort of practice before you put real money to work and then you could put real money. But so for me, the thing that kind of interested me the most was doing like directional trades where you're using single options to basically as a stock replacement strategy. So then it was more about, well, if you're out of the money, you really have to have it to move and you have more premium or excuse me, Greeks against you, or as if you buy in the money, it's a little bit closer to stock replacement. So that's kind of where I started with all that. Got it. And did you have anything in the beginning that kind of stuck with you that made sense at the time, or was it all just this seems like something I'll try this seems like something I'll try was there anything that you kind of navigated towards naturally. Well, part of the class I took was was credit spreads and I ultimately kind of reverted back into that because it just to this day. And I think, you know, I didn't take the advanced class that they had, which was like a 10 or 20,000 thing, they were kind of counting as a college and they were going to teach you all the other fancy strategies. But I think, you know, credit spreads is kind of what I sort of remember a lot about because they they did a",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 6,
      "total_chunks": 54,
      "start_timestamp": "00:06:43",
      "start_timestamp_seconds": 403.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=403"
    }
  },
  {
    "text": "was like a 10 or 20,000 thing, they were kind of counting as a college and they were going to teach you all the other fancy strategies. But I think, you know, credit spreads is kind of what I sort of remember a lot about because they they did a pretty good job of explaining in non option terms, what, you know, what it is and, and you know, bearish neutral and you don't, you don't have to be all the way right, you just can't be really wrong and those type of things. And that kind of appealed me at the time, I think it appeals to a lot of beginners still because, because it's, you know, a way to define, you know, exactly how much you can lose in case something goes wrong. But you don't always have to be 100 right so that kind of stuck with me for a while. And then as I got more into technical analysis, I kind of threw the options out of is more. Not through the options job, but I, I focused less on the option and selection was more like, okay, I'm trading a 30 minute chart, I'm going to buy an option that's 30 days out and look for like swing trades and stuff. So, so yeah, I think, I think from that period of time, what would have sort of reverted back to and thought mostly about as is credit spreads and, and how you can use",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 7,
      "total_chunks": 54,
      "start_timestamp": "00:08:08",
      "start_timestamp_seconds": 488.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=488"
    }
  },
  {
    "text": "to buy an option that's 30 days out and look for like swing trades and stuff. So, so yeah, I think, I think from that period of time, what would have sort of reverted back to and thought mostly about as is credit spreads and, and how you can use those as leverage, even though you're not as leverage as single options. Some of that makes sense, but it does. Yeah, well, I mean, to your point, if you're using something like a credit spread, you'll always see a better return on invested capital. And yeah, it's, yeah, your capital efficiencies is exactly as good. Yeah, yeah, it provides a little bit of a different, a little bit of a different risk profile. But they're, they're very, very capital efficient, obviously. So walk me through then the way that you progressed, you saw credit spreads, you shockingly turned down the 20,000 course, which by the way, apparently you and I need to get off a YouTube. And we need to just are doing 50,000 courses and teach people basic option structures is what I'm here is that what are the idiots. But so you went through, you know, credit spreads, you tried some of these other stock replacement strategy swing trading applications started navigating back to credit spreads. What's the timeframe that this is happening over what period of time are you kind of flowing between these. It was, you know, it was like a couple years, I'm trying to",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 8,
      "total_chunks": 54,
      "start_timestamp": "00:09:17",
      "start_timestamp_seconds": 557.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=557"
    }
  },
  {
    "text": "you tried some of these other stock replacement strategy swing trading applications started navigating back to credit spreads. What's the timeframe that this is happening over what period of time are you kind of flowing between these. It was, you know, it was like a couple years, I'm trying to remember exactly it's been, it's been a long time. I was doing credit spreads and that was boring. And so I wanted something more exciting, which was kind of more, I just call it like short term swing trading. I wasn't day trading because at the time, you know, I was still working. And couldn't, you know, I wasn't going to try to do that. And also at the time back in, you know, it's called 2010 or so. They didn't, they only had explorations on Fridays. So it wasn't, there wasn't kind of the same mania that there is today where you're like, man, you can wake up and like, there's something to do every day if you want to, you know, where is back then when they only had Friday explorations, it was like, OK. If I'm going to do a swing trade on them Tuesday, should I wait, you know, to otherwise, I got to, I got to choose three days out versus 10 days out. And there, there was kind of a little bit of choice that you had to make. It wasn't as granular. And so I, that kind of put in, you know, in",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 9,
      "total_chunks": 54,
      "start_timestamp": "00:10:36",
      "start_timestamp_seconds": 636.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=636"
    }
  },
  {
    "text": "wait, you know, to otherwise, I got to, I got to choose three days out versus 10 days out. And there, there was kind of a little bit of choice that you had to make. It wasn't as granular. And so I, that kind of put in, you know, in hindsight, it pushed me out to trade farther out. Because when you, what I learned sort of inherently was that if you bought an option with three days of exploration, obviously, you need, you have to get the move that you're expecting in those three days or you don't make money. But if you're, depending on your analysis, if you're looking at something like a daily chart, you know, you might get a swing trade signal, you know, moving average cross whatever it is. And so you may want to let that play out longer. So you may want to buy 30 days out because if you get a really good swing, you want to hang on to that. So there got, there got to be like the bunch of decisions that I had to make that, you know, and I didn't. I kind of just ended up at like 20 to 30 days because I figured, well, that's long enough, you know, it was very scientific. But then ultimately, I got sort of reverted back to credit spreads. I was doing some vertical spreads to because on more expensive stocks, you can spread it off to reduce your capital.",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 10,
      "total_chunks": 54,
      "start_timestamp": "00:11:49",
      "start_timestamp_seconds": 709.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=709"
    }
  },
  {
    "text": "20 to 30 days because I figured, well, that's long enough, you know, it was very scientific. But then ultimately, I got sort of reverted back to credit spreads. I was doing some vertical spreads to because on more expensive stocks, you can spread it off to reduce your capital. So there was still the same sort of swing trade mindset. But then I ultimately got back to credit spreads because it was just easier, if you will, you just can't be that wrong. So I, like, I got away from those signals, if you will, like, like pure technical Mac D, whatever signals. And just try to look at, hey, is the general trend up. Yes, let's sell some puts or put spreads or whatever. And so then you fast forward to, I think it was 2016 when they added Monday, Wednesday, Friday, expiration for SPX, I really started focusing in on that because I could trade my shorter term stuff. consistently, because I learned over time that part of your part of consistency is choosing the same duration. And with the, the advent of now we have daily explorations, you can have a one day to expiration strategy. And you can trade it every day, as long as your setup is there, whereas in the past, if you wanted to do zero DTE, you could only do that on Monday, Wednesday, Friday, and you can only do one DTE on Tuesday, Thursday, because technically Friday was a three",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 11,
      "total_chunks": 54,
      "start_timestamp": "00:12:58",
      "start_timestamp_seconds": 778.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=778"
    }
  },
  {
    "text": "And you can trade it every day, as long as your setup is there, whereas in the past, if you wanted to do zero DTE, you could only do that on Monday, Wednesday, Friday, and you can only do one DTE on Tuesday, Thursday, because technically Friday was a three DTE. So as, as technology and the options landscapes sort of has, you know, blown up over time. It's allowed for more strategies and more frequency. So what I've done, what I've ended up doing is really kind of just bringing everything back into for my trading, you know, and I'll separate investing from that, but for my sort of short term trading, options trading, I pretty much just trade SPX, because I have multiple strategies, like one day, seven day, 14 day, that I can put on. And I can get that consistent DTE now. So it can be a Tuesday and I can trade seven days, the expiration, you know, as before that wasn't possible. So, and I think over time, the technology available to retail traders has changed drastically, and I got into back testing years ago, with a couple, I think I started with CML, CML trade machine pro, which they still have a great platform. And, and then that's when I started like sort of honing my, honing my strategies a little bit more often fast forward to today where I kind of created my own analytics to really increase my frequency. And kind of",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 12,
      "total_chunks": 54,
      "start_timestamp": "00:14:08",
      "start_timestamp_seconds": 848.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=848"
    }
  },
  {
    "text": "trade machine pro, which they still have a great platform. And, and then that's when I started like sort of honing my, honing my strategies a little bit more often fast forward to today where I kind of created my own analytics to really increase my frequency. And kind of something you mentioned before, the one thing I like about the credit spreads is, is that they are capital efficient. And when you can increase your frequency with and continue a similar win rate risk reward, you can trade smaller and therefore more consistently. So that's kind of where I've ended up over the years and why I typically just trade SPX at this point. And two questions, the first follow up is in the early days, what was your original goal with trading, what were you trying to accomplish other than the fact make money, right, that's pretty clear. But beyond that, did you have any specific goals, like be we trying to return a certain percent, were you trying to limit drawdown, how did that look? So I lived through the 2008 financial crisis and I was in my corporate job and you know had my 401k saw my 401k, you know, get cut in half. And then wrote it back up like a champ, you know, luckily, you know, I was my wife and I both luckily didn't lose our job. We didn't lose our how like we, you know, I feel very fortunate that I kind",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 13,
      "total_chunks": 54,
      "start_timestamp": "00:15:29",
      "start_timestamp_seconds": 929.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=929"
    }
  },
  {
    "text": "my 401k, you know, get cut in half. And then wrote it back up like a champ, you know, luckily, you know, I was my wife and I both luckily didn't lose our job. We didn't lose our how like we, you know, I feel very fortunate that I kind of just made it through there. My boss and this other guy that was above me, they didn't make it. So I became the boss after that, that was. But I think the promotion hell yeah. Yeah, so the the GFC really kind of kind of woke me up and I'm trying to think a whole hell that was during that time I was probably late 30s or mid 30s or so. And it was just like, you know, you can save your whole life and it could just get wiped out, you know, and and cash under the mattress isn't good. So my whole thing and still to this day is like, OK, I want to learn, I want to be able to generate extra income from the money that I have in perpetuity because everyone's living longer. You know, you're probably going to outlive your money, you know, most of us, right. So it was really for me to learn a skill of making money without having to work a job or work, you know, and I had always kind of thought, OK, this is something I'll do in a retirement because when I was in the IT",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 14,
      "total_chunks": 54,
      "start_timestamp": "00:16:56",
      "start_timestamp_seconds": 1016.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1016"
    }
  },
  {
    "text": "most of us, right. So it was really for me to learn a skill of making money without having to work a job or work, you know, and I had always kind of thought, OK, this is something I'll do in a retirement because when I was in the IT field. You know, even in like elementary school, I did some coding with DOS and like I was always kind of a. Matthew, you know, we just call us spade a spade nerd. Yeah, it's like kind of a little bit of a nerd there. And, you know, being in IT for however many 15 years or so, you see life cycles of things, you know, like windows XP, Windows 7, you know, I have an A plus certification in windows 98. I don't even know if you know what that is. But so, you know, like you go through these cycles and then at some point you're like, you know, am I, you know, am I going to be able to do this when I'm 50 60, like learn the next thing. Most of the things that happened kind of went into the cloud and I sort of saw the writing on the wall where I was, I would joke with my co workers and like, oh, yeah, we're moving this to glad to the cloud. I'm like, I'm basically outsourcing myself. And so it was just kind of this thing and I saw that it from the very,",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 15,
      "total_chunks": 54,
      "start_timestamp": "00:18:22",
      "start_timestamp_seconds": 1102.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1102"
    }
  },
  {
    "text": "the writing on the wall where I was, I would joke with my co workers and like, oh, yeah, we're moving this to glad to the cloud. I'm like, I'm basically outsourcing myself. And so it was just kind of this thing and I saw that it from the very, you know, from the very beginning, and I just wrote it out as long as I felt like it. But so the goal was really just to. At the time is just learn the skill of making money, I already had a job. You know, and I was making six figures. So it was like, I wasn't trying to get rich. I just wanted to learn the skill. And obviously options are complex. And I kind of took that as a challenge to learn something complex. Because I thought that would be a good way to well, you know, if I could learn this, I should be able to make a lot of money. And then in hindsight, now I realize, I've gone the other way and I do what the most simple way there is because it's just like it's, we've talked about that before, you know, the complexities. So my, you know, to your question, my goal really was to just learn a skill outside of what I had been doing. And with the idea that maybe when I retire, I can have extra income. Or, you know, maybe retire early, obviously. And you did that, right? You",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 16,
      "total_chunks": 54,
      "start_timestamp": "00:19:33",
      "start_timestamp_seconds": 1173.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1173"
    }
  },
  {
    "text": "So my, you know, to your question, my goal really was to just learn a skill outside of what I had been doing. And with the idea that maybe when I retire, I can have extra income. Or, you know, maybe retire early, obviously. And you did that, right? You made the jump early. I remember, I think when I had met you, did you just make the jump or were you just making the jump? I can't remember temporally when that was like really close to the end. I quit my corporate job. Or four years ago. And I thought I was going to make you literally like right as you were doing that. That's, yeah, it's about right. Yeah, four or five years. I quit my corporate job. Now I still, you know, I'm running my app now, alpha crunching that I started. So there is a business there. I don't, you know, I'm not ripped. I wouldn't say I'm retired, you know, but. And the other thing to know it on top of that. And I just want to deliver two points home for people. But one of them is you did make that leap of faith because I remember you started alpha crunching not immediately when you made the transition. Yeah. So like you did take that leap of faith. And I just didn't know I was going to do alpha crunching when I left the job. Right. And that sort of came up after it",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 17,
      "total_chunks": 54,
      "start_timestamp": "00:20:21",
      "start_timestamp_seconds": 1221.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1221"
    }
  },
  {
    "text": "because I remember you started alpha crunching not immediately when you made the transition. Yeah. So like you did take that leap of faith. And I just didn't know I was going to do alpha crunching when I left the job. Right. And that sort of came up after it was sort of recommended to me by one of my followers, who was interested in business. And I'm, you know, I got an entrepreneurial thing, you know, in myself. So, but yeah, it was, it was, you know, kind of a leap of faith. It was one of those things, the management at my company was changing. You know, I didn't like certain things. And the people I work with were great. My boss and everybody was just kind of this, you know, I just have been there for it was time for me to go. And they made it easy. So I just was like, well, I'm just going to trade full time. And if I need to go back and get another job, I can, I'm married. My wife works, we, you know, it's not like we had no income, you know, that type of thing. We switched insurances from my company and her company. So there was a lot of, you know, it's, there's a lot of thought into that. I had a lot of other support for that. But then, but I felt like I could do okay. I feel like I could get by. And",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 18,
      "total_chunks": 54,
      "start_timestamp": "00:21:38",
      "start_timestamp_seconds": 1298.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1298"
    }
  },
  {
    "text": "insurances from my company and her company. So there was a lot of, you know, it's, there's a lot of thought into that. I had a lot of other support for that. But then, but I felt like I could do okay. I feel like I could get by. And then it was like, well, let's just see how long this last. And, you know, my biggest concern was, you know, I've kids at that time, we're in, you know, elementary middle school. So these are expensive years. So it's, it's like, so I can't just retire and just live off, you know, like, fixed income or whatever. So, you know, I still have to, you still, if you want to provide and, and do all the things that, that teenagers do, you have, you have, have to have some money coming in. So, but yeah, it was definitely a leap of faith. It was, I think a little bit after COVID, it was kind of like, what are we doing, you know, like what, where do I want to spend my time, you know, I'd rather spend my time, I'd rather make less money, you know, or less security of money and be able to take my kids to school and do all the things. And doing that for a few years and it's been awesome. Whereas before working, having a, you know, corporate job and trading, you can imagine the money was a lot more, but it was,",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 19,
      "total_chunks": 54,
      "start_timestamp": "00:22:50",
      "start_timestamp_seconds": 1370.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1370"
    }
  },
  {
    "text": "of money and be able to take my kids to school and do all the things. And doing that for a few years and it's been awesome. Whereas before working, having a, you know, corporate job and trading, you can imagine the money was a lot more, but it was, you know, you weren't able to enjoy it. It was more stressful. And, you know, so it's kind of like a, you know, a different phase, I guess. And I think COVID had a little bit to do with that. It was just kind of, you know, you wanted a break and enjoy what you have kind of thing. And I think there's, there's a lot that I want to dig into here. The first thing that I want to make sure the audience is hearing you talk about is what I consider to be one of the coolest parts about trading is that you can have different objectives for what you're doing. And then you can, you know, you can have a different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different,",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 20,
      "total_chunks": 54,
      "start_timestamp": "00:23:47",
      "start_timestamp_seconds": 1427.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1427"
    }
  },
  {
    "text": "different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different,",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 21,
      "total_chunks": 54,
      "start_timestamp": "00:24:57",
      "start_timestamp_seconds": 1497.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1497"
    }
  },
  {
    "text": "different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different, different different things that are, what, you mean truth, what are things that is about the learning level. And that's the experience that I wanted to bring up. So, that's all you worry about. So, that's all you worry about. When you just started thinking about that, what do you think about the learning level? Well, there's a typical, there's a mental breakdown that a learning level is about thinking about the learning level about the learning level. you were framing that, what was that timeframe that you were like, how far out from when you made the initial transition, were you starting to say like there's some opportunity here for me? Yeah, so, you know, I would, I kind of look at it like, um, so let's go back to the adjeb objective real quick. Yeah. And this, this isn't advice or whatever. My top objective is just positive cash",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 22,
      "total_chunks": 54,
      "start_timestamp": "00:25:57",
      "start_timestamp_seconds": 1557.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1557"
    }
  },
  {
    "text": "you starting to say like there's some opportunity here for me? Yeah, so, you know, I would, I kind of look at it like, um, so let's go back to the adjeb objective real quick. Yeah. And this, this isn't advice or whatever. My top objective is just positive cash flow. Yeah. Just, you know, the amount of money you have, obviously can help with that, you know, if you're doing dividends or whatever. I didn't, I didn't have that much money to just live off like a dividend type situation. But so my thing was cash flow. And then in the good years, um, leading up to when I left, I was pretty good about saving my money. So I left, and if you think about it from a business, and then what they would call this is like, well, how much runway do you have? Right. So I left my job with, you know, at least one year of runway, meaning if I didn't make any money, I would, I could be fine for a year. And so I was like, okay, well, I mean, why wouldn't you, why wouldn't you do that? Like at what point, you know, I wouldn't call it FU money, you know, like I wasn't, but it was pretty close, which is why I left. Right. So if you're working and, you know, you have to have a certain amount of money to do this. So the more you save, um, the closer",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 23,
      "total_chunks": 54,
      "start_timestamp": "00:27:02",
      "start_timestamp_seconds": 1622.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1622"
    }
  },
  {
    "text": "know, I wouldn't call it FU money, you know, like I wasn't, but it was pretty close, which is why I left. Right. So if you're working and, you know, you have to have a certain amount of money to do this. So the more you save, um, the closer you are, and this is the same thing for retirement, the closer you are to, um, unlocking your, your time. And then when it comes to like cash flow, you also have to, can we linger on that point just for one second? Because I think that's another really common thing I talk to traders about where they're like, oh, I'm trying to make my gas money with my trade money this week. And one of the things that I try to talk them about is that exact thing. The idea of trying, for me, it was three years because I'm overly conservative. I wanted three years of runway, but talk to me about how you thought about building that because I think a lot of people when they're going through the transition, they're thinking of, I just want this freedom so bad that they focus on it a little too much. And then it can sacrifice the ability to sustain the freedom that they're trying to make. So you decided one year runway. And that was your target. And how did you arrive at that? How early again in this timeline? So if we think T zero is when",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 24,
      "total_chunks": 54,
      "start_timestamp": "00:28:12",
      "start_timestamp_seconds": 1692.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1692"
    }
  },
  {
    "text": "too much. And then it can sacrifice the ability to sustain the freedom that they're trying to make. So you decided one year runway. And that was your target. And how did you arrive at that? How early again in this timeline? So if we think T zero is when you made the transition a full-time trader, how far back from T zero was it like, okay, I need to save one year's worth of expenses for me to feel comfortable making this transition? Yeah, I wish I could say I was that thoughtful about it. What really happened was I just saved money. So let's go back to how when I came out of college and we got married, well, it wasn't that soon, but we ended up, you know, we were in debt, right? In the first few years of having kids, we were in debt. And I remember we actually, I don't remember exactly how much, but we ended up getting out of debt. And so that's put me in a mindset of like, never want to use a credit card again. I want to pay cash for everything. I never want to have debt again other than maybe a car in a house kind of thing. So I was building my savings, not thinking I would leave my job. I was building it so that whenever the shit hits the fan and I need to buy an AC or in Florida, you know, get into a",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 25,
      "total_chunks": 54,
      "start_timestamp": "00:29:18",
      "start_timestamp_seconds": 1758.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1758"
    }
  },
  {
    "text": "than maybe a car in a house kind of thing. So I was building my savings, not thinking I would leave my job. I was building it so that whenever the shit hits the fan and I need to buy an AC or in Florida, you know, get into a car accident or I want to go on a trip. I don't, I want positive cash flow. I don't want an extra bill to pay something off that. You know, so that was part of my thing for getting, you know, I guess prepared for that, which again, wasn't really the plan. The actual sort of catalyst for me leaving the company was more of a kind of a, not issue, but just kind of a falling out, I guess, with some of them. And I was just like, I'm just going to go, you know, but I was able to not succumb to, I didn't, I didn't have to be a yes man to stay. So there was a little bit of satisfaction. Like, well, I don't really need this as bad as you think I need this. So, and I just happened to have put in some good habits that, that put me there. So I had a way to make money trading. Probably wasn't going to make as much as I was making trading and working, but I had runway and I thought, well, if I can trade more and trade different things that I'm not able",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 26,
      "total_chunks": 54,
      "start_timestamp": "00:30:33",
      "start_timestamp_seconds": 1833.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1833"
    }
  },
  {
    "text": "habits that, that put me there. So I had a way to make money trading. Probably wasn't going to make as much as I was making trading and working, but I had runway and I thought, well, if I can trade more and trade different things that I'm not able to with my job, maybe I can actually make more trading. And that actually worked out. I was making more trading than previously because I was able to focus on it. So there was, you know, you took the chance of, I took the chance of that, but I wouldn't say that I was, I was so strategic in, like, okay, I'm going to save this much and I'm going to get, you know, 100,000 and then I'm going to quit or whatever the, you know, thing is so. But I think I just started doing things that would be in my favor. And then those can culminate at some point. You don't know when and how that will culminate, but that's how that kind of played out for me. I love that point though. And the reason why I love it so much is because it's so different than the way that I thought about it. And that's the beauty. And I think there's a lot of people that will identify with that modality. Because what you're highlighting is contrary to how I think about it, which is having like a pretty well-defined plan that I'm focused on executing,",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 27,
      "total_chunks": 54,
      "start_timestamp": "00:31:40",
      "start_timestamp_seconds": 1900.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1900"
    }
  },
  {
    "text": "the way that I thought about it. And that's the beauty. And I think there's a lot of people that will identify with that modality. Because what you're highlighting is contrary to how I think about it, which is having like a pretty well-defined plan that I'm focused on executing, like, pretty consistently. What you're highlighting is that if you adopt good general habits, it kind of comes out in the wash. You might not have to do all this bullshit that I do to figure out where you're going. If you do the right things, generally the right stuff, you were in the right spot. Yeah, you get lucky. You'll get lucky. But to your point, it's putting you in a position to be lucky. I think that's, it's kind of like the, that's really where, you know, luck essentially is able to come to fruition is when there's a lot of hard work to put you into a position to take advantage of it when it's there. So you come up to this decision stuff happened at work. And you're getting ready. You're obviously it's not like, I assume it's not like you go in Monday and you're like, I'm fucking I'm out of here today. My guess is that there was a little bit of forethought before you actually pulled the switch. There actually wasn't. It, it, um, all something happened on a Friday. And, um, and, and then I, I resigned on Sunday on Sunday. Yeah.",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 28,
      "total_chunks": 54,
      "start_timestamp": "00:32:44",
      "start_timestamp_seconds": 1964.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=1964"
    }
  },
  {
    "text": "like, I'm fucking I'm out of here today. My guess is that there was a little bit of forethought before you actually pulled the switch. There actually wasn't. It, it, um, all something happened on a Friday. And, um, and, and then I, I resigned on Sunday on Sunday. Yeah. Yeah. I love that. Well, still there's some. So the funny thing was, is, um, and you know, I, I, I don't want to go into it too, too much. I mean, it wasn't anything. Um, but long story short. So I had been doing YouTube and research. Um, and, and I had a Patreon and I was posting like research things from various back tests I would done and was, was kind of like building this little community around research, options trading research. And, um, I had, I had started my podcast and it was all these things I was doing outside of work. And, um, I had a YouTube channel. So I, to help, uh, pay for like the production, cause I couldn't do everything myself. I had a production company. If we went, that's what you want to call it. Who would basically, I would record my podcasts, I would give them the audio. They would create a video and post it. Like I just kind of, because I didn't have time I was working. Right. And, um, and they would just post the stuff for me. Well, um, they, someone in HR or a, is this",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 29,
      "total_chunks": 54,
      "start_timestamp": "00:33:50",
      "start_timestamp_seconds": 2030.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2030"
    }
  },
  {
    "text": "podcasts, I would give them the audio. They would create a video and post it. Like I just kind of, because I didn't have time I was working. Right. And, um, and they would just post the stuff for me. Well, um, they, someone in HR or a, is this executive person who didn't like the IT department. Found out I had a YouTube channel and they thought I was making these videos like while I was working. Hmm. And, um, and so he might, they pressured my boss to kind of give me a hard time. And I was like, well, I don't actually post those videos. And then it got into this whole, like, they're like, hey, another video posted on Wednesday at noon this week. And I was like, you know how scheduling works, bro? Well, in my boss, no, the guy that I, you know, knows. And then I'm thinking, I am working with the dumbest people. Right. Like literally, literally the HR person, they scheduled these emails to go out. You think Susan is sending out this email at six in the morning. Do you think anyone believes that shit? And I was just like, so you actually think, and if you've seen in my videos, they're pretty, they're not like this. Like off the cuff stuff. There, there's a lot of time and effort I put into my videos to make them short and concise. And I'm just thinking, God, either you guys think",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 30,
      "total_chunks": 54,
      "start_timestamp": "00:35:09",
      "start_timestamp_seconds": 2109.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2109"
    }
  },
  {
    "text": "so you actually think, and if you've seen in my videos, they're pretty, they're not like this. Like off the cuff stuff. There, there's a lot of time and effort I put into my videos to make them short and concise. And I'm just thinking, God, either you guys think I'm a super genius or you're super dumb. And either way, like, this isn't working for me. And then, then I had a chip on my shoulder and I was like, so now I'm going to go back in and, and try to like, like, what's this going to be like moving forward? Right. Like now that, you know, I was annoyed and I was in my, you know, my wife's funny. She was like, you should have quit six months ago. You know, like, she was on board. She wanted me to leave. And I was like, yeah, you know, and I had to think about it. But then, then when Sunday came around, I was like, I was like, well, I better, part of me was like, I better quit because if I want to find another job, I don't want to, I don't want to like get into an argument and get fired or something done like that because that's where I was at. I was ready to argue. So I was like, I don't need this. I'm just going to, I'm going to quit. I had company shares. They had to buy me out that added",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 31,
      "total_chunks": 54,
      "start_timestamp": "00:36:22",
      "start_timestamp_seconds": 2182.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2182"
    }
  },
  {
    "text": "into an argument and get fired or something done like that because that's where I was at. I was ready to argue. So I was like, I don't need this. I'm just going to, I'm going to quit. I had company shares. They had to buy me out that added to my runway. And so I was just, you know, kind of, I put in a 30 day notice and super generous. Yeah. Yeah. Because I didn't want to leave my boss hanging. Super generous. And we're still friends. I, you know, he still works there. And that's, you know, but but it's just, you know, like the company culture was changing a little bit. The management and like they, they just weren't that savvy. And the upper management was less technology forward, which was harder for us. And it was like, and it was just like, this, I don't need to. I've been doing this a long time. Like we know how all this stuff works. So that was a Friday. And then I, I told my boss on Sunday. I hate to say, hey, you can play in this out. Sometimes you just, you know, but, but I go back to, I, you know, had I not saved plan there. Had I not saved my money and, and learned from my previous debt mistakes from my teens and 20s. And, you know, like I said, COVID had happened. I mean, I didn't mention this, but my mom had",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 32,
      "total_chunks": 54,
      "start_timestamp": "00:37:24",
      "start_timestamp_seconds": 2244.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2244"
    }
  },
  {
    "text": "go back to, I, you know, had I not saved plan there. Had I not saved my money and, and learned from my previous debt mistakes from my teens and 20s. And, you know, like I said, COVID had happened. I mean, I didn't mention this, but my mom had gone into, she had to go into a nursing home. She had MS. And I had to manage her house. So there was a whole bunch of things going on. And I was just like, cash flow, simplify. I don't need that much money. I've been poor. If I, I'll be poor again, if I need to, like, I don't care. I just want like the value of doing whatever you want, whenever you want. Like that's, it's just, I'm, I live in Florida. Like I don't really have to go on vacation, you know, if I don't want to, I can just go to the beach anytime I want. So, you know, it's, it's, um, you, you kind of go through some things. I think COVID put me through. I'm, I'm a little bit older than you. So when you start to get to yours, you know, I don't say it's a second half of my life. But probably it's the second half of my life. It's like, well, what do, you know, what are we doing? You want wheelchair wealth? I think is what they call it, where you work your ass off and you have a ton",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 33,
      "total_chunks": 54,
      "start_timestamp": "00:38:28",
      "start_timestamp_seconds": 2308.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2308"
    }
  },
  {
    "text": "say it's a second half of my life. But probably it's the second half of my life. It's like, well, what do, you know, what are we doing? You want wheelchair wealth? I think is what they call it, where you work your ass off and you have a ton of money when you're 66 and a half or whatever the number is, or do you want like, hmm, just positive cash flow and enjoy it now and, um, enjoy the time. So that, that was kind of part of the, um, mindset of, of making that decision with the idea that I could always go back to work if I needed to. Now, I think that's harder to do because I've been out of the game for four years. And the only thing I know is I've narrowed my universe to a certain type of trading and, and, and mindset. So, could I get a job somewhere if I needed to? Maybe, maybe, you want to? Maybe. Um, it's kind of boring, you know, sometimes like, like, I have kids now, but I know like when the kids are gone, like, I don't know, maybe I want a job again. Like, there's nothing wrong with having a job. I don't know. I like it. I loved my job for the longest time. For the first 10, 12 years, I loved my job. And then the last few years, I didn't love my job. Um, so, you know, there's nothing",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 34,
      "total_chunks": 54,
      "start_timestamp": "00:39:31",
      "start_timestamp_seconds": 2371.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2371"
    }
  },
  {
    "text": "again. Like, there's nothing wrong with having a job. I don't know. I like it. I loved my job for the longest time. For the first 10, 12 years, I loved my job. And then the last few years, I didn't love my job. Um, so, you know, there's nothing wrong with having a job. Um, trading is just a different type of job. And it's sometimes it's good to have two jobs. Well, I think you hit on a bunch of super important points. The, the first one is even though you didn't necessarily have the, the road map, you know, on Friday, that like Sunday, I'm going to leave, right? The, the fact is, is you still had put enough forethought into building the origin of the plan that you would built a runway into skill set that you could reasonably lean on. And it was time to activate that. I, again, I just highlight that for other people, because a lot of my audience, they're used to my way of doing things, hearing me talk about my way of doing things, which is everything is very planned, like essentially everything. And I think it's really cool to hear so many elements of your story that stem from having a general plan, but not necessarily, you know, the, the same approach that I technically take and it's still worked out well for you. So the, the other thing that I want to highlight as I heard you kind",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 35,
      "total_chunks": 54,
      "start_timestamp": "00:40:31",
      "start_timestamp_seconds": 2431.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2431"
    }
  },
  {
    "text": "hear so many elements of your story that stem from having a general plan, but not necessarily, you know, the, the same approach that I technically take and it's still worked out well for you. So the, the other thing that I want to highlight as I heard you kind of talking about that path, though, in the important point is that you would build enough of a skill set that you felt confident in making at least a crack at this. Even though you had a year runway, you weren't going into that thinking, I'm just going to burn this full year and then find a job. It sounded like you wanted to trade and like see how this does. So walk me through what steps you were taking leading into, again, T zero being the transition that built that confidence that built the background. I'm saying, Sunday, don't feel like going to work Monday. Later nerds. Yeah. Yeah. Well, you know, it was scary. I, you know, I can say now for whatever five years later that I was the best decision I've ever made or whatever, but it wasn't at the time. It was, it was scary. We didn't know. I didn't even know what to do. Like once I actually, actually finished work my last day, it was like the next week. It was like, okay, now what? You know, because, but, sorry, what was the question again? I got, I got a track. Yeah, totally",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 36,
      "total_chunks": 54,
      "start_timestamp": "00:41:40",
      "start_timestamp_seconds": 2500.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2500"
    }
  },
  {
    "text": "We didn't know. I didn't even know what to do. Like once I actually, actually finished work my last day, it was like the next week. It was like, okay, now what? You know, because, but, sorry, what was the question again? I got, I got a track. Yeah, totally cool. I wanted to check in with how, what you were doing trading wise, what kind of track record you had built before you made the transition to think that this is something I could rely on. It was a skill set you trusted to some degree. Yeah. So I have been doing, I have been doing really short term SPX kind of income trades. I have been doing longer term stuff. I can't quite remember the strategies at the time. They're all relatively the same. And again, it was just really about cash flow and understanding that I think for anyone who, you know, I'm sure people know this, but you don't always win. And there are periods of time where you either lose or maybe you don't have strategies for because the market's not doing what your normal strategy is or, you know, like, like, when we're talking the market's sort of pulling back, I'm not really doing a lot of trades right now because most of my strategies are kind of bullish things. So I'm kind of on the sidelines in a lot. But I think it just goes back to, you know, risk reward and cash",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 37,
      "total_chunks": 54,
      "start_timestamp": "00:42:51",
      "start_timestamp_seconds": 2571.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2571"
    }
  },
  {
    "text": "the market's sort of pulling back, I'm not really doing a lot of trades right now because most of my strategies are kind of bullish things. So I'm kind of on the sidelines in a lot. But I think it just goes back to, you know, risk reward and cash flow and, you know, zero DTE was coming more in play at that time. And then I think it was at that time, there was Monday, Wednesday, Friday. So we could do zero DTE three days a week. And so that's kind of what I focused on. And I got with a buddy of mine and we had done a bunch of research. And we were putting out research on that and we had a community. And we were buying data and we, I think we've talked about this before. We were buying data. We put together this thing. We were selling the results. So I did have a little bit of additional income with the research I had been doing, which I had been kind of already doing that. So I, you know, I did have a little bit of income coming in that could probably pay the bills, if you will. And then, then we just focused on those strategies and that eventually, those, we, you know, learned some things from those back testing. And then ultimately I decided to get back into price action as opposed to options testing. And that's when I got eventually launched Alpha",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 38,
      "total_chunks": 54,
      "start_timestamp": "00:44:14",
      "start_timestamp_seconds": 2654.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2654"
    }
  },
  {
    "text": "if you will. And then, then we just focused on those strategies and that eventually, those, we, you know, learned some things from those back testing. And then ultimately I decided to get back into price action as opposed to options testing. And that's when I got eventually launched Alpha Crunching in, I think it was November of 2022, which was about maybe two year, year and a half after I quit. So I did a bunch of research and realized, oh, okay, for this type of style, I really want to know more about price and just being on the right side of price action. So I kind of went over there and now I don't, I don't venture out of my option strategies very far anymore. And I'm just really focused on risk reward and probability of the system that we've kind of come up with. So I think that answer your question. Yeah. And it's also good to hear that, I mean, you're really taking like a, a programmatic approach to it, which is very cool. Yeah. So we have a few minutes left here. There's a couple of things that I wanted to hit with you. The first one though is when you were devising your strategy in general before Alpha Crunching, well, I didn't know I kind of carried over into it. But when you were refining through your strategy, walk me through at a high level that process. It started with back testing to",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 39,
      "total_chunks": 54,
      "start_timestamp": "00:45:23",
      "start_timestamp_seconds": 2723.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2723"
    }
  },
  {
    "text": "The first one though is when you were devising your strategy in general before Alpha Crunching, well, I didn't know I kind of carried over into it. But when you were refining through your strategy, walk me through at a high level that process. It started with back testing to some degree. So you're using ideas, but how did it go? Most of the strategies that I ended up testing were just, it's, you know, it's very simple. When I found over the years when it came to credit spreads, and this is something that I don't think most other people do. I think this is why I have my own thing going on is I trade a lot of at the money stuff. I don't look at IV. I don't typically try to roll, or I don't, I don't sell Delta 5 anything. I mean, I used to. So what I've kind of gotten into is like a sort of a fixed risk reward of at the money stuff. And it's either going to win or it's going to lose. So it there's no, you know, you don't know what's going to happen, but I know how much I can win, and I know how much I can lose. And I know what that win rate is going to be consistently over time. So I think over the years, I eventually figured out, and I get questions like this all the time, where we'll sell putsbreds and we had",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 40,
      "total_chunks": 54,
      "start_timestamp": "00:46:38",
      "start_timestamp_seconds": 2798.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2798"
    }
  },
  {
    "text": "can win, and I know how much I can lose. And I know what that win rate is going to be consistently over time. So I think over the years, I eventually figured out, and I get questions like this all the time, where we'll sell putsbreds and we had a great couple of months here until market turned down, had some losers. Now we're kind of waiting. And one of the, and we talked about this last time, I think I had you on my show, but one of the attractions of options to trade both sides. And I think if unless you're extremely advanced, I don't recommend trading both sides. I don't, I think with predispres at least, or even naked if you're selling strangles or whatever, like, you know, if you don't know how to roll or adjust and those type of things, like you have to be really careful because you can get blown out, which that has happened to me. I mean, even recently, I was selling, I was doing some iron condors and I had to like, I had to adjust and roll because because that's what the market was going straight up. But I think my, the strategies I end up focusing on, I think fall in line with what the market typically does. And typically the market goes up over time and some people call it positive drift or whatever. And so one thing I like to tell people is I trade",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 41,
      "total_chunks": 54,
      "start_timestamp": "00:47:55",
      "start_timestamp_seconds": 2875.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2875"
    }
  },
  {
    "text": "I think my, the strategies I end up focusing on, I think fall in line with what the market typically does. And typically the market goes up over time and some people call it positive drift or whatever. And so one thing I like to tell people is I trade a lot of put credits, breads mainly because the market tends to go up. The market goes up slower than it goes down. And so when you start introducing things like time and and option trading, if you have time, the market will tend to recover and come back up. Obviously, that when there's a bear market that doesn't happen, and you have some things to tell you that when it's a bear market. But so I think really narrowing and focusing on one strategy, instead of trying to trade and also instead of trying to trade every market environment, there's just certain market environments that are going to be different, like right now, that you know, if you sell call spreads every time the market goes down, you will lose money because most of the time it recovers. And the one time it doesn't recover isn't enough for you to make up the losses on the ones that it did that it didn't recover or it did recover, excuse me. So things don't work in reverse. I guess is what I'm saying when you're looking at long and short side, if you're what I call a real options trader,",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 42,
      "total_chunks": 54,
      "start_timestamp": "00:49:09",
      "start_timestamp_seconds": 2949.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=2949"
    }
  },
  {
    "text": "to make up the losses on the ones that it did that it didn't recover or it did recover, excuse me. So things don't work in reverse. I guess is what I'm saying when you're looking at long and short side, if you're what I call a real options trader, which means you are trading the Greeks and you're trying and probably I consider you kind of in that camp where you're trying to capture the risk premium and there's the whole another it's a whole other thing. That's awesome. I'm more like, hey, the market's going up, let's leverage the shit out of this until it stops going up. And now it's not going up and I'm just going to not do anything for a couple days, a couple weeks shit. It might be two months before I get anything significant off. And you know, I'll do zero DTE all the time because you can kind of that that's sort of like a bread and butter. But when the market's in sort of like it's like it was in I don't know, May, June or so. I laid off zero DTE and we were just doing one day, seven day and just wrote it all the way up. And now we're back now the markets down. We're out of those trades and doing a little bit of zero DTE because if you know if things kind of set up right. So I think you just got to know yourself",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 43,
      "total_chunks": 54,
      "start_timestamp": "00:50:31",
      "start_timestamp_seconds": 3031.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=3031"
    }
  },
  {
    "text": "day and just wrote it all the way up. And now we're back now the markets down. We're out of those trades and doing a little bit of zero DTE because if you know if things kind of set up right. So I think you just got to know yourself and what what you understand and what you can sit through and you have you have to be able to lose and watch I don't know, watch it lose and not do anything. So it comes down to your strategy, I guess. And I've just kind of gotten to the point of and I'm not all the way there. I'm about 90 of there. I've just taking the trade that you're set up there and just letting the math play out. And I try to do things that don't require very much adjustment. And I'll just take the loss when it comes. So yeah, yeah, it's awesome. I'll end the place with that. But yeah, no, it's it's really cool. And it's one of it's honestly, it's one of my my favorite things about you is like I consider you both a friend, but also a thought partner. I think it's so important to get around people who see things and do things differently than you do necessarily you being the proverbial you because like like you're talking about, I mean, I'm a degenerate bro. Like I'm trying to trade up down sideways and circles. I want to trade vols.",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 44,
      "total_chunks": 54,
      "start_timestamp": "00:51:41",
      "start_timestamp_seconds": 3101.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=3101"
    }
  },
  {
    "text": "it's so important to get around people who see things and do things differently than you do necessarily you being the proverbial you because like like you're talking about, I mean, I'm a degenerate bro. Like I'm trying to trade up down sideways and circles. I want to trade vols. It's going up. I want to trade that stock is it's going down. I want to trade post earnings announcement drift. Just out here slinging stuff. But you highlight another approach that's worked really well for you. And that's cool to me. That's really, really cool to me, especially as a reflection of markets. And how they are this space where you really and you hit it right at the end, you have to identify what works or you, you the individual because to your point, if you gave me what you're doing, the probability of me being able to just sit there and let it do what it's supposed to do is probably low. I would dork it up. I would be like, you know, that IV looks a little off. I bet you I could come up with something here. And then I'll just start tankering with shit. But that's that's the cool part about trading and options and like specific that you can really set things up that work for you. So I love hearing about that for you. Now, the last thing I want to ask you. And then we're going to have to do a",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 45,
      "total_chunks": 54,
      "start_timestamp": "00:52:38",
      "start_timestamp_seconds": 3158.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=3158"
    }
  },
  {
    "text": "But that's that's the cool part about trading and options and like specific that you can really set things up that work for you. So I love hearing about that for you. Now, the last thing I want to ask you. And then we're going to have to do a whole other session about this build out of alpha crunching and stuff like that. Because you and I had spent actually quite a bit of time talking about the idea. I remember when you were going through the original development of it, it was fascinating stuff. And I want to make sure people hear more about that story. But for the end of this session, I actually want to pivot you to this big thing. And it's something I don't know if you realize that there's so few of us that have gone through this process of like jumping into trading. Most people have one foot in one foot out. Like you said, there's nothing wrong with having a job. Totally cool. Literally totally cool. It's probably just a more efficient thing for a lot of people. But a lot of people do aspire to the idea of unlocking their own freedom, their own time. That's why a lot of us start trading. If you were to think about the primary steps you took to go from the trader that showed up to a thinkersworn conference to the trader that was able to make the leap from a well-paying job",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 46,
      "total_chunks": 54,
      "start_timestamp": "00:53:45",
      "start_timestamp_seconds": 3225.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=3225"
    }
  },
  {
    "text": "own freedom, their own time. That's why a lot of us start trading. If you were to think about the primary steps you took to go from the trader that showed up to a thinkersworn conference to the trader that was able to make the leap from a well-paying job and trade your own book. What were the primary muscle movements that happened over that time frame that made it possible? Definitely persistence and curiosity. Those things have to be there. Because so I blew out a couple of counts in the beginning. Oh yeah. And so I paid my tuition like all good boys do. And I think it's just, you know, there's this thing like I want to use the word ego, right? Like I have a big ego. I've learned to remove the ego from my trades. But I have a big enough ego to proclaim that I can do this. So it's kind of this weird thing that in the beginning, I had an ego that, oh, I'm smart. I'm an IT guy. I know things that nobody else knows. I'm going to be able to figure this out. And you know, everyone figures it out for a little while. Everyone figure out is that you can, you know, I've seen these memes and it's like a guy looking in the mirror and the meme says it's not the bull market. You really are a genius. And it's so true where it's just like I remember",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 47,
      "total_chunks": 54,
      "start_timestamp": "00:54:42",
      "start_timestamp_seconds": 3282.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=3282"
    }
  },
  {
    "text": "for a little while. Everyone figure out is that you can, you know, I've seen these memes and it's like a guy looking in the mirror and the meme says it's not the bull market. You really are a genius. And it's so true where it's just like I remember and someone put me in my place. It was a old friend of mine. He was kind of like a real estate guy and he knew I was trading and and I was I was doing options in a smaller account. And I was being conservative and, you know, I think I was up 30 or 40 and he's like, oh, how's the options trading going? And I was like, great, man, I'm up 30. And he's like, yeah, so was everybody else. And I was like, and they weren't doing anything. Yes. And then so it's those little things that you, you know, understanding like, like, you're, you know, you're not a genius, you're methodical or whatever. But just just having the confidence, I guess, to like keep going. And I think ultimately, like for me, it was just like, I'm just going to do this. I love it. I like just fascinated by the math part and just markets in general. So if you know, the whole finance piece is definitely interesting and how learning about how the world works, I think that is what kept me interested because you're like, oh, whether you win or lose in",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 48,
      "total_chunks": 54,
      "start_timestamp": "00:56:14",
      "start_timestamp_seconds": 3374.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=3374"
    }
  },
  {
    "text": "I like just fascinated by the math part and just markets in general. So if you know, the whole finance piece is definitely interesting and how learning about how the world works, I think that is what kept me interested because you're like, oh, whether you win or lose in the market did something crazy, you're like, well, why would the market go up if there's bad economic reports? And then you realize, oh, well, the Fed prints money. And that's like, I never knew anything like I don't have any finance to go. I've just kind of learned this stuff over the years. And so you know, you just have to have an interest and be persistent with something. And what I normally would tell someone in the beginning is just if you're going to trade options, find one thing, one ticker, maybe two or three, you know, one option structure. Maybe that's credit spreads or condors or whatever. And just, yeah, just one setup. I think starting with verticals is best because it's the lower risk and it kind of makes sense. You can, you can you know, trade it directionally. And then you can flip, you know, you do a vertical debit spread. And it's kind of a directional you buy a call spread and you want it to go up. And then you eventually get to you flip that to a credit spread where you just don't want it to go down kind of thing. And",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 49,
      "total_chunks": 54,
      "start_timestamp": "00:57:33",
      "start_timestamp_seconds": 3453.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=3453"
    }
  },
  {
    "text": "you do a vertical debit spread. And it's kind of a directional you buy a call spread and you want it to go up. And then you eventually get to you flip that to a credit spread where you just don't want it to go down kind of thing. And I think timeframe is important that you should try to focus on one time frame. So if you're working a day job, you probably want to watch the daily chart, maybe a four-hour chart, but don't come up with some strategy on a five-minute chart because you won't be able to execute that consistently. And then you're going to want to and you're, you know, at some point, you have to say, no, I'm not going to take this trade. And if you've sent, if you've spent two hours in front of the computer and you've been able to say, no, I'm not going to take this trade, that that that means you're good. But most people, after two hours on the computer, what will I got to do something? And then they just take it or they, they, you know, jump the gun or whatever. So I think your timeframe is important and your duration. So if you're, I think most people probably end up in the tasty trade world of 30 to 45 days. And I think that's a good place to start. But if you want to make more and if you have more time, you can",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 50,
      "total_chunks": 54,
      "start_timestamp": "00:58:46",
      "start_timestamp_seconds": 3526.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=3526"
    }
  },
  {
    "text": "timeframe is important and your duration. So if you're, I think most people probably end up in the tasty trade world of 30 to 45 days. And I think that's a good place to start. But if you want to make more and if you have more time, you can then lower your timeframe. I kind of, kind of, kind of fracked the, fracked little nature of it all, you know, and that's ultimately what I've gotten into is like, okay, we have options every day. I don't trade zero DTE every day, but I trade a lot of one DTEs now. And I can be consistent with my ticker, my duration, my strike selection. And it's just, you know, it's very repetitive. And, you know, the exciting part is, it's boring to put the trade on. The exciting part is, is this one going to work once it's on? You know, you don't know till after. So, but not doing anything about it. So yeah, that's kind of where I ended up. Yeah. That's awesome. Well, I always tell people the exciting part is figuring out where you're going to spend all the money you make. You know, you could be excited somewhere else. Take the money and go, go, go do, go do something fun with it. But man, I think the, the main thing people should walk away from is this concept of building an approach that works for you. And taking the time to see what",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 51,
      "total_chunks": 54,
      "start_timestamp": "00:59:47",
      "start_timestamp_seconds": 3587.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=3587"
    }
  },
  {
    "text": "could be excited somewhere else. Take the money and go, go, go do, go do something fun with it. But man, I think the, the main thing people should walk away from is this concept of building an approach that works for you. And taking the time to see what that is in understanding that there are so many different approaches that work for different people. People that are familiar with my work know that I have a very different approach. And the cool part is is we both have found things that work for us, which is again, that's the coolest part of trading. So Eric, thanks so much for hanging out for a little bit, walking through the way that you look at markets. Like I said, we'll definitely have to have you back on to take a look at some of the other stuff that you've really developed, maybe get into the details more on building the approach and going through making this this analytics organization. Really that that you've launched. It's all very cool stuff to me. But thanks so much for coming to hang out. I'll obviously throw links to all of your stuff in the show notes below for everybody that wants to take a look. But is there anywhere in particular you want to direct people to? You can find me on Twitter if you want to reach out directly. My handle's option assassin. Oh, no, no. Oh, I grabbed that one back.",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 52,
      "total_chunks": 54,
      "start_timestamp": "01:00:51",
      "start_timestamp_seconds": 3651.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=3651"
    }
  },
  {
    "text": "the show notes below for everybody that wants to take a look. But is there anywhere in particular you want to direct people to? You can find me on Twitter if you want to reach out directly. My handle's option assassin. Oh, no, no. Oh, I grabbed that one back. Twitter first came out. But yeah, I run the stock market option trading YouTube channel and podcast so you can find me over there. But if you want to reach out to me directly, Twitter's probably the best place. Sweet. I'll have all of that below for you to take a look at. Thanks everybody for hanging out until the end. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "FnVyDaukQZE",
      "title": "Full Time Options Trading w/ @StockMarketOptionsTrading  | The Outlier Podcast Ep73",
      "url": "https://www.youtube.com/watch?v=FnVyDaukQZE",
      "upload_date": "20240807",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 53,
      "total_chunks": 54,
      "start_timestamp": "01:01:50",
      "start_timestamp_seconds": 3710.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FnVyDaukQZE&t=3710"
    }
  }
]