[
  {
    "text": "hey everyone eric here wanted to do a quick update on the small stacks portfolio made a trade earlier this week i started building out my excel tracker for it which i'll share going forward but for now i just jotted it on on the page here so let's take a look so still out right now with the two october 24 puts i traded those for 50 cents they're essentially trading at value right now with xlf kind of still drifting sideways i am happy to see price above the 200-day moving average now i do want to see the 50 cross above that but that's just you know longer term thing right now there's nothing to be done in the trade just leave it on we're still um 28 days to expiry next up is zynga so in there i sold the nine october eight and a half put so let's take a look at zynga right now they're trading at eight seven five i'm still down here so i'm comfortable with where i'm at this is a trade that i will roll if i need to but still plenty of time left on the table so again another trade that i don't really need to make an adjustment in it and i do not intend to now the one that i did make a couple trades in is kroger so in here i established a leap diagonal earlier this week and it's because i like the product",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "20200905",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "Content about Portfolio Update - Small Stacks Pt5",
      "chunk_index": 0,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=0"
    }
  },
  {
    "text": "another trade that i don't really need to make an adjustment in it and i do not intend to now the one that i did make a couple trades in is kroger so in here i established a leap diagonal earlier this week and it's because i like the product in general and i thought that it offered some good exposure and a great return on capital so i ended up buying one of the 16 april 21 29 calls at 8.42 cents and i sold one of the 11 september 37 calls at a dollar six now i always talk about wanting to sell at a ratio if i can but you know it's a smaller account so in this scenario i wasn't able to sell out a ratio which is completely okay i still structure the trade mining my deltas so that i do not have upside risk that remains to be super important to me so actually today i ended up taking the trade down so i closed out those 37 calls i paid 42 cents for it so i realized a profit of 64 bucks and then i laid out the 25 september 36 and a half calls and i collected dollar 16. so that will take me through earnings unless i could take it off before earnings which if i can i will take it again probably a little more you know 55 60 profit and then see what else is out there so for",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "20200905",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "Content about Portfolio Update - Small Stacks Pt5",
      "chunk_index": 1,
      "total_chunks": 7,
      "start_timestamp": "00:01:12",
      "start_timestamp_seconds": 72.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=72"
    }
  },
  {
    "text": "half calls and i collected dollar 16. so that will take me through earnings unless i could take it off before earnings which if i can i will take it again probably a little more you know 55 60 profit and then see what else is out there so for current portfolio stats we're you know i'm still considering it 5000 whereas technically it is 5064 including that recent gain but i'll start to calculate that probably on a monthly aggregate basis the allocation currently is four thousand ninety two dollars so that's about eighty-two percent utilized realized p l is 64 bucks which is a 1.3 return on the portfolio that was in three days so obviously um happy with that return and then the credit outstanding is 193 bucks that represents 3.9 of the portfolio now one adjustment i do intend to make going forward is if i can close out of xlf for a profit instead of taking assignment on it which includes you know rolling i likely will take that down and put on another leap in favor of it and the reason for that is the 50 is fine but i don't want to tie up the 2400 in the trade i laid it out there because it's a sector etf i'm okay with the risk and if i end up taking ownership of it i'm fine with it but i would prefer to get into a leap instead so that i can kind of",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "20200905",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "Content about Portfolio Update - Small Stacks Pt5",
      "chunk_index": 2,
      "total_chunks": 7,
      "start_timestamp": "00:02:33",
      "start_timestamp_seconds": 153.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=153"
    }
  },
  {
    "text": "up the 2400 in the trade i laid it out there because it's a sector etf i'm okay with the risk and if i end up taking ownership of it i'm fine with it but i would prefer to get into a leap instead so that i can kind of enjoy some of the increased volatility we're seeing and pretty much increase the efficiency of the of the account because the kroger leap diagonal right now is absolutely outperforming everything it's you know over a 12 return on invested capital whereas you know xlf and zynga both are a bit lower than that but i will definitely make sure i maintain at least one coverage strangle in the account and once i can take zynga down i will still look for some sort of sector etf etf in general i am convicted in that simply because i want the reduction in unsystemic risk so then once that's set up i will probably maintain that one core holding in some sort of index etf or sector etf and then i am looking to have on probably two leaps at the same time making sure i leave room to scale in so for kroger i allocated 1500 to that trade and right now we're using 842 of those dollars which i'm completely okay with that is a very reasonable um return so fine with that however the that's really the beauty of leaps is to be able to efficiently get a decent",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "20200905",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "Content about Portfolio Update - Small Stacks Pt5",
      "chunk_index": 3,
      "total_chunks": 7,
      "start_timestamp": "00:03:58",
      "start_timestamp_seconds": 238.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=238"
    }
  },
  {
    "text": "for kroger i allocated 1500 to that trade and right now we're using 842 of those dollars which i'm completely okay with that is a very reasonable um return so fine with that however the that's really the beauty of leaps is to be able to efficiently get a decent return on your capital and once i can scale into these positions i will make sure i continue to sell at a ratio so that i also do not cap my upside so i wanted to walk through another diagonal that i'm eyeing for the small stacks portfolio and that is pfizer pfe so what i'm eyeing in here is something out in 16 july 21 probably the 28 calls those are trading at around nine dollars and it's a 83 delta and then i would sell uh to october 36 and a half call against it so the reason why i like this trade one i like pfizer a lot where it is i also think that it's a very solid return on invested capital it's a 900 trade to open up and i would collect 128 on the short call so it's a 14 return on invested capital over the course of 28 days if i hold to expiration now part of that is because there is earnings coming up the 27th of next month which is totally fine not worried about that and the thing with pfizer that i enjoy obviously is they're working on their covid",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "20200905",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "Content about Portfolio Update - Small Stacks Pt5",
      "chunk_index": 4,
      "total_chunks": 7,
      "start_timestamp": "00:05:21",
      "start_timestamp_seconds": 321.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=321"
    }
  },
  {
    "text": "over the course of 28 days if i hold to expiration now part of that is because there is earnings coming up the 27th of next month which is totally fine not worried about that and the thing with pfizer that i enjoy obviously is they're working on their covid cure so i like the involvement there i would like to see it come down just a little bit more which may adjust the trade a bit but i am going to target an entry between um 35 and 36 somewhere in there so i'm kind of holding off waiting for that now if i do see a good trade in there i will take it even before i have the trades in xlf off and the reason why i'm doing that is because i have room in the portfolio yes i will be near max allocated and it will reduce my position in kroger my max position in kroger but that's again one of the trifles with smaller portfolios is working through those decisions so this is where we're at currently obviously i'll take a look at the pfizer trade see if that materializes for me as always if anybody's any questions or any comments that they want to work through feel free to let me know and i will catch you all later",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "20200905",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "Content about Portfolio Update - Small Stacks Pt5",
      "chunk_index": 5,
      "total_chunks": 7,
      "start_timestamp": "00:06:42",
      "start_timestamp_seconds": 402.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=402"
    }
  },
  {
    "text": "anybody's any questions or any comments that they want to work through feel free to let me know and i will catch you all later",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "20200905",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "Content about Portfolio Update - Small Stacks Pt5",
      "chunk_index": 6,
      "total_chunks": 7,
      "start_timestamp": "00:07:59",
      "start_timestamp_seconds": 479.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=479"
    }
  }
]