[
  {
    "text": "Everyone, Eric here wanted to do a quick update on the small stack portfolio. Made a trade earlier this week. I started building out my Excel tracker for it, which I'll share going forward. But for now, I just jotted it on the page here. So let's take a look. So still out right now with the two October 24 puts. I traded those for 50 cents. They're essentially trading at value right now with XLF kind of still drift and sideways. I am happy to see price above the 200 day moving average. Now I do want to see the 50 cross above that, but that's just, you know, longer term thing right now. There's nothing to be done in the trade. Just leave it on. We're still 28 days to expiration. Next up is Zinga. So in there, I sold the nine October eight and a half put. So let's take a look at Zinga right now. They're trading at eight, seven, five. I'm still down here. So I'm comfortable with where I'm at. This is a trade that I will roll if I need to, but still plenty of time left on the table. So again, another trade that I don't really need to make an adjustment in it. And I do not intend to now the one that I did make a couple trades in is broker. So in here, I established a leap diagonal earlier this week. And it's because I like the product in",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "2020-09-05T01:40:51Z",
      "duration": "PT8M8S",
      "channel_name": "",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=0"
    }
  },
  {
    "text": "trade that I don't really need to make an adjustment in it. And I do not intend to now the one that I did make a couple trades in is broker. So in here, I established a leap diagonal earlier this week. And it's because I like the product in general. And I thought that it offered some good exposure and a great return on capital. So I ended up buying one of the 16 April 21 29 calls at 8.42. And I sold one of the 11 September 37 calls at a dollar six. Now I always talk about wanting to sell at a ratio if I can, but, you know, it's a smaller account. So in this scenario, I wasn't able to sell at a ratio, which is completely okay. I still structure the trade mining my deltas so that I do not have upside risk. That remains to be super important to me. So actually today. I ended up taking the trade down. So I closed out those 37 calls. I paid 42 cents for it. So I realized a profit of 64 bucks. And then I laid out the 25 September 36 and a half calls. And I collected 1.16. So that will take me through earnings, unless I could take it off before earnings, which if I can, I will take it again, probably a little more, you know, 55, 60 profit. And then see what else is out there. So for current portfolio stats",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "2020-09-05T01:40:51Z",
      "duration": "PT8M8S",
      "channel_name": "",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 7,
      "start_timestamp": "00:01:11",
      "start_timestamp_seconds": 71.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=71"
    }
  },
  {
    "text": "And I collected 1.16. So that will take me through earnings, unless I could take it off before earnings, which if I can, I will take it again, probably a little more, you know, 55, 60 profit. And then see what else is out there. So for current portfolio stats were, you know, I'm still considering it 5,000. Whereas technically it is 5,064, including that recent gain. But I'll start to calculate that probably on a monthly aggregate basis. The allocation currently is 4,092. So that's about 82 utilized. Realized PNL is 64 bucks, which is a 1.3 return on the portfolio. That was in three days. So obviously happy with that return. And then the credit outstanding is 193. That represents 3.9 of the portfolio. Now one adjustment I do intend to make going forward is if I can close out of XLF for a profit instead of taking assignment on it, which includes, you know, rolling, I likely will take that down and put on another leap in favor of it. And the reason for that is the 50 is fine. But I don't want to tie up the 2,400 in the trade. I laid it out there because it's a sector ETF. I'm okay with the risk. And if I end up taking ownership of it, I'm fine with it. But I would prefer to get into a leap instead. So that I can kind of enjoy some of the increased volatility we're seeing. And pretty much",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "2020-09-05T01:40:51Z",
      "duration": "PT8M8S",
      "channel_name": "",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 7,
      "start_timestamp": "00:02:29",
      "start_timestamp_seconds": 149.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=149"
    }
  },
  {
    "text": "because it's a sector ETF. I'm okay with the risk. And if I end up taking ownership of it, I'm fine with it. But I would prefer to get into a leap instead. So that I can kind of enjoy some of the increased volatility we're seeing. And pretty much increase the efficiency of the account because the broker-leaped diagonal right now is absolutely outperforming everything. It's, you know, over a 12 return on invested capital. Whereas, you know, XLF and Zingo both are a bit lower than that. But I will definitely make sure I maintain at least one coverage strangle in the account. And once I can take Zingo down, I will still look for some sort of sector ETF ETF in general. I am convicted in that simply because I want the reduction in unsystemic risk. So then once that's set up, I will probably maintain that one core holding in some sort of index ETF or sector ETF. And then I am looking to have on probably two leaps at the same time, making sure I leave room to scale in. So for Kruger, I allocated 1,500 to that trade. And right now we're using 842 of those dollars, which I'm completely okay with. That is a very reasonable return. So fine with that. However, that's really the beauty of leaps is to be able to efficiently get a decent return on your capital. And once I can scale into these positions, I will make sure",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "2020-09-05T01:40:51Z",
      "duration": "PT8M8S",
      "channel_name": "",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 7,
      "start_timestamp": "00:04:04",
      "start_timestamp_seconds": 244.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=244"
    }
  },
  {
    "text": "of those dollars, which I'm completely okay with. That is a very reasonable return. So fine with that. However, that's really the beauty of leaps is to be able to efficiently get a decent return on your capital. And once I can scale into these positions, I will make sure I continue to sell at a ratio so that I also do not cap my upside. So I wanted to walk through another diagonal that I'm eyeing for the small stacks portfolio. And that is Pfizer PFE. So what I'm eyeing in here is something out in 16 July, 21, probably the 28 calls. Those are trading at around 9 and it's 83 delta. And then I would sell to October 36 and a half call against it. So the reason why I like this trade one, I like Pfizer a lot where it is. I also think that it's a very solid return on invested capital to 900 trade to open up and I would collect 128 on the short call. So it's a 14 return on invested capital over the course of 28 days. If I hold to expiration now part of that is because there is earnings coming up the 27th of next month, which is totally fine. Not worried about that. And the thing with Pfizer that I enjoy, obviously is they're working on their COVID cure. So I like the involvement there. I would like to see it come down just a little bit more,",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "2020-09-05T01:40:51Z",
      "duration": "PT8M8S",
      "channel_name": "",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 7,
      "start_timestamp": "00:05:26",
      "start_timestamp_seconds": 326.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=326"
    }
  },
  {
    "text": "coming up the 27th of next month, which is totally fine. Not worried about that. And the thing with Pfizer that I enjoy, obviously is they're working on their COVID cure. So I like the involvement there. I would like to see it come down just a little bit more, which may adjust the trade a bit. But I am going to target an entry between 35 and 36 somewhere in there. So I'm kind of holding off waiting for that. Now if I do see a good trade in there. I will take it even before I have the trades in Excel F off. And the reason why I'm doing that is because I have room in the portfolio. Yes, I will be near max allocated and it will reduce my position and Kruger. My max position and Kruger. But that's again, one of the trifles with smaller portfolios is working through those decisions. So this is where we're at currently. Obviously I'll take a look at the Pfizer trade, see if that materialized this for me. As always, if anybody's any questions or any comments that they want to work through, feel free to let me know and I will catch you all later.",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "2020-09-05T01:40:51Z",
      "duration": "PT8M8S",
      "channel_name": "",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 7,
      "start_timestamp": "00:06:44",
      "start_timestamp_seconds": 404.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=404"
    }
  },
  {
    "text": "I will catch you all later.",
    "metadata": {
      "video_id": "fp7kppTc384",
      "title": "Portfolio Update - Small Stacks Pt5",
      "url": "https://www.youtube.com/watch?v=fp7kppTc384",
      "upload_date": "2020-09-05T01:40:51Z",
      "duration": "PT8M8S",
      "channel_name": "",
      "description": "I review my current positions in XLF, ZNGA, and KR. I walk through a potential trade in PFE.",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 7,
      "start_timestamp": "00:08:03",
      "start_timestamp_seconds": 483.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fp7kppTc384&t=483"
    }
  }
]