[
  {
    "text": "What's up, outliers? Couple of seconds late, how to finish doing a little stretch routine. Try to recharge the old sciatica. Everyone's in a while. I have to lay down for a little bit and try to reset the clock on it before it starts hurting like a mother. What's up, everybody? I hope we are off to a great week. The, I don't know, last trading week was pretty interesting. I got to say. So I'm excited to talk a little bit about that. And we have a couple of questions that were sent in that I want to make sure we hit also. There it is. Like I couldn't see my stuff for a second. Looks like we are up and running. Perfect. Sweet. So let me grab. There was a comment on the post that I want to hit. It was a great question. So for those that don't know, when we use the YouTube studio for some reason, it doesn't let me see community comments. I can only see it on my phone. They'll just read it from the phone. So agenda for today. Pretty simple. What I want to cover first is we do have a quiz that I want to work through with you all. Then I want to take a look at, well, I guess we'll start with some of the questions. Then we'll do the quiz. And then we'll kind of navigate around depending on what conversations come up and what capacity.",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 86,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=0"
    }
  },
  {
    "text": "a quiz that I want to work through with you all. Then I want to take a look at, well, I guess we'll start with some of the questions. Then we'll do the quiz. And then we'll kind of navigate around depending on what conversations come up and what capacity. So this session is kind of like the last few. We're pivoting away from the really structured learning components. If you've missed any of those, go back to the first episode in this whole playlist. And we have literally like a comprehensive rundown of what we've learned so far, which was in the beginning very, very structured, you know about like the basics. So let me grab this chat so I can say hello to everybody. And it looks like Reese is here. Shrej is here. Dr. Zeya's Joey Pollo, H Jonathan and Mary Shell. Beautiful. We got the gang in town. Mary so where's the quiz? I will post it into the chat. So we will look at the quiz together. It's designed that the most of the questions are going to be open. I like open ended questions. I don't like multiple choice. I know that they're easier for like a teacher to grade. But in order to evaluate a thought process, it's much harder to navigate the nuance of things. So yeah, that's why it's a little bit different. And so here's the first question that I do want to hit. I'll throw it out to the",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 86,
      "start_timestamp": "00:01:16",
      "start_timestamp_seconds": 76.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=76"
    }
  },
  {
    "text": "for like a teacher to grade. But in order to evaluate a thought process, it's much harder to navigate the nuance of things. So yeah, that's why it's a little bit different. And so here's the first question that I do want to hit. I'll throw it out to the chat again. I have to pull it up on the phone because I can't get it from the studio. And it says this is from Lord Slothable, which is a fantastic name. We have to give a shout out to Lord Slothable. And they say, I'm having trouble figuring out the difference between a covered option and a single option where there is only one leg in the strike. Now the last part of that only one leg in the strike, that doesn't make sense, which we'll talk about. But we can definitely grasp on to the meat of this question, which is a covered option versus a single option. So first thing for you, Mr. Lord Slothable, is a covered option and a single option actually are not disparate things. And we'll take a look at an example together. So if we're trading TLT, just because that happens to be what I have up right now. And if we look at a single option, we can do essentially four things for a single option. We can come in here and we can buy a call. We can sell a call. We can buy a put or we can sell",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 86,
      "start_timestamp": "00:02:34",
      "start_timestamp_seconds": 154.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=154"
    }
  },
  {
    "text": "be what I have up right now. And if we look at a single option, we can do essentially four things for a single option. We can come in here and we can buy a call. We can sell a call. We can buy a put or we can sell a put. Those are all single options. Now all of those single options can have different risk profiles that make them covered or uncovered, which for uncovered, we refer to that as naked. Those are really the two buckets. So you can have a single option that's either covered or naked and it's context dependent. So an example of a covered option is if I go in here to sell this put and I have the cash set aside to buy 100 shares at my strike price. That would be covered. Another example of a covered option, you wouldn't really refer to it as a covered option, but it inherently is so is if you buy that put, it's covered because as soon as you pay your debit, that's your max risk on the trade. It can't lose more than that. That's all there is to it. Now you can have another scenario where if we sell this put and we have a stock position that actually covers us technically. You can do the same thing on the call side. So if I sell a call and it's just a short call, we would call that a naked short call.",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 86,
      "start_timestamp": "00:03:48",
      "start_timestamp_seconds": 228.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=228"
    }
  },
  {
    "text": "have another scenario where if we sell this put and we have a stock position that actually covers us technically. You can do the same thing on the call side. So if I sell a call and it's just a short call, we would call that a naked short call. And that means that we don't have any underlying to cover it. It means that it's just a naked short call. It's an option that's out alone and unafraid. Normally when we refer to naked options, we would refer to that in the context of selling them. And when we're buying them colloquially, we would refer to them as singles, a long option whatever. But the nuances when we're talking about a covered option is normally that's going to be a short option that's paired with something. So for example, if we have a short call and we look at the risk profile on this short call, you'll see that it has unlimited risk because the underlying can go up into perpetuity and there's nothing that stops it. Now we can have a covered call and the context of a covered call would be if we have shares that then cap our risk. That's what a covered call would be. So the way to think about the difference between covered options and single options is covered options typically are going to be short options colloquially like when we're talking about them. There will be short options that have some sort",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 86,
      "start_timestamp": "00:05:12",
      "start_timestamp_seconds": 312.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=312"
    }
  },
  {
    "text": "cap our risk. That's what a covered call would be. So the way to think about the difference between covered options and single options is covered options typically are going to be short options colloquially like when we're talking about them. There will be short options that have some sort of other trade associated with it that decreases the total risk profile from an unlimited potential risk. Now this idea of like unlimited risk versus defined risk, I actually think it's important to talk about that because this one is actually really confusing to people. So and these are actually some of our quiz questions. So we'll start with your first quiz question here, which is if I sell a put, does this is this undefined risk or is this defined risk? If I sell a put is this undefined risk or defined risk. And the reason I asked this question is you'll you'll get a sense in a second, but I want to root out the difference between how we colloquially talk about options and then what the actual reality is. So naked short put is that risk defined or risk undefined. And he guesses and there's two different answers to this one. Joey says undefined but technically defined since as a floor. Yep, that's correct. So for Cedar Savage is also correct, Robo is also correct. Joey is definitely the most correct out of these. So for Elon songs also correct. So for Cedar Savage, Robo and Elon",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 86,
      "start_timestamp": "00:06:45",
      "start_timestamp_seconds": 405.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=405"
    }
  },
  {
    "text": "answers to this one. Joey says undefined but technically defined since as a floor. Yep, that's correct. So for Cedar Savage is also correct, Robo is also correct. Joey is definitely the most correct out of these. So for Elon songs also correct. So for Cedar Savage, Robo and Elon songs, are you familiar with the second part that Joey is talking about that we refer to it is undefined, but it actually is defined. You guys know why that's the case. And again, this is why I want to talk about this because there's nuance in the language. Robo says no, Elon songs says limited risk, that's it. So a stock can go to zero. Where does it go pass zero? Right? It gets buried. It's not a commodity, something like oil crude oil futures that have a commodity component. They can go negative because there's storage costs. There's transportation costs. There's insurance on the barrels of oil themselves. That is not the case here. So this stock can only go to zero. So we call it undefined risk, but it's not undefined risk. It's completely defined. Sooner or later, this will you go to zero. You can't go below zero with these equities. So does that part make sense with respect to the slight nuance between defined and undefined risk when we're talking about something like a naked short put that we would call it colloquially is undefined risk, but it actually is defined. Vladimir Putin says the",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 86,
      "start_timestamp": "00:08:16",
      "start_timestamp_seconds": 496.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=496"
    }
  },
  {
    "text": "below zero with these equities. So does that part make sense with respect to the slight nuance between defined and undefined risk when we're talking about something like a naked short put that we would call it colloquially is undefined risk, but it actually is defined. Vladimir Putin says the strike is the floor, not the strike, but it would be the stock going to zero. That's the floor. Okay, cool. So we're good there. Now what about an inverse scenario? What if we sell a call? Is this defined or undefined? So the same thought processes before. Joey says unlimited. Seater says true undefined. Robo says totally undefined. Policies undefined. Okay, great questions or kind of great inputs. Is there, Lord's Lothable, we hit your, I don't know if you caught the answer, we actually hit your question like right at the beginning. So if you want to rewind, if you missed it, you can go back, check it out. Vladimir Putin says again, covered call, nope, this is just a short call. We're talking about a short call. And so far, Joey, Seater, Robo, Polo, H all say undefined. So here's the follow on question. And again, this is pedantic, but I want the point to be made, because I think it's an important consideration. Are there unlimited resources on planet earth? So if we think about the value of everything that exists, is it unlimited or is there a limited amount of value that exists? Elon Song",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 86,
      "start_timestamp": "00:09:53",
      "start_timestamp_seconds": 593.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=593"
    }
  },
  {
    "text": "is pedantic, but I want the point to be made, because I think it's an important consideration. Are there unlimited resources on planet earth? So if we think about the value of everything that exists, is it unlimited or is there a limited amount of value that exists? Elon Song says yes. Technically limited. Yeah. Seater says the spaceship earth, okay. Limited resource, but we make a value. Joey says sure, but what is the limit? It's actually undefined, but limited. Exactly. Joey has the exact nuance I'm hunting for there. So Polo says if you consider IP, there's no upper bound. Again, when we talk about value, it's not the value that I place on something. I could say my value is Eric is 10 billion. If there's not a counter party that agrees that my value is 10 billion, there's no market. So to your point, I can value myself at whatever I want, but what makes undefined value is the counter party that confirms that value. Otherwise, it's just a number. So all I'm highlighting in this instance, and I use all of the resources in the world as a obviously a really, really far removed example, but the example I'm making is even something like this. At some point becomes defined. We just have no idea where we have no idea where I've never seen a stock go to infinity, obviously, because you can't. So all I'm highlighting is that when we're looking at this idea",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 86,
      "start_timestamp": "00:11:34",
      "start_timestamp_seconds": 694.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=694"
    }
  },
  {
    "text": "but the example I'm making is even something like this. At some point becomes defined. We just have no idea where we have no idea where I've never seen a stock go to infinity, obviously, because you can't. So all I'm highlighting is that when we're looking at this idea of defined undefined risk, we use the terms undefined colloquially. We use them as a shortcut, a bypass. It's just a little faster than to say that there's a bunch of value and we don't know where it is. We just say undefined, even to the downside that clearly has a zero, it's the same thing to the upside. Sooner or later, value that you run out of how high a company can achieve a market cap, again, we don't currently have unlimited market cap companies and we never will. Sooner or later, they will hit some sort of pinnacle of value that they can provide before they erode. So that's a really extreme example, not super applicable here. The main point I'm trying to highlight with this example though is the nuance of when we talk about things like defined versus undefined risk. That's all. Each says so then whatever a counterparty is willing to pay above your strike is the upper bound limit willing forced. Yeah, I mean, realistically speaking, this is when I take this into a more realistic example, do you know what your risk is defined to the upside? Because it is defined. It's absolutely",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 86,
      "start_timestamp": "00:13:22",
      "start_timestamp_seconds": 802.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=802"
    }
  },
  {
    "text": "whatever a counterparty is willing to pay above your strike is the upper bound limit willing forced. Yeah, I mean, realistically speaking, this is when I take this into a more realistic example, do you know what your risk is defined to the upside? Because it is defined. It's absolutely defined. I use that first example as an extreme theoretical conversation, but there's a practical answer to this that's very easy. So what's the defined risk to the upside? Because it is defined 100. And you guess this depends on the plan. Nope, it's not wrong, but that's not the example I'm using. Your broker, your broker will liquidate your account. That's where it's defined. Now where that point is, we'll depend on the broker. We'll depend on the size of the account. It'll depend on the collateral account. Your broker will not let you hold something to infinity, right? Like your risk is still defined. It's not unlimited risk because sooner or later, your broker is going to be like margin requirement is up. Marge requirement is up. Marge requirement exceeds your account value. You are now in a margin call. You have X period of time to add capital before I start liquidating your shit for you. You didn't meet the requirement to plus up your capital. I'm liquidating your account. You're now in a debit to me for X number of dollars. That's where it's defined. So you absolutely can exceed your total account value, but it's",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 86,
      "start_timestamp": "00:14:46",
      "start_timestamp_seconds": 886.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=886"
    }
  },
  {
    "text": "capital before I start liquidating your shit for you. You didn't meet the requirement to plus up your capital. I'm liquidating your account. You're now in a debit to me for X number of dollars. That's where it's defined. So you absolutely can exceed your total account value, but it's not going to go to infinity. Sooner or later, your broker is responsible for the risk. They're literally not going to let it go to infinity. So even when we're looking at something like a covered call, it in no way is undefined in a practical sense because your broker will not let that happen. Again, that's the nuance of these things. There's a completely theoretical component to learning options, which again, you guys, the theoretical answer is literally on point. Everybody saying totally undefined. It is on point because it can go to infinity where that is and where finite resources on planet Earth run out. I don't know, but short of that, technically, it can go there. That would define it at some point. Again, an undefined point. So we don't know where it is. It's not infinite. But way before we get anywhere near that, your broker is going to close your account done. So that's the nuance when we're talking about define undefined. The reason why we care about discussing defined undefined risk profiles is simply because it helps us understand the behavior of options in a quicker way to synthesize it. Like that's pretty much",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 86,
      "start_timestamp": "00:16:10",
      "start_timestamp_seconds": 970.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=970"
    }
  },
  {
    "text": "is going to close your account done. So that's the nuance when we're talking about define undefined. The reason why we care about discussing defined undefined risk profiles is simply because it helps us understand the behavior of options in a quicker way to synthesize it. Like that's pretty much it. It's just a slightly faster way to think about and to discuss options positions. So G36 is here. They're getting clapped on spy options. That happens. H says God selling naked calls on Burke A and rolling thinking he could get out, which would be a bastard and a half. Yeah. Well, I mean, sooner or later, God just throws tsunami or some shit and then he'll take care of it. But yeah. So yeah, Elon Seng says these are kind of tricky questions. Yeah, they are. They're nuanced questions. We're not at the easy questions. I have plenty of easy questions. I'll throw some of those in so that we can get our confidence up. Here's your first easy question. So you want to place a bullish trade. What options structures make sense? It's about a softball as you can get. Paul says is the broker liable and if it count is deep, oh, of course. Yeah. So the broker is reliable is completely, completely accountable for your risk. They obviously will pursue you to clear their risk, but they are the, they are the counterparty. They are responsible for covering the risk. That's why you see things",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 86,
      "start_timestamp": "00:17:15",
      "start_timestamp_seconds": 1035.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=1035"
    }
  },
  {
    "text": "if it count is deep, oh, of course. Yeah. So the broker is reliable is completely, completely accountable for your risk. They obviously will pursue you to clear their risk, but they are the, they are the counterparty. They are responsible for covering the risk. That's why you see things like bank runs, slightly different example, but in the example of a run on a bank, even Silicon Valley, Silicon Valley had the capital, but they weren't liquid enough to provide the capital fast enough. And that's what literally caused that bank to go under. They were completely liable to produce what they needed to produce and they couldn't produce it. Although they had the means to do so. So your broker is 100 on the hook for your risk as a trader. That's why they're very conservative with their margin requirements because they're not just going to take your risk for you. So when we look at something like this and we have this, what is this, a short call in TLT, right now the broker says, again, this is a pass through IRA account. So this is regulation team margin a little more strict because it's for an IRA account. They were saying, I need 1700 bucks for this position for me to call this good. So yeah, the broker is responsible and they're not going to take the risk for you. G36 says long call short puts bingo. Vladimir off Putin says selling put by Nicole. That's",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 86,
      "start_timestamp": "00:18:31",
      "start_timestamp_seconds": 1111.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=1111"
    }
  },
  {
    "text": "IRA account. They were saying, I need 1700 bucks for this position for me to call this good. So yeah, the broker is responsible and they're not going to take the risk for you. G36 says long call short puts bingo. Vladimir off Putin says selling put by Nicole. That's good. Joey says ratio called Agno long call short put by the stock. That's good. H says long call short puts ratio diagonals. Yep, iron condors called debit spreads. Yep, put credit spreads also bullish. Yep, all correct. We also have things like covered calls, ratio covered calls, covered strangle long futures. All of those are on the docket. It polices IC, which I assume is iron condor, I would argue that that is not necessarily what I would consider bullish. G36 says collars. Yeah, I'd give it to give it to that too. Synthetic longs tons of ways. Those are all correct. Good job. All right. So that was kind of boring to do like that easy of a question. So let's get into something more fun, should we? So this one is still very easy, but we will hopefully zoom in from here and make it a little more interesting. So when we're thinking about an options premium, there's two components to it. What are those two components? So for Joey and Vladimir off Putin, I would call you both out for the time value component because if you're going to break it down that way, it's a",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 86,
      "start_timestamp": "00:19:38",
      "start_timestamp_seconds": 1178.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=1178"
    }
  },
  {
    "text": "more interesting. So when we're thinking about an options premium, there's two components to it. What are those two components? So for Joey and Vladimir off Putin, I would call you both out for the time value component because if you're going to break it down that way, it's a lit like you open yourself up for a little more scrutiny, which funny enough, it is my next question, which is this. Two inputs yield extrinsic value. So Joey and off Putin have one of them, right? They both already hit time value. So exactly. So Joey's got it. I'm in volatility bingo. Good. For everybody else, does that make sense? But when we're talking about the premium of an option, does the premium breakdown make sense? Okay. So we're talking about intrinsic value and follow on question. How do we, how do we figure out an intrinsic value? How do we calculate that? What's the path? It is a pretty straightforward difference between strike and the underlying. Whether it's in the end of money or not. So Dr. Zayis is about right. Chair price minus strike times 100 is incorrect. Joey says amount in the money. That's good. Age says stock price difference for delta value of shares. That's not correct. So this is good example. Let's take a look here. So if I follow G36's formula and I take the share price, which is 100 and I say, subtract a strike price of 105. What do I get?",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 86,
      "start_timestamp": "00:21:09",
      "start_timestamp_seconds": 1269.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=1269"
    }
  },
  {
    "text": "says stock price difference for delta value of shares. That's not correct. So this is good example. Let's take a look here. So if I follow G36's formula and I take the share price, which is 100 and I say, subtract a strike price of 105. What do I get? Get negative five times 100. So it's not that. The way that we calculate, Cedar Savage is directly on fleek. Joey says absolute value. No, because this isn't five dollars in the money. G36 says, I guess it was assumed in the money. Aha. Well, there's no assumption here. We're at the basics level. So this is exactly where we clarify assumptions. It's it's literally based on how far an option is in the money. So for calls, the way we calculated is different than puts. So for what Cedar Savage put above is exactly correct. Depending on if you have a call or if you get a put, we'll determine if you take strike price less stock or stock less strike. So the easier way to think about it is just simply how far in the money are you? How far in the money is in the option is your option? That's your intrinsic value. So if we have a 95 call and the stock is at 100, we would take the stock price of 100, subtract our strike of 95 for the call, you get five dollars. That's how far in the money you are over here. And",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 86,
      "start_timestamp": "00:23:29",
      "start_timestamp_seconds": 1409.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=1409"
    }
  },
  {
    "text": "your option? That's your intrinsic value. So if we have a 95 call and the stock is at 100, we would take the stock price of 100, subtract our strike of 95 for the call, you get five dollars. That's how far in the money you are over here. And on the put side, it's just the inverse. So it's not the same calculation for both. It's dependent on if it's a call or a put. Easy is way to think about it is simply how far in the money are you? That's all. Cool. Next question. This one should be easy. The question is what option will make more money on a 1 move in a stock? A 10 delta call or 50 delta call? And Jonathan says depends on if it's up or down. It doesn't because you'll notice that that's defined in the question with a plus 1. So I see 50s across the board. Good. Good, good, good. So now at what point does that reverse? But what point does the 10 delta make more than the 50 delta? After it becomes in the money, incorrect. And a large, quick move to the upside also incorrect. Read between the lines. Think about delta. What's the highest delta can get? 1. Which of those options is going to hit a delta of 1 faster? 50 delta. Good. Jonathan is reading between the lines. So if I take a look at this 101 call, which is a 50",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 86,
      "start_timestamp": "00:25:10",
      "start_timestamp_seconds": 1510.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=1510"
    }
  },
  {
    "text": "Read between the lines. Think about delta. What's the highest delta can get? 1. Which of those options is going to hit a delta of 1 faster? 50 delta. Good. Jonathan is reading between the lines. So if I take a look at this 101 call, which is a 50 delta, let's go to the 110 just for an example. And right around, I'll throw it down here just to make it easier. So if I go to 110, my 50 delta is going to make 769. My 10 delta is going to make 372. So let's say TLT goes to 200 now. My 10 delta makes 92.79. My 50 delta makes 97.54. So Jonathan is 100 correct. At no point in time, will the 10 delta overwhelm the 50 delta for a one on one basis? And it's because our deltas are limited. The examples that you guys are thinking of when we're considering a large move is when there are more of the further out of the money options because a lot of times when we compare these, we'll compare the same cost. Right? So this cost a dollar 46. This costs 21 cents. So in this case, if I size them to be the same dollar value, then the story is different. So if we do like seven, age says, but the premium paid, it's only a larger percentage move on the option. That's exactly correct. So your option will show a much, much, much higher percent",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 86,
      "start_timestamp": "00:27:14",
      "start_timestamp_seconds": 1634.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=1634"
    }
  },
  {
    "text": "if I size them to be the same dollar value, then the story is different. So if we do like seven, age says, but the premium paid, it's only a larger percentage move on the option. That's exactly correct. So your option will show a much, much, much higher percent return on a one for one basis. If you do the out of the money option, the further out the 10 delta versus the 50 delta, the 10 delta as I just showed you was going to give you like 9300 bucks a red average. You only put 21 bucks in to get 9300 bucks in the scenario with the 50 delta, you put up 146 bucks and you got 97 54. So on a gross dollar amount, you still made more with the at the money, but the percent return for the out of the money will be much higher. The reason why this is so important to understand is because as a trader, you have to be ready to flow in and out in between percent returns, gross returns, how much you're laying out, the behavior of what you're laying out, all of that matters a lot. And traders get too unilaterally minded with their perception of what may or may not perform better for X, Y or Z reason. And it's all about structuring things the way that you want them to behave. This is why when I talk about things like the ratio called the Agnal",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 86,
      "start_timestamp": "00:29:16",
      "start_timestamp_seconds": 1756.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=1756"
    }
  },
  {
    "text": "traders get too unilaterally minded with their perception of what may or may not perform better for X, Y or Z reason. And it's all about structuring things the way that you want them to behave. This is why when I talk about things like the ratio called the Agnal Strategy that I run or the ratio put diagonal strategy that I run that the base position is typically in the money. And the reason for that is I will get a lower percent return on my money, but I get a better dollar for dollar move with the underlying. I will add kicker options if I'm highly convicted that will compound quickly, but those only work if things move in my favor quickly enough. And if they don't, then as long as I get a moderate move, then my position still will probably work out with the higher delta, but it's all a series of trade-offs. So when we look at this, it's important to understand the way that these two different things behave around one another. We're going to be doing a lot of switching between sit and stand and because my prednisone dosage is coming down today. So the old, the old herniated disc is playing games with your boy. H says definitely guilty of honing in on one metric percent versus capital outlay. This is good food for thought. Yeah, exactly. And it's super normal. Everybody, literally everybody does it. It is as common as you",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 86,
      "start_timestamp": "00:30:31",
      "start_timestamp_seconds": 1831.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=1831"
    }
  },
  {
    "text": "So the old, the old herniated disc is playing games with your boy. H says definitely guilty of honing in on one metric percent versus capital outlay. This is good food for thought. Yeah, exactly. And it's super normal. Everybody, literally everybody does it. It is as common as you can imagine. So that's exactly why we do these exercises. Okay, cool. So I think we have that one down. Let's talk about this next one. We start to get into slightly more nuanced topics. What is a stock market inefficiency? Now this, I'm not going with the textbook definition because there are like some really, really rigid definitions of it. I don't care so much about that. I want to understand the way that we think about inefficiency. And then I think I have a video I can share on this. An opportunity. Okay, I'll take that. Mispricing capitalized until it's armed out potentially. Define efficiency, please. I'm asking, that's, I'm asking you. That's my question to you. And the value doesn't match up across platforms. That could be an example of it. The adverse ass, not it. Tom Saudon of who say it doesn't exist. That's objectively false. We know that's not true. Follow says a mispricing, preferably a tradable one. It could be. Any other guesses? When the market has impressed in news events could be. Dr. Zayn's market price does not equal intrinsic value of the stock. That's an interesting one. So I'm actually not sure",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 86,
      "start_timestamp": "00:31:53",
      "start_timestamp_seconds": 1913.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=1913"
    }
  },
  {
    "text": "We know that's not true. Follow says a mispricing, preferably a tradable one. It could be. Any other guesses? When the market has impressed in news events could be. Dr. Zayn's market price does not equal intrinsic value of the stock. That's an interesting one. So I'm actually not sure if that would be considered inefficiency personally because the markets are discounting mechanisms. So I literally don't know the answer to that one personally. I'm not sure that I would consider something not trading at or above intrinsic value in inefficiency though because I think that markets are designed to be discounting. So it's a good point. But so think of it this way. When we think about like, okay, so from inefficient market hypothesis, inefficiency is when essentially information is failed to be baked into price. That's from inefficient market hypothesis, the theoretical definition. I don't care about that. That doesn't really matter to me. I actually much prefer more of the practical definitions for something like inefficiencies versus mispricings. So inefficiency for my lens, and this isn't just based on me. This is like from work of most volatility traders and stuff like that. You can read Ewan's and Claire's books and he'll talk about the difference between inefficiencies and mispricings. And inefficiencies are things that we know are there. We can see them. And it's there for a reason. So Ewan's and Claire has one of the best examples of this that you can think of. So",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 86,
      "start_timestamp": "00:33:45",
      "start_timestamp_seconds": 2025.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=2025"
    }
  },
  {
    "text": "and Claire's books and he'll talk about the difference between inefficiencies and mispricings. And inefficiencies are things that we know are there. We can see them. And it's there for a reason. So Ewan's and Claire has one of the best examples of this that you can think of. So think of a 20 bill. And this is his example. I want to be super clear. This is Ewan's example. You can check this out from some of the podcasts that I did with him. That is a great example. If you have a 20 bill and you're walking down the side of the sidewalk and you see the 20 bill outside of a bar and it's like 11 o'clock at night. That is a mispricing relative to the market. There's probably a reason why that happened. There was probably a drunk dude coming out of the bar, fumbling to grab his shit. He dropped the 20 bill. You pick it up and then you walk on. Then if you walk past that bar every single day, is that 20 still going to be there each time? Probably not. That's a mispricing. Mispricings are things that pop up for some reason or another, but they're typically short-lived. Then there's inefficiencies. And efficiency is like the volatility risk premium. We know definitively, quantifiably, over a long duration. We know we mispriced volatility relative to realize volatility. We know we do it. That's no secret. It's been there for literally as long",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 86,
      "start_timestamp": "00:35:25",
      "start_timestamp_seconds": 2125.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=2125"
    }
  },
  {
    "text": "reason or another, but they're typically short-lived. Then there's inefficiencies. And efficiency is like the volatility risk premium. We know definitively, quantifiably, over a long duration. We know we mispriced volatility relative to realize volatility. We know we do it. That's no secret. It's been there for literally as long as the stock market's been around. As efficient as the stock market is, it's still there today. So the example for that is like if that 20 bill, instead of being on the sidewalk, it's in the middle of a five lane California highway. And that 20 bill is out in the middle of the road, flopping around. You can go grab it. It's there. If you're fast enough, you can go grab it, get back to the sidewalk, take your 20, but there's a risk involved you could get hit by a fucking car. So we can see the 20 bill. We know the 20 bill is there, but a lot of people are like, man, it's not worth 20. I'd rather not get hit by some 18 year old chick cruising down the highway, texting, sending snapchats, then running me over as I'm trying to grab my 20 bill. I already have a herniated disk. The last thing I need is like a vehicle accident to pile onto that. Maybe I don't know. Maybe it would write the back or something, but you know, you get the point. There's a reason why it's there. So that's the exact",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 86,
      "start_timestamp": "00:36:38",
      "start_timestamp_seconds": 2198.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=2198"
    }
  },
  {
    "text": "bill. I already have a herniated disk. The last thing I need is like a vehicle accident to pile onto that. Maybe I don't know. Maybe it would write the back or something, but you know, you get the point. There's a reason why it's there. So that's the exact difference between something like an inefficiency in a mispricing. An inefficiency is there for some sort of reason, and we know it's there. Post-earnings announcement drift is an example of an inefficiency. There are inefficiencies in momentum, triggers, information, indiscreteness is another inefficiency. There's lots of market inefficiencies, and they have varying levels of efficacy, tradable, window dressing is another known inefficiency. So inefficiencies are these things that we know are there that we can capitalize on them. We're typically not going to make a ton of money to grab them because they're going to be fairly competitive because a lot of people know they're there, but they continue to perpetuate. Nothing says, Roryn Kitty tweets are inefficiency. That's a good question. I don't, I would call it a mispricing, but I also can absolutely see it being an inefficiency. The only reason why I would consider it a mispricing is because it gets priced away so fast, but to your point, it happens, well not frequently, but semi-frequently. The way I view that is when Roryn Kitty tweets, that's when the drunk guy walks out of the bar. So it's not perpetual, but it is not also a one-time",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 86,
      "start_timestamp": "00:37:53",
      "start_timestamp_seconds": 2273.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=2273"
    }
  },
  {
    "text": "is because it gets priced away so fast, but to your point, it happens, well not frequently, but semi-frequently. The way I view that is when Roryn Kitty tweets, that's when the drunk guy walks out of the bar. So it's not perpetual, but it is not also a one-time thing, which mispricings don't have to be a one-time thing. I like that example. That's a great example. I like thinking about that. I appreciate you giving me something to noodle on. That's a fun one. Cool. Off-poon says, or biotech stocks that skyrocket between because phase one results are mildly positive. That's, I wouldn't call that inefficiency. The reason why I wouldn't call that inefficiency is because there's a clear compensatory risk. If you get those phase one results and they're not good or they're not well received for any reason, that same biotech stock is going to crater. Now, again, the inefficiency that applies to biotech is volatility risk premiums. Volatility risk premiums, because I trade them in biotech all the time. It's one of the best places to find them. They still generally in the aggregate will overcompensate for the periods that it doesn't work, but that's more an volatility perspective versus a price movement perspective. Lordopcans says, we both define covered options differently where there's more than one leg. Yeah, that's okay. Well, it's not, again, it's not more than one leg. For that example, Lord's Lothable, you're referring to like verticals so like an offsetting",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 86,
      "start_timestamp": "00:39:24",
      "start_timestamp_seconds": 2364.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=2364"
    }
  },
  {
    "text": "more an volatility perspective versus a price movement perspective. Lordopcans says, we both define covered options differently where there's more than one leg. Yeah, that's okay. Well, it's not, again, it's not more than one leg. For that example, Lord's Lothable, you're referring to like verticals so like an offsetting leg. For example, if I sell this put and then buy the further out of the money put, right? So it's not as simple as more than one leg because here's an example of two legs. If I sell that put and I sell this call, I now have two legs. This is not covered. This is a short strangle. So I can lose both sides. Lord's Lothable says single can be covered or naked, but the covered option has a strike and a hundred shares. Yep. So in that example, it's automatically for the covered call side of the things. It's automatically pulling in a share equivalent, right? Which is what we talked about in the example earlier for what would define a covered call, right? So we'd have a short call long shares. So yep, that makes sense. But I would just say it's definitely not defined as more than one leg. That's incorrect. I can have multiple legs, right? I can sell this 34-delted put, 26-delted put, 18-delted put, 13-delted put, 9-delted put. Okay. Well, I ran out of legs, but I have four legs in this one. This doesn't cover anything. I just have four naked",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 86,
      "start_timestamp": "00:40:55",
      "start_timestamp_seconds": 2455.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=2455"
    }
  },
  {
    "text": "more than one leg. That's incorrect. I can have multiple legs, right? I can sell this 34-delted put, 26-delted put, 18-delted put, 13-delted put, 9-delted put. Okay. Well, I ran out of legs, but I have four legs in this one. This doesn't cover anything. I just have four naked short puts at different strikes. So I have multiple legs. So yeah, I just wouldn't look at it as the legs. I would look at it like we were talking about in the example earlier in the video, the context of the position. That's what determines if something is covered or not. All right. Next question. Joey says, is sector rotation periodic and considered it inefficiency? Yeah, I wouldn't consider it inefficiency because there's beta risk with it. Sector rotation strategies don't always win, right? So the way to capitalize that would be more of a momentum style thing as compared to sector rotations, I think. So the next question is, how is implied volatility calculated? G36 says black shoals style or voodoo magic. I think both of those are applicable. Any other guesses? Joey says implied volatility is the last unknown from BSM. So it's implied from actual price. Sort of Vladimir says by algos indirectly. Jonathan says is it the probability of movement? It's not. Policies says it's the volatility we'd need for a given option price under BSM. That's the closest. So Joey, the reason why your answer was discounted is because the first part. The second",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 86,
      "start_timestamp": "00:42:15",
      "start_timestamp_seconds": 2535.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=2535"
    }
  },
  {
    "text": "Sort of Vladimir says by algos indirectly. Jonathan says is it the probability of movement? It's not. Policies says it's the volatility we'd need for a given option price under BSM. That's the closest. So Joey, the reason why your answer was discounted is because the first part. The second part of your answer is completely fine. So where we have an implied move from the current or the implied volatility from the current price. Now it's the reason why I say it's not really the last unknown from BSM. It's kind of what we solve for. I get your point there. I'm just clarifying a small component to it. So when we're calculating implied volatility, literally all we're doing is taking the current markets pricing of options. And we're breaking down the price into its different components. And we can use something like the Black Sholes Merton model to isolate the different variables because it's a differential equation. We can grab the pieces that we need. So when we're talking about implied volatility, we're just using option prices from the market. That's all. And we're backing out. You can use Black Sholes Merton completely fine. You can find it in other ways as well. But I think Black Sholes Merton is probably the most well known. So then the next question here is what is forecast volatility? And in the meantime, I have a video that goes all into volatility. So I just dropped that in there for you.",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 86,
      "start_timestamp": "00:44:06",
      "start_timestamp_seconds": 2646.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=2646"
    }
  },
  {
    "text": "in other ways as well. But I think Black Sholes Merton is probably the most well known. So then the next question here is what is forecast volatility? And in the meantime, I have a video that goes all into volatility. So I just dropped that in there for you. Forward looking volatility. So as implied, those are both. Those are both implied or forward looking. So I wouldn't say that personally. Any other guesses? Analyzed, autoregressive, heteroskedastic conditional. Nope, it's not a garsh model. G36 says expected move based on historic volatility could be. Hollow is the closest prediction. So that's the difference. So when we're looking at volatility, there are different kinds. And one of the kinds of volatility that's really important for us to understand is forecast. Now how we get to the forecast, we can use things like garsh models. We can use EJ garsh. We can use jump diffusion models. We can use anything. We can flip a coin and forecast volatility. The cliff notes though, is that forecasting volatility is literally the act of determining for yourself what implied volatility should be for an option. Retail traders normally don't do this. I do this more out of a scholastic sense. You can essentially take the markets pricing as volatility as it's probably much better than yours. But there's a difference. When we're looking at implied volatility, we're just looking at prices and we're pulling down what the market is implying. Forecast volatility is literally",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 86,
      "start_timestamp": "00:45:47",
      "start_timestamp_seconds": 2747.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=2747"
    }
  },
  {
    "text": "more out of a scholastic sense. You can essentially take the markets pricing as volatility as it's probably much better than yours. But there's a difference. When we're looking at implied volatility, we're just looking at prices and we're pulling down what the market is implying. Forecast volatility is literally when we make our own estimate of what volatility should be based on some sort of set model and circumstances. So that's the primary difference here. Does that make sense? The difference between like implied volatility and forecast volatility? Is they mean different things? What's the next question we do? Joey says you can compare the current expiration to the vol smile. Well, that's actually kind of a great preamble. So we'll see if that's correct, Joey. The next question for you is describe the volatility term structure, smile and surface. And in the meantime, we can talk about why volatility is important. So when we think about the importance of volatility, it's that it is the only unknown component that we piece together for an options price. Everything else that feeds into an options price is known. We know the underlying price. We know the strike price. We know if it's a caller input. We know what the risk free rate is. We know if there's a dividend. We know the days to expiration. I don't know if I said that one already or not, but all of the inputs that go into an option price, we know all",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 86,
      "start_timestamp": "00:47:50",
      "start_timestamp_seconds": 2870.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=2870"
    }
  },
  {
    "text": "if it's a caller input. We know what the risk free rate is. We know if there's a dividend. We know the days to expiration. I don't know if I said that one already or not, but all of the inputs that go into an option price, we know all of them, except for one, which is volatility. So most retail traders will use the implied volatility based on the market consensus. We can forecast our own, but then we have different views that we can take on volatility, which is exactly the question I have here. So the difference between a volatility term structure, smile and surface, they look at slightly different things. So Paul says surface, Joey looks like it has the most comprehensive of C. So volatility term structure is IV for an expiration. Smile would be IV for all in a certain expiration. Surface would be extra dimension. Okay, close. TradeJ says term is across expiration. Smile is all across strikes. Surface is combo close. I like where we're at with these. Many other guesses. So if we take a look at VAL, and we take a look at this, nope. That's fine. Trying to find one that looks somewhat normal. All these are kind of janky. That's kind of normal. That was the most normal one I found, this one. Okay. So what am I looking at here? Am I looking at smile? Am I looking at term structure? Am I looking at surface? What",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 86,
      "start_timestamp": "00:49:58",
      "start_timestamp_seconds": 2998.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=2998"
    }
  },
  {
    "text": "one that looks somewhat normal. All these are kind of janky. That's kind of normal. That was the most normal one I found, this one. Okay. So what am I looking at here? Am I looking at smile? Am I looking at term structure? Am I looking at surface? What am I seeing here? TradeJ might have the answer. I think Joey, I think your answer looks correct as well. Rees welcome in. So what is this? Joey says smile. TradeJ says smile. G36 says smile is correct. So when we're talking about a volatility smile, we're going to isolate within an expiration. And we're going to look at the volatility across strikes. That's all. Now, if I take a look at, I'm going to try to find something that looks somewhat normal here. If I take a look at these two points, what is this? So we already know what smile is. We have two left. We have a surface in term structure. Term structure. Correct. An easy way to think about term structure is if we look at a futures contract. This is probably one of the simplest ways. This is term structure. So this is using spot futures prices. But you can do this with volatility. So this is showing you actually a kink in the term structure. This is tradable for the e-many futures. But the same exact thing applies when we look at options. So now going back to our example in TLT. In this",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 86,
      "start_timestamp": "00:51:34",
      "start_timestamp_seconds": 3094.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=3094"
    }
  },
  {
    "text": "futures prices. But you can do this with volatility. So this is showing you actually a kink in the term structure. This is tradable for the e-many futures. But the same exact thing applies when we look at options. So now going back to our example in TLT. In this specific scenario, I think it was this one that was sort of normal and that one. That's fine. So in this scenario, let's do out of the monies. Looking at just these two is looking at term structure. So we're just looking at volatility at a set point across different time frames. So this here, if you plotted the implied volatilities for all of these, this is term structure. You can literally visualize this. So if you have a y-axis and an x-axis, and on the y-axis, we put a dot here to represent 18. So there's your first dot. Then we have another dot down here at 9. Then we have another dot up over here at 16. Then it goes up to 19. I'm drawing you, if you can follow along with the cursor, that is a term structure. And then to Joey's point, we can visualize a surface. Surface doesn't have to be 3D. This is 2D, but this is still a surface. I can visualize a volatility surface literally just by using these lines. I can look across strike prices. I can look across expressions. That's what volatility surfaces. Now the purpose of turning it into",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 86,
      "start_timestamp": "00:53:42",
      "start_timestamp_seconds": 3222.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=3222"
    }
  },
  {
    "text": "surface. Surface doesn't have to be 3D. This is 2D, but this is still a surface. I can visualize a volatility surface literally just by using these lines. I can look across strike prices. I can look across expressions. That's what volatility surfaces. Now the purpose of turning it into a 3D model is because it's a little easier to consume if you're not used to looking at things. It's a little higher fidelity. It's easier to find things that really stick out. But for example, there's a lot of interesting anomalies even in with this, with respect to a volatility surface. So if we get rid of some of these, let's do this one, do this one, get rid of that one. Let's do that one. So in example, these two inverting here is strange. You normally don't see that. There's normally a reason why that happens. And it can be for a bunch of different reasons, but stuff like that is tradable. So even though this isn't a surface, you can still very easily spot anomalies. Once you kind of have a sense of what you're looking for. Joey says, how do you feel about this being a line versus plot since we only have discrete values at strikes? How do I feel about it in terms of what? The line itself helps you identify overall shape, even a volatility surface is still connected. So it's still going to show you some of these. Part of the issue",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 86,
      "start_timestamp": "00:55:00",
      "start_timestamp_seconds": 3300.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=3300"
    }
  },
  {
    "text": "line versus plot since we only have discrete values at strikes? How do I feel about it in terms of what? The line itself helps you identify overall shape, even a volatility surface is still connected. So it's still going to show you some of these. Part of the issue that you will find because these are lines is it can be a little confusing like when you see kinks like these, but again, like the kinks are going to be relative to two anchor points. Right. So I can tell you that this is the 81 strike relative to the 80 to the 82, right? It's pretty visual in that way. So yeah, for me, I don't think there's anything at all wrong with it being a line. I actually think it makes it kind of easy to see things. Because if you look at a volatility surface, it's actually kind of difficult sometimes because it can be very, very noisy. Joey says, I see there are strikes between those. Yeah, absolutely. That's what causes the kinks. So in this case, I can tell you that the 81s are priced more expensively than the 80s and the 82s, whether it should or shouldn't be, that's another scenario. But I can tell you that it's not following the shape of the price that you see for everything else. So it draws my eye. All right. This one should be fun. What function do market makers perform in the stock market?",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 86,
      "start_timestamp": "00:56:23",
      "start_timestamp_seconds": 3383.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=3383"
    }
  },
  {
    "text": "it should or shouldn't be, that's another scenario. But I can tell you that it's not following the shape of the price that you see for everything else. So it draws my eye. All right. This one should be fun. What function do market makers perform in the stock market? I think they're very misunderstood. And I'm not like a defender of them to be clear, but I think they're very, very misunderstood. So that's why I'm asking this. Facilitating trades is good. Getting the price sort of, not quite, and we'll explain why it's not quite, but it's not wrong. Elon Song says provide liquidity in pricing. Ricky says the, the function of robbing him blind. Okay, take that. Paul says liquidity. Reese says liquidity. Off-poon says liquidity. These are correct. The primary function. The primary function is to provide liquidity. It's actually not to provide prices. They inherently provide prices because if they price poorly, they'll get destroyed. But if I'm saying their primary job is providing liquidity and not necessarily providing prices, how does that work? Why would that be the case? Why would I differentiate between their job of providing liquidity versus providing prices? What provides prices in the stock market? Buyers and sellers. D36 is on it. Not just buyers. Elon Song says buyers is not just buyers. Joey says actual orders closer. Speedrunner says investor psychology provides prices. It does not. Prices and sellers. That's all it is. Pricing in our exactly. So Paul",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 86,
      "start_timestamp": "00:57:38",
      "start_timestamp_seconds": 3458.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=3458"
    }
  },
  {
    "text": "prices in the stock market? Buyers and sellers. D36 is on it. Not just buyers. Elon Song says buyers is not just buyers. Joey says actual orders closer. Speedrunner says investor psychology provides prices. It does not. Prices and sellers. That's all it is. Pricing in our exactly. So Paul owns way, they are talking about the function of buyers and sellers, supply and demand. It's a consensus driven stock market. So that's how pricing is done. So say, for example, let's use this. And let's say right now on these puts, they're bid 136 offered at 140. Let's just say for whatever example or for whatever reason, let's just say that the market maker is currently pricing these at 145 and 130. Are they setting the price in this example? If they had these at 130 and these at 145, would they be setting the price here? With the idea that these prices are still here, by the way. Any guesses? They would not be setting the price. They would be outside the market. So whoever is currently resting a bid here at 136, whether that's a market maker or another retail trader or whoever is on this side doing the same thing at 140, they're setting the price. It's not a market maker. If for whatever reason, the market maker was wider than this, the market maker is not set. They're not currently setting the price. They're not providing liquidity. They're outside the market. So the whole idea",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 86,
      "start_timestamp": "00:59:07",
      "start_timestamp_seconds": 3547.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=3547"
    }
  },
  {
    "text": "doing the same thing at 140, they're setting the price. It's not a market maker. If for whatever reason, the market maker was wider than this, the market maker is not set. They're not currently setting the price. They're not providing liquidity. They're outside the market. So the whole idea here is to understand the difference between liquidity provision and setting price. If in order for a market maker to provide liquidity, they have to set good prices. Otherwise, they're not providing liquidity. But the way that they're forced to set good prices is by the market forcing their hand. Because if I'm in competition with another market maker, so if there's another market maker over there, and I'm over here, right, two different market makers, and I'm trying to make this market on these 100 puts in TLT expiring 35 days to expiration. If I am setting my prices at 36 and 40 and the other market maker is at 30, 45, they're not collecting any bid ask spread. They're not getting any volume, which is one, how they maintain their status, two, how they maintain preferred status, three, how they make a living. So there's a natural competition among different market making entities to price things competitively. And again, that's by supply and demand. It's not because the goodness of my heart is a market maker. I want to make sure these are as fair for everybody. If I was the only market maker in town, I would",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 86,
      "start_timestamp": "01:01:12",
      "start_timestamp_seconds": 3672.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=3672"
    }
  },
  {
    "text": "among different market making entities to price things competitively. And again, that's by supply and demand. It's not because the goodness of my heart is a market maker. I want to make sure these are as fair for everybody. If I was the only market maker in town, I would set them as wide as I possibly could. Why wouldn't I? Right? So a great example for this is when you're walking through the airport, going to another country, and you want to exchange money, they're a market maker. They're moving two different currencies. They decide what they're going to buy the currency at and sell the other currency at and they're going to capture the spread. But guess what? When you're walking through the airport, how many alternatives are in there about fucking zero? So that's why the transaction rates and the conversion rates at places like that are straight up abysmal, because there's no competition. Now what happens when you walk out of the airport and there's three banks on the corner. All of a sudden, all of a sudden things are way more competitive. Those spreads come way down because they need the volume. That's how they make their money. It's the same exact thing in the markets. So the forcing function for market makers to price things competitively are other participants that will out price them and take the volume if they don't do that. But their job is to provide liquidity. That's how they make",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 86,
      "start_timestamp": "01:02:34",
      "start_timestamp_seconds": 3754.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=3754"
    }
  },
  {
    "text": "make their money. It's the same exact thing in the markets. So the forcing function for market makers to price things competitively are other participants that will out price them and take the volume if they don't do that. But their job is to provide liquidity. That's how they make a living. They're literally scavengers. They're not, it's really not like this really sexy thing that they get to do. It's, they can make good money, but it is not super fun because they are completely relegated to order flow. So market makers provide liquidity. They are forced, if they're doing their job well, to set decent prices. But there's no imperative otherwise other than the natural supply and demand functions of the market. That's why when you look at less liquid stocks that aren't traded as much, the bid S spreads are super wide because nobody's in there. As competition and as liquidity is floods in, it forces more competitive pricing. Each says so if the market makers provide extra liquidity at a given price point, doesn't that affect the ability for people to transact beyond the bid S spread until the market maker runs out and determines the stopgiven liquidity exactly correct. That's 100 correct. And there are, there are reasons why they do that. So for example, if you take a look at this 104 put, if we take a look at the current offered size, maybe. Well, it looks like one by 39 or 390 something",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 86,
      "start_timestamp": "01:03:38",
      "start_timestamp_seconds": 3818.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=3818"
    }
  },
  {
    "text": "stopgiven liquidity exactly correct. That's 100 correct. And there are, there are reasons why they do that. So for example, if you take a look at this 104 put, if we take a look at the current offered size, maybe. Well, it looks like one by 39 or 390 something I can't tell. I wish it would just pop up normally it does. Maybe this one. There we go. You just got to unclick it. Okay, just doesn't like the 103's. I guess we'll do these. So or the 104's take a look at the 103's. I have them highlighted right now. So you'll see right now, they're bid at 71 offered at 74. They're bid 71 size 138. They're offered 74 size 35. They're not size one to one. And that's exactly what H is talking about. The market maker can try to control their directional risk by offering things at different sizes. Right? So they're saying I'm happy in this case to come in at 71 if you want to sell to me there. However, I'll take 138 of those. But for me selling, I only want to let 35 go at that 74. And that can be because of what the rest of their book looks like. It could be for a million different reasons. But that's exactly what that is. They get to set not just whatever price they think is spare based on volatility, but they also get to set what size they can sustain.",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 86,
      "start_timestamp": "01:04:53",
      "start_timestamp_seconds": 3893.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=3893"
    }
  },
  {
    "text": "because of what the rest of their book looks like. It could be for a million different reasons. But that's exactly what that is. They get to set not just whatever price they think is spare based on volatility, but they also get to set what size they can sustain. And it's because again, market makers are relegated to order flow. So one of the things to think about is market makers. Their ideal scenario is to be able to buy from somebody and sell to somebody essentially at the same time, right? That would be absolutely great. If I could buy at 71 sell at 74, I would do that all day. But the problem is is market moves, markets move. So if I buy at 71 and then all of a sudden things start to plummet for whatever reason, well, I just bought at 71, but now they're worth 65. I don't want to unwind there because now I've just locked in a loss on that position. So they have to manage their inventory very carefully. That's really the most difficult part of being a market maker is an effective methodology for managing inventory. Joey says I wonder if there's some inefficiency between spread and liquidity, such as typical spread amount usually equates to certain liquidity. You mean like in terms of the size they offer? It's not based on the spread amount typically. Again, that's going to be a much larger function of what their book looks",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 86,
      "start_timestamp": "01:06:10",
      "start_timestamp_seconds": 3970.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=3970"
    }
  },
  {
    "text": "if there's some inefficiency between spread and liquidity, such as typical spread amount usually equates to certain liquidity. You mean like in terms of the size they offer? It's not based on the spread amount typically. Again, that's going to be a much larger function of what their book looks like at a given point in time. And I think that's one of the most important things that I've ever seen. I think that's one of the things that I've been saying about the market is that it's not a lot of the things that I've been doing. But I think that's the most important thing to do. Again, of what their book looks like at a given point in time. And it also matters if there's other people inside the market. Again, like this is a great example. It's not just market makers that make markets. If there's probably a retail trader that is resting a 36 bid and they just want one of these 105's that could be a retail trader that's inside the market maker. So in this case, you'll notice that these are three cents wide. These are only two cents wide. So the mark, if this is a market maker on the other side of this, the market maker could be bidding or offering at 52 and they might prefer to be at 48 or 49 down here, but there could be another market participant that's like, no, I'm good for 50 here. So that's",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 86,
      "start_timestamp": "01:07:23",
      "start_timestamp_seconds": 4043.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=4043"
    }
  },
  {
    "text": "this is a market maker on the other side of this, the market maker could be bidding or offering at 52 and they might prefer to be at 48 or 49 down here, but there could be another market participant that's like, no, I'm good for 50 here. So that's again, that's mark making markets and providing liquidity is not relegated to market makers. If you operate inside their bid ask spread and rest in order, you're providing liquidity. Right? So there's two sides of an options trade and there's liquidity consumption and liquidity provision. As a retail trader, we typically consume liquidity. That's when we come in and we want to sell one of these puts. We decide to we're okay taking it at the bid and we lift the bid. In that case, you just took somebody's trade, right? That was offering their trade. You took it and removed that from the book that now somebody else can't get at. So you consume liquidity. But if I'm a trader that's currently resting in offer for these 95 puts for 21 cents and I have my order out there resting for somebody else to come take, I'm providing liquidity. It's a difference. Vladimir says I was filled on five contracts today below the bid. The last price changed but not the bid ask. Yeah, that can happen in an instant. Something could have moved super fast that made somebody want your trade. It could have been, I assume you",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 86,
      "start_timestamp": "01:08:27",
      "start_timestamp_seconds": 4107.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=4107"
    }
  },
  {
    "text": "It's a difference. Vladimir says I was filled on five contracts today below the bid. The last price changed but not the bid ask. Yeah, that can happen in an instant. Something could have moved super fast that made somebody want your trade. It could have been, I assume you mean for, wait, filled on five. What trade was it, by the way? Did you buy or sell? Because that will change the response I'm thinking of for you. I would assume bought. Because that would make it interesting. Bought puts, yeah. So yeah, that could mean something moved at just the right time and you happen to catch it in the middle there. It could be that your trade as it came across offset somebody else's in a way that they liked and they scooped it. So yeah, there's a bunch of different reasons why it can happen. And it's obviously not common and generally speaking, there's a specific reason why it would occur. But I had the inverse example today, actually posted about this in the Patreon where there was two things I was trying to fill today. I'll tell you what they were. WBA and BYND. And I could identify that the trades that I were trying to fill today were because they were essentially, I don't want to call them spoof orders because that's kind of a different sort of thing. But they were mispriced resting orders and the market makers will do that so that",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 86,
      "start_timestamp": "01:09:42",
      "start_timestamp_seconds": 4182.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=4182"
    }
  },
  {
    "text": "I could identify that the trades that I were trying to fill today were because they were essentially, I don't want to call them spoof orders because that's kind of a different sort of thing. But they were mispriced resting orders and the market makers will do that so that they're not always showing everybody what their pricing, their volsat. And the reason why I know it was the case is because I came inside their offers and I still wasn't filled. So it tells me that there was a mispricing there. They were resting things at a mispricing. That's what led me to them because they looked attractive. But then I didn't get a fill because there were mispriced, nobody wanted to transact at that point. And at that, I rested, my order is there for a little bit to see if anybody would come scoop them and nobody did. So that's an example where, I mean, at that point, I was attempting to provide liquidity, but I was looking at something that was like very, very clear that didn't look priced correctly. And it was confirmed because I moved inside the bid-ask spread closer to their side and I still didn't get a fill. So you can learn a lot from the way that fills happen. All right. Next question. For non-delta hedged or gamma hedged options positions, what is the most dominant input on the performance of the trade, most commonly? If we're looking at the option",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 86,
      "start_timestamp": "01:11:30",
      "start_timestamp_seconds": 4290.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=4290"
    }
  },
  {
    "text": "I still didn't get a fill. So you can learn a lot from the way that fills happen. All right. Next question. For non-delta hedged or gamma hedged options positions, what is the most dominant input on the performance of the trade, most commonly? If we're looking at the option in a vacuum, delta, I'd take it. I would take that answer. There's a slightly more precise way that I would frame it personally, but I still would take delta. Back down. Roaring Teddy, welcome in. The question is posted up above. It says for non-delta hedged options positions, what is the most common dominant input on the performance of the position? Go ahead and move it underline. There you go. So G36 has it. The reason why I don't say delta, again, it's, I understand what you guys mean when you say delta, but when we're in this kind of setting, I try to be as accurate as possible. And delta is not fully accurate because delta tells us the rate of change of an options premium. If you use something like beta, I could go along with it. Now in this context, though, it's just the price of the underline, the directional movement. And I know again, that's what you mean by delta, but again, in a non-clogical setting, delta means something else. So movement of the underline would be the primary input. Thomas says, could you please say, if you trade zero DTEs and how? I do.",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 86,
      "start_timestamp": "01:12:33",
      "start_timestamp_seconds": 4353.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=4353"
    }
  },
  {
    "text": "the underline, the directional movement. And I know again, that's what you mean by delta, but again, in a non-clogical setting, delta means something else. So movement of the underline would be the primary input. Thomas says, could you please say, if you trade zero DTEs and how? I do. I have a playlist you can check out. I'm not going to go into that here because that's not the purpose of this live stream, but I'm happy to direct you to this entire playlist that I have on zero DTE option. So Thomas, that one is real. But yes, I trade zero DTEs essentially every single day, big part of what I do. All amount of the portfolio that goes into it, but a big part of the frequency. Cool. All right. Let's take a look at a couple more and then we'll see if there's any specific questions that you guys want to get into. This one. Describe the disposition effect. Why do you care about it? Because believe it or not, you do care. Whether you know you care or not is another, that's another question. But you do care. And I want to know why you care. Describe the disposition effect. Now for those that don't know, this is a psychology question. G36 says willing to not cut losses and take profits too early, impacting returns heavily. Yep. That's exactly it. Vladimir says, I don't even know what it is. Yeah, okay, that's why I'm asking",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 86,
      "start_timestamp": "01:14:25",
      "start_timestamp_seconds": 4465.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=4465"
    }
  },
  {
    "text": "care. Describe the disposition effect. Now for those that don't know, this is a psychology question. G36 says willing to not cut losses and take profits too early, impacting returns heavily. Yep. That's exactly it. Vladimir says, I don't even know what it is. Yeah, okay, that's why I'm asking the question because it's an important one to know. Reese says overconfidence. It's not overconfidence. That's a little bit different. But holding onto losing trades is correct. Hollow also is spot on the tendency to cash in, to take profitable trades down too quickly and to let losing trades run. So it is a massive psychological function of traders that's very, very well documented and studied. And again, this is where a lot of the stuff I try to share with you guys comes from. So if you come in here and you go to this is my website and if you go to trader decision-making cognitive biases, this goes through essentially what we're all riddled with. And this is one of them. So and there's a reason why this is number one at the top. And it's because it's something that we all innately want to do. But we don't always have a solid mechanism in place to limit the impact. So it's the tendency to cut winners too short and let losing trades run. So why does this happen? Why do we do this? Well, walk me through what would lead us to want to cut a winner",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 86,
      "start_timestamp": "01:15:57",
      "start_timestamp_seconds": 4557.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=4557"
    }
  },
  {
    "text": "don't always have a solid mechanism in place to limit the impact. So it's the tendency to cut winners too short and let losing trades run. So why does this happen? Why do we do this? Well, walk me through what would lead us to want to cut a winner too fast. What's the idea? Because there's a very clear thought pattern that goes into that and why it happens. It's observable. Reese says lock in a win. Joey says I don't want to be greedy. That's a big one feels good to take profit. That's exactly it. Lost on another trade and massive. Feels bad to lose money. Fear of returning into a loser. Like literally you guys are hitting all of these individual like and look, look how varied they are, right? This is what? Ten different comments over the course of a few seconds of all these different emotions that we have that lead to us doing this. Literally, that's exactly correct. It's the fact that there's this cocktail of reasons why taking winning trades down is so alluring. The other thing to think about is how many times have you heard nobody's ever gone broke taking profits? It sounds smart, doesn't it? It sounds real, real smart. Nobody's ever gone broke taking profits. It's like, well, yeah, I mean, I guess if you're only taking profits, how would you functionally go broke? That makes total sense. But here's the problem. If you're in the process of",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 86,
      "start_timestamp": "01:17:29",
      "start_timestamp_seconds": 4649.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=4649"
    }
  },
  {
    "text": "profits? It sounds smart, doesn't it? It sounds real, real smart. Nobody's ever gone broke taking profits. It's like, well, yeah, I mean, I guess if you're only taking profits, how would you functionally go broke? That makes total sense. But here's the problem. If you're in the process of taking profits, I guarantee you you're in the process of booking losses as well. You just might not want to look at them. So we need to strike a balance here. And this is why I emphasize so heavily the concept of expected returns. Because I show examples all the time on how you can have systems with these massive high win rates that still don't matter. That still lose money in the aggregate. So this video here is about probability of profit and expected returns and why expected returns are so important. This one is about managing options positions and expected returns. So the process of managing expected returns is literally essential. So what I would offer to everybody is that when you're trading, stop worrying about the outcome of every one single trade and start thinking way more about the outcome of a process. Because that's where expected return lies, not in the outcome of an individual trade. When we are too concerned about the outcome of an individual trade, this is exactly why we walk into the disposition effect. Roing Titty says, are there stock therapists? That's hilarious. There's tons of them. This is, believe it or",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 86,
      "start_timestamp": "01:18:46",
      "start_timestamp_seconds": 4726.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=4726"
    }
  },
  {
    "text": "return lies, not in the outcome of an individual trade. When we are too concerned about the outcome of an individual trade, this is exactly why we walk into the disposition effect. Roing Titty says, are there stock therapists? That's hilarious. There's tons of them. This is, believe it or not, like with a lot of the people in the, like my mentoring program, we spend so much time going through this stuff. And the reason why we spend a lot of time going through this stuff is it sounds weird. But like the process of making money trading is it's literally easy. Once you understand how it works, the thing that most of us spend most of our time fighting against literally is ourselves. Stocks go up, stocks go down. Volatility goes up. Everybody goes down. It's not difficult to measure the probability of those things happening. It's literally not difficult. What's difficult though is making sure that we're measuring things objectively. What's difficult though is that we're not just focusing on the outcomes when we're analyzing stuff that we like and we're looking at the overall breadth of data. This not difficult is weighing other reference points from other exercises or ideas that don't actually matter in this circumstance. So literally the process of making money is is what it is. It's not that hard. The process of being a successful trader is a completely different prospect. And it's because we are straight up overloaded with biases. And",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 86,
      "start_timestamp": "01:20:43",
      "start_timestamp_seconds": 4843.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=4843"
    }
  },
  {
    "text": "other exercises or ideas that don't actually matter in this circumstance. So literally the process of making money is is what it is. It's not that hard. The process of being a successful trader is a completely different prospect. And it's because we are straight up overloaded with biases. And none of us like looking through these because you start realizing that we're all fucked up like football bats. And you're like, damn. Like how do I even go about getting over all of this shit? And for me, the first part is becoming aware of its existence. This is exactly why when you guys hear me talk about trading and markets, I talk about them in the way that I do. And it's to try and constantly remind myself of my biases and to try to remain as objective as possible in my analysis. And it's because I know I'm riddled with these kinds of things. So also, Roryntitty, the other funny part about your comment is there's a dude that I like a lot, his name's Richard Friesen. He comes on my podcast periodically. We have another, we have another podcast episode coming up. So we're going to, and that's exactly what he does. He opened up a prop room for a while. He trained traders and then essentially he coached them. So yeah. That is the pitch on cognitive biases. Let's take a look at a couple other things. And then for those that otherwise, if you",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 86,
      "start_timestamp": "01:22:04",
      "start_timestamp_seconds": 4924.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=4924"
    }
  },
  {
    "text": "and that's exactly what he does. He opened up a prop room for a while. He trained traders and then essentially he coached them. So yeah. That is the pitch on cognitive biases. Let's take a look at a couple other things. And then for those that otherwise, if you have any questions or any specific topics, theories, anything like that that you want to take a look at now is the correct time to start throwing those in before we wrap up. Here's the next question. Explain what Bayesian statistical model is or what Bayesian statistics are. And the reason I'm asking you this is because if you're a trader, I think this is probably the only way to think. That's a little lopsided, but that's what I personally think, but I can understand how people might not. Vladimir says over time, did you move to trade a higher percentage of indices and ETFs than single stocks, not a higher percentage, but definitely a higher weighting of the portfolio. And that's just because it becomes easier as the portfolio grows to scale, it becomes really difficult to find enough things to put individual trades on in like it's doable, but it's really, really arduous. And then you still have to fight with liquidity on a lot of them. It's funny because when you look at options, there's a lot of things that offer options, but the number of things that offer liquid options, there's less than a thousand of",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 86,
      "start_timestamp": "01:23:23",
      "start_timestamp_seconds": 5003.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=5003"
    }
  },
  {
    "text": "but it's really, really arduous. And then you still have to fight with liquidity on a lot of them. It's funny because when you look at options, there's a lot of things that offer options, but the number of things that offer liquid options, there's less than a thousand of them. And even that is like really generous. So your world gets collapsed down really fast as your account grows. So one of the issues that you'll find is finding things that you might have an idea on, but it becomes untradable because you can't really put on a position that makes sense even for what you want. So there's nothing at all wrong with trading individual equities or securities. It's completely okay. But I think it has to be really centered around what makes sense for the trader in their book. Because even right now, I don't have a ton of trades on. I took a bunch down this week. I have less than a hundred trades on right now. But the overwhelming majority of my exposure is in indices. It's in futures. And then the residual, I have tons of individual trades on individual products, but they're much, much smaller. And it's just because so I can get in at a reasonable price and trades the effects that I want to. Let's see. So for Bayesian modeling is resets updating info when given new updates. That's about right. Rointit, he says no idea. Never learned statistics or probabilities.",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 86,
      "start_timestamp": "01:24:59",
      "start_timestamp_seconds": 5099.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=5099"
    }
  },
  {
    "text": "much smaller. And it's just because so I can get in at a reasonable price and trades the effects that I want to. Let's see. So for Bayesian modeling is resets updating info when given new updates. That's about right. Rointit, he says no idea. Never learned statistics or probabilities. So I was actually thinking about, do I have, I don't know if I ever made that video. I think I have that on my to do list. Let me see. Like a basic statistics for traders. I don't yet. Let me make sure I add that to my to do list. Yeah, I have it in here, but I'll move it up. So basic statistics for option traders. And I mean, you guys already know like I'm very statistics minded. So it's like a, it's a massive part. How I view the world, how I go about analyzing things. It's not even from trading necessarily. It's just the way that my brain works in terms of analyzing the world. This comes from like the military. You frame things in a statistical analysis. So the main thing to consider when we talk about something like Bayesian statistical modeling, this is the technical component to one of the concepts I highlight. Basically, all the time for you, which is a phrase I use called strong convictions loosely held. All this means is I'm going to go is hard as possible to develop a thesis. I'm going to do research. I'm going",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 86,
      "start_timestamp": "01:26:19",
      "start_timestamp_seconds": 5179.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=5179"
    }
  },
  {
    "text": "the technical component to one of the concepts I highlight. Basically, all the time for you, which is a phrase I use called strong convictions loosely held. All this means is I'm going to go is hard as possible to develop a thesis. I'm going to do research. I'm going to test ideas. I'm going to exhaust the resources available to me at a given point in time to understand something, whether that's creating a strategy, whether that's modeling a trade, whatever it is. The idea behind Bayesian statistics is once there's new information, you update your prior conclusions. And this is a giant trap for a lot of traders because as a person, you're taught or socially influenced that if you change your opinion, then you're wrong. You're proving that you're wrong and that's bad. People will look at you and be like, oh, they were wrong about that. Aha. And meanwhile, it's like it's literally the dumbest thing I can think of because one of them, like the highest forms of intellect is to be able to have a really well formed idea and then pivot as soon as there's something that contradicts the idea. The problem is that our ideas and bias becomes part of our identity. It becomes part of who you are. And if you allow that attachment to happen, it's a fucking disease. And you get so stuck in these different things that you've heard that you've researched and you believe a lot in.",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 86,
      "start_timestamp": "01:27:45",
      "start_timestamp_seconds": 5265.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=5265"
    }
  },
  {
    "text": "that our ideas and bias becomes part of our identity. It becomes part of who you are. And if you allow that attachment to happen, it's a fucking disease. And you get so stuck in these different things that you've heard that you've researched and you believe a lot in. And then you're unwilling to update the analysis because it's now a representation of all the work you put in, all those people you told about X, Y, or Z. And the idea of switching now becomes intolerable. That is straight disease. In trading, I think you have absolutely have got to adopt the ability to be wrong all the fucking time and not care. Not care in the least. If you're wrong for stupid mistakes, of course, that's care about that a lot, right? The things you can control. But the things that if you're receiving new data and you're hesitant to update a thesis or an idea because you're too attached to your prior despite good evidence to the contrary, that's a problem. So when I think about stuff like that, I think that traders get wrapped up in yet another psychological shortfall like that, which is kind of a problem. I'm getting caught up on the chat. Wigglywarm says, serious question, I find myself looking at the options chain as a beginner selling cash to your puts or covered calls on the next day. They price jumps a ton. I feel like I'm selling contracts a week",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 86,
      "start_timestamp": "01:29:09",
      "start_timestamp_seconds": 5349.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=5349"
    }
  },
  {
    "text": "of a problem. I'm getting caught up on the chat. Wigglywarm says, serious question, I find myself looking at the options chain as a beginner selling cash to your puts or covered calls on the next day. They price jumps a ton. I feel like I'm selling contracts a week early. You will, you're exhibiting a bunch of different biases, believe it or not. So when you're thinking about what you're doing is you're honing in on very specific data points for whatever reason. Here. So you're using this, you're using this and essentially what's happening in this. These are like the, I don't know, the three I would highlight that you're committing most readily when I see that. Wigglywarm is essentially you have a grossly incomplete data sample that you're drawing broad conclusions from. That you're using my guess is if you have a trade log, I would guess again, this isn't like throw shade, but my guess is you don't have a trade log that we could look through and actually quantify the number of times that that happens. And my guess is if we did, the sample would be very small, what we would call completely insignificant. And again, that's not like throwing shade. It's just a statistical term. If a sample doesn't have enough occurrences, we would call it statistically insignificant. So I think in your scenario, you probably need to paper trade more. Again, nobody, I have a video hopefully coming out tomorrow. I'm waiting",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 86,
      "start_timestamp": "01:30:40",
      "start_timestamp_seconds": 5440.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=5440"
    }
  },
  {
    "text": "And again, that's not like throwing shade. It's just a statistical term. If a sample doesn't have enough occurrences, we would call it statistically insignificant. So I think in your scenario, you probably need to paper trade more. Again, nobody, I have a video hopefully coming out tomorrow. I'm waiting to see if my editor can wrap it up super quick. But I don't know if it'll be done. Wigglywarm says I've been thinking I need something, but I guess I don't even know what to log. Yes, totally cool because I have a video about this exact thing. Here you go. So that video there, it's a little bit old, it's from last year, but it talks about essentially creating trading plans, trading logs, and literally how to create your own trading documentation so that we can track things more effectively as what it boils down to. But yeah, I think that's all that's happening with you. Rointit, he says you should become a professor at UCSD. I think I would hate that. Absolutely hate that. It's a hilarious idea. I do love teaching, but I would hate that. I think like collegiate, I don't really, I don't know, man, like I did undergrad and grad. I don't mind college, but I much rather do this stuff honestly on YouTube and make it way more accessible to people that don't necessarily have the resources to go to college. I also think college is price gouge, the living shit out",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 86,
      "start_timestamp": "01:32:11",
      "start_timestamp_seconds": 5531.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=5531"
    }
  },
  {
    "text": "man, like I did undergrad and grad. I don't mind college, but I much rather do this stuff honestly on YouTube and make it way more accessible to people that don't necessarily have the resources to go to college. I also think college is price gouge, the living shit out of people which drives me crazy. So I mean, and the funniest part is, is I literally have no professional training at all in finance. I mean, I say that all the time, which is hilarious, isn't it? I think about that a lot. I have a couple of people in the mentoring program, like at least three of them that I know that have some sort of advanced degree finance economics. I even have a ex professional trader from a large bank that's in there, which is just classic to me. The fact that like I am, I literally am the village idiot. I have no professional training in any of this stuff. I just have a lot of time and effort that I put into it. Like I tell you guys, at least if you look on like the website and stuff, it's well over 30,000 hours that I've put into studying and exploring markets. If you look at a lot of times in the discord, like if you look at what I, when I post stuff, I post stuff, you know, that I'm reading and I'll do it like at night and it's, it's hilarious because I'll",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 86,
      "start_timestamp": "01:33:33",
      "start_timestamp_seconds": 5613.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=5613"
    }
  },
  {
    "text": "I've put into studying and exploring markets. If you look at a lot of times in the discord, like if you look at what I, when I post stuff, I post stuff, you know, that I'm reading and I'll do it like at night and it's, it's hilarious because I'll look over at my wife and she'll be reading like a normal book about something and I'm literally reading white papers. So yeah, it's just, I am a really different kind of self taught generally finance, but I do apply a lot of the skills that I learn in college, specifically with respect to like statistics. That's probably the most useful thing that I learned in college is statistics. Lord Slothable says, learn Greeks. I have a playlist for you, my friend. That is options 101. So in this options 101 playlist, I think you should watch the options video, the intro to options video. And then I think you should look at there's a video on there specifically on the Greeks. Vladimir says I've talked to an OG pit traders that have zero education beyond high school and were as, and were as blue collar as brick layers. Yeah, the problem is is like pit trading is completely different. And again, that's not to like shit on them. Pit trading is cool, but their edge is built in as long as they can keep up with volume and pace. Their edge is already built in being on the floor.",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 86,
      "start_timestamp": "01:34:38",
      "start_timestamp_seconds": 5678.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=5678"
    }
  },
  {
    "text": "the problem is is like pit trading is completely different. And again, that's not to like shit on them. Pit trading is cool, but their edge is built in as long as they can keep up with volume and pace. Their edge is already built in being on the floor. So that's why it's so expensive to, well, used to be so expensive to buy a seat on the trading floor is because it literally is giving somebody an edge. So yeah, I think, I think, yeah, the fact that pit traders are untrained typically, that's like actually very common, but it's for a specific reason. Because they literally don't need the skill set for what they do. Wiggly says thanks so much for being approachable and coming out with a coach of mentality. Yeah, happy to. I literally love this stuff. One of the things the mentor that introduced me to investing back in high school is coming out this month to come spend a few days with us. And it's like I look at essentially where my life is gone as a result of him introducing me to a couple concepts. Then I had an mentor that I kind of worked with online in, indirectly, it wasn't like a personal mentor that I would like call and talk to, but I would still extract a lot of information from him. And because of people like that, it's like literally has changed the direction of my life wholesale. So",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 86,
      "start_timestamp": "01:35:50",
      "start_timestamp_seconds": 5750.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=5750"
    }
  },
  {
    "text": "kind of worked with online in, indirectly, it wasn't like a personal mentor that I would like call and talk to, but I would still extract a lot of information from him. And because of people like that, it's like literally has changed the direction of my life wholesale. So I am one of those people that I really enjoy helping people. It makes me feel good. And I think it's important to pay forward skills that we have. So I literally enjoy doing this. It's super fun. Joey says I met an old professional on the street and said he knew Frank Russell and said that I should only trade the spot. I mean, that's not a bad. It really for like most, if I didn't know somebody from a hole in the wall, I would tell him to trade spy too. Like if you read the blog post that I made for that one friend that I use is like my general introduction to trading for everybody that knows nothing. If you read through that, like that's what exactly what I would do is for somebody that doesn't know much about stuff and not looking to learn a whole bunch, I put them directly into spy for sure. But hopefully we know that that is not the only show on the block at all because it ain't. I think that's, I mean, I have way more quiz questions, but that's all I had planned for today. So if",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 86,
      "start_timestamp": "01:37:03",
      "start_timestamp_seconds": 5823.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=5823"
    }
  },
  {
    "text": "whole bunch, I put them directly into spy for sure. But hopefully we know that that is not the only show on the block at all because it ain't. I think that's, I mean, I have way more quiz questions, but that's all I had planned for today. So if you guys have anything else that you want to hit on, let me know. We can tackle those, look through any of that stuff. And then otherwise we'll get ready to wrap up in a few minutes. Vladimir says retail stock trading has been around a lot longer than the internet. My grandfather traded and just checked in nightly news, newspaper. Yeah, that's so cool. I literally think that that's like such an OG way to trade. It's like, yeah, I love that so much. I think it's so sick. Reese says who you got in the UFC tomorrow. That's a great question. I think I do think Sean O'Malley will, man, I know he, well, again, probabilistic, right? I know Sean O'Malley is the favorite over Marab, but I like Marab a lot. I think that he's a really good fighter. He's on like a 10 fight win streak. So I'm legitimately very curious how Marab will do because Sean is elusive, but if Marab can like grapple with him, I think that would be very difficult. So yeah, Vialobo says anytime to look at an options trade on GME could wait till Saturday. Though, yeah, we can take",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 86,
      "start_timestamp": "01:38:01",
      "start_timestamp_seconds": 5881.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=5881"
    }
  },
  {
    "text": "So I'm legitimately very curious how Marab will do because Sean is elusive, but if Marab can like grapple with him, I think that would be very difficult. So yeah, Vialobo says anytime to look at an options trade on GME could wait till Saturday. Though, yeah, we can take a look. Yeah, Vialobo, let me know we want to take a look at happy to. Okay, baby. Yeah. We're going to get the, we got to get the old boss of the outfit. He's here ready to go. Sorry. He does, he does that really cool thing when I asked, watch, watch this. If I, I get like a double paw. I don't think he's learned the difference between like single paw and multiple paws because whenever we go for a paw, you just get both, which I guess is nice. It's kind of like, I don't know, it's like a bogeau paw. Vialobo says, I want to sell a covered call and then buy a long call leap, make money on the short term with the sold calls long overall. Yeah. So it's kind of like, that's kind of like a ratio called diagonal. Yeah, I would consider that like a ratio called diagonal. So there's, yeah, there's nothing wrong with that. You can absolutely do something like that. And I think the volatility in there also looks good. So Paul says, what's this breed's temperament like? He's a straight homie. He just, he lives for the team.",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 86,
      "start_timestamp": "01:39:15",
      "start_timestamp_seconds": 5955.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=5955"
    }
  },
  {
    "text": "that like a ratio called diagonal. So there's, yeah, there's nothing wrong with that. You can absolutely do something like that. And I think the volatility in there also looks good. So Paul says, what's this breed's temperament like? He's a straight homie. He just, he lives for the team. He's energetic when you are, he's chill when you are like he's, yeah, he's awesome. He's a multi-sputle. So don't let his, don't let his current hyena appearance because he has a mohawk, put a mohawk on him, because I think it's sick. Don't let that confuse you. He's a straight homie. So yeah, Vialobo, I think that's fine. The way that I set those up, we can take a quick look. You mean? Then Vladimir Alpouin says, if you started a series on options trading in meme stocks, your subs would hit 100K in a month. That's funny. I don't even, I don't look at meme stocks that much. That's the problem is like, I like looking at them, especially stuff like GameStop because it's just so interesting to me. And I like being a part and trying to help the community learn about options. But like from a pragmatic standpoint, it's such a small part of what I do is an options trader, right? The way that I make my money is so, so different. And I think for a lot of options traders in meme stocks, I would be trying to convert all of them into what",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 86,
      "start_timestamp": "01:40:58",
      "start_timestamp_seconds": 6058.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=6058"
    }
  },
  {
    "text": "pragmatic standpoint, it's such a small part of what I do is an options trader, right? The way that I make my money is so, so different. And I think for a lot of options traders in meme stocks, I would be trying to convert all of them into what I would consider to be hopefully like a more higher probabilistic approach to like making something because that's the big fear I have for a lot of the meme stock traders. And that's me unfairly projecting like my hopes for people because who knows, man, like some people really might not care and they might just hope that they hit the fucking lotto. And that's okay. Vladimir says, my point is that new traders flock to the Reddit meme, yeah, which I think is, I think it's completely fair. Yeah. I think it's completely fair. Vialova says, does the ratio work if you're using all your shares recovered calls? No, you have to maintain a ratio. So let's say for example, we have 500 shares of game stop at spot price. And then let's say that we wanted to buy some further out of the money options or further out in time options. Let's say we buy these at the money's here. Let's see, we get like two of those, maybe three. So here, our maximum delta is that we have here 800 delta's. So in this case, if I sell five calls against my shares, I maintain a positive",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 86,
      "start_timestamp": "01:42:20",
      "start_timestamp_seconds": 6140.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=6140"
    }
  },
  {
    "text": "in time options. Let's say we buy these at the money's here. Let's see, we get like two of those, maybe three. So here, our maximum delta is that we have here 800 delta's. So in this case, if I sell five calls against my shares, I maintain a positive ratio here. And the reason why I maintain a positive ratio here is because I still have uncapped long delta's that can max out to the upside, right? So I have 500 delta's from these, get 300 delta's from these. I have a maximum of negative 500 delta's from these. So then that would give me uncapped 300 delta's, but it's all about the ratio because if you, if you sold eight, well, now you have a problem. Now you have capped upside because you're out of one to one ratio between total max long delta's versus short delta's. So it's entirely, entirely dependent on the delta ratio that you're maintaining with the trade. I got to open the door for the pup. So yeah. If as long as you're thoughtful about that, you can maintain kind of your desired upside potential. And I would consider though, is I would be very, very, very, very, very reluctant to try or to permit my upside being capped on something. And the reason why I would be so reluctant to do that is because the primary compensation you get for trading stuff like this is upside, unlimited upside. So if you start",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 86,
      "start_timestamp": "01:43:36",
      "start_timestamp_seconds": 6216.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=6216"
    }
  },
  {
    "text": "be very, very, very, very, very reluctant to try or to permit my upside being capped on something. And the reason why I would be so reluctant to do that is because the primary compensation you get for trading stuff like this is upside, unlimited upside. So if you start giving that up, that's kind of a problem. I got to get caught up on the chat. Rowan Titi says, do you show live trades? Do you think you could show you live paper trading? No, I don't think so. I think I've thought about that and I did it for a little while. And what ends up happening is the exact opposite of what my intention is behind that. My intention behind anything like that is to try to show people the application of the skill set, but showing people while I'm doing it live becomes problematic because I have people that just start trying to do what I do. And then I start getting hit up with a lot of different emails about asking how they should manage a position that they know that I put on. And it's like, I want to stay away from that with a not even a 10 foot pole, a fucking 60 foot pole. So what I do now as a bit of a middle ground is for the, for the Patreon folks, what I tend to do is like I all post in the discord slightly delayed purposefully when I put",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 86,
      "start_timestamp": "01:45:13",
      "start_timestamp_seconds": 6313.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=6313"
    }
  },
  {
    "text": "a not even a 10 foot pole, a fucking 60 foot pole. So what I do now as a bit of a middle ground is for the, for the Patreon folks, what I tend to do is like I all post in the discord slightly delayed purposefully when I put on different trades, not all of them. And the other thing I'll do is I'll walk through my actual trades, how I'm managing them, how I'm finding them. When I do the outlier pro live streams, like that's exactly what I do in those. When I do the YouTube live streams, it's more meta talking about the markets trades, answering questions, stuff like that. And then the pro live streams are just way more like getting into the exact weeds of what I'm doing, but it's not live and it won't be live. It's slightly to, yeah. So that last one, roaring city for on demand, absolutely. Yeah. And we've done that before, even in this. So yeah, on demand is cool too, because we can do like a previous point in time, right? So we can pick a random point in time that none of us know what happens and we can play the game from there. Absolutely. That's no problem at all, because that also completely takes away anybody's, you know, gumshen to copy what I'm doing if we know we're back in 2012, right? There's literally no reason to copy anything I'm doing today based on that.",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 86,
      "start_timestamp": "01:46:29",
      "start_timestamp_seconds": 6389.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=6389"
    }
  },
  {
    "text": "and we can play the game from there. Absolutely. That's no problem at all, because that also completely takes away anybody's, you know, gumshen to copy what I'm doing if we know we're back in 2012, right? There's literally no reason to copy anything I'm doing today based on that. So yeah, absolutely. Paper trading, entirely possible. Happy to do that for sure. And I've done that before because I think it's kind of fun. So yeah, that's a absolutely chill recommendation. Follows says, how many active trades do you have at a time? I would say on average somewhere between five and 20 on average, like the overall bulk of my trading career, I think it's very common for me to land between like 20 and 100. And I would say like the majority, yeah, the majority is probably like 25 to 50. I say average because when the market is just kind of right, if I look across my trading career, there's pro long periods of time, because I started trading in 2007. There's pro long periods of time where the market was just upsloping to the right. So it's about as easy as it gets leveraged long products. You don't need that many of them. So in those instances, like if I think about the average holding across a trading career, it gets skewed by that. If I look over from like 2020 to present, it's probably closer to like the like I said, maybe 20, 20",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 86,
      "start_timestamp": "01:47:38",
      "start_timestamp_seconds": 6458.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=6458"
    }
  },
  {
    "text": "products. You don't need that many of them. So in those instances, like if I think about the average holding across a trading career, it gets skewed by that. If I look over from like 2020 to present, it's probably closer to like the like I said, maybe 20, 20 to 50 trades at a time, something like that. So I don't like over diluting what I do. And if I'm putting on more trades, the vast majority of those are actually going to be variance risk premiums, volatility risk premiums plays, like just kind of turning things out. Most of my like capital is committed to a much smaller set of trades, less than 10 for sure, absolutely less than 10. There will be periods where it's two, there will be periods where it may be five or six, but most of the capital is typically tried up in just a handful of core positions. And then all the speculative stuff is kind of done in the background as it fits. Roaring Titi says you have that many zero DTs simultaneously. No, not zero DTs. Those are just all different kinds of trades, definitely not limited to zero DTs. Zero DTs, I like them. I like them for a few things, but they're actually a pretty small part of the total portfolio for me. So yeah, I definitely run zero DTs like every day, but it's a high frequency trade, but it's a low risk allocation trade for me.",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 86,
      "start_timestamp": "01:49:03",
      "start_timestamp_seconds": 6543.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=6543"
    }
  },
  {
    "text": "Zero DTs, I like them. I like them for a few things, but they're actually a pretty small part of the total portfolio for me. So yeah, I definitely run zero DTs like every day, but it's a high frequency trade, but it's a low risk allocation trade for me. Vladimir Alpun says Eric, I built a spreadsheet using TQs to start pricing. I have to beat the returns even letting it ride through 2002. Yeah, I mean, whenever we do something in hindsight, it always looks so beautiful, doesn't it? But the problem is, again, if we take a look at the actual performance of it, it has a lot of problems. So if we do something like clear this, we go TQs, we just go 100. And we want to go back, I'll go back as far as this lets me to 2015. So anything you're doing, oh, you mean through 22? Yeah, so if you look at the performance of this from inception and you can go back further, but to go back further, you just have to create a surrogate, which is completely fine. That's what a lot of people do to try to test this over a longer term timeframe. But yeah, like it's completely doable, but the problem is, is you're going to go through periods that are like horrifically ugly, like terribly ugly. Right? So the worst drawdown here, 79, and this isn't even like an OA-09 drawdown. There's some variations of this",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 86,
      "start_timestamp": "01:50:12",
      "start_timestamp_seconds": 6612.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=6612"
    }
  },
  {
    "text": "over a longer term timeframe. But yeah, like it's completely doable, but the problem is, is you're going to go through periods that are like horrifically ugly, like terribly ugly. Right? So the worst drawdown here, 79, and this isn't even like an OA-09 drawdown. There's some variations of this that you'll look at in an OA-09 drawdown that go a liquid, literally blow up. So the question then you have to ask yourself is, if you have 10,000 and you watch that decline by 80, like who cares, right? It's 10 grand. But if you have your life wealth, let's say it's 5 million and you watch that contract by 80, I don't think you're sitting in it. I don't think anybody's fucking sitting in that. I'm not sitting in that. There's no way. And it's because you are faced with now an uncertainty going forward, right? When we back test, it's so easy to find things that perform. I can show you back test that perform even better than this. That look great. But the problem is, is that when we're looking forward into the future, is AI going to become regulated? Is technology actually not going to be the bell of the ball like it was for the last 15 years, which has been really the last 25 years almost now? It's been tech has been everything, but does that continue into forever? I imagine tech would be highly productive, but I'm just talking about in this",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 86,
      "start_timestamp": "01:51:45",
      "start_timestamp_seconds": 6705.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=6705"
    }
  },
  {
    "text": "be the bell of the ball like it was for the last 15 years, which has been really the last 25 years almost now? It's been tech has been everything, but does that continue into forever? I imagine tech would be highly productive, but I'm just talking about in this scenario, tech might not be. And especially again, if you have your 5 million that's now down 80 or as it's down 40 you're like, shit, I know this went down 80 before. And again, if I actually hold this through like an 0809 equivalent when it's not even specific to tech, but a broad market meltdown, then am I okay watching my 5 million decline by 98 and then my only hope at that point is to just sit and wait for it to recover. I don't know man. And a lot of that's also going to depend on your time frame. I like leverage ETFs. I trade T triple cues, not seeing anything bad about it. But I think people, I think what you're doing in that context is called again, let's go to the old handy dandy website. I'll show you exactly what it's called. This one I made up by the way, I don't think this one is actually from anywhere, but this one, goalie locks analysis. It's easy to look back and be like, yeah man, 70 draw down that kind of sucks, but a 34 compound annual growth rate, like that's pretty sick. So",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 86,
      "start_timestamp": "01:53:04",
      "start_timestamp_seconds": 6784.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=6784"
    }
  },
  {
    "text": "I made up by the way, I don't think this one is actually from anywhere, but this one, goalie locks analysis. It's easy to look back and be like, yeah man, 70 draw down that kind of sucks, but a 34 compound annual growth rate, like that's pretty sick. So yeah, sure, I'll take a 70 draw down and 80 draw down for a 35 compound annual growth rate. But this is looking back in time. So like for example, if I could make the decision today to go back to 2015 and put all of the money I had in time into T triple cues and just let it go, sure, why not? No problem. Because I know the outcome. I know it's still pretty solid. But it's not quite as clear as that because if we take a look at something like T triple cues, once you get into three times leverage, you're outside of the goalie lock zone. And I don't mean it in terms of goalie locks analysis. I mean, in terms of performance. It still has not gotten back to all time highs. It still has not. If I look at something like spy, it has and it's posting new highs. If I look at a two times leveraged ETF, which is a better long term buy and hold leveraged ETF, it did hit new highs fell down, but it absolutely beat these previous highs. If I look at something like T triple cues, that",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 86,
      "start_timestamp": "01:54:08",
      "start_timestamp_seconds": 6848.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=6848"
    }
  },
  {
    "text": "has and it's posting new highs. If I look at a two times leveraged ETF, which is a better long term buy and hold leveraged ETF, it did hit new highs fell down, but it absolutely beat these previous highs. If I look at something like T triple cues, that is not what happened. The closest it got was within six points or so, but not quite. It still hasn't got back to break even from its all time high. So volatility, volatility drag is a thing. And this spreadsheet you have is totally cool. Again, I'm not trouncing on leverage ETFs. I use them. I use them in my retirement accounts for things that I trade less frequently. I don't use three times leveraged because I know I can look at historic market data. And I can find that the optimal leverage is typically around like 2.3. Now you can create a surrogate 2.3 leverage with something like T triple cues by offsetting it with another product and just scaling the positions, but it doesn't change the behavior of the product itself, which is a daily leveraged product. So yeah, I don't hate them at all, but I just think it's so important to understand what they are, how they behave, how they fit into things, and how we think we might actually behave. Again, as you watch, prospectively, if you put a bunch of money into it, like the bulk of your wealth climbing down, but even 30",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 86,
      "start_timestamp": "01:55:11",
      "start_timestamp_seconds": 6911.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=6911"
    }
  },
  {
    "text": "think it's so important to understand what they are, how they behave, how they fit into things, and how we think we might actually behave. Again, as you watch, prospectively, if you put a bunch of money into it, like the bulk of your wealth climbing down, but even 30 is not super great. Then you start getting into like 50. If that takes you from again, you're 5 million, that takes you down to two and a half, clearly, right? That's just the math. But if you think of that from like a functional standpoint, a livelihood standpoint, that is a massive material change in your resources. The difference between a 2.5 million net worth and a 5 million net worth is significant, absolutely significant. So if you're planning on retiring, you have your 5 million, you have a conservative lifestyle so you don't need a bunch of money, you can live off of it, you can stand inflation, you can stand when costs pop up once in a while, you can do all that with your 5 million account if you choose to retire early. At a 2.5 million account? Probably not. Probably not. You're going to run out of money more likely than not. Unless you're super conservative and stuff like that, it doesn't give you the same playing field. So again, nothing wrong with leveraged funds, but I think it's so dangerous to look at their historic performance and then to over like look at them",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 86,
      "start_timestamp": "01:56:23",
      "start_timestamp_seconds": 6983.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=6983"
    }
  },
  {
    "text": "out of money more likely than not. Unless you're super conservative and stuff like that, it doesn't give you the same playing field. So again, nothing wrong with leveraged funds, but I think it's so dangerous to look at their historic performance and then to over like look at them with rosy colored glasses, rose colored glasses. What where is that saying from? What does that even mean? Hold on one second, I have to look that up. I like to look up things like that. What is the origin of rose colored glasses? Let's see. Rose colored glasses or rose tinted glasses refers to the tendency and overly optimistic early literary use. The phrase appeared in literary works during the 19th century. One of the earliest uses of the phrase is attributed to Thomas Carlisle, a Scottish philosopher and essayist who referred to people seeing the word through rose colored spectacles in his work. Love that. What's the metaphor was used in like the 30s and 40s. I got to be honest, that's actually like super super cool. Did not know that. Vladimir says I'm not suggesting go all in, but so many are skeptical about T-Triple Q. Well, I think people are skeptical about leveraged funds because they misunderstand what leverage is and what things like volatility to K are. Like a lot of people believe when you're holding something like a volatility or a leveraged asset that is just like falling apart in your hands on a",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 86,
      "start_timestamp": "01:57:34",
      "start_timestamp_seconds": 7054.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=7054"
    }
  },
  {
    "text": "I think people are skeptical about leveraged funds because they misunderstand what leverage is and what things like volatility to K are. Like a lot of people believe when you're holding something like a volatility or a leveraged asset that is just like falling apart in your hands on a daily basis. And that's not the case at all. There's cost. And again, like one of the frictions in something like T-Triple Q's is not small. It's like a 4 year penalty on your return. And that's just like general cost from the rebalancing. So that's not like an insignificant hurdle to get over, but that's not the end of the world. If you're trading something, that's going up massively. This doesn't include volatility to K, which will chew you up to the downside. That's why when you're trading something like leveraged ETFs, it's so important to use some sort of system. Because again, like if you go through a bad path, you can get absolutely mangled. If you look at this move here, this is no joke. This went from 85 down to 48. And it did that in like a month. That's a really nasty move. So if you think about leveraged ETFs, again, like they look really good because as of lately, they've performed really well. But they don't always do that. US equity leveraged ETFs, I like them a lot. I use things like SSO and QLD all the time myself. Like I said, those are",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 86,
      "start_timestamp": "01:58:54",
      "start_timestamp_seconds": 7134.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=7134"
    }
  },
  {
    "text": "you think about leveraged ETFs, again, like they look really good because as of lately, they've performed really well. But they don't always do that. US equity leveraged ETFs, I like them a lot. I use things like SSO and QLD all the time myself. Like I said, those are my other accounts. And it's because I like two times leveraged for longer term holdings because the drag is less, the reward is less, but the standard deviation is different. So when I look at the performance of something like Teachable Q's, it's fantastic. But if I look at my compound annual growth rate, which right now is 26. If we look at the compound annual growth rate for Teachable Q's over its lifespan, which is a shorter duration than mine to be clear, but let's take a quick look. Because I think it's what like low 30s. But then if you look at its standard deviation, it's like over 50, which is essentially like the inverse of what mine is. Let me see clear these at Teachable Q's back 100. Take a look. 34 compound annual growth rate. So it absolutely beats me. It beats me by 8. Ish, a little under 8. But this is nuts. A 58 and a half standard deviation of those returns is fucking crazy. So you have to be ready to hold through some really nasty periods if this is the thing that you want to roll with. So yeah, I mean, the",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 86,
      "start_timestamp": "02:00:00",
      "start_timestamp_seconds": 7200.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=7200"
    }
  },
  {
    "text": "a little under 8. But this is nuts. A 58 and a half standard deviation of those returns is fucking crazy. So you have to be ready to hold through some really nasty periods if this is the thing that you want to roll with. So yeah, I mean, the overall risk in that is there. It's there for a reason. But yeah, I like leverage ETFs, but traders have to figure out what's right for them. Right? That's what it's come that is literally what it comes down to. You got to figure out what's right for you. Because this beat my best year, my best year trading was last year. And I returned just over 100. It was like 118. That was my best year. This is almost double that. My worst year was down 4. So I absolutely smash this one. So yeah, up to the trader to figure out what's right for them. Polic says, what do you use for scanning markets? A bunch of stuff. I have a video actually that's coming out soon that will go into exactly that for you. It's one is it come out. It's well right now it's either going to come out tomorrow or it's going to come out next week. It really depends on if my editor finishes the paper trading video for tomorrow. If he does, paper trading will come out tomorrow. And then how I analyze the stock market will be the following week. But yeah,",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 86,
      "start_timestamp": "02:01:30",
      "start_timestamp_seconds": 7290.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=7290"
    }
  },
  {
    "text": "to come out tomorrow or it's going to come out next week. It really depends on if my editor finishes the paper trading video for tomorrow. If he does, paper trading will come out tomorrow. And then how I analyze the stock market will be the following week. But yeah, I use a ton of stuff. I use spread indicators. I use indices or relationships between the indices volume relative strength. I'll use economic cycles. I kind of take like a very top down approach. It helps me contextualize things pretty well. That's a good question though. All right gang, that about wraps me up. Super fun. Love hanging out with you guys tomorrow is the GME live stream. We're going to go through the rest of roaring kiddie's trades and then talk about the new offerings and hopefully dive further and further into things. But as always, if there's anything you want me to take a look at, let me know. Be an outlier. I'll see you guys around. Take care.",
    "metadata": {
      "video_id": "FPLK8vS5ono",
      "title": "Options Quiz | Options Trading for Beginners Pt14",
      "url": "https://www.youtube.com/watch?v=FPLK8vS5ono",
      "upload_date": "",
      "duration": 7436.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 86,
      "start_timestamp": "02:02:46",
      "start_timestamp_seconds": 7366.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FPLK8vS5ono&t=7366"
    }
  }
]