[
  {
    "text": "What's up outliers? Quick update on GameStop and Chewy today. As I already told you last week, I'm going to start doing just one or two stocks during these because on the YouTube live sessions, I'm doing every day at 5 PM Pacific time, you can join in for the broader market update stuff. So taking a look at GameStop, however, this is going to be a short video, because there's not a ton going on here. We're still trending very much sideways, although we are seeing ever so slight positive drift. Like if I scale this up so that you can see it a little bit better, there is some element of positive drift going on, which is good. I want to be super clear about that because when I'm looking at something like GameStop, what I don't want to see is really light volume like we've had and it's still contracting day over day, but having the stock drifting down during that time frame, that becomes kind of ugly, which that's not what we're seeing right now, thankfully. So yeah, I think in terms of price action, we're still in a bit of a holding pattern. And then when I take a look over at Chewy, it's, I'm sorry, let's take a look at the options first. Take a look at the GME options chain. I was poking through out of curiosity just to see for things that were 10 lots or higher. If there was any kind",
    "metadata": {
      "video_id": "FqRCqLNv9FU",
      "title": "GME Update and CHWY Options Trade",
      "url": "https://www.youtube.com/watch?v=FqRCqLNv9FU",
      "upload_date": "",
      "duration": 493.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FqRCqLNv9FU&t=0"
    }
  },
  {
    "text": "when I take a look over at Chewy, it's, I'm sorry, let's take a look at the options first. Take a look at the GME options chain. I was poking through out of curiosity just to see for things that were 10 lots or higher. If there was any kind of, you know, repeat stops. If any bigger positions were going on and it's just a mixed bag, this isn't anything that I would take away too heavily. But for example, I can see these 25s getting hit a little bit out in 23 August, but these are all still relatively small positions for, you know, what we've historically seen and what GameStop seems to start thriving on when we get movement. So just not seeing a whole lot there. As far as the options volume today, very light, 120,000 calls against 21,000 puts. So big calls to you on the volume. But this isn't surprising because this looks like a ton of people that are just establishing positions for this week. Now this is one of my curiosities when we were getting towards expiration of last week, there was over 200,000 options that just, you know, came undone. So in this case, what I'm curious about is what's happening with these positions? Are we going to roll out to the next expiration to the next primary expiration? Are we going to let them expire? And what ended up happening is we took them in to expiration. And then it",
    "metadata": {
      "video_id": "FqRCqLNv9FU",
      "title": "GME Update and CHWY Options Trade",
      "url": "https://www.youtube.com/watch?v=FqRCqLNv9FU",
      "upload_date": "",
      "duration": 493.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FqRCqLNv9FU&t=0"
    }
  },
  {
    "text": "in this case, what I'm curious about is what's happening with these positions? Are we going to roll out to the next expiration to the next primary expiration? Are we going to let them expire? And what ended up happening is we took them in to expiration. And then it looks like broadly, there's reestablishing going on. So the 23 aug had 12,000 contracts traded. The 25s had 12,400. The 23s were 12,800. The 24s had 7,900. So you can see where everybody's trying to play this. It's all very near the money, which is actually better than hyper centralizing in these super far out of the monies. I'm glad to see more of the activity going on here. I honestly just don't know if there's going to be enough movement for these folks to make some money. I still am currently just holding shares with some short calls against the shares. And it's because we're trending sideways. So I'll start positioning using options when I start seeing movement. And it's just not happening to a big degree in here just yet. So it's a waiting game. We need to wait and see what the next primary catalyst is going to be. And there are definitely positioning positions being put on on the buy side. So if you take a look at the volume for today, 40 of it were at the ask or above. So people are buying and people are selling puts. So there's definitely a general bullish",
    "metadata": {
      "video_id": "FqRCqLNv9FU",
      "title": "GME Update and CHWY Options Trade",
      "url": "https://www.youtube.com/watch?v=FqRCqLNv9FU",
      "upload_date": "",
      "duration": 493.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FqRCqLNv9FU&t=0"
    }
  },
  {
    "text": "to be. And there are definitely positioning positions being put on on the buy side. So if you take a look at the volume for today, 40 of it were at the ask or above. So people are buying and people are selling puts. So there's definitely a general bullish disposition in terms of single options being put on. But it's just generally light for what we tend to see right now. There's 482,000 total call li against 254,000 put li. And for this front expiration, let's take a quick look at what's in here so far, 63 K against 16. So very light. This should expand after today, after that new volume will be brought in from the transactions that we were just talking about. But still pretty light is what it boils down to. Now pivoting over to chewy quickly because I do have something on in here. And it's just because we started breaking out. So you can see where my stop is. I'm very, very hesitant with earnings coming up. I'm not expecting to hold this straight through earnings. But it looks like there's some general bullish disposition coming into earnings that again, whether or not it turns into anything big, I don't know. But there's a couple of things I see going on here. The first one is volume is actually expanding beyond both of five and 20 day average volume, which is important to me because this indicates increased participation. So today, it was",
    "metadata": {
      "video_id": "FqRCqLNv9FU",
      "title": "GME Update and CHWY Options Trade",
      "url": "https://www.youtube.com/watch?v=FqRCqLNv9FU",
      "upload_date": "",
      "duration": 493.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FqRCqLNv9FU&t=0"
    }
  },
  {
    "text": "it turns into anything big, I don't know. But there's a couple of things I see going on here. The first one is volume is actually expanding beyond both of five and 20 day average volume, which is important to me because this indicates increased participation. So today, it was 65 by volume at 3.7 mil transacted. And the five day volume average is 4.3 million. The 20 day volume average is 4.3 million. So you can see that the by volume alone today, essentially almost paced total daily volume for both previous 20 days and the previous five days. So it just tells me there's interest. And it doesn't surprise me. I'm not suggesting that that's interest driven from any crazy activity. But I do see one coming up, which is earnings. I see earnings coming up in people like playing earnings. So when I take a look at chewy options, if we take a look at the volume for today, it was 47,000 calls against 90, 700 puts. And open interest is 228K calls to 164K puts. Now for me, I'm out here. I'm in the my pass through account. That's why there's no position marked. But I'm out here 60 DTE is you guys know my standard way of buying options. If you're unfamiliar with that, I'll throw a link at the end of the video so that you can go learn about buying options a little bit smarter. So they're not not just lighting money on",
    "metadata": {
      "video_id": "FqRCqLNv9FU",
      "title": "GME Update and CHWY Options Trade",
      "url": "https://www.youtube.com/watch?v=FqRCqLNv9FU",
      "upload_date": "",
      "duration": 493.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FqRCqLNv9FU&t=0"
    }
  },
  {
    "text": "out here 60 DTE is you guys know my standard way of buying options. If you're unfamiliar with that, I'll throw a link at the end of the video so that you can go learn about buying options a little bit smarter. So they're not not just lighting money on fire, every single expiration cycle. But when I look at open interest for this week, it's light 20,000 calls to 7800 puts in 30 hog similar story, six set similar story, 13 set similar story, 20 set is 53 to 45. So there's a little bit more activity there. It has earnings coming up on the 28th. So normally I would expect to see the expiration cycle that contains earnings to be elevated like this right here. Notice how this front expiration is at 106 vol. Then we have 118. This is very high relative to what's ahead of it and after it. So that tells me something's going on there. In this case, it's earnings pretty clear. Obviously because we also know that. So this looks like a slightly more active play right now because I can also see some really big positions being built out. So in this case, you can see these 32s got hammered. They absolutely got hammered and they were kind of spread out throughout the day. So it looks like slightly different people potentially participating. But like this right here, I think this is the same person. And we can see 496 on this",
    "metadata": {
      "video_id": "FqRCqLNv9FU",
      "title": "GME Update and CHWY Options Trade",
      "url": "https://www.youtube.com/watch?v=FqRCqLNv9FU",
      "upload_date": "",
      "duration": 493.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FqRCqLNv9FU&t=0"
    }
  },
  {
    "text": "case, you can see these 32s got hammered. They absolutely got hammered and they were kind of spread out throughout the day. So it looks like slightly different people potentially participating. But like this right here, I think this is the same person. And we can see 496 on this 1495 here, both at 75 cents. Those are not insignificant sized positions. So this is in 30 hog. So you can see that there's some play happening here with the 32s between 30 and 23 hog. That's my guess is that there's some calendars potentially going on. And again, this doesn't surprise me with earnings. So I'm not sure that these are direct, you know, just trying to play this to the upside long call style plays. These look like it could be a little bit of both going on is what I'm seeing. But there's just a little more activity going on here. So right now position on and chewy position on a game stop still technically, but I'm trading chewy a little more directionally with options at the moment because it's showing some activity and then game stops a little bit of a holding pattern. And then later today we will dive into the broader markets. So as always, if you need anything, let me know. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "FqRCqLNv9FU",
      "title": "GME Update and CHWY Options Trade",
      "url": "https://www.youtube.com/watch?v=FqRCqLNv9FU",
      "upload_date": "",
      "duration": 493.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FqRCqLNv9FU&t=0"
    }
  },
  {
    "text": "today we will dive into the broader markets. So as always, if you need anything, let me know. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "FqRCqLNv9FU",
      "title": "GME Update and CHWY Options Trade",
      "url": "https://www.youtube.com/watch?v=FqRCqLNv9FU",
      "upload_date": "",
      "duration": 493.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FqRCqLNv9FU&t=0"
    }
  }
]