[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you So this, I still think is a primary opportunity. Now, another thing that I've been watching is the broader sector flows, which I wanna spend just a moment talking about those and it's because they're telling. So you can see energy is starting to gain a little bit of steam here. And you can see healthcare is now essentially resuming its sell off. Financials, to me, looks like just some standard profit taking. Financials still looks really, really strong. And staples is kind of untrace. Hanging right around where it's been. So what does this mean to me? It means to me that the market is pricing a few different things in. It does look like it's pricing in a lower severity with respect to the tariff situation. So obviously the market is setting itself up either to be highly correct or highly incorrect. And these are the instances where there are big opportunities because if the market is incorrect and there's some sort of negative change with respect to tariffs that leads to significant price dislocation. So the way that I think about trading that kind of thing, especially with the market hovering near highs, there's always a possibility for an unwined or a little bit of a flush. However, the market still spends",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 41,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=0"
    }
  },
  {
    "text": "negative change with respect to tariffs that leads to significant price dislocation. So the way that I think about trading that kind of thing, especially with the market hovering near highs, there's always a possibility for an unwined or a little bit of a flush. However, the market still spends the, well, not the total majority of its time, but of its time a significant majority. So it's anywhere from 30 to 40 that the market will be within 5 of all time highs. And then it obviously breaks down the further away it goes. So just because we're at all highs, important to keep in mind because this is also, as I mentioned, I think yesterday, you'll see the rhetoric of, oh, the next pullback, oh, the next crash is coming or a bow, whatever. And it's just so common to see that come in one more at highs. But a lot of times those are the people that are literally just missing out on profit potential. So last thing to keep in mind, healthcare has been weak. Healthcare continues to be weak. And right now I'm trading short strangles in here, just because of how range bound it's been, and the implied volatility percentile is pretty solid. So because of that, not only is there interesting directional place within the index, but then the index itself is there. It's been highly tradable. Last thing on the broad market, net highs lows still super strong. I want you to",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 41,
      "start_timestamp": "00:01:38",
      "start_timestamp_seconds": 98.59512195121951,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=98"
    }
  },
  {
    "text": "been, and the implied volatility percentile is pretty solid. So because of that, not only is there interesting directional place within the index, but then the index itself is there. It's been highly tradable. Last thing on the broad market, net highs lows still super strong. I want you to pay attention to these lines down here. So the way that this indicator is set up, it might look more hectic than it is. It's really nothing crazy. There's four key components across two different exchanges. This has NASDAQ and New York Stock Exchange. NASDAQ is the purple, nicey is the green. And these lines on top are what I refer to as gross highs. These lines down here are what I refer to as gross lows. And then this histogram is the net between those net highs lows. And then the little dash lines are literally just moving averages. That's all. So it gives us a little bit of context and smooths out the day-to-day trend a bit. So that's the that's what you see here. So the main thing that I want to highlight as I see this is not just that net highs lows is so far remaining very resilient. But even though it seems like it's plateauing, it's not plateauing in a negative way. Here's what I mean by this. If I give you two scenarios, you tell me which of these two scenarios is worse. Scenario one. And I will draw it so that it's",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 41,
      "start_timestamp": "00:03:17",
      "start_timestamp_seconds": 197.19024390243902,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=197"
    }
  },
  {
    "text": "remaining very resilient. But even though it seems like it's plateauing, it's not plateauing in a negative way. Here's what I mean by this. If I give you two scenarios, you tell me which of these two scenarios is worse. Scenario one. And I will draw it so that it's easier. Scenario one net highs lows is declining or plateauing because gross lows are expanding. That's scenario one. Scenario two is net highs lows is leveling off because gross highs is slowing. But gross lows are also slowing. Which one of those is a worse indicator meaning health of the market looks bad. Scenario one where this indicator is plateauing because gross lows is expanding. Or scenario two where we can see the same exact impact where it's plateauing. But gross highs is slowing down as well as gross lows is also coming in leading to the same plateau. And Lauren already has the answer. She's exactly correct. It's scenario one. Scenario one is way less healthy for the market and Kirk is also completely correct. So the thing to keep in mind is when we use breath indicators and again, this is one of my preferred is net highs lows across different exchanges is the context always matters. It always, always matters to me. So in this context, even though it looks like it's plateauing slash slightly expanding, all this means to me is that the net highs are slowing down, which will happen naturally. But we're seeing gross",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 41,
      "start_timestamp": "00:04:55",
      "start_timestamp_seconds": 295.7853658536585,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=295"
    }
  },
  {
    "text": "lows across different exchanges is the context always matters. It always, always matters to me. So in this context, even though it looks like it's plateauing slash slightly expanding, all this means to me is that the net highs are slowing down, which will happen naturally. But we're seeing gross lows expanding in even more effectively. So this to me is still bullish configuration. Now where this starts to turn bearish configuration is if that scenario changes and we see gross lows expanding significantly while gross highs is either plateauing, growing ever so slightly or decelerating. That is a much more bearish configuration, which we're just not in right now, which is pretty cool. So any stocks that we want to look at, it looks like a non-says thoughts on Oracle for tomorrow. Yeah. So let's take a look at Oracle really fast. Oracle was also popping up into a bunch of alerts today. So let's see what the recent news for today was. Shares of Oracle, rally 5 would prove to be all around, makes trading session, stocks third consecutive day of gains, outperform competitors, Microsoft, trading volumes have been and sustain pretty heavily. So so far, Oracle has been gaining a lot of steam. Now it does have a dividend coming up on the 10th, which is as always important to keep in mind in terms of short term price behavior. But if we take a look at what's been going on under the hood. Let's see what's",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 41,
      "start_timestamp": "00:06:34",
      "start_timestamp_seconds": 394.38048780487804,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=394"
    }
  },
  {
    "text": "been gaining a lot of steam. Now it does have a dividend coming up on the 10th, which is as always important to keep in mind in terms of short term price behavior. But if we take a look at what's been going on under the hood. Let's see what's up. That's what's up. Do you notice how there's been a pretty significant expansion of long net call premiums? So this is obviously an expectation of upside in the derivatives market. And it's essentially just following along with the overall price. This isn't always the case. Sometimes people will say like, oh, they're just trying to trade like this price activity, which can be the case, depending on what options were traded. I actually think today is largely the case. And the funny thing about it is I also think some of what you see here is interesting to me. And it's because this isn't a fun effect that's starting from zero dTEs and high zero dTE volume has a compounding effect. Now I would not say that that's what the 5 came from. But I absolutely would say that is what a some subset of percent that I couldn't put my finger on of the move that you saw today does come from that. Because if you take a look at the highest volume contracts today, what do you notice? Zero dTE, zero dTE, zero dTE, zero dTE, zero dTE, zero dTE. So in terms of that heavy of",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 41,
      "start_timestamp": "00:08:12",
      "start_timestamp_seconds": 492.9756097560976,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=492"
    }
  },
  {
    "text": "put my finger on of the move that you saw today does come from that. Because if you take a look at the highest volume contracts today, what do you notice? Zero dTE, zero dTE, zero dTE, zero dTE, zero dTE, zero dTE. So in terms of that heavy of total volume and you're trading stuff that zero dTE that demands specific hedging activity depending on where it sits. And we can get a sense of that based on where GECS sits. And we can literally forecast what kind of hedging activity is going to have to happen as we're rallying through the day. Now something like Kirks' Gama Squeezie or dTE. Yeah, I wouldn't go as far as to call it that, but your mind is in the exact correct place. There is absolutely dealer hedging behavior that has to happen at some of these levels. And you can see how strong net positive gamma is. And for those that are unfamiliar, gamma hedging essentially gives us an instinctual understanding of what a dealer might be doing as far as hedging. And I'll actually will work through an example of that together really quick. I just got to open the door because it's hot in here. Give me one sec. All right, we're back at it. Let's talk a little bit about GECS. And let's just get an understanding in this context, the impact that zero dTEs can have on that. So let's start with some underlying assumptions. And",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 41,
      "start_timestamp": "00:09:51",
      "start_timestamp_seconds": 591.570731707317,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=591"
    }
  },
  {
    "text": "the door because it's hot in here. Give me one sec. All right, we're back at it. Let's talk a little bit about GECS. And let's just get an understanding in this context, the impact that zero dTEs can have on that. So let's start with some underlying assumptions. And again, I want you to play along with me answer if you know what's cracking. So the first thing is when what is the underlying assumption when we use something like GECS, there is a very, very, very important underlying assumption that is not fully correct. It's broadly correct, but it's not fully correct. Does anybody know what that assumption is? Throw it in the chat if you know what I'm referring to. Any guesses? None? It's very simple. If you were to take a guess, even if you don't know, let's start from base principles. Chase says I don't know anything about GECS. Totally cool. So we can start from a slightly higher level. GECS refers to GAMMA exposure. And when we're talking about, aha, Shre has the answer. Shre says assumption of dealer positioning as opposed to the other side. That's exactly correct. Good job, Shre. Wait a, wait a, bring a home for the team. So here's what this means. GAMMA exposure is this. If I am a market maker, what we would call a dealer, because there are different types of dealers, the dealer. If I'm a dealer, and I make markets in XX numbers of",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 41,
      "start_timestamp": "00:11:30",
      "start_timestamp_seconds": 690.1658536585367,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=690"
    }
  },
  {
    "text": "wait a, bring a home for the team. So here's what this means. GAMMA exposure is this. If I am a market maker, what we would call a dealer, because there are different types of dealers, the dealer. If I'm a dealer, and I make markets in XX numbers of stocks, this is pretty common for an options market maker. They'll make markets in multiple names. What they're doing is they're looking to facilitate transactions. So they're essentially looking to facilitate if I want to buy, then they're going to sell. If I want to sell, then they're going to buy. And then as they run this market making activity, if you look behind the curtain, they start to develop what we call a book. And inside a book, there are a bunch of individual positions. So position one, position two, position three, position four, and this goes into the thousands, thousands and thousands and thousands. So when we take a look at their inventory, and we talk about something like their overall exposure in an individual name, this is entirely hinged on the assumption that these guys are the counter party to each transaction. That's the underlying assumption. And again, it's not fully accurate. It's pretty accurate, but it's not fully accurate. So the way that we arrive at something like GX is we observe all of the option activity. And then we take a look at what their inventory is. And then we literally net it out. How",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 41,
      "start_timestamp": "00:13:08",
      "start_timestamp_seconds": 788.7609756097561,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=788"
    }
  },
  {
    "text": "again, it's not fully accurate. It's pretty accurate, but it's not fully accurate. So the way that we arrive at something like GX is we observe all of the option activity. And then we take a look at what their inventory is. And then we literally net it out. How many options were bought? How many options were sold of these? How many were calls? How many were puts? Because if we think about buying to open a call or buying to open a put, these have specific gamma effects. And then the same thing, if they sell to open a call or sell to open a put. So if we think here of the net exposures here, let's dive into what this means in terms of dealer hedging behavior, which is really what GX is looking to identify. It's looking to take a look at what their overall inventory is. And then asks a question based on the inventory. What does their position, their total series of positions look like? How does that impact their inventory? So the first assumption is that they're to counter party. The second assumption. The second assumption is that they want to remain delta neutral. This is also incorrect. So both of these assumptions are partially correct, not fully correct. Why is that? Well, it's because the process of delta hedging reduces overall profitability. So if they can avoid delta hedging, they would prefer to. Because then they don't have to outlay that capital.",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 41,
      "start_timestamp": "00:14:47",
      "start_timestamp_seconds": 887.3560975609756,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=887"
    }
  },
  {
    "text": "neutral. This is also incorrect. So both of these assumptions are partially correct, not fully correct. Why is that? Well, it's because the process of delta hedging reduces overall profitability. So if they can avoid delta hedging, they would prefer to. Because then they don't have to outlay that capital. And it's a more efficient way for them to try to make the spread. And then some. Now that doesn't mean that it's binary. It's not binary. If you take a look at a book of thousands of Oracle options, it will have huge deltas. So let's say that in terms of delta, they have 2.8 million positive total deltas. And let's say their gamma is 1.1 million gamma, like whatever. The point here is it's not binary. They don't have to either fully delta hedge or not. So a lot of times what they try to do is hedge as little as possible. So they'll say the 2.8 is a little heavy, but let's say of this 2.8 million deltas that they have, let's say 70 of it is further out in time. That means that they don't have to worry about hedging it as voraciously. But the stuff that's near in time does have to be delta hedged specifically if it's at or in the money. If it's out of the money, they can still play the game of, I'm not really going to bother delta hedging much here. And the reason is because depending on what the",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 41,
      "start_timestamp": "00:16:25",
      "start_timestamp_seconds": 985.9512195121952,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=985"
    }
  },
  {
    "text": "that's near in time does have to be delta hedged specifically if it's at or in the money. If it's out of the money, they can still play the game of, I'm not really going to bother delta hedging much here. And the reason is because depending on what the delta's are, the probability is the option might be more likely to land out of the money so they don't have to carry the hedge. Okay. So these are the two assumptions. So let's just look at a very simple scenario. Let's pretend that this has nothing to do with the market maker. Let's just look at a single option position and let's see what let's see what we can learn. Let me move this. This is perfect. Okay. I want you to tell me what the delta effect is, positive or negative. If I, if I'm a market maker and let's say that I sold to open a call, a call option, what's my delta effect, positive or negative, what's my gamma effect? Positive or negative, data, data, Kirk says negative negative negative, oh perfect. So Kirk spot on Jonathan spot on Ethan spot on Reese spot on Good job, bald gang. So this is correct. We're going to have negative delta's. Okay. What is our gamma? Positive or negative? We go into an option chain and we take a look at gamma. What do you notice on the call and the put side call and put side? I",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 41,
      "start_timestamp": "00:18:04",
      "start_timestamp_seconds": 1084.5463414634148,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=1084"
    }
  },
  {
    "text": "job, bald gang. So this is correct. We're going to have negative delta's. Okay. What is our gamma? Positive or negative? We go into an option chain and we take a look at gamma. What do you notice on the call and the put side call and put side? I go to gamma, gamma's positive. I go to gamma here, gamma's also positive. So what does that tell us? That tells us that if you're long an option, you're long gamma and this implicitly makes sense because an entire component of being long option is to be long gamma. It's to gain convexity. So if you sold that option, you are going to be short gamma. And then theta, Vega, these don't matter that much for this context. Don't worry about it. So let's take a look at this one position and let's say that we wanted to remain delta neutral. So let's say stock XYZ is at 10 and they sold this call. And let's say at the beginning, it was delta hedge. It's flat. Don't worry about what they did to delta hedge. Let's just go in under the assumption that it's flat. We're now going to play this scenario going forward. So tell me what they need to do for delta and gamma, add or subtract shares if let's say the stock goes from 10 up to 11. So I'll make this scenario here. So the stock goes up to 11. What do they need to do",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 41,
      "start_timestamp": "00:19:43",
      "start_timestamp_seconds": 1183.141463414634,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=1183"
    }
  },
  {
    "text": "this scenario going forward. So tell me what they need to do for delta and gamma, add or subtract shares if let's say the stock goes from 10 up to 11. So I'll make this scenario here. So the stock goes up to 11. What do they need to do to rebalance their delta and their gamma? RISES add, Kirk says add, are you guys saying that this adds delta or that they need to add delta's? Because the question is, well, actually, we'll just do what is the impact of delta? We'll do both of them so that it's easier. So of this, on this options position, if the stock goes up to 11, first, what is the impact of delta? Does delta go up or does delta go down? Okay, so Kirk says the negative delta increases. Okay, good. So delta increases. What happens to your gamma? What happens to your gamma? Again, this is just for the option. This isn't looking at the hedging activity. This is just saying from the dealer, we'll get to that in a second. Negative gamma expands. Okay, so this is incorrect for Kirk. It's close, but it's incorrect. Why is that incorrect? Why is Kirk's good guess and generally appropriate guess? Kirk says depends on how fast it went to 11. Nope, that's not it. A good follow on guess. What else do you guys got? Help Kirk out. Trey, if you're in there lurking, you better speak to fuck up.",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 41,
      "start_timestamp": "00:21:21",
      "start_timestamp_seconds": 1281.7365853658537,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=1281"
    }
  },
  {
    "text": "incorrect? Why is Kirk's good guess and generally appropriate guess? Kirk says depends on how fast it went to 11. Nope, that's not it. A good follow on guess. What else do you guys got? Help Kirk out. Trey, if you're in there lurking, you better speak to fuck up. You ain't getting out of this unscathed. Delta goes lower, nearer at the money. Rhee says their stock hedges delta one. Jonathan says I thought gamma was long anyways in this scenario. We're focusing on gamma. So all I'm asking is if stock goes, if stock XYZ goes up 1, what happens to the gamma of the option? We're not talking about the hedging activity yet. We're simply saying what happens to the gamma of the option? Shrey says slows down, but increases. Guys, what is my favorite saying? What's really not my favorite saying? But what's the thing I say all the fucking time? You know the answer to that. Most of you will know the answer to that. It depends. Reese's got it. And Shrey's got it. For those that took a guess at up or down, can you take a follow on guess as to why it depends? Reese says, days to expiration. That's actually not it. Good guess, but not it. Why does it depend? What is it about gamma? Lauren comes out of left field with Vega. Every once in a while, Lauren, you got to take a fucking shot. So I'll give you credit",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 41,
      "start_timestamp": "00:23:00",
      "start_timestamp_seconds": 1380.3317073170733,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=1380"
    }
  },
  {
    "text": "depends? Reese says, days to expiration. That's actually not it. Good guess, but not it. Why does it depend? What is it about gamma? Lauren comes out of left field with Vega. Every once in a while, Lauren, you got to take a fucking shot. So I'll give you credit for taking a shot. It's completely wrong, but you took a shot, which you get respect there. Ethan says IV. I mean, technically, that's not wrong because there's third and fourth order Greeks that measure those kinds of effects, the impact of implied volatility on something like gamma, but that's not it in this scenario. ZX Borg says depends on which side of the money you're on. It doesn't. So gamma will be whatever it is. Shrey says it depends on where delta is. Doesn't have to drive delta much if further away from the money. That's the closest answer so far. So let's resolve this. So I'm going to look at gamma. And I'm going to look at it by delta. So delta, I'm going to have a 0.80. I'm going to have a 0.50. I'm going to have a 0.20. Can you guys see where I'm going with this? Here. What's going to happen? I'm going to move this off to the side and we're going to look at this together. It doesn't matter. We're just going to pick an expiration. This one's great. We'll stay literally right here. This is beautiful. So if I take a look",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 41,
      "start_timestamp": "00:24:38",
      "start_timestamp_seconds": 1478.9268292682927,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=1478"
    }
  },
  {
    "text": "this? Here. What's going to happen? I'm going to move this off to the side and we're going to look at this together. It doesn't matter. We're just going to pick an expiration. This one's great. We'll stay literally right here. This is beautiful. So if I take a look at an 80 delta, my gamma is 0.10. If I take a look at the 50 delta, which is one of these doesn't matter. We'll call it 0.16. If I take a look at a 20 delta, we'll call it here 0.10. What do we see? If the stock goes up, what do we see? What's the difference between these? What's the difference between these? Jonathan says long gamma should go up for a call. A dollar increase should raise gamma. Yes. Very, very close. I just want you to take a look at the actual gamma numbers. Is 0. I missed this one. This one should be 0.01. There. 0.16, 0.10. So what happens here? As we go from a 0.2 delta to 0.5, we'll get rid of these. Follow me along. Follow along with me. As I go from a 20 delta to a 50 delta, my gamma has gone from 0.01 to 0.01.6. Has my gamma gone up or gone down? Is 0.01.6 higher or lower? Bingo. Jordan has the correct answer. What we're looking at here is the relationship. Gamma, let's say this is a call option, call delta. This says the stock goes up. It",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 41,
      "start_timestamp": "00:26:17",
      "start_timestamp_seconds": 1577.5219512195122,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=1577"
    }
  },
  {
    "text": "has gone from 0.01 to 0.01.6. Has my gamma gone up or gone down? Is 0.01.6 higher or lower? Bingo. Jordan has the correct answer. What we're looking at here is the relationship. Gamma, let's say this is a call option, call delta. This says the stock goes up. It doesn't matter how much. So the stock goes up. That means our delta will increase. Going from a 0.2 to 0.5 delta, the stock goes up. Gamma increases from 0.01 to 0.01.6. However, if the stock goes up enough, then what happens to our delta? Our delta goes up more. But what happens to our gamma? Our gamma now goes down. It goes from 0.016 to 0.01. So going back to the prior example of stock XYZ at 10, going up by a dollar, we know delta goes up. Gamma, technically speaking, we don't know. It depends. The reason why it depends is it depends on what the call option is. Right? Because if our call option, let's say, was a 55 delta, and the stock goes up, our gamma would actually decrease. Does that make sense? So what we're looking at is how gamma behaves with respect to moneyness. This is what you're seeing. Well, I thought that's what you're seeing. This thing doesn't let me paste stuff when I have this stupid little drawing thing open. It's really annoying. So what you're seeing is a relationship to moneyness. This is showing you an at the money option. So",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 41,
      "start_timestamp": "00:27:56",
      "start_timestamp_seconds": 1676.1170731707316,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=1676"
    }
  },
  {
    "text": "This is what you're seeing. Well, I thought that's what you're seeing. This thing doesn't let me paste stuff when I have this stupid little drawing thing open. It's really annoying. So what you're seeing is a relationship to moneyness. This is showing you an at the money option. So as we move closer to at the money, we're going to get more gamma. Then as we essentially get to at the money, moving away from at the money in general, further in the money, you're going to lose gamma. Gamma is going to actually go down. So to this example, it depends. Assuming to clarify this scenario, assuming that our call option is 0.30 delta. Now what can we conclude about the gamma? If we have a 0.30 delta option and stock XYZ value that 10 becomes 11, it goes up by 1. What is the net effect on the gamma of the option? Don't worry about the position that we talked about in the beginning. Just what is the effect on the option itself? Do we gain gamma or lose gamma? Bingo. Kirk Scott it. Gamma will expand. Beautiful. ZX Board says so gamma is kind of like a bell curve centered around at the money, which is also kind of like an extrinsic value of an option. Bingo. It's exactly correct. This is exactly the way to look at it. Good job. So the way to think about gamma is it has this kind of plot. These",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 41,
      "start_timestamp": "00:29:34",
      "start_timestamp_seconds": 1774.7121951219513,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=1774"
    }
  },
  {
    "text": "a bell curve centered around at the money, which is also kind of like an extrinsic value of an option. Bingo. It's exactly correct. This is exactly the way to look at it. Good job. So the way to think about gamma is it has this kind of plot. These are just two different explorations. So gamma is generally going to be the highest for the at the money. Now again, I say generally because there are instances where based on volatility, gamma can be distorted sometimes. Gamma can be slightly higher for something that's a strike or two in the money, but is a broad general rule. That's correct. That's exactly correct. So now let's talk about the dealer position. So going back to our original scenario, where the dealer's soul to open this call. So if they're soul to open their call, we already know from the beginning their delta is negative. Their gamma is negative. So if their delta goes up, what happens to their overall delta? If they're short the option, did they get more short delta's or less short delta's? What do you guys think? They got more short. There you go. So in this scenario, they got more short delta's. If I want to be delta neutral as the dealer, what do I need to do now? What do you guys think? By shares. YTR is exactly correct. So to put numbers on this scenario, let's say that when we sold to open, our",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 41,
      "start_timestamp": "00:31:13",
      "start_timestamp_seconds": 1873.307317073171,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=1873"
    }
  },
  {
    "text": "scenario, they got more short delta's. If I want to be delta neutral as the dealer, what do I need to do now? What do you guys think? By shares. YTR is exactly correct. So to put numbers on this scenario, let's say that when we sold to open, our delta was 0.30 and we know that it's a negative 0.30 because we sold to open. The stock goes up by a dollar. So let's say our delta becomes negative 0.35. So let's just say that this is based on a one-law. So we can figure out what our total delta's are. Here. And then what they become. So then we can figure out the difference between these two is five. So if you remember the scenario, we went into the trade being delta hedged. So at the onset, what does that mean? If we went into the trade being delta hedged, what is the stock transaction that would have happened at this stage? What would I have done as the dealer? If I started short, bingo, Ethan's got it. So I would about 30 shares. So this is delta. This is total delta. This is shares. So if we look at this, and we track our net position, we're flat. Right. So now we can see what our net delta's are. So now, this scenario emerges. We're still starting along those 30 delta's. But now the stock has gone up by a dollar. So now it's taking us to",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 41,
      "start_timestamp": "00:32:51",
      "start_timestamp_seconds": 1971.9024390243903,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=1971"
    }
  },
  {
    "text": "look at this, and we track our net position, we're flat. Right. So now we can see what our net delta's are. So now, this scenario emerges. We're still starting along those 30 delta's. But now the stock has gone up by a dollar. So now it's taking us to this point. So then as we just discussed, pretending that the delta stays the same, total delta stays the same for the option, what do we need to do now? And you guys hit it. We have to buy shares. So now we have to add five shares. So we go to 35 shares. We buy five shares. Exactly as Ethan has it. Now we're back to delta neutral. So gamma tells us how fast delta is going to change. So that's going to tell us how many shares we're going to have to buy to compensate not just for the move in delta, but for the advancement of delta based on what gamma shows us. So this is the process here of delta hedging in a nut shell, like in a very simplistic sense. So where this becomes interesting is in the example of Oracle. If we take a look at some of these trades for the day. So this was for three July, let's see what the delta is for those really quick. So let's go to three July, the two 30s. Those are a 70 delta. So they're starting here from a 70 delta. And let's say",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 41,
      "start_timestamp": "00:34:30",
      "start_timestamp_seconds": 2070.4975609756098,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=2070"
    }
  },
  {
    "text": "look at some of these trades for the day. So this was for three July, let's see what the delta is for those really quick. So let's go to three July, the two 30s. Those are a 70 delta. So they're starting here from a 70 delta. And let's say that the volume was 22,734. Now these aren't all sold. It's about 50, 50. So what we'll do is we'll take this number and we'll defy it in half. So we'll say it's 11,350. So the net delta of that position is short, 794,500. So for that option, how many shares do they need to buy in order to become delta neutral? Exactly. YTR has it in sodas Kirk. They need to go out and buy these shares. To get back to delta neutral. So what does this do to price? If the price of an underlying is based on supply and demand, here's the price of a stock, here's the volume. If there's an artificial purchasing factor based on people trying to hedge for the day, what does that do? This adds demand. Increase in demand, no change in supply increases price. Everything else, satirist, parabas remaining the same. So fun fact, this actually was not by any sense what I was expecting to go through and deep dive today, but I still think it is a worthy conversation. So let me take a pause there and see if you guys have any questions. Anon says, based on this",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 41,
      "start_timestamp": "00:36:09",
      "start_timestamp_seconds": 2169.0926829268296,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=2169"
    }
  },
  {
    "text": "So fun fact, this actually was not by any sense what I was expecting to go through and deep dive today, but I still think it is a worthy conversation. So let me take a pause there and see if you guys have any questions. Anon says, based on this info, do we expect to do the rally tomorrow if hedging happens against tomorrow considering it opens at 230? Can't determine that because it will all depend on the options flow. So we can expect some sort of price activity, but the hedging activity itself, there could be an argument for the opposite case where if let's say price goes down a little bit and then all of a sudden they start selling off in order to flatten out their deltas on the zero DTE option. So it can go both ways and it really depends on what the overall vibe of the market is, what the other forces are at play. Ethan says so buy, buy selling calls I am contributing to my own demise. Not necessarily because the hedging activity will be very different again depending on days to expiration and depending on delta because if we have a really low delta the overall hedging activity is pretty low, not a lot has to happen. Also compounded by if it's pretty far out of the money and pretty far out of time you don't have to you don't have to hedge a whole bunch. They might have a",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 41,
      "start_timestamp": "00:37:47",
      "start_timestamp_seconds": 2267.687804878049,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=2267"
    }
  },
  {
    "text": "a really low delta the overall hedging activity is pretty low, not a lot has to happen. Also compounded by if it's pretty far out of the money and pretty far out of time you don't have to you don't have to hedge a whole bunch. They might have a total of a 20 delta option equivalent and they might hedge a third of it. They don't have to hedge the whole thing and it's because they want to give it some time they might choose to take some risk off but they're not inherently just going to automatically take all risk off all the time, which is again one of the shortfalls of these kind of tools. It's not a shortfall but it's something that you have to understand is that when we look at gamma here just because there's really strong net positive gamma doesn't inherently mean that they're going to have to go out and just buy a bunch of shares as this thing moves. It really depends on what the exposure itself looks like. Kirk says so delta neutral is largely gamma negative is still largely gamma negative depending because in a vacuum there are two different things, right? So in a vacuum if I have delta and gamma and let's say that I start off long 10 delta's so then I sell to open 10 shares flattening out my delta's. What does that do to my gamma? Nothing. There's no changing gamma. So if my",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 41,
      "start_timestamp": "00:39:26",
      "start_timestamp_seconds": 2366.282926829268,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=2366"
    }
  },
  {
    "text": "different things, right? So in a vacuum if I have delta and gamma and let's say that I start off long 10 delta's so then I sell to open 10 shares flattening out my delta's. What does that do to my gamma? Nothing. There's no changing gamma. So if my gamma here was plus five and I make this transaction my gamma doesn't change at all. It's still plus five same same. No change. So now the way that dealers tend to hedge their book is through something called gamma hedging and the process is really really simple. So if we think of the same scenario that we had before so selling to open a 20 delta call in xyz at 10 bucks. So let's say that this 20 delta call has a gamma of 0.02 and we're going to be short that gamma we're going to be short this delta. So the way that we would actually neutralize the Greek exposure of this specifically gamma and delta would be the first thing we have to do is buy an option that has 0.02 gamma. So this could be buying a call. This could be selling a put. It really depends on I'm sorry it is just the opposite not selling a put. It would be buying a call buying a put depending on what the rest of the book looks like. It's kind of like a puzzle piece. So we're going to buy to open an option of some",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 41,
      "start_timestamp": "00:41:04",
      "start_timestamp_seconds": 2464.878048780488,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=2464"
    }
  },
  {
    "text": "depends on I'm sorry it is just the opposite not selling a put. It would be buying a call buying a put depending on what the rest of the book looks like. It's kind of like a puzzle piece. So we're going to buy to open an option of some sort that offsets this gamma. So let's say we buy to open this option that offsets this gamma but then this gives us a little bit of delta. So let's say that this option whatever it is gives us positive 0.22 delta's. So now we've flattened out the gamma. We've had negative 2 gamma here, positive 2 gamma here, our gamma exposure is flat. But now we have negative 20 delta's here, positive 22 delta's here, so that gives us plus 2 delta's. So if we wanted to be truly delta neutral now what we would do is scrub the remaining delta's. We would sell to open two shares. Now again this is all a hypothetical. Typically if you're within two delta's nobody would bother with that right it's normally what we would call a delta band. And it's just because it's way to friction driven to essentially hedge each delta as it moves. So the way to actually maintain delta neutrality is first to focus on flattening out your gamma then scrubbing off the remaining delta's and then you essentially repeat that process to maintain that exposure. And for a market maker part of this happens naturally depending on",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 41,
      "start_timestamp": "00:42:43",
      "start_timestamp_seconds": 2563.4731707317073,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=2563"
    }
  },
  {
    "text": "delta as it moves. So the way to actually maintain delta neutrality is first to focus on flattening out your gamma then scrubbing off the remaining delta's and then you essentially repeat that process to maintain that exposure. And for a market maker part of this happens naturally depending on what markets they're offering and what their total book looks like. So Ian says does hedging activity like this artificially influenced price often? If we see some price action and commensurate volume should we stop to ask ourselves if that might just be hedging? Absolutely. It will be without a doubt partially hedging activity. It's always partially hedging activity of some sort because no matter what those participants are managing broad books that are doing a lot of things. So hedging activity will always be a part of price. Now how much depends on what the book looks like. So yeah Ian your instincts are correct whenever you see price movement it's never just speculation or something like that because there's a lot of artificial market effects that are underway. Rebalancing of portfolios happens. Rebalancing of ETFs happens where it's not necessarily a speculative position. It's just regaining the desired exposure to something. So that's exactly correct. Reece says oh I asked why they don't delta hedge with options but they cover gamma via options delta via shares. Yeah that's the way to think about it. The reason why you don't delta hedge with options is because now you're just",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 41,
      "start_timestamp": "00:44:22",
      "start_timestamp_seconds": 2662.068292682927,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=2662"
    }
  },
  {
    "text": "exposure to something. So that's exactly correct. Reece says oh I asked why they don't delta hedge with options but they cover gamma via options delta via shares. Yeah that's the way to think about it. The reason why you don't delta hedge with options is because now you're just amplifying your gamma exposure. And depending on how you choose to delta hedge now you have two moving pieces right you have the moving piece of the option that you're trading and then you have the moving piece of the other option that you're using to offset this option. So then it just gets really contorted really fast. The reason why delta hedging is often done what the underlying is because they're delta one instruments. And that's the positive component right you're actually able to isolate some components of the trade. Ian says does that make price less informative? No it's it's less informative if one thought that all price action that you see is speculative then from that starting point price is absolutely less informative but price is still highly informative nonetheless. Kirk says gamma hedging any sold option also reduces the positive theta. Yep. And the thing to keep in mind is for a market maker they're not they don't want the Greek exposure. They're managing the Greek exposure. They want to make their money on the bit-ass spread and then maybe a little bit if they can under hedge or maybe even directionally follow an idea. That's",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 41,
      "start_timestamp": "00:46:00",
      "start_timestamp_seconds": 2760.6634146341466,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=2760"
    }
  },
  {
    "text": "keep in mind is for a market maker they're not they don't want the Greek exposure. They're managing the Greek exposure. They want to make their money on the bit-ass spread and then maybe a little bit if they can under hedge or maybe even directionally follow an idea. That's a slightly different scenario but the most of their money is made just by grinding out the bit-ass spread. So yeah they don't want all of those other Greeks. In general if they can carry slightly positive theta that's absolutely preferential but their focus is managing the overall risk in the book to capture the bit-ass spread. Ethan says is managing your own portfolio in this way not possible due to cost. No you can definitely gamma and delta hedging a portfolio for sure. You just can't do it in the theoretical sense that a lot of people talk about in terms of like perpetually gamma and delta hedging that's why I was referring to earlier when I said that people often use bands that makes it much more accessible. So that means that you're not going to depending on the size of the position you're not going to freak out if your delta's move a little bit or if your gamma moves a little bit. But this is also why if you're trying to actually isolate volatility it can be kind of tricky and I'll show you. Let's use this scenario. I want to pick something Tesla would be",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 41,
      "start_timestamp": "00:47:39",
      "start_timestamp_seconds": 2859.2585365853656,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=2859"
    }
  },
  {
    "text": "out if your delta's move a little bit or if your gamma moves a little bit. But this is also why if you're trying to actually isolate volatility it can be kind of tricky and I'll show you. Let's use this scenario. I want to pick something Tesla would be a good example. And let's go back to the 14th of May. So let's go another day to the 15th. And let's just say to ourselves for whatever reason we think Tesla is now going to start oscillating sideways. We think now after all the craziness, Elon maybe dropped another post on X maybe he hit another blunt whatever it is and we think that this is now going to grind sideways for a while. And we choose to do that via shorting a strangle. So if we start with the 295 short which is at a 19 delta and then we do the 410. So let's take a look at the position to start with. We have the 290 put the 410 all our delta here I'm going to squish this down so again I can move a little quicker. Our delta here is point point 198 and I'm saying that we sold to open this so it's going to be positive. And then the 410 calls going to be negative 0.203 our gamma is negative 0.004 and negative 0.004. I'm sorry. negative 0.004. Okay. So this is where our position starts. So if we net out the delta's",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 41,
      "start_timestamp": "00:49:17",
      "start_timestamp_seconds": 2957.8536585365855,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=2957"
    }
  },
  {
    "text": "saying that we sold to open this so it's going to be positive. And then the 410 calls going to be negative 0.203 our gamma is negative 0.004 and negative 0.004. I'm sorry. negative 0.004. Okay. So this is where our position starts. So if we net out the delta's and we net out the gammas and let's I'm going to amplify this a little bit so that it makes a little more sense. It looks like I got disconnected. I think I'm back. I don't know why I got disconnected. My bad. So let's take a look at our total position. Great. So if we start this we're going to sell 5 shares so I'll have the equity component down here. And again today I think we did is like 15 May. So all we're going to do is we're going to buy shares. We're going to buy 5 shares plus 5 shares. And we're going to buy 5 shares price right now is 338 97 338 so far. So now we'll fast forward time. Let's go fast forward a day. We'll go to 16 May. And this is when stock was at 338. All right. So now the stock is at 347. 347 88. So it's increased by 10 bucks. So now let's take a look at what happened to our option. Our delta here is now 0.166. Oops. We're dealt on the puts is 0.166. The 410 calls is now 0.244. Gamma is 0.004 and 0.004. So",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 41,
      "start_timestamp": "00:50:56",
      "start_timestamp_seconds": 3056.448780487805,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=3056"
    }
  },
  {
    "text": "stock is at 347. 347 88. So it's increased by 10 bucks. So now let's take a look at what happened to our option. Our delta here is now 0.166. Oops. We're dealt on the puts is 0.166. The 410 calls is now 0.244. Gamma is 0.004 and 0.004. So we're still good on gamma. So what's happened now? Well our position has changed a little bit. We just changed based on our short deltas getting shorter in our long deltas getting lower. So we now have to buy another 78 shares. So now we'll go to 16 May. The stock is now at what did I say 3348. So now we have to add 78 at 348. So now you're long 28 grand of Tesla. And essentially this is how she goes. This is what the process looks like. So now you have 83 shares. So then what ends up happening if the stock goes down. So let's say it's now 20 May. I'm just going to ballpark here. And let's say that the stock goes to 310. So what's happened here? The stock goes to 310. We know all of these now are going to shift. We know that our short deltas are going to decrease. Our long deltas are going to increase. So our net delta position could completely flip. And let's fast forward. There was a drop at some point during this. So let me see if I can find where that drop was. Not here.",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 41,
      "start_timestamp": "00:52:35",
      "start_timestamp_seconds": 3155.0439024390244,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=3155"
    }
  },
  {
    "text": "that our short deltas are going to decrease. Our long deltas are going to increase. So our net delta position could completely flip. And let's fast forward. There was a drop at some point during this. So let me see if I can find where that drop was. Not here. Let me go 28. Doesn't look like there. There we go. Let's go to the fifth. Go to the sixth. Actually, no, I think to the upside, isn't even better example because we started where from the 14th to the 15th. Yeah, we started somewhere in here. So let's go to this point here, the 29th. Because this will just show it to the long side. So now we're going to go to 29 May. And the stock is now at 360.3.87. So we have another 16 point change. Let's see what our options look like. I think we were in this. I don't remember the expiration, but it doesn't really matter. So in this expiration, the 290s are now at a point 075. So the 410s are at 0.257. So now we're short 182 delta. So we're going to go to the flat. And now we're 65 KN. So this is actually really good example. So let's go just a little bit further. Yeah, June 9th. Ethan says all this for a couple dollars of theta. Not so much. This is a completely different thing. Like you wouldn't do this for theta. This context like with all of these",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 41,
      "start_timestamp": "00:54:13",
      "start_timestamp_seconds": 3253.6390243902442,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=3253"
    }
  },
  {
    "text": "this is actually really good example. So let's go just a little bit further. Yeah, June 9th. Ethan says all this for a couple dollars of theta. Not so much. This is a completely different thing. Like you wouldn't do this for theta. This context like with all of these adjustments would be more if you're trying to isolate volatility, which theta is a byproduct. But this is way more for a volatility based trade. But more importantly, this is actually to show what the like trading activity is like. Because this might look like a lot. But at least for somebody that trades even at a semi professional level, this really isn't anything crazy. It's just a matter of buying or selling shares. And the other thing that I would be doing here is adjusting the options. Like I wouldn't just sit the options. Because as you could tell, there's a big change, right, as things move. So now the stock is at 2.95. And clearly we're not going to be buying shares at this point. Let's take a look at what our options have done. And then we'll leave the example here. So the 290s, these are now long 41 delta's. And the 410s are like out of the equation. The 410s are now at a 0.022. And gamma 0.001. And 0.011. Okay. So where do we sit now? So what ended up happening is as the stock dropped massively, we have now a completely new position that's",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 41,
      "start_timestamp": "00:55:52",
      "start_timestamp_seconds": 3352.234146341463,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=3352"
    }
  },
  {
    "text": "long 41 delta's. And the 410s are like out of the equation. The 410s are now at a 0.022. And gamma 0.001. And 0.011. Okay. So where do we sit now? So what ended up happening is as the stock dropped massively, we have now a completely new position that's required to flatten out the delta's again. So as the short calls unwound that increases our net delta positive exposure. And then as the puts gain more and more delta's, this increases net positive delta exposure again. So we have a pretty significant residual position. That will need to add another 182 shares. So now we are at long 364 and so on. So now the cool part about this is part of this process. Often will allow you to buy cheap sell higher and then sell higher and buy to cover more cheaply. Because looking at this overall process in this context, this is more so about understanding what the background activity is for somebody that's looking to maintain a delta neutral book or a delta neutral trade. And a lot of times this is what dealers are going to do. Now the other side to this equation though is that if your delta position starts changing massively, then your overall equity position has to adapt. So I realized I these needed to change my bad. This is incorrect. So in this case, we needed to buy 182. So this is short so then we needed to buy here.",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 41,
      "start_timestamp": "00:57:30",
      "start_timestamp_seconds": 3450.829268292683,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=3450"
    }
  },
  {
    "text": "is that if your delta position starts changing massively, then your overall equity position has to adapt. So I realized I these needed to change my bad. This is incorrect. So in this case, we needed to buy 182. So this is short so then we needed to buy here. Hold on. I'm fucked up in my own sheet. 29 May. 104. Is this have. AC. AD. Yeah, okay. So that's the. So this is where 104 has to go on. So then now we are flipping right because we're coming into this and now we're long 390. Delta's so we have to sell. So to figure out how many we have to sell. We need to lose. 208. We need to flatten out this entire delta position. So what that means is. If we get rid of. Our total delta is 390. We're long 182. And this is where you have an opportunity to actually unwind some of this at a profit and I'll show you how that works. Depending on. Where you bought at in this case, you're getting taken to the cleaners, but sometimes you can actually be taken out at a profit. This plus this 572. So now what ends up happening is you have to sell. Essentially. 390. Hold on a sec. You're long 182. Gotta get rid of all of those. And then does this take that into account. This doesn't. That's the problem. One sec. We need this calculation. I thought I locked",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 41,
      "start_timestamp": "00:59:09",
      "start_timestamp_seconds": 3549.4243902439025,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=3549"
    }
  },
  {
    "text": "So now what ends up happening is you have to sell. Essentially. 390. Hold on a sec. You're long 182. Gotta get rid of all of those. And then does this take that into account. This doesn't. That's the problem. One sec. We need this calculation. I thought I locked this. That's why we get twisted up. That one's good. This one is not good. But this is from before. So it doesn't really matter. Okay. So here. You have to unwind a bunch of shares. Because we have to get rid of these net positive deltas. Which you now have 390. And you already have. So you have to get rid of those. So essentially, you now have to unwind your share position. You have to sell all of these. And here's the part that sucks about this. Because you're going to sell them at 2.95. So what happens here? Here's what happens. This is what you get to lose. This is your PL. So this is the shitty part about trying to delta hedge when your short options. When you delta hedge and your long options, which we would call gamma hedging, there's actually a slight benefit. You essentially flip this. You make the money on the stock movements. But when you're short, you get smashed. You're just eating this because again, now your position just got way too long based on this move. And you have to unwind effectively the entire thing. And then you have to",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 41,
      "start_timestamp": "01:00:48",
      "start_timestamp_seconds": 3648.019512195122,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=3648"
    }
  },
  {
    "text": "essentially flip this. You make the money on the stock movements. But when you're short, you get smashed. You're just eating this because again, now your position just got way too long based on this move. And you have to unwind effectively the entire thing. And then you have to sell short 390 shares to flatten back out. So when we think about gamma exposure and delta hedging, this is the game that's being played in different ways by different parties. Depending on what their overall intent is. But you can see how this creates an artificial just price behavior as people are going into the market to just get or lose shares in order to have this reflect what they want their total total delta exposure to be. Kirk says, why did you buy so many shares when the sold put delta outweigh the sold calls? Where are we at? Are you talking about this one or was this just old? Kirk says, how can you lose that much when 200 shares. Would be 68 K and it's only down 15 to 20. Let me check the math. That looks right. That looks right. What did I mess something up here? The transactions as I'm calculating it here for the net PNLs. I'm taking whatever the opening basis was. So in this case, we bought five shares at 338. But then we're selling those five shares for 295. So if you bought five shares. Is this multiplying by 100",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 41,
      "start_timestamp": "01:02:26",
      "start_timestamp_seconds": 3746.614634146342,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=3746"
    }
  },
  {
    "text": "up here? The transactions as I'm calculating it here for the net PNLs. I'm taking whatever the opening basis was. So in this case, we bought five shares at 338. But then we're selling those five shares for 295. So if you bought five shares. Is this multiplying by 100 knots doing it by five? I think we need parentheses. There's our problem. Good catch. As soon as you said it, I was like, this looks weird. That's good. So this one needs to be locked. Yeah, Kirk, great catch. There you go. 11 grand. Nice job. But the broader point remains about the same. So what we're doing is in order to delta hedge, we're buying, except when you're on the short side of the options, you're essentially buying high and then selling lower when it eventually reverses, which is the inverse. So we're buying lower long options. And that's why gamma hedging is or gamma scalping. Sometimes it's called is way more common for long options. And the whole point of that is it helps subsidize the cost of holding these. Because theta decay for the long options can be a pain in the ass. But when you're gamma hedging via long options, you're offsetting some of that. Whereas in this context, this is more just trying to be delta neutral. The problem, as you could tell, is a slightly different scenario. Awesome. Another really fun session. Any questions on anything that we went over here? All good.",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 41,
      "start_timestamp": "01:04:05",
      "start_timestamp_seconds": 3845.209756097561,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=3845"
    }
  },
  {
    "text": "gamma hedging via long options, you're offsetting some of that. Whereas in this context, this is more just trying to be delta neutral. The problem, as you could tell, is a slightly different scenario. Awesome. Another really fun session. Any questions on anything that we went over here? All good. So this becomes just a peak into what goes into the process of gamma exposure from a dealer perspective, then delta hedging from really any entity that wants to maintain some sort of specific delta profile. So there you have it. If you guys need anything, let me know, be an outlier. See you all later.",
    "metadata": {
      "video_id": "FrqSC7Fbf14",
      "title": "Stock Market Update - GEX & Delta Hedging | Options Trading Live",
      "url": "https://www.youtube.com/watch?v=FrqSC7Fbf14",
      "upload_date": "",
      "duration": 5668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 41,
      "start_timestamp": "01:05:43",
      "start_timestamp_seconds": 3943.8048780487807,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FrqSC7Fbf14&t=3943"
    }
  }
]