[
  {
    "text": "What's up everybody, Eric here, and I am back with David Hunter. I was just chat with him real quick before we started. This is the fourth time he and I are meeting and it's actually really useful at least for my perspective because I get to understand his thought process then as we get new data, how that impacts his thought process because really you're teaching us different ways to think about markets and the economy. And I think that that's just tremendously valuable. So first off, welcome back, great to have you. Yeah, thanks Eric. Glad to be back. Yeah, and since the last time we spoke, there has been no shortage of drama in the economy and the market. So I'm really eager to get into, you know, how you think things are rolling out and what you're looking at. So I figure we could start a little bit about the broader markets. Last time we spoke again, it was about three months ago. We were talking about this idea of recession and I had asked you if you thought we were in a recession at that point, you said you thought so if not right on the precipice of entering one. And I'm curious how have your thoughts evolved around that concept? What are your thoughts on our position in relation to a recession? Yeah, for sure. Since I think we spoke in June. So, so after after that last conversation, we obviously got second quarter",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 53,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=0"
    }
  },
  {
    "text": "the precipice of entering one. And I'm curious how have your thoughts evolved around that concept? What are your thoughts on our position in relation to a recession? Yeah, for sure. Since I think we spoke in June. So, so after after that last conversation, we obviously got second quarter G P in, you know, later in July. And it confirmed that we had two quarters of negative GDP, which by, you know, traditional definition, that's a recession. You know, there's lots of ways to kind of look at what is, you know, whether it's a recession or not. But I think for sure, the economy's weak. I think technically we're in a recession. I think more than technically, you know, the economy was showing negative GDP. Third quarter, we bounced a bit, not a lot, but you know, a little bit. So, you know, you can argue that we may have stopped the negative. But I think we're heading for much deeper weakness. And so, you know, you're going to in recession, you're going to go in and out of GDP, positive GDP, negative GDP, until you really get into the depth of the recession. So, you know, my view, which has not changed is that we're on our way to a global bust. I define a global bust and actually a global deflationary bust. I define that as something bigger than a recession, but not as long as a depression. It might have some of the characteristics of",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 53,
      "start_timestamp": "00:01:02",
      "start_timestamp_seconds": 62.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=62"
    }
  },
  {
    "text": "view, which has not changed is that we're on our way to a global bust. I define a global bust and actually a global deflationary bust. I define that as something bigger than a recession, but not as long as a depression. It might have some of the characteristics of a depression, but happened in kind of a concentrate period time, like a year. So, I think, you know, 2008-09 was almost a bust, but they saved it before really got into that. So, I think this time we see something worse than 2008-09, which would make it the worse since the Great Depression. And I think it'll be accompanied by a financial crisis, the likes of which we have not seen. So, bigger than 2008-09. And that means, you know, bank failure is a lot of involuntary debt liquidation. You know, lots of unpleasant things. I think that's likely second half of 2023. You know, you never know exactly when, because we're recession into a global bust. Isn't two different things. It's just it takes a while for you to move into the real depths of it and where you get to the point where the financial crisis gets big enough where it causes a bust. So, like I said, we haven't seen one in post-war or two-era. We came close in 2008-09. I think this is going to surprise people in terms of the magnitude. But before we get there, you know, you're going to be kind of",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 53,
      "start_timestamp": "00:02:18",
      "start_timestamp_seconds": 138.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=138"
    }
  },
  {
    "text": "big enough where it causes a bust. So, like I said, we haven't seen one in post-war or two-era. We came close in 2008-09. I think this is going to surprise people in terms of the magnitude. But before we get there, you know, you're going to be kind of going through this period of up and down. Are we in a recession? Are we getting up a soft landing? Are we going to have a hard landing? Ultimately, I think we're going to have a hard landing. Well, that actually leads beautifully into my next question, which is last time we talked about exactly that, the concepts of soft landing, hard landing, and the way that markets have been moving in relation to which one of those is more likely. Last time, you also felt that we were more likely leaning towards a hard landing. It sounds like that's about the same. Has there been any additional data input that has reinforced that hypothesis or is it essentially just ceterus parabus? Nothing has really changed. Same thing. Probably the thing that has just increased the probabilities of a hard landing and increased probabilities of a global bust is the feds in transit and transigence in terms of rate hikes and feeling like they have to go a lot farther. As I keep saying on Twitter, I believe the current fed is making perhaps the largest policy error in history, certainly in the history of the fed. What that means",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 53,
      "start_timestamp": "00:03:40",
      "start_timestamp_seconds": 220.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=220"
    }
  },
  {
    "text": "feds in transit and transigence in terms of rate hikes and feeling like they have to go a lot farther. As I keep saying on Twitter, I believe the current fed is making perhaps the largest policy error in history, certainly in the history of the fed. What that means is I think they are overtightening. We've seen rate increases at a speed that is beyond, there's no precedent for the speed with which rates have gone up. The fed doesn't think their work is done. They keep talking about another 75, but maybe another 75 in November, December, and then maybe pause there or maybe do some more hikes in 2023. That's got the market very spooked and for good reason. Again, they haven't really even, they've just begun quantitative tightening, meaning pulling money out of the system, but these rate hikes are unprecedented and I think are having a dramatic impact. Just look at mortgage rates. Mortgage rates went from 2.5 to 7.5, almost 7.5 here in a matter of, you know, within this year. And, you know, in past times, this is what really surprised me. In past times, you know, I've been through many cycles and I've watched the fed through many cycles. Oftentimes, they overshoot, but what typically happens is they start hearing from, you know, the Realtors and, you know, the banks, industrial companies, and again, you know, they all have their spokesmen that speak for the whole industry. And they get to the",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 53,
      "start_timestamp": "00:04:43",
      "start_timestamp_seconds": 283.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=283"
    }
  },
  {
    "text": "I've watched the fed through many cycles. Oftentimes, they overshoot, but what typically happens is they start hearing from, you know, the Realtors and, you know, the banks, industrial companies, and again, you know, they all have their spokesmen that speak for the whole industry. And they get to the Fed and say, you know, we're worth maximum pain now. You've got to back off. The Fed seems, I'm sure they're hearing from some of those folks, but the Fed has shown an inability. It's almost like they've got their ears closed and blinders on and they're saying, we don't care what pain is going to happen short term because we think that's so necessary to get inflation down. And they are, I think this is a Fed that's way over their head. I don't think it's the most qualified Federal Reserve or FOMC we have ever had. In fact, I think it's, it's being led by a lawyer who has brought into a, I think, a very false narrative or a bad narrative in terms of thinking that he's got to drive the stock market much lower to impact financial conditions to the degree necessary to get inflation down. I think that's a very false narrative. It was started by Bill Dudley who was the former president of New York Fed, former senior councilman, Goldman Sachs. It's probably the dumbest thing or, or most dangerous thing that's come out in a long time. And yet he convinced Powell that",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 53,
      "start_timestamp": "00:06:17",
      "start_timestamp_seconds": 377.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=377"
    }
  },
  {
    "text": "I think that's a very false narrative. It was started by Bill Dudley who was the former president of New York Fed, former senior councilman, Goldman Sachs. It's probably the dumbest thing or, or most dangerous thing that's come out in a long time. And yet he convinced Powell that that's, that's important that that should be their primary focus. And, and Powell has very clearly indicated that that's his intention. And that's what we've seen for several weeks to a little the last few months, you know, particularly the last few weeks. He's trotted out all his FOMC members speaking from the same him, no constantly saying the same thing. And one trying to up the other one in terms of sounding more hawkish, trying to scare the market down. That's his whole intent. And, you know, we, we saw last Thursday, a week ago, Thursday, the market opened and went straight to 3,500. And it broke some important, some levels of people thought were important technically. And just, you know, cascaded down to 3,500 in the first hour of the opens. And, and then reversed. That, that was driven by comments, you know, more hawkish comments. And ever since he's continued that, they, I think they believe minimum we've got to get the market down near 3,000. And I think Dudley really believes it has to go a lot lower than that. So maybe Powell does who knows. I think they're going to be have their head handed",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 53,
      "start_timestamp": "00:07:47",
      "start_timestamp_seconds": 467.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=467"
    }
  },
  {
    "text": "since he's continued that, they, I think they believe minimum we've got to get the market down near 3,000. And I think Dudley really believes it has to go a lot lower than that. So maybe Powell does who knows. I think they're going to be have their head handed to them. I think they're going to be surprised that they don't control the market. But for a while, the rhetoric did scare the market. And that was what really pushed the market down and kept it down. And every time it lifted a tad, it'd go back because they'd send out some more speakers. It's just a very amateurish way to run policy in my opinion. And it's also very wrong headed narrative that he's wanted to. But the good news is, you know, the market's going to overpower the Fed. The Fed thinks they're in charge. They're going to be surprised that the markets will move against their efforts. And today, you see the market up, you know, the SPS up almost 80 points, over 2. And, and that was the result of one or two Fed officials coming out and softening their commentary. So they weren't quite as aggressive in stating that, you know, we have to do another 75 and we have to do another 75 Mary Daly, who's head of the San Francisco Fed and has been talking like all of them very hawkishly. Just indicated that maybe we need, you know, we need to",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 53,
      "start_timestamp": "00:09:07",
      "start_timestamp_seconds": 547.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=547"
    }
  },
  {
    "text": "as aggressive in stating that, you know, we have to do another 75 and we have to do another 75 Mary Daly, who's head of the San Francisco Fed and has been talking like all of them very hawkishly. Just indicated that maybe we need, you know, we need to consider that we're doing, you know, we're causing harm overseas. There's the risk rising all around the world. Maybe we need to think about softening our approach here a bit. Maybe we need to, if not pause, at least hike less aggressively for a little while here and see what, you know, what comes because that's that's the other thing that I think is amateur hour about Fed is that they don't understand reads and lags. They give lip service to it, but the reads and lags are quite, you know, quite lengthy. So they're, they're looking at current when the CPI comes out, it's the last month's CPI. So they're looking backwards and determining forward policy based on numbers. It's already a month old and and with with a numbered that is with a inflation that is typically, you know, a year lagged at least. So, you know, in other words, they can, if they're going to conduct policy based on old news, they're guaranteed to go way too far and they're tightening. And my belief is they've already done that. As I say, the seeds for a global bust are already sown. In other words, the tightening they've",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 53,
      "start_timestamp": "00:10:20",
      "start_timestamp_seconds": 620.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=620"
    }
  },
  {
    "text": "other words, they can, if they're going to conduct policy based on old news, they're guaranteed to go way too far and they're tightening. And my belief is they've already done that. As I say, the seeds for a global bust are already sown. In other words, the tightening they've done already is way past where you've already created a hard landing and that hard landing is going to become something even worse than hard landing in a global bust. And again, it's global. What also surprised me is that the Fed is not hearing from central banks around the world saying, he's up guys, you know, you're causing us a lot of pain. You know, we can't handle it. We don't have some resiliency you have. You saw it in the UK when the guilt market went crazy and there was, you know, the pension funds over there were at risk. You've seen it, you know, in other countries, in other areas around the world, you know, Japan's going through some of its self-inflicted, but they're going through some real problems that I think are down the road cause real problems for them. But, but, you know, it's surprising because in the past, you'd see by now you would see the central banks get together and do a coordinated, you know, easing or in this case, the dollar is very, very strong against all those currencies. And normally, you'd see a coordinated, you know, effort to get the dollar",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 53,
      "start_timestamp": "00:11:39",
      "start_timestamp_seconds": 699.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=699"
    }
  },
  {
    "text": "because in the past, you'd see by now you would see the central banks get together and do a coordinated, you know, easing or in this case, the dollar is very, very strong against all those currencies. And normally, you'd see a coordinated, you know, effort to get the dollar down because it's putting a lot of strain on countries around the world and on other currencies. So the fact that we're not seeing that is troublesome because it indicates either the Fed is, you know, basically deaf to all the conversations they're hearing or that we have central banks around the world that are all over their head and not really doing what we've would have seen in the past cycles. And that is my concern. I think we clearly have a situation where inflation hasn't been around for 40 years. So you've got a lot of people in these positions that never lived through the early 80s I did. And, you know, they all think we got to do what Volker did. Well, there's, you know, number one, that's a very different situation. Number two, the pandemic happened. And so a lot of what's happened here is related to the pandemic in terms of inflation. Ukraine happened. The invasion of Russia's invasion of Ukraine happened. That also is something that's different than the early 80s. So you've got a lot of things here that you got to sort through and realize this isn't just simple, you know, well,",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 53,
      "start_timestamp": "00:12:52",
      "start_timestamp_seconds": 772.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=772"
    }
  },
  {
    "text": "to the pandemic in terms of inflation. Ukraine happened. The invasion of Russia's invasion of Ukraine happened. That also is something that's different than the early 80s. So you've got a lot of things here that you got to sort through and realize this isn't just simple, you know, well, this first time we've had double digit inflation or close to double digit inflation since the early 80s. We got a follow of Volker's playbook. He was a hero. I'm going to be a hero. I mean, I don't know what's going through Paul's mind, but he has invoked the Volker. He had many times and said, you know, he's trying to basically emulate that. So it's very concerning right now that we have a Federal Reserve that may think they have a handle on things, but really don't. So in the end, I think they're closer to the end that they're tightening whether they realize they're not because I think the markets will ultimately force their hand and the economy moving towards a place where they're going to finally wake up. But, you know, who knows when exactly they're, you know, and the street in typical street fashion, they get caught in narratives. So they think you've got to have a Fed pivot, meaning Fed lowering rates again before the market can move. And I've been pretty clear that I don't think that's what's coming is that the market will move before the Fed, both the bond and stock",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 53,
      "start_timestamp": "00:14:04",
      "start_timestamp_seconds": 844.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=844"
    }
  },
  {
    "text": "get caught in narratives. So they think you've got to have a Fed pivot, meaning Fed lowering rates again before the market can move. And I've been pretty clear that I don't think that's what's coming is that the market will move before the Fed, both the bond and stock markets, I believe, will start rallying before the Fed Pivots. Today's a good example. All you need is a little change in the rhetoric and the market will, you know, have a more hopeful movement. And then, you know, it couldn't. It's not going to be a straight line. All you need is them to come out next week and reiterate their hawkishness. You know, have a couple of speakers come out and reiterate hawkishness. And it can take a step back again. But ultimately, I think we've seen the lows in the stock market last week. And I think we're beginning what I call the final leg of before the year, a secular bull market. One of the things you mentioned that I'm really curious about from a personal perspective is the Fed's receptiveness to kind of foreign partners expressing concern over the way we're approaching rates and inflation. One of which comes to mind is the UN, they, I saw an article, I don't know all the details behind it, but essentially, they were asking the US to chill out with the interest rate raises. That made me really curious because I anticipated that the Fed is wise",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 53,
      "start_timestamp": "00:15:27",
      "start_timestamp_seconds": 927.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=927"
    }
  },
  {
    "text": "One of which comes to mind is the UN, they, I saw an article, I don't know all the details behind it, but essentially, they were asking the US to chill out with the interest rate raises. That made me really curious because I anticipated that the Fed is wise enough to understand the impacts of what they're doing on the global market and other economies. And I thought it was interesting that the UN chose to essentially ask them to stop. I don't understand why they went about it that way. Is it literally like a last ditch, Hail Mary? I assume they must have already talked before, you know, they come out with an official statement asking the US Fed to stop raising rates. Do you think that the UN is just back into such a corner now that that's where they thought was the last chance for them to get any reprieve from the rate movements? Frankly, the last person I want to take advice from on how to conduct monetary policy is the United Nations. So, you know, they're, I'm sure some of their constituents are concerned about what's happening in the world economy. So I think it comes from there and they're seeing some of the strains, I'm sure. But it's really the other central banks and other central bankers that, and I have no doubt the central banks are talking. I'm not saying that Paul is shutting shutting down communication at all. I'm sure",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 53,
      "start_timestamp": "00:16:44",
      "start_timestamp_seconds": 1004.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1004"
    }
  },
  {
    "text": "think it comes from there and they're seeing some of the strains, I'm sure. But it's really the other central banks and other central bankers that, and I have no doubt the central banks are talking. I'm not saying that Paul is shutting shutting down communication at all. I'm sure he's hearing from others. Like I said, I'm not sure what others are saying. You know, they don't speak in one voice either. So he may have heard from some that are concerned. But the ECB, I think, is probably a bit wrong-headed just like he is. The Bank of England, I think, is they all are focused on inflation. And I think at the, you know, without understanding that with the leads of my eyes, the real risk now is deflation. You know, I think, as I said, next year is a global deflationary bust in my opinion. And they're all worried that inflation is running away. So they're kind of caught in what I think is yesterday's problem. And because of leads and lags, they're staying the party way too long on the tight side. So it's not that he's not hearing that he's refusing to hear. I just think they are in a mantra right now. They're locked in a narrative or believe that the most important thing right now is to defeat inflation. And their idea of defeating inflation is we need to see the signs in the CPI. In the past CPI wasn't even something",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 53,
      "start_timestamp": "00:17:51",
      "start_timestamp_seconds": 1071.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1071"
    }
  },
  {
    "text": "just think they are in a mantra right now. They're locked in a narrative or believe that the most important thing right now is to defeat inflation. And their idea of defeating inflation is we need to see the signs in the CPI. In the past CPI wasn't even something the Fed paid a lot of attention to because, you know, it's a flawed index. But for whatever reason, it's the headline index. And certainly since June, Powell has made that front and center. So the market makes that front and center. Every time there's a CPI release, a monthly CPI release, that's watched as closely as the jobs number, the monthly jobs number. And like I said, in the past, the Fed looked at the consumption deflator. And that was their primary one. That tends to, you know, not be as the big swing. So there's just a lot of reasons why I argue that this FOMC led by this guy. And I've been, you know, critical of him in the past, but also complimentary of times. But I personally think J. Powell's way over his head. So thinking about the Fed handling all of this, one of the things you were talking about is the market potentially forcing their hand to kind of pause their campaign on raises. I'm curious, what do those market circumstances look like that would cause the Fed or Powell to then take a step back and say, okay, we need to stop raising",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 53,
      "start_timestamp": "00:19:10",
      "start_timestamp_seconds": 1150.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1150"
    }
  },
  {
    "text": "things you were talking about is the market potentially forcing their hand to kind of pause their campaign on raises. I'm curious, what do those market circumstances look like that would cause the Fed or Powell to then take a step back and say, okay, we need to stop raising rates here or, you know, whatever other pivot they think makes sense. It's going to be the economy and inflation. Probably could either be either one that, you know, what we're setting up for. And I don't have a prediction of one that's going to happen. Like I said, it starts with something like today where some FOMC members, maybe they've heard from people or maybe they're just using their own their own heads, but they're beginning to question, how far do we go before we pause? Because that's the other thing. And this is another sign, not to jump around, but this is another sign of, I think, calls I don't want to say an experience because you've been on the Fed for a number of years, you know, in this role and prior to that, but he's an attorney and he's, you know, he's a financial guy. He's not an economist and the problem is that I think he's seeing this as linear. So in other words, we've got to do all our tightening now, you know, again, in previous times, not that other Fed chairman haven't made plenty of mistakes, but oftentimes you tighten and then, you",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 53,
      "start_timestamp": "00:20:33",
      "start_timestamp_seconds": 1233.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1233"
    }
  },
  {
    "text": "not an economist and the problem is that I think he's seeing this as linear. So in other words, we've got to do all our tightening now, you know, again, in previous times, not that other Fed chairman haven't made plenty of mistakes, but oftentimes you tighten and then, you know, going back, let's go back to the to the early 80s. You know, we had a double dip recession. You know, in 1980, you went in, you came out of it, then 81, you went back into it in 82. And it was because they didn't do everything in a straight line. They they paused to see what, because it leads in legs. You don't know what damage you've done for many, many months. And if you just kind of decide, we're going to go here because that's, you know, we're going to go until we see the, the inflation come down, you know, you've gone too far. So, you know, what you're going to see, I think, at some point in the next, I'd say next few months is a pause where they're going to at least finally wake up to the fact that, hey, we don't know how much damage we've done. There's plenty of signs that we've done a lot of damage in housing. There's plenty of signs that the consumers start to have problems. And industrial is obviously having problems. commodity prices have come down. Maybe we need to pause and see what the effect",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 53,
      "start_timestamp": "00:21:42",
      "start_timestamp_seconds": 1302.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1302"
    }
  },
  {
    "text": "how much damage we've done. There's plenty of signs that we've done a lot of damage in housing. There's plenty of signs that the consumers start to have problems. And industrial is obviously having problems. commodity prices have come down. Maybe we need to pause and see what the effect of all these hikes that we've done since April, you know, April and June and July and and September. And soon to be November, you know, all those hikes, maybe we need to pause because we've, you know, we've taken rates from almost zero up to over 4. And, you know, maybe we need to, maybe we need to step back. And I think today was kind of the beginning of that unfreeze. And I think as we move forward in the next couple of months, you'll see more of that because I think the economy is going to be so often in certainly housing. It's going to be showing some a lot of pain. Autos probably. Anything interest sensitive is getting hit now. And so, and the other thing that kind of along with inflation, he's, he's saying, okay, we also have, we have a double mandate. It's employment, basically, and inflation. Inflation is too high. We're going to work to get that down. And we're going to stay tight because of that. And we're not worried about being too tight because employment is pretty strong. Well, employment's another laggard. You know, you're, you're not going to know, you're",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 53,
      "start_timestamp": "00:22:56",
      "start_timestamp_seconds": 1376.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1376"
    }
  },
  {
    "text": "basically, and inflation. Inflation is too high. We're going to work to get that down. And we're going to stay tight because of that. And we're not worried about being too tight because employment is pretty strong. Well, employment's another laggard. You know, you're, you're not going to know, you're not going to see the employment tip until way too late. So he's using, you know, again, he's not showing that he really understands leads and lags. And I keep repeating that not here, not just here, but, you know, in all my commentaries. And that's really the issue is there's big, there's long leads and lags to policy. And, and if you don't understand that, you almost guarantee that you're going to overstate on the tight side and create a crack. What's the risk if they do take that pause? Like, what would stop them from taking that pause and seeing how things go? Is it simply the appearance that they don't have it under control? Still, I don't understand the, the downside if they go through cycles of raising and they apply that methodology where they say, okay, we've raised, you know, 75 basis points, three quarters in a row or whatever, or, you know, three meetings in a row. Let's take a pause for the cycle and see what happens. Why don't you do that? Yeah, it's, I think there are a couple of reasons. One, they, they got criticized roundly for being late to fight inflation.",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 53,
      "start_timestamp": "00:24:16",
      "start_timestamp_seconds": 1456.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1456"
    }
  },
  {
    "text": "a row or whatever, or, you know, three meetings in a row. Let's take a pause for the cycle and see what happens. Why don't you do that? Yeah, it's, I think there are a couple of reasons. One, they, they got criticized roundly for being late to fight inflation. You know, they, they viewed it and I don't even hold him, you know, people take him to task for that last year that he called it transitory because he was right. So I'm a bit, some inflation was certainly transitory and I think he was right about that. But this year's inflation took everybody by surprise, certainly him. And so I think he's taken very personally, and I think the whole FLMC that they've been roundly criticized for being late to understand what they needed to do. And I think they're trying to make up for that by being overly tight now. And they keep, they've even said it themselves, they're worried about their credibility. They're trying to protect their credibility by staying tight. So say, see, we, we really, you know, yes, we were late, we admit, we were late, and we should have tightened sooner. But now you're seeing, we're real inflation fighters. And I think they're overdoing their concern about their credibility. I mean, the focus is to the right thing for the, you know, for the economy and, you know, set the right policy. And I think they think they are, but you know, anytime",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 53,
      "start_timestamp": "00:25:30",
      "start_timestamp_seconds": 1530.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1530"
    }
  },
  {
    "text": "you're seeing, we're real inflation fighters. And I think they're overdoing their concern about their credibility. I mean, the focus is to the right thing for the, you know, for the economy and, you know, set the right policy. And I think they think they are, but you know, anytime you allow your personal credibility to be part of the argument, I think he ran a risk of an error. That's number one, and I'll go back to Dudley. Dudley's, Dudley's thesis about the market having to go a lot lower to, to, to feed inflation is front and center with the Fed and certainly with Powell. And I think that's more than anything else right now, the reason why he's afraid to pause. If he pauses, he knows the market, just like today, I'm sure he doesn't like today. But he wants to market down in today, the market's up to percent and looks like it's running. He doesn't want that at all because he's bought into Dudley's thesis. And so I think every time we rally, it's pushing off his willingness to pause, not that he was thinking about it anyway. I think he's, the positive thing about Powell is I think he's been very transparent and very sincere about what he's trying to do. I don't think at all that he's playing a game where you get that a lot. There's people who are distrustful of the Fed, so they always think they're kind of doing this",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 53,
      "start_timestamp": "00:26:38",
      "start_timestamp_seconds": 1598.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1598"
    }
  },
  {
    "text": "Powell is I think he's been very transparent and very sincere about what he's trying to do. I don't think at all that he's playing a game where you get that a lot. There's people who are distrustful of the Fed, so they always think they're kind of doing this on purpose or trying to hurt the economy for new world order reasons or that he's lying to us. He's doing one, he's saying it, but he's not really meaning it or whatever. No, I think he's very transparent, very sincere. I think he's a, he's a decent man trying to do his job. I just think he's very wrong headed and over his head and making a big error. One of the things we talked about last time and you touched on it earlier was the housing market and the hypothesis was that we would see some contraction in the housing market, which we certainly have started to see that I'm a little surprised at the relationship, though, between what we're seeing happening with rates and subsequent housing prices. It doesn't seem like housing prices have contracted quite as much, at least as I would have anticipated with rates going where they are as fast as they are, but obviously I haven't been around as long as you have. So I'm curious what you think about that relationship and where you see the housing market moving over the next six to 12 months. Yeah, I think the next six",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 53,
      "start_timestamp": "00:27:52",
      "start_timestamp_seconds": 1672.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1672"
    }
  },
  {
    "text": "going where they are as fast as they are, but obviously I haven't been around as long as you have. So I'm curious what you think about that relationship and where you see the housing market moving over the next six to 12 months. Yeah, I think the next six to 12 months is going to be pretty awful in housing. I think what you get is and certainly saw it in July, you had us spike in rates in early June when we got the CPI out the Fed did their first 75 base point hike. And then and then through the balance of June and through July rates came down and what you get is all those people that felt they missed their chance to buy a house because rates went up when they came down they they're kind of that pent up demand that jumps back in say oh we got our last shot let's get in. So that postpones the real hit housing and they've had some of that over the last you know certainly the summer months. I think now with more of these rates at 7 7 plus it shut down housing quickly and I think the next six months and certainly the next 12 months you can easily see a 20 25 maybe even the 30 backup in housing you know housing prices you know break down housing prices and you're definitely seeing them in the activity a lot the real result you",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 53,
      "start_timestamp": "00:29:11",
      "start_timestamp_seconds": 1751.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1751"
    }
  },
  {
    "text": "I think the next six months and certainly the next 12 months you can easily see a 20 25 maybe even the 30 backup in housing you know housing prices you know break down housing prices and you're definitely seeing them in the activity a lot the real result you know the activity is really slowed down the interest has really slowed down it's a that's part of why the bus is you know probably second half of next year is because it just takes time for all this stuff to work through the system for those reasons and you got the people who will if they get you know if let's say the mortgage rate went from 3 to 4.5 or 5 when it came back down to 4 I don't remember what the numbers were people aren't saying well I want I got to get back down to 3 now they say okay at least we got a break and rates let's jump on now so they think they're they're you know they're getting their last chance and and that works through you know at various levels but I think once you get up to here you know if you've seen any of the numbers on what a 7 mortgage does versus 2.5 or 3 mortgage to the what you can afford it's it's tremendously much you know you can't pay nearly you can't buy nearly the same house because your mortgage payment is doubled so I mean",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 53,
      "start_timestamp": "00:30:21",
      "start_timestamp_seconds": 1821.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1821"
    }
  },
  {
    "text": "if you've seen any of the numbers on what a 7 mortgage does versus 2.5 or 3 mortgage to the what you can afford it's it's tremendously much you know you can't pay nearly you can't buy nearly the same house because your mortgage payment is doubled so I mean that obviously there are people that it doesn't you know money is no object but for the majority people buying that's how they're buying is what can we afford and you know they move from 2.5 to 7 changes affordability in a huge way so there's zero question in my mind the house ain't going to get hit as hard as you know the hardest it's been hit in you know since 2008 and could be harder than that even you know 2008 you had the subprime situation this time it's a different dynamic but I think it's a you know this rapid rise and rates is a big one yeah I think that makes sense and it's a really good explanation thank you for sharing that because I was genuinely just curious from my side because I was a little surprised at how they seemed to decouple a little bit um moving forward now we've talked a little bit about your general hypothesis that we see a pretty robust market run up or a melt up it as you refer to it before we start you know this later capitulation um I'm curious you've shared a little bit of",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 53,
      "start_timestamp": "00:31:27",
      "start_timestamp_seconds": 1887.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1887"
    }
  },
  {
    "text": "bit um moving forward now we've talked a little bit about your general hypothesis that we see a pretty robust market run up or a melt up it as you refer to it before we start you know this later capitulation um I'm curious you've shared a little bit of background on what that looks like and what the catalyst could be but could you dive a little further into detail in terms of you know you've shared that you felt maybe last week is where we might have posted lows so what really drives the next stage of this melt up in your eyes. Sure um yeah let's talk about last week last week I thought going into uh you know the end of last week last Thursday it looked like we were going to retest June low basically June lows were I think 3640 or thereabouts we went down through with 3600 in the month of October and you know last week and and it looked like it was gonna probably stop you know 3580ish I think was about where it was and it looked so that and people said oh it's broken that that June low so you were talking about a retest that can't be a retest or a successful retest I said no that's the way a lot of retests go is they'll they'll break by a little bit and then uh reverse you know the the market loves to get you guessing and so",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 53,
      "start_timestamp": "00:32:42",
      "start_timestamp_seconds": 1962.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=1962"
    }
  },
  {
    "text": "you were talking about a retest that can't be a retest or a successful retest I said no that's the way a lot of retests go is they'll they'll break by a little bit and then uh reverse you know the the market loves to get you guessing and so when it when it went through 3600 I was hearing that and then Thursday morning when it went down the 3490 to you know went down 3500 that was a you know a bigger break and I had people say well now you're you're a retest of the June lows that thesis out the window and it really is it or was you know it was just a slightly bigger break to scare a lot of the weekends out to convince people we're going a lot lower and then within an hour of the opening it began building up the other way and you know we're we're a couple hundred points or more above that now um and so um I think that was a successful retest of the June low is basically a double bottom um as as crazy as that might sound since it you know it's 140 150 points lower than the June bottom but that's that's within the way you know past bottoms how they retest um and so I think we're probably you know I could be wrong it could go back through there and go to 3400 or somewhere around there uh I I",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 53,
      "start_timestamp": "00:33:55",
      "start_timestamp_seconds": 2035.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2035"
    }
  },
  {
    "text": "150 points lower than the June bottom but that's that's within the way you know past bottoms how they retest um and so I think we're probably you know I could be wrong it could go back through there and go to 3400 or somewhere around there uh I I think there's a very good chance that that was our retest that we had at the middle bottom and that we're beginning the next leg up um and I I do want to explain because people always say well is the meltup started and I go um yeah I just wanted people to understand the term meltup the real meltup part of the next leg up is probably going to kick in after the new high so 4800 SP you get above that decisively let's say to 495 5000 that's what will convince people that hey this is real this isn't just uh fair market rally you know and you're gonna have people coming in that's when you can get the vertical run a meltup means basically the parabolic part of a rally so so the meltup doesn't start at 3500 or you know it's not a meltup now it's a it's a new in my opinion it's a new leg of a new bull leg of a secular bear uh bull market so so this you know just like March 2020 to December 2021 was a full leg this one will be you know from 3500 up to 6000",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 53,
      "start_timestamp": "00:35:05",
      "start_timestamp_seconds": 2105.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2105"
    }
  },
  {
    "text": "a it's a new in my opinion it's a new leg of a new bull leg of a secular bear uh bull market so so this you know just like March 2020 to December 2021 was a full leg this one will be you know from 3500 up to 6000 plus in my opinion and I think this one that one took 21 months you know the 2020 rally this one probably takes half that or less so you know I'm guessing it could take six months or less but um it's basically the meltup is the latter stage of it it's when you finally run what I call the blowoff or meltup stage going into a top but it is the rally at least to the meltup it is the final leg in my opinion and I think it's begun that doesn't mean it goes straight up you could rally you know for a little while and then have a you know a week or two of pullback um well you could you could go straight up so it's hard to know exactly how you know how the path will proceed but what I think is pretty clear is that we've seen the lows or at least I believe we've seen the lows and that we could we could run here pretty fast of 4,64650 and maybe maybe pause there pullback correct you know give it a chance to breathe before it runs because this thing's going to be",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 53,
      "start_timestamp": "00:36:16",
      "start_timestamp_seconds": 2176.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2176"
    }
  },
  {
    "text": "that we've seen the lows or at least I believe we've seen the lows and that we could we could run here pretty fast of 4,64650 and maybe maybe pause there pullback correct you know give it a chance to breathe before it runs because this thing's going to be a steep rally it's hard to know it's you know it's not going to do you're not going to be able to count on charts and say it's going to do exactly this but I think I think you're it's dependent on how um you know first you're going to have short covering you're going to have a lot of you know we're in we're in pretty high short shorting territory those shorts as this thing moves up because they thought yeah we can rally to 3700 or a little above as it's in moves up above say 38 3900 you're going to have more of them saying hey maybe I get a cover you know maybe this has more legs than that then as it moves further than that you're going to have more people saying more investors saying well the momentum is to the upside now I got all this money on the sidelines maybe I better put some money to work uh you know both institutional and retail saying I've been positioned defensively now I've got to get back in because this thing has legs and then the final piece is when you get to those new",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 53,
      "start_timestamp": "00:37:27",
      "start_timestamp_seconds": 2247.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2247"
    }
  },
  {
    "text": "all this money on the sidelines maybe I better put some money to work uh you know both institutional and retail saying I've been positioned defensively now I've got to get back in because this thing has legs and then the final piece is when you get to those new highs and I think FOMO kicks in you know fear of missing out kicks in and everybody jumps in and so while this is this is real and this is going a lot farther how the big question I get a lot is how can you be so bullish when you're talking about a global bus next year the economy looks like it's heading for a global bus right now the feds talking about tightening for many many more months the bomb market's been going against you how how can you be so sure you're going to have a meltup and two pieces of that one is the fact that we have sentiment at levels where you don't get too very often in by some measures it's a worst ever but certainly it's back to 2008 nine levels or you know previous bear market levels like 1982 or 1987 or 2003 so so you're at levels that historically have indicated you're pretty close to a bottom it's not a timing element so it's not like you can look at bear sentiment and say okay I got a buy but it does say an awful lot has been built into the",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 53,
      "start_timestamp": "00:38:37",
      "start_timestamp_seconds": 2317.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2317"
    }
  },
  {
    "text": "2003 so so you're at levels that historically have indicated you're pretty close to a bottom it's not a timing element so it's not like you can look at bear sentiment and say okay I got a buy but it does say an awful lot has been built into the market already discounted in terms of the bad news when you have sentiment at that level when you have you know you don't have to look very far to hear people talk bearishly everybody's as I say everybody's on one side of the boat you know they're all sitting on one side of the boat negative and if you get this thing moving against that view you got an awful lot of firepower there and and I just described different kinds of investors you know short covering and and institutions and retail and some that are momentum and some that are just long term investors that got scared but you have a lot of people who for different reasons are going to say my gosh I'm missing this and my gosh I can't afford to be this defensive you know with so much cash it's gonna you know it's gonna start punishing institutional investors that have bogies to me etc so as it moves up and then psychology is the other big piece as it moves up people chase momentum you know the psychology people are most bearish at the bottom and most bullish at the top and the tape",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 53,
      "start_timestamp": "00:39:51",
      "start_timestamp_seconds": 2391.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2391"
    }
  },
  {
    "text": "start punishing institutional investors that have bogies to me etc so as it moves up and then psychology is the other big piece as it moves up people chase momentum you know the psychology people are most bearish at the bottom and most bullish at the top and the tape draws them in each direction so as the tape got more and more negative investors got more and more negative as the tape meaning the day-to-day movement in the market got more and more positive investors will become more and more positive and put money to work so that's you know psychology is a big part of how markets work so that's you know because we're so so positioned against the market right now so bearish it's pretty easy for me to say once this thing gets started it has a lot farther to go than people realize because everybody's been you know in in agreement that it's going a lot lower and they'll have to reverse that so that's one and then how how do they fundamentally get there and what I say is that once investors and particularly institutions but retail follow them once investors the institutional investors get the sense that the feds tightening cycle is coming to an end you know that they went too far and they kind of was really getting weak they're not they're not looking at today's earnings or today's fundamentals and buying or selling stocks based on that they're looking out",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 53,
      "start_timestamp": "00:41:06",
      "start_timestamp_seconds": 2466.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2466"
    }
  },
  {
    "text": "get the sense that the feds tightening cycle is coming to an end you know that they went too far and they kind of was really getting weak they're not they're not looking at today's earnings or today's fundamentals and buying or selling stocks based on that they're looking out six to nine months they're looking at what will what will the landscape look like a year from now nine months from now once they get convinced that the fed is done or almost done they will start looking over the trough the trough in the economy the trough in earnings and they will start factoring in let's say 20 20 24 earnings and so they'll be able to say yes the earnings are getting you know the quarterly earnings are getting worse but we don't care about that because that's where it discounted we're looking over the trough to the next cycle that's what I think particularly that move from say 4800 to six or seven thousand that's what that move will be mostly is the belief that hey the tightening cycle is behind us and this is you know this is 2009 again or this is 1982 3 again or this is 2003 again where you have a full cycle ahead of you so you you need to get back in because there's a big cycle and earnings coming so that's what you know again I'm not saying that's what ultimately happens because I do think this is",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 53,
      "start_timestamp": "00:42:15",
      "start_timestamp_seconds": 2535.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2535"
    }
  },
  {
    "text": "again or this is 2003 again where you have a full cycle ahead of you so you you need to get back in because there's a big cycle and earnings coming so that's what you know again I'm not saying that's what ultimately happens because I do think this is a last hurrah not the beginning of a new cycle but that's how I think it will draw investors in you know that will be the narrative that drives the market it's interesting you actually did a really good job I think as well explaining the initial catalyst because that was going to be a follow-up question but you hit it right at the end like what actually gets the wheels started moving you know from here to that you know 45 4800 handle but I think you you shared that pretty pretty well thank you for that one of the things I want to make sure we touch on is let's say we get this melt up and we're now hanging out around 6,000 between six and seven thousand SPs what starts the conversion then from that last blow-off top into this global bust yeah so so as I said before it's not you know some people think when I talk about the recession now and a global bust next year they think somehow they're two different things I go no the recession ultimately morphs into a bust because things progress to that point where you know banks start",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 53,
      "start_timestamp": "00:43:27",
      "start_timestamp_seconds": 2607.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2607"
    }
  },
  {
    "text": "said before it's not you know some people think when I talk about the recession now and a global bust next year they think somehow they're two different things I go no the recession ultimately morphs into a bust because things progress to that point where you know banks start failing and things start happening it's you know I think traders have a hard time with it because they're thinking in the moment you know they they don't realize that this stuff takes a long time to play out I'm forever saying you got to let cycle play out and that just means it takes months and months and months for all this stuff to be just like your question about housing you know it doesn't all happen the men are rates go to 7 it happens over time because you know there are different people out there in different places in terms of their position to buy a house or with hand so and and plan to do it so so inventory is build up and you've got to correct inventory that's a process all those things so so it it just takes time but once we get up to the top psychologically most people are going to be all in so the investor looking at the market the investor is going to be most bullish at the top he's he's extremely bearish now and you know when markets up you know up with two or three thousand points",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 53,
      "start_timestamp": "00:44:40",
      "start_timestamp_seconds": 2680.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2680"
    }
  },
  {
    "text": "to the top psychologically most people are going to be all in so the investor looking at the market the investor is going to be most bullish at the top he's he's extremely bearish now and you know when markets up you know up with two or three thousand points from here he's going to be fully bear bullish and he's going to be arguing with me who has now turned bearish as to why I'm wrong because don't I understand there's you know there's a long cycle ahead if it's not tightening anymore because the economy is so weak but the other piece to this is that the economy can get a lot weaker because of the damage done now that whole thing of staying too long now and and I think what's going to happen around the world is you're going to have a crisis financially like we haven't seen so it's it's going to require a lot of effort on the part of the Fed and other central banks in terms of pumping money and on the part of governments to try to prop everything up I think it's just going to be a huge mess so and there's pieces of this I can't know yet but I suspect given the Dudley thesis imagine what Paul and Dudley are going to be thinking if the market at six or seven thousand when they thought it needed to get to say 2500 to tighten financial conditions so they're",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 53,
      "start_timestamp": "00:45:45",
      "start_timestamp_seconds": 2745.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2745"
    }
  },
  {
    "text": "and there's pieces of this I can't know yet but I suspect given the Dudley thesis imagine what Paul and Dudley are going to be thinking if the market at six or seven thousand when they thought it needed to get to say 2500 to tighten financial conditions so they're they're not going to walk away from tightening that street isn't going to be worried about that they're going to feel like because the economy is weak and inflation has come down a bit in the next say four or five months they're you know they're going to say tightening is behind us or at least for a period of time is behind us but I think the Fed's mindset is going to be we have unfinished business yes inflation is down I don't know where it will be six months from now but let's say it's five or six percent on the CPI you know they're going to say we're not it you know we're not we haven't beaten inflation yet it's starting to come down but there's still risk and guess what we got a very speculative market here with investors at you know hyper risk levels again you know very bullish and and speculating we need we need to tighten again you know and we need to get this thing down so again I think Dudley's thesis is going to rear it to ugly head and we'll play a role in that top I think they'll be",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 53,
      "start_timestamp": "00:47:09",
      "start_timestamp_seconds": 2829.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2829"
    }
  },
  {
    "text": "you know very bullish and and speculating we need we need to tighten again you know and we need to get this thing down so again I think Dudley's thesis is going to rear it to ugly head and we'll play a role in that top I think they'll be back to tightening the market will probably ignore it initially but I don't know for how long because I think I think if if I think they've sown the seeds to a bus now and then they come back and tighten again they're exacerbating something you know um so it's and again it's there's leads and lags to all of this so it's it's not going to be evident in in the results uh immediately in other words there if they raise right rates and yet the markets moving up um people aren't going to necessarily say oh wow this hiking rates is dangerous you know there so so they they may not it's not like but a bell's going to go off and people say okay I made my money now I'm getting out again they're going to be getting in you know they're going to think there's a long runway ahead and they're going to disagree with the Fed got it and I know we're coming up on time there's just two questions I've left for you the first one is what's your take on the relationship and the behavior that we're seeing really in the bond market",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 53,
      "start_timestamp": "00:48:17",
      "start_timestamp_seconds": 2897.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2897"
    }
  },
  {
    "text": "long runway ahead and they're going to disagree with the Fed got it and I know we're coming up on time there's just two questions I've left for you the first one is what's your take on the relationship and the behavior that we're seeing really in the bond market right now um I've obviously I've been trading for a while and a lot of times I'll trade risk on risk off relationships and this year is very interesting in that that relationship is obviously different than it's been historically I'm curious your thoughts on how bonds are behaving and what that looks like going forward yeah it's it's certainly been a surprise to me I you know I was this summer saying it looked there was a you know a uh set up where it looked like you were going to run back from 250 to three three and a quarter and then head lower and it pushed right through that three and a quarter and it has run up to you know four and a quarter here a little higher um and so that was you know not in in my you know I didn't have any foresight now that I missed that um but I think it is part of um traders have gotten caught in what the Fed is doing which is watching CPI every month so if you you know if you go back and look September CPI came in and everybody thought okay um",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 53,
      "start_timestamp": "00:49:35",
      "start_timestamp_seconds": 2975.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=2975"
    }
  },
  {
    "text": "now that I missed that um but I think it is part of um traders have gotten caught in what the Fed is doing which is watching CPI every month so if you you know if you go back and look September CPI came in and everybody thought okay um you know they they may if not pause at least start lightning up on the rate hikes because September CPI may start showing that you know we've peaked in inflation and starting to come down well instead we got a higher CPI print part of its technical part of it is the what makeup of the CPI and the fact that it's you know imputing rent uh rent probably peaked the year ago but it's it's making it look like rent has a lot further the bill etc um so so CPI was prize in the market it's just hyper tuned into CPI now and tuned into anything that goes with the the narrative that the Fed has long ways to hike here and so that kind of hit the markets in September and again here this month um but um I kind of lost my train of thought what was it oh so that that pushed the rates up you know once you got above three and a quarter then you got you went back to the highs around 348 I think now once ten you're got above that it became just a technical run and then this most",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 53,
      "start_timestamp": "00:50:34",
      "start_timestamp_seconds": 3034.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=3034"
    }
  },
  {
    "text": "was it oh so that that pushed the rates up you know once you got above three and a quarter then you got you went back to the highs around 348 I think now once ten you're got above that it became just a technical run and then this most recent jump and I thought okay um you know we'd go on up above four and then came back down and look like we're gonna go back and retest you know for a wait or wherever it's gotten to um and it just pushed right through that today and it went all the way to 431 I think um I think it's really just kind of um a little bit in in the same way that the stock market had to go to 3490 to get investors spooked enough um and get investors to start extrapolating that into oh we're going to 3000 or what have you I think the 10 year going to 430 all of a sudden everybody's you know on the uh you know out on the the ledge saying okay we're going to 450 or 5 in other words I think it was the capitulation sell off potentially it's still early to know that too early to know that but I think that may have been just kind of the last uh gas to get all the weak hands out of the bond market and and then you can start the reversal so if I'm right",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 53,
      "start_timestamp": "00:51:46",
      "start_timestamp_seconds": 3106.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=3106"
    }
  },
  {
    "text": "off potentially it's still early to know that too early to know that but I think that may have been just kind of the last uh gas to get all the weak hands out of the bond market and and then you can start the reversal so if I'm right right should start coming down uh between now and the end of the year um maybe fairly fast but certainly roll over and start coming down well if I'm wrong in the head's higher uh you I'm just missing it but but um I don't think right now when and I look at a lot of things I don't just look at you know what's the bond what's 10 year going to versus what's stock market gonna do there's a lot of factors out there right now a lot of my cross market stuff and things are more confirming my belief that we are at a very important reversal point here both in bonds and stocks you know bonds are are lagging here a little bit so you got to wait and see stocks I think we bottom less Thursday if if bonds falls through next week and you get more rally uh I think it will it'll just add more evidence that maybe today's action early you know this morning's action in bonds is a lot like early morning third less Thursday in stocks meaning that then they reverse right got it and I'm we're pretty much button right",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 53,
      "start_timestamp": "00:53:03",
      "start_timestamp_seconds": 3183.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=3183"
    }
  },
  {
    "text": "more rally uh I think it will it'll just add more evidence that maybe today's action early you know this morning's action in bonds is a lot like early morning third less Thursday in stocks meaning that then they reverse right got it and I'm we're pretty much button right up the time but I got to make sure I squeeze this one in because um I think it's still really pertinent to the broader picture here how do precious metals fit into this picture for you I've actually been really surprised that some of the behavior of gold specifically I trade gold futures pretty regularly and gold has been interesting to me so I'm curious how does how do you precious metals fit into this broader hypothesis of us into the melt up and then subsequent bust yeah I'm glad we didn't leave this this uh interview without talking about gold and silver because I think we are we were at a huge pivot point in gold and silver in my opinion yeah I've been I've been uh bullish for a long time and I keep thinking we bottom and then we go back and make lower lows I think we were at a some I'm the boy that quiet wolf but but I think we were at a major pivot point and I'm expecting both the miners and the metals to begin to move up from here pretty aggressively so you know you could see uh you know",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 53,
      "start_timestamp": "00:54:05",
      "start_timestamp_seconds": 3245.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=3245"
    }
  },
  {
    "text": "think we were at a some I'm the boy that quiet wolf but but I think we were at a major pivot point and I'm expecting both the miners and the metals to begin to move up from here pretty aggressively so you know you could see uh you know 15 or 20 move in the miners um let's say in the next couple weeks um you know I think so working in the very short term silver looks like it's got rooms around 22 23 um you know gold I think back over 1900 and in in the course of the next you know six nine months uh you know I continue to call for gold at 3000 and silver at 50 or higher so I'm I'm a huge goal on the metals and what when I did my work for my last letter when I went back and look what is very clear is that gold and silver rolled over in particularly gold but skull and silver rolled over almost coincident with the dollar moving up back in April uh march April and it it's almost entirely that rate rates played a role too for sure and most recently I think played a role in this weakness but if I'm right um the dollar is about to roll over and if the dollar rolls over that's going to be music to the ears of uh golden silver you know investors so um I don't think it's a lot",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 53,
      "start_timestamp": "00:55:15",
      "start_timestamp_seconds": 3315.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=3315"
    }
  },
  {
    "text": "recently I think played a role in this weakness but if I'm right um the dollar is about to roll over and if the dollar rolls over that's going to be music to the ears of uh golden silver you know investors so um I don't think it's a lot more complicated than that um you know golden silver are in my opinion as undervalued at this point as they've been in decades relative to other markets and I think once they start going they're going to get sponsorship you know this this idea that crypto is taken away they're um particularly gold you know taken away from gold uh may have in the short run attracted people that would have otherwise been gold buyers but I think the story really was the dollar and and again we talk about rates when we talk about the Fed but the truth is that the dollar being where it is is because of Fed policy it's it's another reason why I am so adamant about saying the Fed's making a huge policy error because they seem to ignore you know the the dollar in just 2022 just this year just 10 months the dollar has moved from I think 95 you know d x y from 95 up to you know uh 115 or where about that's a huge move with the Fed with the Fed and the Treasury not even paying attention to it as if it didn't matter that that's",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 53,
      "start_timestamp": "00:56:30",
      "start_timestamp_seconds": 3390.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=3390"
    }
  },
  {
    "text": "the dollar has moved from I think 95 you know d x y from 95 up to you know uh 115 or where about that's a huge move with the Fed with the Fed and the Treasury not even paying attention to it as if it didn't matter that that's why I'm surprised we haven't heard more from you know foreign entities and why the central month's price central banks haven't been on on the phone with the Fed over and over saying you got to do something I mean look at look at what's happened to the yen again that's a lot of itself inflicted inflicted there and it's going to lead to a disaster there because they're about to um deepag interest rates they've been keeping their rate of a quarter and if they let that run they they don't have to you know they're gonna they're gonna run is a real problem to give it what they've done over the last several decades with with um you know how they've held things together there so so uh you know there's there's plenty and that will be part of the bus as well there's plenty of things out there that will you know a year from now be front and center in the global bus because of policies that have taken place here in the last few years but but um I think if the dollar is rolling over as I expect the gold and silver are about",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 53,
      "start_timestamp": "00:57:51",
      "start_timestamp_seconds": 3471.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=3471"
    }
  },
  {
    "text": "there that will you know a year from now be front and center in the global bus because of policies that have taken place here in the last few years but but um I think if the dollar is rolling over as I expect the gold and silver are about to have big runs David I know we're at time and thank you honestly for taking some extra time on that last question it was kind of an unfair one to throw one at the last second but um I wanted to make sure we had a chance to talk about it because it is I think part of you know my general curiosity as well and one thing I want to make really clear to people who listen to this video is I definitely see a lot of folks comment about oh well this didn't happen or this didn't happen at that exact point and what I think is so powerful about the information you share is the thought process you shared the things that you look at the relationships between different factors and I learn so much every time I talk to you so thank you so much for taking some time to chat with me and to share your experience with the broader community I think it really is super useful yeah if you if you don't mind I just want to comment on that a little bit because it is please sorry what I see on",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 53,
      "start_timestamp": "00:58:58",
      "start_timestamp_seconds": 3538.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=3538"
    }
  },
  {
    "text": "for taking some time to chat with me and to share your experience with the broader community I think it really is super useful yeah if you if you don't mind I just want to comment on that a little bit because it is please sorry what I see on what I see on Twitter too um I really believe and this this dates me a lot because I was in this business before computers were were on our desktop so I really believe that you know what we've evolved to now on the retail side it's true on both institutional retail but on the retail side in particular they are now bombarded with all kind of information you know they have their fingertips um you know charts and things that they can see second to second minute to minute and unfortunately I think what has happened again this is my my view but I think what has happened is it's turned a lot of people who would have otherwise been investors into traders and somehow I think a very large chunk of retail investors somehow believe by watching the market every day and watching it minute to minute they're more on top of their portfolios and more on top of what's going on and what it's leading to is expectations that things are going to happen quickly you know again the institutional traders I you know I oversaw trading desk when I was chief investment officer or head of",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 53,
      "start_timestamp": "00:59:59",
      "start_timestamp_seconds": 3599.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=3599"
    }
  },
  {
    "text": "more on top of their portfolios and more on top of what's going on and what it's leading to is expectations that things are going to happen quickly you know again the institutional traders I you know I oversaw trading desk when I was chief investment officer or head of a equity department so and and I had good friends that were traders that worked for me but and traders have a different personality a different mentality and they're watching markets from a different perspective than a portfolio manager so I'm not putting them down but traders retail traders unfortunately I think a lot of them don't understand how long it takes for things to play out so my biggest critics on Twitter and the reason I have so many people obsessed to them the most extreme bull in a bear market but but a lot of them what I see in the criticisms is a lack of understanding of what a big picture macro call is versus a trading call and you know or how long it takes for the big picture to play out and I'm not just using that as a you know to kick the can down road so you gotta let it play out it's a cycle call means it takes time to work through that and so I'm you know I'm focused on you know where's the market going to be at the top I'm not necessarily focused on what's the you know what's",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 53,
      "start_timestamp": "01:01:09",
      "start_timestamp_seconds": 3669.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=3669"
    }
  },
  {
    "text": "down road so you gotta let it play out it's a cycle call means it takes time to work through that and so I'm you know I'm focused on you know where's the market going to be at the top I'm not necessarily focused on what's the you know what's the bottom in the market on the way to that top or what have you so yeah I'm not or or if I think you're going to make a double volume and it goes a little lower that's not my focus so but the most important piece of what I wanted to say we're just that I think if people could understand that watching the market so closely is typically counterproductive for most of them you know there's exceptions some may be really good picking things off and and doing the short-term trading stuff but most of them are investors but they think somehow watching it every day means they're getting more information and they're going to be better at it and or you know better at understanding what's coming and what I see is complete opposite I think it it leads to almost a blindness from from watching things too closely I and not to draw it out too long but I just I couldn't agree with you more I'm a trader myself and I've noticed my evolution where that exacting happened where I wanted to trade short-time frames and then as I started integrating longer time frames I",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 53,
      "start_timestamp": "01:02:23",
      "start_timestamp_seconds": 3743.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=3743"
    }
  },
  {
    "text": "too closely I and not to draw it out too long but I just I couldn't agree with you more I'm a trader myself and I've noticed my evolution where that exacting happened where I wanted to trade short-time frames and then as I started integrating longer time frames I actually started becoming far more successful in trading so I'm really glad you bring that up especially from a trader's perspective and I think that's actually one of the reasons why I love talking with you is because folks with your perspectives you force me to zoom out you force me to consider an alternative way of looking at the bigger picture that you're absolutely right a lot of traders get sucked into you know the X move that SP 500 made today so I really appreciate that perspective and sincerely again thank you so much for taking some time to chat with me and share your your information and obviously would love to have you on again in the future and until next time no thank you okay Eric thanks David",
    "metadata": {
      "video_id": "FUNC-MTq9PQ",
      "title": "Market Bottomed and Headed to Top in 6 Months Before 80% Global Bust with David Hunter",
      "url": "https://www.youtube.com/watch?v=FUNC-MTq9PQ",
      "upload_date": "",
      "duration": 3873.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 53,
      "start_timestamp": "01:03:23",
      "start_timestamp_seconds": 3803.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=FUNC-MTq9PQ&t=3803"
    }
  }
]