[
  {
    "text": "What's up to all the outliers, Eric here. I got a fun video for you today. So I was doing some market research earlier and I got to invite to a paid discord server under like a free trial period. So this video is gonna do a couple things. I'm gonna show you literally the conversation that I had with them. And most importantly, I want to highlight all of the red flags that I had in the conversations. For new traders, really for any trader, don't use a paid discord server. They are absolutely garbage. I've been invited to a bunch of them. I haven't found a good one yet. Not to say that there might not be a good one out there, but a far better use of your time and energy used to buy a book. Now, another thing, I do not hate the hustle. Most of these people are trying to be business minded. They see, you know, stock tweets doing what they're doing. They're like, well, I could, you know, start one of those. The issue I take with them is they pray on new traders or investors. I take a personal issue with that. Hence why I'm literally doing a public service announcement on it right now. So I am not gonna go into the specific discord group. I'm not gonna go into the specific people I talk to. I got all the names out of it, but I want to teach you how",
    "metadata": {
      "video_id": "fzWYHaO3za4",
      "title": "I Joined a Paid Trading Discord So You Don't Have To",
      "url": "https://www.youtube.com/watch?v=fzWYHaO3za4",
      "upload_date": "2022-02-22T01:03:50Z",
      "duration": "PT11M35S",
      "channel_name": "",
      "description": "📈 Join the Outlier Patreon for weekly workshops, trade analysis, trader resources, & more. https://www.patreon.com/erik_esinvests\n📨 Subscribe to the Outlier Insights Newsletter. https://esinvests.substack.com/\n💡 Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n📻 Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n🔎Learn About Erik. https://www.esinvests.com\n\n▬ AFFILIATES  ▬▬▬▬▬▬▬▬▬▬\n► 50% off Options Omega Backtesting: https://optionomega.com/register/esinvests\n► 50% off ORATS Options Trading Platform, Backtesting, & More: https://orats.com/esinvests\n► Barchart Premium - Try for FREE: https://www.barchart.com/get-barchart-premier?fpr=xaiek",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fzWYHaO3za4&t=0"
    }
  },
  {
    "text": "Hence why I'm literally doing a public service announcement on it right now. So I am not gonna go into the specific discord group. I'm not gonna go into the specific people I talk to. I got all the names out of it, but I want to teach you how to look for these red flags because there's a bunch of them. So let's dive straight in. This is the first message that I got. So this is a DM from the owner. They said that, you know, would you like access to this chat to view over 10 analysts daily alerts? They're referring to them as analysts, which is again, just it tickles me because it's so crazy that they go that direction with it. So it's a paid service. They go through what some of their stuff they offer, you know, some option traders, swing traders, via stock, day traders, stuff like that. And I ask if there's, you know, are there profiles like with their experience levels, with audited returns? And they essentially said that their intros share what they do. And their wind rates, this is the highlight here. Red flag numbers three, really, other than a random person on discord message you to join their paid discord. The fact that they're already focusing on wind rates tells me a lot. That is a amateur investor move, amateur trader move. People who do this for a long time don't focus on wind rates. It's part of",
    "metadata": {
      "video_id": "fzWYHaO3za4",
      "title": "I Joined a Paid Trading Discord So You Don't Have To",
      "url": "https://www.youtube.com/watch?v=fzWYHaO3za4",
      "upload_date": "2022-02-22T01:03:50Z",
      "duration": "PT11M35S",
      "channel_name": "",
      "description": "📈 Join the Outlier Patreon for weekly workshops, trade analysis, trader resources, & more. https://www.patreon.com/erik_esinvests\n📨 Subscribe to the Outlier Insights Newsletter. https://esinvests.substack.com/\n💡 Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n📻 Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n🔎Learn About Erik. https://www.esinvests.com\n\n▬ AFFILIATES  ▬▬▬▬▬▬▬▬▬▬\n► 50% off Options Omega Backtesting: https://optionomega.com/register/esinvests\n► 50% off ORATS Options Trading Platform, Backtesting, & More: https://orats.com/esinvests\n► Barchart Premium - Try for FREE: https://www.barchart.com/get-barchart-premier?fpr=xaiek",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 11,
      "start_timestamp": "00:00:59",
      "start_timestamp_seconds": 59.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fzWYHaO3za4&t=59"
    }
  },
  {
    "text": "a random person on discord message you to join their paid discord. The fact that they're already focusing on wind rates tells me a lot. That is a amateur investor move, amateur trader move. People who do this for a long time don't focus on wind rates. It's part of an important equation, but a high wind rate can still lose money over time. That's called negative expectancy. You can have a trade strategy that wins 90 of the time but loses money. Conversely, you can have a strategy that is accurate 35 of the time, but is positively expected. So people focus on this because it sells well. If you have somebody that says I can, you know, 90 win rate, everybody immediately thinks that they're going to make fat stacks, kind of like the analyst that I talked to, but it's not accurate. So let's go to the conversation with the analyst. This was my favorite. So you got a favor, you got a kind of a bit about who they are. They're talking about their 85 to 90 return over three months. This is hilarious because you'll see the way that they calculate their returns, which they save for the past two weeks was 352. The way that they're calculating their returns is simply by adding up the percent return for each trade and they are calling that their total return. Halleurious. That's not how that's done. So again, just another red flag coming out of this",
    "metadata": {
      "video_id": "fzWYHaO3za4",
      "title": "I Joined a Paid Trading Discord So You Don't Have To",
      "url": "https://www.youtube.com/watch?v=fzWYHaO3za4",
      "upload_date": "2022-02-22T01:03:50Z",
      "duration": "PT11M35S",
      "channel_name": "",
      "description": "📈 Join the Outlier Patreon for weekly workshops, trade analysis, trader resources, & more. https://www.patreon.com/erik_esinvests\n📨 Subscribe to the Outlier Insights Newsletter. https://esinvests.substack.com/\n💡 Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n📻 Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n🔎Learn About Erik. https://www.esinvests.com\n\n▬ AFFILIATES  ▬▬▬▬▬▬▬▬▬▬\n► 50% off Options Omega Backtesting: https://optionomega.com/register/esinvests\n► 50% off ORATS Options Trading Platform, Backtesting, & More: https://orats.com/esinvests\n► Barchart Premium - Try for FREE: https://www.barchart.com/get-barchart-premier?fpr=xaiek",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 11,
      "start_timestamp": "00:02:07",
      "start_timestamp_seconds": 127.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fzWYHaO3za4&t=127"
    }
  },
  {
    "text": "save for the past two weeks was 352. The way that they're calculating their returns is simply by adding up the percent return for each trade and they are calling that their total return. Halleurious. That's not how that's done. So again, just another red flag coming out of this person. So going back up to their intro, it talks about their background and then it says that they're going to try to provide an 80 win rate. Again, the focus on the win rate is such a red flag. Next red flag, I asked them how long they've been trading. They say five years, 10 plus. If you count paper trading, isn't that precious? They've only been trading for five years. And in order to sound more legitimate, they want you to see a bigger number. So they throw their paper trading numbers out there. Unfortunately, nobody gives a fuck about your paper trading, just being clear. So moving on, they talk about combining technical and fundamental analysis. This turns into a red flag. This by a statement in and of itself, yeah, you know, could be. But what you'll notice is later on, they say that their average time window for trading is one to four weeks. Fundamental analysis doesn't matter that much in that timeframe. Not to say it doesn't matter at all, but to even really add that as a part of your overall approach if you're swing trading, again, they're just throwing buzzwords out there",
    "metadata": {
      "video_id": "fzWYHaO3za4",
      "title": "I Joined a Paid Trading Discord So You Don't Have To",
      "url": "https://www.youtube.com/watch?v=fzWYHaO3za4",
      "upload_date": "2022-02-22T01:03:50Z",
      "duration": "PT11M35S",
      "channel_name": "",
      "description": "📈 Join the Outlier Patreon for weekly workshops, trade analysis, trader resources, & more. https://www.patreon.com/erik_esinvests\n📨 Subscribe to the Outlier Insights Newsletter. https://esinvests.substack.com/\n💡 Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n📻 Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n🔎Learn About Erik. https://www.esinvests.com\n\n▬ AFFILIATES  ▬▬▬▬▬▬▬▬▬▬\n► 50% off Options Omega Backtesting: https://optionomega.com/register/esinvests\n► 50% off ORATS Options Trading Platform, Backtesting, & More: https://orats.com/esinvests\n► Barchart Premium - Try for FREE: https://www.barchart.com/get-barchart-premier?fpr=xaiek",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 11,
      "start_timestamp": "00:03:11",
      "start_timestamp_seconds": 191.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fzWYHaO3za4&t=191"
    }
  },
  {
    "text": "time window for trading is one to four weeks. Fundamental analysis doesn't matter that much in that timeframe. Not to say it doesn't matter at all, but to even really add that as a part of your overall approach if you're swing trading, again, they're just throwing buzzwords out there trying to sound more legitimate. That's not going to be a main part of your strategy. All right, so let's go into their trades. I loved this part. They talked about a sample of the alerts that they give and they talked about their 95 win rate over the last three two weeks or over the last two weeks, which gave them a total return of 352 again, completely inaccurate calculation of that. But whatever, the other red flag, this isn't how option traders are going to list out their trades. This is just random numbers and shit. There's no actual detail here. It doesn't tell you, you know, BTO, STO, none of that's there. Most, most option traders are going to list out their trades in a similar fashion to what they see on their platform. That's not what this is. This is just a person that is seeing, you know, maybe placing trades, but they're not processing it like most of us do and reporting it the way that the large majority of the community does. So again, as a standalone measure, this could be fine, but in conjunction with everything else, I've seen so far in the",
    "metadata": {
      "video_id": "fzWYHaO3za4",
      "title": "I Joined a Paid Trading Discord So You Don't Have To",
      "url": "https://www.youtube.com/watch?v=fzWYHaO3za4",
      "upload_date": "2022-02-22T01:03:50Z",
      "duration": "PT11M35S",
      "channel_name": "",
      "description": "📈 Join the Outlier Patreon for weekly workshops, trade analysis, trader resources, & more. https://www.patreon.com/erik_esinvests\n📨 Subscribe to the Outlier Insights Newsletter. https://esinvests.substack.com/\n💡 Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n📻 Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n🔎Learn About Erik. https://www.esinvests.com\n\n▬ AFFILIATES  ▬▬▬▬▬▬▬▬▬▬\n► 50% off Options Omega Backtesting: https://optionomega.com/register/esinvests\n► 50% off ORATS Options Trading Platform, Backtesting, & More: https://orats.com/esinvests\n► Barchart Premium - Try for FREE: https://www.barchart.com/get-barchart-premier?fpr=xaiek",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 11,
      "start_timestamp": "00:04:32",
      "start_timestamp_seconds": 272.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fzWYHaO3za4&t=272"
    }
  },
  {
    "text": "you know, maybe placing trades, but they're not processing it like most of us do and reporting it the way that the large majority of the community does. So again, as a standalone measure, this could be fine, but in conjunction with everything else, I've seen so far in the conversation, another red flag. And then here's a huge red flag. It says that they sold half of the position for 9 and then they were stopped out at the remaining position. They say that they like to get stopped out at break even, once they're at 10 or more. And they walked away with a 5 return. Here's the deal. You're starting to see a couple things. The first one is I don't hate the fact that they're taking partial profits. That's actually kind of a good thing. But the problem is is they're not making any money here. They're adding risk out, but they're getting 5 return on the capital. That's a problem. So again, in a vacuum, that's not necessarily a bad thing. It could be OK, but in light of everything else I'm seeing, the red flag I get here is I bet this is a negatively expecting strategy. That's my guess. So we will find out more about that right now. So I asked them for any numbers because all they use is percentages in reporting the trades, which is another problem. You can't tell what amount of money they entered or exited the trade",
    "metadata": {
      "video_id": "fzWYHaO3za4",
      "title": "I Joined a Paid Trading Discord So You Don't Have To",
      "url": "https://www.youtube.com/watch?v=fzWYHaO3za4",
      "upload_date": "2022-02-22T01:03:50Z",
      "duration": "PT11M35S",
      "channel_name": "",
      "description": "📈 Join the Outlier Patreon for weekly workshops, trade analysis, trader resources, & more. https://www.patreon.com/erik_esinvests\n📨 Subscribe to the Outlier Insights Newsletter. https://esinvests.substack.com/\n💡 Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n📻 Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n🔎Learn About Erik. https://www.esinvests.com\n\n▬ AFFILIATES  ▬▬▬▬▬▬▬▬▬▬\n► 50% off Options Omega Backtesting: https://optionomega.com/register/esinvests\n► 50% off ORATS Options Trading Platform, Backtesting, & More: https://orats.com/esinvests\n► Barchart Premium - Try for FREE: https://www.barchart.com/get-barchart-premier?fpr=xaiek",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 11,
      "start_timestamp": "00:05:36",
      "start_timestamp_seconds": 336.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fzWYHaO3za4&t=336"
    }
  },
  {
    "text": "negatively expecting strategy. That's my guess. So we will find out more about that right now. So I asked them for any numbers because all they use is percentages in reporting the trades, which is another problem. You can't tell what amount of money they entered or exited the trade for, which is important for calculating expectancy. You got it, which this person doesn't even know what it is, which we'll get into in just a minute. So they're saying about their win rate, about how they like to trade naked calls or puts based on opinion. Sometimes they'll do spreads. This is entertaining. How have you done over your four or five, over your five years of trading? Well, I didn't always have the capital, especially at first, but I've outperformed the market since entering the market in total. What does that even mean? I'm looking for a caggar. What's your compound annual growth rate? What is your return for each of those five years that you've been trading? Why do you even consider one of those five years if you're saying that you didn't have money when you were starting? Again, three or four red flags right there. And here is what I was looking to confirm. Essentially, my thought process here is, how does this person deploy a strategy? Do they even have a strategy that is defined? The answer is no, and you'll see how I could tell. So I ask, what is your general option",
    "metadata": {
      "video_id": "fzWYHaO3za4",
      "title": "I Joined a Paid Trading Discord So You Don't Have To",
      "url": "https://www.youtube.com/watch?v=fzWYHaO3za4",
      "upload_date": "2022-02-22T01:03:50Z",
      "duration": "PT11M35S",
      "channel_name": "",
      "description": "📈 Join the Outlier Patreon for weekly workshops, trade analysis, trader resources, & more. https://www.patreon.com/erik_esinvests\n📨 Subscribe to the Outlier Insights Newsletter. https://esinvests.substack.com/\n💡 Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n📻 Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n🔎Learn About Erik. https://www.esinvests.com\n\n▬ AFFILIATES  ▬▬▬▬▬▬▬▬▬▬\n► 50% off Options Omega Backtesting: https://optionomega.com/register/esinvests\n► 50% off ORATS Options Trading Platform, Backtesting, & More: https://orats.com/esinvests\n► Barchart Premium - Try for FREE: https://www.barchart.com/get-barchart-premier?fpr=xaiek",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 11,
      "start_timestamp": "00:06:41",
      "start_timestamp_seconds": 401.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fzWYHaO3za4&t=401"
    }
  },
  {
    "text": "And here is what I was looking to confirm. Essentially, my thought process here is, how does this person deploy a strategy? Do they even have a strategy that is defined? The answer is no, and you'll see how I could tell. So I ask, what is your general option strategy? Short calls or puts, how do you manage them? It says, I'll do both depending on the environment. That's completely fine. For each alert, I send a stop loss is attached. Then once I get 10, I typically sent a stop loss at break, even for half the position, and sell the remaining 50 in two different cells for 25 a quarter of the position each. You can't make money this way. This is a negative, expected strategy. You can't make money this way. And then the way that I confirm that is saying, where do you place your stop losses? So this person doesn't even know that I'm essentially doing their expectancy for them. They say it depends on the position, but anywhere from 30 to 50 lower. Now I know for a fact you can't make money here. This is just a matter of math. So as soon as some of these losses start rolling in, that 94 win rate, making 5 on a trade means nothing. So this is just a bunch of bullshit. And what frustrates me the most is that this person is trying to sell this to other people. All right. I get",
    "metadata": {
      "video_id": "fzWYHaO3za4",
      "title": "I Joined a Paid Trading Discord So You Don't Have To",
      "url": "https://www.youtube.com/watch?v=fzWYHaO3za4",
      "upload_date": "2022-02-22T01:03:50Z",
      "duration": "PT11M35S",
      "channel_name": "",
      "description": "📈 Join the Outlier Patreon for weekly workshops, trade analysis, trader resources, & more. https://www.patreon.com/erik_esinvests\n📨 Subscribe to the Outlier Insights Newsletter. https://esinvests.substack.com/\n💡 Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n📻 Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n🔎Learn About Erik. https://www.esinvests.com\n\n▬ AFFILIATES  ▬▬▬▬▬▬▬▬▬▬\n► 50% off Options Omega Backtesting: https://optionomega.com/register/esinvests\n► 50% off ORATS Options Trading Platform, Backtesting, & More: https://orats.com/esinvests\n► Barchart Premium - Try for FREE: https://www.barchart.com/get-barchart-premier?fpr=xaiek",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 11,
      "start_timestamp": "00:07:48",
      "start_timestamp_seconds": 468.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fzWYHaO3za4&t=468"
    }
  },
  {
    "text": "soon as some of these losses start rolling in, that 94 win rate, making 5 on a trade means nothing. So this is just a bunch of bullshit. And what frustrates me the most is that this person is trying to sell this to other people. All right. I get a little into how they select their deltas, which is just another non-answer. I go a little further into detail on their time frame, what their average win and losses, essentially explicitly asking them what their expectancy is, but they don't know how to answer that question. I ask them, what is the dollar amount for your win rate, your average win? They say a couple hundred each week. That's also not what I was asking. I do like the fact that they say that they don't risk much per trade, three to five percent of the portfolio, stereotypical fair risk management there. So feather in their cap, unfortunately, at this point, they are way too far gone to be any sort of authority on trading. And then I ask, you can't calculate expectancy with the percentage, which is really what I was trying to get at the whole time. And then they say, sure, you can. Percent return times money invested equals return and dollar form makes sense. That's not expectancy. Oh, sweetheart. I appreciate you trying, but it's just inaccurate. So we go back and forth a little bit more. And I get to the point where, OK,",
    "metadata": {
      "video_id": "fzWYHaO3za4",
      "title": "I Joined a Paid Trading Discord So You Don't Have To",
      "url": "https://www.youtube.com/watch?v=fzWYHaO3za4",
      "upload_date": "2022-02-22T01:03:50Z",
      "duration": "PT11M35S",
      "channel_name": "",
      "description": "📈 Join the Outlier Patreon for weekly workshops, trade analysis, trader resources, & more. https://www.patreon.com/erik_esinvests\n📨 Subscribe to the Outlier Insights Newsletter. https://esinvests.substack.com/\n💡 Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n📻 Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n🔎Learn About Erik. https://www.esinvests.com\n\n▬ AFFILIATES  ▬▬▬▬▬▬▬▬▬▬\n► 50% off Options Omega Backtesting: https://optionomega.com/register/esinvests\n► 50% off ORATS Options Trading Platform, Backtesting, & More: https://orats.com/esinvests\n► Barchart Premium - Try for FREE: https://www.barchart.com/get-barchart-premier?fpr=xaiek",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 11,
      "start_timestamp": "00:08:53",
      "start_timestamp_seconds": 533.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fzWYHaO3za4&t=533"
    }
  },
  {
    "text": "And then they say, sure, you can. Percent return times money invested equals return and dollar form makes sense. That's not expectancy. Oh, sweetheart. I appreciate you trying, but it's just inaccurate. So we go back and forth a little bit more. And I get to the point where, OK, there's nothing happening here. So then I divulge myself, I let them know, not divulge myself, let me sort of big reveal. I just let them know that I'm not really new to this. And I can tell that you are. And this is something that you should probably look into. And then this is my favorite part of the conversation. The owner of the Discord messages me, and they say, I'd rather you have these negotiations in private, rather than shitting on our entire Discord thanks, not fair to the other analysts. They're selling bullshit. I don't care. I purposely did switch it over to the DM conversation, because again, part of my goal here with the platform is to empower traders. Even if they're individual traders selling shitty services, I definitely think that this person should not be selling anything, maybe lemonade. But it's just so disheartening to see. And this is one of the biggest problems we see in the community. Is there are people who are praying on new traders like this all the time. Don't use paid Discord. As always, if you have any questions or anything that you want to see me go over,",
    "metadata": {
      "video_id": "fzWYHaO3za4",
      "title": "I Joined a Paid Trading Discord So You Don't Have To",
      "url": "https://www.youtube.com/watch?v=fzWYHaO3za4",
      "upload_date": "2022-02-22T01:03:50Z",
      "duration": "PT11M35S",
      "channel_name": "",
      "description": "📈 Join the Outlier Patreon for weekly workshops, trade analysis, trader resources, & more. https://www.patreon.com/erik_esinvests\n📨 Subscribe to the Outlier Insights Newsletter. https://esinvests.substack.com/\n💡 Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n📻 Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n🔎Learn About Erik. https://www.esinvests.com\n\n▬ AFFILIATES  ▬▬▬▬▬▬▬▬▬▬\n► 50% off Options Omega Backtesting: https://optionomega.com/register/esinvests\n► 50% off ORATS Options Trading Platform, Backtesting, & More: https://orats.com/esinvests\n► Barchart Premium - Try for FREE: https://www.barchart.com/get-barchart-premier?fpr=xaiek",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 11,
      "start_timestamp": "00:09:59",
      "start_timestamp_seconds": 599.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fzWYHaO3za4&t=599"
    }
  },
  {
    "text": "see. And this is one of the biggest problems we see in the community. Is there are people who are praying on new traders like this all the time. Don't use paid Discord. As always, if you have any questions or anything that you want to see me go over, hit me up in the contact info in the video description. Stay away from these things, please. And I will catch you all later.",
    "metadata": {
      "video_id": "fzWYHaO3za4",
      "title": "I Joined a Paid Trading Discord So You Don't Have To",
      "url": "https://www.youtube.com/watch?v=fzWYHaO3za4",
      "upload_date": "2022-02-22T01:03:50Z",
      "duration": "PT11M35S",
      "channel_name": "",
      "description": "📈 Join the Outlier Patreon for weekly workshops, trade analysis, trader resources, & more. https://www.patreon.com/erik_esinvests\n📨 Subscribe to the Outlier Insights Newsletter. https://esinvests.substack.com/\n💡 Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n📻 Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n🔎Learn About Erik. https://www.esinvests.com\n\n▬ AFFILIATES  ▬▬▬▬▬▬▬▬▬▬\n► 50% off Options Omega Backtesting: https://optionomega.com/register/esinvests\n► 50% off ORATS Options Trading Platform, Backtesting, & More: https://orats.com/esinvests\n► Barchart Premium - Try for FREE: https://www.barchart.com/get-barchart-premier?fpr=xaiek",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 11,
      "start_timestamp": "00:11:12",
      "start_timestamp_seconds": 672.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=fzWYHaO3za4&t=672"
    }
  }
]