[
  {
    "text": "hey everyone eric here made a handful of adjustments in the small stacks portfolio yesterday so um i'm going to share those here and then the other thing i was actually just thinking about is kind of defining the time frame for the portfolio because although it is entertaining and you know educational for this essentially this forum um i do not intend to do it into perpetuity just because it's not really the best use of my time for myself so as of right now i'm thinking of pretty much doing it for a year which would take us till around 1 september of next year but if anybody has any thoughts on that let me know i don't want to you know cut the segment short if you know folks are finding it helpful but i also am thoughtful in the fact that it's helpful for folks but like i said not really the best use of my personal time so we'll um right now that's what i'll plan to unless you know there's some sort of uproar or somebody has a better approach you know i would be receptive to it okay so that part aside let's take a look at the um the portfolio so i took down my trade in mosaic yesterday most of these trades were done yesterday the reason being is just with today being election i anticipated a bit of volatility so pretty much across most of my portfolios i was just",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "2020-11-04T17:46:00Z",
      "duration": "PT12M35S",
      "channel_name": "Outlier Trading",
      "description": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests\nWebpage:  https://esInvests.com",
      "content_summary": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week. Stay in touch with Erik \nTwitter   Instagram    esInvest...",
      "chunk_index": 0,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=0"
    }
  },
  {
    "text": "take a look at the um the portfolio so i took down my trade in mosaic yesterday most of these trades were done yesterday the reason being is just with today being election i anticipated a bit of volatility so pretty much across most of my portfolios i was just closing stuff down yesterday and then planning on reestablishing um you know minor exposure yesterday but really i wanted to make sure i was repositioning things before we went into the election just because didn't know obviously which way the market was going to react still don't know right now it's 1825 pacific time so we'll see but with all that being said i wanted to make sure that everything was kind of adjusted before today and then we'll kind of see what things look like going forward so i figured that we would start with the macro view so i realize i got to move my head again so now we'll go down here and actually i think we can go bottom left because the next one this is going to be in the way okay and then let me just slide this over all right so for mosaic that got closed out for 59 cents yesterday and that took in a p l which was about a 34 capture of premium overall i still like mosaic i didn't want to hold it through earnings so as soon as i saw an opportunity to exit the trade yesterday i",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "2020-11-04T17:46:00Z",
      "duration": "PT12M35S",
      "channel_name": "Outlier Trading",
      "description": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests\nWebpage:  https://esInvests.com",
      "content_summary": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week. Stay in touch with Erik \nTwitter   Instagram    esInvest...",
      "chunk_index": 1,
      "total_chunks": 10,
      "start_timestamp": "00:01:06",
      "start_timestamp_seconds": 66.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=66"
    }
  },
  {
    "text": "that got closed out for 59 cents yesterday and that took in a p l which was about a 34 capture of premium overall i still like mosaic i didn't want to hold it through earnings so as soon as i saw an opportunity to exit the trade yesterday i dumped out of it just because i wanted to minimize my exposure to kind of the move and then the subsequent follow-on follow-through potential which if we take a look at it real quick it was a good thing i did that and it's another example of why i talk about being purposeful when offering exposure so they reported yesterday after the close and as you can tell today had a pretty big red day so my intention with that trade leading into earnings was to capitalize on the increased volatility which we see it trading at 90 cents when i put the trade on and then before the close yesterday i was able to exit the trade and i would look to revisit it um but the reason why i didn't again is because i don't want to mess with it post earnings as it's settling out this was not really an earnings play depending on the trade ran through i was willing to hold it through earnings but that wasn't the original disposition so i wanted to limit that now in its place i took up bank of america and again yesterday i offered the 20 nov 24",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "2020-11-04T17:46:00Z",
      "duration": "PT12M35S",
      "channel_name": "Outlier Trading",
      "description": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests\nWebpage:  https://esInvests.com",
      "content_summary": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week. Stay in touch with Erik \nTwitter   Instagram    esInvest...",
      "chunk_index": 2,
      "total_chunks": 10,
      "start_timestamp": "00:02:27",
      "start_timestamp_seconds": 147.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=147"
    }
  },
  {
    "text": "not really an earnings play depending on the trade ran through i was willing to hold it through earnings but that wasn't the original disposition so i wanted to limit that now in its place i took up bank of america and again yesterday i offered the 20 nov 24 puts at a dollar 22. now this was a super advantageous trade i was between xlf and bank of america and it's because they're trading right around the same level and this is a good conversation about premium and even though xlf was returning over a percent which is good for an etf bank of america was obviously returning well over that so that's why i took my money to really where the trade was and i was hesitant to get long here but obviously it had a bit of a gap up today that i intend to watch very closely because it's still early in the life cycle of the trade otherwise i would love to close it here but it's really not showing any sort of meaningful profit just yet um but we'll monitor that one as we go really the purpose of that trade was to capture that that premium it was significant and for the buying power that i was putting out there it represents a really really good return which is what lured me into that trade and i liked adding some financial exposure so that's why that's there okay now moving over to the",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "2020-11-04T17:46:00Z",
      "duration": "PT12M35S",
      "channel_name": "Outlier Trading",
      "description": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests\nWebpage:  https://esInvests.com",
      "content_summary": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week. Stay in touch with Erik \nTwitter   Instagram    esInvest...",
      "chunk_index": 3,
      "total_chunks": 10,
      "start_timestamp": "00:03:54",
      "start_timestamp_seconds": 234.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=234"
    }
  },
  {
    "text": "that that premium it was significant and for the buying power that i was putting out there it represents a really really good return which is what lured me into that trade and i liked adding some financial exposure so that's why that's there okay now moving over to the diagonals um let me take this one down and open this one up okay so taking a look at these in kroger if you'll remember from the last couple of videos i took down the short calls but i didn't offer any new exposure and it's just because i was kind of waiting for a little while to see what the product did and it was trading sideways for a little while and then today with its recent kind of move up i decided to offer a little bit of exposure in there and the reason for that is i just didn't want to not be taking in premium for too long so that's why i offered kind of a partial here it's still at a one to two ratio so my upside is not capped but i sent out the 18 december 35 calls collecting 65 cents which is around a 30 delta the leaps themselves right now are losing um they're definitely not where i want them to be but it's overall still not too bad of a position the un unrealized loss on those is about 380 dollars compared to the the current leap but we have",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "2020-11-04T17:46:00Z",
      "duration": "PT12M35S",
      "channel_name": "Outlier Trading",
      "description": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests\nWebpage:  https://esInvests.com",
      "content_summary": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week. Stay in touch with Erik \nTwitter   Instagram    esInvest...",
      "chunk_index": 4,
      "total_chunks": 10,
      "start_timestamp": "00:05:15",
      "start_timestamp_seconds": 315.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=315"
    }
  },
  {
    "text": "around a 30 delta the leaps themselves right now are losing um they're definitely not where i want them to be but it's overall still not too bad of a position the un unrealized loss on those is about 380 dollars compared to the the current leap but we have 288 realized profit on the short calls and then we still have an additional 65 out from the new outlay if we see a little bit more of an up move i will happily offer the second call to make this at a one-to-one so i could essentially exit the entire trade at a profit but we'll see what it looks like i like scaling in with the short calls just so i can be more sensitive to price movements and kind of collect a little bit more premium when the opportunity presents itself next up is intel so intel this was another pretty simple trade i was watching it for a little while simply because i was showing over a 50 max profit pretty much you know for a few days since i put this thing on and once it started hovering around here and then i started saw it start making a little bit of an up move that's when i wanted to make the adjustments so i closed out the 47 calls i sold them for 1.65 i took them down for 74 cents and that brought out a realized profit of 91 bucks on that and",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "2020-11-04T17:46:00Z",
      "duration": "PT12M35S",
      "channel_name": "Outlier Trading",
      "description": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests\nWebpage:  https://esInvests.com",
      "content_summary": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week. Stay in touch with Erik \nTwitter   Instagram    esInvest...",
      "chunk_index": 5,
      "total_chunks": 10,
      "start_timestamp": "00:06:30",
      "start_timestamp_seconds": 390.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=390"
    }
  },
  {
    "text": "it start making a little bit of an up move that's when i wanted to make the adjustments so i closed out the 47 calls i sold them for 1.65 i took them down for 74 cents and that brought out a realized profit of 91 bucks on that and then i offered the 20 no 47 calls and i got 56 cents for those now i want to offer an important note on this i typically would not have closed those four d's 47 calls if there was 74 dollars left on the table when i was only getting 56 dollars for the new position right because that essentially means there's 20 20 little s 18 in the position i was taking down more than what i just put on the reason why i did this is because the early expiration 20 nov so it offers me a little more sensitivity to more recent price change and it's a obviously as soon as you start moving closer days to expiration your premium per day automatically increases so it has a higher premium per day but the real thing that i was looking for here is although it is a slightly lower overall return it is in um in the scale of things going to give me more money per day than what i had left in the 47s that i had before so it was a way for me to realize that profit and then take a look at",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "2020-11-04T17:46:00Z",
      "duration": "PT12M35S",
      "channel_name": "Outlier Trading",
      "description": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests\nWebpage:  https://esInvests.com",
      "content_summary": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week. Stay in touch with Erik \nTwitter   Instagram    esInvest...",
      "chunk_index": 6,
      "total_chunks": 10,
      "start_timestamp": "00:07:48",
      "start_timestamp_seconds": 468.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=468"
    }
  },
  {
    "text": "slightly lower overall return it is in um in the scale of things going to give me more money per day than what i had left in the 47s that i had before so it was a way for me to realize that profit and then take a look at something that will um that will offer me a little more sensitivity for whatever comes next for intel one of those being the dividend coming out on the fifth which will knock price down again which is another potential for me to take those calls down at a partial profit depending on what that looks like but we'll have to wait and see what that um what that turns out to be for us so overall going back out to the macro somebody was asking about the net lick for the portfolio so i don't typically track this and i don't intend to going forward but just to answer that question right now it's sitting at around 5 500 bucks which is a little bit lower obviously than the realized p l but you know totally okay with me i prefer to track the realized p l that's what's most important to me in a portfolio like this but nonetheless again wanted to answer that question so right now it's looking like 5500 or so and that's mostly coming from kroger the leaps hurting in there they're down almost 380. so that's where the majority of that's coming from all",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "2020-11-04T17:46:00Z",
      "duration": "PT12M35S",
      "channel_name": "Outlier Trading",
      "description": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests\nWebpage:  https://esInvests.com",
      "content_summary": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week. Stay in touch with Erik \nTwitter   Instagram    esInvest...",
      "chunk_index": 7,
      "total_chunks": 10,
      "start_timestamp": "00:09:10",
      "start_timestamp_seconds": 550.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=550"
    }
  },
  {
    "text": "important to me in a portfolio like this but nonetheless again wanted to answer that question so right now it's looking like 5500 or so and that's mostly coming from kroger the leaps hurting in there they're down almost 380. so that's where the majority of that's coming from all right so right now when we look at the portfolio utilizations at 4 800 which is around 80 utilized um we've made about a thousand dollars on the account which is pretty solid return it's 17 since i started this on the first of september the vast majority of profit is still coming from the diagonals and right now there is 243 in premium out in the market which would be about a 4 return on the account now the last thing that i want to note is this is absolutely a time that i'm going to start looking at volatility products as we see volatility starting to recede back leading into the election especially if things start getting weird tomorrow meaning you know we don't know who wins that kind of thing they're starting to recount fighting over that as soon as i start seeing anything like that happening i will absolutely buy some vxx calls just to take attempt to take advantage of an uptick in volatility on the cheap so i'm gonna keep an eye for that overnight and realistically this will be one of those scenarios that i may end up playing it in my margin",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "2020-11-04T17:46:00Z",
      "duration": "PT12M35S",
      "channel_name": "Outlier Trading",
      "description": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests\nWebpage:  https://esInvests.com",
      "content_summary": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week. Stay in touch with Erik \nTwitter   Instagram    esInvest...",
      "chunk_index": 8,
      "total_chunks": 10,
      "start_timestamp": "00:10:26",
      "start_timestamp_seconds": 626.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=626"
    }
  },
  {
    "text": "i will absolutely buy some vxx calls just to take attempt to take advantage of an uptick in volatility on the cheap so i'm gonna keep an eye for that overnight and realistically this will be one of those scenarios that i may end up playing it in my margin account via futures but i will do my best to mirror that in this account just because i think that that may provide a good opportunity to make a few bucks so all in all that's where we're at with the small stacks account as always if there's any questions or feedback anything that people want to see let me know that is the entire purpose of the channel um we'll see what the market looks like curious how the week is going to play out and we'll talk to everybody later",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "2020-11-04T17:46:00Z",
      "duration": "PT12M35S",
      "channel_name": "Outlier Trading",
      "description": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests\nWebpage:  https://esInvests.com",
      "content_summary": "I closed out my MOS trade and opened up short puts in BAC in its place. I made adjustments to KR and INTC leading into the rest of the week. Stay in touch with Erik \nTwitter   Instagram    esInvest...",
      "chunk_index": 9,
      "total_chunks": 10,
      "start_timestamp": "00:11:42",
      "start_timestamp_seconds": 702.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=702"
    }
  }
]