[
  {
    "text": "Everyone, Eric here made a handful of adjustments in the small stacks portfolio yesterday. So I'm going to share those here. And then the other thing I was actually just thinking about is kind of defining the time frame for the portfolio because although it is entertaining and educational for essentially this forum, I do not intend to do it into perpetuity just because it's not really the best use of my time for myself. So as of right now, I'm thinking of pretty much doing it for a year, which would take us till around one September of next year. But if anybody's any thoughts on that, let me know. I don't want to cut the segment short if folks are finding it helpful, but I also am thoughtful in the fact that it's helpful for folks. But like I said, not really the best use of my personal time. So we'll right now that's what I'll plan to unless you know, there's some sort of uproar or somebody has a better approach, you know, I would be receptive to it. Okay, so that part of side. Let's take a look at the portfolio. So I took down my trade in mosaic yesterday. Most of these trades were done yesterday. The reason being is just with today being election, I anticipated a bit of volatility. So pretty much across most of my portfolios, I was just closing stuff down yesterday and then planning on reestablishing, you know, minor exposure",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=0"
    }
  },
  {
    "text": "trade in mosaic yesterday. Most of these trades were done yesterday. The reason being is just with today being election, I anticipated a bit of volatility. So pretty much across most of my portfolios, I was just closing stuff down yesterday and then planning on reestablishing, you know, minor exposure yesterday. But really, I wanted to make sure I was repositioning things before we went into the election just because. I didn't know obviously which way the market was going to react. Still don't know. Right now it's 18 25 Pacific time. So we'll see. But with all that being said, I wanted to make sure that everything was kind of adjusted before today. And then we'll kind of see what things look like going forward. So figured that we would start with the macro view. So. I realize I got to move my head again. So now we'll go down here. And actually, I think we can go bottom left because the next one, this is going to be in the way. Okay, and then let me just slide this over. All right. So. For mosaic that got closed out for 59 cents yesterday. And that took in a 31 PNL. Which was about a 34 capture of premium. Overall, I still like mosaic. I didn't want to hold it through earnings. So as soon as I saw an opportunity to exit the trade yesterday, I dumped out of it. Just because I wanted to minimize my exposure to",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 10,
      "start_timestamp": "00:01:13",
      "start_timestamp_seconds": 73.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=73"
    }
  },
  {
    "text": "31 PNL. Which was about a 34 capture of premium. Overall, I still like mosaic. I didn't want to hold it through earnings. So as soon as I saw an opportunity to exit the trade yesterday, I dumped out of it. Just because I wanted to minimize my exposure to kind of the move and then the subsequent follow on follow through potential, which if we take a look at it real quick. It was a good thing. And I did that. And it's another example of why I talk about being purposeful when offering exposure. So they reported yesterday after the close. And as you can tell today, had a pretty big red day. So my intention with that trade leading into. And the reason why I didn't again is because I don't want to mess with it post earnings as it's settling out. This was not really an earnings play. Depending on the trade ran through, I was willing to hold it through earnings, but that wasn't the original disposition. So I wanted to limit that. Now in its place, I took up Bank of America. And again, yesterday, I offered the 20 know of 24 puts at 1.22. Now, this was a super advantageous trade. I was between XL left and Bank of America. And it's because they're trading right around the same level. And this is a good conversation about premium. And even though XL left was returning over a percent, which is good for an",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 10,
      "start_timestamp": "00:02:33",
      "start_timestamp_seconds": 153.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=153"
    }
  },
  {
    "text": "1.22. Now, this was a super advantageous trade. I was between XL left and Bank of America. And it's because they're trading right around the same level. And this is a good conversation about premium. And even though XL left was returning over a percent, which is good for an ETF. Bank of America was obviously returning well over that. So that's why I took my money to really where the trade was. And I was hesitant to get long here, but obviously it had a bit of a gap up today. And I'm really excited that I intend to watch very closely because it's still early in the life cycle of the trade. Otherwise, I would love to close it here, but it's really not showing any sort of meaningful profit just yet. But we'll monitor that one as we go. Really the purpose of that trade was to capture that premium. It was significant. And for the buying power that I was putting out there, it represents a really, really good return. And I'm going to look at what lowered me into that trade. And I liked adding some financial exposure. So that's why that's there. Okay. Now moving over to the diagonals. Let me take this one down and open this one up. Okay. So taking a look at these in croaker. If you'll remember from the last couple of videos. I took down the short calls. I didn't offer any new exposure. And it's just because",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 10,
      "start_timestamp": "00:04:09",
      "start_timestamp_seconds": 249.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=249"
    }
  },
  {
    "text": "moving over to the diagonals. Let me take this one down and open this one up. Okay. So taking a look at these in croaker. If you'll remember from the last couple of videos. I took down the short calls. I didn't offer any new exposure. And it's just because I was kind of waiting for a little while to see what the product did. And it was trading sideways for a little while. And then today with its recent kind of move up. I decided to offer a little bit of exposure in there. And the reason for that is I just didn't want to not be taking in premium for too long. And I offered kind of a partial here. It's still at a one to two ratio. So my upside is not capped. But I sent out the 18 December 35 calls collecting 65 cents, which is around a 30 delta. The leaps themselves right now are losing. They're definitely not where I want them to be. But it's overall still not too bad of a position. And then unrealized loss on those is about 380. Compared to the current leap. But we have 288 realize profit on the short calls. And then we still have an additional 65 out from the new outlay. If we see a little bit more of an up move. I will happily offer the second call to make this at a one to one. So I could essentially exit the entire",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 10,
      "start_timestamp": "00:05:33",
      "start_timestamp_seconds": 333.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=333"
    }
  },
  {
    "text": "on the short calls. And then we still have an additional 65 out from the new outlay. If we see a little bit more of an up move. I will happily offer the second call to make this at a one to one. So I could essentially exit the entire trade out of profit. And then we'll see what it looks like. I like scaling in with the short calls just so I can be more sensitive to price movements and kind of collect a little bit more premium. One of the opportunity presents itself. Next up is Intel. So Intel. This was another pretty simple trade. I was watching it for a little while. Simply because I was showing over a 50 max profit. I was having a lot of time for a few days since I put this thing on. And once it started hovering around here and then I started, saw it start making a little bit of an up move. That's when I wanted to make the adjustments. So I closed out the 47 calls. I sold them for 1.65. I took them down for 74 cents. And then I offered the 20 no 47 calls. And I got 56 cents for those. Now I want to offer an important note on this. I typically would not have closed those 4d 47 calls. If there was 74 dollars left on the table when I was only getting 56 dollars for the new position. Right. That essentially",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 10,
      "start_timestamp": "00:06:51",
      "start_timestamp_seconds": 411.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=411"
    }
  },
  {
    "text": "And I got 56 cents for those. Now I want to offer an important note on this. I typically would not have closed those 4d 47 calls. If there was 74 dollars left on the table when I was only getting 56 dollars for the new position. Right. That essentially means there's 20 20. A little less 18. In the position I was taking down more than what I just put on the reason why I did this is because. The early expiration 20 no. So it offers me a little more sensitivity to more recent price change. And it's a obviously as soon as you start moving closer days to expiration, your premium per day automatically increases. So it has a higher premium per day. But the real thing that I was looking for here is, although it is a slightly lower overall return. It is in in the scale of things going to give me more money per day than what I had left. And the 47s that I had before so it was a way for me to realize that profit. And then take a look at something that will. That will offer me a little more sensitivity for whatever comes next for Intel. One of those being the dividend coming out on the fifth, which will not price down again, which is another potential for me to take those calls down. At a partial profit depending on what that looks like. But we'll have to wait",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 10,
      "start_timestamp": "00:08:03",
      "start_timestamp_seconds": 483.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=483"
    }
  },
  {
    "text": "sensitivity for whatever comes next for Intel. One of those being the dividend coming out on the fifth, which will not price down again, which is another potential for me to take those calls down. At a partial profit depending on what that looks like. But we'll have to wait and see what that, what that turns out to be for us. So overall going back out to the macro somebody was asking about the net lick for the portfolio. So I don't typically track this and I don't intend to going forward, but just to answer that question. Right now it's sitting at around 5,500, which is a little bit lower obviously than the realized. I just, P and L, but you know totally okay with me. I prefer to track the realized P and L. That's what's most important to me in a portfolio like this. But nonetheless, again, wanted to answer that question. So right now it's looking like 5,500 or so. And that's mostly coming from Kruger. The leaps hurting in there. They're down almost 380. So that's where the majority of that's coming from. So right now when we look at the portfolio, utilizations at 4,800, which is around 80 utilized. We've made about 1,000 on the account, which is pretty solid return. It's 17. Since I started this on the first of September, the vast majority of profit is still coming from the diagonals. And right now there is 243 in premium out in",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 10,
      "start_timestamp": "00:09:33",
      "start_timestamp_seconds": 573.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=573"
    }
  },
  {
    "text": "4,800, which is around 80 utilized. We've made about 1,000 on the account, which is pretty solid return. It's 17. Since I started this on the first of September, the vast majority of profit is still coming from the diagonals. And right now there is 243 in premium out in the market, which would be about a 4 return on the account. Now, the last thing that I want to note is this is absolutely a time that I'm going to start looking at volatility products. As we see volatility starting to receive back leading into the election, especially if things start getting weird tomorrow, meaning, you know, we don't know who wins. That kind of thing. They're starting to recount fighting over that. As soon as I start seeing anything like that happening, I will absolutely buy some VXX calls just to take attempt to take advantage of an uptick and volatility on the cheap. So I'm going to keep an eye for that overnight. And realistically, this will be one of those scenarios that I may end up playing it in my margin account via futures. But I will do my best to mirror that in this account just because I think that that may provide a good opportunity to make a few bucks. So all in all that's what we're out with the small stacks account is always if there's any questions or feedback, anything that people want to see. Let me know that is the entire",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 10,
      "start_timestamp": "00:10:44",
      "start_timestamp_seconds": 644.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=644"
    }
  },
  {
    "text": "just because I think that that may provide a good opportunity to make a few bucks. So all in all that's what we're out with the small stacks account is always if there's any questions or feedback, anything that people want to see. Let me know that is the entire purpose of the channel. We'll see what the market looks like curious how the week is going to play out. And we'll talk to everybody later.",
    "metadata": {
      "video_id": "g2xg3_vDRaw",
      "title": "Portfolio Turnover MOS, BAC, KR, INTC - Small Stacks Pt14",
      "url": "https://www.youtube.com/watch?v=g2xg3_vDRaw",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 10,
      "start_timestamp": "00:12:05",
      "start_timestamp_seconds": 725.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g2xg3_vDRaw&t=725"
    }
  }
]