[
  {
    "text": "What's up, everyone? Welcome back to the Outlier podcast. We have our fan favorite kind of, it's like a mini green Hulk, it's like similar color, but we got Duneberg back to talk about the markets, the economy, some geopolitics probably. It's great to see you. Hey, Eric, great to be back. I bring the green. You bring the muscles. I guess between the two of us, we probably can get up one Hulk out of the two of us. You could be, wouldn't be a good looking Hulk with me in it, but you know, so we've been catching up, you know, like every quarter or so, just touching based on how things are going. And I thought it would be a really great spot to start with your current broad analysis of the US landscape, specific thinking about economy, energy, markets, any of those, if you want to dive into one surface level on another, totally cool. I just want to start with like, what are you seeing from your view? What's most interesting to you? Sure. Obviously, a lot going on. One of the challenges of being an analyst in the Trump era is the speed and violence of the news cycle. Really, every day is a new story. And much of macroeconomic analysis is really measuring flows and netting out the flows can be really challenging if there's a lot of flows, right? And so in February, our industrial context started raising alarm about recession, supply",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "violence of the news cycle. Really, every day is a new story. And much of macroeconomic analysis is really measuring flows and netting out the flows can be really challenging if there's a lot of flows, right? And so in February, our industrial context started raising alarm about recession, supply chains seizing up on just the threat of tariffs. Basically, that's a really important signal in our view. And then one of the challenges of measuring the government data, which is actually really where I was going with this, is because people are front running things, you're going to get wild measurements across multiple data, like people front running the tariffs on the Sun, you see a, sorry, imports, well, that affects the measured GDP number. Does it really reflect authentic, sustainable economic activity? Liberation day happens, shocked everybody. Trump is playing his hand. He has one card to play, which is to get as much of his agenda done as quickly as possible, ripped the bandaid off. While he still has a political capital, he needs to have the economy turning around and on the upswing by next summer. And the gamble is that a combination of tariffs, tax cuts, foreign direct investment and cheap energy prices will be enough to catalyze a manufacturing boom in the U.S. The big question is whether he can bridge between the clearly unworkable, unsustainable, old state and a disputable whether it would be workable new state, but to be fair to Trump,",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "cuts, foreign direct investment and cheap energy prices will be enough to catalyze a manufacturing boom in the U.S. The big question is whether he can bridge between the clearly unworkable, unsustainable, old state and a disputable whether it would be workable new state, but to be fair to Trump, it's exactly what he campaigned on. And he's kept his promises to a T. And so it's a fascinating thing to watch. He's tripped to the Middle East was actually quite remarkable. And in our own private investing, we're seeing the beginnings of a huge wave of interest from sovereign wealth funds to capitalize investments that have, you know, a manufacturing base or the potential for one in the U.S. And that will create a boom. It will, with all booms, there will be frauds and people who lose a lot of money and people who make fortunes. And so it's just really hard. So, but I would say on the energy side, which is what we care about the most and right about the most. Trump has declared that he wants 50 oil and he seems likely to get it. And the Saudis have seen willing to help Trump pull it off. I think it matters far less than Russia now than it would have if we had pursued that strategy three and a half years ago. But that's my sort of overall view. Energy is cheap. Money is flooding into the U.S. tariffs are a bit of a",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "pull it off. I think it matters far less than Russia now than it would have if we had pursued that strategy three and a half years ago. But that's my sort of overall view. Energy is cheap. Money is flooding into the U.S. tariffs are a bit of a mess. That's the way Trump operates. There's almost always a master plan. It's not always clear. And just as we were joking before you hit record, as fascinating and frustrating a person that you could imagine trying to cover when you're writing a newsletter with a four-day editorial cycle. As you're going through that, I literally have like six questions that I need to follow up with you on. I'll go and order the first one. You mentioned early on in that just the macro analysis that you guys do. And I imagine it's such a difficult system to accurately forecast with how many variables come in and how fast things change, especially with how everything is going today. How do you manage that? So first of all, nobody bats a thousand. You have to begin the management of that with humility. We try to communicate to our subscribers that we are lateral thinkers. You don't come to Dumburg for traditional, straight news, who but when we're a wide-fac based reporting. You come to Dumburg to be provoked. You come to Dumburg to think. And you come to Dumburg, hopefully for at least one good chocolate piece. And that's our",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "we are lateral thinkers. You don't come to Dumburg for traditional, straight news, who but when we're a wide-fac based reporting. You come to Dumburg to be provoked. You come to Dumburg to think. And you come to Dumburg, hopefully for at least one good chocolate piece. And that's our brand ambition. We will be provocative without being polarizing. We will be funny without being silly and we will teach without being self-indulgent. Lateral thinking requires that you have the ability to not have to know why a model is working and trust that it just is and then discard at the moment it's not. So for example, we made one of our best calls of all time in December. When long before, Mark Cerny was a contract you could bet on on polymarket, we predicted correctly that not only would he replace Justin Trudeau before the election, but he would be a formidable candidate against the conservatives with the help of the notoriously compliant media in Canada and lo and behold, now he's the prime minister. We came to that prediction based on a mental model that we like to use, which is just make a wild assumption and then play it forward and look at the data and evidence and see whether or not that assumption is relevant. A wild assumption that we settled upon that led to that piece in late November was that Trump wanted Cerny to be prime minister and Trump didn't like the conservative",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "then play it forward and look at the data and evidence and see whether or not that assumption is relevant. A wild assumption that we settled upon that led to that piece in late November was that Trump wanted Cerny to be prime minister and Trump didn't like the conservative candidate. And once you have that as an axiom against which you can measure the news flow and see how well it fits, we started to notice things. So once you have that as an axiom, the 51st state and governor Trudeau talk makes sense. And so that's an example. But in our business, the only thing worse in our business than being wrong is having no opinion. And one of the things that we're always very careful to do is show our homework. Here's the link. Here's why. Here's why we think that here's evidence that would prove our theory raw. And let smart intelligent investors who subscribe to Bloomberg you know use our work as an input to their grand mosaic and maybe they make an investment decision or maybe they doubt but it's their portfolio and they're smart and they're independent and they're adults and they're capable of reading things that they might sometimes disagree with. As long as it's interesting and it's not polarizing and it's not you know too soft and intelligent. I love that. I love focusing. It's almost like a little bit of a process-based focus like on like what we're talking about",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "of reading things that they might sometimes disagree with. As long as it's interesting and it's not polarizing and it's not you know too soft and intelligent. I love that. I love focusing. It's almost like a little bit of a process-based focus like on like what we're talking about what we can learn, what details can we extract, understanding the fact that it's a shifting world and coming up with like big macro views is really challenging and literally any day there can be a completely new inject that. Yes. You have everything. Carp said look we had made a call earlier in the year for example that we wrote a piece literally called the US is not broke. Then liberation day happened and through the whole economic situation into a mass and now we see the big beautiful bill is you know not exactly physically responsible. So while the US is certainly not broke even still and the core arguments of that piece hold true we're still heading towards being broke because of political choices and behaviors and so our readers might look at that and say well you got that one wrong and I would say perhaps but things change and when you publish you know 90 plus times a year like we do nobody bats a thousand so one of the things we do is about every three or six months you know once a quarter a couple times a year we'll just write a piece",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "but things change and when you publish you know 90 plus times a year like we do nobody bats a thousand so one of the things we do is about every three or six months you know once a quarter a couple times a year we'll just write a piece that looks back at five or six of our calls and you know we have a pretty good hit rate you know the ones that were clearly right the ones that were clearly wrong and ones that were more nuanced and just fast up to it. People love that I think one of the problems with the mainstream media is arrogance and there's you know confidence is an absolute measure and arrogance is a relative one and we're absolutely confident in our abilities and we're proud of our work and you know we measure ourselves against our own standard and and I think that comes through. Yeah I love that it's funny too because even more in like the trading side of the world where I exist it's the same thing right where everybody's so interested in trying to figure out who was right on this news headline and I always find it's missing the force for the trees and I like that process based each piece regardless of what ends up happening will have stuff in it that's usable that provokes thought I think that's awesome. And look in the trading world 53 is amazing right you give me",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "always find it's missing the force for the trees and I like that process based each piece regardless of what ends up happening will have stuff in it that's usable that provokes thought I think that's awesome. And look in the trading world 53 is amazing right you give me 53 success rate I'll give you the bank role management and we'll make millions and look it one of the things that is authentically true with everything we write is the moment we press sand everybody on the team 100 believes every word in that piece that's a moment in time five minutes later do information could come that radically changes our views but the moment we press sand there is not a doubt that we that is our best most informed opinion and the wonderful thing about substack in the free market in general it's every time we publish or every time we do a podcast appearance our business depends on it so if we get more things right we get more subscribers or we keep the ones that we have and if somebody happens upon this podcast and says wow I that guest was interesting let me go and sign up for free and see what this is all about well that's a pretty strong form of engagement and they're more likely to end up subscribing if somebody listens to this podcast and they hate what I say they're unlikely to pass and that's what the wonderful thing",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "and sign up for free and see what this is all about well that's a pretty strong form of engagement and they're more likely to end up subscribing if somebody listens to this podcast and they hate what I say they're unlikely to pass and that's what the wonderful thing about the markets like we are 380 pieces into this and we've lost no motivation for them whatsoever because we are we try to produce the very like very best product every time and and we wouldn't publish a piece if we weren't like I it's not quite achievable but our objective is every piece is a candidate for the best piece we've ever written I see yeah like it's like we want it to be at that level right and you know sometimes they just don't land that's fine but like there's no typos very few typos we we we do we rigorously fact check as much as we can there's nothing worse than getting a minor detail wrong and a story that collapses the credibility of the whole piece right and it happens you know but you know you get somebody's name wrong or you get a date wrong you know fact checking is actually much harder than you would think especially when you're charging people like once we turned on the paywall it just brought the business to a whole different level of responsibility for us like people are paying to consume this product and that that",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "wrong you know fact checking is actually much harder than you would think especially when you're charging people like once we turned on the paywall it just brought the business to a whole different level of responsibility for us like people are paying to consume this product and that that never leaves my mind like that we're not going to just put garbage out like people are paying for this and we're going to earn their business yeah yeah makes a lot of sense and speaking of earning business the US is trying to earn more manufacturing business what do you make of the various arguments circulating around that some saying like this is good for these reasons national security bringing jobs other people will say things like Americans don't want some of those jobs so why would we bother bringing low skill jobs back what's your opinion on I'm not sure more manufacturing on a bachelorly 100 for it Trump deserves full credit for trying to get it the US and capital markets in general do a very poor job of pricing national security risk and I think failed immigration policy has driven down the wages of such jobs to the point where Americans can't really make a living doing those jobs at least compared to their neighbors and I think Trump is mostly right on a lot of stuff I have some issue with some of Trump's tactics and some of Trump's language and some of Trump's social",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "to the point where Americans can't really make a living doing those jobs at least compared to their neighbors and I think Trump is mostly right on a lot of stuff I have some issue with some of Trump's tactics and some of Trump's language and some of Trump's social media posts but I actually don't ever doubt his authenticity and look he's all the things everybody says he is including his critics right like yes Trump University was a scam like the same person who did Trump University was just treated like a king in the Middle East and worked tirelessly to bring trillions of dollars of foreign direct investment into the United States I genuinely believe that Trump wants to catalyze a manufacturing remanisants especially in the Midwest and I live in the Midwest I've seen the devastation and the consequences of financialization and globalization firsthand participated in it when I was in corporate so I all of those things are true and also Trump coined as a scam right and I you know I don't understand the valuation of truth social I all of it is true and I think it's it's okay to say that we can measure the man holistically do I think that it is ethically dubious that Don Jr. is going around the world and you know pumping various investments and foreign investors are curing favor directly or indirectly I mean how is that radically different than Hunter Biden I don't really think",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "can measure the man holistically do I think that it is ethically dubious that Don Jr. is going around the world and you know pumping various investments and foreign investors are curing favor directly or indirectly I mean how is that radically different than Hunter Biden I don't really think it is and Trump fans will get annoyed I'm sorry if I'm going to trigger some people in your comments but but it's okay like the Washington DC is full of corrupt politicians and so at least this one seems to be trying to do things for the working people and I can tell you I live in an area where Trump held a rally about 30 miles from where I live and I decided to just drive around and get the vibe and and like because you know you do a little in-person recon right nothing like boots on the ground and eyes on and so shocking the Donald politician in the in the modern era that connects with regular people the way Trump does and your view of that depends on your view of regular people I happen to take the views of regular people seriously what is Trump saying and doing that has caused this billionaire from New York flamboyant billionaire from New York to become their champion like it don't ignore that like that's real and you know and it's it's it's too flippantly brushed aside by the sort of coastal elites and this Trump place",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "Trump saying and doing that has caused this billionaire from New York flamboyant billionaire from New York to become their champion like it don't ignore that like that's real and you know and it's it's it's too flippantly brushed aside by the sort of coastal elites and this Trump place for this all time and then the last thing I'll say Trump has a magic trick which I must say Scott Jennings on CNN is the one who opened my eyes to this trick he picks positions on really easy issues 80 20 support in the country and he takes the 80 side loudly and all the democrats who hate him so much visibly for whatever their justifications they are forced to argue the 20 position and he's just crushing them like over and over and over and over and over and over again he's just crushing them and so he's a talented person and so when you see a mania it's almost always on purpose again it's not how I operate you know my personality and Trump's personality in between the two of us is everybody else but that's fine like I'm people trying to objectively measure you know so then how does Trump is working for the average worker and trying to advocate for them and the on-shoring then of manufacturing jobs seemingly would be primarily to their benefit is that the broader is that the broader idea now everyone in Trump's mind is going to benefit rich",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "so then how does Trump is working for the average worker and trying to advocate for them and the on-shoring then of manufacturing jobs seemingly would be primarily to their benefit is that the broader is that the broader idea now everyone in Trump's mind is going to benefit rich people are going to get a really rich out of this I mean let's be honest you can't bring in a trillion dollars of foreign money without a whole bunch of people on Wall Street and executives and investors and venture capitalists and private equity firms coming out way better than they were will some of it trickle down I hope so um to your point like do people really want to do these jobs I mean I think they do many of them do I mean there's there's still a hardcore group of Americans who would like to provide for their family and are willing to do an honest days work for an honest days pay but I don't kid yourself I mean if there's one thing the sort of moneyed class of the US knows how to do is to catch money and there's an awful lot of money coming in before you'd mentioned crude oil and trying to drive oil down one of the things I've been trying to understand a little bit better is been OPEX stance on a lot of this and they've seen way more accommodating than I originally would have expected how do",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "money coming in before you'd mentioned crude oil and trying to drive oil down one of the things I've been trying to understand a little bit better is been OPEX stance on a lot of this and they've seen way more accommodating than I originally would have expected how do you view their lens on what's going on yeah we we written a couple of pieces on this and I think we've gotten this one mostly right there was a deal cut look whenever you have Russia, Saudi Arabia and the United States sitting around negotiating with each other for weeks at a time history tells us that when the three largest oil producers like that get together whatever the headline reason is for them to be meeting is as almost never really what it's all about and so for weeks we had the whole Ukraine thing talks were hosted in Saudi Arabia we believe a broader more consequential deal than just settling the war in Ukraine which of course is very consequential especially for those who live in Ukraine something else was going on back channels and I think a deal was caught who knows what was given in return we have some speculations in that regard but OPEX is suddenly doing Trump's bidding I mean let's just be honest yeah and they're masking it as though they're punishing Kazakhstan for cheating cheating has been going on in OPEX for after who we kidding a deal was cut and",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "return we have some speculations in that regard but OPEX is suddenly doing Trump's bidding I mean let's just be honest yeah and they're masking it as though they're punishing Kazakhstan for cheating cheating has been going on in OPEX for after who we kidding a deal was cut and then after all of that Trump goes to Saudi Arabia and you just watch the footage I'm sure you've seen it like there's the Middle East is changing and Trump again treated like a hero in the Middle East did you see the standing ovation he got when he announced that they were going to lift the sanctions on Syria which is a whole other ball of wax and the tsunami of cash committed to back Trump I think a lot of it has to do with they want Trump to succeed they want JD Vance to win in 28 they want what Trump is trying to do in America to work and then there's a whole broader thought around Trump's civil war with the deep state and PEPA Malgrim wrote a really fascinating piece I wish I could remember the title basically saying that he's getting the help of these countries to stare down the deep state and if you model the US as currently being in a civil war then all of this can make a lot more sense Lord knows the CIA is messed around in the Middle East for an awful long time and people are",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "these countries to stare down the deep state and if you model the US as currently being in a civil war then all of this can make a lot more sense Lord knows the CIA is messed around in the Middle East for an awful long time and people are probably pretty tired of it over there and look at what he's doing with Harvard in this regard I have to give a hat tip to Mike Benz's great work on Twitter I'm sure you follow it or you've seen it you know the the attack on Harvard which some judge just issued a temporary restraining ordination wide already hours later to Trump's move to far Harvard from accepting foreign students that's actually an attack on the intelligence community because it's just part of their giant grift so there's lots of ways we can go with that but I'm just fascinated to watch all of it like we've said so in what do you think the primary incentives would be for OPEC to want Trump and his policies to succeed well a unified Middle East buffered from outside interference and the forever wars and the war with Iran and the war in Syria if they could settle all of that and be left alone to enjoy their riches that's a prize worth suffering a few quarters of declining profits for I honestly think that there's a there's a deeper again when you look at how the you know the the",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "war in Syria if they could settle all of that and be left alone to enjoy their riches that's a prize worth suffering a few quarters of declining profits for I honestly think that there's a there's a deeper again when you look at how the you know the the dropping of the gold standard was covered in the 1970s there's no talk of the petrol dollar in the contemporary reporting of what was going on there's something going on behind the scenes we're not privy to it but it's never what it's being presented that's actually what's happening whenever you have momentous decade shape shifting type moves like we're seeing now and so my hope my suspicion is that Trump has a grand plan of settling the war in Ukraine driving peace in the Middle East and reaching day-to-day hunt with China cutting back on military spending in the long run because we don't need a trillion dollars a year and shepherding a US manufacturing renaissance with all of the assets of the Western hemisphere there for for for development and the Western hemisphere is way more than self-sufficient and I think the sort of multi-polar world that Trump envisions that is the US's sphere of influence and and I think that's the grand plan and look if he gets it done they should give him a Nobel Peace Prize three of them but we'll see lots of people in the US don't want any of those objectives to",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "envisions that is the US's sphere of influence and and I think that's the grand plan and look if he gets it done they should give him a Nobel Peace Prize three of them but we'll see lots of people in the US don't want any of those objectives to get done so why do you think that is well wars a racket and when you're in the bomb making business pieces are working capital problem and and I think much of a US foreign policy post 1970 oil embargo was shaped by the erroneous view that peak oil was real and the US was running out of it and so we went around the world in what amounts to resource force and the shell revolution has radically changed that we're more than self-sufficient we're net energy exporters we refine way more finished products than we need yes we have a mismatch between the type of oil that our refiners like to refine versus the type of oil that we are producing out of shell all that will be fixed over time with investment but by and large the US need not go abroad in search of resources anymore it has more than enough to eat at home and so that changing axiom hasn't really worked its way through the through the sort of state department diplomat class and look the the giant griff machine that is DC is very lucrative every dollar of deficit spending ends up in the",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "has more than enough to eat at home and so that changing axiom hasn't really worked its way through the through the sort of state department diplomat class and look the the giant griff machine that is DC is very lucrative every dollar of deficit spending ends up in the private sector pocket of somebody right there's a lot of conservation of mass here right like the dollars go somewhere so if you have a billion dollar jet program well there's a shareholder on the other end of that billion dollar investment and so the system was working very well for a very small number of people those are the people that are going to be the most resistant to see that system change you'd mentioned earlier touched on it quickly but I always think it's worth discussing because I think the way it's been flowing has been very different then pretty much what everybody might have thought which is the rushy crane conflict obviously Trump had talked about solving it essentially as soon as he got in and then reality comes in how do you think that's been progressing and where do you think we go forward with respect to the conflict I don't think the conflict can be solved in any other way other than militarily and the terms that Russia has been consistently laying out there have not changed and only get more aggressive with each square kilometer that the Russians occupy they would say liberate Ukrainians",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "to the conflict I don't think the conflict can be solved in any other way other than militarily and the terms that Russia has been consistently laying out there have not changed and only get more aggressive with each square kilometer that the Russians occupy they would say liberate Ukrainians would say occupy and I noticed with some interest overnight that Putin has declared that a new goal of the Russian army is to create a buffer zone in northern Ukraine in the Sumi region because of a wave of hundreds of drones that were fired at Moscow and if you have hundreds and hundreds of drones fired at Moscow well you could see with each drone launched during that strike more and more we're getting through as the sort of early anti-missile defenses were being overwhelmed and so probably I think the last reports I saw like 60 out of 500 drones or so and don't quote me but got made it into the Moscow area which is quite alarming to the Russians and it's going to provoke a response of pushing pushing further back last time I was on the show I made statements to the effect that I believe the war was lost and that it would be in Ukraine's interest to make peace and I know that that probably triggered some people because it's just not how the war is being reported in the west in the western legacy media's the strongest proof I could say",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "I believe the war was lost and that it would be in Ukraine's interest to make peace and I know that that probably triggered some people because it's just not how the war is being reported in the west in the western legacy media's the strongest proof I could say that validated my last appearance is that the winning side doesn't the demand ceasefires and which side is demanding a ceasefire right now it's the NATO side it's Ukrainian side what makes you say that the winning side doesn't demand ceasefire the winning side has no need for a ceasefire the winning side is fine to keep marching it's it's right Ukraine needs needs a positive we are and they've been very like my crown and storm have been very overt about this let's have an unconditional ceasefire no restrictions on armed supply to Ukraine we're going to fly in some British and French troops as trip wires and then we're going to army crane to the teeth and give them a better chance to fight after the ceasefire and and the Russians have openly and consistently said we're not going to play that game anymore we've been fooled by that before now again no matter what you've used our on the war I'm just telling you when you look at the area that the Russians are securing in the pace of area in May which is of course they're getting out of the muddy season and you know the",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "that before now again no matter what you've used our on the war I'm just telling you when you look at the area that the Russians are securing in the pace of area in May which is of course they're getting out of the muddy season and you know the tanks can now roll without getting stuck in the mud they're going to go all in for a military victory and absent a large appropriation from the U.S. Congress which looks very unlikely there was no talk of weapons for Ukraine in the big beautiful bill I don't know how it ends in any other way other than militarily and you know again this session they had in Istanbul was it yeah in Turkey in Istanbul I think the Russians took a tough line and and that it's not look it's the totally tragic situation it was totally avoidable Trump is is caught in a trap he I think correctly leaves that if he had won the 2020 election there would not have been a war in Ukraine and so he doesn't feel like it's his war but the U.S. is a party to the war so he can't really be a mediator because the moment the U.S. stops supplying weapons and intelligence it's going to be very difficult for Ukraine to hold back the Russian army the the heroic defense they've been able to put up has been underwritten by U.S. weapons U.S. intelligence U.S. generals and every day",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "be a mediator because the moment the U.S. stops supplying weapons and intelligence it's going to be very difficult for Ukraine to hold back the Russian army the the heroic defense they've been able to put up has been underwritten by U.S. weapons U.S. intelligence U.S. generals and every day that Trump continues to provide that which he is doing because he doesn't want to see sort of a Vietnam style collapse which is understandable then the loss of the war would be pinned on him but every day that he continues to provide those things it becomes his war and and you know losing wars is hard that's why you don't get into them so but anytime we talk about Ukraine you know we annoy some people and it is what it is but I think we've been proven mostly right on on what we've said and like the information is all there but the but you have to understand that every piece of information you're getting is propaganda and you have to have a mechanism to read everybody's propaganda and then observe developments as the unfold and go back to the sources that predicted various things and see which one was mostly right and then you sort of add more credibility weight to that source over time as they're more and more right um lasting I'll say is almost no Western media outlets and very few consumers of news in the West actually read what the Russians are",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "which one was mostly right and then you sort of add more credibility weight to that source over time as they're more and more right um lasting I'll say is almost no Western media outlets and very few consumers of news in the West actually read what the Russians are writing or listen to what they're saying to understand what their positions are um and if they did they would probably have a different view so I think it's okay to read both the Kiev independent and task the English versions of both of those and huh this event happened um this is how the Ukrainians are describing it this is how the Russians are describing it let's wait three or four days and see which side is more accurate um sometimes the Russians are blatantly peddling disinformation not my favorite word but um and sometimes the Ukrainians are spreading propaganda and sometimes it's a synthesis of the two that is probably right um so for example the whole reporting around the massive drone attack on Moscow was reported wildly differently between the Russians and Ukrainians um you see that enough times so for example if the Russians claim that every single drone was shot down and then you're seeing video footage of explosions along the path from Moscow well then you know maybe maybe that uh that Russian uh minister of defense was uh was phibbing a little bit okay you have to put that in the back of",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "every single drone was shot down and then you're seeing video footage of explosions along the path from Moscow well then you know maybe maybe that uh that Russian uh minister of defense was uh was phibbing a little bit okay you have to put that in the back of your mind um and so again it it's very hard especially with war because the closer you are to it and the more emotionally you get about it and um a motion is never good for objective analysis goodness that a better I think in it's one of those conflicts that does have a lot to it that escapes a lot of more casual observers of it um yeah every time that I I talked to some of my military friends and we're we're trying to dive deeper and deeper into it you realize how tangled really that whole region is but there's a lot of history look victor orbon of hungry correctly described this as a slowback civil war right um so I actually I care a lot about your military bodies right um and I have children of military age draft eligible um and I also have friends in other countries and I had a particularly close one from Canada during the whole trump mania and and you know the whole orange man bad stuff um aren't you worried you know how I'm not worried um and we had a text exchange you could in about Ukraine okay",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "in other countries and I had a particularly close one from Canada during the whole trump mania and and you know the whole orange man bad stuff um aren't you worried you know how I'm not worried um and we had a text exchange you could in about Ukraine okay let's guys a firefighter two kids two boys and I said um when did you begin to care about who rules the Russian speaking part of the down pass um and why do you care about it as a honest question right like and would you send your boys to go fight to decide who gets to rule the Russian speaking part of the down pass and then I said there's a war in the Congo right now this is a civil war in the Congo right now thousands and thousands of people being killed every day you never hear about it what it cares about it why don't you care about the Congo and would you send your boys to go fight in the Congo um now if you're in Russia or you're in your crane that sounds like a cold way to view the question but I'm not in Russia I'm not in Ukraine and neither you and neither your military bodies um so after 9-11 I understand why you're you're going to Afghanistan because the US was attacked like that was a little legitimate response but the Russian speaking part of the down pass is part of",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "in Russia I'm not in Ukraine and neither you and neither your military bodies um so after 9-11 I understand why you're you're going to Afghanistan because the US was attacked like that was a little legitimate response but the Russian speaking part of the down pass is part of some broader geopolitical game that the Europeans care much more about than we do I don't know I just don't get too excited about um it there's no it's existential to Russia it's obviously existential to Ukraine um it's geopolitically important to the US to weaken Russia I guess um I don't I just when you read enough history and you do it we do it's hard not to get cynical openly confess to being cynical um I'm on a basherly isolationist I think the Department of Defense should not be misconstrued as the Department of Proactive Offense I think the US has amazing resources economic potential two oceans buffering us from hostilities nobody would ever dare attack us um every home in the country has guns in it good luck occupying it we're capable of defending ourselves let the let Europe defend Europe that's sort of my view and I know you know some people are going to be reacting negatively to that but I think there's a lot more people like if you go to the back to the Joe six back and white people one of the reasons why Trump was so popular because he had no",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "I know you know some people are going to be reacting negatively to that but I think there's a lot more people like if you go to the back to the Joe six back and white people one of the reasons why Trump was so popular because he had no wars and he ran on that there were no new wars started on a Trump he's proud of that he correctly says there would not have been a war in Ukraine if he had won in 2020 who has the war in Ukraine benefited not Ukraine arguably not the Russian soldiers who were dying certainly not the foreign mercenaries who there um who the Russians are treating as though they don't have you know um the standards of rights um and they're killing them on spot um it's a mass disaster worst bad wars terrible wars should be avoided you need a strong military as a deterrent but you don't deter by proactively getting entangled overseas in my view that's just my view it's fascinating it really is really interesting to learn the the broader thought process behind the isolationist position and whatnot um and it's interesting it really is interesting to me that a big thing you learn in the military are things like we call defense and depth and layering so it's really interesting to like to think about those two right like how how far is depth in the the global scale and obviously for the US",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "interesting to me that a big thing you learn in the military are things like we call defense and depth and layering so it's really interesting to like to think about those two right like how how far is depth in the the global scale and obviously for the US it's global oceans yeah but but okay but if you're Russia so let's just let's do the analogy um Chinese gangs have set up shop in Mexico and are firing drones that are approaching Washington DC how would the US respond to that now Ukraine's would say well they invaded Mexico in your scenario and you know they're just fighting for their sovereignty and all that's fine and true and and justifiable but um the latest situation in Indian Pakistan is a great example like JD Vance had the correct take on it we would like to avoid civil war but we don't care about this war to send American troops are to get involved in the military right um there's always conflict in the world the world is a ugly dangerous violent place as you probably know way better than me vis-visually um establish a high trust society at home and protect it we have we have two oceans talk about layers um you know if China takes Taiwan does that really meaningfully change your life that that's a civil war from the 40s still being fought I mean when you get entangled in four defiers that the the",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "home and protect it we have we have two oceans talk about layers um you know if China takes Taiwan does that really meaningfully change your life that that's a civil war from the 40s still being fought I mean when you get entangled in four defiers that the the founding fathers had this right and um we're putting a piece out on on Tuesday uh on Estonia and the whole situation in a Gulf of Finland and the pieces called tripwire Estonia is a country of 1.4 million people it might come as a surprise to the small subset of the three hundred thirty five million Americans listening to this podcast that you and I have an article five obligation to defend Estonia um and Estonia is using a small subset of its eight navy ships in total to try to board and otherwise um seize tankers containing Russian oil that is flowing through the easy in the Gulf of Finland and um we're really going to go to war because Estonia got you know a fighter jet a Russian fighter jet buzz the situation and that caused the Estonian navy to beat a hasty retreat um but there's pure escalation going on right now amongst the European quote-unquote allies that is designed to trigger an article five inserted and rope the US into a broader conflict with Russia is that is that okay is is that normal Estonia is like three quarters of the size of West Virginia",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "pure escalation going on right now amongst the European quote-unquote allies that is designed to trigger an article five inserted and rope the US into a broader conflict with Russia is that is that okay is is that normal Estonia is like three quarters of the size of West Virginia has 1.4 million people in it and the US because of NATO expansion has um agreed that if Estonia is attacked it will go to war on behalf of Estonia um I don't think many Americans know that the the George Washington famously warned about foreign entanglements and Thomas Jefferson did the same and we quote both of their cautions in the peace um secure the homeland engaging commerce invest in a high trust society um education good jobs prosperity cheap energy the things that Trump talks about whether he gets them whether he means it that's why he's popular it's not the rich people who fight the wars right I mean it so uh yeah yes am I solutionist I don't know there is a dude I saw on the barracks that had a Lamborghini so his parents were pretty rich they must have been pissed at him it was it was one of the funniest things I've seen in my entire life because like the the enlisted Marines when they're junior they have to be in the barracks and they have all the stuff right that you have to have and the dudes like trying to figure out",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "was it was one of the funniest things I've seen in my entire life because like the the enlisted Marines when they're junior they have to be in the barracks and they have all the stuff right that you have to have and the dudes like trying to figure out how to put his kit like in a Lamborghini to take to go drive where you have to go to like start a hike you should have fair I want to put this pack because it doesn't fit the trunk he's currently the exception that proves the rule very much that he was so memorable shows you how rare he was oh it's so comical um now you you were talking a little bit earlier about energy cheap energy we know you and I have to spend a while talking about nuclear power how important that is to this obviously Trump has come out recently with some updates on his policies towards nuclear energy what do you think of those yeah we're waiting for the formal executive orders that could drop any minute and might even drop before you publish this podcast we wrote a piece yesterday called extra-area examinations where um reading the team that he says we try to do we believe that what's going to happen is that the US military is going to be leveraged to circumvent civilian obstacles to the deployment of nuclear reactors to power artificial intelligence data centers I think you're going to",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "where um reading the team that he says we try to do we believe that what's going to happen is that the US military is going to be leveraged to circumvent civilian obstacles to the deployment of nuclear reactors to power artificial intelligence data centers I think you're going to see Google and Facebook and Nvidia setting up on military campuses leveraging the you know defense production powers act or whatever it's called and basically stripping the energy of the ability to block and peat or otherwise veto the development of safe nuclear power while Trump sets about the task of gutting the energy and rebuilding it back in his image and I think he and Chris Wright and Doug Burgham and the whole American energy dominance committee knows inherently that the NRC has been the log jam and we talked about why that isn't that piece we can get into it if you'd like but to cut the Gordian knot Pete Hegsett is going to unstick US nuclear energy and if you told me when we started doing Burke that my favorite Fox and Friends weekend host was going to be the catalyst for unsticking US nuclear energy I could hardly have believed you but to be fair and to be clear I have great respect for Pete Hegsett I think he has done his tours of duty he's an American hero he's a smart intelligent handsome intelligent you know looks great on TV all the things Trump likes",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "could hardly have believed you but to be fair and to be clear I have great respect for Pete Hegsett I think he has done his tours of duty he's an American hero he's a smart intelligent handsome intelligent you know looks great on TV all the things Trump likes and and if he can do it God bless him he he will have carved out a legacy far superior to his predecessors so I do think it is shameful how Hegsett's military service is minimized and his lack of quote-unquote qualifications for the job by the traditional elite measurements is continuously highlighted by those who oppose him or oppose Trump and you only need look at how the troops respond to him when he works out with them in the morning to get a true understanding of the leadership potential of Pete Hegsett it's really interesting because the military is an institution that obviously highly values hierarchy but one of the largest complaints you'll hear from military members is often how that hierarchy just slows everything down you would snail space in terms of innovating trying new ideas so yes the bureaucracy chokes out innovation and there's no bigger bureaucracy than the Pentagon I can only tell like Bloomberg is a very small team you can count the contributing members of Bloomberg on one hand with multiple fingers left over and we joking turnly that we hired 10 people we'd be 50 as productive in total because you spend",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "bureaucracy than the Pentagon I can only tell like Bloomberg is a very small team you can count the contributing members of Bloomberg on one hand with multiple fingers left over and we joking turnly that we hired 10 people we'd be 50 as productive in total because you spend all your time managing the 10 people like it's it's okay to just do things yourself hey like just go and do don't ask don't the last thing you want to do is get an opinion of a lawyer right like lawyers advise and leaders decide go like point pull the trigger like this is why by the way like I've never been in the military I read a lot of military history and I have a lot of respect for people I've been in the matter I'm pushing power to the field commander level is always better than headquarters right and so like the lowest rank and when I was an executive I always try to do this when I was leading large teams and you have what's called spanner control like so as I'm sure you know very similar in corporate world as to the military except as less less death um how many people can a manager actually manage and how many layers between you and the field and all of my conversations with my leaders as I grew up the corporate chain was um here's your accountability here's your control let's start by describing both of",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "less less death um how many people can a manager actually manage and how many layers between you and the field and all of my conversations with my leaders as I grew up the corporate chain was um here's your accountability here's your control let's start by describing both of those and make sure that there's no mismatch because there's nothing worse than having more accountability than you have control because you can't complete the mission and if you have more control then you have accountability that's not so good either so my goal was always clear goal writing and matching accountability with control you have the authority to hire to fire to promote to develop um but this is the substance decisions I need to be consulted on it's a classic racey chart responsible accountable consultant informed and if you spell that out and you have good leaders and you trust them and their success is theirs and their failures are ours and if you know that your leadership has that mindset then they will do wonders for you it's got to be the same thing in the military I'm sure this is very familiar to you when you have to go back to the Pentagon for every decision and you see the consequences of that decision is not just money lost it's your friend died that's very bittering I would assume um and so you know I think back to Hegseth like the way in which he was",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "have to go back to the Pentagon for every decision and you see the consequences of that decision is not just money lost it's your friend died that's very bittering I would assume um and so you know I think back to Hegseth like the way in which he was treated after being nominated was shameful I feel like it's the standard thing right everybody's trying to figure out what they can try to poke holes in no matter what the resume is so standard yeah but you know they didn't do that to Rubio because he's a senator and he's a member of the club so I he's not always that way you know going back to energy what's something that you would consider to be like a current state under appreciated risk with respect to just the energy supply chain risk to supply or risk to price because they're the opposite side I would say to the supply chain to the actual provision yeah more than at least obviously but that's widely appreciated um I think terrorism against choke points a well-informed bad actor could you significant damage to the global economy with a very very small repertoire of weapons I'm guessing that almost nobody listening to this podcast has ever heard of the words rostinura before probably you haven't I definitely have not yeah rostinura is home to the world's most important energy production site tiny island of Qatar Qatar produces you know an enormous amount of",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "of weapons I'm guessing that almost nobody listening to this podcast has ever heard of the words rostinura before probably you haven't I definitely have not yeah rostinura is home to the world's most important energy production site tiny island of Qatar Qatar produces you know an enormous amount of natural gas that ends up on ships most of it and is fed to places like Japan Korea Europe now and it's a very small area in the middle of the Middle East well within the hoothe he's range and it wouldn't take much in the way of a concerted effort to destroy that facility to disrupt the global economy there's two pipelines that connect russia to turkey that russia has accused and I think turkey has quietly agreed Ukraine has been trying to blow up you know the Nord Stream pipeline I think was a catastrophe exploding that pipeline was a disaster because it normalizes the wanthen destruction of critical energy infrastructure and once we go down that road a lot of ugly outcomes so all the land pipelines connecting russia to europe no longer flow gas and Nord Stream no longer flows gas and three of the four pipelines are blown up there are two large pipelines that connect russia to turkey that then go on to feed gas to places like hungry and Slovakia and Italy and broader Europe and if we wake up one day and you hear that either Turk stream or blue stream has",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "pipelines are blown up there are two large pipelines that connect russia to turkey that then go on to feed gas to places like hungry and Slovakia and Italy and broader Europe and if we wake up one day and you hear that either Turk stream or blue stream has been damaged or destroyed in a terrorist attack all bets are off the thing about energy is you gain efficiency at scale and scale necessarily means concentration and you have concentrated risks and so I think terrorism is it look could happen in the US you know free port lng had a mysterious explosion shortly after the whole Nord Stream affair and there was a lot of rumors that maybe this was you know russian cyber attack that you know who knows back to propaganda disinformation you start taking out lng export terminals suddenly you're going to flood the US with lng and sorry with natural gas and it's going to stint all production and all kinds of issues and so that's a big risk I think the long term consequences of the Nord Stream attack hold the potential to be severe and when countries get desperate and look you're creating this desperate understandably so losing wars as art if it's ex-extential you willing to do anything and so there was an attack on the Turk stream one of the Turk stream compressor stations that apparently the Russian air defenses have managed to knock out if that attack had been",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "creating this desperate understandably so losing wars as art if it's ex-extential you willing to do anything and so there was an attack on the Turk stream one of the Turk stream compressor stations that apparently the Russian air defenses have managed to knock out if that attack had been successful ironically the Europeans would have been in a world of hurt now summertime the risk is a little bit less you see that pipeline go out in November it's a whole different story this is probably a pretty ignorant question but I'm curious about it in the world of nuclear power adoption what kind of role do you think AI I think is a little easier to wrap your arms around the potential impact but what about something like quantum computing which is a little further off is there any tie-ins from your lens with respect to those two systems and how I can impact I'm mostly thinking nuclear but maybe energy more broadly so the cutting edge of computing the very cutting edge of computing while it's being developed doesn't actually need that much energy and is willing to pay effectively anything for it so I don't think that the development of quantum computing is is tied to a world lot of nuclear energy for example by I think AI will certainly help the development of quantum computing and AI is about to transform I mean everything a really scary piece today on a sub-sack I read friend",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "that the development of quantum computing is is tied to a world lot of nuclear energy for example by I think AI will certainly help the development of quantum computing and AI is about to transform I mean everything a really scary piece today on a sub-sack I read friend of mine authors at Algato Algato motto he wrote a piece about how the internet is going to be unusable in a year right and I don't want to take a quantum computing question and turn it into the internet's going to be unusable in a year but it's what I'm thinking about today right and so you know AI in general is a derivative of energy and AI like what we're seeing now is not the cutting edge of research of AI it's just being deployed it's very cutting edge compared to standard computing I'm a firm believer I'm participating in the private markets I'm sold but to the specific question I mean quantum computing research is real it's being pursued the Chinese are just as far advanced if not further than we are and it occurs well it's going to be proven right what do you think of the other way do you think that there's an impact that the advancement of AI and or quantum computing can have on the future of energy yeah in the short term it is bullish for demand and in the intermediate term it's bullish for supply but there is going to",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "the other way do you think that there's an impact that the advancement of AI and or quantum computing can have on the future of energy yeah in the short term it is bullish for demand and in the intermediate term it's bullish for supply but there is going to be a gap and I happen to interview a CEO of a nuclear startup for a private meeting at the request of a friend which I'm always happy to do and he was telling me about the demand forecast just in Texas they need another grid in the next eight years and they have no track record of materially growing the grid what did you help me I don't understand the scale of that it sounds big but I don't know how to like yeah so if they have 80 giga watts of installed capacity today they need 200 oh I see okay to meet to meet future demand just unbelievable numbers right to the point where you're going to run out of gas turbines and there's the shorts of those and you're going to run out of transformers and those are shorts of those and this is why we believe that a piece we wrote last year will prove prescient the piece was called irreconcilable differences where we predicted that AI is incompatible with the grid why the grid is useful to society incredibly so but only if it's at least three nines reliable and cheap you can't put",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "believe that a piece we wrote last year will prove prescient the piece was called irreconcilable differences where we predicted that AI is incompatible with the grid why the grid is useful to society incredibly so but only if it's at least three nines reliable and cheap you can't put AI into the existing culture and architecture that we use to build maintain and manage the grid and succeed with the speed that AI demands without radically driving the price higher which crushes everybody in society especially Joe six pack so this is why I think distributed SMRs natural gas goes in one side data comes out the other fission happens on one side of the building and data comes out the other is the solution where you don't have to worry about grid connections you aren't creating demand because like these companies will pay way more than you and I like to pay or industry likes to pay for its electricity and we need you and I and we need industry because ultimately AI supposed to be in service of us and not the other way around so I think that's the trend doesn't mean that the friction of the transition from where we are on you know the direction we're on today to that realization isn't going to be let's say interesting I know that we're at time I want more question if you have a moment sure yeah awesome I'll keep it quick when we're looking out",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "the transition from where we are on you know the direction we're on today to that realization isn't going to be let's say interesting I know that we're at time I want more question if you have a moment sure yeah awesome I'll keep it quick when we're looking out over the rest of the year and you're thinking of the interplay of literally everything that's going on today like if you were to pick two or three primary themes you're most most interested in the remainder of the year what are those yeah um trumps response to Russia's continuation of the war in Ukraine um whether trump falls into the trap of going to war in Iran and whether trump can achieve a a datat with China over the Taiwan issue and if he um succeeds in avoiding escalation um especially in the last two um he will be a pretty consequential president in my view um and I think you know trump is kind of like the last person I spoke to kind of guy like if you get trump he's gonna he's a people person he's very high EQ right um and so he just spent a lot of time in the Middle East and got noticed that he didn't stop in Israel which was interesting um so that that's what I'm watching um if if we go to war in Iran I think it'll sink his presidency I think he knows that intuitively there's a lot",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "lot of time in the Middle East and got noticed that he didn't stop in Israel which was interesting um so that that's what I'm watching um if if we go to war in Iran I think it'll sink his presidency I think he knows that intuitively there's a lot of people in Washington want to go to war in Iran and many of them work in his administration um so you know Russia Ukraine is sort of it is Biden's war and trump's at least trying to end it and you could plausibly say that it wasn't really his fault um but if Iran happens that's him and if China happens that's him and war is always a failure of diplomacy and it would be trump's failures and so um I quite literally pray that he he navigates the situations and avoids conflict really interesting um very last one I promise if you were to attach a probability to those different outcomes how are you weighing the odds uh odds are that trump's gonna walk away from Ukraine uh and the the narrative will be the sort of classic stab in the back narrative and it'll be trump's fault that green collapse and if only we hit we the US had you know ship more weapons or give more intelligence or held on longer the Russian economy would have collapsed and history will decide all of that I think trump is pretty fed up with that whole situation and",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "that green collapse and if only we hit we the US had you know ship more weapons or give more intelligence or held on longer the Russian economy would have collapsed and history will decide all of that I think trump is pretty fed up with that whole situation and wants to wash hands of it I give it um 80 20 cuts of deal with Iran and and 60 40 cuts of deal with China that's my just got you know you asked me a question on my feet that's my gut yeah of course we'll get it on polymarket and then we'll see how it goes as always it's honestly so fun hanging out chatting with you thank you for sharing your thoughts and thank you for just sharing stuff for people to noodle right like we talked about before the the podcast the the goal isn't to say things that people like or dislike it's to talk about things as they are and then let people noodle on it right and think and then admit and when you're wrong yeah and look I mean if we wanted to create a clickbait newsletter I know how to do that it's not what we're in for so I always appreciate our conversations they're serious or intellectual they're stimulating and um always look forward to coming back on and always happy to see um requested you so hit our inbox beautiful well thank you for hanging out yep see",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  },
  {
    "text": "that it's not what we're in for so I always appreciate our conversations they're serious or intellectual they're stimulating and um always look forward to coming back on and always happy to see um requested you so hit our inbox beautiful well thank you for hanging out yep see",
    "metadata": {
      "video_id": "g_AN2fWZiVI",
      "title": "Doomberg - Is the Economy About to Change Big Time? | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=g_AN2fWZiVI",
      "upload_date": "",
      "duration": 3610.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 49,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=g_AN2fWZiVI&t=0"
    }
  }
]