[
  {
    "text": "What's up everyone? Happy Monday. We're going to take a look at the GameStop options chain. Couple of things going on. Nothing really jumping out of me just yet. It seems we're vastly kind of in this consolidation phase. But before we get too far into that, just a couple of announcements. The first one is if you haven't seen this video with Ian on James Lee's channel, it's very good. And I really like the way that he breaks down a lot of the totality of the story. It's a very simple concept. So if you haven't had a chance to listen to this, I think it's worth worth the listen. It's like 15 minutes. The other one that I actually think you need to watch is Newton's new video. And it's not just because he has some super sick hair that's on fleek with Snorlax behind him. It's because he talks a little bit towards the end of this video about the swaps. This is important. And I actually think that this is something I've been doing more research on myself. So it's funny timing that he was talking about it here because it talks about the positions that we think some of these different actors and entities might be in. And then the way that they need to move about these positions with respect to GameStop price. So absolutely worth checking this out. All right. That aside. And the actually the last thing is this Saturday, same",
    "metadata": {
      "video_id": "G_XvH7Khulc",
      "title": "GME Options Update",
      "url": "https://www.youtube.com/watch?v=G_XvH7Khulc",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=G_XvH7Khulc&t=0"
    }
  },
  {
    "text": "that we think some of these different actors and entities might be in. And then the way that they need to move about these positions with respect to GameStop price. So absolutely worth checking this out. All right. That aside. And the actually the last thing is this Saturday, same time, same place, 1700 Pacific time. He and I are going to do another live stream so that we can go even further into detail. This past weekend was a really great introduction. I had a hard stop. So we didn't get to go super far into the weeds on things. So the goal for this next one is to spend a lot more time looking at the details and then also setting a little time to active analysis. Right? Like see how this story is actively playing out. There's so much history that has to get gone through in order to level set everybody. So we got a good bit of that done last weekend. And yeah, I'm looking forward to connecting with him again. I learned literally a ton. It is a great time being able to kind of be a part of this with you guys. All right. Over to the GameStop. As I've said, consolidation. That's really the main thing I'm seeing here. We hit a swing low on the first of July. And the low here is 2231. And we've kind of just been in this 2227 and a half range. And the one thing",
    "metadata": {
      "video_id": "G_XvH7Khulc",
      "title": "GME Options Update",
      "url": "https://www.youtube.com/watch?v=G_XvH7Khulc",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 11,
      "start_timestamp": "00:01:35",
      "start_timestamp_seconds": 95.0909090909091,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=G_XvH7Khulc&t=95"
    }
  },
  {
    "text": "right. Over to the GameStop. As I've said, consolidation. That's really the main thing I'm seeing here. We hit a swing low on the first of July. And the low here is 2231. And we've kind of just been in this 2227 and a half range. And the one thing I do notice though is that we are up trending slightly. Even more interestingly as this, we have pretty light volume. I'll get myself out of the way. We've pretty light volume in here. However, even though the majority of this volume actually is cell volume for both of these days, notice what price is doing. Not going down. It's actually going up a little bit. That's anomalous. That's abnormal. And there's a lot of reasons why that can happen. But this could be a kind of the start of a new catalyst is what I'm seeing here. When you see volume dying off this much with something like GameStop that you know in general, people try to short this into oblivion. The fact that even after we had that share offering and price didn't plummet, the fact that now we still have really light relative volume that's mostly cell volume and prices still not going down. Very interesting to me. So this is the kind of thing I would keep a really close eye on. I actually have another alert and scan set up specifically around a little, a lot of different volume conditions in GameStop. And this is",
    "metadata": {
      "video_id": "G_XvH7Khulc",
      "title": "GME Options Update",
      "url": "https://www.youtube.com/watch?v=G_XvH7Khulc",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 11,
      "start_timestamp": "00:03:10",
      "start_timestamp_seconds": 190.1818181818182,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=G_XvH7Khulc&t=190"
    }
  },
  {
    "text": "volume and prices still not going down. Very interesting to me. So this is the kind of thing I would keep a really close eye on. I actually have another alert and scan set up specifically around a little, a lot of different volume conditions in GameStop. And this is one of them I'm paying very close attention to right now. Let's take a look at the options. All right. First things first, the expiration volatility is very low. This is some of the lowest that we've seen since I've started looking at this about a month ago, kind of very regularly with you guys. And I find that curious, especially from where we ended last week with a little bit of an expansion of volatility leading into a holiday week, which is also not normal. A lot of things not normal here. So yeah, I thought that was interesting. I'm going to skip the ball thing for now and I want to talk to you about the open interest first. So after we had the last option expiration cycle, op-x on last week, we know a residual call OI of 750,000 calls versus 456 K puts. Very heavy call volume still. And if we take a look at where they're centered, most of them are actually in 19 July, not 12 July, which is again, slightly anomalous because the vast majority of OI that I've seen so far has been in the near term expiration, even if that near",
    "metadata": {
      "video_id": "G_XvH7Khulc",
      "title": "GME Options Update",
      "url": "https://www.youtube.com/watch?v=G_XvH7Khulc",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 11,
      "start_timestamp": "00:04:45",
      "start_timestamp_seconds": 285.27272727272725,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=G_XvH7Khulc&t=285"
    }
  },
  {
    "text": "volume still. And if we take a look at where they're centered, most of them are actually in 19 July, not 12 July, which is again, slightly anomalous because the vast majority of OI that I've seen so far has been in the near term expiration, even if that near term expiration happens to be a weekly. Now again, in normal options world, you would expect the majority of OI and volume to happen in these monthly expiration cycles because they're more liquid. Now, if we take a look at the volume though, notice what happens here? There's way more of these blue dots, which I guess they're rectangles, not so much dots. I do know my shapes. The 12 July cycle though is much more prevalent here as compared to the 19 July cycle, which again are the purple squares. Now, what does that mean to me? Well, it means that people are really speculating in these very short term time frames. That's with the guys of trying to maximize exposure to some degree to a near term event. That's the only reason why you would come all the way in here and trade and stuff that's for DTE as compared to going a little further out is that you expect something imminently. Now, when we look at the relative volume between those two series, 12 July saw 88,000 calls versus 19 July, which is 41,000 calls. So still, there's calls skew on both of these relatives to the",
    "metadata": {
      "video_id": "G_XvH7Khulc",
      "title": "GME Options Update",
      "url": "https://www.youtube.com/watch?v=G_XvH7Khulc",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 11,
      "start_timestamp": "00:06:20",
      "start_timestamp_seconds": 380.3636363636364,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=G_XvH7Khulc&t=380"
    }
  },
  {
    "text": "as compared to going a little further out is that you expect something imminently. Now, when we look at the relative volume between those two series, 12 July saw 88,000 calls versus 19 July, which is 41,000 calls. So still, there's calls skew on both of these relatives to the put side, but there's definitely more activity in these 12 Julys, even though the majority of OI still falls in this 19 July cycle with 270,000 calls versus 100,000 calls. So people are playing the short term, but there is a building and growing position out in the next expiration cycle here in 19 July. Now, a quick stroll through TNS shows a few things. I have this limited to calls and I have this limited to things that are at least 50 contracts above. And right now, I'm specifically looking at, put my head here, 12 July and 19 July, these front two explorations. I guess we could add 16 August if we want just for the next primary expiration. And what do we see? Well, there's a good bit of activity, both in 12 and 19 July at the 25 and 30s. I see that all the way through when I kind of scroll through this larger data set. Now, the other thing a couple of people have said that this is a little difficult to use, which I get, my eyes are kind of trained to it, but I also have it pulled up here on unusual",
    "metadata": {
      "video_id": "G_XvH7Khulc",
      "title": "GME Options Update",
      "url": "https://www.youtube.com/watch?v=G_XvH7Khulc",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 11,
      "start_timestamp": "00:07:55",
      "start_timestamp_seconds": 475.45454545454544,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=G_XvH7Khulc&t=475"
    }
  },
  {
    "text": "through when I kind of scroll through this larger data set. Now, the other thing a couple of people have said that this is a little difficult to use, which I get, my eyes are kind of trained to it, but I also have it pulled up here on unusual whales. So this is looking at just for July. Now, for unusual whales, you have to be careful because what we don't want is stuff that's tied into a multiple like option strategies, like spreads, vertical stuff like that. It doesn't really matter for us. So let's limit this then to kind of these front expiration cycles and see what's going on coming up. I have this limited to premium being at least 15,000, which I actually argue is still very, very small. But I'm using that to see if there's anybody building consistent positions over multiple time frames. And there's some of that, but not much. So what I mean by that is like, if you look at these blocks in here, these 30 calls get hit a few times at similar size as 24 25 K. And they're not necessarily, you know, spread across weeks. It's kind of like a day over day sort of movement. But yeah, it's not necessarily like a massive position being built. These big positions up here, then 198 K, the 140 K, they're part of more legs, which means it off set risks, offsets risk. I'm not as interested in those positions.",
    "metadata": {
      "video_id": "G_XvH7Khulc",
      "title": "GME Options Update",
      "url": "https://www.youtube.com/watch?v=G_XvH7Khulc",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 11,
      "start_timestamp": "00:09:30",
      "start_timestamp_seconds": 570.5454545454545,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=G_XvH7Khulc&t=570"
    }
  },
  {
    "text": "like a day over day sort of movement. But yeah, it's not necessarily like a massive position being built. These big positions up here, then 198 K, the 140 K, they're part of more legs, which means it off set risks, offsets risk. I'm not as interested in those positions. I'm interested in things that display conviction in a direction, which is essentially buying calls near the offer or above. That's what I care about. So the tens, what, there's 56 of the tens. So these are in the money for this coming week. That's 80,000 position. That's not a small position. And this is one that I'm keeping an eye on to see if there's any subsequent build out in it. But so far, it's relatively quiet beyond what we saw here. So if we take a look at 0633, I think this is specific time. It is specific time. We had this first tranche go through, then at 0630, I'm sorry, this 0630, this was the first one. This was the second one. My expectation is that this is probably the same entity buying these. And that's primarily because it's very specific, very close to one another. This is typically how you would phase into a position. You'd get a feel for what the market is. And then you would try to scale in the rest of the way. Then we see it again down here at 0640, 0633. There's 26 of them at the 10. So again,",
    "metadata": {
      "video_id": "G_XvH7Khulc",
      "title": "GME Options Update",
      "url": "https://www.youtube.com/watch?v=G_XvH7Khulc",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 11,
      "start_timestamp": "00:11:05",
      "start_timestamp_seconds": 665.6363636363636,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=G_XvH7Khulc&t=665"
    }
  },
  {
    "text": "is typically how you would phase into a position. You'd get a feel for what the market is. And then you would try to scale in the rest of the way. Then we see it again down here at 0640, 0633. There's 26 of them at the 10. So again, like if you just kind of add the numbers up on these, they start to build a not insignificant position. There's more here at the 10 0630. And I think that's mostly what I saw. Yeah. So let's take a look. I want to sort this by time really quick. And we can take a look at those 10s. This is exactly what I'm talking about. See, there's a bunch of these blocks like right next to one another. There's 0630, 06 twice for 43 and 26. Then there's these two 0630s at 46. Again, like the and these are all direct trades, right? They're not part of a spread. These are very interesting to me because this is not a small cumulative position. So let's take a look really quick at the 12 July 10s, which are all the way in here. Super deep in the money. And interestingly enough, this accounts, there's 160 volume in there today. And if we go back to these transactions, I think this is like 150. So this person, whoever this is, is building out the majority of that position. And again, this is not in insignificant position. This is over 200,000, essentially",
    "metadata": {
      "video_id": "G_XvH7Khulc",
      "title": "GME Options Update",
      "url": "https://www.youtube.com/watch?v=G_XvH7Khulc",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 11,
      "start_timestamp": "00:12:40",
      "start_timestamp_seconds": 760.7272727272727,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=G_XvH7Khulc&t=760"
    }
  },
  {
    "text": "enough, this accounts, there's 160 volume in there today. And if we go back to these transactions, I think this is like 150. So this person, whoever this is, is building out the majority of that position. And again, this is not in insignificant position. This is over 200,000, essentially in total. So that's something to keep an eye on. That is not being put on with anything other than the expectation of an upmove. Is that somebody like we're in kitty. It's hard to say. It seems like a little bit of a smaller position to him, but this is somebody with 200,000. So it's also probably somebody that I would imagine to be fairly informed also because they went so deep in the money. They want leveraged deltas. That's what that is. That's why they're using essentially one delta options. There's very little extrinsic value to bleed away. And this is a directional play to the upside. So this is a big position being built out here at the tens to keep an eye on. That is mostly what I see in here. When I took a look at the volume and the volatility smile, the volume is interesting. The volatility smiles also fairly interesting because we have some of these kinks. But the put side is still trending way higher than the call side in both near term series, which is what we have seen as of late. So this isn't messaging to me any excessive vol",
    "metadata": {
      "video_id": "G_XvH7Khulc",
      "title": "GME Options Update",
      "url": "https://www.youtube.com/watch?v=G_XvH7Khulc",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 11,
      "start_timestamp": "00:14:15",
      "start_timestamp_seconds": 855.8181818181819,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=G_XvH7Khulc&t=855"
    }
  },
  {
    "text": "interesting. The volatility smiles also fairly interesting because we have some of these kinks. But the put side is still trending way higher than the call side in both near term series, which is what we have seen as of late. So this isn't messaging to me any excessive vol pricing on the call side, factoring and some sort of expectation of upside move. This is standard puts you in terms of vol on the volatility smiles. So as always, if you have any questions, let me know. Keep an eye ball on these 12 July tens because there's somebody building a sneakingly pretty large position in there. Be an outlier. See you guys later.",
    "metadata": {
      "video_id": "G_XvH7Khulc",
      "title": "GME Options Update",
      "url": "https://www.youtube.com/watch?v=G_XvH7Khulc",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 11,
      "start_timestamp": "00:15:50",
      "start_timestamp_seconds": 950.9090909090909,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=G_XvH7Khulc&t=950"
    }
  }
]