[
  {
    "video_id": "gN5HeErLFMk",
    "title": "gN5HeErLFMk",
    "url": "https://www.youtube.com/watch?v=gN5HeErLFMk",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 2,
    "text": "What's up outliers? Welcome back to Outlier Options Trading Quick Tips. We've learned something new in three minutes or less today. We are talking about Tango in backwardation. Now this is simply a way to visualize volatility across different expiration cycles. Now I'm using VIX futures because there's a really clean plot like this that I help illustrate the point. However, this applies to any options chain because as you know, options chains each have their own implied volatility is and obviously they represent different durations. So using VIX futures, we can see that the current cycle here, which is the April 25, we can see that volatility here is currently priced at 25 or so. And we can take a look at the next cycle, which is out in May. And you can see it's down here at 2035. So this represents backwardation. Hypically speaking, we expect to see future options or future explorations with slightly higher volatility than front. So typically speaking, this relationship that you see between August and September, this is called Kintango. And this is normal. And Tango is where the longer dated cycle has higher volatility price than to it than the near dated cycle. And more often than not, you'll see this kind of relationship where the line generally will slope up into the right. However, during periods like now, where volatility is actually quite elevated compared to what volatility is expected to be slightly further out in time, this is when you'll",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=gN5HeErLFMk&t=0"
  },
  {
    "video_id": "gN5HeErLFMk",
    "title": "gN5HeErLFMk",
    "url": "https://www.youtube.com/watch?v=gN5HeErLFMk",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 2,
    "text": "cycle. And more often than not, you'll see this kind of relationship where the line generally will slope up into the right. However, during periods like now, where volatility is actually quite elevated compared to what volatility is expected to be slightly further out in time, this is when you'll see the front volatility or spot volatility being priced more richly than longer dated fall. And again, this is backwardation. And then this configuration is Kintango. As always, any questions? Let me know. Be an ally. See you later.",
    "start_timestamp_seconds": 91.96,
    "start_timestamp": "00:01:31",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=gN5HeErLFMk&t=91"
  }
]