[
  {
    "text": "What's up, everyone? Welcome back to the Outlier podcast. We have a familiar face, Tom Baso. Welcome back. Hey, good to be here. So here we are post election. And we were actually just talking about a bunch of physical ailments. The market so far is experiencing seemingly very few of those. The market obviously had this massive, massive post election outcome rally. I'd love to start there with what you thought about the market positioning leading into the election and then the reaction post election. Going into the election, I saw extreme volatility, my position sizing algorithms are measuring the increased risk and volatility and downsizing my reversal trades. In some cases, one day I actually right after the election when the market went up 1500 on the Dow, I actually got some risk peel off trades across the entire portfolio. The whole portfolio risk is measured by aggregating all of the positions together, got over my tolerable limit and I had to peel off kind of one contract of everything just to get back down underneath the limit that I set for myself. And from that point on, I think I've seen two markets that have gone nuts that I've had to peel off one contract or something. But volatility continues. You get moves like, man, today Coco was up 678 points. And that's after, you know, like, what, five days ago, it was somewhere around 2,000 points down from where it is now. Those are some serious",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 58,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=0"
    }
  },
  {
    "text": "that I've had to peel off one contract or something. But volatility continues. You get moves like, man, today Coco was up 678 points. And that's after, you know, like, what, five days ago, it was somewhere around 2,000 points down from where it is now. Those are some serious moves. You know, bonds caving in, stocks were down across the board today. So we'll see whether this is just a pullback or people getting nervous. But what I saw before the election versus after, and before the election, there was a lot of reversal trades. Everybody's guessing, okay, this is going to be good. This is going to be bad. And you get one day, it looks like all things going to cave in. And next day, it looks like it's pie in the sky ready to go. And I'm just kind of following my strategy and running right through it and hopefully keeping the position sizes down. And that was a drawdown for me, right? Before the election, it was drawdown city. Right after the election, a lot of markets just made up their mind and started running. So it broke that whatever the sideways at each market was going in, someone to the upside, some to the down, I have to say out of some 38 markets, I've got right now, one, two, three, four, five, six, seven out of 38 markets are to the upside. All right. It's lighter than I would have expected. There are",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 58,
      "start_timestamp": "00:01:20",
      "start_timestamp_seconds": 80.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=80"
    }
  },
  {
    "text": "was going in, someone to the upside, some to the down, I have to say out of some 38 markets, I've got right now, one, two, three, four, five, six, seven out of 38 markets are to the upside. All right. It's lighter than I would have expected. There are some that are to the upside like Coco and coffee and that type of thing, but that's just the positioning. And remember, I'm trading seven strategies and I've got short-term ones that are sort of counter trend and they jump in real quick. So those have already shifted to the downside on stocks. The longer-term ones are still upside for the most part, although some of those are starting to pick over to the downside. So where it goes from here, anybody guessed my favorite saying the market will do, at the market will do. When jobs, the traders, the go along for the ride, and I try to enjoy the ride when I can. And so I don't try to necessarily predict what'll happen next, but the news is coming out fast and furious on what's happening in the new administration. And a lot of the purported proposals that Trump has espoused, I think from my amateur behavioral economic analyst viewpoint, I think would be very positive for the economy. So I could see the stock market being happy about what they're hearing. Now, lots got to happen before it kicks in. You're talking first a whole lot of",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 58,
      "start_timestamp": "00:02:41",
      "start_timestamp_seconds": 161.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=161"
    }
  },
  {
    "text": "Trump has espoused, I think from my amateur behavioral economic analyst viewpoint, I think would be very positive for the economy. So I could see the stock market being happy about what they're hearing. Now, lots got to happen before it kicks in. You're talking first a whole lot of approvals of the cabinet. You've got all sorts of laws that need to be passed, executive orders that need to be signed. Economy, the size of the United States does not turn around on a dime. It's going to take months and maybe multiple quarters to even see any kind of effect in some traction and the numbers starting to turn. And there may be some tougher periods before it catches and really starts paying it off. But I think he's on the right track. I think a lot of these proposals are spot on. I think they'll really, really help the US economy long term. A bunch of questions. I want to start with one of your comments first because it's something that I typically actually say myself and I find a lot of people seem to struggle with what I mean when I say it. So I'm curious how you would explain it to somebody. When you say something like you try not to predict the market, right? You try to go along with what the market is doing. I actually know exactly what you mean. However, a lot of people they struggle to understand how that actually",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 58,
      "start_timestamp": "00:04:05",
      "start_timestamp_seconds": 245.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=245"
    }
  },
  {
    "text": "how you would explain it to somebody. When you say something like you try not to predict the market, right? You try to go along with what the market is doing. I actually know exactly what you mean. However, a lot of people they struggle to understand how that actually reflects positioning because no matter what, if you have an open position, it is some sort of forecast of expected future price behavior. So how would you explain that to somebody when they say how does that work? Well, what I try to think about it, I say to people is that I like to try to trade in the now. In the zen, like experience of at this moment in time, this second, this minute, this day, this year, the markets are doing something at this moment. When I look down 38 markets and I analyze them by way of seven different types of indicator combinations and parameter sets and everything else, I can rate each one of those 38 markets as being in an up or down direction. So at this moment, I want to be in the same direction as all those markets up or down. I'm completely agnostic. I have no clue why Coco is going up like it did today. But I'm long. So it was my largest position profit today. And I don't sit there and analyze it and say, well, I should peel off some positions. I have algorithms for that even. I'm",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 58,
      "start_timestamp": "00:05:32",
      "start_timestamp_seconds": 332.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=332"
    }
  },
  {
    "text": "completely agnostic. I have no clue why Coco is going up like it did today. But I'm long. So it was my largest position profit today. And I don't sit there and analyze it and say, well, I should peel off some positions. I have algorithms for that even. I'm willing to hold a certain percentage of my equity in a Coco position or a coffee position or a corn position or whatever else, a stock position. And whenever the risk level and the volatility level as a percent of my equity gets too high, I take off just enough to get back down to an acceptable level. So I've even got that algorithmized. I've tried to think through what me as a human, what I as a human trader would want to do in different types of scenarios. And in the end, I just want to be right now. I want to say my risk level is this, my volatility levels this, my equity at this second is that I have indicators that say, this is up or this is down. And I want to take all that together and it gives me the direction I should be in, how many contracts I should hold. And, and then I total it up and see if my portfolio is getting overweighted because maybe all these markets are correlating with each other or something. And I want to keep my risk managed. And then I'm done. I don't need to predict",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 58,
      "start_timestamp": "00:06:51",
      "start_timestamp_seconds": 411.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=411"
    }
  },
  {
    "text": "how many contracts I should hold. And, and then I total it up and see if my portfolio is getting overweighted because maybe all these markets are correlating with each other or something. And I want to keep my risk managed. And then I'm done. I don't need to predict anything. I because the moment that I'm doing all this is now, but tomorrow is going to be another moment in time. And I'm going to have changes. I'm going to have some of these shorts go along and I'm going to have some of the longs go short. I'm going to have a whole bunch of positions that just stay the same direction as they stay. And I'm just going to wait for those big runs. The big runs pay the freight. All these small runs that go back and forth, you know, market flips back and forth six times in, in six weeks, that's going to be a loser for me. But I'm going to limit those losses and make sure that they're very small. Then you get on the, the larger runner, which seems like at one any one time, stocks have been doing really well this week, pretty much after the, after the election, generally up a few softs here and there on the commodity side have done well. The corn and some of the grains are in a trend to the downside. That's been profitable. So at a good day in the grains today. And",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 58,
      "start_timestamp": "00:08:05",
      "start_timestamp_seconds": 485.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=485"
    }
  },
  {
    "text": "week, pretty much after the, after the election, generally up a few softs here and there on the commodity side have done well. The corn and some of the grains are in a trend to the downside. That's been profitable. So at a good day in the grains today. And so you, you just kind of try to find where there's a trend and in that instant, you make sure your portfolio's positioned with that snapshot in time. And then you feel freed up to make another snapshot in time tomorrow and the next day and the next day and the next day. So I'm not really making a prediction. I'm just positioning my portfolio the way the market's reacting today. It's a really great way to kind of explain the process because for me, I typically would say I just use like a Bayesian approach, which is exactly what you're describing. Right. It's based on updating your probabilities based on new information. So I like that as a descriptor. Like I said, it's something that the problem with your description is most clients or most traders when you say the one like a nasian. Yeah. Yeah. I lost. Yeah. Exactly. I'm saying in the now it's a zen-like thing. I need to work on my communication skills. They're not great. It's a Mr. Serenity type thing. Yeah. Yeah. So one of the things that I'm interested though, kind of finding this balance between, you know, trading what exists now",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 58,
      "start_timestamp": "00:09:05",
      "start_timestamp_seconds": 545.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=545"
    }
  },
  {
    "text": "Exactly. I'm saying in the now it's a zen-like thing. I need to work on my communication skills. They're not great. It's a Mr. Serenity type thing. Yeah. Yeah. So one of the things that I'm interested though, kind of finding this balance between, you know, trading what exists now and in forecast opportunities. One of the things that I find really interesting and even lucrative at the point is when we have Trump and his, you know, policies flooding the market, people starting to speculate, okay, it looks like windmills, probably not going to do super great. He's not a big fan of windmills. Apparently, I don't know if you saw the podcast with Joe Rogan, but he was talking about how it messes up the whales. I didn't even know that. That's new news to me. Yeah. They make a noise that hums and messes with the whales navigation system and communication systems. Isn't that the coolest thing about markets though? Is that you have an opportunity to learn about some sort of interaction between a thing in whales? I never would have known that. Yeah. I think I saw that someplace. I don't know if it's been an internet but that's the speculation of why so many whales are washing up in New Jersey and other places. Is that building the windmills? Which is fascinating. And so as I see these different policies though coming out from Trump, it seems like there are some fairly predictable themes",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 58,
      "start_timestamp": "00:10:25",
      "start_timestamp_seconds": 625.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=625"
    }
  },
  {
    "text": "an internet but that's the speculation of why so many whales are washing up in New Jersey and other places. Is that building the windmills? Which is fascinating. And so as I see these different policies though coming out from Trump, it seems like there are some fairly predictable themes coming in front of us, right? One of them is oil. He clearly is a fan of oil, wants to tap more into oil. So then some traders are probably speculating, well, I think oil goes up at some point. Maybe now maybe, you know, six months from now, now, now, now. Is that something that would get you to venture into individual trades and you're staying in futures, going to trade oil as a commodity as that moves whenever it goes? I trade oil. I trade natural gas, trade unleaded gas in New York. Those are the three energies, I think, that I'm in. Haven't gotten into trading a Brent crude that involves a little more complexity and I'd rather keep my life simple. Why is that the case? I think it's traded in UK. So therefore you end up with British pound conversions and you know, interactive brokers can handle the transaction. I know that, but I would have to sign up for data. I'd have to sign up, you know, there's exchange fees or whatever to to get the data. Then there's one more ticker to keep track of. Yeah, you know, there's this just to add",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 58,
      "start_timestamp": "00:11:32",
      "start_timestamp_seconds": 692.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=692"
    }
  },
  {
    "text": "can handle the transaction. I know that, but I would have to sign up for data. I'd have to sign up, you know, there's exchange fees or whatever to to get the data. Then there's one more ticker to keep track of. Yeah, you know, there's this just to add one market takes me sometimes to get it into the automated process, check everything out, involves a week or two of, you know, working on specs and making sure the specs are in the computer right and dealing with whatever currency risk I might have with that particular market. Some things are priced in US dollars and makes it a lot easier for me since I'm a US guy. But if you don't get trade it in UK pounds, then you would have to you know, realize that you're going to end up with a UK pound position. You could either hedge that position or you could just treat it as another speculance of the position and let it run as a hedge against your US dollar. So you have to kind of look at that, make decisions, see if you want to deal with that risk with an actual night strategy, eight strategy or night strategy would be your currency hedging strategy or something. And then you'd have to make sure you periodically zero out that risk if you wanted to zero it out. There'd be, it's, you got to think through a lot of details, make sure all",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 58,
      "start_timestamp": "00:12:45",
      "start_timestamp_seconds": 765.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=765"
    }
  },
  {
    "text": "night strategy, eight strategy or night strategy would be your currency hedging strategy or something. And then you'd have to make sure you periodically zero out that risk if you wanted to zero it out. There'd be, it's, you got to think through a lot of details, make sure all the eyes are dotted, cheese are crossed. And then I give it the green light and we start trading it. And I've added probably about three or four markets, three, maybe three markets in the last three months roughly. I'm trading iron ore and Singapore. I'm trading rapeseed in Canada or canola if you choose. And I'm also trading the VIX on the CMB. Is that good? That's good to VIX this. Let me see. Sure. No, it's CBOE. It's the volatility index. Do you vote? Yeah. And the futures is traded on the SCFE, whatever that is. When you're going through the process of deciding to add new products, how does, how does that work? Is it you're taking something out of your basket of stuff and putting something in or do you see something that's moving? Interestingly, you're like, I want to add this to my basket. It's not necessarily even something moving. It's something that catches my eye that has sufficient liquidity and movement to be a viable trading vehicle. And it's especially attracted if it's something like iron ore, which doesn't necessarily correlate with anything else in my portfolio. And has the time zone diversification of",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 58,
      "start_timestamp": "00:13:56",
      "start_timestamp_seconds": 836.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=836"
    }
  },
  {
    "text": "not necessarily even something moving. It's something that catches my eye that has sufficient liquidity and movement to be a viable trading vehicle. And it's especially attracted if it's something like iron ore, which doesn't necessarily correlate with anything else in my portfolio. And has the time zone diversification of trading on a Singapore. So I like the concept over time. I will be trading more and more things like Brent Crude that would be in other time zones. And their liquidity is maybe a little bit bigger over in that time zone. And if something happens in the middle of the night and my crude oil position here in the states is not really open for trading. Maybe the Brent Crude is. You can partially mitigate some risk. So those types of things over time, as my portfolio keeps getting bigger and bigger, I'll be looking at adding more markets, no doubt. But I'm pretty careful about adding them. I don't just add them just to have a long list. That seems foolish on my part as a retired guy. I just I'm trying to keep my life easy. So yeah, and I'm interested too, because even 30-something products is not insignificant. And it almost seems like in your scenario, I honestly would expect like 10 to 15 and just pick stuff that's inverse, non-correlated, something like that. So obviously you're finding a lot of opportunities though that you're liking the movement. Yeah, and even you know, you take",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 58,
      "start_timestamp": "00:15:20",
      "start_timestamp_seconds": 920.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=920"
    }
  },
  {
    "text": "is not insignificant. And it almost seems like in your scenario, I honestly would expect like 10 to 15 and just pick stuff that's inverse, non-correlated, something like that. So obviously you're finding a lot of opportunities though that you're liking the movement. Yeah, and even you know, you take the four grains I just mentioned a little while ago. Today corn was the big winner to the downside. But I'm short. All of them are a net short of all of them in some strategies. I'm long others. I'm short net short though on all of them. And so the grains all total did very well. But what you realized when you dig into under the hood, corn was already short. So I had a big day. The other soybean oil soybeans and wheat, for instance, in some cases, one of them was long and flipped to the short side. And the others were short and didn't really move very much. So you end up with kind of a diversification even amongst four different grains. And the same thing's true. I just recently had a trade. I trade ultra buns and treasury buns, ones like a 50 year horizon, the other ones 30. And or I guess ultra buns is over 30, I guess, something like that. Whatever the definition is, they're slightly different on the yield curve. And what you find just recently in the last month I had a trade where I was actually heavily into the",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 58,
      "start_timestamp": "00:16:43",
      "start_timestamp_seconds": 1003.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1003"
    }
  },
  {
    "text": "the other ones 30. And or I guess ultra buns is over 30, I guess, something like that. Whatever the definition is, they're slightly different on the yield curve. And what you find just recently in the last month I had a trade where I was actually heavily into the ultra buns one way. And I had already backed off that's treasury bond position didn't get a trade. So there's a diversification even amongst something like interest rate debt, you know, debt futures. So you see that from time to time, sure. There's a lot of correlation between those two most of the time. And as there is in grains and meats and energy and currencies, you know, right now the dollar is strong and all the non-US currencies are having a struggle. You know, that'll break apart and all of sudden the British pound or the Swiss Frank will be going up and the rest are going down. And I don't try to analyze it too much. You know, the direction shifts I go with it. Sure. And so when you're looking at some of the policies that's coming out though from from Trump, it's a lot of people are speculating and I would probably agree with the majority of them that it does look like a lot of inflationary practice probably coming in the short term. And the reason why a lot of people and I do agree with that is from a perspective of cutting spending, which",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 58,
      "start_timestamp": "00:17:50",
      "start_timestamp_seconds": 1070.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1070"
    }
  },
  {
    "text": "are speculating and I would probably agree with the majority of them that it does look like a lot of inflationary practice probably coming in the short term. And the reason why a lot of people and I do agree with that is from a perspective of cutting spending, which is good, but obviously that'll impact GDP. And the near term impact of stuff like that. I'm wondering if you have an opinion on it. Obviously, it seems like you don't think it's going to be quite as inflationary. So I'd love to learn about that. I don't. For starters, negotiations using tariffs and things like that cause foreign countries to have problems getting stuff into the country. If they do, it will be more expensive. But what they inclined to do if there are multinational corporations, especially if you can get the 15 if you build it in the United States. You just put United States into a top quartile competitive position to build your next factory in the United States because that's where your market is the largest. And that's where there's plentiful supply of skilled labor and AI and computer systems and server systems and everything else. So if you have your choice, do you build it in Ghana or someplace like that because you can get very cheap labor, but you're not even sure about the legal system there. And you're like, do your factory and it might be in the middle of a revolution or",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 58,
      "start_timestamp": "00:19:06",
      "start_timestamp_seconds": 1146.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1146"
    }
  },
  {
    "text": "So if you have your choice, do you build it in Ghana or someplace like that because you can get very cheap labor, but you're not even sure about the legal system there. And you're like, do your factory and it might be in the middle of a revolution or something a year from now or do you go to a United States where you're building it closer to where you're selling it. So transportation becomes less of an issue. You get the employees you need. Yes, they are more expensive, but there's more automation, there's more robotics, maybe you're built a state of the art factory. So a lot of capital flow comes in when you do stuff like that by way of US corporations and multinational corporations deciding to infuse capital in the United States because that's the easiest decision to make. In some cases, it's the best if you make the tax rate low enough, you literally are going to be the winning choice when they do the spreadsheet and say we could build it here here, you know, Switzerland or we could build it in Ghana or we could build it in Australia or whatever. And you start figuring it out, they start saying, well, you know, US was looking like a good place to build a factory. So capital comes in more jobs, more supply of things. The energy alone over the very short run won't have an effect, but over this, say, six months,",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 58,
      "start_timestamp": "00:20:27",
      "start_timestamp_seconds": 1227.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1227"
    }
  },
  {
    "text": "you start figuring it out, they start saying, well, you know, US was looking like a good place to build a factory. So capital comes in more jobs, more supply of things. The energy alone over the very short run won't have an effect, but over this, say, six months, 12 months, if you open up energy and drive energy down, energy goes into literally everything you buy. You know, the farmer has got to pay for the gas for the tractor, he's got to deal with the fertilizers, which are made largely from petrochemicals. I was a chemical engineer by degree. So we had a lot of petrochemical operations down in Texas for instance, where you're you're cutting off a stream of product from barrel of oil and then you're taking it and feeding into all sorts of other intermediaries, plastics and all sorts of other things that we take for granted every day that really come from oil originally. So if you drive the price of that down, you just drove the price of everything down. And so if you if you can in it say 12 months cut the price of oil in half because you become the major producer in the world, you just did a lot to drop the prices of food, drop the prices of plastics, drop the prices of a whole lot of things. And that's anti-inflationary. I don't see some of his policies as being inflationary at all. Yeah, well, and I",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 58,
      "start_timestamp": "00:21:41",
      "start_timestamp_seconds": 1301.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1301"
    }
  },
  {
    "text": "the major producer in the world, you just did a lot to drop the prices of food, drop the prices of plastics, drop the prices of a whole lot of things. And that's anti-inflationary. I don't see some of his policies as being inflationary at all. Yeah, well, and I think you hit the important point there, right? It's like the different time frames because I think most people and again, myself included wouldn't expect it to be inflationary long term exactly to your point. But like is your is your talking about like the factories and whatnot? That's not a six month thing. No, you know, you take time. Yeah, there's the build it. But and I tell you what, the Federal Reserve done what they did just before the election dropping by half a point. I thought that's insane. A quarter of a point would have been plenty and just leave it alone and be careful. That half point just kind of smacked up a little bit of politics and a juicing. And what I worry about is then with the latest inflation numbers and GDP growth and all that, some of which could be, you know, revised later, which seems to happen a lot lately, you notice? You know, to me, you know, January 20th rolls around and inflation is going crazy again. Then all of a sudden Trump's got another problem to deal with. Who knows whether that's by design or not? I tell you what,",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 58,
      "start_timestamp": "00:22:51",
      "start_timestamp_seconds": 1371.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1371"
    }
  },
  {
    "text": "later, which seems to happen a lot lately, you notice? You know, to me, you know, January 20th rolls around and inflation is going crazy again. Then all of a sudden Trump's got another problem to deal with. Who knows whether that's by design or not? I tell you what, this is such a screwed up mess. The American citizen seems to be totally left out of the picture in terms of decision-making sometimes, I think. But right now, I am cautiously optimistic that based on the types of people he's proposing for his cabinet, the types of proposals that he very detailed, articulate detailed way articulated on the campaign trail. If he can get all of those things in place, there are no tax on tips, I think it's a slam dunk. And if you take over time too, right? Over time, what do you do? If you take the taxes off over time, you encourage over time. You encourage hustle. You encourage people to work harder, more productivity. All very beneficial to the economic growth of the country, which increases tax revenues, no matter what level of taxes you put on it, you're going to increase tax revenues, laugh or curve at work, drop the incremental rate, increase the amount of growth, and end up with more tax revenues in the process. So, I mean, all of these proposals, no tax on self-security. Those types of proposals make it possible for you to fire about three quarters of",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 58,
      "start_timestamp": "00:24:00",
      "start_timestamp_seconds": 1440.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1440"
    }
  },
  {
    "text": "laugh or curve at work, drop the incremental rate, increase the amount of growth, and end up with more tax revenues in the process. So, I mean, all of these proposals, no tax on self-security. Those types of proposals make it possible for you to fire about three quarters of the IRS agents. And I think a lot of our inflation is really due to not, you know, the doge thing, the department of governmental efficiency. Yeah, but yeah, half a trillion of waste and fraud in our government out of seven, something trillion spent, two trillion deficit every year. You can get, whittle that down to zero easily, I think. You get that down and start producing a surplus with things like tariffs and a lot more oil being produced and stuff like that. All of a sudden, government revenues are increasing and the economy is rip roaring and, you know, unemployment is in good shape. Everybody's having a good time. And what you end up without that is running a surplus and start paying down the debt. What's your perspective on the possibility of a recession sometime in like the next 24 years? I know it's esoteric and there's different definitions and stuff, but just from a general perspective, I'm curious if you think about it in episode one or 24 years. 24 months. Okay. So two years. Sorry. You said years. Oh, well, that it would be a more difficult. I was going to answer that with,",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 58,
      "start_timestamp": "00:25:30",
      "start_timestamp_seconds": 1530.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1530"
    }
  },
  {
    "text": "there's different definitions and stuff, but just from a general perspective, I'm curious if you think about it in episode one or 24 years. 24 months. Okay. So two years. Sorry. You said years. Oh, well, that it would be a more difficult. I was going to answer that with, let's see, I'm 72. That would make me 96. Don't care anymore. Don't care. Bring it on. Whatever it is. Yeah. Next 48 months, chance of a recession. I think if the most recent move by the Fed ends up firing up inflation again, which I think it has a possibility of doing. And if then the short term moves that Trump's making are very short term inflationary, then the Fed tries to respond by overdoing it again and being too late and not getting ahead of the problem, which they seem to do a lot of lately. You end up with then maybe a contraction. And yeah, maybe it could slip. I think with what he's proposing, I think it's that's going to fight the tendency for a recession. So I think it might be a slower growth economy for a little while, but I'm not sure. I think the possibility of a recession is too awfully high at this point. Yeah. And that's an interesting point, specifically talking about the balance between some of the policies and kind of the current trajectory that we're on. When you're thinking about stuff like Apple production of things, right? Obviously, they",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 58,
      "start_timestamp": "00:26:51",
      "start_timestamp_seconds": 1611.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1611"
    }
  },
  {
    "text": "the possibility of a recession is too awfully high at this point. Yeah. And that's an interesting point, specifically talking about the balance between some of the policies and kind of the current trajectory that we're on. When you're thinking about stuff like Apple production of things, right? Obviously, they really favor offshore production. And I have to imagine that they've done tons of enough on where they would prefer to produce and stuff like that. Do you think moving from 21 to 20 corporate and then 15 if it's domestic? Do you think that's enough to move the needle for somebody like Apple? Or do you still think that it would be too cheap comparatively? Because I mean, they're literally just putting up nets to catch people from it won't be just the 15. It'll be also the potential for tariffs on goods kind of China. It'll also be the board of directors of Apple getting around the table and saying, you know, China's not exactly a comfortable place legally. I mean, they could come in and shut us down overnight. United States is going to let us be and do our thing. And, you know, we're respected company in United States. They're going to protect our interests if we're here for strategic purposes since we sell a lot of stuff here. Maybe we should go ahead and bite the bullet and there's makes a lot of sense to put a plant here as a strategic backup in case",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 58,
      "start_timestamp": "00:28:06",
      "start_timestamp_seconds": 1686.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1686"
    }
  },
  {
    "text": "in United States. They're going to protect our interests if we're here for strategic purposes since we sell a lot of stuff here. Maybe we should go ahead and bite the bullet and there's makes a lot of sense to put a plant here as a strategic backup in case China decides to shut Apple down for some reason overnight. Then Apple's got alternate facilities that are a little bit more secure. So it's a supply chain logistics. Lots of different decisions would go into that. But yeah, taxes would definitely be one of them. In your perspective, what has led them to not make that decision already then if it's based on the potential risk of like the Chinese government like shutting them down? Do you think that they just needed one a couple more pieces to push them over? No, it's 21 now and the current administration was going to let the tax breaks expire, which means that the tax rate was on its way up. I see. There probably at least would wait until the election cleared the landscape and then they can make a more logical decision at least for the next four years. And yeah, if I were them, I would wait until I saw the results of the election because the way it was going was not going to be very favorable to the United States. I think it would have really increased dramatically the chance of a recession or worse in the next",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 58,
      "start_timestamp": "00:29:21",
      "start_timestamp_seconds": 1761.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1761"
    }
  },
  {
    "text": "if I were them, I would wait until I saw the results of the election because the way it was going was not going to be very favorable to the United States. I think it would have really increased dramatically the chance of a recession or worse in the next two years. Interesting. And so from a broader trading perspective, obviously you're trading like the yield curve and stuff like that. Do you have a perspective on real estate in general? Yeah, my wife's more of the real estate expert. You should be asking her that question. Perfect. I'm just saying. She just got some work done on one of her eyes. She's got a little bit of a problem with one of her eyes. So we just came from the eye doctor and just barely out for the center of you. So she's in the other room with her foot up. But she would say, I think, and I have to agree with her that real estate's been pretty good for a long time and with higher interest rates. It's frozen everybody sort of where they are. They don't want to sell what they've got because if they went to someplace else, their mortgage rate would go up a great deal. Well, with what seems to be happening. And if we look at pictures of the bond market, for instance, has been going sideways on my graph here for about a month or so, which is just before the",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 58,
      "start_timestamp": "00:30:42",
      "start_timestamp_seconds": 1842.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1842"
    }
  },
  {
    "text": "to someplace else, their mortgage rate would go up a great deal. Well, with what seems to be happening. And if we look at pictures of the bond market, for instance, has been going sideways on my graph here for about a month or so, which is just before the election just after the election, not a huge amount of movement up or down. And if that starts to rally at all and drop those interest rates. And if the economy starts getting more optimistic, you're already seeing businesses getting optimistic. You're seeing more announcements of people wanting to bring factories and business back in the United States. Deals are going to happen with more frequency now because you're going to get a rid of that anti-monopoly bureaucracy in Washington that seem to be against any deals, large deals for sure. And so when that stuff starts happening and you free up the capital markets and the flow of deals and the building of factories and the jobs coming in, you end up with more of an optimism. More people are going to take chances with buying a new house. Getting that house that they wanted out in the country or in the suburbs or that downtown condo so they could be near all the action, but it was out of their reach back in the days. They had to rent. And now they can actually think about that million dollar condo because they can afford it. So I think",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 58,
      "start_timestamp": "00:31:44",
      "start_timestamp_seconds": 1904.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1904"
    }
  },
  {
    "text": "or in the suburbs or that downtown condo so they could be near all the action, but it was out of their reach back in the days. They had to rent. And now they can actually think about that million dollar condo because they can afford it. So I think that you'll see real estate perk up. Now over the short run, until we get the economy doing all those things, maybe the next six months or something, you could see some softness maybe because if somebody really needs to sell something, like you guys out in California for instance, I think you're in California, aren't you? You're out San Diego. It's hard to remember with all the people interviewing me where they're from, but I seem to remember you being a San Diego boy. And when you get a lot of people trying to get out of a place like California, that's obviously less demand and you have a fixed supply. So that's not necessarily positive for prices. On places like, say Texas, Florida, even Arizona, Scottsdale is not showing a whole lot of sign of downturn because we keep having you. California types coming over here and buying up our real estate after selling your mansion in California. So they can buy a modest house here and bank a whole bunch of money. That's right. That's the playbook. Yeah, it's a pretty easy decision financially now. Yeah. Off you're into the ocean and surfing and the outdoors and",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 58,
      "start_timestamp": "00:33:04",
      "start_timestamp_seconds": 1984.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=1984"
    }
  },
  {
    "text": "up our real estate after selling your mansion in California. So they can buy a modest house here and bank a whole bunch of money. That's right. That's the playbook. Yeah, it's a pretty easy decision financially now. Yeah. Off you're into the ocean and surfing and the outdoors and you don't like the heat of the desert in the summer, like cactus or other reasons. There's lots of reasons to dislike depending on your own preferences, but I love it here. I love the dry air. I love the heat. I'm an old guy. My sore aching muscles feel better when they're hot rather than when they're cold. And I breathe better in the dry. I have less allergy so I can sing. So yeah, it's all good here. This is my favorite place on earth, but it's not for everybody, but we're getting a study supply of new people coming in all the time. Yeah, it's funny actually. My wife and I were planning a trip this month out to Denver because we're looking at we're looking at doing the playbook. You got to execute the game plan. Because I mean, I'm not from California originally anyway. I was stationed here for a few years, hung out for a bit, liked it. But yeah, the overall approach that you're explaining is exactly what a lot of us seem to do rightfully so. But I don't know who's going to be the last one that leaves and turns the",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 58,
      "start_timestamp": "00:34:18",
      "start_timestamp_seconds": 2058.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=2058"
    }
  },
  {
    "text": "was stationed here for a few years, hung out for a bit, liked it. But yeah, the overall approach that you're explaining is exactly what a lot of us seem to do rightfully so. But I don't know who's going to be the last one that leaves and turns the light out. At some point, it's got a fact. Development of subdivisions, it's got to affect the development of roads, refurbishing of roads. I noticed many times on Mount and California these days if I drive out there that my car is hitting more potholes and cracks in the highways and just seems like it's not quite as smooth as it was back in the 80s, let's say, when California was a bit more in its heyday. I've noticed the over the decades slight deterioration in some of the infrastructure. And so I don't know. We'll see how it all sorts out. But there's lots of it's a big country out there and there's lots of beautiful country. I've traveled a lot of it. And I choose to make this my home and make sense for a lot of different reasons for Brunnan myself. But even, I mean, I have a nephew that is now moving just north of DC. He's an expert in aerial reconnaissance. So he's going to be working for the government. He gets a 40 increase in the salary. He's one of these guys that looks at the aerial photographs and says, that's a terrorist right",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 58,
      "start_timestamp": "00:35:32",
      "start_timestamp_seconds": 2132.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=2132"
    }
  },
  {
    "text": "a nephew that is now moving just north of DC. He's an expert in aerial reconnaissance. So he's going to be working for the government. He gets a 40 increase in the salary. He's one of these guys that looks at the aerial photographs and says, that's a terrorist right there going into that house. We should arm, you know, we should get a drone up there and take that place out. And so that's kind of what he does. He ruins his eyes all day long looking at aerial reconnaissance photos. But hey, if you're good at it, I guess it's a useful skill. Definitely. And it actually leads to a follow on because one of the most interesting things that we've learned so far from a military perspective is the engagement that we're seeing in Israel and Maz a little bit less so that's a little bit more traditional. Still some elements that we're learning from definitely Ukraine and Russia. We have learned so much about what we would call TTPs, tactics, techniques and procedures to understand approach. And this entire new scale and methodology of warfare is fascinating. It's the easiest way to describe it. And I say fascinating because there's elements of it that's freaking terrifying because you can have these small drones that cost a few hundred dollars that can literally, literally not necessarily wipe out, so to speak, but definitely incapacitate a squad, which now for the Marine Corps 13, 13 people. That doesn't",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 58,
      "start_timestamp": "00:36:45",
      "start_timestamp_seconds": 2205.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=2205"
    }
  },
  {
    "text": "say fascinating because there's elements of it that's freaking terrifying because you can have these small drones that cost a few hundred dollars that can literally, literally not necessarily wipe out, so to speak, but definitely incapacitate a squad, which now for the Marine Corps 13, 13 people. That doesn't seem obviously to be slowing down. When you see, again, taking it back to the election since it's so fresh, one of Trump's imperatives is he's talking about trying to end the conflict in Ukraine and Russia. Any thoughts on what that might look like? Yeah, I think Trump's the art of the deal guy. He's going to go to both parties and he's going to get there masts and wants. And if there's anything whatsoever that the masts can be distinctly met, and then it's down to the wants, you give and take and you use some money flows. And who knows, the United States may buy somebody off and say, okay, we'll give you this much to repair that and you stay over here and everybody's happy from here on in. He'll work the deal and he'll figure it out and then get both of them to agree and all of a sudden the war stops. And if you were to, more than one more deal, he's done a lot of them. And if you were to speculate the probability of some sort of deal being arranged, is that kind of what you're thinking is likely to occur?",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 58,
      "start_timestamp": "00:38:05",
      "start_timestamp_seconds": 2285.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=2285"
    }
  },
  {
    "text": "and all of a sudden the war stops. And if you were to, more than one more deal, he's done a lot of them. And if you were to speculate the probability of some sort of deal being arranged, is that kind of what you're thinking is likely to occur? Do you think it's going to be an attempt and then it might get dragged out or anything like that? No, because I think both parties over there, Ukraine and Russia both want to quit wasting hundreds of thousands of people and lots of money getting blown up in bombs and missiles and drones. It's a hassle on both sides. There's no really nobody's winning. It's the whole thing is ridiculous. And so when Trump sets down and gets to each other, he'll figure it out. There'll be a deal made. Yeah, I'm obviously with my background. I'm really, really interested to see how that reconciles. Because right now, if anything was drawn based off of the current lines, Russia would gain some territory, which would be very interesting to frame it lightly. But then when I look at the overall scale of things, it does make me really interested to understand if what kind of deal could be made that would maintain Ukraine's borders. And that's the one that I'm curious if it's even possible. Yeah, sort of, I think Trump or any president really should be a little hesitant to come in, especially a new president, which Trump",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 58,
      "start_timestamp": "00:39:23",
      "start_timestamp_seconds": 2363.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=2363"
    }
  },
  {
    "text": "to understand if what kind of deal could be made that would maintain Ukraine's borders. And that's the one that I'm curious if it's even possible. Yeah, sort of, I think Trump or any president really should be a little hesitant to come in, especially a new president, which Trump would be here. Yeah, he's got to be cognizant of what has been. But really, he's thrust into a situation of this is the way it is today. All of how we got here is somewhat interesting, but in reality, here's where we are today, just like trading in the now. This is where we are. Now that we're here, what do we do to get the deal done and get this done with? Both sides are going to bring up, well, yeah, but they did this and there's a bunch of little kids squabbling with each other. Yeah, but they did that and yeah, they did this and blah, blah, blah, and argue with each other. But in reality, he just needs to keep focusing back on, okay, here's where we are today. And here's what you need and here's what you need and here's what you want and what you want. And let's see if we can't figure out how to give as many of the wants and needs on both sides. And where are we missing then when we get all of that figured out, then what do we need to balance the deal and get the",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 58,
      "start_timestamp": "00:40:42",
      "start_timestamp_seconds": 2442.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=2442"
    }
  },
  {
    "text": "what you want. And let's see if we can't figure out how to give as many of the wants and needs on both sides. And where are we missing then when we get all of that figured out, then what do we need to balance the deal and get the deal done? Interesting. Yeah, I'm really curious to see if if and what that will look like because yeah, there's a lot of different shapes and forms. And I think that the output of it will be pretty impactful. Do you think that there's any sort of broader market impact from that conversation? So let's say that they discuss a deal of struck. Do you think that the market would have some sort of reaction either way? I doubt it because if they start talking, I think the markets will assume that it probably is going to happen sooner or later because I think both parties want it. And I think frankly, most of Europe wants it. I know the United States wants it. The people at least there seems to be some people in our government right now that seem to want to keep it going. I know the US getting rid of sending hundreds of billions over there is probably going to be more money to help balance the budget. So that would be a useful function and trying to make government more efficient here so that I think definitely the American people should be happy about it.",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 58,
      "start_timestamp": "00:42:06",
      "start_timestamp_seconds": 2526.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=2526"
    }
  },
  {
    "text": "US getting rid of sending hundreds of billions over there is probably going to be more money to help balance the budget. So that would be a useful function and trying to make government more efficient here so that I think definitely the American people should be happy about it. I don't see a downside. Yeah. Another question. The only downside would be to people who are in favor of blowing up missiles and drones and stuff like that so they can produce more of them, the military industrial complex. And then the other people that would be happy about it keeping it going would be those that are involved in who knows what money goes over to Ukraine, it gets distributed around to who knows where the Pentagon's lost track of where it's going, who knows who's pockets that ends up in. So yeah, well, I mean, there's also the unfortunate reality that other than the cost as a country, like we do bet the United States does benefit if Russia is in conflict because it gives us a ton to look at from again, a strategic perspective. I'm not advocating for it to be clear. I think it sucks. But from a from a pure agnostic point of view of their wasting money, lives, resources, material, fighting this war that's really not going anywhere. That's no love lost from us from like a defensive strategic position. Yeah. But in the end, if we were strong ourselves and not",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 58,
      "start_timestamp": "00:43:12",
      "start_timestamp_seconds": 2592.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=2592"
    }
  },
  {
    "text": "sucks. But from a from a pure agnostic point of view of their wasting money, lives, resources, material, fighting this war that's really not going anywhere. That's no love lost from us from like a defensive strategic position. Yeah. But in the end, if we were strong ourselves and not sending munitions over there out of our own stockpiles, we would be stronger. We'd get to a point maybe where it's interesting to know what everybody else has got, but we got better than they do anyway. So you kind of, you know, you're not too awfully going to neglect a loose sleep over it, I guess. It's interesting to see that stuff. I understand strategically you're getting some information, but oh, definitely. I mean, we're probably with aerial reconnaissance and lots of other, you know, CIA intelligence and who knows what we probably in a few defectors here and there. You probably have a sense of what's going on in Russia or China. And you got to worry about what you are capable of doing yourself, probably more than what they're doing. You want to make sure that you're the best you can be. Oh, sure. And I think our military is supremely competent. I actually think another thing that we are benefiting from again, in an unfortunate way, but we have a chance we're testing all kinds of new munitions and technologies that have had no real actual battlefield application, which again, it's, there's benefit to it, but",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 58,
      "start_timestamp": "00:44:32",
      "start_timestamp_seconds": 2672.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=2672"
    }
  },
  {
    "text": "our military is supremely competent. I actually think another thing that we are benefiting from again, in an unfortunate way, but we have a chance we're testing all kinds of new munitions and technologies that have had no real actual battlefield application, which again, it's, there's benefit to it, but it comes at a pretty egregious cost. Right. Another question that I had, I came across this the other night. I was like really curious about it. I didn't know what to think of it, but I saw Trump was talking about getting rid of the Department of Education. And I did a bunch of homework on that just because obviously, you know, there's people that are like, oh, well, you know, he just wants to make everybody dumb. And it's like, no, he doesn't. Nobody nobody wants even regardless of what side you're on, quote, unquote, nobody wants our kids to be dumb. So it's like I started doing a bunch of homework though. I'm like, what they do. And it was really fascinating because I learned a lot about like their overall process, the allocation of funds, one of the things that I don't know if you know the answer to this, but I because I couldn't find it right now. A lot of the government, the federal funds that go to public schools, it's like eight to 12 of total public school funding that comes from the federal government right now. It's routed through something like the",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 58,
      "start_timestamp": "00:45:42",
      "start_timestamp_seconds": 2742.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=2742"
    }
  },
  {
    "text": "the answer to this, but I because I couldn't find it right now. A lot of the government, the federal funds that go to public schools, it's like eight to 12 of total public school funding that comes from the federal government right now. It's routed through something like the DOE. My the thing I was trying to figure out is my assumption would be if DOE goes away, those funds wouldn't necessarily go away. They would be like redistributed in another manner, but I had no reference for that. I don't know if you know anything about that by chance. I happened to do. I have a perfect I have a dodroom lot turns out that used to be a teacher in South School Districts. And thanks to an advanced degree became a specialist in reading and ended up having to attend a lot of meetings. And what she noticed over time is as she got more educated and more kind of in more of an administrative type helping other teachers with specializing in reading and all that. She noticed the meetings were unbelievable. The donuts, the bureaucrats, it just kept growing and growing and growing. And she realized that she spent a lot more time talking about a lot of things than doing anything that directly helps a kid learn how to read. And and I think she leans more liberal than conservative. I doubt if she voted for Trump. And yet she she made the statement that",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 58,
      "start_timestamp": "00:46:47",
      "start_timestamp_seconds": 2807.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=2807"
    }
  },
  {
    "text": "that she spent a lot more time talking about a lot of things than doing anything that directly helps a kid learn how to read. And and I think she leans more liberal than conservative. I doubt if she voted for Trump. And yet she she made the statement that if you took the money from the Department of Education and just took all the money that's wasted on all those bureaucrats there that then decide how we're going to split the pie up amongst all these school districts across the whole country. And you just said, okay, California gets X billions and New York gets X billions and their individual state Department of Education gets to decide how to deal with that. They are more cognizant of their needs than are the federal government. So you just you just directly sort of short circuit this flow through the bureaucracy. And I think you get a lot more bang for your buck. And I'll come back to the the most obvious thing of all Carter put the Department of Education in place yet now has something like is it 180 billion a year budget. Yeah, it's big. And our scores and our capabilities of our kids are lower than they've ever been. So it's not working. Try something different. You got nothing to lose. That'd be my argument. It clearly it's it's not helping. Yeah, yeah. And it's interesting because I think the idea and this is one of the",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 58,
      "start_timestamp": "00:48:06",
      "start_timestamp_seconds": 2886.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=2886"
    }
  },
  {
    "text": "and our capabilities of our kids are lower than they've ever been. So it's not working. Try something different. You got nothing to lose. That'd be my argument. It clearly it's it's not helping. Yeah, yeah. And it's interesting because I think the idea and this is one of the things I was arriving at last night as I was learning more about the the Department is that it also seems like just a larger gross number of dollars obviously would be able to be sent out so that not not only would the individual states be able to have a greater impact because they know what they need but they would actually have more money to do with it which is kind of interesting because the Department of Education would not siphon off money for all those bureaucrats and all their little you know the the building and then we could take that building and lease it or use it to make a mother more valuable purpose turn it into housing of some sort for Washington DC homeless whatever I mean you got to come up with some more positive use for the real estate and the people they're not increasing the economy they are not they are being a drag on the whole system and they're not producing the results in the end and I'm a big fan of in general I'm in all types of businesses really um military hard to do that police and fire hard",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 58,
      "start_timestamp": "00:49:24",
      "start_timestamp_seconds": 2964.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=2964"
    }
  },
  {
    "text": "not increasing the economy they are not they are being a drag on the whole system and they're not producing the results in the end and I'm a big fan of in general I'm in all types of businesses really um military hard to do that police and fire hard to do that but other than you know the kind of the original scope of limited government you know protecting your rights and protecting the boundaries of the United States the minimalist approach to the federal government just about everything else out there if you open it up to competition and good ideas I mean X now is the leading platform in the world being downloaded for news and all that but five years from now some other platform could come along and become the new X and everybody goes there and it's got XYZ and Elon has been so busy doing the douche thing that he's you know taken his eye off the ball and X is no longer the the darling and somebody else takes the place of the number one app for news there's always that ability and the education is no different if you've got uh I mean homeschooling back 30 years ago when I was back in the middle of trendstab days my head trader actually homeschooled his his kids and it was the kind of difficult because you know mom and dad had to sit there and actually deal with math class and geography",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 58,
      "start_timestamp": "00:50:37",
      "start_timestamp_seconds": 3037.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3037"
    }
  },
  {
    "text": "I mean homeschooling back 30 years ago when I was back in the middle of trendstab days my head trader actually homeschooled his his kids and it was the kind of difficult because you know mom and dad had to sit there and actually deal with math class and geography and stuff like that but nowadays there's all sorts of organizations textbooks online classwork um uh leagues for athletics and the the homeschooler in today's world has got a completely different uh set of resources and support groups to make it easier to do that and a lot of people there's a record number of people homeschooling their kids now because they look at what's happening over the public schools and the scorers keep getting lower and lower and the kids keep keep dropping out and and getting involved in violence and drugs and everything else they just say hey this is a pretty easy decision I can do it this way or I can do it that way and this way seems better now it trumps for posing uh school choice that makes a lot of sense to me if money is going into the government and is going back out if I can choose where to spend it I'm going to make the decision that seems the best for my kids or for my family uh I'm not going to put up with the government deciding what's best for my kids so it makes a lot of sense",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 58,
      "start_timestamp": "00:51:54",
      "start_timestamp_seconds": 3114.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3114"
    }
  },
  {
    "text": "back out if I can choose where to spend it I'm going to make the decision that seems the best for my kids or for my family uh I'm not going to put up with the government deciding what's best for my kids so it makes a lot of sense it's more freedom loving you get bureaucrats out of the way maybe you know if the public schools don't tow the line and get their act together maybe they go out of business you know nobody wants to put their kids in there anymore so they disappear the teachers that want to teach go work in homeschooling or they go work in charter schools or other places where they can focus on teaching well I'll tell you one thing if I had a homeschool my kids they're in trouble as soon as we get to do improves on triangles because I don't remember any of that I was just joking about that I remember I did teacher I think it was like seventh grade that was a real hardass about writing in a triangle as part of my proof that was a big deal right in a triangle other than writing in a triangle I don't remember it so yeah we're in trouble there we're both going to be homeschooling we're going to be homeschooled at the same time together yeah but that's a guy like me they got a hundred on his geometry regents to us in New York",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 58,
      "start_timestamp": "00:53:08",
      "start_timestamp_seconds": 3188.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3188"
    }
  },
  {
    "text": "writing in a triangle I don't remember it so yeah we're in trouble there we're both going to be homeschooling we're going to be homeschooled at the same time together yeah but that's a guy like me they got a hundred on his geometry regents to us in New York state that might have kids and you'd send your kids over to me and I teach geometry and I'd send my kids over to you for PE or perfect a class and health there's something like that you know and you might have to have the responsibility of teaching that course that's good what bunches swole martial artists so yeah I'm down for that and nothing wrong with that you know I think I think it's it's very useful for a child in today's world and one of the things I notice with my grandchildren now I have two granddaughters and fortunately my the kids expose the grandkids to as many possible different things as they can it it must drive their schedule nuts because they're carting kids every which way but you know here's a ballet class do you like that no okay how let's take a class and skiing how's that oh that's fun but I don't you know I just I like doing it I don't want to compete in it or anything how about swimming oh I think it's cool I like swimming and and I like the I have some girlfriends over and swimming and",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 58,
      "start_timestamp": "00:54:21",
      "start_timestamp_seconds": 3261.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3261"
    }
  },
  {
    "text": "skiing how's that oh that's fun but I don't you know I just I like doing it I don't want to compete in it or anything how about swimming oh I think it's cool I like swimming and and I like the I have some girlfriends over and swimming and and I won my last race and that was kind of cool and I enjoy the going through the water real fast or something you know you never know with kids you just kind of throw it out there and they decide oh you know I really like writing poems or I like coding on the computer or whatever I think math is cool I really like math you never know you just have to keep exposing them and then all of a sudden this profile comes out in your maze and you think wow I didn't see that come and I thought when you were six you were going to be a fashion designer and now you're talking about mathematics being one of your favorite subjects wow yeah yeah so it's watching them develop but a lot of that is just being exposed to a lot of different things and the world of today you know thanks to the internet and all that you can get exposed to a lot of different things so you have to be open to allowing people to reach their own potential and I think that we have a more of ability in the",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 58,
      "start_timestamp": "00:55:32",
      "start_timestamp_seconds": 3332.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3332"
    }
  },
  {
    "text": "and the world of today you know thanks to the internet and all that you can get exposed to a lot of different things so you have to be open to allowing people to reach their own potential and I think that we have a more of ability in the United States to allow our people individually if we keep holding on to freedom and encouraging freedom I think over a long run it's going to be the golden ages Trump often talks about I believe that you're going to have more freedom more economy more capability to get things done capitalistic wise and I think that's going to be good for everybody no matter what party you voted for last question and it actually dovetails off of a lot of what you were talking about the ability to leverage technology to gain exposure to different things artificial intelligence is so cool to me I think that just the potential for it is incredible where do you think that that goes as an industry over the next again maybe few years something like that whatever time frame you want but I'm just thinking like I view something like AI in some different time frame buckets right we have like early AI as we're going through now then there would be kind of like mid-advanced and then obviously very very advanced so for kind of the early AI what are some of the capabilities and just impact that you see for",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 58,
      "start_timestamp": "00:56:38",
      "start_timestamp_seconds": 3398.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3398"
    }
  },
  {
    "text": "some different time frame buckets right we have like early AI as we're going through now then there would be kind of like mid-advanced and then obviously very very advanced so for kind of the early AI what are some of the capabilities and just impact that you see for that? Well at the stage we're at right now I like to refer to it as a fancy Google search back in the 20-30 years ago you put in one word in a Google search and you got some citations back that were part of the database where the the bots had gone through for Google and looked at a lot of different web pages and decided that through keywords or tags or words used in titles of articles that here's a couple pages of your search results based on that one word you just put in there and then there was rules that you could put two words and you could separate them by commas or with a plus or whatever you want it you know there was also it's a search capabilities well now with AI it's more like you Alexa you know set the timer for 40 minutes and Alexa knows can interpret your words understand the sentence know that you're talking about a timer so you're timing something set it for 40 minutes and then beep at you when it's you know time to do whatever it was that you wanted to do even more so",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 58,
      "start_timestamp": "00:57:51",
      "start_timestamp_seconds": 3471.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3471"
    }
  },
  {
    "text": "minutes and Alexa knows can interpret your words understand the sentence know that you're talking about a timer so you're timing something set it for 40 minutes and then beep at you when it's you know time to do whatever it was that you wanted to do even more so now you can say and I'm sure Elon's going to be doing this with Vivek on the doge thing they're going to take a whole lot of financial records and they're going to have an AI engine read those financial records and they're going to look at government statistics they're going to look at head counts they're going to look at lease expense office space etc etc lots and lots of information and they're going to ask the question of AI where's the low hanging fruit what do we go after first department of education or department of energy department or the the justice department or what you know what out of all of this what is money being spent on that has the least economic benefit coming back so that's a pretty complex thing for a human brain to figure out there's some low hanging fruit you could obviously get rid of the what's the effect of Coke on quail you know quail ingesting cocaine yeah I don't think I need to know that with my taxpayer dollars you know that would be some simple things you can do but that's not going to get you to trillion you're",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 58,
      "start_timestamp": "00:58:52",
      "start_timestamp_seconds": 3532.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3532"
    }
  },
  {
    "text": "get rid of the what's the effect of Coke on quail you know quail ingesting cocaine yeah I don't think I need to know that with my taxpayer dollars you know that would be some simple things you can do but that's not going to get you to trillion you're going to have to go after a lot of deeply entrenched stuff that's just not being effective and you're going to have to measure a lot of variables that almost gets behind the human mind so they're going to be those types of issues as you get more and I call that a little bit getting more into the intermediate level AI now ultimately you're going to ask AI to design AI you know you're going to try to get to another whole level in meta here and that that gets to be a science fiction novel and hopefully with a good ending not a bad ending but you I think that's some of the concerns that people like Iwan has when you look at that level and AI is designing AI how do you keep it within the rails so in other words how do you keep it friendly to humanity as one of its prime directors as they to coin a term from Star Trek days the prime directive to always you know to protect human life and as as the prime directive and I think that you know I guess there's going to be nefarious people maybe",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 58,
      "start_timestamp": "01:00:15",
      "start_timestamp_seconds": 3615.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3615"
    }
  },
  {
    "text": "to humanity as one of its prime directors as they to coin a term from Star Trek days the prime directive to always you know to protect human life and as as the prime directive and I think that you know I guess there's going to be nefarious people maybe China and who knows that we'll just ignore that and do whatever they want and then there be other more ethical AI generations that come out with limitations on what they do but no end in sight for what the AI could dream that it could do by pulling all these different things together so I think I see a positive effect I see that being make it a more efficient economy more efficient manufacturing more efficient I already see lots of different aspects of technology in terms of even keeping track of at standpoint funds which I'm the chairman of here in Scottsdale it's a mutual fund that trades 75 alternative markets and a bunch of equity exposure as well all in the one mutual fund is done very well it's over a billion and five-year track record very very nice however trying to keep track of all of the various marketing channels and clients and all of this stuff requires some pretty interesting software right it's way beyond anything that I ever had back in the day at Trendset trying to market my measly little six hundred million dollar money management firm back in the day 20 years",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 58,
      "start_timestamp": "01:01:25",
      "start_timestamp_seconds": 3685.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3685"
    }
  },
  {
    "text": "the various marketing channels and clients and all of this stuff requires some pretty interesting software right it's way beyond anything that I ever had back in the day at Trendset trying to market my measly little six hundred million dollar money management firm back in the day 20 years ago so you know the world marches on there's lots of new technologies and capabilities back when I started there was no ability there was no internet basically I didn't have the worldwide web I couldn't talk to a Tom Baso as a mentor of some sort or have an interview with with some of the big money managers back in those days I maybe read a Wall Street Journal article bottom or I could speculate or read a book on them or something like that but I can get the talk to them so you had to dream up your own ways of creating what it is that you're going to trade and how you're going to protect your position sizing and you just had to use your own math skills and capabilities to figure it out on your own and fortunately I waited through all that over the last 50 years but nowadays geez there's so much read there's so many resources it's almost confusing it's almost the opposite you have so many people who do you believe who do you want to talk to who who do you which book do you want to read there's too",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 58,
      "start_timestamp": "01:02:47",
      "start_timestamp_seconds": 3767.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3767"
    }
  },
  {
    "text": "last 50 years but nowadays geez there's so much read there's so many resources it's almost confusing it's almost the opposite you have so many people who do you believe who do you want to talk to who who do you which book do you want to read there's too many of them you know it's yeah it's that's the craziest part too because when I started trading in 07 obviously trading it come a long way by that point clearly but like it still wasn't what it is now and it's the the problem set is fascinating because when I when I first started there was a handful of like books on options and derivatives there's not a bunch and now it's unlimited so it's very much information overload it seems but you touched on a lot of really cool parts about AI and actually some of the elements that I'm so excited or is like how multivariate it can become in how many different levels of industry business economy that it can impact which would be really cool to really cool to check out so I appreciate your thoughts on it. Eric I would caution traders which you know probably traders are going to be more watching this than any other group in the country out there and I would caution traders though from an AI standpoint I would almost call that over optimizing history because AI is naturally going to go off of data data is going",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 58,
      "start_timestamp": "01:04:00",
      "start_timestamp_seconds": 3840.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3840"
    }
  },
  {
    "text": "know probably traders are going to be more watching this than any other group in the country out there and I would caution traders though from an AI standpoint I would almost call that over optimizing history because AI is naturally going to go off of data data is going to have to be historical data price moves that happen economic data that comes in whatever pieces of data the AI can come up with the AI cannot come up with necessarily opinions what they'll do is they'll correlate all this stuff based on what's happened in the past and they will over optimize the heck out of it and say you should be going long now because of the following reasons and by the same token if you take a simulation platform and I've done this I'm absolutely positive that this is the case and you over optimize you run it like a thousand cases and you vary the parameter from point one to point point one to 1.0 by 0.01s or something and then you have another variable and you change those and you increment those and you'd run every possible one of the 1000 cases and then you say you know case number 537 made the most money in history so that's the way I'm going to trade the market the market will never do that again ever in your lifetime and I did all this great work what the heck happened and I worry that AI",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 58,
      "start_timestamp": "01:05:09",
      "start_timestamp_seconds": 3909.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3909"
    }
  },
  {
    "text": "you say you know case number 537 made the most money in history so that's the way I'm going to trade the market the market will never do that again ever in your lifetime and I did all this great work what the heck happened and I worry that AI will tend to give you similar types of answers so be careful on how you use it it's a it's a tool I think if you're trying to look for trade-offs and scenario analysis and what some of the possibilities would be maybe you could use it for that you certainly can use it to do screenings of vast quantities of information and you know say something like give me the the 10 worst one-year periods for the SP 500 over the last 100 years well then it can go back and find that and return it if you ask it to then say well given where we are right now should I be buying or selling that's another whole problem that's a different I think you get you're gonna end up as a trader having to make that decision yourself and it adds a new paradigm too because a lot of edge historically used to come from information scarcity and the people that would pay to acquire the information and then create things and now I actually think that there's going to be a pretty profound impact yeah exactly it's almost go the other way people will be so",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 58,
      "start_timestamp": "01:06:28",
      "start_timestamp_seconds": 3988.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=3988"
    }
  },
  {
    "text": "lot of edge historically used to come from information scarcity and the people that would pay to acquire the information and then create things and now I actually think that there's going to be a pretty profound impact yeah exactly it's almost go the other way people will be so drowned in information and so over optimized on history that they'll lose sight of the forest for the trees and end up in the middle of all this noise trying to make sense of it all and I'll be sitting here with my long-term 21-day indicators in boring fashion doing my work like in 40 minutes every afternoon and just kind of yawning at all this nonsense that goes on that I just ignore and it's like the world has passed me by in a way but in a good way I have just stuck to what I do and I'm sort of outside all the nonsense that goes on and uh keep my life pretty easy well I think that's also one of the beauties of building the the opposite of an overfit right in a robust approach that allows us to to generally process so yeah yeah I love that every move of cocoa for instance we started the station about my number one position profitability wise today coffee is number two I guess no uh corn is number two to the downside coffees number three um but you know the all of those have broken out of",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 58,
      "start_timestamp": "01:07:50",
      "start_timestamp_seconds": 4070.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=4070"
    }
  },
  {
    "text": "love that every move of cocoa for instance we started the station about my number one position profitability wise today coffee is number two I guess no uh corn is number two to the downside coffees number three um but you know the all of those have broken out of sideways periods and are now on a big trend I'll catch every one of them with what I'm doing right my indicators will always pick those up because I'm a trend follower so it's sooner or later whether it's a shorter indicator of go over quicker long-term want to go over a little later eventually if it's a big move they're all going to go over in the direction that I want them to go over and I'm going to make money on that big run and I just do one of those every quarter or half a year and it probably pays my way because I make so much off of that that you know all the rest of the stuff just adds up to nothing or chunk change it really doesn't make that much difference it's a lot of work to get nowhere but you got to be on on those big runners that's the key right yeah Tom always awesome catching up get a chance to learn a lot and understand thanks for walking through a lot of your perspective just on where the market is today because we're in a weird time and I think that",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 58,
      "start_timestamp": "01:08:57",
      "start_timestamp_seconds": 4137.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=4137"
    }
  },
  {
    "text": "on on those big runners that's the key right yeah Tom always awesome catching up get a chance to learn a lot and understand thanks for walking through a lot of your perspective just on where the market is today because we're in a weird time and I think that yeah I think the next uh 12 to 18 months are going to be interesting to watch so people can get a hold of you enjoy the ride dot world I'll include that link in the notes below but anywhere else that you want to send people that's the website most of the people that follow me out of all the social media seem to be on x x it's at bosso b a s s o underscore tom got it well if it's anything other than that you've got an imposter and I get one a week so be careful out there uh yeah and I'll grab the correct link and I'll throw that in the notes as well for everybody so that they are directed to the Facebook and LinkedIn and truth social and I forget where I have a what do you call a sub stack articles that I write every now and again there's some interesting stuff there if people are interested in reading some of my sub stack pieces mostly on trading or life uh attitude psychology of trading that type of stuff so for a trader there might be some interesting stuff in there",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 58,
      "start_timestamp": "01:10:09",
      "start_timestamp_seconds": 4209.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=4209"
    }
  },
  {
    "text": "that I write every now and again there's some interesting stuff there if people are interested in reading some of my sub stack pieces mostly on trading or life uh attitude psychology of trading that type of stuff so for a trader there might be some interesting stuff in there for people but there's lots of ways you can get a hold of me beautiful well yeah Tom thanks for thanks for sharing and thanks for hanging out as always I mean we'll definitely connect again you know in a few months and see how things are going I always look forward to it awesome take care everybody see Eric",
    "metadata": {
      "video_id": "gnABTnW-KX8",
      "title": "Election Impact on Markets and AI - Tom Basso | TOP",
      "url": "https://www.youtube.com/watch?v=gnABTnW-KX8",
      "upload_date": "",
      "duration": 4314.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 58,
      "start_timestamp": "01:11:16",
      "start_timestamp_seconds": 4276.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=gnABTnW-KX8&t=4276"
    }
  }
]