[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you is we're going to in it via a live stream these so it's just like a could you it be a lot vine and so I'm doing it via a live stream so I'm doing a lot of industry watching live stream and giving your who's voting for Poetan, which makes sense. I think he's the favorite by a landslide in that fight rightfully so. We got Lance, we got CDIJ seedage. I guess if I say that, we'll call that a seedage. I love your interview with Peruvian Bull. Thank you. Yeah, for sure. I enjoyed it. Yeah, I liked it a lot. I had a anytime I have to pick up different pieces of this whole thing. It's worth it to me because again, one of the things I think is important, especially as I spend time doing like these live streams and stuff, is one, I learn a lot, but two, it's also to try and give back as much as I can with the information that I'm learning and then to share the information more broadly, right? Like that's the whole idea behind it. So, I'm glad that the conversation was awesome. I enjoyed it a lot. He is a lot of interesting perspectives. I like that he's that's the first time I've ever spoken with him. So, I didn't know how that was going",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=0"
    }
  },
  {
    "text": "broadly, right? Like that's the whole idea behind it. So, I'm glad that the conversation was awesome. I enjoyed it a lot. He is a lot of interesting perspectives. I like that he's that's the first time I've ever spoken with him. So, I didn't know how that was going to go. You never know if like, because I've come, I've had some offline conversations with some people who honestly like I wouldn't spend a lot of time talking to, simply because I'm interested in information. I'm not interested in like heavily weighted opinions that are biased. And what that means is if somebody has an opinion that's based on information, I want to hear that. But if somebody just has a random opinion just because they feel like having an opinion, I couldn't possibly fucking care less about that. So, I find sometimes some of the people that I'll have conversations with do fall into that ladder camp where they'll have things that they want to say, but then when I probe a little bit to try to understand, it's not because I'm trying to prove somebody wrong. I could, there's no right or wrong, right? Like it's literally just what is factual versus what's not. And some people they just clearly start buckling when we're trying to pull a thread a little bit to follow a thought. That's actually one of my favorite things about the conversations that I still have with Newton is that Newton is very",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 103,
      "start_timestamp": "00:10:45",
      "start_timestamp_seconds": 645.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=645"
    }
  },
  {
    "text": "just what is factual versus what's not. And some people they just clearly start buckling when we're trying to pull a thread a little bit to follow a thought. That's actually one of my favorite things about the conversations that I still have with Newton is that Newton is very receptive to like a scholastic slash logical back and forth dialogue, right? Like here's an idea. This is a conversation around that idea to explore the idea itself. I value that tremendously because I think that's how you learn. But I find some people, they don't, well, they don't like the work part of it, right? Which is to find the information to formulate an idea. So, where did I leave off? We have Lauren who showed up late. That's okay, Lauren. Whenever you feel like showing up, Lauren is the perfect time to show up. We got Day Swag. We got me. Yeah, what up outlier trading? That's a nice link that you dropped. Good for me. Ollie Zach, J.Cart says hike in the door, dash, chip. Awesome. Thank you. They, I actually had to do that. I had to turn his car around for him on my driveway. I wish I could like turn the camera. It's like set up kind of delicately. But like my driveway is super steep. It's literally like like genuinely maybe a 30 degree angle, 35 degree angle. So some people, they get really nervous because it's like going up into space because",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 103,
      "start_timestamp": "00:11:49",
      "start_timestamp_seconds": 709.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=709"
    }
  },
  {
    "text": "I wish I could like turn the camera. It's like set up kind of delicately. But like my driveway is super steep. It's literally like like genuinely maybe a 30 degree angle, 35 degree angle. So some people, they get really nervous because it's like going up into space because we live on like a bit of a hilltop that overlooks a nature preserve. And there was a dude that was up here that I ended up popping out and like turning his car around. And literally, it was just like, because I ended up giving him a really good tip because you know, you tip ahead of time. And I, I had given him a good tip. And he was just like, he was so genuine. He's like, dude, I just don't feel comfortable taking that tip when you had to turn my car around for me. And I was just like, no, bro, it's like, it's think of it from like everybody, right? It's not just for me, but I thought that was a hilarious comment because there's, I thought it was cool that somebody felt actually some tie to the tip, right? Like that they wanted to do a good job. I feel like a lot of people in the tip and culture, it's like just a granted, right? You should give me a tip. And it was very, very cool that he didn't behave that way at all. That was, I don't know, I thought it",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 103,
      "start_timestamp": "00:13:01",
      "start_timestamp_seconds": 781.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=781"
    }
  },
  {
    "text": "do a good job. I feel like a lot of people in the tip and culture, it's like just a granted, right? You should give me a tip. And it was very, very cool that he didn't behave that way at all. That was, I don't know, I thought it was novel. Maybe my faith in humanity isn't super great, but I did not expect somebody to come with that. So yeah. Yeah. Dayswax is, but I'm out for a walk with my dog and looking at the night sky and stars. Do you all love stargazing and dreaming? I have a Celestron telescope literally right there. I'm looking at it in my office. Love space. It is probably one of my biggest non market related nerd hobbies. And I don't like charting stars and shit like that. But like I don't really care about cataloging stuff. But I find it always humbling to think about the scope and size of things and the structure of things. So yeah, very much so. Literally I have, yeah, I have a couple telescopes. Most of them are super expensive that I can hook up to like a computer and then I can like look for specific things, track certain things. And it's always absolutely fascinating. Fun story about that telescope though. I had a bunch of friends over one night and I wasn't drinking because I'm kind of I don't really drink that much anymore. But a lot of my marine buddies",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 103,
      "start_timestamp": "00:13:58",
      "start_timestamp_seconds": 838.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=838"
    }
  },
  {
    "text": "like look for specific things, track certain things. And it's always absolutely fascinating. Fun story about that telescope though. I had a bunch of friends over one night and I wasn't drinking because I'm kind of I don't really drink that much anymore. But a lot of my marine buddies still drink exactly as you imagine as most Marines would drink, which is fucking egregiously heavily. Long story short, set the telescope up, easy big target looking at the moon. And they like the moon was behind a cloud. And the cloud had like shifted out right as somebody was like bending over to look. And if you're losing a really good telescope, it is fucking bright, really bright. There's actually filters that we put on them so that you don't nuke your eyes. So this dude is like standing outside for like 20 minutes, eyes adjusted to the dark in my backyard drunk hanging out and then he like goes to bend over. And like look at the telescope and he like reels back. And he was just like dude, it feels like the fucking moon just came in my eye. And he's just like sitting there holding his eye close. So every time I look at that telescope now, I think of the moon coming in my friend's eye, which is a it's a fond memory. I have to be honest. I don't want to say that I wouldn't have prevented it if I knew that the cloud",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 103,
      "start_timestamp": "00:15:04",
      "start_timestamp_seconds": 904.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=904"
    }
  },
  {
    "text": "eye close. So every time I look at that telescope now, I think of the moon coming in my friend's eye, which is a it's a fond memory. I have to be honest. I don't want to say that I wouldn't have prevented it if I knew that the cloud was going to move and stuff. But with that line that was dropped, I think his pain was completely worth it for me to always have that memory. So I don't think I would prevent it slightly selfishly. Yeah, I feel a little bad about that because you want to like be able to help your friends and you know, take care of your friends, but sometimes a little bit of pain for your friend is worth the overall humor. And that's a joke that keeps on giving. We're big fans of that joke. So yeah, I don't think I don't think he was ready for how bright that moon can be. All right. Let's grab our shit. So first things first, we have to start with this as you know, any new ads to our GameStop Ape map. I guess I need to rename this. I'm just going to do Ape map. I think that's better. Any new ads for this one? Do we have anybody from Papua New Guinea, Russia, Mongolia, China, India, Zaksas Anchorage, we don't have Anchorage. So we'll add Anchorage. That's actually where we flew into when we went to Alaska. Oh, yeah, while we're",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 103,
      "start_timestamp": "00:16:13",
      "start_timestamp_seconds": 973.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=973"
    }
  },
  {
    "text": "do Ape map. I think that's better. Any new ads for this one? Do we have anybody from Papua New Guinea, Russia, Mongolia, China, India, Zaksas Anchorage, we don't have Anchorage. So we'll add Anchorage. That's actually where we flew into when we went to Alaska. Oh, yeah, while we're here, I'll show you what we did. When we flew into Alaska, we landed here. We drove here, stayed here. Then we drove here, went down Nick River. We were going to go up to Denali, but didn't didn't make it that way. We went this way, came all the way back down. Then we went to this little ski resort thing, Alieska. Then we went to Portage. We went down here. This is actually where I almost lost my drone, checking out these glaciers. Then we went down this way. We stayed over here, came back in, down moves past, down to Seward. stayed here. This is where we did the helicopter stuff. We stayed here for a few days. There's a really cool view of this glacier. Took a boat. Actually, that spot that we stayed on the boat was over here. Actually, Orca Island cabins right in there. It's like a pretty long boat ride. It's like 40 minutes across there. Then we came all the way back, all the way back. The last night we stayed down in here. Is this right? No, I lied to you down in here. Then we walked in the lake",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 103,
      "start_timestamp": "00:17:29",
      "start_timestamp_seconds": 1049.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=1049"
    }
  },
  {
    "text": "there. It's like a pretty long boat ride. It's like 40 minutes across there. Then we came all the way back, all the way back. The last night we stayed down in here. Is this right? No, I lied to you down in here. Then we walked in the lake before we bounced. We have South Korea. I think we already have South Korea. Let's zoom out. Let's see. Some Koreas. Oh, we don't. Nice. Great call. South Korea. Get that one. Then New Orleans. I think we probably have that. Let's see. I had it anyways. We have some representation down on the bayou. Look at all that. Anytime I see water like this, I just think fucking mosquitoes. Anytime I see this shit, mosquitoes, lots and lots of fucking mosquitoes. Hate mosquitoes. Solcha, Alaska. I never heard a no-solcha. Where's that at? Tell me where solcha is. Nana River. Where the fuck are we? Oh, damn. That is like that's in there. Real in there. Then we have Colorado. I think we have Colorado representation. We do in Denver. I'd rather be skiing since Florida. We're in Florida. Florida. Florida. Yeah, the dude that I'm actually going to go see, he's up here in Jacksonville, which quick question for those in Florida. Am I flying into a fucking hurricane if I go there? By the way, because I asked him, I was just like, yo, should we move this until the fucking hurricane is done, hurricaneing? And he",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 103,
      "start_timestamp": "00:18:49",
      "start_timestamp_seconds": 1129.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=1129"
    }
  },
  {
    "text": "go see, he's up here in Jacksonville, which quick question for those in Florida. Am I flying into a fucking hurricane if I go there? By the way, because I asked him, I was just like, yo, should we move this until the fucking hurricane is done, hurricaneing? And he said it wasn't bad there. But I'm trying to know if I'm about to like crash the plane and not make it. Because that's one thing I was telling Mel, it's like a consolation thing where I think if I do fly out and my plane crashes, I do not have to worry about the herniated disc anymore. There's no sciatic pain. Herniated disc now is hands are washed of it. So it's not exactly the worst possible outcome that I could conceive of, although it's not ideal, I don't believe. So I would wait a week, West Coast going to get slammed. Yeah, that's what I thought. That's exactly what I thought. So man, where's this fucking hurricane? And then we'll get started. What's the hurricane that's about to kill Florida? I thought it's already fucking Florida. Where is this a new one? Hurricane Debbie, you just know what the fucking name like Debbie, you just know that that's going to be shit, right? Like Debbie is a terrible name for her McCain. It's like almost like Hurricane Kathy. I wouldn't call it quite as bad as Hurricane Kathy, but I also would not call it as bad as",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 103,
      "start_timestamp": "00:20:47",
      "start_timestamp_seconds": 1247.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=1247"
    }
  },
  {
    "text": "the fucking name like Debbie, you just know that that's going to be shit, right? Like Debbie is a terrible name for her McCain. It's like almost like Hurricane Kathy. I wouldn't call it quite as bad as Hurricane Kathy, but I also would not call it as bad as Hurricane Kathy. It feels a little bit like a hurricane Kathy. So this is a new one. Wait, Milton? Milton, aha, I see. So I see, so there's Milton. So Debbie was done. So Debbie, I see, I see, I see, I see, I see. Okay, so Debbie is done. Debbie ran what from the third to the ninth. So we're over Debbie. And now we have Milton. I don't fucking trust Milton. That's not a great hurricane name either. Where's this thing coming? What? Yo, there's no fucking way. There's no fucking way that I'm going. What the fuck is this? How did this do pretend like, ah, no, it's all good. That is a hurricane directly where I'm going. There's no fucking way. This is madness. What is this Saturday? What is it? Is this today Saturday? Is this is talking about a category three when it hits the land? No way, dog. Uh-uh, no way. Okay. So I need to adjust my travel plans because there ain't no fucking way. That's not dude. That is a dad. CDJ says it's a Florida thing. Well, fuck that. I'm fucking flying in on a damn plane. There ain't no",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 103,
      "start_timestamp": "00:22:18",
      "start_timestamp_seconds": 1338.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=1338"
    }
  },
  {
    "text": "the land? No way, dog. Uh-uh, no way. Okay. So I need to adjust my travel plans because there ain't no fucking way. That's not dude. That is a dad. CDJ says it's a Florida thing. Well, fuck that. I'm fucking flying in on a damn plane. There ain't no fucking way. So yeah, we're going to have to figure out the travel accommodations because that is that looks like direct fucking strike. This was what Saturday today I assume. What's the date on this? Updated the fifth. Yeah. So it's got to be today. So today, this thing's chilling out here. And then by Wednesday, it's ruined people's lives. That's what's going to happen. Robo says you're just going to sit in an airport. Something like that. But I'm not fixing a, I'm not fixing a fucking fly through this shit. That's for sure. Yeah. Okay. That's great to know. There ain't no way. Oh, wait, there's another McCain. Yo, Florida. What the fuck? So hold on. So there's Debbie. That was three to nine. Then there's Pauline on the 26th of September. What is this madness? Yo, shout out to fucking Florida. Shit. That ain't no joke. They got screwed too. Okay. They swags as maybe bring a rain jacket. I feel like the rain is less of the concern with the hurricane. I think the correct response is maybe bring a fucking parachute. Something like that because I'm less concerned about getting wet. I'm more concerned about",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 103,
      "start_timestamp": "00:24:02",
      "start_timestamp_seconds": 1442.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=1442"
    }
  },
  {
    "text": "got screwed too. Okay. They swags as maybe bring a rain jacket. I feel like the rain is less of the concern with the hurricane. I think the correct response is maybe bring a fucking parachute. Something like that because I'm less concerned about getting wet. I'm more concerned about my plane being sucked up in a hurricane and jostled around like it's in a blender and then subsequently post-haced crashing into earth without landing gear without like a, you know, a nice glide plane coming in. That's more what I'm concerned about. Less so much the old rain. So yeah, Lance says you don't want a parachute and those kind of wins. No, no, there's nothing about me that says I want to go skydiving. But there is something that says I would take a parachute and run the risk of getting blown around in a hurricane. Shoot all get all tied up and stuff. That's fine. That's there's at least a shot. Otherwise, if you're in a plane that is crashing, the outcome is already known from the onset of that experience. There is no other chance. So lock that. Ain't no way. Ain't going to be me. Okay. Well, this was highly educational. And I now know we need to make some travel plan changes. So whoever is down here in Florida, fucking shout out to you and good luck homey, get some fucking sandbags. That's another thing I never really understood about the American or humans",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 103,
      "start_timestamp": "00:26:09",
      "start_timestamp_seconds": 1569.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=1569"
    }
  },
  {
    "text": "Okay. Well, this was highly educational. And I now know we need to make some travel plan changes. So whoever is down here in Florida, fucking shout out to you and good luck homey, get some fucking sandbags. That's another thing I never really understood about the American or humans in general. But this happens like every year. I'm just saying I'm just saying if it happens every year, it might not be the place to live. I'm just fucking saying I'm just saying it might not be the spot to live. I get it home where the heart is, fucking move the heart that somewhere that doesn't flood. But getting smashed by hurricanes, I just think is. I don't know. I guess it's yeah. So I'd rather be skiing says, but it's paradise. I've been a Florida. For me, it's fucking swampy. It's super humid. I like Florida a lot to be super clear. Big fan. But I get straight up disrespected by the mosquitoes there and it is humid AF. So I don't know if I would call that paradise. But that aside, the tax picture is definitely paradise that I get. But there's also other ways around that that's a whole other live stream. Zacharias says 80 of the population lives on the coast humans rely on the ocean. Let's take a look. I've heard numbers like that. I genuinely don't know what it actually is. What percentage of the human population lives near a coast? I",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 103,
      "start_timestamp": "00:27:27",
      "start_timestamp_seconds": 1647.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=1647"
    }
  },
  {
    "text": "that that's a whole other live stream. Zacharias says 80 of the population lives on the coast humans rely on the ocean. Let's take a look. I've heard numbers like that. I genuinely don't know what it actually is. What percentage of the human population lives near a coast? I think it's a lot. Okay. So first of all, Zacharias, this is the problem of saying shit, of just saying shit that you've heard somewhere. I'm just saying. This is the problem of just saying shit. It's like less than half the population apparently lives near. Just say it. This is exactly why when it comes, this is exactly why when it comes to analyzing information, I'm highly skeptical of everything always, always because you have to check it. Zacharias says within one or 200 miles. Yeah. So that says within 60 miles, 100 kilometers. If you're 200 miles from the ocean, like you're not near the fucking ocean anymore, like you're several hours from the coast. So I don't even consider 100 miles that close. You're like, you're not that close at that point. If you're 100 miles away, like that, that's a massive distance. So I don't buy that. I actually think 60 miles is pretty gracious. I would call it like 40 to 50 miles. I think that's coastal because even here in California, right? Like let's use this as an example. I personally do not consider the Anzo-Barego Desert coastal, but by the 100 mile definition,",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 103,
      "start_timestamp": "00:28:52",
      "start_timestamp_seconds": 1732.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=1732"
    }
  },
  {
    "text": "that. I actually think 60 miles is pretty gracious. I would call it like 40 to 50 miles. I think that's coastal because even here in California, right? Like let's use this as an example. I personally do not consider the Anzo-Barego Desert coastal, but by the 100 mile definition, let's see maps. Let's take a little peekaboo. And then let's do San Diego to Anzo-Barego. Mind you, this is driving. How far do we think it is via driving distance? It's 73 miles. It's a fucking desert. It's a completely different climate. I do not consider this coastal. This is 70 miles away. Not coastal. Not hit me with that bullshit. So damn you, Zachariah. Have me out here thinking 80 percent. It's 40. Nonsense. Okay, I think we have our map updated. If you guys can, as always, continue scouring for people because we really could use Greenland for sure. That would be fucking sick. What is this here? Svalbard. If we can get a svalbardian. Or, oh, I don't know if it's Tasmania or Madagascar. What do you guys think? If we were to set our sites, I want either a Greenlander or a svalbardian. That's the first request. Second request is either a Madagascarian or a Tasmanian. I think if we can get one from either of those, both of those groupings, that would be about perfect. 81.4 of the population lives in coastal states. Yeah, coastal states is a completely different thing. Look at Australia.",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 103,
      "start_timestamp": "00:30:31",
      "start_timestamp_seconds": 1831.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=1831"
    }
  },
  {
    "text": "first request. Second request is either a Madagascarian or a Tasmanian. I think if we can get one from either of those, both of those groupings, that would be about perfect. 81.4 of the population lives in coastal states. Yeah, coastal states is a completely different thing. Look at Australia. This is considered this is a state. This is a state. This is a state. This is a state. This is a state that used territories. But like, it's all coastal, but I'll tell you what's not coastal fucking Alice Springs. I've been there before. There ain't shit in Alice Springs. That is bum fuck nowhere, Australia. So yeah, we can call it coastal because it touches the water up in Darwin, which I've also been at. But this ain't coastal dog ain't no way. So yeah, bad gouge. Bad gouge, Zachariah. Zachariah, I hate to do this because you're a friend of the channel. But we have to give you a Dimerit. The main reason for the Dimerit is because then you try to justify it. That's the problem. That's the problem here. Coastal states. I think that was US even worse. Yeah, because I mean, who the fuck lives in North Dakota? Like, I know there's farmers and stuff there and shout out to the farmers. You all are awesome. But I mean, there ain't nobody there. I've been out to Nebraska before and I can literally guarantee you there ain't nothing there. For sure. There is a",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 103,
      "start_timestamp": "00:32:27",
      "start_timestamp_seconds": 1947.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=1947"
    }
  },
  {
    "text": "lives in North Dakota? Like, I know there's farmers and stuff there and shout out to the farmers. You all are awesome. But I mean, there ain't nobody there. I've been out to Nebraska before and I can literally guarantee you there ain't nothing there. For sure. There is a glorious lack of anything in Nebraska. A massively lack of anything. All right. That's kind of a fun random about of shit. But let's get to work now. We have some work to do. Let's grab our worksheet. I need... Is it this one? Correct. Correct. So I can move our ape map out of the way for now. I can move over to our workbook. Our K trades. Let's take this in a 90 zoom. I thought it froze this top row. That doesn't really matter. Okay. Dr. Norman Norway. I think we have another Norwegian, but let's hit up Norway, Dr. Norman. Where's that at? I didn't hit. I didn't go there. Oh, we definitely went through Dr. Norman. That's for sure. But we didn't stay there. That's the exact route we took back to. Yeah. So we went through Dr. Norman, but we didn't we didn't stay in Dr. Norman. Jimmy. Jimmy says, when are you going to livestream with the bull again? That was fun. Definitely at some point. I think it would be fun. Because this time we I spent most of the time just trying to understand him because I haven't talked to him",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 103,
      "start_timestamp": "00:34:12",
      "start_timestamp_seconds": 2052.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=2052"
    }
  },
  {
    "text": "in Dr. Norman. Jimmy. Jimmy says, when are you going to livestream with the bull again? That was fun. Definitely at some point. I think it would be fun. Because this time we I spent most of the time just trying to understand him because I haven't talked to him before. But I would really like to do another conversation and like, like, work through ideas. That would be very fun. So definitely at some point. So we have our workbook all set up. We have DFVs stuff over here. I am going to condense this down a bit. I don't I'm not going to keep this scratch stuff. Not going to keep that scratch stuff or that and to clean this all up for us. So it's nice and readable. We left off 16 April, which is I think his last before he came back. So now let's let's get it. So we have two June. So he was gone for 11 43 days. And let's get into the weeds, shall we? This I'm going to squish down. And then this I'm going to squish down so that they fit. And I'm going to take this out a little bit further. It might be hard for you to see all zoom in when we need to. Okay. So total gain is six eight six three one six one dot five five five. Ash 29 27 six 400. Five six value to 10 six seven six 400. Five six. Big",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 103,
      "start_timestamp": "00:36:18",
      "start_timestamp_seconds": 2178.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=2178"
    }
  },
  {
    "text": "bit further. It might be hard for you to see all zoom in when we need to. Okay. So total gain is six eight six three one six one dot five five five. Ash 29 27 six 400. Five six value to 10 six seven six 400. Five six. Big big change. So now we're holding. We have five million shares at 21 274 plus 120 K 21 June 20 calls. All right. Let's spend let's spend some time here. So one thing I want to do is see if we can deconstruct when when these were entered. The shares are way more tricky way more tricky because with that big of a gap, we can either come with the assumption that he held his shares that whole time and then built up or we use another assumption that he traded in and out around the shares. I have I literally have no idea. And there's no way for us to know because game stop traded all over the map. Let's do a quick look at the the share. Vladimir says easily grew to 200 mil with just trading shares a few times between April 21 and mid May. Well, first let's I understand what you mean by easily, right? Like it's very possible. That's I agree. I don't think he would have done it with shares. Just don't see that. And the reason why I don't see that is because from what we've seen so far, he's not decreased",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 103,
      "start_timestamp": "00:37:56",
      "start_timestamp_seconds": 2276.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=2276"
    }
  },
  {
    "text": "first let's I understand what you mean by easily, right? Like it's very possible. That's I agree. I don't think he would have done it with shares. Just don't see that. And the reason why I don't see that is because from what we've seen so far, he's not decreased share position. And he really likes to use options. So my personal opinion again, this I can't justify this other than by what I've been learning by studying the movements by personal opinion is that the movement, the delta between the account value at 38 to 210 is very likely due to options primarily. Now the shares obviously contributed 9 million from the from this point, whatever this point is. But what we can do is his birthday is June 8th. Look at Jimmy share price on his B day in 21. Sure, let's take a look. I don't I honestly don't think that matters whatsoever, but happy to take a look. And I'll explain why I don't think it matters whatsoever. Because again, as I'm looking more and more at his older videos, I'm learning a lot. And it's actually funny because I see somebody who's very, very much verbally processing on these live streams, which is fascinating, right? Because it's not this really refined discrete picture. He admits to when he's making mistakes, which are numerous, like all of us. Again, this is not saying anything negative about him. I'm just saying the reality of what I'm picking",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 103,
      "start_timestamp": "00:40:24",
      "start_timestamp_seconds": 2424.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=2424"
    }
  },
  {
    "text": "verbally processing on these live streams, which is fascinating, right? Because it's not this really refined discrete picture. He admits to when he's making mistakes, which are numerous, like all of us. Again, this is not saying anything negative about him. I'm just saying the reality of what I'm picking up from these streams. So this idea that he's like perfectly timing all of these trades because he has some sort of like magical way to detect this stuff. I genuinely do not see that. And I think that he obviously uses massively heavy leverage. That is the overwhelming contributor to how this has worked out so far for him that I can see clear as day. But the like the way that we're entering and moving around trades is completely different. Renegade says him and R.C. are communicating via tweets. No doubt about it. I think there's a heavy doubt about that. But before we get further, you already know. We got to get uniform appropriate for this part. Because we're talking about some theories now. None of this, none of this can be proven or disproven. These are all straight up theories. But I do not think him and R.C. are communicating at all. And the reason why I think that is because if they do that, the probability of them, if that ever, if one of them either or is investigated for any reason for anything related to this, if there's any sort of communication direct communication",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 103,
      "start_timestamp": "00:41:43",
      "start_timestamp_seconds": 2503.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=2503"
    }
  },
  {
    "text": "and R.C. are communicating at all. And the reason why I think that is because if they do that, the probability of them, if that ever, if one of them either or is investigated for any reason for anything related to this, if there's any sort of communication direct communication between them, like DMing, talking about the future of the company, straight like anything like that, that is an immediate giant issue for both of them, massive issue. So I don't think either of them would, would, I don't think either of them would communicate like that. Zacharias says no DMing, tweets and memes, hieroglyphics, sure. I think that they, I think they enjoy trolling for sure. And I think that they like, you know, playing games with one another, because yeah, there's definitely indirect communication. But I would just be super, super clear, because communicating makes it sound like I'm talking to you, right? That's, that's the inference when we use communicate in that context. But I absolutely think that, yeah, for sure, they're probably fucking around with one of them. They're both trolls, right? Like if you look at what they do, they both fucking troll. So of course, that they're going to poke some fun, have fun with one another. That I completely agree with. But all of that would be completely indirect communication. Because the risk of any sort of direct communication is so unbelievable. And that's like, that's not even like slap on the wrist.",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 103,
      "start_timestamp": "00:43:05",
      "start_timestamp_seconds": 2585.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=2585"
    }
  },
  {
    "text": "course, that they're going to poke some fun, have fun with one another. That I completely agree with. But all of that would be completely indirect communication. Because the risk of any sort of direct communication is so unbelievable. And that's like, that's not even like slap on the wrist. That's like fucking jail. So I absolutely think that there will be some again, completely indirect, you know, nods, tips of the caps. But like even with something like, you know, tweeting, they're not adding one another. They're not commenting on each other's shit. And I think all of that is very purposeful to keep a healthy delineation between them, which I do think is kind of important. Yeah, because neither one of them are trying to go to fucking jail. I can guarantee you that. Zachary says, but if he's holding that many shares, he could definitely be on the earnings call if he wanted, right? Well, I mean, technically, all of you can anybody that is a shareholder can be on the earnings call. So you just dial in. So yeah, that's like shareholders gain access to the earnings calls inherently. You don't have to be an outsized, outsized trade there. RC's latest tweets equal. Willie says thoughts on RC's latest tweet. I think he's fucking around. Honestly, this Harkins back to when I saw that interview that he did with that one dude and he was asking them about different tweets. And like the underlying theme that",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 103,
      "start_timestamp": "00:44:33",
      "start_timestamp_seconds": 2673.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=2673"
    }
  },
  {
    "text": "outsized trade there. RC's latest tweets equal. Willie says thoughts on RC's latest tweet. I think he's fucking around. Honestly, this Harkins back to when I saw that interview that he did with that one dude and he was asking them about different tweets. And like the underlying theme that I saw in that interview was there's no message in a lot of these things. So Ryan Cohen interview. We'll take a look together. It's this one. So let's take a look at this. For example, and let's listen. First thing about these, making sure it's at the exact certain time or anything like that. No, no, right. I didn't even mean to click that part, but he's asking like, is this specific time of this meaningful? And he's saying, no, like it's literally not. And he's just like he's just fucking around. So my guess with the wrinkly forehead thing, I genuinely believe it's him fucking trolling. That's what I think. The other thing I noticed when I look at something like Roryn Kitty's communications, I think that when I look at Roryn Kitty's communications as well, they became more cryptic as his popularity gained. And again, I think that's him trolling. I don't necessarily think that's him. He's not trying to hurt anybody, but I think it's him just essentially being able to amplify his personality and play around because even the stuff that we saw in some of the cats early posts, right. So if we take",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 103,
      "start_timestamp": "00:45:48",
      "start_timestamp_seconds": 2748.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=2748"
    }
  },
  {
    "text": "that's him trolling. I don't necessarily think that's him. He's not trying to hurt anybody, but I think it's him just essentially being able to amplify his personality and play around because even the stuff that we saw in some of the cats early posts, right. So if we take a step back from this and we go down here, this literally perfect. What's an exit strategy? To do it as a fucking exit strategy, right? Like it's unequivocal. He has a, I literally can see him exit things. And I can see a trend with how he exits some of these things. So he has a fucking exit strategy. He's just trolling. Like he's literally just trolling. He's just fucking around. He's saying the same, he's saying the same stuff like I do when I say like, oh, well, as soon as I put on a trade, you know, it's going to go the other way, right? Like that's ingest. It's fucking around. So when I look at, when I look at this and it says like, what's an exit strategy? He clearly has one. And he deployed it through the life cycle of the positions. And then with this movement to chewy, whatever that looks like, however that looks, again, we don't know. But there are like it's clear he has fucking exit strategies is the main point. And this is him, I think playing around. That's what I think here. So, yeah, so going back to Ryan",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 103,
      "start_timestamp": "00:47:24",
      "start_timestamp_seconds": 2844.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=2844"
    }
  },
  {
    "text": "this movement to chewy, whatever that looks like, however that looks, again, we don't know. But there are like it's clear he has fucking exit strategies is the main point. And this is him, I think playing around. That's what I think here. So, yeah, so going back to Ryan Cohen's latest tweets, I think that it's mostly him playing around. Same reason why he has a picture of these fucking brown shorts. Because he knows when he does stuff like this, people are going to do what this guy's asking him, right? Like does the specific time mean anything? He knows that people are going to do that, which is obviously it's fun, right? To see what people come up with. It's one of the reasons why you have somebody like me who insists on hard data to back ideas, why I enjoy this community so much and learning about all these different fucking string theory ideas, because it's fascinating to see what people come up with. It's not even when I did the podcast with Praveen Bull as I listened to a lot of the stuff you know that he was talking about, that's that's the crazy part about like the tin foil stuff, is that a lot of it is so fucking far out there. But in a lot of it, there's also I consider small bits of truth baked in all over the place, you know, little tiny pieces here and there, some of them bigger",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 103,
      "start_timestamp": "00:48:30",
      "start_timestamp_seconds": 2910.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=2910"
    }
  },
  {
    "text": "about like the tin foil stuff, is that a lot of it is so fucking far out there. But in a lot of it, there's also I consider small bits of truth baked in all over the place, you know, little tiny pieces here and there, some of them bigger pieces than others. And that's fun. It's really, really fun. So yeah. Pete Runner says, remember when I said storm in a teacup, I do. And it's a tempest in a teapot, I think is the other way that they framed it, which I love that tempest in a teapot is a that's a I love that. What an absolutely awesome phrase. Big, big fan. Renegade says, look, I admit it's some of the tin foil theories are utterly ridiculous, but there are hidden messages in RC and arcade tweets memes sometimes potentially, sometimes I don't think all of them have all these big crazy underlying meanings. I really don't again, like this, I don't like I don't think there's a meeting behind this one personally. And he also says there is no meaning behind it. So that's not to suggest that there are not hidden meanings. Absolutely not. I don't believe that. I think that there definitely could be. But I think deciphering the elements that are kind of, you know, just contrived and put in there for fun or for whatever reason versus the things that might have some sort of meaning behind it, it kind of highlights",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 103,
      "start_timestamp": "00:49:45",
      "start_timestamp_seconds": 2985.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=2985"
    }
  },
  {
    "text": "don't believe that. I think that there definitely could be. But I think deciphering the elements that are kind of, you know, just contrived and put in there for fun or for whatever reason versus the things that might have some sort of meaning behind it, it kind of highlights the broader point that that's like if somebody wanted to communicate via these kinds of messages and memes, they would be very clear. So for example, if I grab X, I think I have, yeah, here we go. I have X here. And if I go to the roaring, not roting, roaring here. So if I go here, don't need the wrong one. We need this one. Here. So if I look at this and I see a few things here, right? So I can clearly see some of these have clear messages. Some of them don't. When I look at something like this, I do believe this is a relatively clear direct message related to Chewie. Once we obviously understand the rest of those pieces. That's what I think. I think this is him getting rid of Chewie. That's I think that is the direct message from this. And I think that because the message is not that deep, it's very easily discipleable, right? So my thought is when somebody is trying to communicate with memes, hieroglyphics as we jokingly call them different kinds of indirect communication modalities, I do not think if you're trying to communicate something, you",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 103,
      "start_timestamp": "00:51:02",
      "start_timestamp_seconds": 3062.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=3062"
    }
  },
  {
    "text": "I think that because the message is not that deep, it's very easily discipleable, right? So my thought is when somebody is trying to communicate with memes, hieroglyphics as we jokingly call them different kinds of indirect communication modalities, I do not think if you're trying to communicate something, you would shroud it so deeply. I don't think that because then it becomes noncommunication. It becomes like who the fuck knows what it actually means, right? So when you look at something like this, this looks like pretty clear. Dogstock green eyes by Chewie on Woody's face, red eyes, the dudes drop in the toy cell. That's my guess. Could be completely wrong. Ten hat is on. Could be completely wrong. But I don't think when he's trying to communicate indirectly that it's shrouded in this crazy mystery that's sunk in super deep. I don't believe that because otherwise, it becomes noncommunication. It's not communication. It's unreasonable for somebody to arrive at what the point of the message is. I think a lot of it is kind of fun. I'm trying to catch up. Day-Sewat, what percentage of you say that tinfoil could be true? The stuff you heard from PB. Fuck. I have no idea. I think that there's probably a lot of small partial truths in a lot of it, but I would wager the vast majority of that probably is untrue. Yeah, just as I look at the totality of the conversation, just because there's a lot",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 103,
      "start_timestamp": "00:52:41",
      "start_timestamp_seconds": 3161.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=3161"
    }
  },
  {
    "text": "PB. Fuck. I have no idea. I think that there's probably a lot of small partial truths in a lot of it, but I would wager the vast majority of that probably is untrue. Yeah, just as I look at the totality of the conversation, just because there's a lot of really nuanced elements of what we reviewed with PB. That Lauren says it would be interesting to hear the small bits of info you believe are true from tinfoil theories. Yeah, that's actually what I was planning on doing when we move beyond like the trade analysis. So the way I envision this series going is we have the trade analysis. We'll get through the rest of his trades probably this session and one more because I actually want to spend a while looking at the first positions and trying to build it. Then after that, I want to start going through what you tell me are the most well-respected or like the most well-refined DD artifacts that we have. And I would love to go through those and try to pick up as much as I can from those next. That's what I say. That's kind of what I'm thinking next step after this. Jimmy says emoji timeline. Yeah, so like the emoji, I don't think there's a discrete meaning for all of those. I really don't. I don't think we're in kitty sat down and thought for each emoji in this timeline, it's going to have a",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 103,
      "start_timestamp": "00:54:18",
      "start_timestamp_seconds": 3258.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=3258"
    }
  },
  {
    "text": "I'm thinking next step after this. Jimmy says emoji timeline. Yeah, so like the emoji, I don't think there's a discrete meaning for all of those. I really don't. I don't think we're in kitty sat down and thought for each emoji in this timeline, it's going to have a specific meaning. Either that or the meanings would be really, really superficial and kind of easy to pick up. But I haven't gone through the meme emoji timeline, just being completely honest. But based on the different pieces that I see for them, I view it as very difficult to come up with a uniform message behind each emoji. So Robo says absolutely he did. He very well could have. Again, I don't know. I'm not pretending like I know all this stuff. I don't. But again, the way that I look at it is that if he had a discrete message he wanted to show in some way that people could reasonably arrive to, it wouldn't be completely ambiguous. Sean says he handmade some of the emojis. There you go. So to me, that's the stuff to look at. So the question was the emoji timeline. And my response to the emoji timeline is just saying, I don't think everything in there has a message. That's not me saying nothing does. And exactly as Sean is highlighting, the ones that he would have handmade, to me, that's exactly what I would look at. Because that's something that he is",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 103,
      "start_timestamp": "00:55:36",
      "start_timestamp_seconds": 3336.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=3336"
    }
  },
  {
    "text": "to the emoji timeline is just saying, I don't think everything in there has a message. That's not me saying nothing does. And exactly as Sean is highlighting, the ones that he would have handmade, to me, that's exactly what I would look at. Because that's something that he is purposefully adjusting for one reason or another. I completely would look at those personally. So yeah, because the problem with the again with the emojis, right? I've seen so many ideas with respect to the flag and the microphone. I've seen a million different ideas. If he was trying to communicate something through that specific emoji, I would again, I would have we have to do like an analysis on it. Because part I have imperfect information and I keep reiterating that point here because I do not have all the details. But what I'm looking at with respect to like that specific emoji is I would look at the context of what's around it to try and see if there's what I would consider to be like a reasonably clear meeting. That is the that is the underlying concept I have with respect to indirect communication is the entire the entire idea of indirect communication is to still communicate. It's not to confuse. It's not to confound. It's not to mislead. It's to communicate. So if you make indirect communication so confounding that nobody can follow it, then it's not communicating. And I believe the majority of what he's",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 103,
      "start_timestamp": "00:56:52",
      "start_timestamp_seconds": 3412.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=3412"
    }
  },
  {
    "text": "the entire idea of indirect communication is to still communicate. It's not to confuse. It's not to confound. It's not to mislead. It's to communicate. So if you make indirect communication so confounding that nobody can follow it, then it's not communicating. And I believe the majority of what he's trying to do is communicate and troll. That's what I think. I think he fucks around a lot. And then I also think he communicates a lot. And I think it's real difficult to decipher between both of them. But it's for me, it's very context dependent. So yeah, it's tricky. It's really, really tricky. But yeah, I think the I think the broader context of a lot of the this thing's getting hot. Pretend the tinfoil is still on for now. My head is still hot. The tinfoil hat doesn't breathe at all. Dave Swag says, I don't really, I honestly don't even care about some of the DD. I'd rather just optimize getting rich in whatever ways we can. Well, that's different to be completely honest. Like the approach to getting rich is in my opinion vastly different than quite literally all of this. If my like if I didn't have a lot of money and I was starting in the markets all over again, I'll be completely honest. This is not where I would start at all. It's not where I would start. And it's because the way that I approached creating wealth was predicated on trying",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 103,
      "start_timestamp": "00:58:12",
      "start_timestamp_seconds": 3492.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=3492"
    }
  },
  {
    "text": "I didn't have a lot of money and I was starting in the markets all over again, I'll be completely honest. This is not where I would start at all. It's not where I would start. And it's because the way that I approached creating wealth was predicated on trying to build a higher probability outcome. That's what I was trying to do. Because again, roaring kitty crushed this. He did a fantastic job. Literally, my hat is now off to him. This is survivor ship bias. Full stop. This is survivor ship bias. This is somebody that if you were call from the very beginning of the trades that we started following, if we go back to the bottom of this, this is somebody that took a hundred thousand dollars and dropped them all into call options on an individual stock. And here's another thing that I can tell you definitively from the live streams that I listened to today. He actually talked heavily about how he would be upset with himself for being missized, for being too diluted and too diversified. He literally said that in a stream that I was watching today. So I think over here, like this is survivor ship bias because he did not have some sort of grand timing thesis behind this trade. The timing thesis behind the trade was, I think it's going to go up. It's based on this really in-depth analysis that he conducted based on valuations. If we look",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 103,
      "start_timestamp": "00:59:34",
      "start_timestamp_seconds": 3574.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=3574"
    }
  },
  {
    "text": "like this is survivor ship bias because he did not have some sort of grand timing thesis behind this trade. The timing thesis behind the trade was, I think it's going to go up. It's based on this really in-depth analysis that he conducted based on valuations. If we look at a lot of the other stocks that he was holding here with respect to valuations, a lot of them didn't work out and he'll tell you that. He will tell you that. So he started pivoting really, really hard into something that he had more conviction. And rightfully so again, I cannot be more clear. His research gave him a really good idea and that good idea happened to work in the crack time frame. Now, the way that it happened to work is from a lot of really good research. It also has an element of luck that it is what it is. I know people really don't like hearing that and we want to believe that this is all pure skill so that then we can replicate it. That's the inference. Is that if there's an element of luck, then it makes it more difficult for us to replicate. We don't like that. And I don't blame you. But again, I can see it. I literally can see it. So like Michael says, no luck. Only 2021 was luck. Now it's not skill. It's knowing the dates. I completely disagree with you. Yeah. The reason why I",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 103,
      "start_timestamp": "01:01:00",
      "start_timestamp_seconds": 3660.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=3660"
    }
  },
  {
    "text": "to replicate. We don't like that. And I don't blame you. But again, I can see it. I literally can see it. So like Michael says, no luck. Only 2021 was luck. Now it's not skill. It's knowing the dates. I completely disagree with you. Yeah. The reason why I disagree with you is because as I look back through his older trades, if you know the dates, your portfolio doesn't go 2,000, 7,000, 22,000, 48,000, 33,000, 46,000. And it doesn't end this period at a low of 17,000, go back up to 40,000, and then go back down to 34,000. So there's not a date here. If somebody knows dates, specific dates that they have supreme high conviction in, you trade the dates only. That's what you would do. Why would I bother maintaining a position here? If I have a date that I maybe know where don't know is going to work? Right? It doesn't, it literally doesn't make sense. It's a logical breakdown in the idea of somebody having specific dates that they're playing. He doesn't have specific dates. I can see it. If he has specific dates, you would not hold something that's up 48 million and take it down to 17 million. You would not do that over the course of two weeks if you have dates. There are no dates here. So again, that doesn't mean that there are not dates that he's interested in, and that he thinks might move. For sure. I'm",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 103,
      "start_timestamp": "01:02:21",
      "start_timestamp_seconds": 3741.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=3741"
    }
  },
  {
    "text": "and take it down to 17 million. You would not do that over the course of two weeks if you have dates. There are no dates here. So again, that doesn't mean that there are not dates that he's interested in, and that he thinks might move. For sure. I'm sure he believes that stuff. Again, when we talk about these things, it's so important to remind people that when I'm talking about some of this stuff and analyzing, it's not, when I'm analyzing something and saying that there aren't specific dates, I don't want the null to be perceived as there are no dates. That's not what I'm suggesting. But what I'm suggesting is looking at the movements here. If somebody had dates, again, date that we think something is going to happen for whatever reason, you don't go through this equity curve. There's no reason to. You make so much more money. And it's not even about making money for him, I don't think. I think it's about like playing the game and beating the system. You don't do that by doing this. You beat the system by essentially what he did between what is this 16 April and when he came back. Was it too June? Was the recent one? I'll grab another windows so that we can stay at the bottom on this one if we need it. Yeah, too June. Here. Yeah. Michael says that three years away is where you learn the dates. I",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 103,
      "start_timestamp": "01:03:42",
      "start_timestamp_seconds": 3822.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=3822"
    }
  },
  {
    "text": "and when he came back. Was it too June? Was the recent one? I'll grab another windows so that we can stay at the bottom on this one if we need it. Yeah, too June. Here. Yeah. Michael says that three years away is where you learn the dates. I just don't agree with you. If there were some magical dates that he knew and that he was timing, I literally, I literally guarantee you, it would be known by now. I guarantee you, there's not this kind of edge present in markets that are relegated around like this date concept that is not going to be picked up on on the collective intellect. Again, Roy and Kitty is super smart. He is not smarter than everybody looking at this combined. He's just not nobody is Elon Musk is a fucking genius. He's not smarter than the collective intellect of people. That's why he hires really smart people to help him instead of doing it all himself on top of a bandwidth constraint. So the broader idea here, I think, is what I can see from here. We moved a lot. And that's the goal now is I want to see because there's a big gap between these 16 April 21 to two June, right? That's a big gap. It's 1100 days. So now actually what I want to do is reconstruct, like actually construct this portfolio and see if we can come up with ideas on when he started",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 103,
      "start_timestamp": "01:04:56",
      "start_timestamp_seconds": 3896.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=3896"
    }
  },
  {
    "text": "see because there's a big gap between these 16 April 21 to two June, right? That's a big gap. It's 1100 days. So now actually what I want to do is reconstruct, like actually construct this portfolio and see if we can come up with ideas on when he started coming into things and potentially why. So that's the game plan now. So let's go first things first. I want to look at how GME moved over this duration between these. So I want to take a look from 16 April 21. And then I want to look at two June 24. So to do that, I already have those dates from a bar chart export. So I'm going to upload those into our family favorite. I'll probably do. Yeah, I'll start with chat GPT. And then depending on what chat GPT shows me if I believe it or not, then I might look at something else. So I'm throwing into chat GPT and I wanted to do a few things. First things first, analyze the price performance of GME from 17 April 2021, June 2, June 2024. Great. As statistical overview of the price of the price behavior. And then I'll work with that a little bit. Sean says, Arkey showed us he figured something out by using Chewie as another example. I wonder. Yeah, I wonder. The Chewie thing is really, really interesting because it didn't do much like it didn't from his entry point versus his exit",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 103,
      "start_timestamp": "01:06:20",
      "start_timestamp_seconds": 3980.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=3980"
    }
  },
  {
    "text": "then I'll work with that a little bit. Sean says, Arkey showed us he figured something out by using Chewie as another example. I wonder. Yeah, I wonder. The Chewie thing is really, really interesting because it didn't do much like it didn't from his entry point versus his exit point. So if we look, we think he got in on like the 24th of June, I think is when he filed his paperwork, right? It went up 3 less than 3. 2.5. It's really not much. So I think I don't think again here that this was the forecast of some sort of thing. And I do think this was market manipulation. And I'm not admonishing him for that at all. But I think that's what that is there clearly. I think that he knows with him being on the fucking news that what he says is now tracked. And I think it's him playing games. I think it's him trolling a little bit with this whole thing. That's what I think. Because this kind of movement, again, I think he filed what the 13G was for 24 June, something like that. So yeah. Michael, Michael, calm down, bro, chill. We're going to look. Comutets, it's all good. We're going to go through all of it. I know that people get super excited. I share your excitement with you. But I'm going to go through this literally in order, right? That's exactly how I started this. That is exactly",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 103,
      "start_timestamp": "01:08:03",
      "start_timestamp_seconds": 4083.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=4083"
    }
  },
  {
    "text": "chill. We're going to look. Comutets, it's all good. We're going to go through all of it. I know that people get super excited. I share your excitement with you. But I'm going to go through this literally in order, right? That's exactly how I started this. That is exactly how I'm going to continue this is in a very disciplined, regimented order. So we will check out the 24 to 26 call buys of April when we get there. We will look. But the first thing that I want to look is I literally just want to understand the price performance. Okay. So I'm going to summarize to what chat GPT is telling me. So this is just looking at a statistical overview of price behavior for GameStop between 17 April 21 and 2 June 24. It's 786 trading days. The average price for open is 28. The average high is 29.5. The average low is 27.30 and then the close 28.36 standard deviation for volatility. 12.70 open. High is 13.39. Low is 12. Min. I don't care about those. Let's look at the mediums. So the median opens 24.91. High is 26.01. Low is 24. So very range bound in general. And then the maximum prices open was 75.78. High was 86.17. Low is 72.88. Then close was 75.64. Okay. So that gives us some idea about renegade traders. Those do look at the chart. Forget chat GP. Yo, y'all got a chill. I'm gonna. I'm literally going",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 103,
      "start_timestamp": "01:09:41",
      "start_timestamp_seconds": 4181.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=4181"
    }
  },
  {
    "text": "bound in general. And then the maximum prices open was 75.78. High was 86.17. Low is 72.88. Then close was 75.64. Okay. So that gives us some idea about renegade traders. Those do look at the chart. Forget chat GP. Yo, y'all got a chill. I'm gonna. I'm literally going to. I don't know how many of you understand how to conduct like an actual analysis of something. But what I'm doing is I understand when I look at something like a chart, my eyes are going to see certain things based on how my conscious mind is primed. So by conducting an objective statistical analysis of something before looking at it, it helps reset the subconscious priming that's in my mind. And I can get a sense of what average, what mediums actually look like statistically, not what my mind is going to pick up from the charts. Because it is a really, really easy process to have your perception skewed by the thousands of charts you looked at before, the things that you tend to see. I don't want any of that. When I conduct analysis, you will find that I literally go to extreme lengths to curtail my known cognitive biases that I know were there. It's the only way for me to arrive at like truly good information as far as I'm concerned. So that's why I'm doing this. Okay, so that being said, it is now time to look at the chart. So we have",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 103,
      "start_timestamp": "01:11:14",
      "start_timestamp_seconds": 4274.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=4274"
    }
  },
  {
    "text": "my known cognitive biases that I know were there. It's the only way for me to arrive at like truly good information as far as I'm concerned. So that's why I'm doing this. Okay, so that being said, it is now time to look at the chart. So we have to go into good ol' Yahoo Finance. And I specifically want to take a look at, I never know how to use this. These are days, right? Yeah, these are days. And I'd like to zoom in. There we go. These are months. I don't want months. So many days. How do I change this? Damn it. I don't want four hours. I want a daily chart. Is that too much to ask for? You have to. It's so annoying. It's all right. It's not that far back so we can make it happen. There we go. There's 21. Okay. So we have a daily chart of Vladimir says, you saw us, I will for another part of this, but I like using Yahoo Finance because it gives me the scale relative to a time. That's the problem with toss is if I want to use toss for this, I have to go back in time, right? In order to see things relative to the period because I can do like a 10 year month in something like GameStop, but like you see how all this is completely squashed. Even if I use a log scale to fix it, it's",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 103,
      "start_timestamp": "01:12:37",
      "start_timestamp_seconds": 4357.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=4357"
    }
  },
  {
    "text": "have to go back in time, right? In order to see things relative to the period because I can do like a 10 year month in something like GameStop, but like you see how all this is completely squashed. Even if I use a log scale to fix it, it's too much of an extreme that it's going to be massively skewed. That is a giant drawback. And then if I go back in on demand and do it, it's just super time consuming because I have to fact check the actual data points because I know on demand is unfortunately quite flawed. So yeah, toss would be good, but I also kind of get a kick out of using Yahoo Finance for this. It's like a small homage to Roy and Kitty because he used, I think, whatever the really basic charting thing, which is pretty funny. Off Putin says, demand isn't working for right now for me. Yeah, I think I saw a message yesterday that they're doing maintenance. So I actually am curious if it's going to be any good. And then I got to get back up top because Stephen gave out five outlier trading membership. So thank you so much for Steven for doing that for who got it. We got Day Swag. We got Zachariah. We got Willie roaring titty, perfect, perfect ad roaring titty and chicken nugget. This is literally perfect. Thank you very much for doing that, Stephen. That's super, super generous",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 103,
      "start_timestamp": "01:14:04",
      "start_timestamp_seconds": 4444.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=4444"
    }
  },
  {
    "text": "So thank you so much for Steven for doing that for who got it. We got Day Swag. We got Zachariah. We got Willie roaring titty, perfect, perfect ad roaring titty and chicken nugget. This is literally perfect. Thank you very much for doing that, Stephen. That's super, super generous of you. Okay, so let's just kind of get a qualitative assessment of what happened between 16 April 21 and when he came back on to June. So 16 April 21 is a key right here. Now, first question is you know this better than I do, which is why I'm asking you, what was going on in the general space during this period of time? And why did he choose 16 April to leave? Do we know the answers to that? Because I don't know the answers to those. And I'm very interested in what they are if we do know. And the reason why I'm interested in it is a few things. Renegade says can you repeat the questions? Yeah, sorry. Yeah, and let me not do multiple questions. I do that a lot. I've like, yeah, I try to condense too much. The first question is, do we know why he left on 16 April? I think that's the first, the first question I have. And then I'll ask my second question after we get through that first question. Call to testify to Congress. Is that when it happened? So, um, roaring kitty Congress testimony. That was",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 103,
      "start_timestamp": "01:15:14",
      "start_timestamp_seconds": 4514.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=4514"
    }
  },
  {
    "text": "we know why he left on 16 April? I think that's the first, the first question I have. And then I'll ask my second question after we get through that first question. Call to testify to Congress. Is that when it happened? So, um, roaring kitty Congress testimony. That was the 18th of February. Is what I see. Off. Off. Puin says I think the squeeze already slows and his calls expired that day. He didn't know how to value the stock. I don't think that's it. The reason why I don't think that's it is because my estimation is that it has something to do with this in probably legal counsel. He received from his attorneys. That's my guess. So I think the the calls expiring and stuff like that completely agree. I think that's probably why the date lined up. But I think the reason why we didn't see more posts after that is not because of the expiration and not knowing how to value it. I think it had pretty much everything to do with this and the fact that he knew that he was going to have to testify. So that's my best guess. But I don't know. And that's my best guess as of right now. This looks like a like a fuck boy tin hat when it's like on top of my head like you know perched on top of my head like that. I don't like that. We got to get that skull",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 103,
      "start_timestamp": "01:16:37",
      "start_timestamp_seconds": 4597.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=4597"
    }
  },
  {
    "text": "don't know. And that's my best guess as of right now. This looks like a like a fuck boy tin hat when it's like on top of my head like you know perched on top of my head like that. I don't like that. We got to get that skull cap on. But yeah, that's this is what I think. Lance says I think there was some sort of gag order that wasn't public knowledge that came from the 16th. Yeah. Renegade says he did return early June 21 with the tweet storm. Okay, so let's take a look. Yeah. So then my guess is if he came back with the tweet storm in June of 21, but he wasn't doing yellow updates. I almost have to the overwhelming reason why that would likely be the case is if he was advised by attorneys. That's my guess. So and the reason why he would be advised by attorneys like that is to literally to limit his own risk. That's just de-risk that whole thing. That's my best guess. But let's take a look at the tweet storm. How hard is it? What am I get myself into? How hard is this to go back in time? Oh, this is wait, they're gone. Oh, he deleted stuff. I forgot. In case you guys didn't know, I'm pretty sure. Wait, let me not give bad news. He deleted shit, right? Okay, got it. Sorry. Correction, belay my last. He did not delete.",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 103,
      "start_timestamp": "01:18:04",
      "start_timestamp_seconds": 4684.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=4684"
    }
  },
  {
    "text": "this to go back in time? Oh, this is wait, they're gone. Oh, he deleted stuff. I forgot. In case you guys didn't know, I'm pretty sure. Wait, let me not give bad news. He deleted shit, right? Okay, got it. Sorry. Correction, belay my last. He did not delete. I have to go to media. Okay, got it. Thanks. I know how to X. Fun fact, I don't know how to X. I don't use social media essentially at all. Does this tell me the dates though? Yeah, I'm logged in right now. It's super annoying that it does not show the dates. Okay, cool. You guys know. Thank you. Renegade. You're the fucking hero here. Because this would be a much more time consuming process. I'm going to go a little bit slower. So I know there's a slight lag. Stop. So I'm assuming I have to go up a little bit somewhere in here. Go back to Elon. Where the fuck is Elon? A little past the cat. Up. Up. Cat. Oh, Dan, there's a big gap. Elon, thank you. Okay, so this is where this is when he came back in June of 21. Is that correct? This is Jen. Okay, sorry. So keep going up. You're in 2021 until the sleeping cat. I think that's what we want, right? I thought what I'm trying to find is I was told that he disappeared from the yellow update 16 April 21, but he came back in",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 103,
      "start_timestamp": "01:19:12",
      "start_timestamp_seconds": 4752.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=4752"
    }
  },
  {
    "text": "correct? This is Jen. Okay, sorry. So keep going up. You're in 2021 until the sleeping cat. I think that's what we want, right? I thought what I'm trying to find is I was told that he disappeared from the yellow update 16 April 21, but he came back in June of 21. So my objective is to see what he came back with in June of 21. So I'm trying to find that just to be clear. So do I, which tell me which way I need to go? Steven says, thank you for your hard work and your videos of the reasons I started options been working well so far. That's awesome to hear. Be super careful, please. Because options take a while to get your arms around and it's so easy to get to a point where it feels like we have them down pretty solid and then they can bite us. So just be super careful, please. Renegade says up. Wait, this is all from before 21. How much does this dude fucking tweet? Does this not tell me when it was posted? There we go. April. Okay, cool. Guy sitting in the chair. No, that's in 24, right? The guy that like pitches forward. Again, I'm looking for 2021 when he came back. Because that was from April. Hold on, let me get my bearings. So this one is from April of 2021, which is also interesting because I didn't realize, I thought this was",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 103,
      "start_timestamp": "01:20:59",
      "start_timestamp_seconds": 4859.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=4859"
    }
  },
  {
    "text": "in 24, right? The guy that like pitches forward. Again, I'm looking for 2021 when he came back. Because that was from April. Hold on, let me get my bearings. So this one is from April of 2021, which is also interesting because I didn't realize, I thought this was a new one. So he did this thing twice, right? Because he's done this, he's done this before. Okay. Okay. April 9th. So we got to go to the 16th. April 13th, that's pretty close. 14th. Damn, he fucking tweets a lot, bro. 15th. I thought for sure, I would have been past it by now. This is hilarious. 15th again. This is hilarious. Austin Powers. April 15th still. This is nuts. All of this is April 15th. There's the 16th. That's hilarious. There's the 16th. 16th. So it's somewhere right in here. 16th. 16th. Okay. So this is April 16th. So this is the last day that he was tweeting. And let's see what his last tweet was on the last day. That's June 1st. 16th, 5pm. There. So this is where he left right here. And then this is when he came back on the 1st of June in 21. So this tells us, again, I don't think that there's like some sort of really deep hidden meaning here. Right? Like if we if we logically think about this, still don't know. But if we logically think about this, left off with what he was doing and kind",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 103,
      "start_timestamp": "01:22:38",
      "start_timestamp_seconds": 4958.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=4958"
    }
  },
  {
    "text": "in 21. So this tells us, again, I don't think that there's like some sort of really deep hidden meaning here. Right? Like if we if we logically think about this, still don't know. But if we logically think about this, left off with what he was doing and kind of reiterating what he was doing. And then there was a pause between these and then this is him getting back at it. Like that's exactly what I see here. This is him getting ready to start the game. Off-put and says he's digging up his tools. Yeah, he's just getting back at it. I don't think again, I don't think it's as specific as like getting the tools or getting a specific kind of tool. I literally think again, there's an art to indirect communication. And it rarely is hyper specific unless there's a decent breadcrumb to bring you to that specific thing. So this to me looks like he's returning, right? That's that's what the scene from John Wick was. He was retired. He was not doing the thing anymore. And then this happens and then boom, he's returning. That's what I see here. Okay, give me one second. I have to grab the nug and I'll be right back. I'm going to put you guys in the holding screen. Give me one second. I'll be right back. There he is. He is. Oh, wow, because he's so dark, it like literally the camera gets super, super bright",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 103,
      "start_timestamp": "01:25:04",
      "start_timestamp_seconds": 5104.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=5104"
    }
  },
  {
    "text": "second. I have to grab the nug and I'll be right back. I'm going to put you guys in the holding screen. Give me one second. I'll be right back. There he is. He is. Oh, wow, because he's so dark, it like literally the camera gets super, super bright to compensate for him. So here he is. He's excited to review. Did you have a good nap? Yeah, say hello to the people. There's 99 people here to watch you. Maybe anything. Hello. Okay, thank you. So there's his his comment for you. And in case you guys want to see one of his tricks, check this out. He's very formal. He's ready for the occasion. Okay, had to make sure you guys had a chance to see really the dude that ultimately matters here. Okay, so that's that. Oh, there's a sneeze from him. This is when he comes back. Okay, got it. Let's get back into actually what happened though. This is what I'm most interested in right now. So April. What can I draw? Perfect. April 16th. Is there. And then he came back on the first of June. Here, which is interesting. In terms of tweeting, by the way, not in terms of trading. Okay. So it had this massive run up May 21. We all know that. And then runs along. Raiders. Down to 22. Okay. Okay. So right now, all I'm doing is getting a sense of like the qualitative movements that we",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 103,
      "start_timestamp": "01:26:16",
      "start_timestamp_seconds": 5176.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=5176"
    }
  },
  {
    "text": "tweeting, by the way, not in terms of trading. Okay. So it had this massive run up May 21. We all know that. And then runs along. Raiders. Down to 22. Okay. Okay. So right now, all I'm doing is getting a sense of like the qualitative movements that we saw over this period. Because one of the things that I'm most interested in is if there's a change in his methodology. So now we're in 23. Damn, what happened here? Do you guys know what this is? Eight, nine and 12 June. Any thoughts on that? They're all open. What was this? At the market. Okay. Cool. Thank you. Yo, see, this is like the cheat code of doing this with you guys because you guys know this stuff. PB actually just text me. I'm going to have a I'm setting up a time to talk to him tomorrow. I don't we're not going to stream though. It's just for a conversation. If there's anything that we should talk about, let me know. But I don't really have. Don't have much for the agenda. It's more so just talking about some qualitative stuff. He's a good dude. I really like him. Anytime that I come across somebody like that, that I genuinely vibe with and get along with, I try to keep in touch with them. Because I find in the finance space, there's just so many, I mean, let's just call what it is. There's just so many",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 103,
      "start_timestamp": "01:28:52",
      "start_timestamp_seconds": 5332.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=5332"
    }
  },
  {
    "text": "like him. Anytime that I come across somebody like that, that I genuinely vibe with and get along with, I try to keep in touch with them. Because I find in the finance space, there's just so many, I mean, let's just call what it is. There's just so many what I would consider to be straight up awful people and people that are trying to manipulate others and all that kind of stuff. And it's like super, super frustrating to me. So anytime that I come across people that seem to be like really genuine and good, I try to connect with them more again. I don't know him. So I could be wrong. But it doesn't feel like I'm wrong. It feels like in general. I don't know. It feels like in general. He just seems like a really solid dude. That Lauren says he's so young and so smart. He's not that young. That's another funny thing that we came across on the live stream. He's late 20s. I'm not going to dox him. He's like really interested or like trying to preserve his anonymity and whatnot. But yeah, he's not that young. I think that's not anything he didn't say. Because on the live stream, he said, oh, he was. But yeah, he's in his late 20s. So he's probably, I'm guessing five years or so, less than five years, probably younger than me. I know for me, it's different because I straight up look like",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 103,
      "start_timestamp": "01:31:57",
      "start_timestamp_seconds": 5517.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=5517"
    }
  },
  {
    "text": "anything he didn't say. Because on the live stream, he said, oh, he was. But yeah, he's in his late 20s. So he's probably, I'm guessing five years or so, less than five years, probably younger than me. I know for me, it's different because I straight up look like I'm fucking 48. But that's the that's the crux of being a white dude is we don't we really we don't age that well. We might know a little bit about taxes and shit, but we definitely don't know that much about aging appropriately. That's just kind of how it goes, I suppose. Dude says 20 is young. Yeah, no, I'm not saying he's not young. I'm just saying it's deceptive, right? Because a lot of people think because he looks, he literally looks like he's in his late teens early 20s, but he's in his late 20s. But he, I mean, he looks super super young. He's aging incredibly well. Okay, so this was the at the market rally back up. Okay. Absolute crater. Wow. Wow. What happened here was this earnings or something else? 29 know. Zachary says my wife is Peruvian and seven years older people think, yeah, that's your fuck, dude. People people that have any bit of brown in them tend to age really well. For those of us of the Caucasian persuasion, we are destined to age, like just pure jack shit. Unless you're Tom Cruise, I don't really know obviously is like his",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 103,
      "start_timestamp": "01:33:03",
      "start_timestamp_seconds": 5583.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=5583"
    }
  },
  {
    "text": "yeah, that's your fuck, dude. People people that have any bit of brown in them tend to age really well. For those of us of the Caucasian persuasion, we are destined to age, like just pure jack shit. Unless you're Tom Cruise, I don't really know obviously is like his Hollywood secrets and stuff. And he probably does a shit ton of plastic surgery and whatnot, but all the same, he's aged insanely well. But, um, so what was this? 28 November 23 into 29. Any idea? It looks like it's not jumping out of us. So I'm gonna ask Chachy PT. What news around PME was released on 28 or 29 November 2023? So it looks like something, but I can't, I can't really tell. Like that's a big move. So that's interesting. Um, this is from GPT. It says 28 November 29 saw notable surge in price, 30 24 hours, no specific company news, heavy volumes, speculation around a squeeze, spike, interest, and investors anticipated Q3 earning scheduled for six days. The surge was likely driven by meme stock traders speculating on potential sort squeezes, reminiscing of 2021. Interesting. Interesting thing here is how it kicked off. Again, the one thing I can, I don't speak in absolutes because normally there's a lot of nuance to most things. One thing I can tell you unequivocally is every, every single time I've seen game stop jump every single time, I see a massive expansion and volume leading into the",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 103,
      "start_timestamp": "01:34:50",
      "start_timestamp_seconds": 5690.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=5690"
    }
  },
  {
    "text": "the one thing I can, I don't speak in absolutes because normally there's a lot of nuance to most things. One thing I can tell you unequivocally is every, every single time I've seen game stop jump every single time, I see a massive expansion and volume leading into the jump. Again, do not take the null statement from that. That does not mean every massive expansion in volume means a jump doesn't. Right. So in this case, we went from 1.68 to 7.43 massive expansion in volume, it dumped. But even here, I can see volume from the 24th, 1.2, it goes to 3.7 and then it goes to 14. It is every single time. I've looked at every single gap, every single large moving game stop and it is uniform. Michael says, what do you summarize as to why that might be? Oh, easy because markets are highly informed. That's why I go back to saying that there are no specific dates because if it is, it's going to get arbitraged away nearly immediately. These are people with different kinds of information that are seeing different kinds of movements that are piggybacking and moving off of good movement. Again, this is for those that don't know, I've traded game stop since 2021. But I've only traded it from a trader's perspective because the things that I look for are the things that most retail full-time traders will look for. But what we look for is movement that is",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 103,
      "start_timestamp": "01:37:06",
      "start_timestamp_seconds": 5826.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=5826"
    }
  },
  {
    "text": "Again, this is for those that don't know, I've traded game stop since 2021. But I've only traded it from a trader's perspective because the things that I look for are the things that most retail full-time traders will look for. But what we look for is movement that is being driven by institutions of some sort, which is exactly what this is. Michael says, no, all swaps. That's not what it is, dog. I can guarantee you it's not what it is. And the reason why I can guarantee you that that is not all swaps is multiplefold. But I've already regressed the due swaps that have come due from a giant list that the community has built. And there is a non-correlation between when we see big swaps coming due in subsequent price movement. It's not predictive of price movement. And the reason for that, we actually talked a lot about this during the PB episode that I did on Thursday. But you do not know and cannot know what is in a swap. And it's because it is a built derivative between two parties. That derivative is custom made between the two parties. Now there's an exactly as PB pointed out, there's a lot of standardized components to the terms, but the terms still are very personalized to that individual swap. So we cannot discreetly know if big swap is coming due. Does that mean somebody's going to have to go to the market and buy it?",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 103,
      "start_timestamp": "01:38:44",
      "start_timestamp_seconds": 5924.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=5924"
    }
  },
  {
    "text": "as PB pointed out, there's a lot of standardized components to the terms, but the terms still are very personalized to that individual swap. So we cannot discreetly know if big swap is coming due. Does that mean somebody's going to have to go to the market and buy it? Probably not because again, it's the same reason why we have dark pools. It's to shroud movement. So why on earth would we have swaps that if they come due that there's going to be the transfer of stock and some component that comes from the market? All literally all entities if that were the case would see it would front run it would skyrocket price before they touched it and then nobody would use swaps ever again because they would get murdered. So that's not it. And it's important again to try and remember like objective analysis because one of the issues I see when a lot of the apes will look at stuff like this, they'll say something like, let's say swaps did come due this day, right? And they'll say something like, well, swaps were due, that's why it moved. And it's again, completely fair idea to start with, but we have to analyze the entire idea. You we can't just look at the instances where it happens to line up. We have to look at all instances of when swaps are due. And we need to again, analyze it statistically as these swaps come due, how",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 103,
      "start_timestamp": "01:40:07",
      "start_timestamp_seconds": 6007.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=6007"
    }
  },
  {
    "text": "start with, but we have to analyze the entire idea. You we can't just look at the instances where it happens to line up. We have to look at all instances of when swaps are due. And we need to again, analyze it statistically as these swaps come due, how frequently are we seeing a big move? And if it's statistically insignificant, it tells me the move is not caused by just the swaps emphasis on just because there could be swaps that come due that necessitate going to the market to purchase shares. It could do I think that that's a high likelihood in severity? No, I don't. And again, it's because there are there is no benefit to the swap if an underlying is going to move. That's the whole purpose of a swap of derivatives is to not deal with the underlying and to deal with this contract pertaining to the underlying. So again, did swaps have anything to do with this? Absolutely could have. I do not know. Was this all swaps that caused this objectively? No, I know that not to be the case. So yeah, something happened here though, very interesting. I wonder if there's a way to look at like, is there a way to look at historic mentions and stuff on like Reddit? Is there like a graph that tracks Reddit mentions? That would be insanely interesting. Is there a tool that tracks historic social media mentions of a stock? Very, very",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 103,
      "start_timestamp": "01:41:18",
      "start_timestamp_seconds": 6078.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=6078"
    }
  },
  {
    "text": "there's a way to look at like, is there a way to look at historic mentions and stuff on like Reddit? Is there like a graph that tracks Reddit mentions? That would be insanely interesting. Is there a tool that tracks historic social media mentions of a stock? Very, very curious. Centio? Does anybody use Centio? And then it says Swaggy Stocks does this? Let me look at Swaggy Stocks. Hmm. Does this work? Social sentiment, Wall Street bets, ticker sentiment. Okay. It doesn't go back that far. Okay. Oh, they're trying to upsell me. I'm not trying to buy your stuff right now. Yeah, so it looks like Swaggy Stocks looks like it looks at stuff for the past week. It doesn't give me more recent, unfortunately. But I don't know if that would be it. That's okay. It was just kind of a fringe idea anyways. Does stock, I don't see, I don't think it exists in stock tweets. Type equity. Yeah, because it shows stock tweets, but I don't think it goes back far enough. Do any of these tools or of references can any of these tools analyze the social media sentiment slash popularity of GME on, let's call it 28 and 29 because volume started to expand on 28 on 28 November, 2023. It says Swaggy Stocks can. How do I use this with Swaggy Stocks? Let's see if this works. So we're going to go to Swaggy Stocks as we're supposed to. And then",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 103,
      "start_timestamp": "01:42:42",
      "start_timestamp_seconds": 6162.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=6162"
    }
  },
  {
    "text": "on, let's call it 28 and 29 because volume started to expand on 28 on 28 November, 2023. It says Swaggy Stocks can. How do I use this with Swaggy Stocks? Let's see if this works. So we're going to go to Swaggy Stocks as we're supposed to. And then social sentiment section. Okay. Social sentiment. And then the instructions break down. Social sentiment, maybe this one, there's no search bar. There is no search bar or GME. Oh, I see. So you, I see. So you just have to fucking go through this chart. But it doesn't let me go back in time. So let's see. It doesn't look at. Damn it. Oh, well, I was curious. That would have been really neat just to see like how much of this was being driven by forever versus other stuff. But yeah, I don't really know. Okay, let's continue. Then we have 24. And then we have the return of the cat. Okay. So now let's start looking at the position and deconstructing. So five million shares at 21274, that literally could have happened a million different ways. Right. So the cliff notes is there were tons and tons of periods where it was trading around those prices. So that could just be stocky accumulation. That could be options exercise. That can be all sorts of stuff. Yeah, all sorts of stuff. Michael says, what would you do with your options experience if you were certain about a date 100",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 103,
      "start_timestamp": "01:45:27",
      "start_timestamp_seconds": 6327.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=6327"
    }
  },
  {
    "text": "periods where it was trading around those prices. So that could just be stocky accumulation. That could be options exercise. That can be all sorts of stuff. Yeah, all sorts of stuff. Michael says, what would you do with your options experience if you were certain about a date 100 certain? I would go options. I'll show you. I'll show you exactly what I would do. Let's say I know that this is going to happen here on 28 and 29 November of 23. Let's say I know what's going to happen on the 27th. I'll show you literally exactly what I would do. So we have to go back to 23 November. I have to go to the 27th. And in this case, we're playing the scenario that I know what's going to happen over the next two days. And for whatever reason, I know that there's going to be a big move. Let's use the scenario that I don't know how big the move is going to be. No idea. But I know that there's going to be a big move. So here's the play. We go to the nearest expiration here, the one D's. And we wait for that to load. And let's say that I think it's going to double. I would go out to something like a five delta, wherever there's some liquidity. So maybe these 18s. But if I think it's going to go double, I could go a little further. But let's just",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 103,
      "start_timestamp": "01:48:15",
      "start_timestamp_seconds": 6495.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=6495"
    }
  },
  {
    "text": "for that to load. And let's say that I think it's going to double. I would go out to something like a five delta, wherever there's some liquidity. So maybe these 18s. But if I think it's going to go double, I could go a little further. But let's just say I picked something like this. And let's say I have a 100,000 portfolio, something like that kind of mimicking what the cat had in the beginning. So if you'll 100,000 portfolio divide that by five, I can get 20,000 of these. That's the play. So we analyze that. It's not showing the P and all grap just because it's broken right now. But let's fast forward two days to the 29th. And let's see what we're trading at there. And then let's go to like super early in the morning, 0640. We'll start there. Look like it was higher. Let's go to 0635. Right after the open. Yeah, okay. So in this scenario, let's see where those 18s trade. And I was just going to do it on my phone, but I'll do the math here so that you can see it. I'm not that wrong. I think it's this one. Yeah, cool. We can kill that. I'll just do this. So here we had we got in at a nickel and we had 20,000. And then now they're trading for let's call it 55. Oops, I missed. That's embarrassing in it. So this is a thousand percent return.",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 103,
      "start_timestamp": "01:49:47",
      "start_timestamp_seconds": 6587.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=6587"
    }
  },
  {
    "text": "this one. Yeah, cool. We can kill that. I'll just do this. So here we had we got in at a nickel and we had 20,000. And then now they're trading for let's call it 55. Oops, I missed. That's embarrassing in it. So this is a thousand percent return. And then my P and L would be let's do cost here. Cools this times 100 times this. I'm going to move this over here. This will be dollars. Let me freeze on P. So let's lock that. Yeah, what the fuck? Let me drag this. Thank you. This minus nope. That's the piano. So that's what I would do. And I'll walk you through exactly why I would do it this way and why I think this way makes the most sense. So when I look at the primary reason for constructing short term is because I can buy more. And the reason for going further out of the money is because they're cheaper and I can buy more. And they have the highest compounding return. Now, depending on how much money I have, there is a scenario where kind of pairing it with in the money options again if I'm not quite certain. But in the case of being certain, that's what it would look like. And it's literally because it's the primary mechanism that trade can make the most money. So now going back to this, we now know obviously that these shares got added into in",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 103,
      "start_timestamp": "01:51:28",
      "start_timestamp_seconds": 6688.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=6688"
    }
  },
  {
    "text": "if I'm not quite certain. But in the case of being certain, that's what it would look like. And it's literally because it's the primary mechanism that trade can make the most money. So now going back to this, we now know obviously that these shares got added into in a bunch of different ways. For the options, we can pick up where these happen. I actually did this with Newton and we have a pretty good idea. Now, Michael says it was a bit of a rhetorical question, but that's my point is humor me. It doesn't matter, right? Because again, like let's let's we're going to do that again, but because you are incessant, I will grant because now we're on this part, we can talk about it. Right? So let's look at where the movement was in GameStop. Austin says, I think Michael wants you to check those April calls. I'm not sure either. Actually, great point, Austin. Michael, could you do us a favor and confirm real quick if we're supposed to look at those April calls or not? Because for the calls that were entered in April, because it's right now based on our best guesses, it's inconclusive. And we're really uncertain is to whether or not that's what we want to happen. Michael says, don't be don't be mean giving you some like, yeah, it's just fucking around. Yeah, we're just playing, but the reason why that joke comes is because you've you've said",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 103,
      "start_timestamp": "01:53:56",
      "start_timestamp_seconds": 6836.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=6836"
    }
  },
  {
    "text": "guesses, it's inconclusive. And we're really uncertain is to whether or not that's what we want to happen. Michael says, don't be don't be mean giving you some like, yeah, it's just fucking around. Yeah, we're just playing, but the reason why that joke comes is because you've you've said that a lot. And we've already told you that we're going to look at it. Yeah, like I told you, we're going to look at it. And the other thing is for recent trades, I've already looked at all of this. So because new and I completely deconstructed literally all of these trades. Yeah. So we know what these are. But anyways, let's just talk about the theory of knowing a date. Now, let's say we know the date is somewhere between mid April, April, you know, 13 April, it looks like and then it comes back down the 17th, right? If I know a date and I know the date starting back here, when the stock is trading in late April, again, let's say that you're saying the 24 to 26. So let's go back to the midpoint there, just for the example, let's go to April 25th. And let's say I know those dates, right? Those dates are going to be sometime between May, 13th and 17th, right? I know for whatever reason, or even if I think if I don't know, if I think with a very high probability that there's going to be a move in",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 103,
      "start_timestamp": "01:55:17",
      "start_timestamp_seconds": 6917.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=6917"
    }
  },
  {
    "text": "let's say I know those dates, right? Those dates are going to be sometime between May, 13th and 17th, right? I know for whatever reason, or even if I think if I don't know, if I think with a very high probability that there's going to be a move in that period, we just finished our mango orange. We're moving on to the reserve mango orange. So you know, it's getting real. Let's take a look. So again, I know that that date is going to be mid May. Let's check out the options. The first thing that I don't do is go to June. Because if I know the date is May, I go to 17 May options. And that's not saying that I know the specific date. The reason why I go to 17 May is because it's the closest primary expiration that I can build a position in. But what I can guarantee you is that if I know dates, I'm not going to go out to June. So if we take a look at his position, he is 21 June, 24, 20 calls. That's out here. Not here. That's the first thing. The second thing is I wouldn't bother with the 20s. And I would go further. Even the 25s. There's still plenty liquid. But there are a lower delta. And again, they're going to give me a higher compounding capability. Royntady says maybe... Yeah, Michael, we know when the trades come in for sure. Yeah,",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 103,
      "start_timestamp": "01:56:34",
      "start_timestamp_seconds": 6994.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=6994"
    }
  },
  {
    "text": "I wouldn't bother with the 20s. And I would go further. Even the 25s. There's still plenty liquid. But there are a lower delta. And again, they're going to give me a higher compounding capability. Royntady says maybe... Yeah, Michael, we know when the trades come in for sure. Yeah, we know that they came in in April. Yeah, there's no debate there. What I'm trying to explain to you is that if I have a date and I think that there's going to be a big movement for whatever reason in mid-May, I do not go to June. I go to May. I think I don't know if that part's connecting with you or not. But it doesn't matter when he enter. I'm using 25 April. I'm using the window you're giving me. And I'm looking at the options chain. And I'm telling you what the optimal trade is here. No, Michael, he did not do that. Look at his position. 21 June. What I'm highlighting is that his first position when he came back and posted on 2 June. 21 June. I think I see what you're saying now. So you're saying before this update, you think he bought near-term options traded those without doing the update. Code of. I mean, to me, it's a fruitless thing. No idea. It's impossible to prove. So yeah, no idea. But yeah, now we can let's do. I want to deconstruct this position. Rapture says that's how I think he got",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 103,
      "start_timestamp": "01:58:03",
      "start_timestamp_seconds": 7083.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=7083"
    }
  },
  {
    "text": "bought near-term options traded those without doing the update. Code of. I mean, to me, it's a fruitless thing. No idea. It's impossible to prove. So yeah, no idea. But yeah, now we can let's do. I want to deconstruct this position. Rapture says that's how I think he got the capital from 50 mill to 20 mill. The problem is, it doesn't again, it doesn't line up, right? Because again, we're going under this idea that he knew the specific date for this one instance. But what I can tell you is that when I look across all literally all of his other trades, there is no specific date. So again, I'm not saying that he couldn't have. But what I'm saying is that it is a complete guess, right? So I don't. Yeah, I there's no way to prove that. Michael says, and this is a big point that continues to be missed. No, I mean, it's not missed. It's that there is no direct parallel, right? Like we can't prove it. So it doesn't. Okay, so Michael show me where yeah, I'll go here show me where he bought up the chain. Again, I don't care if you show me and don't show me line items for 5,000 contract buys. I don't care about that because that's not proof that's showing me a transaction. What I want you to show me is where it shows me that this is roaring kitty that buys whatever you're supposing he",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 103,
      "start_timestamp": "01:59:49",
      "start_timestamp_seconds": 7189.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=7189"
    }
  },
  {
    "text": "you show me and don't show me line items for 5,000 contract buys. I don't care about that because that's not proof that's showing me a transaction. What I want you to show me is where it shows me that this is roaring kitty that buys whatever you're supposing he buys. So now let's go to the period. So we're going to go to April 24 to 26. We're going to look at just the calls. Is this the right time frame? April 2024 24 to 26 just confirm here. And I'm looking at just the calls. I'm looking at single legs. I'm not going to hide expired. I'm going to sort it by size. The biggest trades that are here so far. Yeah, let me get to the offer. Your 5,000 trades or your 5,000 lots. There's one block, two block, three block, four blocks, all at different strike prices. Yup, enjoy. What the fuck are you talking about? There's nothing to enjoy here. This doesn't this literally doesn't mean anything. Right? Like the and it's not 5 million. He he bought 140,000, 125,000. If it's he 180,000 and 60,000. So first thing, we have no fucking idea who this is. Period. Full stop. There is nothing you can show me that says this is him. It's pure speculation. So like if you can't I can't help you. If you can't if you can't understand the logical fallacy in that in that exact in that exact line of thought.",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 103,
      "start_timestamp": "02:01:45",
      "start_timestamp_seconds": 7305.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=7305"
    }
  },
  {
    "text": "this is. Period. Full stop. There is nothing you can show me that says this is him. It's pure speculation. So like if you can't I can't help you. If you can't if you can't understand the logical fallacy in that in that exact in that exact line of thought. If you can't admit that you can't prove that this is him, then what it means nothing. The second thing with this concept of knowing dates, let's grant it. I'll grant it to you. We we know we're going to need this hat. We know that this is him and this is going to be his yellow update or before he does a yellow update. Okay. So now let's say that he knows the dates. Again, I'm accepting multiple points of your arguments that genuinely make no sense. They're computer your conjecture. We know the dates. We know this is him. We don't, but let's take it as is. Now just riddle me this. If I'm that convicted that this is going to happen, why on earth would I build a total position that represents again, let's look at the total value. 140,000 plus 125,000 plus 180,000 plus 60,000. 505,000 dollars. Why on earth would I put on a trade that's only worth 505,000 dollars. If when I signed off, I have 34 million dollars. And to your point, I know the date that something is going to happen. Why would I put on a position total value here that's",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 103,
      "start_timestamp": "02:03:45",
      "start_timestamp_seconds": 7425.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=7425"
    }
  },
  {
    "text": "dollars. Why on earth would I put on a trade that's only worth 505,000 dollars. If when I signed off, I have 34 million dollars. And to your point, I know the date that something is going to happen. Why would I put on a position total value here that's worth 34,473,248? This comes out to a whopping 1.4, 1.5. I'll round it up. 1.5 exposure of his portfolio. It literally makes no sense. Michael says he bought 5 million and turned it into, yeah, I think it's a moot point, man. I definitely appreciate you sharing the idea. But yeah, like there's literally nothing in here. Cedric says options chain was dead a month before for sure. Again, there's no doubt. Again, let's take a look on a trade. I traded GameStop during this. So fun fact, some of the activity that depending on what periods we look at is me. And the reason why I highlight that is because if I'm seeing the activity, literally everybody in Jesus sees the activity. But the first thing I want to show you is this. Look at the volume in the stock. 2 million, 2 million, 4 million, 2 million, 10 million, 17 million, 8 million, 4 million, 4 million, 3 million. What I'm highlighting is pre-earnings quiet volume at earnings high volume post earnings sustained stock volume to a degree. So then before this big squeeze here, we have, Michael says, oh man, no need to argue. Just look at",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 103,
      "start_timestamp": "02:05:18",
      "start_timestamp_seconds": 7518.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=7518"
    }
  },
  {
    "text": "million, 17 million, 8 million, 4 million, 4 million, 3 million. What I'm highlighting is pre-earnings quiet volume at earnings high volume post earnings sustained stock volume to a degree. So then before this big squeeze here, we have, Michael says, oh man, no need to argue. Just look at me sales. It's dude, your argument is it doesn't matter. Like there's no, there's nothing there. Specifically that we can clearly identify as anything. It just, it like, nothing, it doesn't make sense. And again, I'm not saying that he couldn't have done any of that. We know that he traded some of those. No doubt. But what I can tell you is that when we see Rory and Kitty starting to get into his options, the size makes sense for the portfolio. So the main issue that I take with the overall argument, even if he knows the dates and all that stuff taken that for granted, he's not going to put on a fucking options position on a 34. Again, that's that's even saying in we're taking it as here that when he exited 34 million dollars of a portfolio, he's not going to put 500,000 into a trade. It literally doesn't even make sense. It's such a trivial amount of money for somebody like that. It literally doesn't make sense. So granting all the other points that we cannot, we literally cannot verify, we cannot verify. And that is what it is. We cannot verify. We can",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 103,
      "start_timestamp": "02:07:04",
      "start_timestamp_seconds": 7624.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=7624"
    }
  },
  {
    "text": "trade. It literally doesn't even make sense. It's such a trivial amount of money for somebody like that. It literally doesn't make sense. So granting all the other points that we cannot, we literally cannot verify, we cannot verify. And that is what it is. We cannot verify. We can verify that those options were traded and we can verify to your point that you're saying that they were traded around here for an exit. We can verify that. But we cannot verify what, who, how, what we have no idea. We can't verify any of it. So yeah, I think it's important to again, objectively analyze. It's okay to have ideas, but but this doesn't line up at all. So Cedric has the real question and I agree with the real question, which is where did 200 million come from? And we don't know. Newton and I spent a lot of time analyzing that exact thing, trying to come up with best guesses whose Newton's idea was that he traded from the 34 to the 210. And I don't see that personally, I genuinely don't. So the reason why I don't see it is because I think Cedric says, how else if he didn't trade? Oh, sorry, let me be, let me be super, super clear. I, I'm not saying that he traded it all in GameStop. That's, that's the theory. I think a lot of this was from trading. The other stuff that literally could be something we",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 103,
      "start_timestamp": "02:08:35",
      "start_timestamp_seconds": 7715.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=7715"
    }
  },
  {
    "text": "how else if he didn't trade? Oh, sorry, let me be, let me be super, super clear. I, I'm not saying that he traded it all in GameStop. That's, that's the theory. I think a lot of this was from trading. The other stuff that literally could be something we have to consider is that there was the big Netflix movie that came out. He wasn't in it, but my guess is I don't know if he received any sort of money for that, but if he did, it probably would have been a non-inconsequential amount of money. So I don't think, yeah, I don't think he did all of this in GameStop. That's all I mean. I don't know whether or not he used other accounts. I think, yeah, I think in general, will he says maybe he got outside investing? I don't think so. Like I don't see why he would take that, right? Like, because let's think of it from a general mortal standpoint. Like why would I bother taking any money from anybody in owing anybody anything if I have 34 million? Like that's still more money than a reasonable person could, could spend, right? Like, yes, it's easy to spend 34 million. This is not hard at all. But what I'm saying is like if you're trying to just live a reasonable life, that's like, fucking crazy, right? A amount of money to try to spend. So I don't think that he's backed by anybody.",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 103,
      "start_timestamp": "02:09:57",
      "start_timestamp_seconds": 7797.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=7797"
    }
  },
  {
    "text": "yes, it's easy to spend 34 million. This is not hard at all. But what I'm saying is like if you're trying to just live a reasonable life, that's like, fucking crazy, right? A amount of money to try to spend. So I don't think that he's backed by anybody. I don't think that argument holds. And the other thing that I've cleanly identified in his, like the PNL of his portfolio is, let's do this actually really fast. I think this would be a good value add to the conversation is let's do a couple more columns here. And then let's grab. I'm going to see if chat GPT can grab these for me. I do not trust chat GPT. So I'm going to have to verify it really fast. But I'm actually just going to do it myself, I think. I just don't trust chat GPT. Okay. So these are from 2020. So let's go to one step. 9 slash 1 slash 2020. So this was trading at 1.82. Is that the opener close? That's the open. I'll just use the, let me use the closes. I'm going to hide all of these. Hide. And then let's do this. Okay. So 19125. One dot 19125. Then on 16 sept 2020, you 17. What I'm going to show you what I want to analyze and I don't know the answer to it yet. But what I want to analyze is the relationship between his equity curve and the movement",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 103,
      "start_timestamp": "02:11:21",
      "start_timestamp_seconds": 7881.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=7881"
    }
  },
  {
    "text": "this. Okay. So 19125. One dot 19125. Then on 16 sept 2020, you 17. What I'm going to show you what I want to analyze and I don't know the answer to it yet. But what I want to analyze is the relationship between his equity curve and the movement of game stop. 2.64. And then 30 sept was 2.55. You don't have 5. Oh, I see Michael still on the, on the thing. Yeah, I mean, you can, the other thing I can do to debunk the idea like super fast is, again, like if he figured out the dates somehow and like May was the first time he knew the dates and we think that that was him, the subsequent move didn't happen 21 June, right? So if we take a look at this move that happened in here, this isn't 21 June. So it peaked seven June. So again, like the timing thing doesn't line up at all because he bought calls in this again, granting that he knew the date in May. He didn't post in May. He came back. He traded this perfectly. Again, granting because he knew the dates. What I can show you is that he bought options for 21 June here, which again, like if I knew that, if I knew the date was going to be in here, I wouldn't buy options out here. I would buy options here. So yeah, there's just, I think there's way too many holes in",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 103,
      "start_timestamp": "02:13:31",
      "start_timestamp_seconds": 8011.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=8011"
    }
  },
  {
    "text": "is that he bought options for 21 June here, which again, like if I knew that, if I knew the date was going to be in here, I wouldn't buy options out here. I would buy options here. So yeah, there's just, I think there's way too many holes in the story. Like literally from the point that we have no confirmation who is who we clearly see a completely missized position from his last update at 34 million dollars. There's no way that you're trading 100,000 worth of options. It's just or 500,000 worth of options. Like you're going to come back so much heavier than that, which he did in the June play. Like we can just look at it as a percentage of the portfolio. How much he's comfortable putting into options throughout the entire life cycle. It just doesn't make sense at all, so yeah. That's that back to this analysis, though. We got to grab this. We got to grab this. Michael says his first tweet back was after hitting the May play. I know again, I'm granting you that as if it were the case. But again, I don't think it to be the case, but I'm granting that. And what I'm showing you is that the subsequent play that we do see in his yellow update, it doesn't line up well with the supposed window timing that he has. It's off by two weeks. So it tells me that if he knew dates",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 103,
      "start_timestamp": "02:15:09",
      "start_timestamp_seconds": 8109.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=8109"
    }
  },
  {
    "text": "case, but I'm granting that. And what I'm showing you is that the subsequent play that we do see in his yellow update, it doesn't line up well with the supposed window timing that he has. It's off by two weeks. So it tells me that if he knew dates of some sort, or if he cracked the code as we think it, again, he wouldn't have bought options that expire 21 June for 20 when he came back on two June for that post. Again, I'm granting the entire thing that he timed all this because he knew dates. But I'm using that exact point you're making in highlighting that he didn't do that. Because when he posted, again, for this update thing, he posted at a point where GameStop was trading what is trading in here. So he posted over the weekend here, I guess, for that two June or whenever he came back. But the options that he had in two June were out to 21 June. Right? Like if he knew the dates were this, he wouldn't have gone out that far. He would have gone closer. So again, it just doesn't make sense. So yeah. Okay, back to this. All right. So right now, I'm just updating the dates so that we can track the equity curve movement. The oct was. Oh, perfect. I can move this way faster 15 oct. 22 oct 30 oct. 8 Ds. 90s. 14 Ds. We're flying through this. Look",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 103,
      "start_timestamp": "02:16:15",
      "start_timestamp_seconds": 8175.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=8175"
    }
  },
  {
    "text": "Okay, back to this. All right. So right now, I'm just updating the dates so that we can track the equity curve movement. The oct was. Oh, perfect. I can move this way faster 15 oct. 22 oct 30 oct. 8 Ds. 90s. 14 Ds. We're flying through this. Look at me go. 22 Ds. There's a clear trend I can see from these updates though. 22 Ds. 23 Ds. I'm a bad. 23 Ds. 25 Ds. I'm just going to use the 24 Ds. 31 Ds. 5 Jan 11 Jan 13 Jan 14 Jan 19 Jan. 22 Jan 25 Jan 16 Jan 27 Jan. 28 Jan. 9 Jan. Oops. 22 Ds. 2024. Let me find my twin. Oh, Dom, an idiot. Okay. And there is June. So I'm just going to use the 31st. Here. Oh. And we'll turn get rid of this. Beautiful. Now we can take a look at the equity variance. Or the equity variance relation to Jimmy. Price movement equals this minus that divided by yes, please. And then this will all be a percentage. And then we're going to format it. Nope. Not color. I guess we could use a color scale. Okay. Yep. That's good. And then the other thing I do want to analyze though is from start to finish. So this. This minus. This is what about this. And again, the other problem with this is I actually need to go back a little further. Because I miss some of these.",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 103,
      "start_timestamp": "02:17:26",
      "start_timestamp_seconds": 8246.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=8246"
    }
  },
  {
    "text": "That's good. And then the other thing I do want to analyze though is from start to finish. So this. This minus. This is what about this. And again, the other problem with this is I actually need to go back a little further. Because I miss some of these. Um. But let's just take a quick look. I'm just kind of curious here. So this is the value of options. So he did 2164 better than just long equity. I could have produced for him. So this is a lot of options. But the main thing is over the life cycle of the position. Game stop went up like 1900. Interesting. Okay. So now let's. I do want to finish. Looking at his position though. Kind of deconstructing some of it. I also need to launch. Okay. Okay. Oh boy. All the back. I don't know how long I was just sitting for, but. Oh, we got to get back to standing. Okay. And then I actually have to. Double dash really quick because I'm out of milk, which literally cannot happen. And I also have to grab some extra salt water. So give me just a second. There's like a limited window to double dash. I got to get my work off. So I'm gonna have to pay for those two of those. It sounds like you guys are having fun in the chat as is already. So I don't feel. Who do we learn it in the",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 103,
      "start_timestamp": "02:22:10",
      "start_timestamp_seconds": 8530.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=8530"
    }
  },
  {
    "text": "like a limited window to double dash. I got to get my work off. So I'm gonna have to pay for those two of those. It sounds like you guys are having fun in the chat as is already. So I don't feel. Who do we learn it in the chat. Future will says people made so much money off in video. Why is it so hard for anybody to believe that he would trade something else besides game stop? Yeah, I don't know why because I mean the broad background is well that we saw for him is that. I mean, he did like he has done that right. We can we literally can see it. So part of me I see it as. Oh, that's funny. When you look up salt or water or when you look up seltzer, it just gives you alcohol. You literally have to clarify that you want fucking water. That's so funny. That's like legitimately funny to me. Yeah, but I mean, it seems like the overwhelming probability. Is that he probably he probably is doing multiple things. I don't see any evidence that would indicate to me the contrary. And the other thing that I kind of clung on to actually pretty early on when I was looking at this. I mean, I think that it does look like he even when he first started posting at the very beginning. He had other positions on in his update. Like and I could",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 103,
      "start_timestamp": "02:24:56",
      "start_timestamp_seconds": 8696.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=8696"
    }
  },
  {
    "text": "thing that I kind of clung on to actually pretty early on when I was looking at this. I mean, I think that it does look like he even when he first started posting at the very beginning. He had other positions on in his update. Like and I could see that. So that tells me when the whole idea of like the yellow update thing starts. That the yellow update to me. And that he moved money out of his primary account to then trade the yellow right. That's what I think. So. Yeah. Cool. Rhino ducks as per year. No, I like Kroger. The Kroger brand is way better. I think I like the watermelon. I think I like Kroger there. So I had to get a bunch of random ones. But don't worry. We got plenty of mango orange. All right, let's get back to deconstructing this position at least. So let's find these 21 June 24 20 calls. Renegade trader says you're not giving any credit to the counter arguments, which are valid. Yeah, that's the problem though. Like when somebody isn't interested in trying to find like true information. It's a really common argumentative technique where somebody will just continue to reiterate their point or try to convince you to their point. Which is always like I can always very clearly tell that's not somebody that's interested in finding truth. They're interested in trying to convey and convince of their argument happens all the time.",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 103,
      "start_timestamp": "02:26:14",
      "start_timestamp_seconds": 8774.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=8774"
    }
  },
  {
    "text": "where somebody will just continue to reiterate their point or try to convince you to their point. Which is always like I can always very clearly tell that's not somebody that's interested in finding truth. They're interested in trying to convey and convince of their argument happens all the time. That's actually one of the big issues that traders have is traders very frequently have a big problem where they. Attach their identity and their ego to a trade. So then they essentially try to validate their trade versus I call it looking for nose. So it's a big difference when somebody's like trying to. Argue to find truth via the exchange of ideas, right? Because you can notice in my argument with Michael when we were debating. I granted his points, right? Like I took his side and then I still worked through the scenario. Not once has that been reciprocated by him and that's again like very, very common for somebody that's not actually trying to identify truth. Because the other thing is like with roaring kitty just about everybody is trying to be the person that cracks the code right because that that person that would be really rewarding. So that's why I think there's so many people that are just so interested in trying to like call the next thing to show that they're the one that cracked the code. And I actually think that's like I started to do a statistical analysis on the number",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 103,
      "start_timestamp": "02:27:47",
      "start_timestamp_seconds": 8867.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=8867"
    }
  },
  {
    "text": "really rewarding. So that's why I think there's so many people that are just so interested in trying to like call the next thing to show that they're the one that cracked the code. And I actually think that's like I started to do a statistical analysis on the number of calls that are highly upvoted on Reddit to track them. So I have a giant arc. This is what I do. It's just I constantly nerd. But I started this back in June. So I have an archive that I've built all kind of current date stuff to track out how effective the again the projections are that are highly upvoted to try and see again like how accurate we are. So far not quite. So. Let's get back to this and let's take a look at. I want to find these 21 June we can do this again because I did this not too long ago. I forgot when they started getting really active. Do you guys remember. I don't remember off the top of my head. There we go because what I can show you is where roaring kitty is trading. Do you know why I can show you because rather than somebody putting on 100,000 dollar trades. I see somebody scaling into fucking 2 million 3 million 2.6 million 2.5 million 2.3 million 2.8 million. I can see somebody scaling in at size again. Pretty easy to find the fucking cat. So. Let's take a look",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 103,
      "start_timestamp": "02:29:01",
      "start_timestamp_seconds": 8941.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=8941"
    }
  },
  {
    "text": "show you because rather than somebody putting on 100,000 dollar trades. I see somebody scaling into fucking 2 million 3 million 2.6 million 2.5 million 2.3 million 2.8 million. I can see somebody scaling in at size again. Pretty easy to find the fucking cat. So. Let's take a look at these 20s. And we're going to go to the strike. I'm just going to run the 20s for now. And this is going to take. Not too long. So these came in mid May. Off Putin says 19 to 29. Thank you very much. That's super helpful. I mean, we can kind of see it anyways, but yeah. And when he showed up, it was 120,000. Because this is nowhere near 120,000. So we have to figure out when this thing got built, which is going to be a little bit of a tricky prospect, but we will navigate through it. So now what I need to do is add another tab. And this will be RK. What is this? The 21 June. 20s. And let's take a look. So this is going to be date. This is going to be time. I want both of those specifically in this instance. This is going to be size. This will be. It's all the same. I'm going to keep it the same up here. This will be the 21 June 20 calls. All of these will be for that. Okay. And then. This off put and says super easy and",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 103,
      "start_timestamp": "02:30:36",
      "start_timestamp_seconds": 9036.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=9036"
    }
  },
  {
    "text": "this instance. This is going to be size. This will be. It's all the same. I'm going to keep it the same up here. This will be the 21 June 20 calls. All of these will be for that. Okay. And then. This off put and says super easy and toss. You can see daily volume and I know dude. I've been using toss since 2007. Super familiar. That's it doesn't have the details that I want. So. Well, not not any more convenient than this. It's essentially the same same. Okay. So now let's start looking at these dates. I wish there was like a dual sort here. That would be. Much more preferable. We start on the 20th is the earliest that I see. So 20 May. I find that when we do these like people have a really hard time. Like doing the process, which is always interesting to me. Because this is like this is the process of research. Is actually getting into the details. Not using the easily accessible. Submation level information. I need a custom date. I don't like these dates. Here we go. So let's do those. Yeah, good. Okay. Beautiful. And then Michael says other than you're not getting into the details. I thought you were leaving. Didn't you tell us you were going off you little rascal. Because it looks like you're still here. Okay. So 20 May. I see. Here. So the time on these. Rory and Clint says Michael",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 103,
      "start_timestamp": "02:32:15",
      "start_timestamp_seconds": 9135.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=9135"
    }
  },
  {
    "text": "Michael says other than you're not getting into the details. I thought you were leaving. Didn't you tell us you were going off you little rascal. Because it looks like you're still here. Okay. So 20 May. I see. Here. So the time on these. Rory and Clint says Michael doesn't have an ice. It's a fucking great joke. I'm going to throw it in. I'm going to throw it in. Where's my fucking. You get one fake internet point. Because that is a fucking fantastic joke. The fucking great joke. Okay. So. The time for entry on this was. I get that all the way. The費 is 1 Bitcoin 12. Bitcoin Those seven. And then I'm just going to. How about these four minutes? How I want 5000. And then we need a couple more Deets. Closed that side, perfect. So now I can look at. I don't want spot price. I want premium. In this case, it was 2.88. And then this will be in mill. For now. Michael, you sneaky little duck. You're still here after your second exit. Great to see you again. Okay, 20 May. So it looks like that's the first entry. Am I missing any from 20 May on like these these larger contracts? 102 K. Very good. He says bro keeps rolling his options. We get plus two fake internet points. That's fucking. Mr. Alex. Yo, y'all are on a fucking you guys are on it. All pump no dumb. It's fucking",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 103,
      "start_timestamp": "02:34:10",
      "start_timestamp_seconds": 9250.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=9250"
    }
  },
  {
    "text": "missing any from 20 May on like these these larger contracts? 102 K. Very good. He says bro keeps rolling his options. We get plus two fake internet points. That's fucking. Mr. Alex. Yo, y'all are on a fucking you guys are on it. All pump no dumb. It's fucking classic too. Oh, it's so good. Roryntidysus, for all we know, he could have had a lot of those options as leaps. Yeah, that's actually a great point he could have. And one of the other things is and we'll take a look at it in a second. But one of the other things here is like even the duration on these is still pretty significant. I would argue compared to like doing something that's like super, super short term timeframe. So if we look at what is this 21 June. I already have it up here. Let's just take a look. 21 June 24 equals this minus this. Yeah, so it's still a month out, even from here. So it's not like it's a very short dated option. That's still a pretty meaningful amount of time. So it's 20 May. Now let's take a look at 21 May. And again, I'm not going to try to figure out where you got all his options. I'm just trying to get a couple of senses of things really quick. 21 May is 12 57 25, 5,000 again. I'm just going to do the 5,000s for this. We'll look at these. And",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 103,
      "start_timestamp": "02:36:44",
      "start_timestamp_seconds": 9404.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=9404"
    }
  },
  {
    "text": "again, I'm not going to try to figure out where you got all his options. I'm just trying to get a couple of senses of things really quick. 21 May is 12 57 25, 5,000 again. I'm just going to do the 5,000s for this. We'll look at these. And then that was 3.35. And then I'm sure we have more 21 Mays here 11 32. 11. Wait, I'm all fucked up. I missed a bunch of 20s. I'm an idiot. I'm a straight idiot. They're literally right next to each other. Man, I'm stupid. I can't believe y'all let me get away with that 20 May. And he got those at 12 49. 49 16. Now, one of the other kind of Adam Admin notes is. We assume essentially all of these are him. But again, like we genuinely don't know. Because the overall options chain here was actually pretty active. So there's a good chance that other people were because again, I saw the activity. That's one of the reasons why I started trading GameStop. Like quite literally right around this period is because I saw the options chain being hit. Literally this, which was absolutely insane. So I ended up starting buying into it straight up for that precise reason. So as I was doing that, I know for sure other people were doing it. Because if I see it, I know other people see it. 21 May. Off Putin says May 22, the volume was 77.",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 103,
      "start_timestamp": "02:38:39",
      "start_timestamp_seconds": 9519.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=9519"
    }
  },
  {
    "text": "I ended up starting buying into it straight up for that precise reason. So as I was doing that, I know for sure other people were doing it. Because if I see it, I know other people see it. 21 May. Off Putin says May 22, the volume was 77. Most was Gil. Well, we don't know. But yeah, I mean, it's a fair assumption. Most of the volume, I think in general, I think can easily be logically attributed to the cat. Simply because I mean his position size is massive, right? So it takes time to put these positions on. But again, I just I'm very cautious for definitive statements like most was Gil. And we don't know that. But we do, we can confirm that he was a large constituent, probably most, I think is completely fair to say. 21, 21 May again. These came in at 1249 31 1249 31. And then 2.48. Off Putin says we do know he ended up with 120 calls and we know his basis. Yeah, for sure. I agree with that. I fully agree with that. But I haven't done that math. I don't know if I haven't gone through all of the 120's, but I know that the OI is larger than that during the period. So if we go to what 10 May. 10 May 24. Oh no, he was getting in towards the anime. Let's go to June. We go to mid June and June. And let's",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 103,
      "start_timestamp": "02:40:41",
      "start_timestamp_seconds": 9641.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=9641"
    }
  },
  {
    "text": "all of the 120's, but I know that the OI is larger than that during the period. So if we go to what 10 May. 10 May 24. Oh no, he was getting in towards the anime. Let's go to June. We go to mid June and June. And let's take a look at the. Right now it's buffering. And then. Let's do. The 21 June. And then let's do the 20's. So there's 152 K. So we know 120 is the cat. So then we know. To off Putin's point that the majority of the 120 or the 21 June 24 20 call volume. We absolutely can definitively say. Overwhelming majority him for sure. How it split between the days. I'm not positive. We'll find that out in a second. That's actually one of the things I want to calculate when we look at this. But yeah. And confirm. 1249 31. What's this one? You for it. Okay, cool. So now we have 22 May. Because the other reality that I'm going to have to pop up in a second are I'm going to look at the mid price as well. Because there's going to be a bunch of these that I'm sure that he didn't just get at the offer. But I'm just going to break it down one one piece at a time here. So 22 May. We have a bunch. We have 11. 38. 49. And then I saw another question up above. Inder says can't",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 103,
      "start_timestamp": "02:42:21",
      "start_timestamp_seconds": 9741.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=9741"
    }
  },
  {
    "text": "these that I'm sure that he didn't just get at the offer. But I'm just going to break it down one one piece at a time here. So 22 May. We have a bunch. We have 11. 38. 49. And then I saw another question up above. Inder says can't you data scraper did I miss something we can definitely can. So when I was originally looking at like the overall position here. It's actually like precisely what I did the piece together the total thing. I. I like it's I mean, it sounds weird, but it is what it is. Like I like being intimate with the data. So my preference for something like this. If you take a look at like the series, right? It's analyzing Rory Kitty's trades. So I am trying to like quite literally analyze them. So the process of analyzing is very in depth for me. But I do it so that I understand all of the nuance around what happened. That's my that's my goal. It's why we why I've gone through piece by piece. So it's much slower. This is not something that I do in general for most things I'm looking at. But if I'm going to take the time to quote unquote deep dive something like I'm going to deep dive it. Even if it is time consuming, which this is. But that's okay because. As I do this, I get a better understanding. Five. So one of the things",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 94,
      "total_chunks": 103,
      "start_timestamp": "02:44:30",
      "start_timestamp_seconds": 9870.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=9870"
    }
  },
  {
    "text": "at. But if I'm going to take the time to quote unquote deep dive something like I'm going to deep dive it. Even if it is time consuming, which this is. But that's okay because. As I do this, I get a better understanding. Five. So one of the things I've noticed so far with these entries is that a lot of them are in the morning or I'm sorry in the afternoon closer to the close, which is what I would expect. For most professional traders that's a very common time to put on larger positions because there's a lot of liquidity. But I can still see that he's splitting it a little bit and there are some prospecting positions that are going on through different points throughout the day. 11 32 33 oops. Don't need to fucking up my data. And that was 3.13. All Putin says don't forget fees and commissions. Yeah, I don't think they'll have commissions here. But yeah, you're absolutely right. It's super expensive. We did. We did an analysis on this not too long ago. Looking at. You know, the prospects of some of his other positions, whether taking to expiration or unwinding. And commissions definitely will have a play. 11 15 53. And then those are 2.9. And then 0 8 52 37. That's a 2.5. And then here we have 11 28 29. And these are at 3.1. Okay. Now we go to 23 May. You're not see 24 May. I",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 95,
      "total_chunks": 103,
      "start_timestamp": "02:45:51",
      "start_timestamp_seconds": 9951.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=9951"
    }
  },
  {
    "text": "And commissions definitely will have a play. 11 15 53. And then those are 2.9. And then 0 8 52 37. That's a 2.5. And then here we have 11 28 29. And these are at 3.1. Okay. Now we go to 23 May. You're not see 24 May. I see 11.09 44 1.68. We've 5 May. 6 May. 27 May 28 May. So all. 28. We got 2 at 28. 28 May. We have 0 9. 21 28. And then we have. 12 40. 26. First one. 4.13. So I think this is one of the bigger sizes. Yeah. And then the second one is 3.25. So this was a bigger. Couple days. South cact dad says you're my hero. I like. I love that. Thank you very much. I appreciate that. Hopefully. The analysis is interesting. Me 29 30. Is 30 May. And then I'm going to take a pause after this and just kind of like synthesize what we're seeing really quick. Okay. So let's do a few things really fast. We need the 30 May cost 2.6. 2.6. No. So we're at 51 million already. And. These are going to get rid of for now. Now. The fuck. We're at 90,000. So we have. Essentially. The bulk of this on. And what I want to do is actually look at the distribution of these entries and stuff. But the other thing I need to do really fast is I need to look at the mid transactions.",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 96,
      "total_chunks": 103,
      "start_timestamp": "02:47:34",
      "start_timestamp_seconds": 10054.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=10054"
    }
  },
  {
    "text": "The fuck. We're at 90,000. So we have. Essentially. The bulk of this on. And what I want to do is actually look at the distribution of these entries and stuff. But the other thing I need to do really fast is I need to look at the mid transactions. Because my guess is that he wouldn't have got hit. Yeah. So I can see a couple that crept in here that are very likely him. The 22nd was a super active day. Let's do 22 May. And again, this is just under the assumption that this is very likely him that just didn't get through. At the midpoint or at the offer that he did get through at the mid. So the time here is 0 918. 18. 58. And then it's a week 5,000 still. 2.5. No. And then we had a 24. This came in at 11. 49. 39. And this was 1.75. Okay. So this is the bulk of what he put on. Obviously he grabbed another 20. Do you guys have any strong ideas on where that 20. 70 bought 70 K on May 22. Let's see what this is. Yeah. Okay. So that's where the 20 is. At average of 635. Okay. Cool. So that's fine. I don't really need all of them. I want the stuff that like I can pretty confidently say that I believe is him, which is this for sure. So then I want to insert a few charts here.",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 97,
      "total_chunks": 103,
      "start_timestamp": "02:50:53",
      "start_timestamp_seconds": 10253.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=10253"
    }
  },
  {
    "text": "the 20 is. At average of 635. Okay. Cool. So that's fine. I don't really need all of them. I want the stuff that like I can pretty confidently say that I believe is him, which is this for sure. So then I want to insert a few charts here. Oh, I forgot. I can literally just export this and I can have a forgot man. We got chat GPT. My stuff is like completely locked. Where did you save it? There it is. Let's put that here. And Renegade says is this dark pooler lit. Don't know. It doesn't really matter. Okay. So then I'm going to have it. I'm going to put it in the data. Let's see if it can do it in the regular one first. So I want it to analyze the tab. Okay. 21 June 20. Seize. And create. The graph that shows. I'm going to do create graphs. We're going to need a few. Great graphs that show. Um. Average. You should time by date and in aggregate. Total volume or total premium. Average. Premium. By date and aggregate. I think those two would be good to start. Wait. I'll see what chat GPT comes up with. But. My guess is we'll see a few things. Like again, one of them, even if I just run a raw dog average. It's 11 25 that he's entering, which again is like exactly what I would expect to see here. Very, very standard fair. And",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 98,
      "total_chunks": 103,
      "start_timestamp": "02:53:19",
      "start_timestamp_seconds": 10399.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=10399"
    }
  },
  {
    "text": "GPT comes up with. But. My guess is we'll see a few things. Like again, one of them, even if I just run a raw dog average. It's 11 25 that he's entering, which again is like exactly what I would expect to see here. Very, very standard fair. And then the other note. Off Putin. Has what they believe the remaining 20k. Which looks like. Something around here. Which is totally legit. I'm going to see what GPT right now GPT is giving me nothing. So we'll see if there goes. That's not what I wanted at all. The 28th. Okay. So that average premium. I'm just going to verify if chat GPT is correct. 2.81. It is good. So I got that right. This is what it's showing average premium portrayed by day. So obviously this is an aggregate is not aggregate premium. Because I noticed that yeah, there was a couple bigger trades here. So then the last thing I'm going to dump in here really fast is. Jimmy price. Which I haven't here. And then I just realized it's almost fucking eight o'clock. So I got to get off in a second. Damn, three hours. I didn't even realize it's been that long. Okay, so we need 20 May. Which is 2314. We need 21 May. 2212. 22 May. 2112. Interesting. 24 May. 19. But definitely scaling. 28 May. 23. 78. 30 May. 2261. Very interesting. So a couple of things that stick out to me",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 99,
      "total_chunks": 103,
      "start_timestamp": "02:56:03",
      "start_timestamp_seconds": 10563.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=10563"
    }
  },
  {
    "text": "didn't even realize it's been that long. Okay, so we need 20 May. Which is 2314. We need 21 May. 2212. 22 May. 2112. Interesting. 24 May. 19. But definitely scaling. 28 May. 23. 78. 30 May. 2261. Very interesting. So a couple of things that stick out to me about this are again, like going back to this concept of him somehow having like perfect timing. So scaling also disproves that to me. Because I wouldn't time it where I'm essentially placing. Let me have this add. Total premium. At total. Premium. Birthday and. Emulative premium. Do the second. But the scaling in is is really, really interesting. Yeah. I like this chart. So I'm going to do add a second axis. For average premium per day to preserve. Scale. Also add. GME price. 20 May. 2314. 21 May. 2212. 22 May. 2112. 24 May. 19. 23. 2378. And then 30 May. 2261. 2261. Okay. I'm going to see if it can make these updates. And then. Is what I want to know. Specifically. Yeah, there we go. So this is obviously looking at a few things. So. This is interesting. I need to understand this better. One of the parts that I don't understand from this. I'm going to say. Is. Why. Why the scaling that he did. Like 20 May. 21 May. Like two very light days. Followed by this massive bulk day. And then. A handful more. Because the other thing I can infer from this",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 100,
      "total_chunks": 103,
      "start_timestamp": "02:58:02",
      "start_timestamp_seconds": 10682.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=10682"
    }
  },
  {
    "text": "the parts that I don't understand from this. I'm going to say. Is. Why. Why the scaling that he did. Like 20 May. 21 May. Like two very light days. Followed by this massive bulk day. And then. A handful more. Because the other thing I can infer from this is that it doesn't have a lot of. It's actually planned to get to like 120. It actually almost looks like he planned to get to 100. What does this add up to. 25. No, I don't think he would have done 95. That's kind of weird. That's really interesting. And the reason why it's so interesting to me is like the periods that he bought in. What the stock was doing. Makes sense because I've seen him do this plenty of times before. Where he scales into things as they go down. That's not new at all. But I wonder like what the terminal position size was expected to be. Is that I'm not sure. If that was defined, it doesn't look like it was defined to me. Fascinating. Man. Fucking cool. All right, I have to noodle on this a little bit more, but I got to get off. I got to go eat dinner and stuff. I didn't realize it's fucking eight o'clock happens quick. Absolutely blast hanging out with you guys. Thank you guys for looking at this all with me and the information. Really enjoy the dialogue. Follow up when we have kind of the",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 101,
      "total_chunks": 103,
      "start_timestamp": "03:02:14",
      "start_timestamp_seconds": 10934.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=10934"
    }
  },
  {
    "text": "off. I got to go eat dinner and stuff. I didn't realize it's fucking eight o'clock happens quick. Absolutely blast hanging out with you guys. Thank you guys for looking at this all with me and the information. Really enjoy the dialogue. Follow up when we have kind of the next podcast or game stop specific. But otherwise we do have the GME live stream next Saturday. Same same there. And then I will talk to you all throughout the week. See you on some of the other live streams. As always, be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "GU0G-GnKDzQ",
      "title": "Analyzing Roaring Kitty's Trades Pt5 | GameStop Analysis Live Ep13",
      "url": "https://www.youtube.com/watch?v=GU0G-GnKDzQ",
      "upload_date": "",
      "duration": 11080.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 102,
      "total_chunks": 103,
      "start_timestamp": "03:04:03",
      "start_timestamp_seconds": 11043.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GU0G-GnKDzQ&t=11043"
    }
  }
]