[
  {
    "text": "What's up, everyone? Welcome back to the L.I.R. podcast. We have a familiar face, Matt. And it's been, is this the first time we talked this year? Is that correct? It's been a while. It's been a while now. I can't remember. But if it, if this is the first time we talked this year, we have a lot. And even if it's not within the last three months, four months, there's no shortage. So I am looking forward to catching up. We were literally just talking a little bit before we started about how business is going in general. So I thought maybe we'd just start there and dig right in. Yeah, for sure. So like we're like we're talking about just before. So again, my background, I'm always a little stock oriented, like more trend follower, but you know, tactical, not just like buying old kind of stuff. And came into the year, long started off well, then you know, the sell off began. And then it was like all the Trump tariffs were fortunately able to kind of pivot. And before things got nasty, so avoided all the drawdown, all the rest and able to kind of then reengage about a month now. And so like, you know, coming off the bottom is always, it's the biggest opportunity. But you know, the easy stuff's always visible in hindsight. So we got positioned pretty well. Like a, but like, you know, probably like half the stocks or the",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 60,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=0"
    }
  },
  {
    "text": "then reengage about a month now. And so like, you know, coming off the bottom is always, it's the biggest opportunity. But you know, the easy stuff's always visible in hindsight. So we got positioned pretty well. Like a, but like, you know, probably like half the stocks or the stocks I would have wanted to have together half have been a little more laggard because it's been like tremendous opportunity. So, but, you know, for me, every uptrend is like phases. You know, you get this first push. Now, I think we're due for a little bit of a pause and we're going to get another push. And so it gives you a chance to kind of then reposition whatever capital is not optimal. Let's say, you know, so it's been good. You know, thankfully, it's just like wild few years, even with clients, like talking about, it's like, you know, it's COVID, which was wild. You know, we dodged and participated. Then it was a 2022 bear market that was, you know, a tariff bear, it's like every year, just like a chance to really blow up and a chance to make a lot of money. So it's been a wild few years for everyone. It's funny because I find it, especially from like a step that's background, people always like to talk about the uniqueness of different time frames. Like, oh, there's a global pandemic. How often does that happen? Or oh, Russia invaded Ukraine. How well,",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 60,
      "start_timestamp": "00:01:38",
      "start_timestamp_seconds": 98.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=98"
    }
  },
  {
    "text": "been a wild few years for everyone. It's funny because I find it, especially from like a step that's background, people always like to talk about the uniqueness of different time frames. Like, oh, there's a global pandemic. How often does that happen? Or oh, Russia invaded Ukraine. How well, Russia kind of has a history, but anyways, but it's like the thing that I try to remind people when we talk about market activity is that it's always something. There's always something. And it's actually more anomalous to be in these really prolonged periods where it's kind of quiet than to have these, you know, busier periods that just seem to have these different things going on now. It's been like a lot of weird things. I didn't have like, you know, school yard, like, fight on Twitter on my like, bingo card for things. I would just be up this year, you know? I'm literally getting smashed in a Tesla ratio called diagonal because big dad. I'm in a Tesla position. I'm like, you know, I feel like, you know, I was even watching it happening. Like, now it always in hindsight, you kick yourself. I should have I should have sold earlier, but at first, it's like a comment like Trump, Trump always has comments. He has a name for everybody. I mean, you must have a name for me somewhere in like Washington, you know? And it's like, then it's like, it was like a nuclear",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 60,
      "start_timestamp": "00:03:17",
      "start_timestamp_seconds": 197.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=197"
    }
  },
  {
    "text": "I should have sold earlier, but at first, it's like a comment like Trump, Trump always has comments. He has a name for everybody. I mean, you must have a name for me somewhere in like Washington, you know? And it's like, then it's like, it was like a nuclear bomb and like slow, it was like a slow nuclear bomb like going off. And I was like, what the? And then finally I kicked it out and said, okay, just I don't know what way is going to go. I would want to be must right now. I'd have people tasting my food if I was and that's just the way it is, you know? It is so it's literally like watching mom and dad fight. And yeah, and they're they're they're driving the car and we're just kind of sitting in it like, yo, I can y'all figure this out? There's always something like I love history. I see kind of stuff. And like I was my boys now. They're seven and five. They love Rome and Roman history and all that. And I was just kind of think to myself it's so much like, you know, back even in the Roman era, there was like Caesar was, you know, that became the head guy, but there was like the triumphant at first. It was like, you know, I think it was Cassius. He was the guy with all the money. Then he was the, you know, Caesar",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 60,
      "start_timestamp": "00:04:56",
      "start_timestamp_seconds": 296.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=296"
    }
  },
  {
    "text": "even in the Roman era, there was like Caesar was, you know, that became the head guy, but there was like the triumphant at first. It was like, you know, I think it was Cassius. He was the guy with all the money. Then he was the, you know, Caesar was the politician. And so I, I mean, again, you have the like that scene dynamic must have the money guy and Trump's the politician guy. It's just amazing. Historically, how stuff just repeats in different ways. It's a wilder like the sea. You know, so it's it's always the same thing slightly different flavors. Yeah. I always one of my favorite things to think about is like, I call it the the veneer of civilization because I mean, I think like we are all vertical walking monkeys. And right now civilization makes it seem like we eat with forks and knives and we're so refined. I don't know which one to use, but I know there's multiple there, typically, but like if you strip everything away, right? And you put people in a survival situation, everybody's the same base against things. And you can see that magnify out in game theory, right? It's just different scope. Now, when you were positioning the beginning of the year, what did that look like? So again, because I genuinely can't remember if we connected early this year, but if we did, I remind me, if we didn't tell me for the first",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 60,
      "start_timestamp": "00:06:34",
      "start_timestamp_seconds": 394.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=394"
    }
  },
  {
    "text": "game theory, right? It's just different scope. Now, when you were positioning the beginning of the year, what did that look like? So again, because I genuinely can't remember if we connected early this year, but if we did, I remind me, if we didn't tell me for the first time, what, like what were your holdings? Not yeah, exhaustive list, but what were you doing the first part of the year? So funny enough, it's like a lot of the same stuff I still kind of have. Well, like not all, but like, you know, I had G. E. Vernova, which was like the big play of like a literacy demand that had a volunteer. But that, no, that I sold into a little earlier last year, but definitely G. E. Vernova. I mean, it was the AI trade. That's what I've been focused on. And it kind of fortunately, like I run some like extension hedges, like things get very extended. I'll buy us some like add-on money puts in case there's like a downside reversal, because it's always like stares up and elevators down. You know, so in that case, if you, it doesn't always work, but if you time it well, even once every four or five times, it's worth its while to do. And so at least I had some, because I had a really concentrated position in G. Vernova, and that broke with everything else, which now you look in hindsight, ridiculous, because of",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 60,
      "start_timestamp": "00:08:13",
      "start_timestamp_seconds": 493.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=493"
    }
  },
  {
    "text": "if you time it well, even once every four or five times, it's worth its while to do. And so at least I had some, because I had a really concentrated position in G. Vernova, and that broke with everything else, which now you look in hindsight, ridiculous, because of the whole deep seek. The number of news I had to deal with this year, like it's off the charts. But so that kind of got us already kind of happened to be change the portfolio, then the market just really started to deteriorate. And so then we went the cash, then after the whole paraffoluberation day thing happened. And when, you know, straight down, but we were already in cash by then, which was great. And then off the bottom. You normally don't trade to the short side, is that correct? You know what? It's like I've tried, I've done it over the years, like you went out as a market maker. It's like, it was always, but it was always like the long side. Even in two, I always tell people, even in 2008, I had a good year, but it was from the long side. I just, I'm not, I don't know what it is. I just like, everyone says you're always influenced by the first trades you make, whether it's long or short. And I guess that's, it's true in a certain extent. I always think long. So not that I'm always long, but that's just",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 60,
      "start_timestamp": "00:09:52",
      "start_timestamp_seconds": 592.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=592"
    }
  },
  {
    "text": "I'm not, I don't know what it is. I just like, everyone says you're always influenced by the first trades you make, whether it's long or short. And I guess that's, it's true in a certain extent. I always think long. So not that I'm always long, but that's just like the side I play from. I guess that might be true, unless you have like a lot of, what is it, fluoride in the water and you become semi on the spectrum like me because my first handful of trades were just buy and hold stock. And I haven't done that in like two decades. So that I guess I got broken. That doesn't apply at all. I can literally can't even imagine the longest I held the stock other than there's like two stocks I hold in the portfolio literally because of bets that I've made with people during live streams. And one of those bets I made, I literally want to call it like five four or five years ago. And I literally just hold the stock. And I said I would never sell it. So it's literally, it's going to die. I just going to, I'm going to die with the stock. Which one is it? It's AMC. AMC really. So we just, and I don't even know how I literally don't even remember how the bet came up. And I, and I don't remember who it's with. But they're out there and they'll know who",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 60,
      "start_timestamp": "00:11:30",
      "start_timestamp_seconds": 690.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=690"
    }
  },
  {
    "text": "going to die with the stock. Which one is it? It's AMC. AMC really. So we just, and I don't even know how I literally don't even remember how the bet came up. And I, and I don't remember who it's with. But they're out there and they'll know who it's with. And I now have to die with AMC in my portfolio because I said I would on a live stream. But I don't even know what it's doing right now. I've no idea. But I have it. So hopefully good. Hopefully people are watching movies. Hopefully good. So walk me through like the broader portfolio structure in terms of maybe average number of positions holding durations, stuff like that. It's a good question. Like I like to try and keep my, the way I put exposure on very consistent because I just through my, again, everything I do is through like looking back at the good and bad periods and trying to kind of figure out how, you know, raw wire differently and how to like not try and fight myself. So I just, and I think a lot of people go through this like, you know, when things are good, you tend to want to take bigger sizes. And when things are going bad, you want to go smaller. And then usually you're too cocky at the end of an uptrend and you too similar to the beginning of one. So it works against you on both",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 60,
      "start_timestamp": "00:13:09",
      "start_timestamp_seconds": 789.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=789"
    }
  },
  {
    "text": "things are good, you tend to want to take bigger sizes. And when things are going bad, you want to go smaller. And then usually you're too cocky at the end of an uptrend and you too similar to the beginning of one. So it works against you on both sides. So for me, I just try and really make that part of the decision making black and white. I usually start your position at about a 10 of the portfolio. And, and I try and build like I like to have a position be about 25, 30 of portfolio, but I'll build with subsequent 10 purchases along the way. And so that usually, so usually like, you know, at the beginning of a trend, you don't know who the winners are going to be like we're talking about before. So you usually get up to like 8, 10, 12 stocks. And then my aim is always to kind of like trim the laggards, free up the cash, and then redeploy into the winners. So usually get up to 10, 12 and by the time like I'm hot in a trend, it's probably 5, 6 stocks that I'm holding. And that's just been like, that's always been like kind of the space that been comfortable in. It's not too few stocks that one will, will hurt you too badly. And it's not too many that you can't like stay focused and manage these positions. So that's always a work for",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 60,
      "start_timestamp": "00:14:48",
      "start_timestamp_seconds": 888.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=888"
    }
  },
  {
    "text": "that's just been like, that's always been like kind of the space that been comfortable in. It's not too few stocks that one will, will hurt you too badly. And it's not too many that you can't like stay focused and manage these positions. So that's always a work for me. When you're sizing one of your positions, let's say it starts at 10 of portfolio value. What's the average amount of portfolio value that's actually at risk? I'm assuming that there's a stop that you have in place, typically at some supportive assistance level. So like on the average, it's probably 4 to 5 of that position. So like, you know, 4, 10, 5, 10th of percent, this is like what it is. And that's a stat I track when I'm putting on positions. Because you know, it's like you can always look at one position, but you know, we all were all guilty. We all make a rule. Then we find ways to circumvent it with like other ways of achieving ourselves to doing what we really want to do. So yeah. So you know, you know, each, each stock is fully, you know, controlled and risk. But then you have way more positions open. And then after you still have all this exposure. So I always track when I'm putting on positions, what's the total exposure? If every stock gets to stop, what would be the actual cumulative loss of all of them? So like, I always",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 60,
      "start_timestamp": "00:16:27",
      "start_timestamp_seconds": 987.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=987"
    }
  },
  {
    "text": "then you have way more positions open. And then after you still have all this exposure. So I always track when I'm putting on positions, what's the total exposure? If every stock gets to stop, what would be the actual cumulative loss of all of them? So like, I always try and keep that like under 2 like as I'm building. And then after I do Titan stops and freeze up risk capital for more positions, that's always kind of how I try and approach it. Got it. And then walk me through the process of trimming off the laggards. I assume there has to be some level of not just saying this one's worth this much, this one's worth this much. I imagine there's got to be an element of opportunity that you're expecting to see and stuff like that. Yeah. So it's a lot of it is time-based and then performance. So the kind of stocks I'm trying to approach is it's always from like the William O'Neill perspective. Those who don't know him, we were able to make money in stocks, legendary guy. And it's from the perspective of each cycle, there's like the it's stocks. There's like the main, like for example, the past couple years as it was in video. It's one of them. You know, right now, I'd say like Robin Hood is one of them. Don't say that. Don't say that. Well, anyways, you know, I've decided that everybody has to have a",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 60,
      "start_timestamp": "00:18:05",
      "start_timestamp_seconds": 1085.6999999999998,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=1085"
    }
  },
  {
    "text": "like the main, like for example, the past couple years as it was in video. It's one of them. You know, right now, I'd say like Robin Hood is one of them. Don't say that. Don't say that. Well, anyways, you know, I've decided that everybody has to have a completely rational thing to hate. And I've selected Robin Hood. Really? Yeah, I just hated. I just decided one day that I hated with all my guts. So well, I don't edit these, but I'll pretend I edited that out. Okay. So you know, if you go back and you've studied these charts, like, you know, like William O'Neill would talk about, it's they have a character and they should be moving at a certain rate. And they'll always kind of like outperform the vast majority of stocks. Like it's not like a little bit of an out. It's like a game changer. Like if you add Nvidia in you know, 2023, 24, like not like my rule is a leader should have two qualities. It should go more up more than the market on up swings, but then also fall less than the market on downsuits. And and I think the track is as well as like we tend to kind of sometimes just look at a stock that's high beta, very volatile. So it'll go, it'll beat the market on the upside. But it's just so crazy. It's not really leading. It's just it's just an volatile stock.",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 60,
      "start_timestamp": "00:19:44",
      "start_timestamp_seconds": 1184.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=1184"
    }
  },
  {
    "text": "think the track is as well as like we tend to kind of sometimes just look at a stock that's high beta, very volatile. So it'll go, it'll beat the market on the upside. But it's just so crazy. It's not really leading. It's just it's just an volatile stock. So my aim is always like, so once we get the stocks, I always look to the two, two, three weeks out to how the performance is going. And the ones that most closely satisfy that and have the biggest gains are the ones I try to fund on more money in and everyone else typically, even if it's like a half decent trade, it'll be a eight, 12, 15 gain. And you take some of those. It offsets the chop. The ones that are three, four, five percent losers several times. And then at the end, you should have like a good core position that will represent like sizeable profit cushions and some of the better names. And the the job is over the bull market to be able to kind of build into that a little bit more. Yeah. Now for those positions you had mentioned like a like a couple week look period, but when you're when you're looking at your winners and losers, I imagine very different average holding durations. What would those look like? Yeah. So that's why it's interesting. People always ask, like, came out, what's your holding period? And it's like it's like",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 60,
      "start_timestamp": "00:21:23",
      "start_timestamp_seconds": 1283.1000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=1283"
    }
  },
  {
    "text": "like a couple week look period, but when you're when you're looking at your winners and losers, I imagine very different average holding durations. What would those look like? Yeah. So that's why it's interesting. People always ask, like, came out, what's your holding period? And it's like it's like any staffed, you know, could lie if you want. But really, there's like two, like a bi-modal like this. There's like most stocks are probably two weeks, you know? And then after there's a smaller cohort, which actually is there is, which actually has most of your profit at the end of the year, like the net profit, that's probably three, four months. Like so it's kind of those are the two, the two ranges. It falls one and one of those. Which makes entire sense, right? Like if you think about the market effect in the profit mechanism, you're you're looking to capture, right? It moves, it's wrong removes over those kinds of durations. So I think that aligns exactly with what I would expect. When you're first building out your portfolio, what's the layering approach as you're both scaling into a position that you like and adding new ones? Like how do you decide between that? So it's like I run a couple of like there's two, there's two methods to my madness. Let's say, you know, so one is the relative strength. But you want to be in the best stocks. But then after there's like the",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 60,
      "start_timestamp": "00:23:01",
      "start_timestamp_seconds": 1381.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=1381"
    }
  },
  {
    "text": "ones? Like how do you decide between that? So it's like I run a couple of like there's two, there's two methods to my madness. Let's say, you know, so one is the relative strength. But you want to be in the best stocks. But then after there's like the core principle, like I always take a trade off of is like the risk of reward set up. So sometimes as the stock extends itself, yeah, I can just kind of keep ripping higher and higher. But there's no good place to base your entry off of. So like every time I buy a stock, like my baseline is like, hey, Matt, can I make five dollars for every dollar of risk I'm taking on in this trade? So as a stock, it's extended. It's harder and harder to say yes to that. So it's trying to find the best stocks as a layer one. So like the ideal time to go hunting is in a correction when everyone's scared and everyone thinks the market's going forever down. That's when it's so it's most obvious to see the leadership is that the stock won't break when the market's breaking down. I mean, there's no stronger indication that investors really want that stock, you know, because everything is just so tied to the indexes. And so once that kind of starts to move, you try and position the best you can there. And then after it's, that's always a fight. Once",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 60,
      "start_timestamp": "00:24:40",
      "start_timestamp_seconds": 1480.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=1480"
    }
  },
  {
    "text": "I mean, there's no stronger indication that investors really want that stock, you know, because everything is just so tied to the indexes. And so once that kind of starts to move, you try and position the best you can there. And then after it's, that's always a fight. Once the best trades are gone, then it's all about trying to find lower risk entries because the situation is even if you identify the leaders, the volatility is so severe, like you can get easily over a couple of days, like 15 drops on these leading stocks. And so you take a few of those and even if you have a 50 gain or it doesn't matter anymore. So I always have to try and fight to find those lower risk entries. So it's a combination with factors. I see. So walk me through what February and March of this year looked like. Obviously, everybody thought that the sky is falling. It falls directly into I actually think it qualified as a bear market, but it definitely falls into your correction criteria. Well, what were your trading activities in that time frame looking like? Yeah. So it was it was tricky because we came in like doing really well. Like there was like the market was chopped to start the year, but like the outperformance and like I said, stocks like GE, Renova, I had Celestica, which is like another, you know, components for data. They were still rocking in",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 60,
      "start_timestamp": "00:26:19",
      "start_timestamp_seconds": 1579.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=1579"
    }
  },
  {
    "text": "tricky because we came in like doing really well. Like there was like the market was chopped to start the year, but like the outperformance and like I said, stocks like GE, Renova, I had Celestica, which is like another, you know, components for data. They were still rocking in that period of time. So it was like a good start to the year. And then, you know, like most things like when the market starts to turn, like the better names start to like break one at a time. So they kind of started the forces out, but still held held our own pretty well. Like still slightly positive, you know, the market was rolling. But then by the time we got into like late February and things picked up, like you're full cash. And then after by the time of liberation, they, you know, that whole tariff rollout happened full cash, which was great. And so that's the beauty. You know, if you're flexible with the market and you're not forcing it, for me, the aim, I have the two biggest aims I have is to not miss a big full market and not get caught in a big, big market. Everything else in the middle is noise. It doesn't matter. You'll sometimes you'll kill it some cycles. Sometimes you'll you'll lag a little bit. It's not a big deal. So for me, it was like mission accomplished came in. We were positioned well. The market frat a",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 60,
      "start_timestamp": "00:27:57",
      "start_timestamp_seconds": 1677.8999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=1677"
    }
  },
  {
    "text": "big, big market. Everything else in the middle is noise. It doesn't matter. You'll sometimes you'll kill it some cycles. Sometimes you'll you'll lag a little bit. It's not a big deal. So for me, it was like mission accomplished came in. We were positioned well. The market frat a gas, you know, as a trend follower, there's only so much you can do. And and then after repositioned late April start, they kind of build back into some of the key names. So it's honestly, we're not like I, it could have been a much better year if we've been more aggressive at the bottom. But again, the bottom is never clearly the bottom in real time. You know what I mean? So I deal with a lot of clients like you have to take into consideration. Like, you know, it's not as if you're a trader on a desk when like you're just pouncing all the end because this is your call and you want to run it. Like most people have very strong, you know, aversion to risk and all the rest. So trying to thread the needle between finding these great stocks, but not taking that massive risk. So but we were able to pivot nicely off the bottom. And so far, we have a good little stable of stocks that are performing really well here. What what do your holdings look like in terms of numbers right now? So right now we have the holdings",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 60,
      "start_timestamp": "00:29:36",
      "start_timestamp_seconds": 1776.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=1776"
    }
  },
  {
    "text": "massive risk. So but we were able to pivot nicely off the bottom. And so far, we have a good little stable of stocks that are performing really well here. What what do your holdings look like in terms of numbers right now? So right now we have the holdings we have our Palantir, Ibit, GEV, Hood, Meta, will NBIS and a little more Ibit. But like I said, most of these have really good cushions like Palantir. It's from like a 93 cost basis like GEV is from 375. I wish I had more of that one. Robin Hood's from 47. So like these are the ones that like the the positions that were I mean, there's others that have come and gone along the way. But again, kind of back to like our mode of operation. It's the aim is to kind of call out what's not working and keep the better names. And this is what's done. We had we had Tesla yesterday until yesterday, but that's that's not there anymore. Unfortunately, but in just imagine what that could all look like with some long options. The potential. We've only we combined both of our craziness together. We'd have some super craziness. Man, just think. Just think he creases the risk. You do have to pay for the ball. Who cares? I think though, you know, because coming off the bottom though, like the ball is so high that really makes it expensive. Like I mean, let's",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 60,
      "start_timestamp": "00:31:15",
      "start_timestamp_seconds": 1875.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=1875"
    }
  },
  {
    "text": "We'd have some super craziness. Man, just think. Just think he creases the risk. You do have to pay for the ball. Who cares? I think though, you know, because coming off the bottom though, like the ball is so high that really makes it expensive. Like I mean, let's say you were so I also have like all my buy-in. Most of these were put on beginning of me. Of course, obviously, you know, like let's say G.E.V. was me first, Robin Hood me seven. When Palantir was April 23rd. The ball was high back then. So I'm like at the same time, like that's that's the issue as well, right? Sort of, right. But you know also from your market making days, there's a bunch of ways that you can decrease the total impact of that ball. So it's funny because I have a long position and Palantir myself, but I'm using options that are out in 2027. So the vague component to those will be higher. But the overall changes involved that hit that under the curve is so low. This is so far out of time. So the total ball that I've experienced has been trivial and the cost itself is trivial, especially compared to like the leverage gained. I know that you have your approach. And obviously I was joke about trying to like slowly, subtextually. My hope is to slowly hypnotize you on one of these calls. All I'm going to do is put",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 60,
      "start_timestamp": "00:32:54",
      "start_timestamp_seconds": 1974.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=1974"
    }
  },
  {
    "text": "and the cost itself is trivial, especially compared to like the leverage gained. I know that you have your approach. And obviously I was joke about trying to like slowly, subtextually. My hope is to slowly hypnotize you on one of these calls. All I'm going to do is put up like one of them spinning wheels and then and then try to hypnotize you. So that's that's my long-term vision here is because what could be cool is maybe if you and I if we find a way that as you're putting on your equity position, I'll put on an options position and then we can just see how it goes. Sure. Sure. I think that could be super fun because one of the things that I actually think is really cool about using an options position, especially in some of these things, is you can decrease a lot of the chop of like in and out if you use the option itself to define more of the risk. So you buy the option at the component that it's 2 of the total portfolio risk whatever you want it to be and then you just let that thing go until like directionally you're completely disproven. Like the is some of that timing element I think, which is good because I can't time anything. So it's what I've learned no matter what I do, the market obviously will find a way to do the opposite. And my Tesla position is",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 60,
      "start_timestamp": "00:34:32",
      "start_timestamp_seconds": 2072.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=2072"
    }
  },
  {
    "text": "until like directionally you're completely disproven. Like the is some of that timing element I think, which is good because I can't time anything. So it's what I've learned no matter what I do, the market obviously will find a way to do the opposite. And my Tesla position is I mean I literally don't know if I could have timed it worse. I might have been able to kind of slightly but it was pretty damn bad. Did you buy that like a week and a half ago by Hens? Where did I get into? Where did I get into Tesla? So Tesla was on, ah good, love that 23 May. It's the old. At least before the last hurrah up the last bump up. The old 23 May. Yeah, yeah, definitely before the last hurrah bump up and right through the last hurrah bump down. But again, it's funny right because in Tesla the way that I set up that position is it's limit like the risk is defined by the position size. So that's also out in 2027. I couldn't care less what Tesla does in your term because I think Elon Musk is going to have a walking robot that can like bitch slap somebody pretty soon which is going to sell like hotcakes. That was the idea and the whole thing but yesterday it was quite the curveball I guess you can say. So it definitely will shake some hands out I think that that's",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 60,
      "start_timestamp": "00:36:11",
      "start_timestamp_seconds": 2171.3999999999996,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=2171"
    }
  },
  {
    "text": "a walking robot that can like bitch slap somebody pretty soon which is going to sell like hotcakes. That was the idea and the whole thing but yesterday it was quite the curveball I guess you can say. So it definitely will shake some hands out I think that that's the issue. The issue I have because again, I think the reason behind Tesla was one of my larger positions, the thinking is not only do you have to develop the AI, you also have to have the ability to physically create all of this stuff. And so Tesla's uniquely positioned that it also has all the manufacturing and all the rest. The only problem is when that kind of spat happened and it kind of soured me, you're also like I really didn't want to have to go over and stalk was that the current earnings per share for Tesla is two bucks. If you go to a 20 PE, you're a 40 stock. You know what I mean? So there's a real halo around Tesla of confidence which you have to kind of maintain or else the stock would be by any other normal metric like much much much lower. So it was just kind of going like head to head with the president of the United States when you'd probably need a lot of regulatory approvals coming in like the future if you want like autonomous cars and autonomous robots and all this kind of stuff. That",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 60,
      "start_timestamp": "00:37:50",
      "start_timestamp_seconds": 2270.1000000000004,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=2270"
    }
  },
  {
    "text": "much lower. So it was just kind of going like head to head with the president of the United States when you'd probably need a lot of regulatory approvals coming in like the future if you want like autonomous cars and autonomous robots and all this kind of stuff. That was it. I will see how it turns out. It's just you know at this point it's going to be one to watch. I still think Musk is going to deliver on all that but it's just the other risk that's there now. I don't know how sour or how bitter that relationship is because it went pretty nuclear on the the chats. Yeah which is it's super interesting because like if I were to think of another perspective on that I think regardless of where Trump and Musk land I think there's no world where the US wouldn't want to be one of the leaders of broader adoption of autonomous driving vehicles. That not only is just massive global positioning but to be able to integrate that kind of technology can have a lot of all the want impacts I think. So I always view these kinds of things it's Tesla. Like I know whenever you look at Tesla you are partially playing the news cycle. Like just what happens? What happens? Does Elon happen to puff a J on Joe Rogan? It pops up here. So it's like yeah I and that's exactly why that's a perfect example",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 60,
      "start_timestamp": "00:39:28",
      "start_timestamp_seconds": 2368.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=2368"
    }
  },
  {
    "text": "it's Tesla. Like I know whenever you look at Tesla you are partially playing the news cycle. Like just what happens? What happens? Does Elon happen to puff a J on Joe Rogan? It pops up here. So it's like yeah I and that's exactly why that's a perfect example of a position when I put on I literally define it as the size of the trade and then I just let it go because yeah yeah. I don't know your experience with trying to time it because you can make a lot of money in Tesla. I mean that that most recent run post earnings from what? Like 230? Little higher 230 to like 365? That's a decent move. But you have to be able to navigate it with with Elon just you know making silverware sculptures while he's sitting next to the president. You know there's a reason why there's not many people who have accomplished what he has. It's not it's not the the average guy who does the non average thing you know so I guess it goes to the territory you know. Now when you were seeing the the Trump tariffs rolling out were you starting to try to play another shorter term theme that you might have been seeing around that time frame or was it just purposefully as you said moving to cash and just fully waiting until you see the AI theme come back online. Yeah I was already in cash it",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 60,
      "start_timestamp": "00:41:07",
      "start_timestamp_seconds": 2467.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=2467"
    }
  },
  {
    "text": "starting to try to play another shorter term theme that you might have been seeing around that time frame or was it just purposefully as you said moving to cash and just fully waiting until you see the AI theme come back online. Yeah I was already in cash it was just matter of staying there and then it was really the hunt day by day because okay the tariffs there's you know there's many ways it could have seen a guy going worse but again you look at the personality Trump you wrote the art of the deal you know so he's a guy who likes to make deals like I mean I think most people it became very political for most people because some people either love or hate Trump and so it was you know it was just another reason to like you know dislike him if you didn't like him you know or whatever and so for me it was you know the baby was thrown out the bath water like like everything was sold in an AI company a tech company that's innovating what does that have to do with tariffs you know like it over the intermediate term like absolutely nothing you know so I figured things would be walked back this is a little more of a V recovery than I expected which is a good thing I'll take it when it comes you know it's it's always kind of hard to tell",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 60,
      "start_timestamp": "00:42:46",
      "start_timestamp_seconds": 2566.2000000000003,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=2566"
    }
  },
  {
    "text": "over the intermediate term like absolutely nothing you know so I figured things would be walked back this is a little more of a V recovery than I expected which is a good thing I'll take it when it comes you know it's it's always kind of hard to tell when something will be or not but for me it was really about sitting back like I said it's in those corrections if you're lucky enough to be in cash that's when you have like the biggest opportunity not just because you have cash to deploy but like your mind is that your eyes are not clouded by dealing with these losing positions like when you're dealing with the losing positions it's not only that you have less buying power is that your mind frame is about fixing the mistake you made so when you we're already in cash I mean that's why in 2020 as such a a banger year because like I was again cash going to that drop and then coming out it was all about okay losing a benefit from this is every crisis is going to have someone wins or at least or at least it's going to uncover who's winning because the stocks will fall and it was similar playbook you know like there's for me there's no better situation than when the market goes through I was 15 20 drops and I can size that multiple that's like that that's that's all because",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 60,
      "start_timestamp": "00:44:24",
      "start_timestamp_seconds": 2664.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=2664"
    }
  },
  {
    "text": "it's going to uncover who's winning because the stocks will fall and it was similar playbook you know like there's for me there's no better situation than when the market goes through I was 15 20 drops and I can size that multiple that's like that that's that's all because it really sets up your mind and your position for the next cycle let's talk about that a little more of your methodology of like timing your timing just portfolio exits before or you know during the early stages of these kinds of market corrections and deeper corrections into bear markets so I used to be more just trend oriented but that can be quite painful at the end of a trend because you know by the time you realize that trend is over there's a lot that can be given back so what I do is I when I see trend extensions so so the tough part is that trends won't always end the same way you can end with a bang where you get like a nice climax kind of run up and it's really obvious other times you kind of just slowly top and then roll over and then by the time like this is more of that one day like by the time you realize there was a problem like before was obvious like a lot of pain to be had you know so so I run basically there's another indicator I use like on the",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 60,
      "start_timestamp": "00:46:03",
      "start_timestamp_seconds": 2763.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=2763"
    }
  },
  {
    "text": "and then by the time like this is more of that one day like by the time you realize there was a problem like before was obvious like a lot of pain to be had you know so so I run basically there's another indicator I use like on the short term basis I call it by formal indicator it looks at the percentage of stocks on the NASDAQ above their respective five day average and so when things are running hot I try to actively force myself to trim into strength because if you're if you're trimming when things are coming down you're always playing catch up and it's like a bad place to be so kind of my process when you're at the end of these cycles and you're you want to prepare it's it's easy when it's a climax top because it's so obvious and even if you're bitter early eventually there's going to be the parties in the end but it's those those slow-growing top markets could be the really tricky ones and so that's just like the day by day you know really looking at how how are the components of the market doing like there's the index itself sometimes the index is super helpful once a climax top the index is helpful to study because you can see that climactic action when it's a slow grinding top it's the action beneath the surface and I think that those are the tops I get a",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 60,
      "start_timestamp": "00:47:42",
      "start_timestamp_seconds": 2862.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=2862"
    }
  },
  {
    "text": "there's the index itself sometimes the index is super helpful once a climax top the index is helpful to study because you can see that climactic action when it's a slow grinding top it's the action beneath the surface and I think that those are the tops I get a lot of retail people because they're looking at the attack it's just going sideways there's nothing wrong but internally you know people are going into Apple they're going into Microsoft and it could be on a relative basis you know so I mean people are buying Apple at this point for safety because it's like it's kind of like the big stall work you know so looking at those rotations then looking at your PL like you know marketing you hide today but I can't make any progress it's like one day one week two weeks and it all apples out performing or whoever's out performing and that's like a lot of the science starts scaling back and you know in the past I would fight them because you know like not all of the QQs to looks good and then but at the deterioration eventually unravels so there's like the two types of tops and that's the kind of like the playbook they use for them yeah so the recent top in SPX a little bit more of like that rolling top do you remember what some of like the first early warning signals that you saw that were",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 60,
      "start_timestamp": "00:49:21",
      "start_timestamp_seconds": 2961.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=2961"
    }
  },
  {
    "text": "the two types of tops and that's the kind of like the playbook they use for them yeah so the recent top in SPX a little bit more of like that rolling top do you remember what some of like the first early warning signals that you saw that were like this ain't it like what did the playbook look like for this move specifically so this was tricky because like I said you start to see some stuff beneath the surface but then after there was a subset of like AI stocks that were still really really powerful so it's like I was you know so it's like even if there are warning signs if you're like actually still pushing like you know a year-to-date highs you tend to start to kind of ignore that a little bit unfortunately because you figure okay I've got the right rocket ships if the market just improves a little bit we're gonna explode and then I forget exactly which point it was it was like really like April 20 sorry February 21st or so like when you had those big breaks we're starting to become like really obvious like especially actually on February 20th was like one day off of all-time highs we kind of like just like step into all-time highs on the on the SP on low volume really uninteresting in the next day one metric I watch very closely is the stocks making 52 week highs versus 52 week",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 60,
      "start_timestamp": "00:50:59",
      "start_timestamp_seconds": 3059.7000000000003,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=3059"
    }
  },
  {
    "text": "February 20th was like one day off of all-time highs we kind of like just like step into all-time highs on the on the SP on low volume really uninteresting in the next day one metric I watch very closely is the stocks making 52 week highs versus 52 week lows and the market should never be at new highs and there's more stocks breaking down than breaking up that's actually you know the exact same pattern we saw in 2021 when there's this like flight to safety these big names like it's like Apple they absorb so much capital like an iceberg you know they take up so much capital and you know the smart money rotates into those and they kind of distribute everything else slowly so it's rare but sometimes like that was a signal there that really got me to kind of get more aggressively sorry conservatively positioned because we were one day off of all-time highs and you have more stocks making 52 week lows that was a really really funky internal kind of change and then things really start to accelerate to the downside make sense it's funny because one of the indicators I think you and I both use is net highs lows and it's that's actually one of the thing I have in my notes on the the day following I I want a slightly different direction and I just started trimming a lot of the more momentum based stuff but you",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 60,
      "start_timestamp": "00:52:38",
      "start_timestamp_seconds": 3158.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=3158"
    }
  },
  {
    "text": "think you and I both use is net highs lows and it's that's actually one of the thing I have in my notes on the the day following I I want a slightly different direction and I just started trimming a lot of the more momentum based stuff but you boil run it to the downside which I didn't get in right then it was actually the day after where we had that significant breakdown that was just like yeah let's go yeah I am I am that D Gen retail trader that just paid through the nose for long puts disgusting don't even remember what the vol was couldn't possibly care less let's just let's just rock yep okay yeah it's worked out great which you can get a move to the downside there's no better like return it's instant it's fast and it's like a it's it's wild so yeah well and I was also thinking maybe I mean because when were you a market maker that was 2008 to 2012 13 yeah okay so I feel like you should at least send me like a a thank you card at some point because obviously with my trading antics I bought you something I don't know what it was you know best when you'd have like a nice red you're waiting there and I remember he's like sit there having a coffee with the guys and this was like before hft went wild you know so you have",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 60,
      "start_timestamp": "00:54:17",
      "start_timestamp_seconds": 3257.1000000000004,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=3257"
    }
  },
  {
    "text": "antics I bought you something I don't know what it was you know best when you'd have like a nice red you're waiting there and I remember he's like sit there having a coffee with the guys and this was like before hft went wild you know so you have like your resting orders on these stocks and like have a kind of like thing and like someone just crossed it like we get these alerts you know I'll be little things it's like someone crosses widespread like well thank you I'll take that thank you very much and so those are good days man that was a lot of fun that's me bumbling over all the trip wires just just kind of stumbling along it's good I think like the newer crowd who didn't trade back then they don't realize how lucky are how liquid stock like markets are everything is pretty spread or fight like back then like there was like wider spreads and it was because I mean because I remember like I never traded that way but you know eights and quarters and all that kind of stuff like the older school guys when I started like they were used to like these really widespread like I mean what I thought was wide at you know 10 cents 20 cents they're like well this is this is like a narrow market you know if they saw today's market their heads would like we're blow off you",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 60,
      "start_timestamp": "00:55:55",
      "start_timestamp_seconds": 3355.7999999999997,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=3355"
    }
  },
  {
    "text": "like they were used to like these really widespread like I mean what I thought was wide at you know 10 cents 20 cents they're like well this is this is like a narrow market you know if they saw today's market their heads would like we're blow off you know so yeah like right now it's like things have changed so much because of HFTs on the short term and it's great for Aussie for retail traders it's massively better it's completely in the favor of retail and so many well it it it absolutely forces the market makers to be more honest with what they're putting out there otherwise those start getting the market makers are gone HFT 8 everything you know they made they made up for smaller spreads with just massive scale so like now they're taking like a fraction of a penny but doing it like an endless number of times every day rather before it was like a wider spread so it went from you know a few a few thousand guys making really like an awesome living to four guys were billionaires and that's kind of like what happened that's good that that is the American way nice and capitalist just consume everything good that's it you had mentioned the V-shape recovery which I think is interesting because I I also I thought that the V-shape recovery from COVID was slightly interesting but I feel like you could explain it in a couple",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 60,
      "start_timestamp": "00:57:34",
      "start_timestamp_seconds": 3454.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=3454"
    }
  },
  {
    "text": "is the American way nice and capitalist just consume everything good that's it you had mentioned the V-shape recovery which I think is interesting because I I also I thought that the V-shape recovery from COVID was slightly interesting but I feel like you could explain it in a couple different ways right like on press attempted fed stimulus and blah blah blah blah blah blah there's this V-shape recovery what happened I think this is you know I know it's not the big political size but like you know they say like Trump's arrangements syndrome like that the the amount of like this rule hate for people who don't like Trump is so strong I think it caused like again like I I have a policy like when it comes to like trading I'm politically neutral even with clients I ever talk politics you know it's like we got to make money here the politics is for like the weekend but like I think I think people got so upset I think it caused even people who ran models or all you know even like you moving big you know blocks of stock I think they got political they got fear like I mean I like do this and he's gonna do I mean you just thought everywhere it's like you know like that people were just freaked out by like how like you know there's always like like you say every cycle the same to worry about but",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 60,
      "start_timestamp": "00:59:13",
      "start_timestamp_seconds": 3553.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=3553"
    }
  },
  {
    "text": "got fear like I mean I like do this and he's gonna do I mean you just thought everywhere it's like you know like that people were just freaked out by like how like you know there's always like like you say every cycle the same to worry about but when you already are a person who really dislikes and distrusts the person in charge and you feel like they're going off the rails that that's your perspective you feel like there's no coming back because your your your your eyes are kind of covered by by your your dislike and so I think so we got so offside that after when deal started to happen which in their mind couldn't happen I think this V shape it just that like people were just forced to buy back and relentlessly higher pace because they just got way too much to cash or to short bias or whatever so because it doesn't again I don't think it really makes sense to kind of get back to like such a V it seems a little bit extreme like it's not the way I would have thought of what it rolled out but I think it's because position just got so one sided then it just forced everyone to have to pay whatever do you think that there's a new general law I hate framing it this way because there's always this but like do you think that there is a change in",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 60,
      "start_timestamp": "01:00:51",
      "start_timestamp_seconds": 3651.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=3651"
    }
  },
  {
    "text": "I think it's because position just got so one sided then it just forced everyone to have to pay whatever do you think that there's a new general law I hate framing it this way because there's always this but like do you think that there is a change in market paradigm though where volatility just base volatility is changing not in terms of like VIX but in terms of just leverage position sizing frequency of trading is to your point the expansion of things like high frequency trading we would expect actually to control some of that but then the last couple big moves we saw were kind of like this that seemed to just just leave volatility or do you think it's more just a function of what the events were? It's hard the market's always changing like even the market itself like like you know we talk about going from like before to hft to now and that there's something like points in time like you know the advent of like the commission of free trading now retail traders so much bigger there was Wall Street, Fats era like so it's hard to say you know I feel like markets eventually always kind of get back to the same place and they adjust for all of these things I think the volatility this time was because it was a headline driven issue like you know if you look at oh wait which was you know bad it",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 60,
      "start_timestamp": "01:02:30",
      "start_timestamp_seconds": 3750.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=3750"
    }
  },
  {
    "text": "feel like markets eventually always kind of get back to the same place and they adjust for all of these things I think the volatility this time was because it was a headline driven issue like you know if you look at oh wait which was you know bad it was was even worse but it's like it was a deteriorating situation where people would wake up in the morning like oh there's no solutions at a problem okay sell here because it was literally like similar to like yesterday with all the musk like Trump tweets it's like tweets going off and like wow what happens like if you go back to actually early 2018 which is like that you know tariff war version one with China was equally really really jumpy and volatile and all the rest so I think it's just a function of like the way Trump does things and freaks out markets and markets have to respond because it's a real economic consequence if you put something in you can't just ignore it but I think it's I didn't think that why we go back to normal I mean even under Trump if you look at like the 2019 rally like after there was like the whole powel pivot when you know the fed kind of caused that bear market in late 2018 like when we came off of that Trump was still in power and that was like a very nice smooth steady uptrend",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 60,
      "start_timestamp": "01:04:09",
      "start_timestamp_seconds": 3849.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=3849"
    }
  },
  {
    "text": "at like the 2019 rally like after there was like the whole powel pivot when you know the fed kind of caused that bear market in late 2018 like when we came off of that Trump was still in power and that was like a very nice smooth steady uptrend and all the rest so whatever it's like tariffs that whenever Trump's like trying to deal making especially the way he does is deal making with like massive threat and walks it back it's that's like a worst case scenario for markets in terms of volatility also you know there's a lot of market out makers out there will probably love Trump for that but if you're a directional trader it makes a trick I like to sit here and visualize the prospects of like Trump sitting on the toilet or like just sitting on the back patio just completely serene typing out this tweet launching it and like in the back of his mind going that's going to fuck everybody up and then just like going about his day yeah you know it's a it's really uncharted territory I feel like it probably is something like that yeah yeah so buddy so with AI still developing your job and your approach is to find the next wave of AI leaders yeah which is hard because there's so much stuff that's fluff and not true or exaggerations or just straight up you know like made up and people pumping stock",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 60,
      "start_timestamp": "01:05:48",
      "start_timestamp_seconds": 3948.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=3948"
    }
  },
  {
    "text": "so buddy so with AI still developing your job and your approach is to find the next wave of AI leaders yeah which is hard because there's so much stuff that's fluff and not true or exaggerations or just straight up you know like made up and people pumping stock so you know like you have to you have to try as much as you can to kind of say you know figure out what's the real deal on what is and which is not always easy in real time and then charts help you to a certain extent but but to me that it's like we were talking about before I think this is the internet rollout even bigger because the internet made everything faster but in a lot of ways it did you know if we actually get robots and things you know things to think for us and to actually physically act for us it's a whole other step forward compared to what the internet was you know so this could be even bigger but we're if you compare it's in terms of timing like I was saying before we start like I think it's like a 1994 era because if you look at the internet similar kind of rollout it started off with infrastructure stuff like it wasn't it wasn't Yahoo and AOL or Charles Schwab that like started off that dot com like they were the peak that was the that was the output of",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 60,
      "start_timestamp": "01:07:26",
      "start_timestamp_seconds": 4046.7000000000003,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=4046"
    }
  },
  {
    "text": "1994 era because if you look at the internet similar kind of rollout it started off with infrastructure stuff like it wasn't it wasn't Yahoo and AOL or Charles Schwab that like started off that dot com like they were the peak that was the that was the output of all the infrastructure spending early on like the early leaders regards like Cisco I mean I was like router switches like yeah power is the internet but no one like goes onto their browser and is thinking of Cisco you know that was like so similar to today like Nvidia even though it was a semiconductor it's infrastructure like nobody uses Nvidia when they're writing their AI it's in the background powering everything so we're still at the point where we're talking about electricity generation like we need nuclear plants we need more power like this is this is still the phase of the massive investment of this new opportunity to lay the groundwork for the stuff to actually be created like I think the autonomous vehicles that'll be some of the first mass like AI products besides like the chatbots which are already out so I think it's going to be interesting to see like all all these different new mechanisms and products and services that actually go beyond like the chatbot box and really interact with us in real life I think that's going to be that's going to be when we start to you know progress from",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 60,
      "start_timestamp": "01:09:05",
      "start_timestamp_seconds": 4145.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=4145"
    }
  },
  {
    "text": "to be interesting to see like all all these different new mechanisms and products and services that actually go beyond like the chatbot box and really interact with us in real life I think that's going to be that's going to be when we start to you know progress from early 90s to the late 90s then to the to the eventual climax top that will get so as you see every company in their earnings release saying AI just so that they can get some tailwind how do you differentiate like the actual companies that matter you have to you have to really dive in like what percentage of their revenue is really AI driven you know so you know like for example like core we've had a big run because again like you you look at the this stuff and I'm not a tech guy so it's like no struggle sometimes thank you they have chat gbt to help me out or groc oh yeah like you know but like you know core we was like the neo cloud like what the heck is that like already like you know there's there's AWS and Microsoft this year and it's you know it's like the cloud infrastructure that's specifically tailored to people who want to run this AI type of infrastructure and so specific chips and it's quicker and faster to connect and they just took a big part of this new market and so it's like every time",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 60,
      "start_timestamp": "01:10:44",
      "start_timestamp_seconds": 4244.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=4244"
    }
  },
  {
    "text": "it's you know it's like the cloud infrastructure that's specifically tailored to people who want to run this AI type of infrastructure and so specific chips and it's quicker and faster to connect and they just took a big part of this new market and so it's like every time you look at someone like something like Celestica like they're a components business like they have a lot of traditional businesses and so if you look at their sales numbers they're like okay they're like mid 20s but if you dial into their their businesses there's like the legacy business and then those that are like AI data center related and like the data center related stuff like sales are climbing at 100 like year over year so trying to figure out like you know okay if this is your business fine and how's it directly benefit and how's it really going to the bottom line you know so I'm not someone who like stuff that's like pre revenue or anything like I want to actually something selling something it could be like earnings negative but there better be like some massive demand for your product and you want to see that come through in sales so for me that's like one of the first first steps I like to look for when trying to figure out if it's a company that's actually AI or just saying like oh we're going to do some AI that doesn't really mean much",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 60,
      "start_timestamp": "01:12:22",
      "start_timestamp_seconds": 4342.799999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=4342"
    }
  },
  {
    "text": "see that come through in sales so for me that's like one of the first first steps I like to look for when trying to figure out if it's a company that's actually AI or just saying like oh we're going to do some AI that doesn't really mean much so we get a list of companies that actually have AI is a pretty meaningful percentage of their sales and revenue what's the next filter so then once you get that I always want to see a certain amount of liquidity I don't like like the very small cap types of names like I try and get more concentrated size so I need a little more liquidity but then after truly about if that's the case we should see relative strength you should be doing better than the market doesn't mean going up more but if the market is weak you should be you know resisting that weakness and then be first the pop so it's you know if the whole thesis of AI is correct and I feel super confident about that but then picking the winners there should be like this insatiable demand by institutions during any kind of market weakness and it should show up right away with things kind of pop if it doesn't then you can believe all you want but if if they're not buying I mean they they they'll always know more than we do I mean their problem is size like if",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 60,
      "start_timestamp": "01:14:01",
      "start_timestamp_seconds": 4441.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=4441"
    }
  },
  {
    "text": "of market weakness and it should show up right away with things kind of pop if it doesn't then you can believe all you want but if if they're not buying I mean they they they'll always know more than we do I mean their problem is size like if you're managing 500 billion dollars like it's hard to get positioned in anything but their advantage is that they have better access to information that we you know stuff we could only dream of you know so they're their footsteps always comes through in the stock race and then let's say that you see institutional sponsorship kind of the standard canceling stuff yeah and let's say that you well you tell me if you look at X number of what's the number of stocks in the top filter that get to like the final selection criteria so I run like a list each week of always like these are all stocks that I'd be happy to buy and so like that that list is usually around 50 to 60 days that these are all during care they're not always in this case they're not maybe all AI there could be some like outliers that are are just like do still growing well and I'll watch but in my mind I'm trying to honestly just focus on AI type of stuff so it's that 50 60 and then the others variation sometimes they're they're strengthening but then they'll they'll flare out",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 60,
      "start_timestamp": "01:15:40",
      "start_timestamp_seconds": 4540.200000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=4540"
    }
  },
  {
    "text": "some like outliers that are are just like do still growing well and I'll watch but in my mind I'm trying to honestly just focus on AI type of stuff so it's that 50 60 and then the others variation sometimes they're they're strengthening but then they'll they'll flare out and they won't do so well and so they kind of you know you've ignored and again the leaders should always kind of be obvious they should always be popping up and it should always be hard to buy it's never easy to buy the best stock you're always kind of wishing you bought it and not a little too far baby pulls back and and so it's always a little bit tricky so you have to like kind of like fight your way in so that's kind of so you know you're starting off with thousands of stocks you bring it out to 50 60 and then it's a matter of this is my list our market conditions a accommodative yes okay then let's try and find good points where we can manage risk and establish positions for for uptrends and once you buy you know the strength confirm that you bought it a good time you know sometimes the market to roll over or you're strong about the stock and then that's your like your post trade confirmation from performance makes total sense and then when you're looking at that list do you find yourself in a scenario",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 60,
      "start_timestamp": "01:17:18",
      "start_timestamp_seconds": 4638.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=4638"
    }
  },
  {
    "text": "that you bought it a good time you know sometimes the market to roll over or you're strong about the stock and then that's your like your post trade confirmation from performance makes total sense and then when you're looking at that list do you find yourself in a scenario where you're like a coin flip I literally could buy either of these and they would both make me happy like do you find that it could happen sometimes like when there's really a lot of opportunity and so then after like I tend to if it's that situation I tend to lean to the higher beta stock that's just my personality you know like if let's say there's meta set up the stitches for example meta and palantir like my personality is algal for palantir or whatever whatever stock it is that moves a little more because I get bored with stocks if they move too slowly it's a like it's Spotify like I've been trying to I've been buying and trading Spotify since probably 200 and I made very little money because I get in it doesn't do a whole lot I get out and I'll pick off without me if after two or three weeks I don't get a lot of progress I end up moving it's it's one of my drawbacks I keep trying to work on but yeah so that's why I find when I when I can time it well and I can get",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 60,
      "start_timestamp": "01:18:57",
      "start_timestamp_seconds": 4737.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=4737"
    }
  },
  {
    "text": "without me if after two or three weeks I don't get a lot of progress I end up moving it's it's one of my drawbacks I keep trying to work on but yeah so that's why I find when I when I can time it well and I can get position stock that suits my personality that's that's my do-yes right yeah and I can totally see that now after this initial infrastructure wave goes through what general adoption theme around AI are you expecting to be focusing on after that it's going to be actual products of services like I so if you look at I mean it's a never ending cycle but if you look at the 90s it's infrastructure product services then you get another infrastructure wave where things have to be upgraded because the man gets so strong and all the rest and then there's another wave of new products of services you know like the I you think of the iPhone is basically as you know still related to the internet it's thanks to you know you know mobile internet and all the rest that we're able to have that on our phone so for so really really next it should be actual products and services and it can be tricky because a lot of these names like they have a lot of potential and so then after they trade a high valuations there tends to be a lot of like retail interests so they",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 60,
      "start_timestamp": "01:20:36",
      "start_timestamp_seconds": 4836.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=4836"
    }
  },
  {
    "text": "so really really next it should be actual products and services and it can be tricky because a lot of these names like they have a lot of potential and so then after they trade a high valuations there tends to be a lot of like retail interests so they could be very jumpy like a tempest AI for example TEM very difficult stock to try and trade very choppy very wild but I mean they're trying to apply AI to like medical diagnostics if they can pull it off tremendous opportunity right but you know sometimes the stocks are trading at such a premium or they're just they're so closely watched sometimes there's younger new names that give better opportunities like there's NBIS which we had a great trade this week that was our position in and I find it's probably not as closely watch as something like it's TEM so it tends to trade nicer when everyone watches something gets a little more difficult right looking out over the next handful of months there's still a lot of stuff that's kind of influx right we see just the employment situation changing slightly we you know slight uptick and jobless claims and it seems there's just a mix of stuff coming out how does that impact the way that you're approaching the market currently yeah I don't really put too much weight into that for me the only the only importance of jobs and all that is how it",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 60,
      "start_timestamp": "01:22:15",
      "start_timestamp_seconds": 4935.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=4935"
    }
  },
  {
    "text": "jobless claims and it seems there's just a mix of stuff coming out how does that impact the way that you're approaching the market currently yeah I don't really put too much weight into that for me the only the only importance of jobs and all that is how it impacts like what the Fed's gonna do and not that the Fed controls everything but the Fed is to me the driver of the markets is liquidity like globally the Fed's one of the big players the US governments another big player then after it's like you know the private sector of borrowing lending all that kind of stuff there's a three big pillars you know so that's the only timeout like I'm not like tracking like oh they beat by you know non-form payrolls by so much it's a buy for markets it's just trying to understand like most most prints don't really mean very much to me just a matter of like the day-to-day like management of risk so for me it's just really kind of trying to follow the different proxies I use for liquidity just to make sure they keep rising and as long as that happens like you want to be a did by basically every time there's like a pause if there's no impact to that and so you know the tariffs was you know the tariffs you would think would be kind of like a negative for liquidity in general probably will be",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 60,
      "start_timestamp": "01:23:53",
      "start_timestamp_seconds": 5033.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=5033"
    }
  },
  {
    "text": "happens like you want to be a did by basically every time there's like a pause if there's no impact to that and so you know the tariffs was you know the tariffs you would think would be kind of like a negative for liquidity in general probably will be if the Fed doesn't cut rates or whatnot so this was like the V-shape recovery it's gonna be interesting I really think it's likely to get a pause here in the markets because of that like I think now we've been overshot to the upside out of like forced buying I think the only the caveat like if we didn't have the AI potential behind this bull market which could really lift things tremendously I think this would be like a really negative setup for markets like retesting old highs you can go over again quite a bit but I think that people are just kind of really seeing the impact of what AI will be and that's gonna keep driving I think big tech and big tech has massive impact on indexes and people are gonna have that fear of missing out of like the technological boom so and and even for a while like there was all the talk when you know during the tariffs back that Europe's outperforming is US exceptionalism over and all that like so much of all of the innovations in the US you know what I mean so I think that was more",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 60,
      "start_timestamp": "01:25:32",
      "start_timestamp_seconds": 5132.400000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=5132"
    }
  },
  {
    "text": "and even for a while like there was all the talk when you know during the tariffs back that Europe's outperforming is US exceptionalism over and all that like so much of all of the innovations in the US you know what I mean so I think that was more just like some people who are frustrated again with the US and they want to kind of move their capital out but long term you know if there's someone that is inventing autonomous driving or whatever kind of robots or not that's musk whoever wins those things and even services that we never thought of probably gonna happen in the US in terms of the Western world maybe China has something I don't know but so that may provide like a bit under the market so if we pull back at this point I think it's gonna be a shower pullback but I think we do consolidate a bit and then we're gonna have to position from there so we're gonna have to see how how things roll out with with Trump and what headlines come out next week for me it's what comes out over the weekend because I had a time anytime I have a couple weekend vault trades that I put on that have just been an absolute crap shoot this year it's either been super lucrative or I'm just super wrong and it's like a coin flip it's actually super fun because you kind of like",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 60,
      "start_timestamp": "01:27:11",
      "start_timestamp_seconds": 5231.099999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=5231"
    }
  },
  {
    "text": "had a time anytime I have a couple weekend vault trades that I put on that have just been an absolute crap shoot this year it's either been super lucrative or I'm just super wrong and it's like a coin flip it's actually super fun because you kind of like just peruse through the news and you're like oh shit like nothing crazy happened today this is nuts um a couple other questions before you wrap up what are some of the the proxies that you like to use for liquidity and how so one as interesting is net highs net lows is one if you look at so there's one indicator I follow called NFCI so the national financial conditions index the Chicago Fed puts it out they look at like a hundred indicators in there if you if you kind of plot this NFCI with like net highs net lows would be amazed at how close the correlations really when liquidity is improving net highs come into the market so it's a really good like mechanism so it's what's something to kind of plot and you'll see what I mean uh another one I like to look at are high just a just a quick note on that like it's not super frequent that I come across stuff like that that I've never even thought to look at and that's one of them so I'm actually really excited to look at that thank you very much for mentioning",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 60,
      "start_timestamp": "01:28:49",
      "start_timestamp_seconds": 5329.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=5329"
    }
  },
  {
    "text": "are high just a just a quick note on that like it's not super frequent that I come across stuff like that that I've never even thought to look at and that's one of them so I'm actually really excited to look at that thank you very much for mentioning it like that's a cool one so NFCI they measure financial condition so when the indicator is rising financial conditions are getting tighter right basically if you plot them together you'll see whenever again the NFCI is declining you go from net lows to net highs whenever it starts to climb you go from net highs to net lows it's amazing how it's related so it's for me like when people ask well you know why would that work for me it's get and looks at the stocks but the stocks are the mechanism for liquidity and if you look at the extremes of highs and lows those are the best reflectors of liquidity as well so anyways cool thing to look at that's one and something else I look at very closely is high yield bonds so we look at so that that everyone looks at the Fed people look at the 10 year yield people look at the 30 year yield for me it's the yield on high yield bonds with counts because what's cool about them again they're a good they're a good proxy for liquidity and all the rest because it has the industry component it",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 60,
      "start_timestamp": "01:30:28",
      "start_timestamp_seconds": 5428.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=5428"
    }
  },
  {
    "text": "look at the 10 year yield people look at the 30 year yield for me it's the yield on high yield bonds with counts because what's cool about them again they're a good they're a good proxy for liquidity and all the rest because it has the industry component it is a bond but because it's like a high risk bond it has a risk component to it so if you look even let's say a 2008 or any other kind of the you know that 2020 anytime there's these severe moves if you're just looking at interest rates you say like the Fed's cutting race is zero or the 10 years falling this is you know this is going to support stocks but if you look at high yield bonds the interest rates they're skyrocketing because of the risk component so always keeping an eye on that to see how that's shifting and that you know usually any kind of market move that's significant should be confirmed by like those bonds you can look at the JNK ETF I was just going to ask if that's what you use yeah there's a there's a really good my favorite one is to index where is it to get the symbol up in trading view that I bring it up it's a bank of America here is the ice bank of America US high yield index effective yield and I give you the symbol when it's like a long symbol yeah",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 60,
      "start_timestamp": "01:32:07",
      "start_timestamp_seconds": 5527.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=5527"
    }
  },
  {
    "text": "is to index where is it to get the symbol up in trading view that I bring it up it's a bank of America here is the ice bank of America US high yield index effective yield and I give you the symbol when it's like a long symbol yeah I got it this cool yeah that's that's the one that I it doesn't always update real time but that's my favorite way because you know because the JNK has like dividend distribution issues and stuff that messes up the chart of it so here if you look at just the actual effective yield there's a great job of kind of showing that of humans in high yield bonds beautiful super informative as always you have a lot of stuff to share and definitely the the audience always appreciate it's I get pretty good feedback yeah the the biggest thing is my my audience is most interested in my my efforts to convert you deeper into the just the disgusting sloppy world of retail options trading which it's kind of like I mean America's good at that right like we can drag somebody into the mud so even though you're in Canada I think I might be able to to keep dragging you down slowly so that's my intention you know I was trading nonstop for so many year day trading for me it's like kind of being able to catch my breath I'll be able to go to the",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 60,
      "start_timestamp": "01:33:45",
      "start_timestamp_seconds": 5625.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=5625"
    }
  },
  {
    "text": "in Canada I think I might be able to to keep dragging you down slowly so that's my intention you know I was trading nonstop for so many year day trading for me it's like kind of being able to catch my breath I'll be able to go to the wash without worrying about 300 order to be filled so it's just kind of with pacing myself a little bit but at some point maybe I'll get back to when the kids get a little older maybe I'll get back to the hundreds of trades a day you got a show right you're gonna have to show them like yo dad used to get down and yeah she better believe it all right by the coming the Romans like it's like oh hey dad it's like it's all green it's a good day today or it's all red or these are doing bad these are good here I'm like yeah but that old these I don't have those unfortunately but it's good it's fun it's fun so yeah the kids have the right eye you just don't have the right execution maybe you just need to start them as an indicator I think that's what's next yeah yeah yeah definitely definitely beautiful man I'll throw a link to your website below for everybody that wants to go check you out but as always man thanks for hanging out and looking forward to catching up again soon anytime man thanks for",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 60,
      "start_timestamp": "01:35:24",
      "start_timestamp_seconds": 5724.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=5724"
    }
  },
  {
    "text": "indicator I think that's what's next yeah yeah yeah definitely definitely beautiful man I'll throw a link to your website below for everybody that wants to go check you out but as always man thanks for hanging out and looking forward to catching up again soon anytime man thanks for having me appreciate it yeah",
    "metadata": {
      "video_id": "GVoSqEj3k9I",
      "title": "Matt Caruso on Finding Huge AI Stocks | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=GVoSqEj3k9I",
      "upload_date": "",
      "duration": 3417.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 60,
      "start_timestamp": "01:37:03",
      "start_timestamp_seconds": 5823.299999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=GVoSqEj3k9I&t=5823"
    }
  }
]