[
  {
    "text": "Hey, everyone, Eric here. Welcome back to the outlier podcast. And I am here with a great referred friend. I'm sure we're going to have a great conversation, but Richard freezing and I actually learned about you via my good buddy Kyle from two bulls podcasts like I was telling you and he had nothing but great things to say about you. And that made me literally elated because I had a chance to look over some of your work, which will get into your background in just a second. And I literally loved it. Like I love what you're talking about. I love the angle that you bring to this. So first and foremost, welcome to the channel. Thank you for hanging out for a bit. Well, it's really great to be here and I certainly we certainly have mutual respect for Kyle. And I got a feeling we're going to have a creative conversation. So the question is, will an hour be enough? But let's go for it and see what we can do. Well, you know, just a minor correction about that respect towards Kyle. I don't know if you know this, but he's in the Navy. I'm in the Marine Corps. So it is in my DNA to make sure that I insult him in some sort of way. Okay. Yeah. So it's like it's kind of respect, but maybe not. But just just kidding. I love Kyle. So I had a chance to look over",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "I'm in the Marine Corps. So it is in my DNA to make sure that I insult him in some sort of way. Okay. Yeah. So it's like it's kind of respect, but maybe not. But just just kidding. I love Kyle. So I had a chance to look over some of your background and stuff, but I always like to kind of get it from the individual, right? Because nobody knows you better than you. And I saw that you spent time on the Pacific Stock Exchange. I saw that you kind of had time in the sea bot, CME, Merrill Lynch. You kind of you've done a lot of things. So I would love to just start with maybe like a high level overview of how you got started in the markets and just your career path overall. Because I think that that helps set a good foundation for people to understand your perspective. Well, let me be really brief. And I was going, I was a Wheaton College just Quester Chicago. It's a Christian evangelical school. And there I met Joe Richie, who founded Chicago Research and Trading. He was one of the foremost innovators in option theory and option valuation and trading and did very well with him. And when my wife got tired of living in Chicago, why? What's the problem? So we came back to California and I opened my own firm on the Pacific Exchange. But leading up to that was Merrill Lynch",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "theory and option valuation and trading and did very well with him. And when my wife got tired of living in Chicago, why? What's the problem? So we came back to California and I opened my own firm on the Pacific Exchange. But leading up to that was Merrill Lynch and working with retail customers. And then when I built my own firm, I was working with traders. I trained them according to a methodology of trading options, futures and stocks. And we were just we just hit singles and occasionally a double. Very careful. It was grinded out and we were doing very well. Except some traders, well, some traders would just take the method and just take off. And some traders would do okay, not great. But some traders just wouldn't make it. And that's where my interest was in what is the mindset that makes the difference. And I have told my story many times about my own mindset limitations. But once I was there and the nice thing about trading is that it gives you immediate feedback. Reality is hard and fast. Whereas if you, let's say, a career for an attorney or a doctor, there's a while there you get some feedback as to what you're doing. So using that hard and fast feedback, then I developed a therapeutic and coaching methodology to work with traders and entrepreneurs and business people who want to expand their opportunities and their growth and and invite them into",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "a while there you get some feedback as to what you're doing. So using that hard and fast feedback, then I developed a therapeutic and coaching methodology to work with traders and entrepreneurs and business people who want to expand their opportunities and their growth and and invite them into a mindset that makes that possible. I love that. And it's actually really cool with your options background because that's actually probably one of my primary trading vehicles. So I'm definitely looking forward to diving into that side of things just a little bit. But before that, one of my initial questions is to understand the jump from a very technical math based world of derivatives to something as nebulous as mindset. What precipitated that transition for you? Well, the transition was really from a therapist, which I was originally started family and individual therapy. And then Joe invited me, Joe Richie of CRT invited me to Chicago and I thought, oh, I don't know enough yet. So I joined Merrill Lynch first and then went there. So Rich, for reason, philosophy, major, master's green clinical psychology, a guy who has been identified with Don Quixote. And so I went to work for Joe and that was the real transition. In fact, my trainer in Chicago on the Chicago Mercantel Exchange told me that I was the worst trainee he had ever had. So that was the difficult transition to actually be able to focus. And eventually, when you create",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "to work for Joe and that was the real transition. In fact, my trainer in Chicago on the Chicago Mercantel Exchange told me that I was the worst trainee he had ever had. So that was the difficult transition to actually be able to focus. And eventually, when you create enough repeated behaviors, you know, you get into a rhythm. But also with my philosophy and psychology background, I was really looking, what are the underlying factors that can create trading behaviors that are successful? So for two, three years, on the trading floor, I have pictures of it. We have these trading cards. They're kind of heavy-duty cards. You can write on you, write your trades and you keep track of things. So I just kept a really small print. Everything I noticed, everything I felt, all my emotions, the emotions of other traders, the mistakes they make, the smart ones, what they did. And after a couple of years, I just stack almost a foot high, both sides, tiny print. And that turned out, oh, I have it there. But into a trading manual and a binder that I used to trade my traders. And again, the deciding factor was not intelligence. It was their mindset. And so now that I'm 70, oh my god, I'm 76 this year. Thank you. But at this age, what can I do? And that is share the mindset. And so I created a specific set of exercises and processes to take",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "factor was not intelligence. It was their mindset. And so now that I'm 70, oh my god, I'm 76 this year. Thank you. But at this age, what can I do? And that is share the mindset. And so I created a specific set of exercises and processes to take people from traders who think that they can just do it immediately, that they're smart enough engineers, sometimes doctors and lawyers who are able to shape the world because of their presence. Market doesn't give a shit. So those principles then have turned into a trading system and personal coaching that I use. And we've been very successful and have a lot of happy clients. That's awesome. So why the move from kind of family, psychology focused work to trading? Why not sports? Why not big business? Like why trading for you? Well, it was the total accident that my friend Joey built started a trading firm. I mean, if he had started something else or another friend had, I could have gone there. But when I was training as a therapist in this early 70s, everybody was being a therapist. So, and the methodologies that I saw when I was working with as I just dropped the word, an acolyte for some therapist, I looked and said what they're doing is, oh, they're creating, they are recreating the processes that the clients are struggling with and allowing them to live within this process without really looking at the drivers",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "was working with as I just dropped the word, an acolyte for some therapist, I looked and said what they're doing is, oh, they're creating, they are recreating the processes that the clients are struggling with and allowing them to live within this process without really looking at the drivers and where they're going. So one of the things that I work with with clients is I'm not afraid to go anywhere. We'll look at their behaviors, we'll look at their beliefs and we'll go down through their deepest identity to those things that they've quarantined that are still driving trading and other behaviors. Got it. That's literally fascinating process to go through. To start us off, have you spent, well, I guess I'll rephrase a question, what's the breakdown of your effort between like a retail trader and an institutional trader? Because I have to imagine that there's similarities and differences between the two. Yeah, what's interesting is that my professional trading clients hedge fund managers and my beginning naive traders, they're still the same human brain. Now, we're expressing our behaviors on a very different level between them, but I'll be damned if it isn't some of the same drivers that are driving both of them. Got it. That makes a lot of sense. So I want to touch on the institutional side first briefly and then kind of spend a little more of the time on the retail side because that's going to definitely apply to most",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "same drivers that are driving both of them. Got it. That makes a lot of sense. So I want to touch on the institutional side first briefly and then kind of spend a little more of the time on the retail side because that's going to definitely apply to most of the people listening to this, at least for my audience. But I always find the juxtaposition between institutions and retail fascinating from multiple levels. So at a high level overview from your depth of experience observing the two groups, what are some of the similarities high level similarities and differences between kind of the kind of services that you provide? Yeah, well, for the professional traders, what we do is we look at what is stopping them from expanding their success. Now, they're very motivated. The money is there. I mean, we can see every day the results of their behaviors. And so they're very interested. Now, they know the markets, they know their strategies. They're very sophisticated or they wouldn't be there. So now we get down to just that really tiny layer of those thin things that are stopping them. And that sometimes comes down to the deeper levels of beliefs and identity. The retail trader on the other hand, who'll be? I'm going to be a trader. I can learn stuff. I'm an engineer, I'm smart or whatever. And I have something called the confidence circle. And it starts with just with a naive confidence. Oh,",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "deeper levels of beliefs and identity. The retail trader on the other hand, who'll be? I'm going to be a trader. I can learn stuff. I'm an engineer, I'm smart or whatever. And I have something called the confidence circle. And it starts with just with a naive confidence. Oh, I can do this. You know, much like I can learn how to be an engineer, write software. And the assumption is that it's a thing out there to learn. But as you well know, and most people fence this, that trading touches our deepest part. And our brains are not set to manage it, because our brains developed on the savannahs of Africa. And with that primitive brain at the base of our neck, we hit just, Brigham takes over sometimes. So I don't know if you've ever experienced it where you wake up the next morning, you say, why did I do that? I know I shouldn't do that. What was that about? Well, in that context, sometimes that primitive brain, old patterns of behaviors and desires take over. So the naive person thinks it's out there. The sophisticated hedge fund managers knows it. There's something here. He's got all the external things managed. So the naive trader beginning trader starts with just a naive confidence. And then the next level of confidence is when I make a profitable trade. Whoopie, look at me. My dreams are going to come true. The mansion, the car, the trophy spouse.",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "got all the external things managed. So the naive trader beginning trader starts with just a naive confidence. And then the next level of confidence is when I make a profitable trade. Whoopie, look at me. My dreams are going to come true. The mansion, the car, the trophy spouse. I'm going to do it. But then we have three trade losing trades in a row. Oh my gosh, my dream is collapsing. So if they're persistent, then they move to, okay, just making a trade. I need to get a strategy and follow a strategy. So then they experiment back to us through all that creative strategy. And then the strategy starts to work. Yes, I'm now confident in my strategy. Yes, I've got it. But as I teach my clients, all strategies eventually fail. They have to. If strategies, soon everybody would figure out a winning strategy and we'd all be rich. Well, that doesn't happen. The market says, you have confidence in your strategy. Let me show you something. In fact, what I do is I have my clients map their strategy. Heaven. Strategy heaven is where this strategy just works. Create the volume, the movement, the direction, the volatility. Just define the market where it really works. And strategy hell is take the same strategy and define where it just gets the crap being out of it day after day. Well, once you do that, then you say, oh, I need to know what market mood",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "direction, the volatility. Just define the market where it really works. And strategy hell is take the same strategy and define where it just gets the crap being out of it day after day. Well, once you do that, then you say, oh, I need to know what market mood or what market type my strategy really works well in. So then they become an expert in looking at the market and saying, what strategy do I apply? And finally, there's this. It's almost like a sound barrier. That you go, and you get over it. And then you say, I don't need to know anything. I'm fully here with a market. And I will trade from a level of, it's not confidence because that can be run into overconfidence. It's like, I'm just, it's me in the market. And I don't need to know anything. I don't need to protect the market. I am just here with the market making trades. And that final level where you don't need to know you is no ego. There's no need for your PNL to prove anything. Who you are, your value. Excuse me. Then all of a sudden, you get over that hump. Now, that doesn't mean you're not going to have difficult times or losing, but excuse me, I'm going to mute. We're just taking a quick lot of. So then that's the the progress for even the from everywhere from the retail trader to the professional. I love that.",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "that hump. Now, that doesn't mean you're not going to have difficult times or losing, but excuse me, I'm going to mute. We're just taking a quick lot of. So then that's the the progress for even the from everywhere from the retail trader to the professional. I love that. And it's really interesting to hear kind of the the experience really I've gone through essentially that. So it's interesting to hear you talk about that that trajectory. One of the things that I'm always fascinated by and one of I guess I would consider like the biggest risks for new traders, especially on the retail side is the Dunning Kruger effect, which you're probably familiar with it. But for those that aren't, it's essentially when you know, we have a little bit of experience, a little bit of depth. We start to feel comfortable and confident. But we still there's still a lot that we don't know we don't know yet. That typically places us directly in front of the train moving fast that is risk. And a lot of times you get run over and I actually use myself as an example for that. The largest losing trade as a percentage of my account, the largest percent drawdown occurred. I was trading for five and a half years, six years at that point. And I was doing well, like relatively speaking, I started really young. I started trading when I was in high school, actually back in 2007.",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "as a percentage of my account, the largest percent drawdown occurred. I was trading for five and a half years, six years at that point. And I was doing well, like relatively speaking, I started really young. I started trading when I was in high school, actually back in 2007. And when I was in college, at that point, I already had a trading plan. I had my trading logs like I was getting very organized. That's kind of one of the ways I found success. Not because I'm smart. I'm actually probably about as average as every other human being out there. It's just that I add parameters and I track things that allows me to make changes that work. So I was kind of confidently deploying. And then all of a sudden, I get ran over. It's not even like an insane black swan event, just a larger move than I was expecting. And then boom, there's my largest account drawdown. I exited the trade flattened because that's what my risk parameter said to do. And as the market tends to do, it swiftly moved back directly in my profit zone. And I watched a trade, you know, that was going to be a full profit. And I mean, I never looked back at that saying, oh, I should have done this should have like, I don't think like that. It's all in the Marine Corps. We call it a round down range. Like the stuff I set",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "that was going to be a full profit. And I mean, I never looked back at that saying, oh, I should have done this should have like, I don't think like that. It's all in the Marine Corps. We call it a round down range. Like the stuff I set up was specifically and it served me well in general. It didn't work. This one case. That's okay. But I wanted to specifically ask you about the Dunning Kruger effect. And if you have an opinion on, you know, the impact on traders. And if so, what are some of the ways traders can kind of navigate around it? Because I regularly interact with traders, right? That's why I do this whole thing is to just try to share information very similar to you. And a lot of traders that are at that, you know, three to six year mark, they're starting to find success. They don't want to hear that they don't know what they don't know. Right? You can't tell them that because then defense comes on and then they shut down. But to me, those are some of the traders that are at the highest risk of kind of these account drawdowns. So what are your thoughts on navigating that as an individual, but then also as a community? Well, you really get down to asking the hard questions, Eric. Oh, not easy ones for rich. No. That's why you're here. You're the expert. So it's the",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "kind of these account drawdowns. So what are your thoughts on navigating that as an individual, but then also as a community? Well, you really get down to asking the hard questions, Eric. Oh, not easy ones for rich. No. That's why you're here. You're the expert. So it's the first thing that popped into my mind is new trader. This is true story. I just hired him. And it was one of those weeks, like four or five days in a row, where the retail with selling option premium or no, the retail was buying option premium. And the professionals were selling operation premium and in different strikes all over the floor. It was kind of a mass thing. Oh my God, you couldn't help but make money. I mean, buying 25 implied volatility selling 40 volatility. Okay, that works. So when the brand new traders have been working that way, came to me says, I'm up 10 grand for the day. I'm taking the rest of the day off. So I took all his money out of the account. I told him I did anyway. He says, you're starting over because those times are so rare that you just keep going forward. You don't stop. And conversely to that is when a trader makes money and it fills all their longing, the holes in their heart, their dreams are going to come true. Oh my gosh, this is it. I finally made it. When actuality trading, the one",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "just keep going forward. You don't stop. And conversely to that is when a trader makes money and it fills all their longing, the holes in their heart, their dreams are going to come true. Oh my gosh, this is it. I finally made it. When actuality trading, the one of the wonderful things about it is that it's a continual process. And it's a continually checking in with yourself. In fact, what we have is a process called our sets, sensations, emotions, thoughts. So before you start trading, you check in and sensations. We score these on a minus five to plus five. Physical sensations, if I was drunk out last night and I got a horrible hangover, I've got the flu and I burned the souls of my feet during fire walking. So physical sensations are a minus five. Plus five means it's like cocaine. I'm just, my body's just getting my shape, like shaking down. A zero. I'm fully present with you, Eric. My body's relaxed. Our emotions, S, S's for sensations, E is for emotions. And it's the same thing. Emotions are hyper or I'm fully depressed. I can't get out of bed. On our T is our thoughts. My thoughts are self-critical. My thoughts are neutral or my thoughts are euphoric. I finally got it made. So every trader then scores himself on these three items before he starts trading in order to center himself and to know whatever comes I'm here for it. Like",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "is our thoughts. My thoughts are self-critical. My thoughts are neutral or my thoughts are euphoric. I finally got it made. So every trader then scores himself on these three items before he starts trading in order to center himself and to know whatever comes I'm here for it. Like when I was on the floor every morning, I would get up and I would ask my traders, where's the bullet coming from today? And I imagine a fog bank and a bullet coming right for my forehead. And I would say where's it coming from? Could there be an interest rate change? You know, interest rates impact options, especially if you have a lot of, you know, we'd have thousands of conversions and reversals on a short stock that you couldn't borrow anymore. You know, what's going to happen if there was a huge move in the market? What would happen if the implied volatility dropped if the live volatility exploded? You know, what is going to put us out of business? And that's what we would ask every morning. There's no complacency. The assumption being that we were, you know, we're just a bump on the twig here. And we are extracting money very carefully with a process of looking at value differentials. And when you're in that position, well, on the floor of the exchange, I would say about 20 of the market makers went bust every year. You have a long streak, you're winning. Boy, am",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "And we are extracting money very carefully with a process of looking at value differentials. And when you're in that position, well, on the floor of the exchange, I would say about 20 of the market makers went bust every year. You have a long streak, you're winning. Boy, am I something? All my dreams are going through. And that's when we really get hurt. Got it. So for a retail trader who might not have that support structure around them, they might be the only person sitting behind the screen. And they might not want to look at their PNL because it's bad. And tomorrow's a new day and we'll figure it out. They're not at the point where they have like good external controls to help audit these conditions. And they're still at a point where they still feel confident. They still think they'll be able to figure it out. They'll figure it out tomorrow. Is there a kind of practice that you've found to be successful for those specific kind of conditions where it can help a trader maybe apply that set, that set score? Is that something that you think traders should just integrate early on? And then this way they don't come into this effect, the Dunning Groover effect, where, you know, they think that they know everything or they think that they have it all figured out and then they run into that risk. Oh, there's several layers here. And that awareness, if, you",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "And then this way they don't come into this effect, the Dunning Groover effect, where, you know, they think that they know everything or they think that they have it all figured out and then they run into that risk. Oh, there's several layers here. And that awareness, if, you know, every, like I'll have my new traders settle armed for every 10 minutes, every 10 minutes. What's my physiology? I lean forward. My jaw is tensed. In fact, the short story, I don't know, I'm missing, had a rarely have, I do have clients in the same area as I am. They're all over the world. But the one was in the San Francisco area. So he had a problem. So I went to see him. And he said, okay, let's, I'm going to do the demo account this morning. So he was looking at, he says, you notice this pattern here, that's not in my pattern. This is almost there except the volume in this. And I don't remember all the details, but he said, okay, now it's setting up. Not it didn't, okay, now it's setting up. And he made two or three trades, two of them were profitable in Sim. And one of them was a small loss. He says, well, you know, I can do this. So he said, okay, let's go live. Look what they're doing. They're going to take out, they're going to do this. They're going to run this market. It was",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "were profitable in Sim. And one of them was a small loss. He says, well, you know, I can do this. So he said, okay, let's go live. Look what they're doing. They're going to take out, they're going to do this. They're going to run this market. It was like night and day between Sim and actual trading. So when we're doing our set scores or sensations, emotions and thoughts, we immediately get an alarm. And so I had him at this point, you know, exaggerate the physiology of that, exaggerate the emotions. And it turned out his father was judging him in his mind when he was trading for real. So once we got that out, then we could have an imaginary conversation with a father and this old pattern of a critical father from when he was, you know, two and three years old, when he was live, that survival mechanism kicked in and the tension kicked in. So, you know, one level, it's awareness of our physiology or emotions and thoughts. Another thing that we do is we have our market metrics program where you you mark down all the trades, what strategy you were using, what was your set scores doing them? Was this what we call a lucrative or lousy trade? A lucrative trade is one where everything lines up, you're following your parameters, you exit, you enter, you exit, you can stop that, whatever. That is a lucrative trade. Not whether it's profitable,",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "what was your set scores doing them? Was this what we call a lucrative or lousy trade? A lucrative trade is one where everything lines up, you're following your parameters, you exit, you enter, you exit, you can stop that, whatever. That is a lucrative trade. Not whether it's profitable, but it's lucrative. Do enough trades like that. And if you have edge, you're going to have money. So sometimes I'll have the client figure out how much money will you make with a lucrative trade on average? Oh, it's 750. Great. This one lost money. You made 750. And that's to avoid the pain of loss. We reframe that. The other thing we do to help break people out is private coaching, is I will break with them. They'll share their screen. I'll watch them. And it's amazing. They never screw up. Why? Because I keep them in their higher level context. I'm continually, if I see the milling forward and crunch, I'll go, okay, notice your position, notice your physiology, notice your breathing. Oh, notice your lips. What are your lips doing? Oh, come back to a context of their highest level self. And we also do group work sometimes. And whereby everyone brings their market metrics sheets and their colored and coded. So you can see in two seconds exactly where the problems like. And knowing that you're going to come to the meeting keeps you from dropping down into that primitive reactive state. I love that.",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "work sometimes. And whereby everyone brings their market metrics sheets and their colored and coded. So you can see in two seconds exactly where the problems like. And knowing that you're going to come to the meeting keeps you from dropping down into that primitive reactive state. I love that. And there's two different follow-ups I have for you. But I wanted to touch on kind of what I would consider to be the simpler one first. One of the main pivot points in my trading is when I created, I like to call it a healthy separation or disassociation with the trading capital that I had. And for quick context, I started trading in high school because I had a single mom. She struggled with debt. And I knew I needed to do something. Otherwise, there's just a good chance she's going to have to go bankrupt or whatever the case is. I was young at the time, but I just saw a lot of risk. Like if the car broke, we couldn't fix it. I actually learned auto mechanics for those exact circumstances because she drove to work. And that's all she had. So long story short, when I first started trading, there was this overwhelming sensation of, this is all my savings. This is everything that I put together. I can't lose it. And then all of a sudden looking back 16 years, I'm realizing the harder you squeeze on that money, the harder it is to",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "I first started trading, there was this overwhelming sensation of, this is all my savings. This is everything that I put together. I can't lose it. And then all of a sudden looking back 16 years, I'm realizing the harder you squeeze on that money, the harder it is to get it to grow. I'm wondering if you have an opinion on traders creating kind of a healthy disassociation with their trading capital. And if so, what does that look like? Oh, you couldn't have asked a better question. Behind me is the book, a private conversation with money. And when no trader ever has ever, not one, that hundreds has ever come to me and said, Rich, I'm really concerned about managing success and being successful. Oh, no, that'll be great. That'll be easy. But we all have our limits. We have our relationship with money. And what I noticed about 60, 70 of my clients, they don't appreciate that they have belief systems relationship with money issues, wealth and meaning, like just this morning, a client was trying to tell me that when he makes it, when he gets wealthy, then he's going to be able to be a philanthropist because trading is really kind of icky, evil, you're taking money and you're not really, his parents, immigrants worked, rejobs in order to put them through school to give them a better life. And somehow trading easily and just making money, that's, you know, it almost like it",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "a philanthropist because trading is really kind of icky, evil, you're taking money and you're not really, his parents, immigrants worked, rejobs in order to put them through school to give them a better life. And somehow trading easily and just making money, that's, you know, it almost like it was a rebuke to the all the hard work his parents did. You may have, you know, given that story, you may have a taste of that. Can you really make money easily? So what we do is we have them step into that wealth. And then we have a number of exercises. One of them is we look back as wealth and we look at all the people in our family and our community. And I ask them, okay, who's all there? And they'll list the names, I'll say, who objects to where you are now? And sometimes it'll be, what? They're all happy, they're cheering. They're like at a football game standing up and down and cheering. Well then what is your resistance? Oh my gosh, I had made up that somehow or the other thing is, oh, my dad, he says the wealthy people are assholes. He says that, you know, once you become wealthy, it changes you and you're not a good person. So then we have the conversation with the parents. And we look for all those sticky points because until we can visualize being wealthy, successful trader, until we can accept it, our survival",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "says that, you know, once you become wealthy, it changes you and you're not a good person. So then we have the conversation with the parents. And we look for all those sticky points because until we can visualize being wealthy, successful trader, until we can accept it, our survival mechanisms will keep us from going there. So what are some of the methods people can apply to create that healthy separation with their trading capital? For me, it was once I had enough money saved up that I knew I could take care of my mom, that I knew that even if I passively invested in index ETFs, made that average 8 to 12 percent per year, that I was on a good runway. And once I had kind of, I guess what I would call like my immediate concerns satiated, I was then able to start disassociating with it and saying, if I lose this, it's okay. I can make more. I have plenty of time and all my immediate needs are met. And I even went to the degree of like starting to find a balance because you don't want to throw away money definitely, but I would even include it in my language so that I would help me believe it, right? By saying it, be like, oh, this is just trading capital. It's no big deal. Oh, I lost 5, whatever it is, no big deal. Put on another trade. Like I was being very",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "would even include it in my language so that I would help me believe it, right? By saying it, be like, oh, this is just trading capital. It's no big deal. Oh, I lost 5, whatever it is, no big deal. Put on another trade. Like I was being very cautious about how I opened that door for myself and it it worked really well. But I'm sure you have even better techniques for people to kind of create that disassociation. So I'd love to hear your thoughts. Yeah, well, I have an exercise called the three-tier exercise where we actually have a conversation with money. And we look at our relationship to money. And the what's interesting is we have them become money and talk back to themselves. And that is fascinating sometimes. And there's a third part where you have a wise person. But what you said is about language. Oh my gosh, that is so important. Our language, repeated language, creates, reveals the way we're thinking and repeated language creates repeated thoughts, which then, for example, if a client says, well, I'm going to try to do that. Oh, time out. Trying means we're setting up an internal struggle. So rather than that, try try this. Oh, that's funny. Rather than that, invite yourself to step into your new state of mind and see how that feels. Oh, that feels better. Okay. So we don't have to try. We're just stepping into something that's better. Is that",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "internal struggle. So rather than that, try try this. Oh, that's funny. Rather than that, invite yourself to step into your new state of mind and see how that feels. Oh, that feels better. Okay. So we don't have to try. We're just stepping into something that's better. Is that right? Yes. So the language about money is how your relationship to it. So if it's like a money for a trader is just like a machine. It's like a tool. It's something that we use. As long as we associate it, and I think this is what you're pointing out that's so important with something that we can't lose. It's really valuable. It's going to pay the rent and all that stuff. Then the pressure on that trade to do it right puts us back down into our survival mechanism. Yeah. I think that that's really useful to kind of hear. And it's something that I think all traders really need to consider. And it's one of the things I think I learned a lot of that stuff from my time in the Marine Corps because you a lot of times are under like really tense situations. And if you sit there and you think about all of the awful things that could happen, you become paralyzed. You can't, you know, if you drive your truck, there's a chance you could be involved in an IED or a complex ambush or all these awful scenarios. And if you sit",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "you sit there and you think about all of the awful things that could happen, you become paralyzed. You can't, you know, if you drive your truck, there's a chance you could be involved in an IED or a complex ambush or all these awful scenarios. And if you sit there and cycle on those, then you don't want to do anything. You're completely stuck and there's nothing you could do. So what a lot of us do is we just say, yeah, man, that could happen, but I can't control that. So let me focus on the stuff I can control. And I think, you know, that's one of the big things I notice at least from my limited experience with new traders having issues. So that leads me to my next question, which is when you look at specifically retail traders, what are some of the common psychological traits that tend to lead to success and then also failure? Yeah. Let me first comment on your on your combat experience that I've often said, trading is one of the most challenging things you can do except for combat. And there's just a lot of similarities. In fact, I went and took some combat training myself using pistols rifles and clearing houses and stuff like that because the similarities are there. And I felt that creating, well, you know what muscle memory is having worked with weapons for creating that muscle memory so that those responses become automated. And",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "went and took some combat training myself using pistols rifles and clearing houses and stuff like that because the similarities are there. And I felt that creating, well, you know what muscle memory is having worked with weapons for creating that muscle memory so that those responses become automated. And in trading, we can do the same thing. We can create that muscle memory. And I forgot your question. Not that I subtracted. No, it's okay. I can reass the other one, but there's actually a great follow on there because I think one of the other things that I really consider especially in those scenarios. And I think it's really cool that you took that kind of training is, you know, the worst, what I started saying to myself is the worst thing that happens in this is I lose money. I'm not going to lose a leg. One of my friends didn't get shot. Like none of this is a big deal. Like scenario is I lose money. But I feel like for kind of civilians that don't have that that other, you know, benchmark essentially to assess things against, you know, I feel like it might be difficult for them to losing money to them literally might feel akin to losing their life or a limb. You know, I think it's absurd, but I could see it happening. Oh, absolutely. Imagine you have a hole in your heart and you don't feel worthwhile, worthy of the human",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "difficult for them to losing money to them literally might feel akin to losing their life or a limb. You know, I think it's absurd, but I could see it happening. Oh, absolutely. Imagine you have a hole in your heart and you don't feel worthwhile, worthy of the human being. You, your beliefs about everyone's out to get you. You want recognition. And when you have a losing trade, it feels like your life is evaporating before your eyes. So you're absolutely right in the senses. You're going to survive. You're not going to get a leg blown off. But the emotional feeling going down to that darkest place can be really, really intense. It's interesting. So to to go back to the other question I had for you, which was what are some of the common traits that you see specifically towards retail traders. But what are some of the common traits you see for both psychologically successful traders and things that tend to lead to failure? I'm going to step into my master traders mindset for a moment. Here we go. Here I am with you, Eric. Perfect. I am fully engaged able to be here. There is nothing that you could say or do. I don't have to worry about what words are going to come next. This is a one to one eyeball to eyeball relationship. I am fully here. So translating that to the market. I'm fully here with a market. I am learning.",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "is nothing that you could say or do. I don't have to worry about what words are going to come next. This is a one to one eyeball to eyeball relationship. I am fully here. So translating that to the market. I'm fully here with a market. I am learning. There is nothing that can hurt me. I have my systems. I don't need to know anything. I don't need to even to trust my strategy. If something goes wrong, I'll be wow. That's fascinating. I've never seen that before. So what it is is when I talked about the confidence circle is when you don't need, when you know that you just give up knowing. One of the most powerful books I've read is The Book of Not Knowing by Peter Ralston. It's a tough book because you have to really work through it and let go of a lot of the supports that you need. A lot of us have these knowledge supports or these things we believe to support us. Boom. What about all those supports? Are you still okay? Now if we can come to the market or come to combat or I can come with you right now and say, I'm fully here and I'm curious about what's going to happen. I don't know. I don't need to perform. We're just going to be here and see what evolves. I love that. Yeah, I love that. So one of the things that I think about",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "you right now and say, I'm fully here and I'm curious about what's going to happen. I don't know. I don't need to perform. We're just going to be here and see what evolves. I love that. Yeah, I love that. So one of the things that I think about and it's like you're kind of really highlighting it in a fascinating way is I have a saying that I'll use in the discord and stuff where I'll say like, do you want to be writer? Do you want to make money? And what I mean by that is I feel like traders go through a cycle where we need to be able, we think we need to be able to explain what's going on, the relationships between everything and the longer you are around the market, the more you start to realize how fruitless that is. Sure, you can have a hypothesis on how something works. No problem. You might just be curious. But being able to explain everything why everything works, I always found that it's more an ego-driven event as compared to is it something that I'm actually attempting to make money off of. I'd like to understand your thoughts on traders being able and it's a big question, but on traders being able to identify how big of a role ego plays in their trading and how they can kind of self-analyze their ego as a little bit so that they can understand the impact it",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "understand your thoughts on traders being able and it's a big question, but on traders being able to identify how big of a role ego plays in their trading and how they can kind of self-analyze their ego as a little bit so that they can understand the impact it has because I think one of the biggest mistakes I used to make was I would always say, oh, I just have to trade mechanically. I just have to not deploy any emotions, just stick to the plan. And you know, you kind of realize obviously you laugh at it and I laugh at it now too because I realize just how ignorant that is, right? The only way in my opinion to control emotional inputs is to acknowledge that they exist. So going back to one of the most, at least for me, and based on one of my favorite studies is the behavior of individual investors. I actually pulled it up. I don't know if you've read it by Barbara Lee and Odin or just Barbara and Odin, sorry, it's a fascinating trading study and it talks about things like the disposition effect, the naive reinforcement, things like that, all of this kind of bundles back into this concept of ego. So to summarize that really long sporadic question in a neat little thing with a bow tie, you share your thoughts on the impact of ego on trading and how can traders kind of self-analyze the impact",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "that, all of this kind of bundles back into this concept of ego. So to summarize that really long sporadic question in a neat little thing with a bow tie, you share your thoughts on the impact of ego on trading and how can traders kind of self-analyze the impact that their ego has on their trading. Oh my gosh, you've just opened another hour session. So condensed, tie a bow on it. You know, I mentioned the hole in the heart. One part, another is I need status or I need to prove I'm right what you said or I need something to show how smart I am or to get my parents approval or whatever it is. So then there's the ego part that says, I used to have beliefs that I thought were absolutely true and I won't go into them all. But they were here and then I grew up a little more than they were different, but they were absolutely true and they're here and they're absolutely true. And by attaching ourselves to something that's absolutely true, that is a prop for ourselves. But as mentioned, when we let go of that need for certainty, then all of a sudden we are curious and open to what is going on in the moment. I have an exercise called the cocky clanger. And the exercise is cocky clanger. I'll take them back to a trade where they just knew they had it, they had it made,",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "then all of a sudden we are curious and open to what is going on in the moment. I have an exercise called the cocky clanger. And the exercise is cocky clanger. I'll take them back to a trade where they just knew they had it, they had it made, they canceled their stops because it was going to turn around. Okay, how do you feel? And we'd go through the physiology, the thoughts in the head, the emotions. We get them into that point where where their ego was just driving everything. Then we start to write down what is aware of what you're breathing like, what's your heart rate like, what's going on your face? What's your jaws? Where are your muscles? What emotions are you having? What are the thoughts through your head? So we we define the cocky part of them. Then we create a mechanical alarm. I mean, well, it's an emotional alarm. And so we go through it and we have the alarm rings and we take them out of that state back to being an agent of their own lives, move back into the cockiness, the experience, the physiology, the emotions and everything, ring the bell and then go out. So when it's like Pavlov's dog, you know, when you when you show the food, they start to celebrate or when they ring the bell, they start to celebrate. So when they're in a spot, the mental bell rings and they say, oh,",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "ring the bell and then go out. So when it's like Pavlov's dog, you know, when you when you show the food, they start to celebrate or when they ring the bell, they start to celebrate. So when they're in a spot, the mental bell rings and they say, oh, I'm in a cocky ego driven place. Do I want to be here? Does it serve me well? Huh, not so. And by having them move into it intentionally and creating it and exaggerating it, then moving out of it intentionally, it gives them the methodology of moving back and forth. And that's the most important part of the exercise. That's awesome. So it kind of combines the, you know, the capacity to self identify, but then also to navigate it. That's actually a really, really interesting approach. We have about 15 minutes left and this is kind of my my favorite time because now I get to be selfish and ask questions that I'm just curious about. And one of the the questions that I have for you is I went through a fascinating, I don't know, it was like a ebb and flow in in terms of expectations. So for a lot of my life, like I said, I kind of shared some of the details on my upbringing and I grew up not in a great area. I like walk through metal detectors every day to go to junior high school on like that kind of stuff.",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "So for a lot of my life, like I said, I kind of shared some of the details on my upbringing and I grew up not in a great area. I like walk through metal detectors every day to go to junior high school on like that kind of stuff. And I've always been good at managing my expectations. I always thought that it was important. It's something that I've learned from the Stoics. And I think maintaining a healthy maintenance over our expectations helps increase overall happiness. What I found is I've started to find success that exceeded those managed expectations. And part of it was by accident because I wasn't necessarily attempting to. And it's because I had managed those expectations. I didn't think that this was going to happen. So I didn't really plan for it. And then when it started to happen, I didn't have much of a plan. So my question is how do you how do you think people, not just traders, but how do you think people should kind of dance this dance of having good managed expectations so that we can live happy fulfilled lives against having enough room so that we can grow and strive without having the self limiting thoughts because of managing those expectations. Eric, Eric, hard questions. But the right hard questions. So expectations, if you expect really good things to happen to you and they don't boom, always use all set expectations, boom, you don't get them.",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "can grow and strive without having the self limiting thoughts because of managing those expectations. Eric, Eric, hard questions. But the right hard questions. So expectations, if you expect really good things to happen to you and they don't boom, always use all set expectations, boom, you don't get them. And it really hurts and is discouraging. So what do we do? I kind of think of life as a wave and in trading, we pop our head up every now and say, Oh, what's our PNL? Or we put our head into our future self. What is that like when I'm you know, 10 years from now, 20 years from now? And then we go back to process. We do the processes, we improve the processes, we stick our head up, look around and say, Oh, how's this process working? And then back down. And we can still have in the mind, step into this future vision of ourselves. And unless we have a vision of ourselves, and again, I talked about stepping into the traders, master, mindset and saying who objects. We, by creating this vision of ourselves, then we can allow ourselves to get there. Our survival mechanism will not let us go to a place that we haven't conceived of and feels safe. So one, we can have that vision. And then where we get our thrills is in creating the process. Stick our head up, look around how we're doing. Okay. Back to process. So",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "mechanism will not let us go to a place that we haven't conceived of and feels safe. So one, we can have that vision. And then where we get our thrills is in creating the process. Stick our head up, look around how we're doing. Okay. Back to process. So I don't know if that's a complete answer or if it, if it help, if that model helps at all, but it certainly helps me, you know, process outcome vision. Well, I think the thing that I like about that as I kind of consider it is it kind of creates an opportunity to rebase line based on where you're currently at. And I think that's really actually important because when, when I was in high school, I was just sitting there thinking, I want to have a bunch of money. It's not because I wanted to buy a bunch of things necessarily, but it's because I wanted the security that money, you know, provided. I look right now I'm getting the entire side of my house resurfaced because of all the rain that we've had. And it's a minor inconvenience. I don't want to do it because the noise, but financially, I genuinely don't care. And that's what I really strive to for a long time is to be kind of in a place where I was comfortable. But I never knew exactly how to forecast out far enough because I think without strong enough and high enough aspirations,",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "but financially, I genuinely don't care. And that's what I really strive to for a long time is to be kind of in a place where I was comfortable. But I never knew exactly how to forecast out far enough because I think without strong enough and high enough aspirations, we kind of put a glass ceiling on things. So what I really like about that process that you mentioned is, you know, that kind of poking your head above the wave, observing things, but then coming back down to process, it gives an opportunity to rebase line on the success that we've had. And then when you look back up to think, okay, well, this is still managed expectations, but this now raises the bar a little further. And it kind of enables that growth. I actually really like that. I haven't thought of it that way before. Yeah. So if you stick your head up and you look back and you go, oh, my goodness, look what's happened. Oh, that's wonderful. So rather than saying, I said expectations here. I'm waiting. I'm waiting. Oh, nothing happened. Oh, no. What we're doing is I'm focused on process. And then I can enjoy the improvement we made because it isn't a goal out there in the sense that, well, you know, that if you set a goal to make yourself happy, you know, the mansion or the fancy car or the trophy spouse or whatever, when you get there, oh,",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "I can enjoy the improvement we made because it isn't a goal out there in the sense that, well, you know, that if you set a goal to make yourself happy, you know, the mansion or the fancy car or the trophy spouse or whatever, when you get there, oh, my gosh, I need something else. You know, if we're trying to fill that emptiness that hole in our heart, that meaning in life, and we're trying to do it with things, then we set those expectations out there. And even if we get them, sometimes they're not satisfying. So, you know, what you said about the wave process, poke our heads out, outcome, look back, appreciate our gains and our progress. Oh, my gosh. Does that feel so good? I love that. Yeah. I really, really love that. And in the last few minutes here, I want to ask a completely non-trading related question one that I've thought about a lot. And it's family-related. So I have an older brother, he's four years older than me, love him to death, but we are completely different human beings. We have things that are very similar about us, but everything from the way we think about time, we think about our environment, we're just so different. I'm really curious, I'm sure you have a depth of experience. I've done a lot of reading about this, the difference between like sibling trajectory and, you know, the circumstance with their brought up and",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "the way we think about time, we think about our environment, we're just so different. I'm really curious, I'm sure you have a depth of experience. I've done a lot of reading about this, the difference between like sibling trajectory and, you know, the circumstance with their brought up and all those kinds of things, but I'm just fascinated by it. So from a just general personal curiosity question, why are my brother and I so damn different? It doesn't matter. You know, the real question is if you love your brother and you say, our relationship is the most important thing. In fact, I'm working with a group that I started called Healing the Political Divide. And it is focusing on how do we manage our best relationships and relationships and business and elsewhere when somebody has a difference philosophic base that is opposing ours. How do we handle that relationship? And for me, it's, I use the phrase family first. That's it, family first. So my kids, there's certain things that they have gone off and believed and are very different than me. And my response is family first. I want the relationship and that the differences can we use them to create something better. You know, can that diversity actually improve? In fact, I find that some of the best conversations I had around difficult problems are the ones where we're very different. And sometimes out of this, oh, come something beautiful. Yeah, definitely. I guess from",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "we use them to create something better. You know, can that diversity actually improve? In fact, I find that some of the best conversations I had around difficult problems are the ones where we're very different. And sometimes out of this, oh, come something beautiful. Yeah, definitely. I guess from my perspective and to be clear, we actually have a great relationship. We have a lot of similarities. I guess I was, I'm more just genuinely curious, is it just a function of different human beings grow different ways? And even though he's my brother, we grew differently. But like, we don't have conflict. Like, we have a great relationship and stuff. I'm just so fascinated by the, like, he went to the same schools I did. You don't even mean like we had a very similar upbringing, but yeah, just very different. Oh, my gosh. You know, neonatal environment, just brains the way they operate. His, he may have started an earlier belief of X and you started an early beef of Y and Y kind of worked for you and you grew it. He had an early beef X. So he sees everything through X. And as a result, he's grown that direction. Who the heck knows? But if you love your brother and you have a great time, so what? Enjoy the relationship. Yeah. And that actually was really informative right there because that was my underlying assumption is that at some points, people kind of pick",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "result, he's grown that direction. Who the heck knows? But if you love your brother and you have a great time, so what? Enjoy the relationship. Yeah. And that actually was really informative right there because that was my underlying assumption is that at some points, people kind of pick up different, you know, paradigms that they do the world. And then that just kind of shapes the way that the rest of things go. Oh, my gosh. You know, how we filter? Oh, oh, it's, it's like once you start a certain filter, then that filter engages other people who have the same filter, who then expands that filter. And that's all you see. And as a result, I think that's part of the political divide issue is that our filters are self reinforcing the groups we belong to are self reinforcing. And all those things, once you start even a little bit in a certain direction, it can blossom. And you guys can be very different. Yeah. God, I love that. So the last thing I want to end us with here is if there was like one tool or technique that you think every single retail trader should deploy, what is it? That would be the golden keys. First is awareness. You know, doing your set scores, checking in, setting the alarm. And some engineering clients I have have no clue as to what's going on inside them. They're all in the heads. But so physical awareness",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "should deploy, what is it? That would be the golden keys. First is awareness. You know, doing your set scores, checking in, setting the alarm. And some engineering clients I have have no clue as to what's going on inside them. They're all in the heads. But so physical awareness or emotions and the quality of our thoughts are being critical or whatever our thoughts like. So the golden keys is awareness. And the second part is acceptance. If I say, damn it, I'm judging myself again. Stop it, Richard. Not very helpful. But if I say, oh, that's fascinating. I have judgmental thoughts. In fact, many, many years ago, I took out a jar and got 51 bills from the bank. And every time I had a judgmental thought, I put a dollar in the jar. The 50 did last today. So acceptance. Oh, that's interesting. I just had a judgmental thought. So it's awareness acceptance. And then it is agency. Now, what do I want to do? I'm aware of it. I accept my, one of the things you said earlier that was really important is not stifling the emotions, but being aware of them. And I'll expand on that, letting them come and letting them go. So awareness, acceptance, and then agency. Now, what do I want? And with awareness and acceptance, you can then start to build the awareness part can actually develop agency from your higher self and make decisions that serve you better. I",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "on that, letting them come and letting them go. So awareness, acceptance, and then agency. Now, what do I want? And with awareness and acceptance, you can then start to build the awareness part can actually develop agency from your higher self and make decisions that serve you better. I love that. That's awesome. And thank you for leaving us with that. So I know that you have your book, which I'll throw a link to that in the video description below for people. But how else can people find you? Where can people learn more about you? Yeah, conversations.money. And if you go to conversations.money slash Eric and that's E-R-I-K with a K, what I'm going to do is I'll give them a coupon for a free online course around money. And this is the stuff that I've learned from years of trading and training traders. So although it's not trader oriented, we go through all the processes about our relationship with money and how we screw it up. And for traders, this is so important because it's all about money. That's it. That's awesome. Well, Richard, honestly, thank you so much for hanging out with me, Sharon. Just a small snippet of your experience. Obviously, there's a lot of depth there. And I definitely look forward to chatting with you again in the future. I find this. Indeed. These conversations are always curious to me because I consider myself a just tremendously ignorant person. So getting an opportunity",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  },
  {
    "text": "a small snippet of your experience. Obviously, there's a lot of depth there. And I definitely look forward to chatting with you again in the future. I find this. Indeed. These conversations are always curious to me because I consider myself a just tremendously ignorant person. So getting an opportunity to like pick some of this stuff up is, I mean, it's just massive. It's super fun. Okay. I'm going to give you a chance to rephrase that. I am a continual learner that just loves meeting people and learning. That too, but I'm also an idiot. So. Well, I can see that you need a little private coaching and we're going to set it up. Thank you so much. I'm going to invite you into a much more positive space. Thank you. I appreciate your time. Take care. Take care. I think this was great.",
    "metadata": {
      "video_id": "h2D2trUqgDI",
      "title": "Change Your Trading Psychology with Richard Friesen - The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=h2D2trUqgDI",
      "upload_date": "",
      "duration": 3588.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h2D2trUqgDI&t=0"
    }
  }
]