[
  {
    "text": "What's up everyone? Looking out at the week ahead, providing a quick update on what's I expect this week from the markets and then also setting the table for what is an expiration cycle for GameStop. So I want to take a little bit of a look at the options there so that we can see what looks like might be happening. And then I've had a lot of people ask me to take a look at other tickers. So I have no problem looking at pretty much anything that you guys want me to send them in. But if the kind of ask is this looks weird, this looks weird, this looks weird. Like I need some sort of filtering mechanism, right? So all I'm saying is it, I'm not going to look at every single stock that people send in saying that they're looking weird. I don't want people to think that I'm ignoring you. I typically will try to at least respond, but not everything is weird. Is what it boils down to. So send them in whatever you want me to look at. And I'm happy to screen it. But it doesn't mean that I'm going to do like a dedicated video on it, but maybe on some of these more broad style videos, I can integrate looking at some other tickers as well. I'm happy to do that. So first thing I want to talk about though is this right here. And a lot of",
    "metadata": {
      "video_id": "H3xXeI3rJHk",
      "title": "July Options Expiration Week and GME Update",
      "url": "https://www.youtube.com/watch?v=H3xXeI3rJHk",
      "upload_date": "",
      "duration": 896.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=H3xXeI3rJHk&t=0"
    }
  },
  {
    "text": "to do like a dedicated video on it, but maybe on some of these more broad style videos, I can integrate looking at some other tickers as well. I'm happy to do that. So first thing I want to talk about though is this right here. And a lot of people were asking my opinion of this tweet, not so much his support of Trump or his support of anybody, but more so the impact that this could have on GameStop. And I actually think it's a really interesting lens to look at this through. That's one of my favorite things about finance is it tends to shed this just polarizing landscape that we're in where it's super far left, super far right. And like most of us are human beings. Most of us enjoy loving family and friends. We enjoy things that make us happy, but we somehow find a way to really villainize one another in this landscape, which is pretty intense. So the cool part about finances, we look at it as is the questions that I got related to this. How does this impact a stock, which is an interesting perspective? And the answer that I gave to that is pretty succinct. It's whether or not there's a knee jerk reaction to something like this. I do not expect that kind of post from him to do anything long term to the stock because the performance of the stock is going to be predicated on the",
    "metadata": {
      "video_id": "H3xXeI3rJHk",
      "title": "July Options Expiration Week and GME Update",
      "url": "https://www.youtube.com/watch?v=H3xXeI3rJHk",
      "upload_date": "",
      "duration": 896.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=H3xXeI3rJHk&t=0"
    }
  },
  {
    "text": "gave to that is pretty succinct. It's whether or not there's a knee jerk reaction to something like this. I do not expect that kind of post from him to do anything long term to the stock because the performance of the stock is going to be predicated on the performance of the company. That's pretty much it. So there might be some people who are like really, really upset about it or really, really stoked about it. It's less so about either of those things. The way I look at it as far as I know, a lot of the apes have been through hell over the past three years. So this is the thing that shakes them out after going through the rest of the price action for the last three years. I will be shocked. And the other thing it looks like in general, most people are being pretty respectful of one another. I noticed that in the comments here, right? Exactly ape, no fight, ape, ape. Together like I love that, right? We're focusing on the unification component. This is this dude's opinion. Everybody can have an opinion and that's okay. You don't have to like it or you can like it either or is okay in my worldview, at least. The important part here is deciphering the potential impact to the underlying itself. And in that case, like I said, could there be some sort of short term move? Could be. There's a lot of",
    "metadata": {
      "video_id": "H3xXeI3rJHk",
      "title": "July Options Expiration Week and GME Update",
      "url": "https://www.youtube.com/watch?v=H3xXeI3rJHk",
      "upload_date": "",
      "duration": 896.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=H3xXeI3rJHk&t=0"
    }
  },
  {
    "text": "it or you can like it either or is okay in my worldview, at least. The important part here is deciphering the potential impact to the underlying itself. And in that case, like I said, could there be some sort of short term move? Could be. There's a lot of things that watch the stock and there could be some sort of knee jerk reaction. But I don't think in any way that kind of statement or that kind of post would lead any sort of meaningful change in the perspective of the company, which is they're sitting on piles of cash. They are coming up on being profitable real, real soon. So yeah, you can make with it whatever you want. The main thing I would say is don't let stuff like this divide anybody, right? I think it's good to share ideas, share perspectives. That's okay. Being respectful is super important. It's healthy, dissent is normal. But this is I think just kind of nothing to be inflamed about either way. I would say, especially from the game stop perspective, focus on the performance of the company, which so far is moving leaps and bounds in the correct direction from a company that was essentially being seller boxed down into the dirt. This guy came in, started turning things around and through a series of pretty smart, I would say strategic moves, he's repositioning the company. So that to me is a much more telling story than people's",
    "metadata": {
      "video_id": "H3xXeI3rJHk",
      "title": "July Options Expiration Week and GME Update",
      "url": "https://www.youtube.com/watch?v=H3xXeI3rJHk",
      "upload_date": "",
      "duration": 896.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=H3xXeI3rJHk&t=0"
    }
  },
  {
    "text": "direction from a company that was essentially being seller boxed down into the dirt. This guy came in, started turning things around and through a series of pretty smart, I would say strategic moves, he's repositioning the company. So that to me is a much more telling story than people's perception of this tweet. Okay, moving over to broad market news. I want to show you guys what's coming up this week just so that you're aware of what's coming down the pike like I said, I think it's really good to look at game stop and I'm going to. But I also want you guys to see other things and to just understand a little bit of the broader perspective, even if you have no interest in it, that's completely okay. I think just being aware of it is useful. So we'll run through this really fast. This is a much more quiet week as compared to last week. Last week we had a lot of really big inflation indicators come out, CPI, PPI or PCE. We also had Powell speaking. Those kinds of things are generally big deal. Now this coming week, we do have some more economic data coming out. So Powell is speaking on the 15th tomorrow. We have retail sales on the 16th, which is kind of a big deal. There's a handful of other Fed speakers, you know, whatever they can talk to their hearts can send, but it's really Powell that we care",
    "metadata": {
      "video_id": "H3xXeI3rJHk",
      "title": "July Options Expiration Week and GME Update",
      "url": "https://www.youtube.com/watch?v=H3xXeI3rJHk",
      "upload_date": "",
      "duration": 896.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=H3xXeI3rJHk&t=0"
    }
  },
  {
    "text": "data coming out. So Powell is speaking on the 15th tomorrow. We have retail sales on the 16th, which is kind of a big deal. There's a handful of other Fed speakers, you know, whatever they can talk to their hearts can send, but it's really Powell that we care quite a lot about. The Philadelphia Fed manufacturing survey is coming out. This is just all of these are being interpreted in the perspective of how healthy is the economy, how is inflation impacting things? When does this potentially lead to a Fed pivot, which as of the latest data, it looks like the Fed pivot is early as September now, which was kicked out a long time ago. It used to be as early as March of this year. Then I got moved out towards the end of the year. Now it's sliding back in. So just something to be aware of because if we take a look at kind of the broader market here, you'll see the way that the market thinks about some of these different events. It's kind of not the market doesn't care that much. We don't see any sort of significant expansion involved. So do we see ever so slightly elevated? 11.5, 12 percent. And the next expiration is like 10 to 11. It's just not being ingested as any sort of high impact week. Okay, game stop. First things first, we already talked about this. That's a lot of charts. Let's go to",
    "metadata": {
      "video_id": "H3xXeI3rJHk",
      "title": "July Options Expiration Week and GME Update",
      "url": "https://www.youtube.com/watch?v=H3xXeI3rJHk",
      "upload_date": "",
      "duration": 896.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=H3xXeI3rJHk&t=0"
    }
  },
  {
    "text": "do we see ever so slightly elevated? 11.5, 12 percent. And the next expiration is like 10 to 11. It's just not being ingested as any sort of high impact week. Okay, game stop. First things first, we already talked about this. That's a lot of charts. Let's go to this one. And here, what I'm seeing is this floor continuing to kind of be baked in and it's slowly trending up. That's interesting to keep an eye on. And this also does correspond with some of the cycle thesis that I've seen thrown around. And I also think that this aligns fairly neatly with Newton's expectations coming into August. So there's some interesting activity there. When I look at the overall picture of volume, volume is contracted a lot. We saw a little bit of a spike here on the 10th came back down. And it's been very, very quiet. But notice the trend. It was trending down in terms of average volume then expanded. And then it's been slowly expanding out from the 11th. So that's also fairly interesting to see. Looking over at the options, change themselves. What do we notice? The first thing. The front expiration is a standard op-X, which is really important. This is going to be way more impactful and busy than the weeklies, typically speaking because you'll find liquidity in here. We notice that the vol is elevated 164 versus 136, 126, 118, 114. So there definitely is a little bit of",
    "metadata": {
      "video_id": "H3xXeI3rJHk",
      "title": "July Options Expiration Week and GME Update",
      "url": "https://www.youtube.com/watch?v=H3xXeI3rJHk",
      "upload_date": "",
      "duration": 896.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=H3xXeI3rJHk&t=0"
    }
  },
  {
    "text": "is a standard op-X, which is really important. This is going to be way more impactful and busy than the weeklies, typically speaking because you'll find liquidity in here. We notice that the vol is elevated 164 versus 136, 126, 118, 114. So there definitely is a little bit of an expectation of movement coming up. This has been slowly expanding, which we've been following for a little while now. And the important part here is if we take a look at where we have most of the OI as it sits now, you'll see there's 762,000 contracts against 456,000 puts when I said contracts before. Obviously, it was referring to calls. And if we look at the 19 July, 332,000, essentially 333, of that is in this upcoming expiration. 16og only has 142k calls. So most of the activity, again, continues to be in these very near-term explorations. This is really playing these front moves. So as I look at the 19 July expiration specifically, because this is the one that's coming up, this position is interesting to me. What we're seeing in the 30s. And it's because there's 60,000 OI, and there was 30,500 volume contracts traded. On Friday. You have to assume a good number of those are going to be net opening contracts. So there's a bit of a position being built there. And what I wanted to do is take a look at what kind of position building is going on in this upcoming expiration",
    "metadata": {
      "video_id": "H3xXeI3rJHk",
      "title": "July Options Expiration Week and GME Update",
      "url": "https://www.youtube.com/watch?v=H3xXeI3rJHk",
      "upload_date": "",
      "duration": 896.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=H3xXeI3rJHk&t=0"
    }
  },
  {
    "text": "Friday. You have to assume a good number of those are going to be net opening contracts. So there's a bit of a position being built there. And what I wanted to do is take a look at what kind of position building is going on in this upcoming expiration cycle. And the 30s, they got hit pretty hard with this almost looks like probably, let me see, I'm guessing about 5,000. Yeah, 4810 contracts. And my guess is probably 5,000. I don't, my guess is somebody didn't stop right at 4810 or 240k. My guess is there's probably even a couple more contracts that go into this. You could just see that these all rolled through essentially at the same time. So they're able to get a pretty big fill. But anyways, that's what I'm expecting. That's a quarter million dollar position that went on the ninth for the 30 calls expiring this coming Friday. That's an interesting trade to me. This is not anywhere near roaring kitty size. I want to be very, very clear. Everybody kind of starts jumping down that path. And I get why it's fun to speculate that. This doesn't look like his size. But this also is not a small trade. That is again, it's you can kind of get kind of numb in this space after you watch roaring kitty slinging hundreds of millions of dollars at stuff. But a quarter million dollar position in options that expire in 10 days from",
    "metadata": {
      "video_id": "H3xXeI3rJHk",
      "title": "July Options Expiration Week and GME Update",
      "url": "https://www.youtube.com/watch?v=H3xXeI3rJHk",
      "upload_date": "",
      "duration": 896.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=H3xXeI3rJHk&t=0"
    }
  },
  {
    "text": "But this also is not a small trade. That is again, it's you can kind of get kind of numb in this space after you watch roaring kitty slinging hundreds of millions of dollars at stuff. But a quarter million dollar position in options that expire in 10 days from when you place them is not insignificant. So one of the things I am watching like a hawk this upcoming week is the options activity. I want to know if this is just a tester position that's being built out and using the rest of this week to start scaling into it. That would be interesting. The other thing that I'm very interested in is based on Newton's kind of I guess timeline. I should say his timeline analysis of GameStop. He's very interested in August. So when I see somebody like roaring kitty's previous transactions, there were about a month out ish. And when he entered versus when there was a move. So if Newton is expecting a move in August, my guess is we would start to see if what roaring kitty is looking at is anything similar to what he and I have been discussing for a while now on the live streams, which there's another one coming up this coming Saturday at 5 pm Pacific time. We're going to kind of keep a cadence on these at least for the near term because we're both really enjoying looking at this. We spend over two hours on",
    "metadata": {
      "video_id": "H3xXeI3rJHk",
      "title": "July Options Expiration Week and GME Update",
      "url": "https://www.youtube.com/watch?v=H3xXeI3rJHk",
      "upload_date": "",
      "duration": 896.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=H3xXeI3rJHk&t=0"
    }
  },
  {
    "text": "while now on the live streams, which there's another one coming up this coming Saturday at 5 pm Pacific time. We're going to kind of keep a cadence on these at least for the near term because we're both really enjoying looking at this. We spend over two hours on this last Saturday on the live stream and then literally he and I hung out for another hour talking about this stuff because we're both so interested in it. Going back to this though, if there's a chance that RK is looking at some or even peripheral things tied to what we're looking at, we should start seeing some activity. So I'm looking for it and we will see if it comes out. There's also a chance that it's not at the same scale before. It's not like he has to put on a 68 million options position every time he touches options, right? So it's not being overly rigid in the analysis in that sense. This starts to look interesting. 234,000. But this seems a little short term. We will see. I am looking specifically for the building out of positions. Right now, it looks like there's a little bit of a start, but not fully rounded out. So we have to keep an eyeball on it. The last thing I want to highlight for you guys is down here at the bottom. And I want to show you the wall smile and how this looks kind of for",
    "metadata": {
      "video_id": "H3xXeI3rJHk",
      "title": "July Options Expiration Week and GME Update",
      "url": "https://www.youtube.com/watch?v=H3xXeI3rJHk",
      "upload_date": "",
      "duration": 896.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=H3xXeI3rJHk&t=0"
    }
  },
  {
    "text": "bit of a start, but not fully rounded out. So we have to keep an eyeball on it. The last thing I want to highlight for you guys is down here at the bottom. And I want to show you the wall smile and how this looks kind of for the near term. And here's what I am seeing. I want to use specifically kind of these near term operations. What I'm seeing is the standard standard behavior where in these op-x cycles, the 125 super far out of the money are creeping up in vol. The near term, I'm still seeing call vol lower than put vol, which when we were seeing that really aggressive upward price movement, it was inverted, which is very telling. Typically, you'll see it like this. If I look out here into the 16 aug, notice this. If I hover at the top of where this put vol is, if you go all the way to the right, just over my shoulder on this side, notice how that line is actually above my cursor. If I move this, you'll see it's just above my cursor. So right now, the call side out in 16 aug is slightly elevated compared to the out of the money puts. So again, from a vol trader's perspective, this has been habitual where these far out of the money puts have been gaining and vol pretty heavily. The tradable event. But in terms of a price projection standpoint, using",
    "metadata": {
      "video_id": "H3xXeI3rJHk",
      "title": "July Options Expiration Week and GME Update",
      "url": "https://www.youtube.com/watch?v=H3xXeI3rJHk",
      "upload_date": "",
      "duration": 896.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=H3xXeI3rJHk&t=0"
    }
  },
  {
    "text": "aug is slightly elevated compared to the out of the money puts. So again, from a vol trader's perspective, this has been habitual where these far out of the money puts have been gaining and vol pretty heavily. The tradable event. But in terms of a price projection standpoint, using options to have an assessment of where we think where we think things might be going based on how market is pricing stuff. Right now, it is still favoring the downside in terms of vol for this coming cycle. So we will also keep an eye on this. As always, any questions, anything you want me to take a look at or anything to add, please throw it out there. I'm learning as much as you guys are. And I love gaining more situational awareness about this whole thing. So have an awesome week, be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "H3xXeI3rJHk",
      "title": "July Options Expiration Week and GME Update",
      "url": "https://www.youtube.com/watch?v=H3xXeI3rJHk",
      "upload_date": "",
      "duration": 896.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=H3xXeI3rJHk&t=0"
    }
  }
]