[
  {
    "text": "Why am I so obsessed with the outlier concept and why you should be too? The goal of this video is to walk you through exactly that. I want to level set with some basics of the outlier concept, some statistics to help elucidate the point, and then at the end of the video I'm going to walk you through two things. Some of the exact steps I took to become one, and then literally, quite literally, a near bulletproof plan to become one if you're able to follow it, which spoiler alert, most people aren't, but that's the goal of this video, is to change the way you look at your financial well-being. What's up everybody? Eric here. Welcome back to all the outliers. Let's start with why I'm even talking about this. Well, for those that don't know, I grew up poor, had a single mom, she worked two jobs, I grew up in a shitty area, the same old story. That's not really important because that's just a starting point. However, by my late 20s, I was already a first generation self-made millionaire. Now, in my early 30s and 32 now, I'm a multi-millionaire. Not some big flex, it's to walk you through how changing your perspective can change your outcomes. So let's get into that. What's the probability of becoming a millionaire in the US? It's 8.8. You might look at that and say, wow, that's pretty low. Not high, so it's clearly not granted. However,",
    "metadata": {
      "video_id": "h6XH1IQRhC0",
      "title": "Your Path to Financial Freedom: How to Become a Full-Time Options Trader",
      "url": "https://www.youtube.com/watch?v=h6XH1IQRhC0",
      "upload_date": "",
      "duration": 574.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h6XH1IQRhC0&t=0"
    }
  },
  {
    "text": "flex, it's to walk you through how changing your perspective can change your outcomes. So let's get into that. What's the probability of becoming a millionaire in the US? It's 8.8. You might look at that and say, wow, that's pretty low. Not high, so it's clearly not granted. However, if you look at that compared to something like becoming an MBA player, 48 out of 155,955 high school players make it to the MBA. For those that are not math inclined, that is 0.03. That's your probability of becoming an MBA player. Not that great. So when we think about this, that's actually pretty achievable. And we're going to talk about exactly how to land there. So first, let's level set on what an outlier is. This is just a standard definition. It's a person or thing differing from all other members of a particular group or set. And in a graphical way, this is kind of how you can visualize it. We have the average data sample over here. And then we have a positive skew outlier all the way out here to the right. You can also have negative skew outliers all the way over here to the left. But guess what? None of our concern. We are focused on this benchmark. When I was going through school undergrad, grad, my time in the Marine Corps, I never cared at all about what the minimum was. That is not how my mind works. I wanted to know",
    "metadata": {
      "video_id": "h6XH1IQRhC0",
      "title": "Your Path to Financial Freedom: How to Become a Full-Time Options Trader",
      "url": "https://www.youtube.com/watch?v=h6XH1IQRhC0",
      "upload_date": "",
      "duration": 574.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:01:32",
      "start_timestamp_seconds": 92.3111111111111,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h6XH1IQRhC0&t=92"
    }
  },
  {
    "text": "the left. But guess what? None of our concern. We are focused on this benchmark. When I was going through school undergrad, grad, my time in the Marine Corps, I never cared at all about what the minimum was. That is not how my mind works. I wanted to know what the maximum was for everything. This one small change in the way that you view things can have a massive impact on how your life unfolds. If you chase the minimum or if you chase the average, you might get there. That's not the goal. So now let's talk about some other statistical phenomena. What do you think the probability is of you starting a successful business? You nailed it. 17. Now, obviously, this is a range. This is just a specific example from LinkedIn. But the point being it's not a slam dunk either. And fun fact, the probability of starting a successful business that then goes on to make you a millionaire is smaller than this. So how do we do this? Let's talk about it. The first thing is by understanding the landscape. So what's the median earnings by age? Well, for my reference period, 32 years old, it's 53,000 per year. Yeah, not much the right home about. What is the average in median household wealth by age? For those that don't know, they have to use median because the outliers skew the average so much. So you have to pick the midpoint. So in",
    "metadata": {
      "video_id": "h6XH1IQRhC0",
      "title": "Your Path to Financial Freedom: How to Become a Full-Time Options Trader",
      "url": "https://www.youtube.com/watch?v=h6XH1IQRhC0",
      "upload_date": "",
      "duration": 574.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:03:04",
      "start_timestamp_seconds": 184.6222222222222,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h6XH1IQRhC0&t=184"
    }
  },
  {
    "text": "years old, it's 53,000 per year. Yeah, not much the right home about. What is the average in median household wealth by age? For those that don't know, they have to use median because the outliers skew the average so much. So you have to pick the midpoint. So in this case, if you look at the average and median household wealth by age, I'm 32, the average is 95,000. The median is 29,000. This is the reality for most people. We can continue the example. The average retirement age is 64 years old. The average life expectancy is 77 years old. Looks like 13 years to me. Now, to be clear, the goal of retirement, in my opinion, is not to just stop working and become a succubus in the world around you. It's to be able to pivot your time and effort, your resources onto the things that you really are passionate about because for those that don't know, at least as far as we know, you get one shot at this thing called life. So doing things like this, sharing this kind of information with people gives me purpose. So my hope is that you'll follow along with me. So now I want to talk to you about this idea on how to become an outlier. The very first thing, as I already mentioned, is you have to completely change your standards. The way that you think about things matters tremendously so. So if you right now",
    "metadata": {
      "video_id": "h6XH1IQRhC0",
      "title": "Your Path to Financial Freedom: How to Become a Full-Time Options Trader",
      "url": "https://www.youtube.com/watch?v=h6XH1IQRhC0",
      "upload_date": "",
      "duration": 574.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:04:36",
      "start_timestamp_seconds": 276.9333333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h6XH1IQRhC0&t=276"
    }
  },
  {
    "text": "with me. So now I want to talk to you about this idea on how to become an outlier. The very first thing, as I already mentioned, is you have to completely change your standards. The way that you think about things matters tremendously so. So if you right now focus on things as what can I do to get by? What is the minimum I can do in order to get the best possible outcome? There's a little bit of optimization there and I don't hate that. However, if you do not have high standards, you're going to land where average people land. That's just how it works. So next, we need to think about our reference benchmarks. I don't know if I said that right. Reference benchmarks. And what I mean by this is this right here. Why do I use outliers part of my brand? Why do I call us the outlier community? It's for this. It's to start engraining these concepts with you immediately because we are a product of who we surround ourselves by. So if you're hanging out with people that are just balling out going to the club, spending all their money, that's probably what you're going to do too. So by getting around the right people is absolutely essential. Now, the kind of people you need to find yourself around and one of the key habits you must learn to embrace is delayed gratification. This is where you willingly forego near term",
    "metadata": {
      "video_id": "h6XH1IQRhC0",
      "title": "Your Path to Financial Freedom: How to Become a Full-Time Options Trader",
      "url": "https://www.youtube.com/watch?v=h6XH1IQRhC0",
      "upload_date": "",
      "duration": 574.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:06:09",
      "start_timestamp_seconds": 369.2444444444444,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h6XH1IQRhC0&t=369"
    }
  },
  {
    "text": "probably what you're going to do too. So by getting around the right people is absolutely essential. Now, the kind of people you need to find yourself around and one of the key habits you must learn to embrace is delayed gratification. This is where you willingly forego near term gratification, buying that thing you want and embracing delayed gratification instead saving that money for the future, investing that money because in a little bit, I'm going to show you how just this right here can make you a millionaire again, essentially without fail as long as you can adhere to the plan. So next up, we have favoring the process over the outcome. If you are overly outcome driven when that outcome doesn't happen quickly enough, we tend to get disenfranchised. So learning early on to favor the process is absolutely pivotal in our capacity to remain loyal to the process long term. We need to take a proactive approach to our life. If you do not accept ownership for everything around you as much as humanly possible, this won't work for you. If you are the kind of person that blames other things for things, this isn't for you. If you're late to work and your excuse is, oh, there was traffic, that is, I'm telling you, the wrong mindset. So the problem here is that a lot of people apply a reactive approach to life and you get a reactive outcome. Got two more for you here.",
    "metadata": {
      "video_id": "h6XH1IQRhC0",
      "title": "Your Path to Financial Freedom: How to Become a Full-Time Options Trader",
      "url": "https://www.youtube.com/watch?v=h6XH1IQRhC0",
      "upload_date": "",
      "duration": 574.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:07:41",
      "start_timestamp_seconds": 461.55555555555554,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h6XH1IQRhC0&t=461"
    }
  },
  {
    "text": "you. If you're late to work and your excuse is, oh, there was traffic, that is, I'm telling you, the wrong mindset. So the problem here is that a lot of people apply a reactive approach to life and you get a reactive outcome. Got two more for you here. The next one is habits and discipline. This is really what feeds this process and the way to think about discipline is pretty simple. The way you do one thing is the way you're going to do most things. And in order to pull all of this together, we have to plan. You have to plan effectively. So now let's do just a little bit of planning. If we pop over to my website and we take a look at this resource section, there's a section here that says do traders make money. And you'll see a few things. The first one is seven percent of traders remain in the market after five years. That's not super great. Here we are seeking to understand the landscape. The average trader underperforms the market by six and a half points on average. So most traders underperform the market. 93 of traders quit within five years, just the inverse of that. And then this one, there are even traders that continue beyond the five year mark that still are not profitable. So how do we plan successfully? Simple. You embrace something like this. So again, if you go to my website and you",
    "metadata": {
      "video_id": "h6XH1IQRhC0",
      "title": "Your Path to Financial Freedom: How to Become a Full-Time Options Trader",
      "url": "https://www.youtube.com/watch?v=h6XH1IQRhC0",
      "upload_date": "",
      "duration": 574.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:09:13",
      "start_timestamp_seconds": 553.8666666666666,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h6XH1IQRhC0&t=553"
    }
  },
  {
    "text": "within five years, just the inverse of that. And then this one, there are even traders that continue beyond the five year mark that still are not profitable. So how do we plan successfully? Simple. You embrace something like this. So again, if you go to my website and you go here to the compound interest calculator, here is a scenario. If you have 25,000 of principle and you save 500 per month for 27 years at a 10 return, you are going to become millionaire. It is just math. How do we accelerate this? Well, we get better at trading. And instead of 10 per year, which is about the average for the SP 500, depending on your reference period, maybe we get this up to 15 per year. Then all of a sudden, you're now almost 2.8 millionaire in that time frame. So then maybe instead of 20 years, you're 27, you could take it down to 20 years and notice you're a millionaire in that time frame. Maybe you get better at saving. And instead of 500, you're able to save 1000. Maybe we could take this down now even further to 17 years. Still a millionaire. So there are different levers you can pull on to accelerate this time frame for you. The concept of becoming an outlier is well within your reach. It comes down purely to your mindset. We all have different starting points. Some people start more disadvantaged or advantaged. That you cannot",
    "metadata": {
      "video_id": "h6XH1IQRhC0",
      "title": "Your Path to Financial Freedom: How to Become a Full-Time Options Trader",
      "url": "https://www.youtube.com/watch?v=h6XH1IQRhC0",
      "upload_date": "",
      "duration": 574.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:10:46",
      "start_timestamp_seconds": 646.1777777777778,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h6XH1IQRhC0&t=646"
    }
  },
  {
    "text": "So there are different levers you can pull on to accelerate this time frame for you. The concept of becoming an outlier is well within your reach. It comes down purely to your mindset. We all have different starting points. Some people start more disadvantaged or advantaged. That you cannot control, but you can fully control how you react to your current scenario and change your outcomes. Like, subscribe, share, be an outlier. See you guys later.",
    "metadata": {
      "video_id": "h6XH1IQRhC0",
      "title": "Your Path to Financial Freedom: How to Become a Full-Time Options Trader",
      "url": "https://www.youtube.com/watch?v=h6XH1IQRhC0",
      "upload_date": "",
      "duration": 574.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:12:18",
      "start_timestamp_seconds": 738.4888888888888,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=h6XH1IQRhC0&t=738"
    }
  }
]