[
  {
    "text": "Trading options can be incredibly lucrative. However, if you're anything like me when I first started, I just kind of started trading. And unfortunately, that led to a bunch of wasted time and effort. So the goal of this video is to share nine questions I would ask myself if I were to start trading options all over again. And no, this isn't to confirm whether or not options are right for me to trade because they are. It's to make sure that I'm going down the right path because it is so easy not to. Let's dig right in. Taking a look at the first three, this first question is no mistake. Do you understand the trouble that you're in? And it sounds a little dramatic, but here is the long and short of it. The vast majority of traders fail. We know this. There's all different kinds of statistics on it. You can find a lot of data on it on my website. Here are a list of studies that you can check out that report the behavior and the results of most traders. So why do I bring this up? If I already know that I want to trade, but I know that a lot of people fail at it. Well, two reasons. The first one is in order to succeed at something that's incredibly difficult, you have to understand how difficult it is so that you can then conduct the proper preparation in order to succeed",
    "metadata": {
      "video_id": "hjiPb_i5UaA",
      "title": "Avoid These 9 Beginner Options Trading Mistakes",
      "url": "https://www.youtube.com/watch?v=hjiPb_i5UaA",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hjiPb_i5UaA&t=0"
    }
  },
  {
    "text": "to trade, but I know that a lot of people fail at it. Well, two reasons. The first one is in order to succeed at something that's incredibly difficult, you have to understand how difficult it is so that you can then conduct the proper preparation in order to succeed in it. The same thing if you go through any sort of harder military training course, if you just show up and hope it's going to go OK without doing all of the physical requirements ahead of time to make sure that you're ready to go through that training. There's a good chance you fail. The other thing is trading has a remarkably low barrier to entry. So if you think about being a professional athlete, you've probably played your whole life. You played it in all different kinds of leagues. You've probably done really well. I had a lot of coaching, yada, yada, yada in trading. None of that. But really, sign on to a website, open a brokerage account, put some money in your now a trader. That's it. There's nobody looking at anything you do, which is both the beauty, but a lot of people's destruction is having complete and utter autonomy because everything that happens as a trader is only one person's fault our own. So that's the trouble that we're in. We're interfacing with a very difficult system with absolutely no structure around it. Essentially one of the beautiful things about the outlier community, which",
    "metadata": {
      "video_id": "hjiPb_i5UaA",
      "title": "Avoid These 9 Beginner Options Trading Mistakes",
      "url": "https://www.youtube.com/watch?v=hjiPb_i5UaA",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 13,
      "start_timestamp": "00:01:35",
      "start_timestamp_seconds": 95.32307692307693,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hjiPb_i5UaA&t=95"
    }
  },
  {
    "text": "having complete and utter autonomy because everything that happens as a trader is only one person's fault our own. So that's the trouble that we're in. We're interfacing with a very difficult system with absolutely no structure around it. Essentially one of the beautiful things about the outlier community, which you should check out the link in the discord below, link to the discord below. And you can join the free side to paid side either or, but that's the whole idea is to help people add some structure to this stuff. OK, so the next question I have for us, once we understand that this is difficult, it's easy to mess up, but it's worthwhile. We're understanding the challenge here. The next thing we need to do is level set on goals because how often have you heard something like, I just won a hundred dollars a day. Well, this is sound too crazy, especially if you have the average trading account, which is 5,500 according to the bank for international settlements. That seems OK. But if you actually look at the percent return, it's 72,190 return. Pretty damn good. Now for context to be clear, my return from 2018 to 22 was 24.6 on average. And my compound annual growth rate from 2007 is in the 20 range. And this is 72,190. Apparently I have a lot of work to do. Really, the point being is people can perform way better than me to be clear. And a",
    "metadata": {
      "video_id": "hjiPb_i5UaA",
      "title": "Avoid These 9 Beginner Options Trading Mistakes",
      "url": "https://www.youtube.com/watch?v=hjiPb_i5UaA",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 13,
      "start_timestamp": "00:03:10",
      "start_timestamp_seconds": 190.64615384615385,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hjiPb_i5UaA&t=190"
    }
  },
  {
    "text": "2018 to 22 was 24.6 on average. And my compound annual growth rate from 2007 is in the 20 range. And this is 72,190. Apparently I have a lot of work to do. Really, the point being is people can perform way better than me to be clear. And a lot of people should. I've approached trading very specifically with the intent of doing well, but consistently. I've only had two down years, my first two and both of them are less than 5 draw downs. So yeah, I have a different objective. But the point I'm trying to make is that a lot of people get into this with the idea of making a small amount of money. They're taught not to be greedy. They think they're doing that. But once you actually start looking at the numbers a little bit, you're like, OK, you're actually setting yourself up for failure right from the jump. So you have to answer this question. Before you move on to the next three, why are you different? What are you going to do different than all of these people? What are you going to do different than the 90 plus group of people that try to do this in fail? And it can't be something as simple as I'm going to try hard. I'm going to study hard. Lots of them do that. You have to go further than that. And one of the things I want you to start thinking about",
    "metadata": {
      "video_id": "hjiPb_i5UaA",
      "title": "Avoid These 9 Beginner Options Trading Mistakes",
      "url": "https://www.youtube.com/watch?v=hjiPb_i5UaA",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 13,
      "start_timestamp": "00:04:45",
      "start_timestamp_seconds": 285.9692307692308,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hjiPb_i5UaA&t=285"
    }
  },
  {
    "text": "people that try to do this in fail? And it can't be something as simple as I'm going to try hard. I'm going to study hard. Lots of them do that. You have to go further than that. And one of the things I want you to start thinking about now is what are the qualities you have personally that can help you gain an edge in the markets? So when I think about myself specifically, I'm not that gifted with math. I didn't come for money so I didn't have some big bank role to start with. So what were the things I had in my favor? I'm incredibly organized. So as I go through my trading career, I spend a lot of time tracking things that create a feedback loop. So you'll see some of that later in here. The other thing is once I start something and I'm interested in it, I tend to become obsessive. And I use this metric all the time. It's actually higher than this now, obviously, but I've spent over 30,000 hours looking at these things. And the reason why that matters is because taking the time to learn the products and to learn what this is is not easy. It's all delayed gratification. It's your first five years, your first eight years. You're not going to see much. You might trade really well. You might be growing your money. But if you're like me and you start without a lot of",
    "metadata": {
      "video_id": "hjiPb_i5UaA",
      "title": "Avoid These 9 Beginner Options Trading Mistakes",
      "url": "https://www.youtube.com/watch?v=hjiPb_i5UaA",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 13,
      "start_timestamp": "00:06:21",
      "start_timestamp_seconds": 381.2923076923077,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hjiPb_i5UaA&t=381"
    }
  },
  {
    "text": "to learn what this is is not easy. It's all delayed gratification. It's your first five years, your first eight years. You're not going to see much. You might trade really well. You might be growing your money. But if you're like me and you start without a lot of money, even if you have a great return, it's not going to move the line really that much as a gross dollar amount. So you have to think about you. What are you really good at? Are you good at pattern recognition? Do you see things over time and you can start to catch patterns that continue to reoccur? You'll find that in the market all the time. Are you really good at being objective with yourself? We'll get into that a little bit later. But one of the biggest downfall traders have is literally the inability to control themselves. And that's a massive drawdown. So think about that as we proceed forward. What are you good at and how does that make you different than most people who try this and fail? Next three questions. You probably caught some of this from what I was just talking about, but how serious are you about doing this? Because a lot of people will start trading like, I'll just throw some money in and see how it goes. Stand, it's gone. It's fine. You could do that. It doesn't like, okay. But trading, especially as a wealth development vehicle, is a",
    "metadata": {
      "video_id": "hjiPb_i5UaA",
      "title": "Avoid These 9 Beginner Options Trading Mistakes",
      "url": "https://www.youtube.com/watch?v=hjiPb_i5UaA",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 13,
      "start_timestamp": "00:07:56",
      "start_timestamp_seconds": 476.61538461538464,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hjiPb_i5UaA&t=476"
    }
  },
  {
    "text": "how serious are you about doing this? Because a lot of people will start trading like, I'll just throw some money in and see how it goes. Stand, it's gone. It's fine. You could do that. It doesn't like, okay. But trading, especially as a wealth development vehicle, is a terrible hobby because you have to wear so many hats as an individual retail trader. You have to research things. You have to be a data analyst to look through a bunch of data. You have to be a technical analyst to be able to look at charts. You also have to be your own counselor and psychologist because guess what? Out of all of the people that interact with the stock market, we all have access to the same information. You have access to the same information I do yet 90 plus of traders fail within five years. I haven't. I've obviously outperformed the market for that timeframe. Is it because I have better tools, better information? No. So what does it come down to? It comes down to the way that I manage myself, the way I understand myself and the way that I'm able to bear myself to myself. What I mean by that is we have an ego and it's very difficult to manage the ego and it leads to things like the disposition effect where we take winning trades down too fast because we want to realize the gain and then we let losing trades",
    "metadata": {
      "video_id": "hjiPb_i5UaA",
      "title": "Avoid These 9 Beginner Options Trading Mistakes",
      "url": "https://www.youtube.com/watch?v=hjiPb_i5UaA",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 13,
      "start_timestamp": "00:09:31",
      "start_timestamp_seconds": 571.9384615384616,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hjiPb_i5UaA&t=571"
    }
  },
  {
    "text": "to myself. What I mean by that is we have an ego and it's very difficult to manage the ego and it leads to things like the disposition effect where we take winning trades down too fast because we want to realize the gain and then we let losing trades run because we don't want to realize loss. I know that's a thing. So I've created systems that allow me to control that and limit my ability to sabotage myself. The point being is if you are going to be a trader, there's nobody looking over your shoulder telling you to be honest, telling you to do the hard work. It's all on you. Not a good hobby. It's a great way to lose a lot of money. So speaking of losing money, how do you plan on making it? A lot of traders just think that if I start trading options, it'll all make money. It's not how it works. You have to define what I like to call a money making mechanism. I have an entire video on this. I'll link to that in the notes below. But you have to figure out options are just a vehicle. There's something we can trade. They're a type of security. So trading options doesn't equal making money. You have to figure out what is the money making? Are you going to be good at trading directionally? Are you good at finding breakouts? Are you good at finding things that have",
    "metadata": {
      "video_id": "hjiPb_i5UaA",
      "title": "Avoid These 9 Beginner Options Trading Mistakes",
      "url": "https://www.youtube.com/watch?v=hjiPb_i5UaA",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 13,
      "start_timestamp": "00:11:07",
      "start_timestamp_seconds": 667.2615384615384,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hjiPb_i5UaA&t=667"
    }
  },
  {
    "text": "There's something we can trade. They're a type of security. So trading options doesn't equal making money. You have to figure out what is the money making? Are you going to be good at trading directionally? Are you good at finding breakouts? Are you good at finding things that have increasing volume and institutional support and you're able to follow that? Are you able to analyze broad market data sets and find inefficiencies like various risk premiums that you can capitalize on? They're all out there. They exist. So what's beautiful things about being a retail trader is you get to check about a lot of different boxes and find what works for you. But simply trading options is not a way that you make money. Actually, for most people, for being honest, it's a way to lose money. Why haven't you started a trading plan and trading log? This is simple. If you haven't done them, do them. I have a video in the notes that will walk through both of them in depth. But as you notice, you have to do a lot of things. The idea that you're going to be able to do all of those things and just memorize it really organized in your mind and perform well is wild. Even if over time you don't really refer to your trading plan all the time, I don't. But going through the exercise of building it is so important. Last three questions. Are you familiar with",
    "metadata": {
      "video_id": "hjiPb_i5UaA",
      "title": "Avoid These 9 Beginner Options Trading Mistakes",
      "url": "https://www.youtube.com/watch?v=hjiPb_i5UaA",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 13,
      "start_timestamp": "00:12:42",
      "start_timestamp_seconds": 762.5846153846154,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hjiPb_i5UaA&t=762"
    }
  },
  {
    "text": "things and just memorize it really organized in your mind and perform well is wild. Even if over time you don't really refer to your trading plan all the time, I don't. But going through the exercise of building it is so important. Last three questions. Are you familiar with the Dunning Krueger effect because you have to be? Here it is. It's essentially this cycle that we go through where in the beginning, you don't know anything. Then you go through three or four really hard intensive years of learning and you think you know what's going on. Fortunately, we don't. My Dunning Krueger effect essentially occurred after four years of trading. That's where I had the largest percent drawdown on my portfolio. That sends you down here. You've just now realized that shit. I have a long way to go. You have a choice now. Do you do the learning? And if so, after average 10,000 hours, which if you want to break that down, that means you spend five hours every single day for five and a half years without missing a single day that will put you just over this 10,000 hour mark to give you an idea of how long this takes in order to develop this skill set. If you're not ready to just say, yep, stuck it up, buttercup, we got to get through this and I think I can. This isn't for you. It's like if you start training Jujitsu. If you",
    "metadata": {
      "video_id": "hjiPb_i5UaA",
      "title": "Avoid These 9 Beginner Options Trading Mistakes",
      "url": "https://www.youtube.com/watch?v=hjiPb_i5UaA",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 13,
      "start_timestamp": "00:14:17",
      "start_timestamp_seconds": 857.9076923076923,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hjiPb_i5UaA&t=857"
    }
  },
  {
    "text": "an idea of how long this takes in order to develop this skill set. If you're not ready to just say, yep, stuck it up, buttercup, we got to get through this and I think I can. This isn't for you. It's like if you start training Jujitsu. If you start training Jujitsu and your goal is to be a black belt within three years, it's not happening. It's literally not happening. It takes too long. So what does that mean? Well, maybe you still want your black belt and that's a longer term goal and you're committed to that longer term goal, but you learn to prioritize smaller processes along the way. And you break it up into smaller chunks and then you start working. Last two questions. How will you keep yourself honest right here? Rating plan and your trading log. That's how. Whether we acknowledge it or not going back to one of the many hats, we have to acknowledge and wear one of them is psychologist. And if you think about our behaviors as humans, we get away with doing a lot of mental manipulations in order to save our ego or in order to save discomfort. However, if that's your disposition, trading is going to be very difficult. You have to get comfortable being uncomfortable pretty regularly. So the easiest way to make sure that you're doing the hard work, that you're accomplishing what you're setting out to is to document what you're doing. And",
    "metadata": {
      "video_id": "hjiPb_i5UaA",
      "title": "Avoid These 9 Beginner Options Trading Mistakes",
      "url": "https://www.youtube.com/watch?v=hjiPb_i5UaA",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 13,
      "start_timestamp": "00:15:53",
      "start_timestamp_seconds": 953.2307692307693,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hjiPb_i5UaA&t=953"
    }
  },
  {
    "text": "discomfort. However, if that's your disposition, trading is going to be very difficult. You have to get comfortable being uncomfortable pretty regularly. So the easiest way to make sure that you're doing the hard work, that you're accomplishing what you're setting out to is to document what you're doing. And then the last thing, without this none of this matters because you're going to go through this phase, you're going to have really bad draw downs. You're going to get really tired of looking at this for five years in a row and still not seeing the exact results that you want. This is what keeps it all pushing. Why does this matter you? For me, the simple, I grew up poor. I had a single mom. She worked as a contractor. She was a physical therapist. She had no retirement. I knew as a young man, I'm the retirement. If I'm not in a spot to take care of my mom, who the fuck is going to do it? Language. So for me, that was simple. That's why this matters to me. That's why when in college, as my friends are going out to party, rightfully so, and I used to party too, make no mistake about it, but a lot of times I would say no because I was in my room doing homework because there was something bigger and more important than me at stake. Why does this matter to you? You have to answer that and",
    "metadata": {
      "video_id": "hjiPb_i5UaA",
      "title": "Avoid These 9 Beginner Options Trading Mistakes",
      "url": "https://www.youtube.com/watch?v=hjiPb_i5UaA",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 13,
      "start_timestamp": "00:17:28",
      "start_timestamp_seconds": 1048.5538461538463,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hjiPb_i5UaA&t=1048"
    }
  },
  {
    "text": "used to party too, make no mistake about it, but a lot of times I would say no because I was in my room doing homework because there was something bigger and more important than me at stake. Why does this matter to you? You have to answer that and visualize it because this is what matters. The time that I told my mom, you don't have to worry about working ever again. I have your back. That was the culmination of all of this time and effort and it's completely fucking worth it. I'll see you later.",
    "metadata": {
      "video_id": "hjiPb_i5UaA",
      "title": "Avoid These 9 Beginner Options Trading Mistakes",
      "url": "https://www.youtube.com/watch?v=hjiPb_i5UaA",
      "upload_date": "",
      "duration": 787.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 13,
      "start_timestamp": "00:19:03",
      "start_timestamp_seconds": 1143.8769230769233,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hjiPb_i5UaA&t=1143"
    }
  }
]