[
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "you you you you you you you you you you you you you you what's up outliers the general just arrived post dinner that is for obviously is eager to get into our market discussion for today two things brought topics on the docket and as always we can end flow into whatever else comes up as part of the discussion i already have one item cute for that. the main stuff i want to talk about the first one is f1c then i want to take a look at game stop earnings big reason by the way is the Saturday streams have been repurposed for another stream. so i'm going to start doing any coverage really broad stock market coverage all of that is going to happen on Wednesday versus being split on between Wednesday and Saturday so that effectively means the Wednesday stream will be for every stock including. the first one is a lot of things to do with the game stop i want to talk about game stops earnings i've had a few people reach out asking about it rightfully so we'll talk about it. but to kick us off i do want to say hello to everybody's coming to hang out so i see rease i see pimp daddy. the hell of a name i see Kirk Ocenano zx great to see you all and i'm looking forward to taking a stroll through the markets with you you can see up on the screen right",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 324.0,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "to everybody's coming to hang out so i see rease i see pimp daddy. the hell of a name i see Kirk Ocenano zx great to see you all and i'm looking forward to taking a stroll through the markets with you you can see up on the screen right now is a xt i i still have a long position on in here although i did trim a little bit of it today. it was actually because it ended the day really really strong but about mid day it started looking a little bit weaker so at the end of the day management time frame which by the way a lot of times for stuff like this i actually do prefer. planning for like an end of day management window because it does give a little more room or um management and. this. intraday play on stuff that doesn't matter but that's how she goes. it's mr2 oh it's polo what's up man. dude i haven't seen you or heard from you in a while i hope you and your lady are doing well. damn it's super good to see your name then i'm so happy to see you man i hope you're doing wait. it's been. fucking feels like forever since i've actually seen you dude what the link up. now let's talk a little bit about the broad market first as expected the fed did cut rates and i don't know if anybody saw but on. the",
    "start_timestamp_seconds": 317.0,
    "end_timestamp_seconds": 412.0,
    "start_timestamp": "05:17",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=317",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "man i hope you're doing wait. it's been. fucking feels like forever since i've actually seen you dude what the link up. now let's talk a little bit about the broad market first as expected the fed did cut rates and i don't know if anybody saw but on. the market. it's been. it's been way more fun if. big daddy j power is just like. fuck everybody there's no cuts fuck your Christmas just because i thought a little bit of chaos would be fun and entertaining but that chaos also comes at a cost and i realize that so i wouldn't want negative. you know impact to people. so what does that mean pretty boring day volatility was definitely low to start the day excessively low very very low. and then towards the end of the day it absolutely blew out it had a significant significant range on the day. so these are the interesting kinds of moves that can happen when you're trading vault but the good part about it is it's just really really good. risk to reward so i had some short straddles and strangles out the in spx zero d to ease. the straddles came down early and then the strangles were left on towards the close everything was in profit by overall very lucrative day for selling but it's your your. selling insurance to people when you know shit can really start to go sideways so i don't ever want to make the",
    "start_timestamp_seconds": 386.0,
    "end_timestamp_seconds": 486.0,
    "start_timestamp": "06:26",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=386",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "came down early and then the strangles were left on towards the close everything was in profit by overall very lucrative day for selling but it's your your. selling insurance to people when you know shit can really start to go sideways so i don't ever want to make the selling side. seem more glamorous than it is because it's effective but you do have to be ready to ride bad path a great example of that is there's a member in the discord. that was talking about their earnings approach we've been talking about it a few times each week actually because they're doing a good job reporting out. their earnings findings which allows me to give them feedback and have a conversation around like hey this is what you're seeing maybe this is something you should take a look at which is a reminder to everybody. if you're in the discord whether it's the pay side or the free side use it because i'm always eyeballing and if i have time i absolutely. will try to weigh in as much as i can i have you see always prioritize the paid side is you would imagine but i still have absolutely tons of time that i use to discuss stuff on the free side as well because i think it's important. and. that discussion process and feedback loop is really useful so anyways this person has been trading earnings and they're building a model to help them trade",
    "start_timestamp_seconds": 475.0,
    "end_timestamp_seconds": 547.0,
    "start_timestamp": "07:55",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=475",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "still have absolutely tons of time that i use to discuss stuff on the free side as well because i think it's important. and. that discussion process and feedback loop is really useful so anyways this person has been trading earnings and they're building a model to help them trade short vault earnings. but they're finding a little bit of a bumpy road which is normal i also see. it looks like a bunch of frames are dropping i don't know why let me know if i'm coming through like super choppy to you guys is. the internet looks good i don't know why. one sec. little choppy yeah it looks. it looks like it but i don't know why i'm going to lower down the output really quick. let's do like 4500 and see if that helps. what i did was i just lower the frame rate slightly to see if that helps i have no idea what else is pulling. what the fuck is pulling my internet right now let me close some tabs is nuts i have no idea what is. kill on this thing so bad let me kill that one. still doing it one sec i'm going to kill obs and restart it the stream will be there just give me one sec. let's see how this goes let me know if it starts getting really awful i generally have no idea. what am i computer might be doing this. because i really don't have",
    "start_timestamp_seconds": 532.0,
    "end_timestamp_seconds": 662.0,
    "start_timestamp": "08:52",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=532",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "i'm going to kill obs and restart it the stream will be there just give me one sec. let's see how this goes let me know if it starts getting really awful i generally have no idea. what am i computer might be doing this. because i really don't have that much going on. but okay we'll continue let me know if it gets really bad and then all lower the output massively see if that helps right now it looks like super high dropped frames but. i can't quite put my finger on it let's see if this helps getting out of that screen. i might also just have to kill think or swim. reset's error is valid spiking that's funny it could be i'll try a different Wi-Fi connection i don't feel like i should have to but i have. i have a couple choices. i think i'm going to do that. all right so what i did was change and. that looks to be. not helping. absolutely bizarre. zx says super detailed graphics hardest to compress higher bit rate load simpler background or less tabs maybe yeah that's my best guess i i mean i you guys know we do streams literally all the time. and normally don't run into anything too crazy but yeah i just closed a bunch of stuff and we'll see. we'll see how that works in the meantime while that's hopefully sorting itself out. i figure we can i can also decrease",
    "start_timestamp_seconds": 623.0,
    "end_timestamp_seconds": 747.0,
    "start_timestamp": "10:23",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=623",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "know we do streams literally all the time. and normally don't run into anything too crazy but yeah i just closed a bunch of stuff and we'll see. we'll see how that works in the meantime while that's hopefully sorting itself out. i figure we can i can also decrease the stream output that's what i'll do really quick i'll just make it super low. the overall visual quality won't be quite as good but it should be asking for a little bit less. okay so the audio hasn't been bad we'll call that good then let's talk about what the broad market is doing. all is still a little bit elevated i think relative to what happened today and thus where otherwise i think it might. lie longer term so i still think that there's some opportunity on short wall going forward especially at like the index level. it just won't be anything too awesome but these kinds of transitory periods are also something i typically like to take a look at. across the market we saw positive reaction except for utilities in real estate why do i note those because as always. from a trader's lens your job is to look for deviations your job is to look for stuff that seems weird. and the fact that the entire broad market shot up today but we clearly have two things here that had a down day is actually very very telling to me. so. if i'm looking for",
    "start_timestamp_seconds": 720.0,
    "end_timestamp_seconds": 837.0,
    "start_timestamp": "12:00",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=720",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "is to look for deviations your job is to look for stuff that seems weird. and the fact that the entire broad market shot up today but we clearly have two things here that had a down day is actually very very telling to me. so. if i'm looking for weakness those are good places to look as actually looking at a managed real estate product today more out of curiosity than anything. but there's actually some really really interesting opportunities in there because there's super strong divergence going on within the sector itself. so again just another general point to be aware of as you're looking at stuff and as you're poking around. breath looks strong we have 53% of s&p companies above their 50 period moving averages so breath in general does look pretty strongly and then let me know if. visuals are no good. I can describe a more in detail. My guess is they might be choppy in the beginning, but then my expectation is that they'll be they'll clean up as we hang on them for a second depending on how the frames here work. It's still dropping a ton like 50% of the frames, which is super, super weird. I really don't know why I'm saying. Rises is there a scale down version of index level, usually two rich for my blood. Does that translate less to individual names? You mean in terms of vol, because realistically speaking, constituents have more vol than the",
    "start_timestamp_seconds": 812.0,
    "end_timestamp_seconds": 913.6,
    "start_timestamp": "13:32",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=812",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "which is super, super weird. I really don't know why I'm saying. Rises is there a scale down version of index level, usually two rich for my blood. Does that translate less to individual names? You mean in terms of vol, because realistically speaking, constituents have more vol than the index. But the problem with individual constituents is you change your risk profile a lot. You effectively take your risk profile to something that is now stretched across from an index many names to an individual thing, because now you have like individual corporate risk, which is no good. I'm going to try switching at a curiosity. I'm going to try switching to my 6G network. It's super weak, but at this point with it being so choppy. I'm honestly just curious. All right. So it looks like we're back. I'm running on the 6G, which so far looks good. So far it looks really good. That's absolutely fascinating. Let me know if that's better on my little dashboard. It looks way better. Yeah, fascinating. The interesting thing is this 6G connection is like super, super weak, but apparently it's more than enough. So what I'm going to do is jack up the output again so that you guys can hopefully see clearly and see if this breaks it. So I just ran it up to 5,000 like I normally have it. I wonder if the providers doing anything. Ah, it looks good. Sick. All right. Shout out to 6G.",
    "start_timestamp_seconds": 895.08,
    "end_timestamp_seconds": 1002.6,
    "start_timestamp": "14:55",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=895",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "jack up the output again so that you guys can hopefully see clearly and see if this breaks it. So I just ran it up to 5,000 like I normally have it. I wonder if the providers doing anything. Ah, it looks good. Sick. All right. Shout out to 6G. 6G is doing it with supposed to. Also. The weakness in the divergence that you see across the sectors is as always extremely note worthy to me. And it's a great place to look for ideas in case you didn't know. I do want to spend a couple moments before we get into FOMC specifically talking about this post. And it's one I came across on Reddit earlier today and I was trying to help a brother out. And I think it's a great reminder and example of rolling options and how this confuses so many people so many people get stuck on this. So effectively what they're saying is that they've been trading for a few years. It's actually good to understand their general, you know, context. The thing to remember is the average option option trader with a few years of experience is still absolutely beginner level. So just the way that I look at this like if you casually look at options for three years, you're a beginner. You're not even you're not even close and that's not a bad thing. Just means you probably have a pretty long road to go as you might expect. So",
    "start_timestamp_seconds": 982.6,
    "end_timestamp_seconds": 1079.6,
    "start_timestamp": "16:22",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=982",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "just the way that I look at this like if you casually look at options for three years, you're a beginner. You're not even you're not even close and that's not a bad thing. Just means you probably have a pretty long road to go as you might expect. So that's one of the things I pick up here. So let's just read their posts. It's literally a really good example. It says usually just close by position when I'm happy with profit. It's a good. It's a good approach. But today I needed to roll in by myself some more time. So clearly they have some sort of long thesis in this product that they're trading, which is GLD. They're they were getting close to expiration or whatever it was that they were trading. I'm assuming expiration. And yeah, because it was 1231. So and at this month, which by the way, good on them for looking to manage it now versus like this Friday's expiration or something crazy like that. But let's read, I have rolled covered calls in the past. I rolled 12 contracts on GLD, 360 one strike, expiring 31Ds into 12 contracts, expiring 16 Jan 26, 360 nine strike. So the first thing to know is the change in strike. They increased the strike, which unfortunately, when we look at how this ends up working, this is a long call. Part of me thinks that they applied the wrong playbook because they rolled out in",
    "start_timestamp_seconds": 1064.6,
    "end_timestamp_seconds": 1164.6,
    "start_timestamp": "17:44",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=1064",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "26, 360 nine strike. So the first thing to know is the change in strike. They increased the strike, which unfortunately, when we look at how this ends up working, this is a long call. Part of me thinks that they applied the wrong playbook because they rolled out in time 31Ds to 16 Jan 26, they rolled up 8 points, 365 to 365. That itself is a questionable move. And it's because if you're bullish, what this is doing is literally pulling away the deltas that you want. And I'll show you what I mean, if we take a look at GLD, I hide this. Good to GLD. And let's take a look at what their position originally was, which is the 31Ds, 365. That puts them at a 1 delta, literally a 1 delta option that's 365's out in 16 Jan is in 89 delta. So to be completely honest, that's actually not that bad. It's no one here as bad as I thought. I, in general, with these kinds of things, you wouldn't want to roll your strike up because think of it this way. At the 361, your delta is 1. So that means, the underlying goes up. You go up the same. And as the underlying goes down, you go down the same. Whereas even with the 369s, with the delta of 0.88 or 0.9, what that means is the underlying goes up. And you go up most of the way. If the underlying goes",
    "start_timestamp_seconds": 1128.6,
    "end_timestamp_seconds": 1266.6,
    "start_timestamp": "18:48",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=1128",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "goes up. You go up the same. And as the underlying goes down, you go down the same. Whereas even with the 369s, with the delta of 0.88 or 0.9, what that means is the underlying goes up. And you go up most of the way. If the underlying goes down, you go down most of the way, but not all the way. What that means is they're missing effectively 12 cents or 12 dollars per dollar move in the beginning. Which, again, it actually is not that bad. I was expecting it to be quite a bit of a lower delta. So I actually don't have as much of an issue with this, especially if they're trying to balance the cost of the new position. It says, oh, wow, I don't even call long roll changes roles, which is, I mean, that's the funny thing about roles is a realistically what a role is and what it applies to is so varied, right? Because as you'll see in my explanation to their, well, first let's finish reading this. It says, however, I have less money in my account after rolling. I assumed rolling for a credit not only extends your position, but credits your account balance. So again, they're buying options. There's no credit to their account balance and it says that they're down 2900, which you'll see based on my math later. It's actually a little more than that. What is rolling? It's a friendly reminder. This is",
    "start_timestamp_seconds": 1245.6,
    "end_timestamp_seconds": 1348.6,
    "start_timestamp": "20:45",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=1245",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "your position, but credits your account balance. So again, they're buying options. There's no credit to their account balance and it says that they're down 2900, which you'll see based on my math later. It's actually a little more than that. What is rolling? It's a friendly reminder. This is it. Rolling is closing a trade and opening a trade. That's it. That's all it is. The funny thing about rolling is that for whatever reason, I think it's the way that it's marketed and shared people think that there's something magic in a role, but there isn't. So what that means is exactly what Reese was explaining that didn't even think like doesn't even like register that changes to long calls could be rolling. And that's fair. Most people assign short option positions and losing with rolling, meaning if you're having something that's challenged or something like that. That's not what it is. A role is literally closing a position opening a new one. Either in the same order, meaning you're submitting one order to close and then open or in separate orders and you're just tying the accounting together. The irony is that the main function of tying the accounting together applies to pretty much anything. Pretty much anything at all. That means that I can close a call open a put and that accounting still might impact that broader strategy. You can call that a role. Now typically we wouldn't because I would confuse a lot of",
    "start_timestamp_seconds": 1322.6,
    "end_timestamp_seconds": 1443.6,
    "start_timestamp": "22:02",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=1322",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "the accounting together applies to pretty much anything. Pretty much anything at all. That means that I can close a call open a put and that accounting still might impact that broader strategy. You can call that a role. Now typically we wouldn't because I would confuse a lot of people, but at the end of the day that that's essentially what's going on is it's just two orders. So I gave him a hypothetical to explain what it looks like and then they followed up with, is it the same for a long call. I sold to close GLD for $2900 loss bought it to open at a higher and later strike for a $6900 credit. So obviously the first point here is that they did not open it for credit. This is not done at a credit and again I explain all the math. Cash balance did increase which you'll see why are you saying the credit isn't available to me until I close the new trade. Okay, so what I end up saying is give me your specific trade and they dropped it. Where's it at? They gave me like the actual list of yeah here. So they bought to open the 360 ones at 30185. They sold to close those for 2930. Then they bought to open the 365 for 2360. So again, before I give you the answer, it's a perfect time to test your knowledge. Do the math really quick. I'll give you a",
    "start_timestamp_seconds": 1420.6,
    "end_timestamp_seconds": 1524.6,
    "start_timestamp": "23:40",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=1420",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "they bought to open the 360 ones at 30185. They sold to close those for 2930. Then they bought to open the 365 for 2360. So again, before I give you the answer, it's a perfect time to test your knowledge. Do the math really quick. I'll give you a second. You could just pull up a calculator. It's not hard to do. But you should be able to tell me what the net impact to their position was on the first part of the role, which is this remember a role starts with opening a trade. This is the original trade and then where the role actually occurs is here when we close this original trade and we open a new one. What this means is we can literally do the math and see where they sit. So wheel stretch host is negative 6.3. Let's take a look. They bought to open for 3185, which is a 38,220 dollar debit. That's money out of the account. When you incur these debits, you have two important parts of your portfolio. You have a net lick. This net lick is if you close everything. This is your portfolio value. Then you have your cash and sweep. What it sounds like how much cash you have. When they first buy these options for 3185, it comes out of the cash and sweep. So buy to open your 12 contracts. 3185. No impact to their net liquidating value at this point. No impact",
    "start_timestamp_seconds": 1506.6,
    "end_timestamp_seconds": 1630.6,
    "start_timestamp": "25:06",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=1506",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "have your cash and sweep. What it sounds like how much cash you have. When they first buy these options for 3185, it comes out of the cash and sweep. So buy to open your 12 contracts. 3185. No impact to their net liquidating value at this point. No impact at all. Your net lick is now susceptible to the P&L fluctuations of this. So as it goes up and down. Those fluctuations will impact the net lick, but their cash will not change. Your cash is your cash. So this amount of money, the 38.22K comes out of here. Great. Then we sell to close this position. We sold to close this position for 29.3. This gives us a total credit of 35.160. So what happens here? You bought it for 38.22. You closed it for 35.160. What will happen here is your net lick is going to decrease by that value. So in this case, you lose 3,060 bucks. That's gone. Your cash and sweep originally. Let's just say it was this existing value was 38.22. If you have nothing else in the portfolio, your cash and sweep is now 35.160. So what does that mean? Your cash and sweep also decreased by this amount. Then we open a new trade for their role. We buy to open 12 at 23.6. This is a new debit of 28.320. This comes out of your cash and sweep with no immediate impact to your net lick is now tied to",
    "start_timestamp_seconds": 1605.6,
    "end_timestamp_seconds": 1753.6,
    "start_timestamp": "26:45",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=1605",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "and sweep also decreased by this amount. Then we open a new trade for their role. We buy to open 12 at 23.6. This is a new debit of 28.320. This comes out of your cash and sweep with no immediate impact to your net lick is now tied to an open trade. What I also did for them is explain where the option needs to trade in order for them to get back to break even, which is 26.15. Based on losing this 3 grand and opening up this new position here, this option at 23.6 needs to trade at 26.15. That will make them flat zero. They've not made money. They're flat. That's their break even price. So Joe, what do you think of your 6.3 compared to what you just saw here? And do you follow what we just went through? Kirk says when sell to close the initial trade net lick wouldn't go down on the close. It would go down as the market value went down over time. Hold on one second. No, it wouldn't go down your cash and sweep wouldn't go down as market value went down because you paid whatever you paid for it. Your cash and sweep won't move. You're, oh, I'm sorry. Hold on. Hold on hold on. I'm just right. When sell to close the initial trade net lick wouldn't go down on the close. It would go down as the market value went down over time. Correct. Yeah,",
    "start_timestamp_seconds": 1728.6,
    "end_timestamp_seconds": 1840.6,
    "start_timestamp": "28:48",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=1728",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "for it. Your cash and sweep won't move. You're, oh, I'm sorry. Hold on. Hold on hold on. I'm just right. When sell to close the initial trade net lick wouldn't go down on the close. It would go down as the market value went down over time. Correct. Yeah, that's exactly correct. Yeah, sorry. So this is going to track the open P and L for the position. You're not like, I'm sorry. I thought I read a cash and sweep cash and sweep won't change cash and sweep will show that you paid 38.22k. And that's it. That's the money that went out. You're not going to see anything else. Wheel stretch shows says I was factoring the role only I did the math wrong anyway. Yeah, and that's that's completely okay. I just want to make sure that you were following like the the actual math in how it looks. I honestly couldn't possibly care less. If your original attempt was right or wrong, I just want to make sure you understand the delta that's all. You took a shot, which is fine. Cool. The summary for this little case study is rolling is not magic. Rolling is just a series of trades and it's very, very easy to track your roles. I have calculators that I've built. I've walked you guys through building your own or tracking roles. I have one that I built that literally does calls or puts. Let me see if I can",
    "start_timestamp_seconds": 1829.6,
    "end_timestamp_seconds": 1915.6,
    "start_timestamp": "30:29",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=1829",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "is just a series of trades and it's very, very easy to track your roles. I have calculators that I've built. I've walked you guys through building your own or tracking roles. I have one that I built that literally does calls or puts. Let me see if I can open up the workbook now without this thing freaking out. It's in here somewhere. Yeah, this one. So I built this calculator, which is available to all the pro members. And the way that I built this calculator is to be agnostic of calls or puts. All of the requisite formulas are built off of if you put a C or a P next year option. That's all. And then the premium will calculate as it should, whether you bought or sold. But building your own little calculator like this is just a good general exercise, just helpful for you to understand the economics of a role a little bit better. So anyways, that's that good case study good reminder roles are just roles. There's nothing magical about them. Okay, let's talk about the fed because there's two things that really stuck out. The first thing was the overall reception was actually way less hawkish than people were expecting, which I actually don't know where that comes from because I don't feel or believe that Powell has been like excessively hawkish or anything. I don't actually see that. I just see that he's been slower to move and react, especially",
    "start_timestamp_seconds": 1903.6,
    "end_timestamp_seconds": 2008.6,
    "start_timestamp": "31:43",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=1903",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "was actually way less hawkish than people were expecting, which I actually don't know where that comes from because I don't feel or believe that Powell has been like excessively hawkish or anything. I don't actually see that. I just see that he's been slower to move and react, especially compared to what Trump wants. And we already know that Trump is in the process of finding Powell's replacement. I think what for next year. And interesting from that lunch is because I don't really see it that way. But this is the more important thing. The fed noted that it's purchasing 40 billion of T bills to rebuild its reserves after its roll off. That's actually good to see. I've been able to provide general market liquidity and it is going to overall positively impact the perception and the operation of the fed. I think when we take a look at what that means going forward, specifically the view that I typically like. We don't get a probability of a cut until April of next year. And even that is not super high just yet. The primary probability of a cut is on 17 June. Also a lot of alarms going off outside my house right now. Like a lot of fire trucks, which is making me a little. Not cool. Let me once I put me just text mellow and see if she can see what the fuck that is. And you see what those fire trucks are",
    "start_timestamp_seconds": 1990.6,
    "end_timestamp_seconds": 2086.6,
    "start_timestamp": "33:10",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=1990",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "alarms going off outside my house right now. Like a lot of fire trucks, which is making me a little. Not cool. Let me once I put me just text mellow and see if she can see what the fuck that is. And you see what those fire trucks are going. Mostly just making sure that I don't need to be doing something right now instead of streaming. They sound close. Anyways, until I find that out. I think the market here will be pretty stable going forward, at least for the near term. The cut itself was really interesting and it led to as I've discussed and exceedingly easy trade opportunity. Now, this kind of trade opportunity you do have to front run it slightly. But if we take a look at price activity on the day, this was another really easy trade for me. All I did on the day. You can see where Powell speaks. This is specific time 1100. All I did was right before. It was literally like five minutes before. I entered long Russell futures. I placed a stop below this little consolidation zone. So I ended up getting in for like 2532 ish. And then the stop goes down here. I like I think it was like 2550 or I was at. It's a very low risk trade against the opportunity that I'm expecting if we get the move. So if we plot this move from where I got stopped out, which was",
    "start_timestamp_seconds": 2072.6,
    "end_timestamp_seconds": 2184.6,
    "start_timestamp": "34:32",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=2072",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "And then the stop goes down here. I like I think it was like 2550 or I was at. It's a very low risk trade against the opportunity that I'm expecting if we get the move. So if we plot this move from where I got stopped out, which was here, that's one and a half percent in what? Two, well, 90 minutes less than two hours. And as always with futures, there's good leverage. The only reason why I was keeping a really, really close eye on this specific trade is something I've talked about in the market prep streams for the pro members and stuff. But coming into this fed. The rate statement, the probabilities were skewed enough. It was just yesterday when we looked at the probabilities and it was like 88 against 12. There was still a 12% probability for no cut yesterday after the close. That is a big discrepancy in expectation less than 24 hours from when the release is going to happen. That is absolutely enough of a discrepancy in market opinion and positioning that I absolutely anticipated if the rate cut happened, which was my broader expectation. There would be at least a near term price appreciation and it would be led primarily in the Russell. Okay, so Mel hooked me up. There's a fire at 400. Where is that? Okay, so it's close but not that close. So it's all that people just go into the fire. Any questions on that",
    "start_timestamp_seconds": 2169.6,
    "end_timestamp_seconds": 2291.6,
    "start_timestamp": "36:09",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=2169",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "a near term price appreciation and it would be led primarily in the Russell. Okay, so Mel hooked me up. There's a fire at 400. Where is that? Okay, so it's close but not that close. So it's all that people just go into the fire. Any questions on that trade, what the idea was the way I managed it, anything like that? Super easy. There was nothing again. This is almost like the RGTI that I ran. Not that long ago and I did a video that came out on Tuesday on it. These are some of the more simplistic ideas. There's not really some sort of expansive research that goes into these kinds of ideas. I think people know a lot of my ideas have a ton of research. This one doesn't. This one's backed on just more qualitative understanding of positioning. The market's potential to price things in ahead of time and then using the variance between what was expected as of last night for today as a queue that this is probably going to be a little more aggressive of a move when the Fed rate cut happened versus if it didn't. Kirk says, do you place it on the release or when Powell started talking? I just was talking you guys about that. It was like five minutes before the before 11 so before it even came up. Like I said, for these ones, I find that you typically have to front run slightly. I",
    "start_timestamp_seconds": 2262.6,
    "end_timestamp_seconds": 2367.6,
    "start_timestamp": "37:42",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=2262",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "place it on the release or when Powell started talking? I just was talking you guys about that. It was like five minutes before the before 11 so before it even came up. Like I said, for these ones, I find that you typically have to front run slightly. I did not expect the move to happen at 11.45 like the big move. I actually thought it was going to be mostly done around here when they heard the top line number. It wasn't until the market heard the top line numbers, some of the forward projections and then also the T-bills that we saw the rest of the move. But all of this was done ahead of time because my expectation was that the majority of the move is going to happen here, which was partially wrong. It didn't happen until a few candles later. Kirk says release as 11, Powell was 11, 30, so you front run the whole thing exactly correct. It was exactly what I was just describing. My expectation was the front line number was probably going to move things a little bit more, which again, objectively didn't happen because if I take a look at this total range, this is 0.92% maybe it did. And then what's the residual here? 1.04. So it was about 50 50. But yeah, so it definitely did not behave exactly as I expected. It took a little bit longer and some of it was based on when Powell",
    "start_timestamp_seconds": 2350.6,
    "end_timestamp_seconds": 2424.6,
    "start_timestamp": "39:10",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=2350",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "at this total range, this is 0.92% maybe it did. And then what's the residual here? 1.04. So it was about 50 50. But yeah, so it definitely did not behave exactly as I expected. It took a little bit longer and some of it was based on when Powell started coming out. I think that's the exact same thing. I feel like a blind man every time you describe what you see in the markets. Could you explain that a little bit more? I'm actually very, very curious what you mean by that. Is it in terms of not seeing what I saw or was it not having the idea going into this release specifically? I'm super, super curious what you mean? Because this one, I genuinely think is an easier idea to wrap your mind around, especially with respect to like catalysts and stuff. So if you give me an idea of if it's just that you didn't have an, like I'm curious if you didn't have an expectation around the release. ZX says not being able to tie in a rate cut expectation to say concrete index like Russell. Okay, yes, so that's just base knowledge. The way and we've actually talked about this a lot through all of the Fed rate cuts. So that's just a gap in base knowledge. The concept there for context is that small caps are going to be more rate sensitive and that's why I go to Russell that's literally it.",
    "start_timestamp_seconds": 2404.6,
    "end_timestamp_seconds": 2513.6,
    "start_timestamp": "40:04",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=2404",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "way and we've actually talked about this a lot through all of the Fed rate cuts. So that's just a gap in base knowledge. The concept there for context is that small caps are going to be more rate sensitive and that's why I go to Russell that's literally it. Now the paradigm can always shift. There is a little bit of like regime overlay that you need to apply, but generally speaking 85% of the time if you go in with that general idea that the small cap stocks are going to be more sensitive to rate changes. You're pretty good. Because they don't have the same purchasing power a lot of those companies are actually going to be really really susceptible to what lending rates are and then if that paradigm eases a little bit that actually positions them like quite well to benefit. So yeah, that's literally it. I wouldn't think anything about. That like that's just one of the now that you know that you'll know that is the kind of way to think about that. All right. Let's pivot now. Oh, let me take a pause. Are there any questions on the the Fed anything there before I pivot and we take a look at game stop earnings, which. I think it's a very good thing to be really really mixed in terms of the general response. What do you guys, what do you guys think? Oh, good. All right. All right. I'll take that",
    "start_timestamp_seconds": 2502.6,
    "end_timestamp_seconds": 2611.6,
    "start_timestamp": "41:42",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=2502",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "there before I pivot and we take a look at game stop earnings, which. I think it's a very good thing to be really really mixed in terms of the general response. What do you guys, what do you guys think? Oh, good. All right. All right. I'll take that as in all good for now. Let's talk about game stop. Game stop had a interesting earnings release generally fell in line with what I would expect to see the market move in response to its earnings. I actually think was a little more mild than I would have anticipated. It opened down like 6% that was more aggressive. But we're ended up closing was down only 4%. That's about the move that I would have expected to see on the beginning part of the day. So overall it closed a little more mild than I would have expected based on that open. A lot of people are confused as usual because it did have decent earnings 24 cents a share and I talked a little bit about this not that long ago. I think one of the primary things to keep in mind is the way that this thing made money the other thing that I do want to talk about is. The well two things I want to talk about my my position in it, but then I also want to talk about some of the call volume, which is really really interesting to me, but let's get",
    "start_timestamp_seconds": 2575.6,
    "end_timestamp_seconds": 2685.6,
    "start_timestamp": "42:55",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=2575",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "made money the other thing that I do want to talk about is. The well two things I want to talk about my my position in it, but then I also want to talk about some of the call volume, which is really really interesting to me, but let's get through the highlights from its earnings as usual. You don't get much which I have to be honest from an investor lens, I never like that like I really never like that. I always want them to give me a little bit more information than what they're actually giving me. They don't even like build a deck like most other companies that you can read through understand what's going on their pipeline they're very, very closed off and that's just Ryan Cohen's approach that's like the RC special which is what it is right you kind of I just accept that or what it is. But sales came in 821 million super soft that's very soft. Year over year that's down from 860 million that's not an insignificant drop that is actually what I consider to be a quite profound drop. Unfortunately, but that that is absolutely not in insignificant move by any means. The other thing I have a couple notes I got to open up. My other file. The other thing that I want to point out. We'll go through the thing itself, but I want to specifically talk about some of the rate statement. A G36 says",
    "start_timestamp_seconds": 2674.6,
    "end_timestamp_seconds": 2792.6,
    "start_timestamp": "44:34",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=2674",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "move by any means. The other thing I have a couple notes I got to open up. My other file. The other thing that I want to point out. We'll go through the thing itself, but I want to specifically talk about some of the rate statement. A G36 says unless they start posting growth numbers or guidance investors are not going to pile in their sales have been on a downward trajectory for last four to five sticking to the point in the it it's sticking it's a sticking point in the turnaround narrative I completely agree literally couldn't agree more. And it's because as we talked about the revenue expectations it was what 980 million to a billion. Which is just really really far off and again like the biggest comparison regardless of expectations was the year over year drop that is what it was. The EPS estimate was 18 cents to 20 cents and that they did a good job unfortunately the diluted EPS was 13 cents. So they were below on the gap expectations as compared to just base EPS. The other stuff that stuck out to me so that's you know 4.6% drop in sales gross profit was 273 million versus 257 and gross margin was 33% against 29 9 so the margin improvements are good. Despite the top line coming down so that's a little bit of a softening move that's good to see. It's. We still would rather see top line expansion but",
    "start_timestamp_seconds": 2769.6,
    "end_timestamp_seconds": 2889.6,
    "start_timestamp": "46:09",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=2769",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "gross profit was 273 million versus 257 and gross margin was 33% against 29 9 so the margin improvements are good. Despite the top line coming down so that's a little bit of a softening move that's good to see. It's. We still would rather see top line expansion but the fact that they were able to navigate the the margining side of it that's still overall would consider positive. This year was 22.4 mil versus 282 so a lot of that is just cost cutting which is good. They need to do that store based head count overhead all of that stuff needs to continue to come down for the business in order to eventually hopefully turn a profitable corner and begin. Whatever this pivot is that like that that's the biggest things we really don't know the operating income was 41.3 mil versus an operating loss over the prior year of 33.4. That is a huge change based on their operating income footprint but if you take a look as always a big part of their movement is from net interest income. So their cash and treasury which is what like 49 million interest on income net. I mean yeah and the other thing though is mark to market it's Bitcoin assets are down $9.2 million which is again another thing I talked about with respect to pivoting into Bitcoin as a treasury tool it's hard for me. To look at what they did with Bitcoin and think",
    "start_timestamp_seconds": 2858.6,
    "end_timestamp_seconds": 2976.6,
    "start_timestamp": "47:38",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=2858",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "mean yeah and the other thing though is mark to market it's Bitcoin assets are down $9.2 million which is again another thing I talked about with respect to pivoting into Bitcoin as a treasury tool it's hard for me. To look at what they did with Bitcoin and think of it as anything other than some sort of directional. Some sort of directional expectation because it's like Bitcoin is not stable it's not something that most companies hold on their books for a stable cash source. The reason why that matters to me is because I originally understood them raising a bunch of money so that they have capital in order to I was assuming some sort of big transition in acquisition something or series of acquisition something which still hasn't happened. Besides that. Moving your capital into Bitcoin something that we know the annual volatility is absolutely massive 70.5% total range over the last year. It's incredible. That's not something that like that's not cash your earmarking for a deal that is in investment that is you taking a bet on Bitcoin and again like that bet is it's completely fine. To speculate on Bitcoin to some direction that's completely fine but the issue is where we sit now and the recent price performance of Bitcoin which unfortunately ain't that good. Let's talk a little bit more. I want to talk about two things. The first thing is what we think Bitcoin is going to do is actually",
    "start_timestamp_seconds": 2954.6,
    "end_timestamp_seconds": 3088.6,
    "start_timestamp": "49:14",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=2954",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "that's completely fine but the issue is where we sit now and the recent price performance of Bitcoin which unfortunately ain't that good. Let's talk a little bit more. I want to talk about two things. The first thing is what we think Bitcoin is going to do is actually a really important part of how you feel about game stop again from an investor lens from a trader lens which is my dynamic. We're going to have a completely different conversation because from a trader lens what's going on in game stop directionally I have to be honest. I don't care at all it makes absolutely no difference to me or what I'm doing literally at all and I'll explain how and why in just a moment. TCM says that net income is also short 42 million due to an accounting interest expense line for warrants and no holders. Which is also a great point. Thank you for for bringing that up. Let's talk about volatility in. My position is the same as it's been which is the coverage triangle. I'm not trading it directionally right now with options. I still always have that on my playbook. I don't think that it's a good thing. I'm not trading it. I don't think that they do. And today I actually changed out some of my existing positions. I had the 22 puts that were expiring on 19. I took those down. For a 34% max profit really wasn't in insane",
    "start_timestamp_seconds": 3058.6,
    "end_timestamp_seconds": 3179.6,
    "start_timestamp": "50:58",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=3058",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "think that it's a good thing. I'm not trading it. I don't think that they do. And today I actually changed out some of my existing positions. I had the 22 puts that were expiring on 19. I took those down. For a 34% max profit really wasn't in insane amount. But that obviously has everything to do with this drop. Telling that It's bannering like I said 90 needs that was exposing myself Cleossenf to earnings bull. And then the call side those obviously crashed I had the 24 calls sold those for dollar one on the fourth of November for n and those came down for 19 cents. And that's for this exact reason. That's also one of the things I wanna remind you guys in terms of total impact to the position because let's talk about what those options did for me in this scenario. The underlying went from, let's call it, what was it here? Like we'll just call it 23. So the underlying went from 23 to 22. Right now it's at 22, 12, but we'll just call it 22. We dropped the dollar. What that means is if you have 100 shares, it means you lost $100. Just in terms of unrealized loss right now. The short puts, again, the short puts were sold for 87. And then they were closed for 57. So those made me 30 cents, that offset 30 cents of this dollar. And then the call side was a dollar",
    "start_timestamp_seconds": 3158.6,
    "end_timestamp_seconds": 3278.5,
    "start_timestamp": "52:38",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=3158",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "you lost $100. Just in terms of unrealized loss right now. The short puts, again, the short puts were sold for 87. And then they were closed for 57. So those made me 30 cents, that offset 30 cents of this dollar. And then the call side was a dollar one and down at 19. So what I'm showing you is that by using options in something like this around my base position, I'm actually, I'm positioning myself a little more successfully because my net with both of these. So this is what, 82 cents. This is 82 cents that I made. This is 30 cents that I made. So that gives me a dollar 12. My stock position went down from this point by a dollar. My options went up by a dollar 12. My net is positive 12. 12. Again, we're not, this isn't ton of money at all. But when you multiply this out across lots sizes and stuff, it's also not insignificant. This is a key point with respect to trading something like game stop with options. It's literally to capture this kind of volatility, which is still not insignificant. I will say, the ball is getting definitely less interesting, unfortunately, ball right now is at 60%, which implied volatility percentile on that is 4%. So ball itself is very, very low. And with all that low, it's still pretty good return. So for example, the annualized return on an invested capital for the new puts",
    "start_timestamp_seconds": 3248.46,
    "end_timestamp_seconds": 3405.02,
    "start_timestamp": "54:08",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=3248",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "getting definitely less interesting, unfortunately, ball right now is at 60%, which implied volatility percentile on that is 4%. So ball itself is very, very low. And with all that low, it's still pretty good return. So for example, the annualized return on an invested capital for the new puts that I sold at the 21s is still 32.41%. Not bad, not bad at all. There's something in, again, this thing's general scenario. So I'm actually quite stoked on that. I think that that is a really good return for something that's been trading at the low end of its range for some time, which is really easy to make good money. So on the year, game stop opened at what? 3184. So on the year, game stop is down like a lot. Let's go to year to date. Year to date, game stop is down 30.5%. That's a tough year. However, the coverage triangle right now is up 22%. So what that means is the coverage triangle versus a position in the underlying on the year is up, it's beating it by 50.8%. The coverage triangle is outperforming an equity position from over the course of the year by over 50%. And it's because of the ability to navigate a lot of stuff like this. It's just how it goes. Now, the volatility skew in here we do need to talk about. If we take a look at the 16 Jan expiration where I'm at, the 32 delta puts",
    "start_timestamp_seconds": 3378.06,
    "end_timestamp_seconds": 3502.14,
    "start_timestamp": "56:18",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=3378",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "over 50%. And it's because of the ability to navigate a lot of stuff like this. It's just how it goes. Now, the volatility skew in here we do need to talk about. If we take a look at the 16 Jan expiration where I'm at, the 32 delta puts are giving me 43% vol. And the 34's and the 27's again using the midpoint. There is like a proxy or where the 32 is delta would be is like 51% in change. That's call skew. That is super interesting. The fact that game stop is down as far as it is, but it's still maintaining call skew. That is that strong relative is kind of incredible to me, like legitimately, kind of incredible. What that led me to do was just stroll through the option chain and see what I see because the OI skew is really heavily oriented towards the calls. The call skew is still elevated for anything about the money so around the money. And there's also a bunch of these little kinks, which is always an important note. And if we look at the strikes that are closer to just being like right around the money, so we'll do like plus or minus 10, so that this is in skewed quite as bad. Take a look. There's heavy, heavy call skew. So the market is actually like is clearly expecting an up move. Like that's exactly what this tells me. It's not expecting some sort",
    "start_timestamp_seconds": 3483.1,
    "end_timestamp_seconds": 3601.14,
    "start_timestamp": "58:03",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=3483",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "money, so we'll do like plus or minus 10, so that this is in skewed quite as bad. Take a look. There's heavy, heavy call skew. So the market is actually like is clearly expecting an up move. Like that's exactly what this tells me. It's not expecting some sort of massive up move, but it is absolutely expecting a higher probability of being up, but just not necessarily in insane amount. And I can corroborate this. If I stroll through the options chain a little bit, there's two things that really stuck out to me over the last couple of days. If I can get to a game stop. This call activity is actually very, very anomalous for these many calls being sold. This is I actually think partly coming from the income ETFs that are using the volume game stop. What that means is there's going to be indiscriminate sellers of all for these different kind of income ETFs income oriented ETFs. That unfortunately is going to bid down. The overall volatility, which I think is part of what we're seeing so far. We're just seeing pretty strong short calls being sold against. And I think a lot of it is coming from these different funds. There was some really interesting activity out at the tales. I show you guys, I don't know if I want to show you. It's even further than the, I might just have to go into the options. If they need more strength.",
    "start_timestamp_seconds": 3581.98,
    "end_timestamp_seconds": 3720.82,
    "start_timestamp": "59:41",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=3581",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "of it is coming from these different funds. There was some really interesting activity out at the tales. I show you guys, I don't know if I want to show you. It's even further than the, I might just have to go into the options. If they need more strength. What the fuck? And doing. Oh, that's why. And take a look at these. The 25s. The 25s had a 6000 change in their OI. Their prior volume was 453. OI 6330. So a really, really significant, really, really significant change here. So let's take a look at these. I'm going to pop the door for Thor. So the reason why these matter a lot to me is because I'm trying to understand what's the directional tilt. Like what do I think the directional tilt is for these first. The second thing is I want to get a sense of pricing. And you can see that the overwhelming directional tilt for those 25s 43 days out is short, which also corroborates my broader idea that we're starting to see more and more ingestion of these systematic selling. Now, one thing I want to be explicitly clear, especially to the game stop crowd, that's very, very sensitive to like selling, naked shorting and stuff like that, is that this selling in the options chain doesn't really impact stuff too much. If anything, it kind of helps a little bit because the hedging behavior on the other side will be to buy",
    "start_timestamp_seconds": 3686.18,
    "end_timestamp_seconds": 3846.02,
    "start_timestamp": "01:01:26",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=3686",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "stop crowd, that's very, very sensitive to like selling, naked shorting and stuff like that, is that this selling in the options chain doesn't really impact stuff too much. If anything, it kind of helps a little bit because the hedging behavior on the other side will be to buy some shares or just to generally offset deltas to the upside. So it'll balance out in the underlying a little bit. But most of the call activity that I see going on in here is switched. Or almost like, I would say a month, but probably a couple months to more of a short lean. And I don't think it's because of like directional downside playing. It absolutely think it is just because they're expecting to capture the vol. That's what I'm seeing. So that's the latest that I have on GameStop. If you guys have any specific questions on that, let me know. I am happy to take a closer look at any of it, but that's what I'm seeing at least in the near term for it. Yeah, a bit of a bummer, but it's still making money. Like that's the way that I look at it, is it still making money? Zaddy says, do you feel in an impending bone comb? I don't write now, that's for sure. We know it can happen at any time, but yeah, I don't see anything right now that would lead me to believe that the main areas that I'm watching",
    "start_timestamp_seconds": 3827.42,
    "end_timestamp_seconds": 3938.42,
    "start_timestamp": "01:03:47",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=3827",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "it still making money? Zaddy says, do you feel in an impending bone comb? I don't write now, that's for sure. We know it can happen at any time, but yeah, I don't see anything right now that would lead me to believe that the main areas that I'm watching are this new consolidation range. So like this 23 handle almost 24. And then now the 19 handle to the downside. Because if you zoom in on this overall trend, like a shorter term trend, it's definitely in a decline, and it's in a firm downtrend. So what's really, really important here is if it does make its way back to like the 19, the 20 slash the 19 handle, which I have to be honest, wouldn't surprise me in the least, which is also why I did not buy more shares today. One of the things that I was looking at when I was trying to figure out what exposure that I wanted to gain in gamestop, or like reconfigure with the coverage triangle, whether I wanted to gain exposure via the short puts or long equity, a lot of times I liked the long equity in gamestop, because it gives me the upside, and then also because of the call skew. But the downside to that is at least in the very near term, I actually think I'll be able to get gamestop cheaper because this overall down move, I wouldn't be surprised at all if it continues",
    "start_timestamp_seconds": 3915.3,
    "end_timestamp_seconds": 4012.22,
    "start_timestamp": "01:05:15",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=3915",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "it gives me the upside, and then also because of the call skew. But the downside to that is at least in the very near term, I actually think I'll be able to get gamestop cheaper because this overall down move, I wouldn't be surprised at all if it continues more to the downside, despite the update, sometimes those are people kind of playing games. And I absolutely believe that that could be part of what's going on here. It needs to hold that 20 handle though, because if it starts consolidating on that 20 handle, that actually I think will be great. That'll be a time at least for me to scoop up some more shares, continue trading more options on it, like net net awesome. If it doesn't do that though, and it starts to continue down, I have to favor than a continuation of that trend. My biggest hope is that, and I said this literally for the last couple or any cycles, my biggest hope is that Cohen will come out with fucking something, hopefully soon about what they're doing with that cash, and I'm really, really hopeful that he's cooking up something awesome because at the end of the day, I've said this before, I think right now for the GameStop holders, the main thing that you are buying is exposure to Cohen and maybe the cat, if he comes back, and if you trade when the cat does come back, those are like the",
    "start_timestamp_seconds": 3994.38,
    "end_timestamp_seconds": 4091.18,
    "start_timestamp": "01:06:34",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=3994",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "the end of the day, I've said this before, I think right now for the GameStop holders, the main thing that you are buying is exposure to Cohen and maybe the cat, if he comes back, and if you trade when the cat does come back, those are like the two main catalysts you have, whatever stuff, Cohen thinks up. And hopefully it's something really good because the company needs it, it has the resources to do it, but it just needs to do it, because it has been holding cash in my opinion for far too long now. You, unfortunately, even though it's getting interest on that money, the interest is going to contract as rates continue to come down, it's not gonna be that impressive. They're not a bank, they're not meant to hold cash in lend cash, they're meant to do something as a business. And I'm really, really eager to see what Cohen has in mind for that, because he's doing stuff, right? Like they did the trade in anything which is a great media opportunity because people were being fine and bringing in all sorts of random ass shit, somebody brought his dog in, which is hilarious. That's like good media buzz. So they have a lot of good branding, which is useful for just about any business. And the other thing that's worth noting is that a lot of companies are buying things that are adjacent, but then also completely not adjacent to their",
    "start_timestamp_seconds": 4072.9,
    "end_timestamp_seconds": 4162.74,
    "start_timestamp": "01:07:52",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=4072",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "is hilarious. That's like good media buzz. So they have a lot of good branding, which is useful for just about any business. And the other thing that's worth noting is that a lot of companies are buying things that are adjacent, but then also completely not adjacent to their industry. So I think there's a very real possibility that they could pivot to just something completely different as a big part or a minor part of their business. I don't know if they're trying to scoop up a couple things or one thing and all of this is still on the context of expectation of some sort of acquisition, which might not be what they're thinking at all. But I think in general, that's what you kind of have to think at least as of this point. And my hope is that we'll see come of that, some of that come to fruition. So that wraps me up for this evening, ladies and gentlemen. Tomorrow we have the Outlier Pro's skilled development live stream at five. We're gonna build out our trading skill set as usual. Friday, we have the new Beginners Lab that will go off at 5 p.m. And then Saturday, we have the new Pro Plus Think Tank Streams, which are designed to take a closer look at like the analysis side of trading and what I do and looking at the more boring stuff, but really the stuff that generates the returns that we wanna",
    "start_timestamp_seconds": 4147.38,
    "end_timestamp_seconds": 4240.62,
    "start_timestamp": "01:09:07",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=4147",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 4247.0
  },
  {
    "video_id": "Hkb0O9P5zf0",
    "title": "FOMC & GME Earnings | Live Stock Market Analysis",
    "text": "p.m. And then Saturday, we have the new Pro Plus Think Tank Streams, which are designed to take a closer look at like the analysis side of trading and what I do and looking at the more boring stuff, but really the stuff that generates the returns that we wanna see. Be in Outlier, let's see you guys later.",
    "start_timestamp_seconds": 4220.06,
    "end_timestamp_seconds": 4241.94,
    "start_timestamp": "01:10:20",
    "video_url": "https://www.youtube.com/watch?v=Hkb0O9P5zf0",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Hkb0O9P5zf0&t=4220",
    "chunk_index": 44,
    "word_count": 59,
    "upload_date": null,
    "duration": 4247.0
  }
]