[
  {
    "text": "GME options chain is showing some signs of life, but not in the way that I was expecting to see. So what happened today? Well, it was down a little bit about 2.2. We are not making the movement I was hoping to see, which is a little bit more of a continuation to the upside here. It looks like we are starting to sell off more into this value area, which I was hopeful that we might start taking back up above this point of control people transacting in. And if we take a look at the volume today, it's still quite anemic, but the overwhelming majority has sell volume 93. So there's a couple of things going on here. The main thing I'm seeing from a volume perspective, though, is just less activity in GameStop. Now, what I thought was interesting today was what was going on in the options chain. So if we take a peek over here, a couple of things jump out of me, the first one. Take a look at the open interest. It's changed massively now. It's already at 604,000 calls to 360,000 puts. So we are approximating much closer to at least the two to one ratio that I tend to see before these things start getting really active specifically to the upside. Now, the other thing I noticed right from the jump is a pretty healthy split in explorations for the calls and the puts. Here's what I mean by that.",
    "metadata": {
      "video_id": "HpuG8zJ193E",
      "title": "GME Put Option Activity",
      "url": "https://www.youtube.com/watch?v=HpuG8zJ193E",
      "upload_date": "",
      "duration": 704.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=HpuG8zJ193E&t=0"
    }
  },
  {
    "text": "the two to one ratio that I tend to see before these things start getting really active specifically to the upside. Now, the other thing I noticed right from the jump is a pretty healthy split in explorations for the calls and the puts. Here's what I mean by that. If you take a look at these calls, you'll notice that the larger contracts are in 16og. Right? That's what these boxes that are higher up on this list indicate a higher open interest. So we can see that the 125s are really heavy. We can see that these 30s are heavy and so on and so forth. The majority of the heavier calls are out here in 16og as indicated by there being the same color box. They really make this stuff pretty much idiot proofer. People like me that like shapes and colors and they do a great job making it pretty easy to see what's going on here. But then if you take a look over here, it's a completely different story, isn't it? When I look at the open interest, I see a massive block up here, 17 Jan 2025, the 10 puts, 16,810 of those. Then I see a bunch of stuff out here in 16og. Then I see another one here out in 18og 24, back to 17 Jan 25. So what I'm highlighting is that there's quite a bit of activity on the put side that spans a bunch of different explorations. We",
    "metadata": {
      "video_id": "HpuG8zJ193E",
      "title": "GME Put Option Activity",
      "url": "https://www.youtube.com/watch?v=HpuG8zJ193E",
      "upload_date": "",
      "duration": 704.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 10,
      "start_timestamp": "00:01:09",
      "start_timestamp_seconds": 69.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=HpuG8zJ193E&t=69"
    }
  },
  {
    "text": "Then I see a bunch of stuff out here in 16og. Then I see another one here out in 18og 24, back to 17 Jan 25. So what I'm highlighting is that there's quite a bit of activity on the put side that spans a bunch of different explorations. We don't necessarily see the same level of disparity between expiration cycles on the call side. Interesting. Next, volume for today. This stuck out like a sore thumb on the put side. On the put side up here, I can see for nineog 24, the 22s, there was 5,000 of those that traded. That immediately is something I'm interested in. I also see a pretty healthy block for this coming expiration cycle, which is pretty standard fair for what I tend to see in GameStop where the front expiration tends to be pretty busy. So nothing really sticking out there to me. Same thing with this, the 16og 24, I fully anticipate to see more and more activity, essentially in this front expiration cycle, the twoog and then the 16og. That all about what I expect to see. Now as I start looking in at kind of the distribution within this dense area, and I can get a sense of what's transacting where how busy these different expiration cycles are, but then you start going out here, and you notice an interesting trend. I see the one tens, the one 15s, the 120s and the 125s being relatively busy out here",
    "metadata": {
      "video_id": "HpuG8zJ193E",
      "title": "GME Put Option Activity",
      "url": "https://www.youtube.com/watch?v=HpuG8zJ193E",
      "upload_date": "",
      "duration": 704.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 10,
      "start_timestamp": "00:02:18",
      "start_timestamp_seconds": 138.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=HpuG8zJ193E&t=138"
    }
  },
  {
    "text": "dense area, and I can get a sense of what's transacting where how busy these different expiration cycles are, but then you start going out here, and you notice an interesting trend. I see the one tens, the one 15s, the 120s and the 125s being relatively busy out here in 16 Jan 26. Now I also notice it a little bit on the call side though. So this can be setting up smaller trades, looking at things like spreads between the call on the put side, it could be. We don't know yet, we have to take a look. So then what I like to do is say, okay, first thing I want to take a look at is these nineog 22s because that's a lot on the put side. And then on the call side, this does not surprise me to see the twoogs getting really, really active. This is essentially what I anticipated seeing. We're seeing build out of all of these closer to the money strikes, which is kind of what we've talked about before. No surprise coming in here. Now as I mentioned though, on the put side, this is kind of interesting to me. This position built out nineog at the 22s. So if we pop over there nineog at the 22s, we can see this is interesting. And it's interesting because the open interest existing was 363, except the volume today was five, 1,000. That's a really great alert. That something is going",
    "metadata": {
      "video_id": "HpuG8zJ193E",
      "title": "GME Put Option Activity",
      "url": "https://www.youtube.com/watch?v=HpuG8zJ193E",
      "upload_date": "",
      "duration": 704.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 10,
      "start_timestamp": "00:03:45",
      "start_timestamp_seconds": 225.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=HpuG8zJ193E&t=225"
    }
  },
  {
    "text": "This position built out nineog at the 22s. So if we pop over there nineog at the 22s, we can see this is interesting. And it's interesting because the open interest existing was 363, except the volume today was five, 1,000. That's a really great alert. That something is going on. Don't really know what yet takes a little more digging to find out. But when you see instances where the current open interest is so low and the volume is so high, somebody's interested in this at this level for a very specific reason. There's only 11 days out and we definitely want to see what this transaction was, whether we bought or sold on those. So we can come in here into time and sales and they're right there. So you can see there's 526 of them at the nineog 22 puts. And these came in at 30, so these were bought. Now we can get even more specific by grabbing just the put side. We can go specifically to that nineog series. We can go specifically to the 22s, where that activity was and see how active this series was and take a look. Bye, bye, bye, bye, bye, bye, bye, bye, bye, bye, bye, bye, baby. That's essentially what there's people just piling on long puts. That's what this is, massive amount of long puts being piled on. And these all flow through pretty similar time. Notice that 0, 8, 36, 31 seconds, all of them",
    "metadata": {
      "video_id": "HpuG8zJ193E",
      "title": "GME Put Option Activity",
      "url": "https://www.youtube.com/watch?v=HpuG8zJ193E",
      "upload_date": "",
      "duration": 704.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 10,
      "start_timestamp": "00:04:57",
      "start_timestamp_seconds": 297.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=HpuG8zJ193E&t=297"
    }
  },
  {
    "text": "bye, bye, bye, bye, bye, bye, bye, bye, bye, baby. That's essentially what there's people just piling on long puts. That's what this is, massive amount of long puts being piled on. And these all flow through pretty similar time. Notice that 0, 8, 36, 31 seconds, all of them dumped out. Some of them went to AMAC, some of them routed best, some C2s, just all over the place. All these different exchanges routing. So there's a pretty sizable position being built out via long puts in the nineog that's of interest to me. That's a bearish position. I want to keep an eye on that. I don't have a great sense of what it is yet, other than potentially just following this near term trend that we're seeing to the downside. Now the other thing that I noticed as I told you before, if we go back to OI, that there's a lot of this volume build out way out and far in time, 16 Jan 26, the 125s. I see the 120s active. I see the 115s active. These tail style puts are interesting to me. You can also see them happening over here. Super far out in time, super far out of the money, 125s. So there's been a lot of activity there. So we can also hone in on that for this one, I'll use unusual whales because it's a little easier to see. Here's the takeaway from my perspective on this at least. I",
    "metadata": {
      "video_id": "HpuG8zJ193E",
      "title": "GME Put Option Activity",
      "url": "https://www.youtube.com/watch?v=HpuG8zJ193E",
      "upload_date": "",
      "duration": 704.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 10,
      "start_timestamp": "00:06:18",
      "start_timestamp_seconds": 378.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=HpuG8zJ193E&t=378"
    }
  },
  {
    "text": "in time, super far out of the money, 125s. So there's been a lot of activity there. So we can also hone in on that for this one, I'll use unusual whales because it's a little easier to see. Here's the takeaway from my perspective on this at least. I see a giant mix of bids coming in, pretty small sizes, 15, 10s, a lot of tens, and they're hitting the 115s, the 125s and the 120s. So these traits aren't necessarily massive, but there's a lot of repeat positions. And you can see that again, like I for GameStop, I've calibrated my initial interest in premium to be about six figures. That's where I start to get pretty curious. And then when I see repeat hits like this, I'm also curious, I wanna keep an eye on these. Now these are still relatively small. And the other thing that you can see is that there are some asks at the same sizes and the same strikes. So some of these can almost be calendarized because you can see, for example, here, these 120s are in 2025. And then you can see 120s here, same expiration cycle, same strike, essentially same time, right, 093859 versus 57. That starts to look like a spread that was liked into to me. So some of this looks like a spread being built. Some of this doesn't look like that, but there are instances like this again here. This looks like a spread being",
    "metadata": {
      "video_id": "HpuG8zJ193E",
      "title": "GME Put Option Activity",
      "url": "https://www.youtube.com/watch?v=HpuG8zJ193E",
      "upload_date": "",
      "duration": 704.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 10,
      "start_timestamp": "00:07:25",
      "start_timestamp_seconds": 445.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=HpuG8zJ193E&t=445"
    }
  },
  {
    "text": "same time, right, 093859 versus 57. That starts to look like a spread that was liked into to me. So some of this looks like a spread being built. Some of this doesn't look like that, but there are instances like this again here. This looks like a spread being built. This came in at 101018, 101019. This was at the bid, this one's at the offer, 115, same expiration cycle. So there's a lot of different activities going on here, but the most interesting thing I'm finding right now is all of the busyness out in 2025, 2026. We have not seen this activity out that far to this degree. Since essentially I started looking at this more closely in May. So this is something I wanna keep an eye on. Now what's the takeaway from this? For me, in the way that I synthesize information is too early to tell. More over than that, these are so far out in time. I don't wanna say it doesn't matter, but it kinda doesn't matter yet. That's really part of what I see here. Now what I can say is that people that are selling puts at the 125 handle, the 120 handle, it's just an interesting position that's probably designed to do something very specific with an apportfolio. This doesn't necessarily look like a highly speculative position to me, because I do not think that people are selling these puts expecting GameStop to fly up and out of this.",
    "metadata": {
      "video_id": "HpuG8zJ193E",
      "title": "GME Put Option Activity",
      "url": "https://www.youtube.com/watch?v=HpuG8zJ193E",
      "upload_date": "",
      "duration": 704.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 10,
      "start_timestamp": "00:08:41",
      "start_timestamp_seconds": 521.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=HpuG8zJ193E&t=521"
    }
  },
  {
    "text": "the 120 handle, it's just an interesting position that's probably designed to do something very specific with an apportfolio. This doesn't necessarily look like a highly speculative position to me, because I do not think that people are selling these puts expecting GameStop to fly up and out of this. That they would make way more money if they use long calls than short puts for that. But if they wanna collect a little bit of positive theta, and if they have a little bit more stuff in the portfolio that they're looking to offset while still having some long deltas, there's a lot of different specific reasons why this position could be structured the way it is. But I wouldn't consider this a highly speculative trade, although there is speculation clearly going on here. This is a little bit more of what I would consider to be like an inside trade. These are smaller sizes, they're deep in the money, so the margin requirement on these positions is not gonna be insane. And yeah, I mean, we can take a quick look at those out in 16.26 here. And we can see where they're starting to get active, which again, it's just still not a tremendous amount of volume. There's decent volume, right? 77 and 86.50, there's decent volume, but it's not like crazy volume, anything that I would be shocked about, like none of these even exceed the existing open interest. So they look like interesting positions that",
    "metadata": {
      "video_id": "HpuG8zJ193E",
      "title": "GME Put Option Activity",
      "url": "https://www.youtube.com/watch?v=HpuG8zJ193E",
      "upload_date": "",
      "duration": 704.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 10,
      "start_timestamp": "00:09:44",
      "start_timestamp_seconds": 584.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=HpuG8zJ193E&t=584"
    }
  },
  {
    "text": "again, it's just still not a tremendous amount of volume. There's decent volume, right? 77 and 86.50, there's decent volume, but it's not like crazy volume, anything that I would be shocked about, like none of these even exceed the existing open interest. So they look like interesting positions that people are building out. Here, they could just be trying to capture this extrinsic value, capturing on a little bit of put skew, maybe be able to take in a little bit of these moves when they get price accommodation, but these aren't nearly as speculative as buying something like long calls. They won't make as much money in that scenario. They need a really big move before they would pay out pretty meaningfully. So the punchline here is, we will keep an eye on them. As always, if there's any questions, anything you want me to take a look at, send it to me. I'm happy to take a look. I'll see you guys on YouTube live later today, be an outlier. Catch you guys later.",
    "metadata": {
      "video_id": "HpuG8zJ193E",
      "title": "GME Put Option Activity",
      "url": "https://www.youtube.com/watch?v=HpuG8zJ193E",
      "upload_date": "",
      "duration": 704.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 10,
      "start_timestamp": "00:10:51",
      "start_timestamp_seconds": 651.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=HpuG8zJ193E&t=651"
    }
  }
]