[
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 58,
    "text": "you you you you you you you you you you you you you you you you What is up to all the outliers? I hope the week was awesome. And I know today's Valentine's Day, a day that I think is absolutely absurd. I think you should be nice to people throughout the entire year. But that aside, there is no better Valentine than making the decision to stop lighting your money on fire, trying to learn how to trade options and to actually make some money. So that maybe you could take your partner out to a nice dinner or maybe take them on a trip somewhere as compared to the usual light the money on fire and then go hang out in the Wendy's parking lot behind a dumpster. So I argue by attending today, you really are a romantic. That's what that, that's exactly what's happening right now. So the agenda for today is pretty straightforward. We're gonna take a look first at a quiz. We're gonna do a little bit of a recap from the last episode on volatility. And then we're gonna dive into the world of the Greeks. Now you can already see up behind me and this has been up for like five minutes now during the holding period. So hopefully everybody had a chance to take a look through what's up here now. And then also to take a look through those two videos that I've shared yesterday in the discord and",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=0"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 58,
    "text": "behind me and this has been up for like five minutes now during the holding period. So hopefully everybody had a chance to take a look through what's up here now. And then also to take a look through those two videos that I've shared yesterday in the discord and then also on X, if not, I will throw both of those videos in here now. This is actually reverse order by accident. So watch the second link first and then the first link. So the goal for our conversation around the Greeks today is to essentially be a hybrid, a blend between those two videos that I sent you. The second video goes through literally all of the Greeks, well, most of them that you would come into contact with. And it gives you the fundamental understanding of what they are. That the first video, which is the second one you should watch, gives you how to actually use the Greeks to fine tune your trades. So the session today is going to do a little bit of both. We're going to do a run through. I want to help you visualize how the Greeks behave in different time frames. And then I want to help you think about actually using them to make trading decisions. So let's get started with a quiz. So last time we spoke about volatility. So the first question here, what does IV measure? What does implied volatility measure? Feel free, just throw it",
    "start_timestamp_seconds": 401.1,
    "start_timestamp": "00:06:41",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=401"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 3,
    "total_chunks": 58,
    "text": "frames. And then I want to help you think about actually using them to make trading decisions. So let's get started with a quiz. So last time we spoke about volatility. So the first question here, what does IV measure? What does implied volatility measure? Feel free, just throw it in the chat. And if you're watching the recording, you can write it down, throw it as a comment, whatever you want. But give yourself an opportunity to actually see if you know it without looking it up first. Now, the reason why we spend a lot of time talking about the ins and outs of volatility is because volatility is essentially the heart and soul of options trading. Kevin says future movement expected. James says market consensus a future price range. Both of those are acceptable. Lauren says market expectations decent. Pause, he says perception of market gods. That's probably the most accurate. Expected move. One standard deviation of expected move. Thank you, Shrej. So Shrej already read my mind for everybody that was mentioning expected move. There's an amplifying data point. That's really, really important. Really, really important. The reason why it's really important to acknowledge the fact that this is a one standard deviation move is because there's not an insignificant number of data points that will fall outside of that distribution. So let's take a look at an Eric special terrible drawing that probably is going to add more obscurity to what I'm trying to show",
    "start_timestamp_seconds": 477.92,
    "start_timestamp": "00:07:57",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=477"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 4,
    "total_chunks": 58,
    "text": "that this is a one standard deviation move is because there's not an insignificant number of data points that will fall outside of that distribution. So let's take a look at an Eric special terrible drawing that probably is going to add more obscurity to what I'm trying to show you. But it's the effort that counts, right? That's what they say. Fun fact is not the effort that counts. It's the fucking output that counts always. But the output of this is I enjoy attempting to draw and confusing everybody. So okay, so here we have a mean. So what we're talking about a one standard deviation who know who knows. Please. So when we're talking about a one standard deviation, expectation of forward price movement that represents this range. Inside this range is 68 of occurrences. If we go to this second standard deviation, it expands 95. The reason why this is important is because a non-trivial number of movements will fall outside of this 68 probability. So a lot of people will say, oh, the expected range is 10 points. And then they're blown away when it moves outside of 10 points, for example. You cannot be blown away in that instance, especially if you understand what we're talking about. Now the fact that it is a one standard deviation expectation. Okay, next, what is variance? What does variance measure? Now the cool part is some of these things are actually also giving you an inherent introduction",
    "start_timestamp_seconds": 574.68,
    "start_timestamp": "00:09:34",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=574"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 5,
    "total_chunks": 58,
    "text": "blown away in that instance, especially if you understand what we're talking about. Now the fact that it is a one standard deviation expectation. Okay, next, what is variance? What does variance measure? Now the cool part is some of these things are actually also giving you an inherent introduction to basic statistics, specifically as it applies to trading. That'll be something that we're gonna take a look at. Steve Shop, that's a fun name, is saying standard deviation squared, okay? What do we got? Anybody else? James says spread of data over a time series. I would take it. Joe says difference between price and expected move. That's a good guess, but that's incorrect in this context. Now what you're talking about is completely cracked, the variance, right? The difference between unexpected and observed outcome. So full credit for the try there, but in this context, that's not what we're talking about. So when we're trying to understand the movement pattern of something, let's say that we have a line of best fit. And let's say we have data points that are plotted randomly around it. What we can do is we can figure out what the difference is between all of these individual data points and then we can assess how different they are from the total average. So we can look at variance a bunch of different ways in the context of markets. We have a very specific way of looking at it. But the high level",
    "start_timestamp_seconds": 684.84,
    "start_timestamp": "00:11:24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=684"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 6,
    "total_chunks": 58,
    "text": "between all of these individual data points and then we can assess how different they are from the total average. So we can look at variance a bunch of different ways in the context of markets. We have a very specific way of looking at it. But the high level note that I want you to pay attention to when with respect to variance is essentially the dispersion of something around a mean and the frequency of the dispersion. So we can understand if something has very high variance, which will bleed over into standard deviations and volatility, volatility is essentially just variance square root. And the real difference between the two and the reason why we do things like we figure out the mean between each point and we square it each one. The reason why we do the squaring process is because it normalizes all of the signs. The stuff above this is a plus sign. The stuff below this is a negative sign. You can't add those together cleanly. They also allow us to exacerbate some of the movements to see them more clearly. But most of the time when we're observing volatility, we're going to get back down to the base level, which is why we then later take the square root of it. So the important thing to remember with variance is it gives us an idea of how the data points of something behave compared to the average. And it's a really important use",
    "start_timestamp_seconds": 787.2,
    "start_timestamp": "00:13:07",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=787"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 7,
    "total_chunks": 58,
    "text": "back down to the base level, which is why we then later take the square root of it. So the important thing to remember with variance is it gives us an idea of how the data points of something behave compared to the average. And it's a really important use case with respect to trying to track volatility going forward and measure what it is. Okay, last one, what is the difference between historic volatility and realized volatility? What you got? Now, for those that were in the session last week, you will remember that we spent a little while talking about the different kinds of volatility that exist, what they mean, why they matter. And this one is actually a fairly important one. So I'm actually eager to see what you guys say about this one. And then I need to update our little timestamps that I can figure out when we got to the quiz, which is like 840 while you're throwing your answers in. 840, please. No guesses? So you salamanders on it. Yeah, very empty. No guesses. What's the difference? So, traces historic volatility would actually happen realized can be future. Yeah, exactly. There we go. That's exactly correct. So it's a nuanced question. So historic volatility is always a measure of what happened. And typically speaking, it's using longer term ranges. Realized volatility can be backwards looking or forwards looking. You can have future realized ball or you can have realized ball looking at historic",
    "start_timestamp_seconds": 868.52,
    "start_timestamp": "00:14:28",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=868"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 8,
    "total_chunks": 58,
    "text": "That's exactly correct. So it's a nuanced question. So historic volatility is always a measure of what happened. And typically speaking, it's using longer term ranges. Realized volatility can be backwards looking or forwards looking. You can have future realized ball or you can have realized ball looking at historic data point. Now, the important note here is that the way realize volatility and historic volatility when they're calculated rearwards looking is slightly different. In general, we use them interchangeably, but there is a slight difference between this job. Let's jump into our recap. I got a pop up in the door for a thought. All right. So last time, we essentially did all things volatility. We learned why it matters how it behaves, how to analyze it, how we can use volatility to give us tradable information in terms of expected ranges. We looked at things like the curvature of volatility through things like term structure, smile. We looked at the volatility surface. The volatility surface, we looked at skew the difference between same term, volatilities. And we learned that volatility is one of the more predictable elements of markets. And it's one of the few examples of a true mean reverting assets. And you can break it out as its own asset class or you could just look at it as a true mean reverting effect depending on how you're visualizing volatility. This is very different than when we look at something like price. So not only does",
    "start_timestamp_seconds": 967.96,
    "start_timestamp": "00:16:07",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=967"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 9,
    "total_chunks": 58,
    "text": "true mean reverting assets. And you can break it out as its own asset class or you could just look at it as a true mean reverting effect depending on how you're visualizing volatility. This is very different than when we look at something like price. So not only does it inform the way that we build options trades, not only does it inform the way that we analyze and visualize the market, but it also gives us the opportunity to trade a very predictable effect, which is important for those traders out there. Sick. That is our recap. Onto today, which is about the Greeks. So your TLO, your terminal learning objective for today is to have an idea on how to use the Greeks to make better trades. That is the ultimate endpoint of the session. So notice how it's not to know the Greeks. Yes, you have to know the Greeks. But the main point here is that knowing the Greeks is not enough. So introduction to the Greeks. We need to always remember why we're learning this stuff. I refer to it as putting first things first. And it's like a lot of times traders, when they're trying to solve a problem, they accidentally start trying to optimize for the wrong thing. So in the example here, we need to understand how we use the Greeks, not to know what they are, not because it's fun, but because we use them to literally make better trading",
    "start_timestamp_seconds": 1073.64,
    "start_timestamp": "00:17:53",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=1073"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 10,
    "total_chunks": 58,
    "text": "they're trying to solve a problem, they accidentally start trying to optimize for the wrong thing. So in the example here, we need to understand how we use the Greeks, not to know what they are, not because it's fun, but because we use them to literally make better trading decisions. So I have a couple misconceptions up here. If you have others, I would absolutely love to capture those. The two primary ones that I have here are that the Greeks provide an edge, and that there is a best Greek. And these aren't things that I'm kind of like just making up. These are things that I have literally come across in my conversations on places like Reddit. And I'll actually show you this, not in this post. This is somebody else's post I wanted to talk about in this post. Let me find... There is a specific person... No, no... There's a bunch of comments on this one, so we'll find it. Aha, so here's one. So this is from an actual post that I made. This is one comment. Okay, try reading it now, just kidding. So this is one... And then there's one more, let me find... Here you go. The reason why I'm showing you these is like, these are your peers, and they're my peers. These are other retail traders. And they're my peers. They're my peers. They're my peers. These are other retail traders that these are people that think this stuff.",
    "start_timestamp_seconds": 1164.52,
    "start_timestamp": "00:19:24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=1164"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 11,
    "total_chunks": 58,
    "text": "me find... Here you go. The reason why I'm showing you these is like, these are your peers, and they're my peers. These are other retail traders. And they're my peers. They're my peers. They're my peers. These are other retail traders that these are people that think this stuff. And the reason why you have to know this is because one of the things we're trying to do is traders is avoid making the mistakes, common, common mistakes. So let's talk about these very quickly. And then we'll get into this one in the back that I had thrown up. So this top one says the post for those that are wondering, the post is literally the Greeks do not provide you an edge. That's the gist of the post. And this person says Greeks can be mispriced in quotes based on market conditions. For instance, a 20-delted option, 30-DTE, and it goes in the money in three days. It was priced at a 20-delted when the trade was open. And now it's over 50-delted in the money. The probability is only so accurate. But in the bigger and more diverse picture, no one really knows. This is completely wrong, like entirely wrong through and through. And this shows a fundamental misunderstanding of what the Greeks are. The Greeks provide us inputs relative to a snapshot in time. So when we're looking at these top level Greeks, the ones that you're going to be most familiar with, Delta, Theta,",
    "start_timestamp_seconds": 1274.8,
    "start_timestamp": "00:21:14",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=1274"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 12,
    "total_chunks": 58,
    "text": "wrong, like entirely wrong through and through. And this shows a fundamental misunderstanding of what the Greeks are. The Greeks provide us inputs relative to a snapshot in time. So when we're looking at these top level Greeks, the ones that you're going to be most familiar with, Delta, Theta, I normally like to put gamma up here. I like gamma better there. Delta Theta, Gamma, Vega, and Ro. This is the more common group of Greeks for people. The way to think about the Greeks is that they essentially are the instrument cluster to your car. So when you're driving your car, understanding how to read your tacometer, understanding how to read your speedometer, understanding what's oil temp is, what transmission fluid temp is, or just trans temp, depending on your car, what your coolant temp is, all of these different things are inputs to you. Understanding how to read the gauge cluster of your car doesn't inherently make you a good driver. And there are some people that can drive that don't really know that much about their car. Now, that's simply an artifact of cars have a lot of controls in place for you. An example of this is if there's something wrong with the car, a check engine light will come on. That is literally the world creating structure for you to make it easier for you to know something's wrong. That doesn't exist in the markets. You have to be able to look at your",
    "start_timestamp_seconds": 1368.12,
    "start_timestamp": "00:22:48",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=1368"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 13,
    "total_chunks": 58,
    "text": "this is if there's something wrong with the car, a check engine light will come on. That is literally the world creating structure for you to make it easier for you to know something's wrong. That doesn't exist in the markets. You have to be able to look at your coolant and see that your coolant is effectively boiling. And then you have to do something to change it. There's no check engine light that's going to tell you, maybe the check engine light's like a margin call. That's when it's way too late. So the way to think about the Greeks is they give us a lens to measure different inputs that impact an option. Because if you'll recall, when we're talking about options, there's intrinsic and extrinsic value. We know that these contracts have an expiration. We know that these contracts care about volatility. So what I'm showing you is that looking through just at a surface level, and you see like there's these different kinds of values that create the premium, we know that they expire at some point. So something that's going to expire in a day is inherently going to have different value than something that's going to expire in a year. So from an intuitive perspective, we can just postulate that there are other factors that impact the premium of an option versus just the underlying price movement. So the Greeks allow us to understand how all of these different factors impact premium. And",
    "start_timestamp_seconds": 1468.84,
    "start_timestamp": "00:24:28",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=1468"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 14,
    "total_chunks": 58,
    "text": "that's going to expire in a year. So from an intuitive perspective, we can just postulate that there are other factors that impact the premium of an option versus just the underlying price movement. So the Greeks allow us to understand how all of these different factors impact premium. And then as we get into second order Greeks and third order Greeks, they help us understand how different factors impact other factors that ultimately impact your premium. So the way to think about it, and this isn't a perfect description by the way, but this is a way to think about it, a simplifying framework. First order Greeks pertain to the price or the premium. Right? So delta rate of change of premium per one point move in spot price, theta rate of change of premium. I guess I'll clarify those in here. Rate of change of rate of change of premium. Delta gamma note, we'll talk about that in a second. Oh, no, I already have premium in there. I'm an idiot. Sorry about that. I realize that it starts with premium. So notice how delta premium rate of change theta, premium rate of change, Vega premium rate of change, row premium rate of change. All of these first order Greeks deal with premium rates of change. Then notice gamma. What's the difference in gamma? This is our first second order Greek. What do you notice? Gamma is telling us how delta works. So the second order Greek gamma",
    "start_timestamp_seconds": 1564.92,
    "start_timestamp": "00:26:04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=1564"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 15,
    "total_chunks": 58,
    "text": "change, row premium rate of change. All of these first order Greeks deal with premium rates of change. Then notice gamma. What's the difference in gamma? This is our first second order Greek. What do you notice? Gamma is telling us how delta works. So the second order Greek gamma is measuring a first order Greek. You see the point. So the way to think about first order, second order, third order Greeks is that they essentially tell you what they're measuring and they measure different things. So most traders will deal most commonly with the first order Greeks plus gamma. And we'll talk about the others in a little bit. But we're going to talk about the first order Greeks that look now going back to this question, back, back to this. The Greeks are not mispriced, the Greeks are Bayesian. They provide a snapshot in time and then the update immediately based on new market movement. So to this person's point it's not a mispricing at all. It is simply the different that markets move as the underlying moves, as volatility moves, as new news enters the system that forces repricing of things. So it's not mispriced at all. It's simply a Bayesian system that integrates new information. So now this was another comment on that post. And essentially again, a reminder, the post is that the Greeks don't provide you an edge. And this person says, so yes and no, the no. I make an absolute dump",
    "start_timestamp_seconds": 1665.8,
    "start_timestamp": "00:27:45",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=1665"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 16,
    "total_chunks": 58,
    "text": "all. It's simply a Bayesian system that integrates new information. So now this was another comment on that post. And essentially again, a reminder, the post is that the Greeks don't provide you an edge. And this person says, so yes and no, the no. I make an absolute dump truckload of money utilizing the Greeks in part of my SPX strategies and how I swing stock options. It's not the sole driver to my thesis, but it's a significant part of the evaluation. So you could tell like this clearly is just a person that wants to debate, right? They're literally saying no, but then they use the Greeks. So that that part of side, I don't even care. People are always quick to do that. It's actually funny to me. But the broader point is I want to talk about this individual person and their experience, because their capacity to make what they consider to be a dump truckload of money, which here's another bet. I had happily bet hundreds of thousands of dollars that if we actually conducted a genuine audit of their returns, this would not be the case. Just saying. But that aside and granting the point and taking it as something to think about, right, a cognitive exercise. Your ability to make money with or without using the Greeks has nothing to do with the post, which is that the Greeks do not provide an edge. The way that I think about the Greeks",
    "start_timestamp_seconds": 1773.0,
    "start_timestamp": "00:29:33",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=1773"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 17,
    "total_chunks": 58,
    "text": "the point and taking it as something to think about, right, a cognitive exercise. Your ability to make money with or without using the Greeks has nothing to do with the post, which is that the Greeks do not provide an edge. The way that I think about the Greeks is that they provide table stakes. You are a artist of sorts and your medium is options. So you have to know when to use the chisel. You have to know when to use the sandpaper. You have to know when to use the polish, these different tools. So the Greeks are table stakes. The Greeks are what you need to understand in order to understand what the fuck is going on with your positions that are on. And this is why so very frequently in the simplest of sense, people will say the underlying move in my favor, but my trade lost money. Why did this happen? And it typically happens at a surface level of some sort of change in volatility and theta decay. That's generally the case. But it goes much deeper than that. So for example, sometimes people don't understand when they're in the markets selling tons of really far out of the money puts and they think that their position is actually very safe because it's a low probability move. However, the position is way less safe than they think it is. And one of our Greeks help you understand that exact scenario. So if",
    "start_timestamp_seconds": 1851.8,
    "start_timestamp": "00:30:51",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=1851"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 18,
    "total_chunks": 58,
    "text": "tons of really far out of the money puts and they think that their position is actually very safe because it's a low probability move. However, the position is way less safe than they think it is. And one of our Greeks help you understand that exact scenario. So if we're selling super far out of the money options, Vega can really hurt us. So if volatility starts to spike, Vega can lead to pretty significant expansion of a margin requirement. So if I'm selling super far out of the money options that are super cheap and because they're so far out of the money, they don't make much money. So then I have to sell a bunch of them. So then I sell a bunch of them. And as I'm doing this, I still have a pretty high probability trade. But if volatility starts to expand, that can hurt, right? Our Vega in that case would be slightly problematic. However, if we go down and we look at a second order Greek like Vama, and we can see that Vega actually has convexity. So the problem with that is the position that that person selling super far out of the money puts, for example, thinks is super safe. And then volatility starts to expand. And all of a sudden it's looking much worse than they thought, much faster than they thought. And it's because they have no concept of Vama. They're literally holding what I call a Vama bomb.",
    "start_timestamp_seconds": 1937.8,
    "start_timestamp": "00:32:17",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=1937"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 19,
    "total_chunks": 58,
    "text": "the money puts, for example, thinks is super safe. And then volatility starts to expand. And all of a sudden it's looking much worse than they thought, much faster than they thought. And it's because they have no concept of Vama. They're literally holding what I call a Vama bomb. And it's just ticking in their hands and they don't even fucking know it's there. And it's because they don't know this. So the Greeks are what you need to know in order to play the game. Another example I use that might be useful for people is if I'm playing basketball and I know that if I shoot a free throw, it gives me a point. So I know the rule. And in order to be able to shoot a free throw, I need to know the rules, right? I need to stay behind the line. Most of the team has to stay behind their lines before they can go for a rebound. I have to know the rules because if I violate the rules, then I can't make the point. Because they won't count the shot. But simply knowing the rules doesn't give me the point. I still need to make the shot. That's essentially what the Greeks help us do. So now let's go back. Thor is getting really antsy grumbling. He literally had like this little sad whimper. I was ignoring him. So now let's go back and I actually want to hone you in on",
    "start_timestamp_seconds": 2034.92,
    "start_timestamp": "00:33:54",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=2034"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 20,
    "total_chunks": 58,
    "text": "need to make the shot. That's essentially what the Greeks help us do. So now let's go back. Thor is getting really antsy grumbling. He literally had like this little sad whimper. I was ignoring him. So now let's go back and I actually want to hone you in on this one. Do I really need to understand the Greeks? And they say I'm making money consistently without technical analysis of the trades. Convince me it's worth taking the time to learn. This is the complete backwards way to think of the markets. This is somebody that is trying to prioritize their convenience and their preference. They're saying it's going well so far. I would rather not do this because it's annoying or because it takes time and effort and I don't want to do it. So they're saying do I actually have to do this? The reality is for this person I can definitely tell over the long run that this kind of person. I don't know how long they've been trading. I can tell you it's not long and I can also tell you that the probability of them if they maintain this kind of course of them being around for a long time is very low. We have to get over the fact that the markets are not based on our convenience. But we want them to be what we want to be easier difficult. None of that matters. It all is what it is. So this",
    "start_timestamp_seconds": 2110.68,
    "start_timestamp": "00:35:10",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=2110"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 21,
    "total_chunks": 58,
    "text": "being around for a long time is very low. We have to get over the fact that the markets are not based on our convenience. But we want them to be what we want to be easier difficult. None of that matters. It all is what it is. So this person's question of do I really need to understand the Greeks? You don't have to understand the Greeks. You absolutely can trade and you can even find short term success or you can even find moderately long term success by not knowing the Greeks. Certainly. But the thing is is that's finding success in spite of your lack of knowledge. There's nothing about this that actually helps you. The only outcome here that's positive is that you make money and you're making money in spite of your own lack of knowledge. So it's really important to understand the differentiation because. Trading is a very long term game as I commonly remind you all. And over time all of these little weaknesses are going to come out. You're going to find them all markets do that because you have to do a lot of things in markets. So do you need to understand the Greeks? No, you can absolutely choose not to understand the Greeks. Is that negatively going to impact your ability to make money? Absolutely. Specifically, yes, without the doubt. So now I'm going to take a pause on some of these misconceptions that we went through. And the",
    "start_timestamp_seconds": 2203.72,
    "start_timestamp": "00:36:43",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=2203"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 22,
    "total_chunks": 58,
    "text": "to understand the Greeks? No, you can absolutely choose not to understand the Greeks. Is that negatively going to impact your ability to make money? Absolutely. Specifically, yes, without the doubt. So now I'm going to take a pause on some of these misconceptions that we went through. And the quick overview of what the Greeks are and what they do. And I want to see if there's any upfront questions you guys have as of right now. And I'm just updating our timestamps. Paul says I guess successful trades went to his head. And the funny thing is is you're exactly right. Those successful trades go to their head, but in the worst way possible. The reason why it's the worst way possible is because they don't realize their own problem and their problem is that they're making money in spite of this, which means they're stacking the deck against themselves. And then it won't be that far further down the line when they actually lose money. And then they're like, oh, I wonder why I'm losing money. And it'll start to unravel this fundamental misunderstanding of option, which is always interesting to me. I never understand that perspective. It doesn't make sense. Why would you not want to know the tools for the trade? Obviously, because it's more work, but this comes down to the people that still are just overwhelmingly mistaken that this is going to fast easy money. And as I will always remind you, you",
    "start_timestamp_seconds": 2282.6,
    "start_timestamp": "00:38:02",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=2282"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 23,
    "total_chunks": 58,
    "text": "It doesn't make sense. Why would you not want to know the tools for the trade? Obviously, because it's more work, but this comes down to the people that still are just overwhelmingly mistaken that this is going to fast easy money. And as I will always remind you, you ain't going to find that here. You are not going to find fast easy money in markets. It's simply not the case. James says what exactly is convexity? It's a great question. So actually, I wonder, give me a sec. I bet you that there's going to be a cool graphic of it. I don't like any of these three. This one's OK. So a lot of the stuff that you're going to see is from bonds because the convexity of bonds is a hot topic. But I just want you to focus on this. So it's the same thing that you learned in, I actually don't know. It's like basic math. I don't know if it's like algebra. I don't think it's algebra. I don't know where you learn it. But it's that concave convex wherever you learn that, right? So convexity, concavity. I don't remember where we learn that. But that's like middle school or probably middle school or something. So essentially, convexity is when something has this kind of shape. So it's when we have tails that rise up pretty significantly. And then we have a flatter midsection of some sort. Now there can be all sorts",
    "start_timestamp_seconds": 2371.92,
    "start_timestamp": "00:39:31",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=2371"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 24,
    "total_chunks": 58,
    "text": "that. But that's like middle school or probably middle school or something. So essentially, convexity is when something has this kind of shape. So it's when we have tails that rise up pretty significantly. And then we have a flatter midsection of some sort. Now there can be all sorts of skew with convexity. It's not going to be an even distribution or anything like this always. But the main thing to know about convexity is this general shape. So you can have things that are positively convex like this. You can have things that are negatively convex or concave like this. And it gives us a really important read into the behavior of things. So when you look at options, an example of option convexity is gamma. So if we look at, well, actually, I think I have it here. Give me a sec. Yeah. So it's not smooth, not smooth, but this is convexity. So what this is showing you is the steepness of gamma in two different instances. You can see that Vega has concavity. So convexity has things become more convex. They move faster. So in this case with gamma, we can see that this yellow line is a 10 DTE option. The white line is a 30 DTE option. So notice how gamma's convexity increases as it goes up into 30 DTE from 30 DTE to 10 DTE. So that's what convexity is. In the theoretical sense, it's literally just this shape that we apply",
    "start_timestamp_seconds": 2466.72,
    "start_timestamp": "00:41:06",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=2466"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 25,
    "total_chunks": 58,
    "text": "line is a 10 DTE option. The white line is a 30 DTE option. So notice how gamma's convexity increases as it goes up into 30 DTE from 30 DTE to 10 DTE. So that's what convexity is. In the theoretical sense, it's literally just this shape that we apply in different contexts. So you very, very frequently will hear about convexity in the bond market. Super, super common. Let me know if you have follow on questions on like what convexity is, but that's essentially what it is. Why not says who needs Greeks when you can guess my man? That's it. That's it. It's better off. Just fucking straight up guessing. All right. So let's get a withdrawal here. So let's talk about how we can use the Greeks. As always, you will refer, well, you always hear me refer to the way that I plan things, which is always from the top down like this, like a funnel, right? So the top level of using the Greeks for me is actually the portfolio level, the way that we can use the composite Greek position or Greek standing of our portfolio is very useful. This goes back to that example I was telling you before. If I'm selling a ton of super far out of the money options, even though they're very high probability to work in my favor, and I'm selling a whole bunch of them because they're cheap and I have to and I'm using more",
    "start_timestamp_seconds": 2564.6,
    "start_timestamp": "00:42:44",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=2564"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 26,
    "total_chunks": 58,
    "text": "that example I was telling you before. If I'm selling a ton of super far out of the money options, even though they're very high probability to work in my favor, and I'm selling a whole bunch of them because they're cheap and I have to and I'm using more and more of my margin requirement, I will see that represented in the Vega. And I can also calculate that with respect to something like we talked about earlier, Vama. So we can use the Greeks to help us manage the overall portfolio. You can use things like a beta weighted delta. You can use portfolio level theta, portfolio level gamma, Vega, all of these different Greeks can be zoomed out to the composite level. And it helps us understand the lean of our entire portfolio. If I have a bunch of trades on that are all short premium, I'm going to have a really healthy looking positive theta metric. But I am really going to be at the mercy of gamma across the board. So then if I notice that I have really high positive theta higher than I typically would expect it to be, and then I notice that my gamma risk is significantly elevated, that might inform me to go into my portfolio of individual trades and find things that might be really, really highly correlated in taking some of them down to reduce this correlation so that I can take down the overall portfolio level gamma",
    "start_timestamp_seconds": 2683.24,
    "start_timestamp": "00:44:43",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=2683"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 27,
    "total_chunks": 58,
    "text": "that my gamma risk is significantly elevated, that might inform me to go into my portfolio of individual trades and find things that might be really, really highly correlated in taking some of them down to reduce this correlation so that I can take down the overall portfolio level gamma and scrub off some of my overall beta weighted delta. So I might take some of these positions down like this. So that's the portfolio level. Did not mean to get rid of everything. Too bad. The second is from an analysis perspective. And again, you can tell that this session we're not doing the basics of Greeks. The two videos that I shared are going to do all that for you. So I'm spending more time talking about this stuff. And there's actually a really good example of this that I came across recently. So if we take a look at, let me, this. So if we take a look at the actual effect of the various Greeks, and in terms of like how to actually conceptualize their behavior in our brain, we can figure out where we see heightened or lower delta, I enter lower gamma theta, Vega, all of these. All of them are different inputs that we can custom tailor to our exact idea. This is one of the most important points of the video that I want you to key into. One of the true benefits of options is you can gain purposeful exposure to",
    "start_timestamp_seconds": 2762.64,
    "start_timestamp": "00:46:02",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=2762"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 28,
    "total_chunks": 58,
    "text": "all of these. All of them are different inputs that we can custom tailor to our exact idea. This is one of the most important points of the video that I want you to key into. One of the true benefits of options is you can gain purposeful exposure to the precise effects that you want. And you can minimize your exposure to other effects that you don't want is involved in your position. So the Greeks allow us to do this. So let's take a look at something like, what was I looking at last night? There is a ion cue. If I go to ion cue, and then if I go to something that's like 700 days out, what do you notice about the deltas for ion cue that are 700 days out? The deltas are this column right here. So this at the money, the deltas are 0.76 at the 40. 0.74 for the next strike. That's out of the money. The following strike is 0.70. The following strike after that is 0.67. So what you might notice that's different than what you typically see is that the deltas are very, very high for options that are out of the money. We typically see if we come closer in time, we typically see like a 50 delta that's right about the money. So what can we take from that? There are important context clues that the market tells you if you know how to understand them. Now",
    "start_timestamp_seconds": 2862.48,
    "start_timestamp": "00:47:42",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=2862"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 29,
    "total_chunks": 58,
    "text": "out of the money. We typically see if we come closer in time, we typically see like a 50 delta that's right about the money. So what can we take from that? There are important context clues that the market tells you if you know how to understand them. Now what the market is telling you in this specific instance is this stock is not only expected to go up, but I also can tell you that this stock has significantly elevated volatility. That's what this tells me. So the Greeks give us a lot of these small little tiny clues that we can piece together. Another example are things like Gax, gamma exposure. So let's say we go into spy and let's take a look at the gamma exposure. We can look at gamma exposure in a bunch of different contexts. But this is looking at a specific expiration. You can either do a composite so that you can see pretty much everything at once if you are so inclined. It's really up to what you're wanting to analyze. But we can use things like Gax to understand what dealer behavior might look like. We can figure out if Gax is higher on the collar, the put side, which nets out to a total Gax. We can look at things like volatility skew and use that to help us understand different pricing disparities and discrepancies between calls and puts are between different cycles. This can tell me in this",
    "start_timestamp_seconds": 2969.04,
    "start_timestamp": "00:49:29",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=2969"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 30,
    "total_chunks": 58,
    "text": "Gax is higher on the collar, the put side, which nets out to a total Gax. We can look at things like volatility skew and use that to help us understand different pricing disparities and discrepancies between calls and puts are between different cycles. This can tell me in this instance that put call parity might be off. There's an arbitrage opportunity there. So the Greeks give you literally all of this and it starts from understanding what they are. Now, this series of stuff that I'm explaining really tie to a slightly higher level use of the Greeks that takes time. It genuinely does take time to piece together all of these things. So what I want to do is spend a little time talking about how you can use the Greeks in a day to day context, at least getting started with using them. So I need somebody to give me a strategy like it could be any sort of basic strategy. And then I will talk to you literally how you can use the Greeks in the context of that strategy. Any ideas? The straddle? Cool. Paula, do you want shorter along? We'll do a straddle. Short straddle got it. So let's say that we're going to pick a short straddle and I'm going to just turn it into a rough strategy off the top of my head so that we have something to work off of. So this now goes into the third level, which is",
    "start_timestamp_seconds": 3074.6,
    "start_timestamp": "00:51:14",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=3074"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 31,
    "total_chunks": 58,
    "text": "straddle got it. So let's say that we're going to pick a short straddle and I'm going to just turn it into a rough strategy off the top of my head so that we have something to work off of. So this now goes into the third level, which is position, which is exactly what we're going to talk about now. So I'll clear those off and we're going to have a short straddle. Let's say I'm going to trade this for variance risk premiums. So I'm going to look for stocks that have higher IV relative to HV. And let's just say that's the starting point. Now for those that are familiar with the outlier strategy process, you know that step four is to build a strategy. One of the inputs for building a strategy is when we get more specific. This is where we pick things like our deltas, our days to expiration and so on. So the good part is with a straddle. It's still you, but case you don't know, you still have to pick your deltas. You don't have to have a centered straddle. You can have straddles that are off center, but most people will default to an at the money straddle. And that really generally holds true in this case. So the first Greek I'm looking at for this specific strategy, which is based on trading risk premiums, is the delta input. And the delta input in this context is I'm really trying",
    "start_timestamp_seconds": 3171.44,
    "start_timestamp": "00:52:51",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=3171"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 32,
    "total_chunks": 58,
    "text": "will default to an at the money straddle. And that really generally holds true in this case. So the first Greek I'm looking at for this specific strategy, which is based on trading risk premiums, is the delta input. And the delta input in this context is I'm really trying to trade primarily the volatility side of things. So I'm not really looking to take a big directional bet. So I'm actually going to start with something that's probably close to at the money. Now what happens? If this strategy, fair and so is premium, which is entirely based around the difference between implied volatility and historic volatility, what happens if the underlying moves? Who could tell me? In terms of the position. As the underlying starts to move, there's going to be a couple key changes in the position. And these key changes matter to me, actually quite a lot. And I want to see if you know why. There you go. Tommy's on it. The delta's of the leg move. So as the stock goes up and down, the delta's will move. And the movement of the delta's, which we know what's going to measure that. Emma. So that's another thing I know I have to take a look at with this strategy. And believe it or not, we know that there's a relationship between gamma and days to expiration. So this also will inform this decision. So let's think about it. Because we as retail traders, we",
    "start_timestamp_seconds": 3253.48,
    "start_timestamp": "00:54:13",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=3253"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 33,
    "total_chunks": 58,
    "text": "that's another thing I know I have to take a look at with this strategy. And believe it or not, we know that there's a relationship between gamma and days to expiration. So this also will inform this decision. So let's think about it. Because we as retail traders, we don't have the luxury of essentially continually being able to hedge. It's expensive for us to hedge. And at the onset of this, we know that we want our delta risk to be about zero ideal world. We don't want any delta risk. We want no directional risk. Because this idea is based on volatility in ply versus historic. So that means that I'm really trying to center on Vega. I want Vega to be a much larger part of my actual PNL. So what do we know about Vega? We know based on the way that the Greeks behave and based on those other videos that I paired with you. But we know that Vega is DTE sensitive. And we know that Vega is higher as there's more extrinsic value. Where's more extrinsic value the further out in time you go. So if I'm trying to isolate my impact to Vega, do I want to trade super short term? Maybe it's not a no, but these are inputs to the decision cycle. So then let's say, well, maybe I do want to trade this shorter term. I think it might be better for X, Y and Z reason. I'm",
    "start_timestamp_seconds": 3346.88,
    "start_timestamp": "00:55:46",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=3346"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 34,
    "total_chunks": 58,
    "text": "to Vega, do I want to trade super short term? Maybe it's not a no, but these are inputs to the decision cycle. So then let's say, well, maybe I do want to trade this shorter term. I think it might be better for X, Y and Z reason. I'm going to go into SPX. And let's just do like a 4 DTE obviously because the market's closed. And let's take a look at this at the money straddle the 61 15. And we can see that we're getting 53 delta on the call side. So let's take a look at this actual position. So I'm going to have I'm going to sell to open. One call. And then one put. And let's take a look at the Greek profile for this actually. It's probably easier to see. If I put it in a workbook. So let's take a look at these different positions. We're going to have delta, gamma, data, Vega. I'm not going to worry about row row. We're always kind of like the bastard child that most people don't care about most of the time. That's kind of the reality. Row really impacts longer term options a lot more. And let's take a first look at the short call. So we said that we're going to be short. I'm going to move this off to the side. Now I just wanted you to see what I was in putting. I'll bring it back over. But I want",
    "start_timestamp_seconds": 3435.72,
    "start_timestamp": "00:57:15",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=3435"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 35,
    "total_chunks": 58,
    "text": "lot more. And let's take a first look at the short call. So we said that we're going to be short. I'm going to move this off to the side. Now I just wanted you to see what I was in putting. I'll bring it back over. But I want to move it off to the side of that we can look through this little faster. So the short 61 15 call. What's going to happen there? What we're going to get negative 53 delta's. Our gamma is going to be negative 0.01. Our theta is going to be positive to 21. Our Vega is going to be negative 248. And then if we're short, the 61 15 puts our delta, we're going to get long 47 delta's. For gamma, we're going to be short 0.01. For theta, we're going to get 1.79. And for Vega, we're going to be short 248. So let's take a look at this position so far. I can't find out if I net these out. Here's what I can expect to see on a daily basis. I can expect to make about four bucks in theta. I have about negative five Vega. I'm negative 0.02 gamma and negative 0.06 delta. So you notice right from the onset, I'm not even delta neutral. So the entire origin of this position, if you'll remember, is I don't want any directional risk. I want to be able to just trade Vega. I care about the volatility side",
    "start_timestamp_seconds": 3530.6,
    "start_timestamp": "00:58:50",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=3530"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 36,
    "total_chunks": 58,
    "text": "0.02 gamma and negative 0.06 delta. So you notice right from the onset, I'm not even delta neutral. So the entire origin of this position, if you'll remember, is I don't want any directional risk. I want to be able to just trade Vega. I care about the volatility side of this equation. I don't give a crap. I don't have an opinion on the direction side of things. So now I have some choices. I understand the Greeks. I can figure out this is going to be a theoretical exercise. In reality, we use what's called delta bands. And that means that we don't hedge the delta as it moves every single time. It's just unrealistic. So the way we use delta bands is we say if delta gets to this point or this point, I will recenter the delta's. That's a suboptimal approach, but it's a realistic approach. And it's because there's a cost associated with the hedge. So important general context. So that's the facade from a theoretical perspective. Let's say that we want to keep our delta's zero. We want to be flat. Okay. So what do we have to do? We got to buy six shares. That's easy. So then we're going to buy to open six shares. That's going to give us six delta's. I should do. I'm going to keep it the same. So it's essentially going to flatten out these delta's. I don't want to confuse you. I'm just going to multiply",
    "start_timestamp_seconds": 3641.36,
    "start_timestamp": "01:00:41",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=3641"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 37,
    "total_chunks": 58,
    "text": "shares. That's easy. So then we're going to buy to open six shares. That's going to give us six delta's. I should do. I'm going to keep it the same. So it's essentially going to flatten out these delta's. I don't want to confuse you. I'm just going to multiply all these by 100. So then if I grab six shares, my new net position in terms of delta is flat. Great. Mission accomplished. There is a problem. Locking gamma. As soon as this moves, my delta's are going to move. So my transacting in the shares does precisely jack shit for the gamma. So how do I clear off this gamma? I got to use options. That's the way that I can actually get rid of some of this gamma. So one of the ways that I can get rid of gamma is I can find something and I can trade an unrelated option that essentially offset some of this. What is soon as I do that, all of these other things are going to change. So the way that we actually maintain delta neutrality for something like a short straddle, if we're actually trying to trade a specific effect like variance risk premium is I use the Greeks to understand the overall position that I have. And then I can make adjustments. So the way that I would do this is actually not by buying shares upfront to flatten the deltas. This is kind of like putting a",
    "start_timestamp_seconds": 3721.44,
    "start_timestamp": "01:02:01",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=3721"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 38,
    "total_chunks": 58,
    "text": "effect like variance risk premium is I use the Greeks to understand the overall position that I have. And then I can make adjustments. So the way that I would do this is actually not by buying shares upfront to flatten the deltas. This is kind of like putting a bandaid over a gaping wound. It doesn't actually fix the problem. The problem is going to come from my gamma. So I can flatten the gamma by buying options that offset this. Then I can delta hedge the remaining deltas off based on whatever that residual is. Now that becomes more complex because if I'm trying to sell straddles, I'm essentially saying I think there's variance risk premium, but then I'm coming in here and I'm buying options to offset the gamma. So it's a choice. It's a business decision. Do you want to truly isolate gamma? How long is your position going to be open? How impactful is the gamma going to be? You can decide how you want to deal with gamma or you can just set more aggressive delta bands entirely up to you. For me, a lot of times, I will try to find positions that are easier to manage for something like this, but going back to the original point of how to use the Greeks in something like a straddle is we define as always the profit mechanism that we're trying to trade in this case. I use variance risk premiums for the example.",
    "start_timestamp_seconds": 3846.8,
    "start_timestamp": "01:04:06",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=3846"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 39,
    "total_chunks": 58,
    "text": "are easier to manage for something like this, but going back to the original point of how to use the Greeks in something like a straddle is we define as always the profit mechanism that we're trying to trade in this case. I use variance risk premiums for the example. And then I started listing out the specific effects that I'm trying to isolate. And based on those effects, I can literally quantify the impacts of these different positions, net them out, and then attain the actual risk that I want. Let's do unomas. And then we'll have plenty of time for like QA and stuff. But I want to pick another example. I'm thinking something like buying calls or selling puts something like that, but you guys can pick if we want to do either of those. That's what I'm thinking. And really the main reason why I want to do that is because I think there's a little bit we can probably pull out of it. Some calls good. I love it. And you read my mind, by the way, Tommy, thank you very much for giving me the scenario of trying to play a big move because that's going to be one of the first questions. But before we do that, I need to finish my dinner order really fast. And for Valentine's Day, my wife oddly wants to jack in the box, which I have to be honest we essentially never eat that shit. But I'm",
    "start_timestamp_seconds": 3917.8,
    "start_timestamp": "01:05:17",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=3917"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 40,
    "total_chunks": 58,
    "text": "that's going to be one of the first questions. But before we do that, I need to finish my dinner order really fast. And for Valentine's Day, my wife oddly wants to jack in the box, which I have to be honest we essentially never eat that shit. But I'm a romantic at heart. So jack in the box we go. And I'm not like afraid of jack in the box. I just think this stuff is fucking awful for you. It's like just straight disease food. But every once in a while, I feel like you got to put some trash in your body to remind it to not be you delicate. Here we go. Okay. So this was in a straddle. And then now we are at 108.5. And then this will be how to use the Greeks in a long call. Okay. So along this is another just really, really common scenario. And I actually have a video that goes through this in detail. Let me find it for you. Here. So this video will talk about buying call options. And let's take a look at a practical example. So in Tommy's scenario, he was talking about wanting to trade something for a much more pronounced directional move. So let's say that we're looking at Ion Cueks. I was looking at this earlier. Actually, I think another probably better example like Nvidia. So a lot of people have been trying to figure out how to play this",
    "start_timestamp_seconds": 4017.08,
    "start_timestamp": "01:06:57",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=4017"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 41,
    "total_chunks": 58,
    "text": "wanting to trade something for a much more pronounced directional move. So let's say that we're looking at Ion Cueks. I was looking at this earlier. Actually, I think another probably better example like Nvidia. So a lot of people have been trying to figure out how to play this move in Nvidia. I think this is fairly topical. Now one of the notes that has earnings coming up, that's important to know because with earnings coming up, you have to either acknowledge that you're going to hold through earnings or not hold through earnings. And it's entirely your choice. But this is a binary move. Now when we're trading long options, there are effectively for specifically long calls, there are two things that we are trying to gain exposure to. The primary top line item though is gamma. We are trying to find something that is likely to move and it's likely to move a lot. But that really comes down to leverage. That's the only reason why you trade something like a long call versus buying the stock. It's just for leverage. So if we take a look at buying 100 shares of Nvidia, but I wanted to buy 100 shares of Nvidia, I need to call up 13,885 bucks, which I may or may not want to call up, right? The other thing I can do is go super far out in time and I can buy an option that's super deep in the money, like an",
    "start_timestamp_seconds": 4149.44,
    "start_timestamp": "01:09:09",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=4149"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 42,
    "total_chunks": 58,
    "text": "buy 100 shares of Nvidia, I need to call up 13,885 bucks, which I may or may not want to call up, right? The other thing I can do is go super far out in time and I can buy an option that's super deep in the money, like an 80 delta. And I can essentially control 80 shares of Nvidia at this point, 80 shares of Nvidia, and I can pay 45, 100 bucks, call it. So for a fraction of the price, I can essentially control the same size position. This is an example of using options essentially as a stock replacement. Now, the way that we can structure our options trade based on our idea changes and we use the Greeks to do it. So let's say that we think there's going to be a big up move in Nvidia, big parabolic up move for whatever reason. Maybe we see the CEO sign another titty or who knows, he might pull another chip out of another oven that people really like. And that's the limit here. So let's say that scenario happens, we think it's going to happen, there's going to be a big move. There are a handful of choices that we have to move through in order to arrive at the actual position that we're going to put on. So one of those choices is days to expiration. Another one of those choices is delta. Another one of those choices is gamma. Another one of",
    "start_timestamp_seconds": 4237.24,
    "start_timestamp": "01:10:37",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=4237"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 43,
    "total_chunks": 58,
    "text": "a handful of choices that we have to move through in order to arrive at the actual position that we're going to put on. So one of those choices is days to expiration. Another one of those choices is delta. Another one of those choices is gamma. Another one of those choices is theta. So let's see how we can actually build a position that truly reflects our idea. If we think Nvidia is going to move a lot, let's take a look at a couple examples. Let's do a seven day and we'll do something that's like at the money. So this option has 50 delta and it's only 290, right? So it's pretty cheap. Before I was telling you that you have to cough up like 4,500 to control 80 shares. This is putting up 290 to control 50 shares. You just do two of them, pay 500, 600 and control even more shares. So from that perspective, it seems way better, right? Doesn't it? Does to me? Here's the problem. If you take a look at the theta, theta on these options is losing 24 cents a day. So if we look at that in relation to the overall premium, call it 290, losing 24 cents, it's essentially 10 of the options premium is going to go away per day. The reason why that matters is because it then moves the goal post against you to get the move in your favor. And I'll show you what",
    "start_timestamp_seconds": 4322.84,
    "start_timestamp": "01:12:02",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=4322"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 44,
    "total_chunks": 58,
    "text": "the overall premium, call it 290, losing 24 cents, it's essentially 10 of the options premium is going to go away per day. The reason why that matters is because it then moves the goal post against you to get the move in your favor. And I'll show you what I mean by this. So let's say we get in at that 290 handle, again, just for the example. And let's zoom this out. So let's pretend that a day passes. Right now our PL is negative 2.50. It's just using the midpoint. So don't pay any mind to that. Let me get rid of one of these extra slices and probably this one. So it's about unchanged, right? On the day. Great. One day. What starts to happen here? Well, what will start to happen is you'll notice that this purple line is actually going to move down towards that blue line. So if I fast forward another day, another day, all of a sudden the stock hasn't moved against me. It hasn't moved for me, but I'm starting to lose money. That sucks. Why am I losing money? Well, I'm losing money because of theta decay. So one of the inputs to your decision cycle here, understanding the Greeks, is that the cost for the leverage you get through a long call is theta decay. The downside to this is let's say that you were expecting originally, maybe Nvidia, what's the current price? Nvidia is at 138. So",
    "start_timestamp_seconds": 4396.84,
    "start_timestamp": "01:13:16",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=4396"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 45,
    "total_chunks": 58,
    "text": "of the inputs to your decision cycle here, understanding the Greeks, is that the cost for the leverage you get through a long call is theta decay. The downside to this is let's say that you were expecting originally, maybe Nvidia, what's the current price? Nvidia is at 138. So let's say that you were expecting it to go to 140, 142, something like that. The issue here is if I continue to fast forward time, what ends up happening is I need a bigger and bigger move in order for this thing to get even back to break even, let alone to make money. That's the issue that you face. So that's the downside to using the cheaper at the money options that expire soon. And again, this is using a smaller position. Really we would have a too lot on right now to simulate the same size. And if it doesn't move quickly enough in your favor, you bleed out through theta decay. Okay, cool. What's the other benefit of this? Well, I just showed you that I can buy more of them. And we also know that the effect of gamma is the closer we get to expiration, gamma is going to go up. So I also get the effect of my delta rapidly compounding, which is awesome. What's the charge for that? The charge for that is theta decay is literally the highest at this point. So then if we use the other example of going",
    "start_timestamp_seconds": 4477.52,
    "start_timestamp": "01:14:37",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=4477"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 46,
    "total_chunks": 58,
    "text": "expiration, gamma is going to go up. So I also get the effect of my delta rapidly compounding, which is awesome. What's the charge for that? The charge for that is theta decay is literally the highest at this point. So then if we use the other example of going further out in time, what happens? Well, if I use this 80 delta option, let's take a look at what my gamma is, how fast I'm going to compound. Fucking zero. It's not actually zero. It's just further decimal points in. This is only going to two decimal points. So it's like three, four decimal points in the broader point here is that you're actually not going to compound that much. So far out in time that your gamma is about flat. That kind of sucks. Why would I want that? Well, because if we take a look at our theta decay, our theta decay is just four cents. So if we look at that four cents relative to the total premium that we're buying into, it's very, very small. So what's the trade off here? The trade off by going further out in time is I'm buying something that's way more expensive. I can lose more money in total, but it's a little bit of a down payment style situation. Because as long as this thing doesn't move super far against me and I'm directionally wrong entirely on a per day basis, I'm going to pay less theta even",
    "start_timestamp_seconds": 4559.32,
    "start_timestamp": "01:15:59",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=4559"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 47,
    "total_chunks": 58,
    "text": "way more expensive. I can lose more money in total, but it's a little bit of a down payment style situation. Because as long as this thing doesn't move super far against me and I'm directionally wrong entirely on a per day basis, I'm going to pay less theta even as a gross dollar amount, but definitely as a percentage, I'm going to give up the gamma. I'm not going to have anywhere near as much gamma unless I get a really big move in my favor. So this is how we can use the Greeks in something like a long call to decide what position makes the most sense for our idea. So going back to Nvidia, if our idea is Jensen's about to sign another titty and Nvidia's going to go skyrocket, I can make more money by not going as far out in time, by being closer in time and buying more of the options and allowing them to compound. If I don't know that that's going to happen, and my idea is more so that Nvidia got beaten down because of deep sea coming out and then the market having this crazy, giant reaction, but Nvidia is still exceedingly well positioned to take advantage of this long term, and this is likely short term sentiment. So I think it's going to rally back up at some point. Let's pretend that that was back in this time frame somewhere down here. Then I go further out in",
    "start_timestamp_seconds": 4636.92,
    "start_timestamp": "01:17:16",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=4636"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 48,
    "total_chunks": 58,
    "text": "is still exceedingly well positioned to take advantage of this long term, and this is likely short term sentiment. So I think it's going to rally back up at some point. Let's pretend that that was back in this time frame somewhere down here. Then I go further out in time. I accept the fact that it's going to be slightly more expensive, but I have a position that can be maintained for longer durations. So these are some literally basic examples of how we can use the Greeks to inform our decision making. And I'll give you one more example that's fairly recent for me, which is Palantir, I put this trade on. And in Palantir, it's a ratio called diagonal. So this is something that's designed to be a longer term trade. So the way that I built this trade is I went further out in time. I'll tell you where I went. I went out to the 16 Jan 26 and I had bought the 110s. So they were essentially right at the money. My first Gotham, they were 64 Delta. Now there are 69 Delta. So I've gotten 0.05 Delta's added to it in the price movement since I've been in it. So what have I done here? I've found a very delicate balance for the idea that I'm trying to trade. I wanted something that I can hold on to for maybe three, six months. So I go this far out in time so that",
    "start_timestamp_seconds": 4704.32,
    "start_timestamp": "01:18:24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=4704"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 49,
    "total_chunks": 58,
    "text": "movement since I've been in it. So what have I done here? I've found a very delicate balance for the idea that I'm trying to trade. I wanted something that I can hold on to for maybe three, six months. So I go this far out in time so that I accept much lighter overall Theta decay. But because I know that they're stated to K, what I can do is I can sell near term options against it, not to make a bunch of money off the short options, but because I understand the Greeks. So I'm losing Theta in that long option position. So if I come in here and I sell premium, I'm now long Theta. And in this case, I can see how much Theta I'm gaining per day, 10 cents per day, just using this option as an example of the 140s. So I make 10 cents per day in Theta on this trade. But then if I go out to this trade here and I analyze how much I'm losing per day, I'm losing five cents. Sick. So I can offset the daily Theta decay via the shorter term position to subsidize the holding cost of the long option so that I can still enjoy the benefit of a leveraged directional position, but I can reduce the total cost I'm paying to do this. So this is another way to use the Greeks. I am going to pause here, open the door for Thor",
    "start_timestamp_seconds": 4785.28,
    "start_timestamp": "01:19:45",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=4785"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 50,
    "total_chunks": 58,
    "text": "cost of the long option so that I can still enjoy the benefit of a leveraged directional position, but I can reduce the total cost I'm paying to do this. So this is another way to use the Greeks. I am going to pause here, open the door for Thor so we can go get his dinner. And then I would love to talk about any specific questions you guys have. And then I want to talk about these two misconceptions. We already covered the first one, but then we'll hit the second one. So the context here, mexi says so a calendar spread. What about a calendar spread? Talk to me. Talk to me, send your mexi. Talk to me about this calendar spread. Oh, he's asking about the position that I had on. Wait, is that right? Yes, you're asking about the position that I had on. No, I mean technically, technically it is a spread. It's not wrong. Most people will take the term spread and they'll automatically apply it to verticals, right? So the point of verticals is obviously very different. But for example, to mexi's, I'm not exactly sure what mexi, if you were referring to the position, but technically you could call it horizontal. It's not, I wouldn't exactly call it a calendar spread. So horizontal spread calendar spread, it's about the same thing. The way to think about spreads is you can go vertical or horizontal. vertical is in the same term, but",
    "start_timestamp_seconds": 4853.48,
    "start_timestamp": "01:20:53",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=4853"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 51,
    "total_chunks": 58,
    "text": "to the position, but technically you could call it horizontal. It's not, I wouldn't exactly call it a calendar spread. So horizontal spread calendar spread, it's about the same thing. The way to think about spreads is you can go vertical or horizontal. vertical is in the same term, but higher or lower from whatever the base leg is. And then horizontal is using the time series component going out and time or in and time. Now technically speaking, if I were to look at a true calendar spread, it would be the same option that I'm looking at. And a calendar spread is designed to do a specific thing. This technically speaking is called a is a diagonal spread. The reason why it's called a diagonal spread is because I'm combining two things. I'm combining a change in strike going vertical. And then I'm also going horizontal. So what happens if I combined vertical and horizontal, fucking diagonal? It's one of the easy things about options, no mink nature. Basically, the very little soak it up because there's very few instances of anything in this stuff that make any fucking sense whatsoever, but that is one of them. So technically it's called a diagonal spread. Now the more important element is the different directions we can go, but then also the relationship between the legs and the ratio of legs. This is the stuff that I will trade will be a ratio in some capacity. So back to this,",
    "start_timestamp_seconds": 4965.68,
    "start_timestamp": "01:22:45",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=4965"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 52,
    "total_chunks": 58,
    "text": "technically it's called a diagonal spread. Now the more important element is the different directions we can go, but then also the relationship between the legs and the ratio of legs. This is the stuff that I will trade will be a ratio in some capacity. So back to this, this idea that there is a best Greek, what is the Greek I should get, what Greeks should I use? The reality is there is no best Greek. What you should do is use the Greeks, guide the position that you want. The inform via all of the different inputs, how your position is going to behave. And then you run that through the filter of is this what I want? Another really simple example going back to the straddles. Let's say that I was trading the straddles from the context of an earnings release. And we'll literally let's fucking do an example. Let's go to last after the market. I'm going to find something that's like reasonable. Now let's do Mondalees. Let's go back to the fourth of Feb. We're going to go back in time. And I'm literally going to give you two different traits so that you can see exactly what this is. I learn best personally through seeing shit, practical application. So we're going to take a look at what did I say Mondalees? Right now it's loading. Damn boy. Look at that. Let's say that we want to trade this for earnings. So I think",
    "start_timestamp_seconds": 5043.04,
    "start_timestamp": "01:24:03",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=5043"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 53,
    "total_chunks": 58,
    "text": "can see exactly what this is. I learn best personally through seeing shit, practical application. So we're going to take a look at what did I say Mondalees? Right now it's loading. Damn boy. Look at that. Let's say that we want to trade this for earnings. So I think in this scenario earnings is after the close on this day. So technically speaking for an actual earnings play, I would get in much later. We'll just do that really quick so that it's at least somewhat accurate. And then I want to take a look at two different things. I want to take a look at selling the straddle in 7 Feb and then selling the straddle on 21 March. I actually don't fully remember what happened with this one if it worked or didn't work. But that doesn't actually matter. All right, where's the best choice looks like this one? So we'll throw this in there. It's going to look all fucked up because the days are fucked up in here. Don't pay attention to the risk profile. And then let's take a look at this one. Okay. We have our two straddles. They're locked in 232 and 420. Diginy. Let's fast forward time. So we're literally just going to take it one day forward because the hypothesis that I'm trying to trade is various risk premiums. So I'm trying to trade various risk premiums through earnings. I'm not trying to trade the straddle in this long term.",
    "start_timestamp_seconds": 5143.64,
    "start_timestamp": "01:25:43",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=5143"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 54,
    "total_chunks": 58,
    "text": "420. Diginy. Let's fast forward time. So we're literally just going to take it one day forward because the hypothesis that I'm trying to trade is various risk premiums. So I'm trying to trade various risk premiums through earnings. I'm not trying to trade the straddle in this long term. I'm simply taking it through earnings. The other thing I'm doing is I'm taking it closer to the morning so that we can observe what this looks like. So first things first, our first straddle that we put on for 420 is now trading at 3.75. So when from 420 to 375, this is the 44-day to expiration straddle. If I go to the 7th, we put this straddle on for wrong one for 232. This one is now trading at 1.25. Actually 5.5. Sorry. Somewhere in here. Let's call it 0.80, 0.90. Call it 0.90, something like that. So what happened here? The Greeks happened here because I'm trying to trade the earnings release itself. Valtility is going to be centered in the term that has the actual earnings release. That's what's happening here. So this moved way more, not because it has higher theta decay. That's part of it, but that's not why it moved so much more. Because we can literally do the math on the theta that should have came out. It should have been like 0.10, 0.14 on this side and 0.9 on this side. But over 1 came out. It's not theta. What happened",
    "start_timestamp_seconds": 5238.76,
    "start_timestamp": "01:27:18",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=5238"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 55,
    "total_chunks": 58,
    "text": "it, but that's not why it moved so much more. Because we can literally do the math on the theta that should have came out. It should have been like 0.10, 0.14 on this side and 0.9 on this side. But over 1 came out. It's not theta. What happened was a contraction in volatility. And because that volatility was primarily in this term versus this term, that's why it made so much more money. So in this context, based on my thesis and my trade idea, I know it makes more sense to trade this expiration cycle versus this expiration cycle. It's because this one actually grants me exposure to the effect I'm trying to capitalize on. This one does not. This one still made money, but it made way less money. And it's for those reasons. The Greeks literally tell you all of this, all of it. You just have to pay attention. They're there. Any other questions? I hope that the general concepts that we're talking about and the approach that we're talking about makes sense to you. This is something that's built over time. So don't let it overwhelm you. You don't have to know all of this at once. One of my most important piece of advice to you is that you don't have to remember all this shit. What I used to do is I had a cheat sheet that I would reference that would help me understand how the premium of my option",
    "start_timestamp_seconds": 5340.04,
    "start_timestamp": "01:29:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=5340"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 56,
    "total_chunks": 58,
    "text": "of this at once. One of my most important piece of advice to you is that you don't have to remember all this shit. What I used to do is I had a cheat sheet that I would reference that would help me understand how the premium of my option would behave based on all of these different conditions. That's exactly what I would use. So you can make your own cheat sheet. And I think it's important to make your own cheat sheet because the process of making it is part of the learning process. So it's valuable to do so. But if you go through those steps, you literally will make much better trade decisions that help you isolate what you're actually trying to trade. That's the broad idea. So that is a practical application of using the Greeks as an options trader. So if we take a look at what we have next for our series, next on our hit list is navigating the options chain. So the next video that we're going to do, we're going to talk about how to look through and identify opportunities, how to analyze things like liquidity, how to see if the options chain is telling you anything because very frequently it does simply if you pay the pocket tension. And then after that, we will have technical analysis, fundamental analysis, how to build a trade strategy process portfolio management, and then the actual trading process itself. And then we still",
    "start_timestamp_seconds": 5428.08,
    "start_timestamp": "01:30:28",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=5428"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 57,
    "total_chunks": 58,
    "text": "the options chain is telling you anything because very frequently it does simply if you pay the pocket tension. And then after that, we will have technical analysis, fundamental analysis, how to build a trade strategy process portfolio management, and then the actual trading process itself. And then we still have a handful of flex sessions. So this is still designed to be about 15 episodes. We are now obviously wrapping up episode six. And my intention is to fill these flex sessions with really whatever you want. So one of my ideas, the reason I'm talking to you about this is to get your input is I definitely think it makes sense to slot in a general Q and A. I don't know where you prefer to do that. I think it actually would make sense before the options chain or before building a trade itself. I think those are the two logical places for the like general overarching Q and A. And then I was planning on doing a second one at the very end. So then if there's a specific options trading topic that you really want to spend more time drilling in as we go through these, that's what the remaining flex session will be used for. But if you have a preference on when the Q and A is, let me know the reason why I'm asking if you have a preference is because it really depends on if you feel like you're at a",
    "start_timestamp_seconds": 5509.2,
    "start_timestamp": "01:31:49",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=5509"
  },
  {
    "video_id": "hRjXKf4CvC8",
    "title": "Option Greeks Explained | Outlier Options Trading Basics Ep6",
    "url": "https://www.youtube.com/watch?v=hRjXKf4CvC8",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 58,
    "total_chunks": 58,
    "text": "these, that's what the remaining flex session will be used for. But if you have a preference on when the Q and A is, let me know the reason why I'm asking if you have a preference is because it really depends on if you feel like you're at a point that you have questions that are like burning in your brain that you're trying to get an answer for that you're not able to find on your own. But that happens when you get to a critical mass of kind of knowing enough to then have questions, right? If you're so new, then you kind of don't know what you don't know. And then it might make sense to hold off for a little bit. So if you have a preference, let me know. Reese says before building a trade, cool. I will earmark that and then everybody else, you can just let me know as we work through the rest of the content. As always, if you need anything, let me know. Be an outlier. I'll see you all later.",
    "start_timestamp_seconds": 5599.68,
    "start_timestamp": "01:33:19",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRjXKf4CvC8&t=5599"
  }
]