[
  {
    "text": "What up ape outliers? It's kind of a specific class of us, I suppose. I kind of grabbed my dog because he ran over and I thought he wanted to say. Here's the mascot. He's here ready to rock and roll. So he and I, we were reading a couple studies. We got some feedback. So we were reading a couple studies recently about GME and the off exchange routing volume and decisions. So I want to spend a little bit of time taking a look at that with you guys today. He gave me a bunch of good things to pay attention to. So I thought we would start there. And then I want to take a look at Rory and Kitty's old trades. And then specifically the options and how he set them up. I'm trying to develop more of like a fingerprint as I like to call it. Of his behavior. Do you like mango? Do you like mango? I guess. Seems like yes. All right. So the or likes mango is what I've recently learned. And then. And then yeah, I want to talk a little bit about the recent price behavior behavior. And. We're back at it. Just a technical difficulty real quick. And yeah, so then for the rest of the stream or anything like that. If there's anything that you guys want to take a look at, just let me know. And we will we will go left go right go whichever direction",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=0"
    }
  },
  {
    "text": "at it. Just a technical difficulty real quick. And yeah, so then for the rest of the stream or anything like that. If there's anything that you guys want to take a look at, just let me know. And we will we will go left go right go whichever direction you all want to take this stuff. I need to I think turn the volume. I don't how's the volume for you guys is it coming through? Okay. I was thinking I might need to raise it just a little bit. I can't tell. All right. Let me grab this chat. Just instead of if there's time could you take a look at Rory and Kitty's charts. Yeah, of course. So. Lasidio says it's good. Zach says good. Justin says good. That is three greens for go means we're ready to rock a roll. All right. Cool. So I'm moving the child over here so I can keep an eyeball on everybody. And as always, I like to say hello to whoever's hanging out. So we got said trick, which is a hell of a name. Zach. The crowd favorite roaring titty always my favorite. It looks like Ryan Cohen tweeted again. So let's take a quick look at X. And let's see what our boys up to. Ryan. Oh, and. All right. So we're working with here. Kamala. That's. That's so funny. The dude is just having a good time. You got it. Like I don't know. I love",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 84,
      "start_timestamp": "00:01:23",
      "start_timestamp_seconds": 83.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=83"
    }
  },
  {
    "text": "tweeted again. So let's take a quick look at X. And let's see what our boys up to. Ryan. Oh, and. All right. So we're working with here. Kamala. That's. That's so funny. The dude is just having a good time. You got it. Like I don't know. I love him for it because if I think you guys are the ones that told me that he. I'm pretty sure you guys told me that he's fucking Canadian. So I don't even think you can vote. So the fact that he's playing all these games is obviously just he's just messing around. Which I'm I am completely here for. All right. So it looks like the tweet that we have here is a Kamala Grande iced mocha with almond milk cookie crumbles. And then the Trump 2024 is the Grande iced Americano. And that's it. Polaris big fan. Zach says I love that a CEO can just be politically incorrect. So the funny part about that I think honestly is the fact that I think especially in general people are starting to get a little bit tired of how it feels like there's a lot of landmines with respect to speech. Like if you say something you say something the wrong way that all of a sudden there's a bunch of problems and it's kind of just like backwards in my opinion of the some of the ideas of free speech, which is if you say something that's fucked up.",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 84,
      "start_timestamp": "00:02:33",
      "start_timestamp_seconds": 153.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=153"
    }
  },
  {
    "text": "speech. Like if you say something you say something the wrong way that all of a sudden there's a bunch of problems and it's kind of just like backwards in my opinion of the some of the ideas of free speech, which is if you say something that's fucked up. People have the right to not like you and that's that like that's it's a completely viable agreement. In case you guys don't know. I'm a Celterwater kind of sore and today I'm indulging one of my favorites, which is these are literally from Iceland. This is a Mexican lime crystal. I like it. It sounds like a stripper some sort of stripper beverage, but it's literally just a seltzer water and it's like the best seltzer water I think ever. Hey, there's a hundred of us in here shout out to you guys shout out to the ape outliers. Listen to you says it's green. We can't see it. I don't have a green screen. So I'm wearing green. That's interesting. So the silver part comes through. I wonder if I put my hand behind it. That works. Huh, check that out. That's kind of nuts that I can just zoom in. And then if I put it in front of my face, can you see my face through it or no? No. It kind of blocks it all out. Not a technical guy. As you can tell, I am about as simple as you all are and I",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 84,
      "start_timestamp": "00:04:07",
      "start_timestamp_seconds": 247.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=247"
    }
  },
  {
    "text": "just zoom in. And then if I put it in front of my face, can you see my face through it or no? No. It kind of blocks it all out. Not a technical guy. As you can tell, I am about as simple as you all are and I was just very interested in how that worked. But I'm going to enjoy my crystal all the way from Iceland. All right. So let's let's dig in, shall we? You know, my face. Yeah, I mean, these are the these are the questions that I have. Like I said, I'm a simple man. I like simple things. All right. Let's kill this down. And would you guys want to do? Do you want to start with looking at GameStop as it sits today? Or do you want to start going through some of the nerd stuff that I was looking at before? Whatever sounds better to you sounds good to me. is some of Roe and Kitty's old positions. And I think one of you said that you wanted to take a look at his charts. So completely up to you guys, wherever you want to start is where I would like to start. Dom D says Eric will Chewie have to file a 13 G when he sells? Yeah. So he will have to provide an update to it. So if you take a look at the 13 G filing procedures, and again, I want to be very, very",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 84,
      "start_timestamp": "00:05:33",
      "start_timestamp_seconds": 333.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=333"
    }
  },
  {
    "text": "would like to start. Dom D says Eric will Chewie have to file a 13 G when he sells? Yeah. So he will have to provide an update to it. So if you take a look at the 13 G filing procedures, and again, I want to be very, very specific. This is not my strength area. This is typically your guys' strength area over mine. But I've spent time looking at it out of curiosity for this event. So the initial filing passive investors, they have to not file initially within five business days of acquiring more than 5 beneficial ownership, qualified institutional investors. They can do it within 45 days at the end of the year once they cross the 5 threshold. Amendments must be filed within 45 days after the calendar quarter in which a material change occurs. So that's what that looks like. Nerd stuff. Cool. Let's take a look at some nerd stuff. There's two studies that I think are relevant to us. And what I wanted to do is there's a lot of conversation about the off exchange volume, about the dark pool volume, about the impact that it has on price discovery. So I started going down a little bit of a rabbit hole. Now again, for some general context, I am a trader. So the routing of orders in general is not a massive focus for me because it eventually hits the market. Now from the GME side of things, I fully",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 84,
      "start_timestamp": "00:06:42",
      "start_timestamp_seconds": 402.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=402"
    }
  },
  {
    "text": "I started going down a little bit of a rabbit hole. Now again, for some general context, I am a trader. So the routing of orders in general is not a massive focus for me because it eventually hits the market. Now from the GME side of things, I fully understand if there's some sort of speculation on the impact, especially on lower float stocks. So I wanted to go and understand that more. So I found a few studies that talk a little bit more about routing order volume off exchange so that I could get smarter about it. So I thought we could look through these together. Alfonso says, I think that 13G requires an amendment only if a beneficial ownership falls below 5 or the change in ownership amounts to 1 more of the outcinertures. Yeah. I think, I think that sounds right based on what I was looking at before. So I think same plan or same same page. So talking about this dark pool order routing, for those that don't know, the origin of dark pool order routing is really, it's not all bad. Now there are bad components to it in that it does obscure price discovery. It absolutely does. And that's the part I don't like about it. Now the reason why it exists is because honestly traders like me and even smarter traders, traders that have high frequency systems, those kinds of entities will hunt for what looks like big building positions",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 84,
      "start_timestamp": "00:08:13",
      "start_timestamp_seconds": 493.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=493"
    }
  },
  {
    "text": "obscure price discovery. It absolutely does. And that's the part I don't like about it. Now the reason why it exists is because honestly traders like me and even smarter traders, traders that have high frequency systems, those kinds of entities will hunt for what looks like big building positions in front run it. So here's what that generally looks like. We can look at it on a chart, probably not one that's just collapsing down just for general again, general understanding. So when we see something like this, again, I'm not saying that this is all some sort of insider trading or institutional. I'm just using it as an example. But let's just say that this volume being built up is coming from institutions in this example. If that's happening and again, traders like me that are looking for these kinds of things start to see this and we know at that point, an institution is building a position. There's a few things I know as a trader. They can't get a fill all at once. It's near impossible. I also know that they typically are going to build out their fills over several days, several periods of time. So it gives me an opportunity to front run the move. So if I see volume expanding like this and I see a massive buy volume expansion like this, I'll start building a position by buying shares, buying options specifically calls. And it allows me to participate. However, as I'm",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 84,
      "start_timestamp": "00:09:27",
      "start_timestamp_seconds": 567.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=567"
    }
  },
  {
    "text": "So it gives me an opportunity to front run the move. So if I see volume expanding like this and I see a massive buy volume expansion like this, I'll start building a position by buying shares, buying options specifically calls. And it allows me to participate. However, as I'm doing that, that's also driving price up. Demand is still increasing both from the original entity that's trying to put on a really large trade and small fish like me that are front running it. But then you also have really smart systems like high frequency trading systems that are literally hunting for changes in volume like this. They're based on very quick reacting algorithms. So what that eventually does is as soon as people like me and other entities see this kind of buying volume, we make it more expensive for that entity to get a fill to actually establish their position. And again, that's the nature of markets. Do I feel bad about it? Fuck no, they can go fuck themselves. But I also understand the problem that it presents to them and why they would look for a solution because that is a problem. If you're trying to put on a 40 billion position, it's not even have to be half of that. It'd be like 50 million. We don't have to talk about billions. We could talk millions. And if we're in the millions, it still is going to meaningfully move the price observably enough that",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 84,
      "start_timestamp": "00:10:50",
      "start_timestamp_seconds": 650.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=650"
    }
  },
  {
    "text": "to put on a 40 billion position, it's not even have to be half of that. It'd be like 50 million. We don't have to talk about billions. We could talk millions. And if we're in the millions, it still is going to meaningfully move the price observably enough that a bunch of other people want to profit off that same movement because of that known force. So it creates an opportunity. So dark pools. Just says, how do you sleep at night? Honestly, before I had this bullshit with my sciatic nerve, I slept just fine as a lately, not super great, but it has nothing to do with this. Obviously. But so dark pools, they originated so that big orders could get put through at a certain size in fewer transactions so that the orders weren't being front ran continually. That's the good side of dark pools. Again, one of the things I try to remind you guys is that you will very rarely find me on a polar position because I've spent my entire life trying to be able to analyze things from a midpoint. I still will lean towards a certain opinion, but even something like dark pools, which generally has a really negative undertone to it, which I don't disagree with, there are still net positives within it. Now, in terms of whether it's an aggregate net positive, I don't think so. Because again, whether or not a big institution can get a clean fill,",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 84,
      "start_timestamp": "00:12:02",
      "start_timestamp_seconds": 722.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=722"
    }
  },
  {
    "text": "dark pools, which generally has a really negative undertone to it, which I don't disagree with, there are still net positives within it. Now, in terms of whether it's an aggregate net positive, I don't think so. Because again, whether or not a big institution can get a clean fill, I really don't care. I think they should be participating for price discovery just as I should. However, I also do understand and I can analyze it from their perspective, because that would be really annoying after a while. Without a doubt, it would be very, very frustrating. So that's kind of the good side. Now, the bad side is because of the way that dark pool orders are routed, it then does not help with current state price discovery. Justin says, I meant, how do you sleep at night after doing the evil things like making money off of these situations? Oh, yeah, and I knew what you meant, Justin, it was hilarious. I was just kind of playing along with you. Yeah. So the papers that I want to look at with you all are these, and I haven't read through these fully yet. There was a bunch of them that I shared with Newton to include on his absolutely massive GME Google sheet, which if you guys are not familiar with it, I think you need to grab this. So this is a link to, yeah, so that's a link to the GME to the GME Google",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 84,
      "start_timestamp": "00:13:20",
      "start_timestamp_seconds": 800.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=800"
    }
  },
  {
    "text": "of them that I shared with Newton to include on his absolutely massive GME Google sheet, which if you guys are not familiar with it, I think you need to grab this. So this is a link to, yeah, so that's a link to the GME to the GME Google sheet that he maintains, which is just, it's one of the best repositories of information that I could conceivably come across. So when I look at this, there's a ton of great data. One of the things that I wanted to dump in here is a bunch of stuff about this order routing. So I thought we could start by looking through this. Zach says he's got a bounce. If you have time later in the stream, we'd love to look at Chewy 5,000 block calls purchased prior to the RK's 624 share purchase. Yeah, we can take a look at that. Let's take a look at that real quick. This will be the easier tool for us to do that with. Let's do Chewy. And then you said before the 624 share purchase. So then there's 624. So then I think we did this before. And then let's see, this is calls inputs. Let's do just calls. Let's do just at the offer. And then let's sort by size. I literally don't see any 5,000 blocks. I see zero of them. Maybe we'll go back further. We'll do like May to 21 June. Yeah. So Zach, I see zero",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 84,
      "start_timestamp": "00:14:31",
      "start_timestamp_seconds": 871.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=871"
    }
  },
  {
    "text": "this is calls inputs. Let's do just calls. Let's do just at the offer. And then let's sort by size. I literally don't see any 5,000 blocks. I see zero of them. Maybe we'll go back further. We'll do like May to 21 June. Yeah. So Zach, I see zero of those. I see one 10,000 block, which was massive. And that was at the 27. But still, these were pretty far out of the money at the time. So it was a relatively cheap trade. So Zach, whenever you're checking out the recording, I literally don't see any of those. Because I think people asked me to look at this before. There were blocks of 500. And this is actually one of the things I wanted to do with you all is go back at some of his older positions. Because the way that he builds his options positions is again, like this is one of the reasons why this is so fascinating to me is that this is literally like it's it's a big puzzle with a world that I'm infatuated by. I love markets. I love markets. It's what I do. So the fact that there's this big puzzle in here is just really, really interesting to me. Anthony says it's hard as they positive. What a shitty day. No, you can't feel like that, man. The way that I would look at stuff like today, depending on, it really comes down to like what the thesis",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 84,
      "start_timestamp": "00:16:04",
      "start_timestamp_seconds": 964.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=964"
    }
  },
  {
    "text": "big puzzle in here is just really, really interesting to me. Anthony says it's hard as they positive. What a shitty day. No, you can't feel like that, man. The way that I would look at stuff like today, depending on, it really comes down to like what the thesis is and what you're trying to do. And I think one of the big things that I find people in the ape community do is I don't know why y'all do it to yourselves. But you guys like set yourselves up for this really, really tough emotional roller coaster where we try to, you know, speculate on a specific date for a specific movement to happen, like those kinds of things. And it to me, I would also become exhausted after a while trying to maintain that. So when I look at something like GameStop today, maybe we'll talk about this for a second, then we'll get into the nerd stuff because I do want to address that. This is not bad. It's going down. Shit goes down sometimes. But if you take a look literally at where it's at now, literally from middle of April until today, it is over double where it was. That's not bad. Again, I know a lot of people are really, really clinging on for this really big squeeze for Moas, which I'm still learning more in context of what that actually means for people. But I wouldn't get disenfranchised when you see something",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 84,
      "start_timestamp": "00:17:34",
      "start_timestamp_seconds": 1054.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1054"
    }
  },
  {
    "text": "over double where it was. That's not bad. Again, I know a lot of people are really, really clinging on for this really big squeeze for Moas, which I'm still learning more in context of what that actually means for people. But I wouldn't get disenfranchised when you see something going down. It's part of general natural price movement. And you can also see that there's tons of people that are still at the point of control here. So that means that a lot of people like transacting even at higher prices. So I wouldn't view this as terrible. I wouldn't view this as great. Like obviously I don't want it to go down either. I have a position on in here. But it also doesn't mean anything to me necessarily because the stock is going to do whatever it's going to do. So if I get too emotionally wrapped up in the movement of lines on a chart that puts me in just a compromised mental and emotional state that I'm literally handing control over my emotions to something I have no control over. I cannot pick where GME goes. So I'm not going to base how I feel on something that I can't control. When I think about something, Anthony says, are you blind or something? This is bad. Again, context, right? When I look at something like this that on 9 on 16 April was at 9.95. And then I look at it even after it's down",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 84,
      "start_timestamp": "00:18:40",
      "start_timestamp_seconds": 1120.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1120"
    }
  },
  {
    "text": "on something that I can't control. When I think about something, Anthony says, are you blind or something? This is bad. Again, context, right? When I look at something like this that on 9 on 16 April was at 9.95. And then I look at it even after it's down for essentially two weeks straight, even after it's down for two weeks straight, it's still over 20. It's still double plus where it was a few months ago. Stocks can try to make this kind of move from 9.95 to 21. They do that in like five years. It takes forever. So yeah, it absolutely, again, it's all context based. Anthony says, technicals are bad. I don't disagree with you. Like right now, it is absolutely pulling back. There's no doubt stocks do that. Find me a stock that doesn't do that. This isn't this isn't a thing. Right? So if I look at Tesla, a company that is done insanely well. And let's take a look at a different context. It still hasn't gotten back up to where it was last September. Right? Like stocks go multiple directions. This is completely, completely normal. So for something like GameStop to be going through a pullback, it's like, of course, this is normal. What what stock doesn't do this? So again, to me, you have a choice, right? You can view it as this terribly negative awful scenario. And I mean, you're welcome to do that. To me, the argument I",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 84,
      "start_timestamp": "00:19:53",
      "start_timestamp_seconds": 1193.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1193"
    }
  },
  {
    "text": "be going through a pullback, it's like, of course, this is normal. What what stock doesn't do this? So again, to me, you have a choice, right? You can view it as this terribly negative awful scenario. And I mean, you're welcome to do that. To me, the argument I kind of offer to you is that your emotional attachment to it literally does nothing for the stock. It's not going to make the stock go up. So the only thing you're doing is getting yourself wound up over something you have zero control over, which to me is a just a greaseless waste of time and energy. The way that I would look at it, if I was like really, really, really wanting GameStop to go up, I know a lot of people they have this is like a massive part of like their retirement plans and shit like that. If that was my scenario, I would literally just pick points at where I like it and then DCA dollar cost average. That's if I really like it. But if you feel weird about it, just you don't have to do anything with your position. You can always scale your position down. There's a million ways that you can play something like this. The other thing I would offer to you that I think you might want to hear, although it's uncomfortable is that one of the best, one of the like the transformative things I've done as a",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 84,
      "start_timestamp": "00:21:27",
      "start_timestamp_seconds": 1287.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1287"
    }
  },
  {
    "text": "your position down. There's a million ways that you can play something like this. The other thing I would offer to you that I think you might want to hear, although it's uncomfortable is that one of the best, one of the like the transformative things I've done as a traitor. I've been doing this since 2007. I haven't always been this composed. I haven't always had this disposition towards markets because it takes time to develop the way you feel about things. But when I look at something like this, the way I would be thinking about it, if I was like a true all in on GameStop Trader, which again, I keep it a buck with you guys. GameStop is part of my portfolio. I'm a traitor, but it's not I don't have all my chips on GameStop. But for the people I know people do and for the people that do, I would think of it from the context of before you finish pushing all of your chips onto it, think through the life cycle of the product. Think how it can behave and think how you will feel, how you will react, and then create a plan. That plan is literally what will sustain you during times when things are not going really well. A similar example, not exactly on same topic, SPX. So for those that don't know, I trade SPX a lot with different kinds of structures. And a big thing I do are",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 84,
      "start_timestamp": "00:22:40",
      "start_timestamp_seconds": 1360.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1360"
    }
  },
  {
    "text": "plan. That plan is literally what will sustain you during times when things are not going really well. A similar example, not exactly on same topic, SPX. So for those that don't know, I trade SPX a lot with different kinds of structures. And a big thing I do are zero DTE options. And there's a lot of other reasons. Why I use zero DTE options? Most of you don't care. And I'm not going to bore you with it. Just the context zero DTE means options that expire the same day. It means that there's a lot of them. When you're trading that kind of strategy, you can go through prolonged periods where you lose money. You can lose five days in a row, six days in a row, seven days in a row, eight days in a row. And during those periods, you kind of start asking yourself, you're like, shit, did I get this right? Is there a problem here? Should I do something else? I don't like losing this much. But what sustains me through those periods and something like this is I've done a ton of research on what I'm doing. And I know there's a process called path dependence. What that means is every once in a while, you're going to have an ugly or beneficial path where things happen to work in your favor or work against your favor. But if you are comfortable with the broader plan and you're like, yeah, okay,",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 84,
      "start_timestamp": "00:23:51",
      "start_timestamp_seconds": 1431.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1431"
    }
  },
  {
    "text": "a process called path dependence. What that means is every once in a while, you're going to have an ugly or beneficial path where things happen to work in your favor or work against your favor. But if you are comfortable with the broader plan and you're like, yeah, okay, losing eight days in a row is not my favorite. Wouldn't pick it. But I know that this is all part of a bigger system that in the aggregate works out, we will find a good path and take like this is a great example from the 12th of April to the 19th of April. They're all consecutive down days. Like that's not a great path. But then if you go over here to the 1st of July, up until the 10th of July, even though this was a down day, that's still a cure uptrend. This was a down day on a gap up. So that's a happy path. There's going to be happy path. There's going to be sad path. But what I try to encourage people to think about is not attaching happier sad by just thinking about the path of returns as they are. Things go up, things go down. If you think of it in this context, it's been going down pretty solidly since the 17th of July. If you take a look at where it was at here on the 2nd of May, it essentially didn't get a down tick until the 14th of",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 84,
      "start_timestamp": "00:25:06",
      "start_timestamp_seconds": 1506.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1506"
    }
  },
  {
    "text": "up, things go down. If you think of it in this context, it's been going down pretty solidly since the 17th of July. If you take a look at where it was at here on the 2nd of May, it essentially didn't get a down tick until the 14th of May. And these are massive upmoves. Look at the difference in context. So I would just encourage people that feel that way to reconfigure the emotional relationship with the market. Because what I can tell you is that if this kind of movement here makes you feel some type of way, this is going to be a tough business whether you use GameStop or another product. If something literally goes from 28 to 22 and that's causing indigestion, then I mean, one that tells me probably need to size your position down. That's one of the easiest ways to not care as much about stuff that's not going well. But then you have to be prepared to kick yourself because you're going to be pissed off when the thing goes up to 45 in the course of three days and you have a small position on. You can't have it both ways. And you have to decide what matters to you most. Are you trying to make sure that you can stay into this for the long run and minimize the downside, the drawdowns? That's okay. You can do that. But then there's going to be an up move at",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 84,
      "start_timestamp": "00:26:12",
      "start_timestamp_seconds": 1572.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1572"
    }
  },
  {
    "text": "both ways. And you have to decide what matters to you most. Are you trying to make sure that you can stay into this for the long run and minimize the downside, the drawdowns? That's okay. You can do that. But then there's going to be an up move at some point and you're not probably going to have the position size you would want for that. So as long as you can reconcile those two things and you're good. All right. A little bit of a rant. But I, one of the things I think a lot about with respect to trading is just how important the psychological component is to this. We all have access to the same stuff. So the reason why some people are successful and other people aren't. It's not because they have access to better tools. And it definitely is really nothing to do with once you have a base level of intelligence. It's not because you're smarter. I'm not that smart. So once you have a general understanding of things, then it really comes down to how well you can handle yourself as a trader, which takes time to figure out. So my hope is for people that are trading this kind of thing that they can develop a healthy relationship with it so that it doesn't cost stress so that you can kind of play the moves as they come as you feel comfortable and take advantage of the opportunities where they",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 84,
      "start_timestamp": "00:27:17",
      "start_timestamp_seconds": 1637.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1637"
    }
  },
  {
    "text": "hope is for people that are trading this kind of thing that they can develop a healthy relationship with it so that it doesn't cost stress so that you can kind of play the moves as they come as you feel comfortable and take advantage of the opportunities where they are. That's what I think. All right. So let me get caught up on some of the chat here. Viablo says patience people. Yeah. I think that that's right. I think that's absolutely right. MoneyTings says GME is 99 of my portfolio. The other one percent is split up between 30 other stocks. That's hilarious. Yeah. And I know a lot of people like to go really GME heavy. And that's absolutely cool. Like whatever makes sense for you as a trader is what matters. Again, it's not what I would do. It's not what I'm doing. I wouldn't put that much money into something like GME. But it's because I always classify myself as an overly conservative investor. That's one of the reasons why I'm so infatuated with roaring kitty is because he has literally a different constitution not even to be essentially in one individual product. That is whatever. I've been hyper concentrated too. But the fact that this dude can look at a position that's up 175 million and just hold it. I mean, that is what they again, I've told you guys this before. What it literally tells me is that this is not about money.",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 84,
      "start_timestamp": "00:28:24",
      "start_timestamp_seconds": 1704.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1704"
    }
  },
  {
    "text": "whatever. I've been hyper concentrated too. But the fact that this dude can look at a position that's up 175 million and just hold it. I mean, that is what they again, I've told you guys this before. What it literally tells me is that this is not about money. That's that's literally what that tells me. He was at a point in this trade here that he essentially could have conducted a cashless exercise on this entire position if he wanted. He had essentially enough money at this point to do that just about. And the fact that he just held it and just let it go. Like that tells me that there is a different motivation. There's a different focus, a different incentive, which is absolutely fascinating to me. Because most people, if you think of it in terms of like game theory, you can kind of war game what the motivations are and why we're doing things a certain way. And then you see this and you're like, yo, this doesn't align with any of that. This is a dude that is straight up up 250 million and just holding this shit. Like, it's nuts. So one of the really cool things about that I think is it just offers another perspective that there's a lot of different things. People want and try to accomplish in markets. And I mean, this is just absolutely incredible to see. So when it comes, you know, going all the way",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 84,
      "start_timestamp": "00:29:36",
      "start_timestamp_seconds": 1776.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1776"
    }
  },
  {
    "text": "of the really cool things about that I think is it just offers another perspective that there's a lot of different things. People want and try to accomplish in markets. And I mean, this is just absolutely incredible to see. So when it comes, you know, going all the way back to this idea of like setting up a portfolio, you just have to figure out what's right for you. And in Roaring Kiddie's video himself, he's like, this is a true yellow. And the dude has no problem doing that stuff, which is again, very, very cool. I think it's fascinating to learn about. So the punchline on that is you got to set things up in a way that makes sense for you. That's the, that's really what it boils down to because for me, I've made it clear, a big part of my motivation for trading was I grew up with a single mom didn't have sheep. She had like no money. She worked two jobs. The job that she spent most of her time working, she was an occupational therapist for mentally disabled kids, kids that literally are retarded. And she doesn't have a retirement. So I started trading because I knew she had no retirement that I was going to be the retirement. So for me, I can't, there's no room for yellow because the way that I trade is originally was to build money one so that I could change my lot in life",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 84,
      "start_timestamp": "00:30:55",
      "start_timestamp_seconds": 1855.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1855"
    }
  },
  {
    "text": "I started trading because I knew she had no retirement that I was going to be the retirement. So for me, I can't, there's no room for yellow because the way that I trade is originally was to build money one so that I could change my lot in life to be clear. There's also a selfish portion to it as well. I didn't want to live like that. But it's because I knew the only way she was going to retire is if me or my brother were in a position to help her. And my brother works really hard, but he does things differently than I do. So I kind of knew that I was going to be a big part of this. So all of that goes back. I don't share any of that as like a sob story. I'm very happy with my background, but it's so that people understand my context. That's why when you hear me say things like I don't really believe in yellows. That's the subtext. That's not to say I don't believe in yellows for anybody. You got to do what's right for you. It's slightly slightly different than yeah, then I think other people may or may not approach it from. So back over now to the nerd stuff. Kind of a fun philosophical conversation. I enjoyed that. All right, let's see. So this paper is a little bit old and it's called the off exchange routing decision. You guys",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 84,
      "start_timestamp": "00:32:07",
      "start_timestamp_seconds": 1927.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1927"
    }
  },
  {
    "text": "I think other people may or may not approach it from. So back over now to the nerd stuff. Kind of a fun philosophical conversation. I enjoyed that. All right, let's see. So this paper is a little bit old and it's called the off exchange routing decision. You guys can all download this for yourself off of SSRN. I do this on purpose. And the reason why I do this is so that you all can gain access to the same information that I'm looking at. You should always be able to repeat data that you see. If the data is not repeatable, then there's a problem. So this is looking at over the counter market specifically. So there's it that's just an important context here. So it says a rising fraction of US X to D trading volume is being executed away from the national stock exchanges and on the over the counter market. So it develops the theoretical model of the decision to route exchange volume off to an ATS platform. And then it uses fin red data to compute weekly time series of market shares for non for OTC non ATS trading centers looking at the individual stock level from 2016 April to 30 June 2018. So let's take a look. We don't have to read through all of the specifics in here unless you guys really want to. I'm always down for that. But it looks at essentially what is this? Like over 2000, 2000",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 84,
      "start_timestamp": "00:33:04",
      "start_timestamp_seconds": 1984.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1984"
    }
  },
  {
    "text": "individual stock level from 2016 April to 30 June 2018. So let's take a look. We don't have to read through all of the specifics in here unless you guys really want to. I'm always down for that. But it looks at essentially what is this? Like over 2000, 2000 stocks. It looks at a really, really broad basket of things. So here we see the average trade of off exchange executions and our sample shows that only 0.1 of ATS transactions are 10,000 shares or more the traditional block size block trade size. Notes that only 2.53 of the trades through T C non ATS dealers are block size. Both off exchange markets have small trade sizes even though the majority of trading is institutional. This I think is really interesting because the reason why I find this to be interesting is that it starts to kind of counter some of that broader narrative around why we route off exchange. So let's kind of skip through some of this stuff. I want to we'll start actually with the results and then we'll kind of work back up into any questions that we have. And really what I'm doing is I'm setting the table to work through this with you all. If you guys aren't familiar with this website, I'm not affiliated with them at all. But they have a really cool simplified tool to track off exchange volume for different tickers. And I wanted to work through this with",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 84,
      "start_timestamp": "00:34:34",
      "start_timestamp_seconds": 2074.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2074"
    }
  },
  {
    "text": "I'm setting the table to work through this with you all. If you guys aren't familiar with this website, I'm not affiliated with them at all. But they have a really cool simplified tool to track off exchange volume for different tickers. And I wanted to work through this with you guys for a few reasons. And the reason being is because the routing of orders off exchange isn't probably as crazy as you guys might think it is. But there are some really important commonalities that I think we need to be able to talk about. Because for example, when we look at this kind of movement here, right? This is a massive. This is when we saw that squeeze in 14 May. And during that squeeze, take a look at off exchange volume, it plummets. Right? So we know that this happens. This is, well, I think you guys know this, right? I don't think that this is groundbreaking news for anybody. When we start to see certain behaviors in the underlying price, we know historically that it moves the market makers and other entities to off exchange solutions. Cedric says dark pools are normal, but so is naked short selling besides when it was invented. Yeah. Well, the interesting thing about naked short selling again, it's similar to dark pools in that I don't believe naked short selling is all bad in theory. But I don't agree with it personally. The reason being is because naked short",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 84,
      "start_timestamp": "00:35:49",
      "start_timestamp_seconds": 2149.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2149"
    }
  },
  {
    "text": "naked short selling besides when it was invented. Yeah. Well, the interesting thing about naked short selling again, it's similar to dark pools in that I don't believe naked short selling is all bad in theory. But I don't agree with it personally. The reason being is because naked short selling, if done what I would consider to be justly would just increase market efficiency. The problem is as with anything related to capital or money, people are going to look for ways to game the system. And that's exactly what I think has happened with naked shorting. I think it's an abomination at this point. And I think it's completely fucked up with the way that they've allowed that to run out of control. And I think that it's actually my guess is it's not going to stay like that. And that's one of the reasons why I'm so happy with this Andrew left case, I got like a hair on my nose with this Andrew left case is because it starts to challenge this a little bit. And let me grab I actually haven't seen any of the latest here. I don't know if you guys have. I'm just looking it up really quick. The latest I see is two days ago. Here we go. There's one from stat. We could take a look through this together. And then take a look at this together. Let me grab the end of this though. I just want to see",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 84,
      "start_timestamp": "00:37:05",
      "start_timestamp_seconds": 2225.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2225"
    }
  },
  {
    "text": "just looking it up really quick. The latest I see is two days ago. Here we go. There's one from stat. We could take a look through this together. And then take a look at this together. Let me grab the end of this though. I just want to see what this was, what this summarizes. Conclusion here we go. Our model emphasizes that a stock traders routing choice balances possible price improvement. Let me just zoom this in more. I'll I'll get myself out of the way for a second so that you guys can see. All right. So this says our model emphasizes that a stock trader routing balances possible price improvement against lower probability of execution in the off exchange market wider spreads entice off exchange routing, which makes it ton of sense to trade within the spread a decrease in volatility lowers the range of spreads above and below to a break even level when there above average leads traders to prefer off exchange executions. So one of the things I think that's this is highlighting for you is that with something that's really volatile like GameStop, there's kind of an incentive to route off exchange because of the volatility and what that can do to price. And I think that that's also something that we've talked about before. I think that we had a general conversation not all that long ago about the impact that volatility has on the liquidity of things. So this doesn't",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 84,
      "start_timestamp": "00:38:10",
      "start_timestamp_seconds": 2290.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2290"
    }
  },
  {
    "text": "because of the volatility and what that can do to price. And I think that that's also something that we've talked about before. I think that we had a general conversation not all that long ago about the impact that volatility has on the liquidity of things. So this doesn't this just doesn't surprise me. And it says by leveraging Finra's transparency data, they construct a comprehensive sample. We find clear support for our model. Finra's data allows platform that a theoretical model suggests that heterogeneity among the platforms is primary around the probability of finding liquidity. Yeah. So what this is essentially summarizing, which to me is nothing it's nothing crazy, but it's essentially summarizing that the decision generally lies in the pursuit of liquidity, which again, I don't necessarily think that that surprises anybody. I mean, it definitely doesn't surprise me. That's just a logical, a logical decision based on the prospects of liquidity. So I would fully understand that choice personally. Lucidvio says it seems like a self fulfilling prophecy, the more you move to ATS in a way from the exchanges, the harder it is to get liquidity and the let exchange reinforce in the move. Yeah, you're absolutely correct. That is 100 correct. And the way that they're playing this kind of problem is they're just leaning on the near term benefit to the individual, not the longer term implication, which is fairly common, right? I think that that's probably not a giant surprise again",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 84,
      "start_timestamp": "00:39:47",
      "start_timestamp_seconds": 2387.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2387"
    }
  },
  {
    "text": "Yeah, you're absolutely correct. That is 100 correct. And the way that they're playing this kind of problem is they're just leaning on the near term benefit to the individual, not the longer term implication, which is fairly common, right? I think that that's probably not a giant surprise again to you guys. Oh boy, everyone's in a while I just get like one of the sharp shots of pain like that. It's kind of like a shitty game, but I'll tell you what, it definitely keeps you on the ball because there is no fully relaxing. So yeah, I thought that this was interesting. I wanted to look through it in general with you all. I think that you guys can poke through this pretty much as much as you want. There was a couple other takeaways that I wanted to talk about, which is exactly literally exactly what La La Sivio is talking about is that this creates a vicious cycle where as more volume is preferentially routed through ATS, it inherently decreases the depth on lit exchanges and then it increases the probability of more routing off exchange. Roaring Titty, who is being awesome, says chiropractor. I actually don't really like chiropractors. I was at the physical therapist today. That's actually the photo that I shot you guys in the discord. I was sitting there after getting like traction done and whatnot. So yeah, you're always active with trying to fix this whole thing, but I appreciate",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 84,
      "start_timestamp": "00:41:26",
      "start_timestamp_seconds": 2486.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2486"
    }
  },
  {
    "text": "actually don't really like chiropractors. I was at the physical therapist today. That's actually the photo that I shot you guys in the discord. I was sitting there after getting like traction done and whatnot. So yeah, you're always active with trying to fix this whole thing, but I appreciate it. Thank you very much. Roaring Titty, you the homie. The LABO says which screws normal investors sort of. Again, I think that's kind of dramatic to be completely honest. The reason why I think it's slightly dramatic is because these kinds of decisions really impact people who are trading at larger sizes. If you're trading at a smaller size, we still want is liquid of a product is humanly possible. We want active price discovery. Of course, we want these things. But when we're submitting a trade for 5,000 shares of GameStop, it's just not it's just not that liquid for us. And you can essentially get a fill. I mean, I've done it, right? Like you can get a fill on that order pretty easily over the course of just maybe one or two adjustments. So this becomes way more pertinent to entities that are trying to fill slightly larger trades is all. Again, I don't disagree with the point that I would prefer it being on exchange personally as well. But again, I keep going back to this for you guys. I really try to look at both sides of things. I want to understand the good,",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 84,
      "start_timestamp": "00:43:00",
      "start_timestamp_seconds": 2580.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2580"
    }
  },
  {
    "text": "slightly larger trades is all. Again, I don't disagree with the point that I would prefer it being on exchange personally as well. But again, I keep going back to this for you guys. I really try to look at both sides of things. I want to understand the good, the bad, the pros, the cons, that kind of stuff. And that there are some pros, some cons, but in this case, the impact to retail traders, it's not excessively massive. In terms of liquidity, I don't want to be misunderstood there. I find that especially a lot of people that are following along with the channel may be relatively new. They'll grab little things that I say. And yeah, they'll think that I'm they'll kind of twist it. I've got hit with a few of those so far. But I think, yeah, I think that there's essentially with respect to liquidity, it's not hyper detrimental to smaller retail traders like us. So if it's for price discovery, I think that's a pretty clear loss for everybody. I think it decreases price discovery. That kind of behavior. All right, let's take a look at this bad boy. This article analyzes the reach of the duty of best execution, the off exchange market makers and its implications in the evolving equity market structure covers such key themes such as comparative regulatory perspective on the source of the duty of best execution. This gets really technical. So this one I have read",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 84,
      "start_timestamp": "00:44:13",
      "start_timestamp_seconds": 2653.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2653"
    }
  },
  {
    "text": "the reach of the duty of best execution, the off exchange market makers and its implications in the evolving equity market structure covers such key themes such as comparative regulatory perspective on the source of the duty of best execution. This gets really technical. So this one I have read actually quite a few times. And I can kind of gloss over this with you guys. The reason why I want you to be aware of this though is because this duty of best execution is really tricky. And it's really tricky because there's a lot of gray area that comes with it. And things like payment for order flow, technically speaking, still fit into this concept of best execution even though payment for order flow, it could be made better. It's not optimal for retail traders. But again, I have to take a step back on that and make sure that I remind everybody that payment for order flow is still light years better for us than what this was when I started trading 15, 16 years ago. So while it's not perfect, it's not where I hope it ends up leading us. It's not terrible. So yeah, there's that. So anyways, let's see, let's see where we want to start. Carl says does that prevent the squeeze by keeping the stock liquid? Carl, could you, oh, it looks like you both are talking about squeeze. Sorry, can you guys talk to me about what if it allows large",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 84,
      "start_timestamp": "00:45:30",
      "start_timestamp_seconds": 2730.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2730"
    }
  },
  {
    "text": "that. So anyways, let's see, let's see where we want to start. Carl says does that prevent the squeeze by keeping the stock liquid? Carl, could you, oh, it looks like you both are talking about squeeze. Sorry, can you guys talk to me about what if it allows large block trades to be removed from the squeeze it favors those institutions and I see to a degree because the thing is is if, if something, if there's an order routing change, orders that are filled on a dark pool, they still get factored into the price eventually. So can it affect a squeeze? I would say yes, but I don't, I would argue that it can't stop a squeeze because one of the things that we can objectively analyze when we look at when squeeze is occur is the launch of on exchange volume on exchange volume starts to expand typically when we go through different kinds of squeezes. So it's because it kind of forces them onto an exchange. So I don't, I wouldn't say that it, yeah, I wouldn't say that it forces. I wouldn't say that it decreases the overall severity of a squeeze in terms of the propensity for it to happen. Again, dark pool volume is still going to be reflected in price eventually. And we can actually get to the bottom of that really quick. How long do dark pool orders take to be reflected in a stock's price? It says it can",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 84,
      "start_timestamp": "00:46:47",
      "start_timestamp_seconds": 2807.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2807"
    }
  },
  {
    "text": "of the propensity for it to happen. Again, dark pool volume is still going to be reflected in price eventually. And we can actually get to the bottom of that really quick. How long do dark pool orders take to be reflected in a stock's price? It says it can vary on the factors. Large dark pool trades, especially those executed close to the current market price can have an immediate impact. Dark pools often have delayed reporting of trades to minimize market impact. The reporting delay can range from a few seconds to several minutes. So like in that example right there, pyro gym says I thought dark pool trades were just private trades that wouldn't ever affect price action. Oh, interesting. No, let's see if there's like a, I wonder if there's like a, there's got to be like a cool visual or something. Let me see if there's like a cool visual. Hmm, don't see anything here. That's great. No, that's regulation. Here. I don't know. There's a really good book that I have on dark pools. That might be useful. Oh, we just got to let this get unfrozen and then we'll take a look. So there's a lot more. Here it goes. So where is it? This book right here. If you guys haven't read this, it's really is a pretty solid book that goes through essentially how dark pools were derived. Why they exist and how essentially they work. So there's a lot of",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 84,
      "start_timestamp": "00:48:16",
      "start_timestamp_seconds": 2896.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2896"
    }
  },
  {
    "text": "there's a lot more. Here it goes. So where is it? This book right here. If you guys haven't read this, it's really is a pretty solid book that goes through essentially how dark pools were derived. Why they exist and how essentially they work. So there's a lot of interesting nuance when it comes to dark pools. So typically there are standalone brokers or systems that will match dark pool orders. So the orders typically are executed anonymously and then they get like dark pool orders are still disclosed. You still can see them. There's just a delay. So Roaring TD says John Stewart is a great retail advocate. I think he is too. I think, um, yeah, and I think that he has an interesting perspective on it. I do know that his brother is like a pretty big part of one of the exchanges. So I don't know. I'm a little curious about the actual motivations. But yeah, I agree with you. I think he's he's overall decent. Alfonso says dark pool must report their trading activities to finra within 10 seconds. Yeah. So reporting to finra is one component, but then also reported to the actual market is a second component. So and they're still compulsory. So yeah, after the regulatory reporting, the trade details are eventually disclosed to the public typically within a few seconds to a minute. And then to your point, this says trades execute in dark pools are reported to regularly authorities",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 84,
      "start_timestamp": "00:50:10",
      "start_timestamp_seconds": 3010.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3010"
    }
  },
  {
    "text": "market is a second component. So and they're still compulsory. So yeah, after the regulatory reporting, the trade details are eventually disclosed to the public typically within a few seconds to a minute. And then to your point, this says trades execute in dark pools are reported to regularly authorities like finra in the US within a delay to maintain anonymity, which is what you're talking about. Um, that talks about why they're there. There's a couple different types of own dark pools. So broker dealer exchange independent and some of the independence are actually the larger ones, but broker dealers are like sigma acts cross finder those those sorts of things. So yeah, the the point is ultimately that there's it still is eventually reported. It's literally how we're able to generate lots like this. Like if you have a Bloomberg terminal, for example, on a Bloomberg terminal, you can see dark pool orders. So yeah, I think that's the interesting thing about them. Oh, it looked like I dropped for a second. I think we're back. So let me see. There's a. No, it says if I do a directed trade to a particular exchange, what about that? Gravitaris says are options included in dark pools or only shares. It's typically, it's typically not options. So if you're using something like options, they have, they have a different regulatory routing and all options will eventually go through the. Yeah, no, this says options are OCC. Yeah. So options",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 84,
      "start_timestamp": "00:52:04",
      "start_timestamp_seconds": 3124.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3124"
    }
  },
  {
    "text": "Gravitaris says are options included in dark pools or only shares. It's typically, it's typically not options. So if you're using something like options, they have, they have a different regulatory routing and all options will eventually go through the. Yeah, no, this says options are OCC. Yeah. So options are standardized contracts. Now the other thing that I'm not aware of, but I am curious about is with something like dark pools, if they can use exotic derivatives like different kinds of custom swaps and stuff. So yeah. All right, Marcus says I have a few questions. What are the rules for pre-market and after hour trades? Who trades? Is the any limits to volume? I don't know if there's limits to volume, but it essentially just comes down to those who have access and a lot of people have access depending on your broker you might have access. So pre-treat like pre-imposed market hour trading is not quite as elusive as people might think it is. The only downside to it is that things are typically very liquid during those periods. So Scott says are large derivative contracts reflected on the dark pool or they just float until realized? So I'm trying to understand your question. When you say large derivative contracts, are you talking about options positions? Because if so, then they're going to go across a little exchange typically. Matt says with the overall pain in the market right now, do you consider the cash GME",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 84,
      "start_timestamp": "00:53:46",
      "start_timestamp_seconds": 3226.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3226"
    }
  },
  {
    "text": "realized? So I'm trying to understand your question. When you say large derivative contracts, are you talking about options positions? Because if so, then they're going to go across a little exchange typically. Matt says with the overall pain in the market right now, do you consider the cash GME raised was a good move? Definitely. I think the cash that GME raised is overall good for them in general. And the reason why is because I think by going that route, it gives them like literally the best possible opportunity to reinvent themselves. Because again, I know the apes really love GameStop and do a lot to support GameStop, which I'm all about. I love that. From a broader company perspective though, as like a brick and mortar business, they like they have a offering, right? They do have things like we talked about on that one stream with Newton, which he and I, I think just so you guys know, I think he and I are locked in for our next stream on the 17th because I'm going to be out of pocket for a little bit. So the daily videos and stuff like that, they're going to dry up for about a week and change just so you guys know, I'm not like disappearing on you all. I'm just stepping, stepping out of the office as it were for a little bit. But I will be back. I will be back. But anyways, yeah, the next stream",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 84,
      "start_timestamp": "00:55:08",
      "start_timestamp_seconds": 3308.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3308"
    }
  },
  {
    "text": "dry up for about a week and change just so you guys know, I'm not like disappearing on you all. I'm just stepping, stepping out of the office as it were for a little bit. But I will be back. I will be back. But anyways, yeah, the next stream with Newton will be then, which is great because he and I we we're still texting essentially every day. And I have a million things that he and I are going to have to, he and I are going to have to cover. So yeah. But yeah, back to the original question, I think it's good. In a nutshell, I think it's good. I think having a bunch of cash is going to help them. And I think that by them increasing their cash position, it'll it'll it'll it'll it does allow them to innovate. Now, one of the things I was curious is they were going to start going on a little bit of a acquisition spree. But I haven't seen that really come to fruition yet, which actually surprises me a little bit because they raised a bunch of cash. And I thought that they were going to be a bit more active in using it. But I and this is one of the things that I understand the frustrations. Let me take a look at GME shareholder meeting. From the last shareholder meeting, I know that there was a lot of of angst, I guess you could",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 84,
      "start_timestamp": "00:56:32",
      "start_timestamp_seconds": 3392.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3392"
    }
  },
  {
    "text": "be a bit more active in using it. But I and this is one of the things that I understand the frustrations. Let me take a look at GME shareholder meeting. From the last shareholder meeting, I know that there was a lot of of angst, I guess you could say. There was some angst, I suppose, around what they talked about. I'm trying to look for the notes. It was 23 April, right? Is this correct? Do I have this right? GME Q2Ns tomorrow. Yeah. They're quarter well, a lot of companies are in the same same bucket there. Is this the right thing? Is this was this correct? I just want to make sure I'm looking at the right proxy statement. I wanted to read through this with you guys. I just don't know if this is the right thing. It looks correct. This is from 13 June. Yes. Okay. Cool. Thank you. Roy and Titi. The latency on this is kind of annoying. I have it set for low latency, but there's an ultra low setting, which I typically use. But normally, since I'm doing these with Newton through Zoom, there's a little bit more of a delay. But anyways, let's see. This is the board of directors stuff. Executive compensation, independent stock holder proposal. We don't care about these. We don't care about these. We do not care about these. Governance, clawback, compensation. So it looks like they are all getting 200,000 in two bucks. And",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 84,
      "start_timestamp": "00:57:38",
      "start_timestamp_seconds": 3458.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3458"
    }
  },
  {
    "text": "delay. But anyways, let's see. This is the board of directors stuff. Executive compensation, independent stock holder proposal. We don't care about these. We don't care about these. We do not care about these. Governance, clawback, compensation. So it looks like they are all getting 200,000 in two bucks. And stock. Except Ryan Cohen, right? I didn't see him. I think he's, I think you guys were saying, if I'm not mistaken, that he just buys his stuff. Blackrock. Wait, did you guys know that? That surprises me a little bit. It seemed like Blackrock was, I don't know, when I look through the the GME communities, it looks like in general, people don't like Blackrock. Or is that just Citadel that like the apes don't like? B.O.K. pensions. Blackrock owns a little bit of everything. They were behind Prop 4, low position for Blackrock. So Citadel, yeah, definitely saw Citadel people don't like. Okay, so it sounds like you guys are, yeah, no, I'm, I'm well aware of how deep Blackrock goes. Fun fact, some of the commercial real estate stuff that I do with some partners, we actually acquire things like student housing. We just acquired a couple more ski resorts that will then operate. And we start to find that some of the things that we're looking at, which is not like a small level, but it's not a big level that we start kind of bumping into to Blackrock, which is interesting. Homies are literally everywhere.",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 84,
      "start_timestamp": "00:59:10",
      "start_timestamp_seconds": 3550.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3550"
    }
  },
  {
    "text": "more ski resorts that will then operate. And we start to find that some of the things that we're looking at, which is not like a small level, but it's not a big level that we start kind of bumping into to Blackrock, which is interesting. Homies are literally everywhere. But yeah, no, I'm super well aware that Black Rock is nuts. Royne Titty says, look at Prop 4 on the boat. Yeah, sure. Is that up here? Let's see. Prop. Uh, four, can I count? What the fuck's that up? Okay, here we go. Prop one, prop two, prop three, prop four. Yeah, 41. That's what I was trying to get to. Okay, so now here's the next question. When I click 41 here, is it actually going to be this or is it going to be the stupid PDF difference? And 41 will be a couple pages off of this. Any guesses? So like one of my most like most annoying things I hate about PDF documents is it'll say the number here. And then when you click it, it'll be PDF something else. Let's see what page this is. What page is this? 35, not even close. Why? Why do they do this? It's so stupid. Everybody does this. I hate it so much. Just fucking make it match. Literally just make it match. Everybody knows that when you're going to use this, you're going to flip through like this. So give these pages. Oh, so stupid.",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 84,
      "start_timestamp": "01:01:34",
      "start_timestamp_seconds": 3694.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3694"
    }
  },
  {
    "text": "Why? Why do they do this? It's so stupid. Everybody does this. I hate it so much. Just fucking make it match. Literally just make it match. Everybody knows that when you're going to use this, you're going to flip through like this. So give these pages. Oh, so stupid. So stupid. You have to go to like not page fucking 41 or whatever. It's page fucking 47. Oh, so annoying. I hate that. I hate that so much. All right, here we go. Ranseside. We expect prop four to be presented to the control of New York cities, custodian trustee employees system. Eee, Eee, Eee, Eee, Eee, Eee, Eee, Eee, Eee, Eee, Eee, Eee, Eee, Eee, Eee, Eee, Eee, Eee, Proposal was submitted by the comptroller. Yees. Jeffrey Jones, what up? Good to see you. Cactus, Texas, Fliptables. No, I really, I have a really nice standing desk. That's actually how you guys will see me stand and sit throughout the things that the electronic big fan, big, big fan. This says, Shareholders, a GameStop request that board of directors disclose its annual proxies, statement, self-identified bullshit skills. Yeah, I don't care about any of that. Roryan Titty, what am I here for? Tell me what I'm supposed to be looking for because I typically trust you with what you send me to the board unanimously recommends that stockholders vote against Prop 4. The propose over requesting board skills and diversity matrix proxies solicited. I love that. Fuck yes.",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 84,
      "start_timestamp": "01:02:50",
      "start_timestamp_seconds": 3770.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3770"
    }
  },
  {
    "text": "am I here for? Tell me what I'm supposed to be looking for because I typically trust you with what you send me to the board unanimously recommends that stockholders vote against Prop 4. The propose over requesting board skills and diversity matrix proxies solicited. I love that. Fuck yes. What a shocking, what a shocking concept of trying to hire people based on fucking qualifications. This is great. GameStop does not set a specific minimum qualifications for nominees for director and does not have a policy regarding the consideration of diversity for such nominees. We do not believe diversity, whether gendered is a meaningful basis by which to identify and assess the qualifications of a director. I love this so much. This is fantastic. Our board is composed of individuals who exhibit these traits. Big fan. Big fan. That's awesome. Wait, where does it say who proposed it? Let's see if he says Microsoft just fired all the DEI people. Yeah, well, I think they started, I think companies are starting to get abreast. My guess is some of what's going on here is DEI was a giant focus for a little while. And then as that starts to come out of Vogue to a degree, I think people are realizing that hiring like specific DEI resources is a giant suck of resources. And I think that it, I mean, I don't want to go too far down the path of like, you know, diversity and whatnot, you know,",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 84,
      "start_timestamp": "01:04:28",
      "start_timestamp_seconds": 3868.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3868"
    }
  },
  {
    "text": "come out of Vogue to a degree, I think people are realizing that hiring like specific DEI resources is a giant suck of resources. And I think that it, I mean, I don't want to go too far down the path of like, you know, diversity and whatnot, you know, whatever. But my opinion is and has always been just fucking higher qualified people. I think that that's essentially the way I would want things to go. Pyrogym says the proposal was submitted by the New York City Comptroller. Udat though, we expect to be presented by the Comptroller of New York City as the custodian and a trustee of the New York City employee retirement system. I'm confused. I'm really confused. What is the New York City employee employee's retirement system has to do with this? Pension fund that owns GME. Oh, they're investors. Oh, I see. Lucidio says read the next paragraph. That's literally my favorite comment. Read you idiot. And it'll answer your question. There we go. Wait, you think BlackRock owns this? Let me see. That would be surprising to me if they did. New York State Comptroller. Yeah, because this to me seems like a government function, no. Roentit, he says BlackRock was behind that. I'm pretty sure. I thought I heard the Comptroller said BlackRock was 3.5 of the shareholders. Oh, I see. Chris Demel says he was hidden ahead too many times. Thank you very much. Patience. That's exactly right. I've had more",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 84,
      "start_timestamp": "01:05:55",
      "start_timestamp_seconds": 3955.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3955"
    }
  },
  {
    "text": "government function, no. Roentit, he says BlackRock was behind that. I'm pretty sure. I thought I heard the Comptroller said BlackRock was 3.5 of the shareholders. Oh, I see. Chris Demel says he was hidden ahead too many times. Thank you very much. Patience. That's exactly right. I've had more than my fair share of concussions at this point in my life. I really appreciate the support because you boy, I mean, realistically, you boy needs it. You boy just needs it. So yeah, thank you. Thank you, Chris, spelled with a K. My brother's name is also Chris, but spelled normally. Chris with a K is kind of, it's kind of aggressive, I think. It's cool, but a little bit different. But yeah, this looks like a government system. I don't see BlackRock here. So where is their involvement in your, like, that you guys are speculating on? Let me see really quick BlackRock involvement. The okay might be the admin. So this says, Chatchy PT says the New York City employees retirement system is actively involved with BlackRock, both as an investor and as a client. NYCRS has approximately 40 million invested in BlackRock, which makes sense. BlackRock manages around 19 billion on behalf of NYCRS. So you guys are absolutely right. See, this is why I fucking love apes, bro. You guys are always in on shit. You guys know what the fuck is going on? So yes, recently NYCRS has used its annual share power to",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 84,
      "start_timestamp": "01:08:03",
      "start_timestamp_seconds": 4083.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4083"
    }
  },
  {
    "text": "manages around 19 billion on behalf of NYCRS. So you guys are absolutely right. See, this is why I fucking love apes, bro. You guys are always in on shit. You guys know what the fuck is going on? So yes, recently NYCRS has used its annual share power to influence decisions at BlackRock, particularly concerning the appointment of board members. NYCRS along with the New York City Comptroller Brad Lander, urged BlackRock share holders to vote against the election of a min nacer, the CEO of Saudi Aramaco, the BlackRock's board. The opposition was based on potential conflicts of interest over human rights, climate issues, yadda yadda. Despite the efforts of NYCRS, including filing an exempt solicitation with the SEC and highlighting the risk of having on the board, BlackRock share holders ultimately reelected him. The filing pointed out that the position, SEO of Aramaco, a major fossil fuel company conflicts with BlackRock stated goals of decarbonization, the involvement. So it looked, that's a really dynamic relationship as I read about it. It's both. So it doesn't look like BlackRock controls this. It looks like there's actually a little bit of back and forth there, which I find really, really interesting. Benoit Balls says pronounced Aramco. Aramco. I like Aramco, so they can go fuck themselves. I call them Aramaco. That's what I call them. Marcus says a little long objective in scope to keep objective these guidelines are to ensure inclusive culture. Yeah. That's interesting. Well, it's good.",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 84,
      "start_timestamp": "01:10:08",
      "start_timestamp_seconds": 4208.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4208"
    }
  },
  {
    "text": "really interesting. Benoit Balls says pronounced Aramco. Aramco. I like Aramco, so they can go fuck themselves. I call them Aramaco. That's what I call them. Marcus says a little long objective in scope to keep objective these guidelines are to ensure inclusive culture. Yeah. That's interesting. Well, it's good. They got shot down. Bax. Financial statements. All right. That's that. I was curious if they had anything about the cash. I think we can probably kill this. All right. So the next thing that I wanted to take a look at with some of old roaring kitty option straights for me to develop his fingerprint a little bit more. But we can, we can again, anything that you guys want to take a look at throughout in the chat. PyroGym, what was that book on Algo Wars? There's two of them. So the one that I was referring to you guys before was called Dark Pools by Scott Patterson. Is that one? Justin says arcade charts. Can I post a link? Yeah. Happy to take a look. I don't think you can post a link. Roaring titties. The one that educated me that that you can't. I don't think it lets anybody else because it's straight up disrespectful. Money Ting says lawsuit. Yeah, let's take a look at that lawsuit. And so anyways, a couple of books that I think you guys should check out. Dark Pools is a great one. And then trading in exchanges. This is like",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 84,
      "start_timestamp": "01:11:31",
      "start_timestamp_seconds": 4291.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4291"
    }
  },
  {
    "text": "it lets anybody else because it's straight up disrespectful. Money Ting says lawsuit. Yeah, let's take a look at that lawsuit. And so anyways, a couple of books that I think you guys should check out. Dark Pools is a great one. And then trading in exchanges. This is like one of the best, literally one of the best, just general. It's old, unfortunately. But it's got a ton of great market structure details in there. And then inside the black box is also, I think, pertinent to you all here, which is pretty cool. All right. So Justin says Rory, Rory, Kit, Dinger, Dark Charts. Wait, do you mean the ones from... I was going to grab the ones from Newton, no? No? Because Newton, I think on his Google sheet, he has like the list of arcades, arcades charts from Yahoo Finance, right? Am I off base here? Yo, I tell him all the time that I love what he's doing, but I can't find shit on here. And he has this stuff mapped like the back of his damn head. It's crazy. Nah, RK has his own stock charts. All right, where am I supposed to go? So I thought I was looking at Rory and Kitty's charts. But you guys are saying that he has his own shit. Oh, sorry, didn't mean to hit the mic. Where the hell's this chart? Go to stock charts, got it. Go on to stock charts as directed. I am",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 84,
      "start_timestamp": "01:13:19",
      "start_timestamp_seconds": 4399.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4399"
    }
  },
  {
    "text": "So I thought I was looking at Rory and Kitty's charts. But you guys are saying that he has his own shit. Oh, sorry, didn't mean to hit the mic. Where the hell's this chart? Go to stock charts, got it. Go on to stock charts as directed. I am now at stock charts. And then I'm supposed to look up Rory and Kid and Gour. Nothing pops up. Am I in the right spot? Oh, Rory. Rory. The disrespect. Not giving me shit. All right, Rory, Rory, Kid and Gour, stock charts. This pops up. Rory. I can't. I don't think you guys can drop. Oh, if you put it in the discord, I can find it. If any of you guys are in the discord, if you drop it in there, I can grab it in like two seconds. They'll be much faster. Rory and Titi is making sure you all know that links do not show up in here by default. Let me see. I'll try to do like a control F in here. Aha. This one. Did we find it? Hey, yeah, this is the one that Newton has on his stuff. We found it. We did it. I just have to see if I can find it in here because he has it in here somewhere. This one. Man, you guys sent me down. Damn it. I knew they had it. All right. We found it. We're good. We found it. We made it. I",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 84,
      "start_timestamp": "01:15:00",
      "start_timestamp_seconds": 4500.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4500"
    }
  },
  {
    "text": "did it. I just have to see if I can find it in here because he has it in here somewhere. This one. Man, you guys sent me down. Damn it. I knew they had it. All right. We found it. We're good. We found it. We made it. I think that this might cause for a slight celebration. Cheers, everybody. That's a problem. It's a big problem. So right now we're out of crystal. That one's gone. The mango orange. That's now gone. So we are moving on to the backup beverage, which is what do we have? Blackberry lemonade. I forgot to put my hand behind it, I think, so that you can see it. Blackberry lemonade. There we go. We're back in it. Your boy consumes a lot of liquid. All right. So let's see what, what do you guys want to look at here? Anything in particular? What do I see? This one I don't really care about to be honest because it's all intraday. It's like really, really short term stuff. Let me move this back over here. Move this over here. And then I'll get rid of myself again because nobody really cares to see me. And then this way you guys can see a little bit better. I will zoom us in. That should be decent for you guys. Yeah. All right. So what do we want to look at? It looks like Roryntady says, roll down. And then we want to look",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 84,
      "start_timestamp": "01:17:26",
      "start_timestamp_seconds": 4646.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4646"
    }
  },
  {
    "text": "see me. And then this way you guys can see a little bit better. I will zoom us in. That should be decent for you guys. Yeah. All right. So what do we want to look at? It looks like Roryntady says, roll down. And then we want to look at RSI pre 2011. And the ones kitty has circled are interesting. Let's do it. Let's see what those look like. Okay. I see. So this is on a weekly. And he's using a 14 day RSI. And he's showing it looks like a divergence here is what I'm seeing. So this was back in 2021. And he's just showing a couple instances where it looks like RSI divergence. The problem I would say, let me slide that out of the way. Let's go to GameStop. Let's do again, we can essentially recreate it to a degree. We'll do a 10 year weekly. And if we zoom this in. So it's a little easier to see. Let me go to 21 here. Let's zoom this in more. So the CCI also did a similar thing, right? So one of the first things to note is oscillators are slightly notorious for a lot of mixed triggers. And again, I've spent a lot of, oh, shit, pyro MGM. I was calling you pyro Jim in my mind, but pyro shout out to you. Welcome to being an outlier supporter. Really, really appreciate it. I also realized that I'm still a ghost here.",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 84,
      "start_timestamp": "01:19:05",
      "start_timestamp_seconds": 4745.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4745"
    }
  },
  {
    "text": "a lot of mixed triggers. And again, I've spent a lot of, oh, shit, pyro MGM. I was calling you pyro Jim in my mind, but pyro shout out to you. Welcome to being an outlier supporter. Really, really appreciate it. I also realized that I'm still a ghost here. So here I am. I'm back. Can't get rid of me. I also just looked at myself for the first time on this stream. And I didn't realize that one that I was like glowing. Take hold on. Let's, let's play a game. Let's turn this brightness like all the way up. Check that out. Oh my God, that goes super bright. There it is. Feels like I am looking at the sun. But anyways, the other thing I realized looking at myself is that you boy need to haircut because this is just not it. Justin says angelic. Maybe if we put it behind me, it would look a little more angelic, but nothing about me is angelic. So anyways, looking at oscillators, oscillators have a really mixed track record. And I think it's important to be aware of that because I can find a lot of instances, even with something like CCI where CCI is very high and prices diverging. So I just, I think it's important to point that out, but let's add a study here. And then let's take a look at RSI specifically. And he's using a 14 day RSI, which is a default setting,",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 84,
      "start_timestamp": "01:20:38",
      "start_timestamp_seconds": 4838.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4838"
    }
  },
  {
    "text": "with something like CCI where CCI is very high and prices diverging. So I just, I think it's important to point that out, but let's add a study here. And then let's take a look at RSI specifically. And he's using a 14 day RSI, which is a default setting, by the way. Yeah. So we have 14 day RSI here. And then we'll just leave that for now. And again, I'll get rid of myself so that you can see me. And so what I see here is again, the same thing where obviously it's going to line up with what you're tracking on his chart, right? Like this big, big divergence. But the thing is, is you'll find other instances where RSI is peaking or even CCI is peaking. And stock price isn't necessarily playing ball. And you'll find the inverse where you will find something like CCI or RSI. Again, it's, it's just a oscillator. You can essentially call all the oscillators the same thing. They like, they behave slightly differently, but they're all the same shit. So you'll find instances where the oscillators are actually declining and the underlying is going up. So it's just something to be aware of, right? There's nothing wrong with using oscillators. I again, I have one. There's a reason why I use CCI is because based on my studies for the stuff that I trade CCI tends to behave a little bit better for my needs. But yeah, anyways, I",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 84,
      "start_timestamp": "01:21:49",
      "start_timestamp_seconds": 4909.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4909"
    }
  },
  {
    "text": "to be aware of, right? There's nothing wrong with using oscillators. I again, I have one. There's a reason why I use CCI is because based on my studies for the stuff that I trade CCI tends to behave a little bit better for my needs. But yeah, anyways, I figured we would take a look at it in here, but we can go back to these charts though. I'm finished poking through. Dr. Zeya says, CCI measures the current price level relative to an average price level over a given period time. Yeah. Oh, I think you were just explaining what CCI is for people. Thank you very much. I did not realize that it wasn't well understood. My bad. That's on me. Let's see what else is in here quick. Money ting says, don't forget about the lawsuit. Yeah, we'll pull that up right after this promise. Let me grab that. GME lawsuit dropped. And we'll grab that from routers. So we won't we won't forget. We won't forget again. Hania says NSSC is making a new system for exercise options, allowing FDDs to be infinitely FDD tomorrow. Well, we'll take a look at that. We'll take a look at that a little. Oh, fuck. Sorry, the transitions really are uncomfortable as fuck. We'll take a look at that as well. But the fact of the matter is, if we think about FDDs, they're already allowed to be perpetually deferred as annoying as it is, as much bullshit",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 84,
      "start_timestamp": "01:23:13",
      "start_timestamp_seconds": 4993.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4993"
    }
  },
  {
    "text": "look at that a little. Oh, fuck. Sorry, the transitions really are uncomfortable as fuck. We'll take a look at that as well. But the fact of the matter is, if we think about FDDs, they're already allowed to be perpetually deferred as annoying as it is, as much bullshit as that is, because we can see a lot of instances where things are running higher FDDs and nothing happens. So yeah, I mean, we'll take a closer look at that. But let's finish here. And it says, camp hire says, what does the blue dotted line on the first chart represent? Let's go. Blue dotted line. This, to me, that just looks like a center line. You mean this one in here, the horizontal line in the RSI or which blue dotted line. Talk to me. At 23. At, oh, and think or swim. Yo, that's confusing to me. You have me tripping. A blue dotted line and think or swim. I don't know if I have one of those. It sounds like you might know my chart better than I know my chart. What blue dotted line are you talking about in here? It's a small dotted line on the chart you had up. So this one's think or swim, right? Dr. Zaya says, blue dotted line and think or swim. Camp hire says it's a small dotted line on the chart you had up, which is this one. Do you mean here? Over here? That looks like",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 84,
      "start_timestamp": "01:25:01",
      "start_timestamp_seconds": 5101.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5101"
    }
  },
  {
    "text": "on the chart you had up. So this one's think or swim, right? Dr. Zaya says, blue dotted line and think or swim. Camp hire says it's a small dotted line on the chart you had up, which is this one. Do you mean here? Over here? That looks like a price level. Like right at the end, I see, yeah, okay. Yeah, that's just a price level. I don't think that that really means anything more than that. Yeah, I think it's just a price level. Is there anything else that we wanted to look at on these charts before we go over to that case? Also, let me. I kind of want to try one second. YouTube change stream latency midstream. I'm trying to see if there's a way to change the latency while we're still live. I might wait a little bit later just in case it nukes it. I think I can stop streaming and then it might let me do it, but I'll try it later. Look at the RSI that RK circled. Okay, let's find that. I think we were just looking at that, weren't we? This one. We were just looking at this one. This, I think he was just highlighting a divergence. This doesn't. Yeah, this doesn't really. At least I don't think this means a whole lot at least to me. There's another one higher to this one. Let's see. Cody says cat ears. I mean, it could be cat ears",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 84,
      "start_timestamp": "01:26:42",
      "start_timestamp_seconds": 5202.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5202"
    }
  },
  {
    "text": "one. This, I think he was just highlighting a divergence. This doesn't. Yeah, this doesn't really. At least I don't think this means a whole lot at least to me. There's another one higher to this one. Let's see. Cody says cat ears. I mean, it could be cat ears if the cat has one really good ear and then one terrible fucked up ear that has like a mutation coming out of it. Cedric says undersold two times made big move up. Well, this wouldn't be this wouldn't be undersold. This would be. Yeah, like this is something that's technically overbought things that are running up that high. Cedric says volume RSI sloping up after being undersold. Yep. Yeah. Okay, I see you guys are doing. I would recommend not doing that. The reason why I think that there's a bit of an issue is because again, like the looking back at price movements and corresponding them to different kinds of indicators is like the purest form of overfitting and you can find tons of instances after the fact. It's very easy to do. So it creates a natural conflict in kind of our minds. So let me move this up. The price chart is a little squished, but that's okay. It doesn't necessarily matter too much. And let's like let's do that same exercise, right? Like let's say that I see a significant Cedric says you won't find one with big volume after being oversold. Right here. What",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 84,
      "start_timestamp": "01:28:45",
      "start_timestamp_seconds": 5325.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5325"
    }
  },
  {
    "text": "this up. The price chart is a little squished, but that's okay. It doesn't necessarily matter too much. And let's like let's do that same exercise, right? Like let's say that I see a significant Cedric says you won't find one with big volume after being oversold. Right here. What do you mean? Cedric says you won't find one with big volume after being oversold. So this is oversold. And then this is big volume during the oversold. Cedric says that's the key means another one. Oh, I see. Yeah, let's take a look. And but see the one from the chart we're looking at is from 2021. And this one was from yeah, these are from 2021. I see what you mean. I'm following now. So you're saying that RK is saying to look back at this and use this as a reference? Okay, got it. Yeah, let's take a look. Let's go to let's do like a 10 year daily. Right here is an example where volume was oversold. It had relatively big spike in volume and price didn't move much. Here's another example. Here's another example after the fact. So those are four additional instances where price was marked oversold and it had larger confirmatory volume. And in this case, the big move already happened when you got that indicator. Cedric says those have bullish, of course they do. That's what I'm trying to explain to you is that this is after the fact. Right. So after",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 84,
      "start_timestamp": "01:30:35",
      "start_timestamp_seconds": 5435.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5435"
    }
  },
  {
    "text": "was marked oversold and it had larger confirmatory volume. And in this case, the big move already happened when you got that indicator. Cedric says those have bullish, of course they do. That's what I'm trying to explain to you is that this is after the fact. Right. So after the fact, it's so easy to say like, oh yeah, it went up here and then this all happened. When you're when you're forward looking, the line changes based on what's happening today. So what this isn't capturing are the periods like here, right? This line is also oversold and when like that's the nature of the oscillator is that you're always essentially going to find that as the oscillator is high, price will be high as the oscillator is low, price will be low. So that part is like really again, it's really easy to align that looking back in time. But when you're looking at Cedric says that's overbought, no, yeah, that's what the red is up here. Above 70 is overbought. So that's bullish that tip like in order for in order for it to get to overbought, price has to have moved up and in order for it to get to a point where it's oversold, price has to have moved down. So that's the concept, right? Overbought meaning too many people bought it, driving price up oversold, too many people sold it, driving price down. So Cedric says I don't want to see it at",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 84,
      "start_timestamp": "01:32:41",
      "start_timestamp_seconds": 5561.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5561"
    }
  },
  {
    "text": "for it to get to a point where it's oversold, price has to have moved down. So that's the concept, right? Overbought meaning too many people bought it, driving price up oversold, too many people sold it, driving price down. So Cedric says I don't want to see it at red. I mean, I don't know why because when it's at red is when it's peaking. The highest moves you're going to see from a historic perspective are going to be when it's above 70. That's what pushes it above 70. That's what RSI is looking at. Literally those moves specifically. So I think that you actually want, I think you want it to be red actually because that's when you're going to see it making the bigger up moves. That's what drives it above 70. If you don't have bigger up moves like that, it won't make that kind of move. Justin says I want to see blue then red. I mean, if we're up to me, I would want to see no blue. Again, in order for it to be blue, it means it needs to be pushed down. It needs to be really, really low. So then you'll see like a period here where it's deep blue and it ran that way and then it just declined from that period for some time and still it started getting strength. Riantiddy says am I the only one confused? Oh, shit. I didn't realize that this was confusing. Yeah.",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 84,
      "start_timestamp": "01:34:10",
      "start_timestamp_seconds": 5650.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5650"
    }
  },
  {
    "text": "you'll see like a period here where it's deep blue and it ran that way and then it just declined from that period for some time and still it started getting strength. Riantiddy says am I the only one confused? Oh, shit. I didn't realize that this was confusing. Yeah. Let's, okay. So RSI relative strength indicator. I can grab you the actual permutation for that's calculated one sec. RSI. Here you go. So there's two papers that I would refer you to. This is a good paper on it. So I would highly recommend checking this paper out. It goes through the actual kind of math behind it. And so, um, Cedric says I buy oversold stock, not overbought. I mean, yeah, that could be your approach. Whatever, whatever makes it happy is cool. But what I can tell you is shit that's oversold is going down. So me personally, that's, that's not when I buy stocks. I buy things. If I'm buying stock, I want something to go up. So I'm going to wait for it to be going up. The problem is what you're employing is a really common trader behavior, which is bargain buying. And it's a misapplication of a really standardized thought process that you have as a human consumer. So we're taught from a natural perspective to enjoy bargains. We like sales. Right. That's why if you go to a lot of stores, they have sales perpetually. Is it really a sale? If there's",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 84,
      "start_timestamp": "01:35:19",
      "start_timestamp_seconds": 5719.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5719"
    }
  },
  {
    "text": "a misapplication of a really standardized thought process that you have as a human consumer. So we're taught from a natural perspective to enjoy bargains. We like sales. Right. That's why if you go to a lot of stores, they have sales perpetually. Is it really a sale? If there's always one going on, no, not at all. It's just a marketing ploy because they know people like sales. The problem with that with respect to something like carrying that over to the market is that things that are on sale are on sale for a reason. Means they're going down. So if I'm buying stock and I want something to go up when I buy stock, I don't want to buy it when it's going down. I want to buy it when it's going up. That takes a long time in order to like reconfigure the mind, but you'll make you'll typically do much better in that way. Or you can be like Las Sejas, the yummy and says it rips. I watch total phone numbers. So they're not trying to buy at a discount or to buy when it's oversold or too low, but they're just buying and they're going to keep buying, which that's totally chill. That's another approach. Now the idea, yeah, Chris says, oh, fuck here we go. Chat needs fixed ASAP. That confused me. That sentence, not following you there. But yeah, I think, I think, Cedric says I meant like back test on",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 84,
      "start_timestamp": "01:36:43",
      "start_timestamp_seconds": 5803.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5803"
    }
  },
  {
    "text": "they're going to keep buying, which that's totally chill. That's another approach. Now the idea, yeah, Chris says, oh, fuck here we go. Chat needs fixed ASAP. That confused me. That sentence, not following you there. But yeah, I think, I think, Cedric says I meant like back test on GME buying oversold and only if bullish volume comes in. I'm trying to think of a way to explain that. So you're very rarely going to see that condition, where something is, wait, oversold or overbought. Let me make sure. Oversold and only bullish if volume comes in. Again, what you're going to find is when volume hits oversold, it's going to be at or when RSI hits oversold, it's typically going to be at the inverse extreme, then when it's overbought. So if we look at oversold here, let's just squish this down, look at volume. The majority of instances that you're going to see oversold is when volume is generally speaking, going to be relatively high on the sales side, but slowing down. That's when this will peak is at that juncture. And then to the upside, it's typically the inverse, where you'll see volume doesn't have to be by volume only, but you'll see volume very, very high when this is peaking, because again, that's what causes these peaks. It's a pretty standardized relationship with the tool. It's literally how it's calculated. It's what it's looking at. Leapfrog says, why not look at the three month chart?",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 84,
      "start_timestamp": "01:37:57",
      "start_timestamp_seconds": 5877.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5877"
    }
  },
  {
    "text": "be by volume only, but you'll see volume very, very high when this is peaking, because again, that's what causes these peaks. It's a pretty standardized relationship with the tool. It's literally how it's calculated. It's what it's looking at. Leapfrog says, why not look at the three month chart? Oh, we can look at the three month chart. I'm happy to. Anything in particular you want to peek out here? Justin says, I think he means a condition of oversold, followed by relatively high volume days after. What about that? Let me grab my RSI back. Oh, I still have it. My bed. We're looking at oversold still. Sorry, Leapfrogs. I have to switch from the three month so that I can see where Chris says your chart is like three minutes late. Yeah, I know there's a bigger delay than I like. Let me try. I'm going to try to stop the stream really quick from OBS and see if it lets me change it. Give me one second. All right, I think we're back. Unfortunately, it doesn't let me change the latency when it's on. This is the, it's because I'm using the one that I normally am doing when I'm streaming with Newton. Justin says, I think somebody says it would be a good by opportunity. Again, like I can tell you from a quantitative perspective, it's typically not, but if somebody likes it, I would not say don't do it. But you'll find periods like",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 84,
      "start_timestamp": "01:39:44",
      "start_timestamp_seconds": 5984.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5984"
    }
  },
  {
    "text": "am doing when I'm streaming with Newton. Justin says, I think somebody says it would be a good by opportunity. Again, like I can tell you from a quantitative perspective, it's typically not, but if somebody likes it, I would not say don't do it. But you'll find periods like those two indicators by themselves to me aren't sufficient. Like I wouldn't, I personally wouldn't base an entry decision off of the condition being light RSI, meaning oversold and expanding volume. Like that would not be enough for me. And it's because of the way that the tools are calculated. So yeah, I mean, it just requires more than that for me. Because for example, this starts hitting oversold here on this day up here, which again, the price is so flat here because of the extremes. I don't know if this lets me move the chart up. Does it? That's kind of annoying. Pyrosis double click it doesn't, yeah, I was going to say double click doesn't work. That auto, auto centers it. It's completely different. Nick says, why don't you use log mode? Because log mode kind of perverts, um, perverts how price like how you're actually tracking price. So I don't hate it. It has its purpose. But yeah, it's not my go to anyways, going back to this, it doesn't really matter that much because I can see the prices on the on the right hand side. This originally became technically oversold on this day here.",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 84,
      "start_timestamp": "01:41:16",
      "start_timestamp_seconds": 6076.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6076"
    }
  },
  {
    "text": "price. So I don't hate it. It has its purpose. But yeah, it's not my go to anyways, going back to this, it doesn't really matter that much because I can see the prices on the on the right hand side. This originally became technically oversold on this day here. And this day here was 14 aug. And it came in at, let's just say the clothes was 1996. So then the volume on this day was 3.3 million. So let's scroll to the right until we see more volume above 3.3 million. I see 3.7 million here, which is at 22, no, my bad. I'm going to go back. Oh, where did it go? 1.8 4.6. So I see 4.6 million volume here. But you can see where that comes in. We're out of oversold. That's gone. That condition has left us. So this is the general problem that you'll have if those are your two indicators personally. I don't really see I don't really see the overall benefit to limiting yourself to that. He says he means weekly. Well, then if you mean weekly, you've had no indicators for the past five years, except here. And if you would listen to that indicator of expanding volume. So this went from the trial here is at 88. And then you got 204 million volume here at 19 August. It looks like. And GameStop here closed at 91 cents. And then if I fast forward. Kind of to I don't",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 84,
      "start_timestamp": "01:42:51",
      "start_timestamp_seconds": 6171.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6171"
    }
  },
  {
    "text": "would listen to that indicator of expanding volume. So this went from the trial here is at 88. And then you got 204 million volume here at 19 August. It looks like. And GameStop here closed at 91 cents. And then if I fast forward. Kind of to I don't know how long you would hold for like what the exit condition is, but in February 3rd, it was at 95 cents close. So you got in at 91, you'd get out at 95 there. Or if you kept holding, you would be in at a low of 64. All I'm saying is like, if it works for you, I'm happy for you. You should absolutely continue to use it. But what I can tell you is from again, like an objective trading perspective, it's like I wouldn't limit myself to those two indicators because there's no imperative to do so. And secondly, those two indicators alone are going to put you in a lot of pain very frequently. That's not to say that they can't eventually move where you want it to go. But then it's also important to remember that there's an opportunity cost with where we're parking money. So if I put money in something here, like this, right, the first of February and the first of February it's trading at 1490. And then come the second of May, it's at 12. That not a big price change necessarily. It's down a few bucks, but it's also",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 84,
      "start_timestamp": "01:44:22",
      "start_timestamp_seconds": 6262.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6262"
    }
  },
  {
    "text": "money. So if I put money in something here, like this, right, the first of February and the first of February it's trading at 1490. And then come the second of May, it's at 12. That not a big price change necessarily. It's down a few bucks, but it's also been parked there doing nothing for me for three months, right? Like I want to be able to make money over the course of that three months. That's part of being like an efficient trader. So yeah, the cliff notes of that is like whatever works for you do that. But for me, I demand a hell of a lot more in terms of deciding what I'm choosing to buy or sell personally. But yeah, totally cool. All right, what else should we look at? We still got a few minutes left. I'm actually going to get ready to launch my dinner order, but it won't be here for a little bit. So tonight we are going to do Greek food. I'm going to get me some bockleva, a love, some bockleva. We're going to do the meat chicken kebab in Euro and then another chicken kebab. Money things spot on. Thank you for the reminder. We're going to look at this lawsuit. Otherwise, money things I don't think would ever forgive me and I wouldn't blame them because we're supposed to look at this. So let's take a look. All right. And then HW, we definitely can take a",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 84,
      "start_timestamp": "01:45:49",
      "start_timestamp_seconds": 6349.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6349"
    }
  },
  {
    "text": "on. Thank you for the reminder. We're going to look at this lawsuit. Otherwise, money things I don't think would ever forgive me and I wouldn't blame them because we're supposed to look at this. So let's take a look. All right. And then HW, we definitely can take a look at that. Okay, so for this lawsuit, this is the wrong one. That's kind of annoying. Let me grab the actual lawsuit. We'll do BCG lawsuit first. BCG, GME lawsuit. And what are we looking for in particular for this one, for the BCG lawsuit? Let me get rid of that one. In March, BCG filed a lawsuit against GameStop for 30 million and unpaid fees. GameStop said it refused to pay the fees because doing so was not the best interest. Oh, shit. Wow. The case is still awaiting trial. Wait, when did this, this is old? Yo, this is annoying. Give me the updated. What is this? This is memorandum of opinion. We can take a look at this. What CVE says, the update is they dropped the case. Yeah, that's what I thought. That's why I was wondering. I was like, why is this so old? Let's take a look through here and see what they say. In the case filed by plaintiff BCG defendant GameStop, presently pending before the court motion to partially dismiss the operative second amended complaint with prejudice filed pursuant to this. For the reason set forth below the motion is granted",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 84,
      "start_timestamp": "01:47:03",
      "start_timestamp_seconds": 6423.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6423"
    }
  },
  {
    "text": "Let's take a look through here and see what they say. In the case filed by plaintiff BCG defendant GameStop, presently pending before the court motion to partially dismiss the operative second amended complaint with prejudice filed pursuant to this. For the reason set forth below the motion is granted in part and denied in part. Okay, so let me zoom this in. Show me, show me, wait, no, give me a fucking wider window. Why are you doing this to? Oh, Jesus. No. Can you guys see this? Okay, if not, I can download it really quick. But I can't zoom it in any more than that. Okay, cool. Thank you, roaring titty. All right, so it says the court rates briefly here for the parties who are well familiar. It does so part of March. Which address the defendant's previously filed motion to dismiss the first amended, the first amended complaint, the fact. And it does so by making use of the familiar standard for assessing rule, which is they're using, they're sharing the reference case here. And by considering the same stuff, there's only one count in the SAC for breach of contract made pursuant to Delaware law. The court will briefly explain why it agrees that count one can go forward past the pleading stage in many respects. All right. In March 29, M O, the court explained that the plaintiff had sufficiently set out a claim in the fact for failure to pay a certain",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 84,
      "start_timestamp": "01:48:44",
      "start_timestamp_seconds": 6524.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6524"
    }
  },
  {
    "text": "law. The court will briefly explain why it agrees that count one can go forward past the pleading stage in many respects. All right. In March 29, M O, the court explained that the plaintiff had sufficiently set out a claim in the fact for failure to pay a certain variable fee rate for the SOW. Now in the SAC, there's a number of allegations that the court interprets as being related to these type two agreement breach allegations. Defendant breached its duty to negotiate in good faith regarding those matters. Among others, court reads plaintiffs allegations. And the many other initiatives discussed at the 2021 thermometer meetings as being this kind of type two agreement claim. It reads the allegations and paragraph there as also being generally directed to this type two claim. The court does not understand defendant to be challenging the SACs type two breach allegations. And so those allegations survive here. The court reads plaintiffs allegations and paragraph 41 and 45 is being about a different type of breach of contract claim, a claim that defendant breached the SOW by failing to pay certain variable fee. Okay. The initiatives referred to these paragraphs. Yep. Okay. Defendant moves to dismiss plaintiffs breach of contract claim relating to those agreed initiatives. It does so on the ground that the SAC does not sufficiently allege that all the parties are actually reached a written agreement. Okay. Pyrus is what's the date on this one? This one is from 13",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 84,
      "start_timestamp": "01:50:23",
      "start_timestamp_seconds": 6623.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6623"
    }
  },
  {
    "text": "moves to dismiss plaintiffs breach of contract claim relating to those agreed initiatives. It does so on the ground that the SAC does not sufficiently allege that all the parties are actually reached a written agreement. Okay. Pyrus is what's the date on this one? This one is from 13 Feb. So this is before the dismissal. What I'm doing right now is I'm just kind of understanding the background behind this because I'm trying to understand more of the conversation and like what the basis was for the argument from the beginning. However, defendant does have a winning argument on another ground as the breach allegations regarding three initiatives. That is because plaintiff affirmatively pleads that as to these initiatives. Defendant only agreed in writing as to portions of profit improvement projections relating to EPPI. SOW requires that the parties reach written agreement on the amounts of credits to be made to each for each initiative. So it sounds like a breach of contract which is really fascinating. But the foregoing reason the court concludes that the defendant's motion should be granted in part tonight and part more specifically. It's granted with prejudice to the plaintiffs claims breach of contract. It is denied in all other respects. Interesting. The CVO says they weren't paying for bad consult. That's fascinating to me because I mean, I worked at Deloitte for a while and I've worked around BCG and they're a good consultancy. So I'm actually kind of really curious why",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 84,
      "start_timestamp": "01:51:53",
      "start_timestamp_seconds": 6713.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6713"
    }
  },
  {
    "text": "contract. It is denied in all other respects. Interesting. The CVO says they weren't paying for bad consult. That's fascinating to me because I mean, I worked at Deloitte for a while and I've worked around BCG and they're a good consultancy. So I'm actually kind of really curious why like what the deal actually is because my guess is again, I don't think that they didn't I would find it really hard to believe that they didn't do shit. My guess is they might have done stuff that they didn't like and that I get like that's okay. But that's a different context at least in my opinion. I don't know well enough but that's part of at least what what what I think. All right, so let's take a look at this. Pursuant to and this one is from the 30th. Under side parties here I stipulate dismissal of this action with prejudice. Yes, so with prejudice here matters. Yeah. So this looks like they are done and done. Cool. So money tings this looks this looks great. This looks like it was dismissed with prejudice. So it looks like the the whole thing from BCG will be kind of flattened out which is good. It's good that that's not looming over their heads anymore which is kind of a bummer to have to operate within at least I think. And then we got a couple minutes left. I know that there was another case you wanted me",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 84,
      "start_timestamp": "01:53:28",
      "start_timestamp_seconds": 6808.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6808"
    }
  },
  {
    "text": "kind of flattened out which is good. It's good that that's not looming over their heads anymore which is kind of a bummer to have to operate within at least I think. And then we got a couple minutes left. I know that there was another case you wanted me to look at but I think somebody also wanted me to look at some that's options in shui so I'm not as worried about that to be honest. We can take a look. Money tings big now RC can tell us what he wants to do with the money. I guess the part I'm curious about is like what do you mean? Now he can tell us what he's going to do with the money. I don't understand. I don't understand the way that you're attaching this case to the plans for the money. I don't totally follow that because the value of this case is still it's only 30 million dollars and they have way more cash than that. So even if this case came through and they were made to pay they still would pay a fraction of their cash. So it's not like they were hiding their money. They know that the money's there. So I maybe there's more to it than I know. I typically assume that with a lot of things but based on that I don't actually see the attachment here. Money team says I guess I'm just saying why make moves when you",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 84,
      "start_timestamp": "01:55:00",
      "start_timestamp_seconds": 6900.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6900"
    }
  },
  {
    "text": "money. They know that the money's there. So I maybe there's more to it than I know. I typically assume that with a lot of things but based on that I don't actually see the attachment here. Money team says I guess I'm just saying why make moves when you got lost? Oh, well it's because companies almost always have lawsuits ongoing. That's like standard fair man. Yeah, okay I understand what you're saying now. I personally would decouple those. I don't think that the lawsuit really has anything to do whatsoever with what they're choosing to do with that capital or not choosing to do with that capital. You have to understand like large companies. A lot of these companies literally have built in lawyers that work for them directly. It's called in house counsel and it's because there's so much litigation always. So if a company essentially waited to do things until there was never any legal problems whatsoever, they would make zero headway. Nothing would ever happen. So I get your point and it definitely is good, right? It's just one less piece of bullshit to deal with. But I don't actually think at least this one matters too much in terms of what they were going to do with that money. Money team says I think BBY 16B case tomorrow is way bigger. Let's see. GME BBBY 16B lawsuit. This one is from Rooters. Let's see. Matthew says I think BCG had a clause for commission",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 84,
      "start_timestamp": "01:56:14",
      "start_timestamp_seconds": 6974.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6974"
    }
  },
  {
    "text": "matters too much in terms of what they were going to do with that money. Money team says I think BBY 16B case tomorrow is way bigger. Let's see. GME BBBY 16B lawsuit. This one is from Rooters. Let's see. Matthew says I think BCG had a clause for commission on GME profit so that was a big deal. I don't actually again, like I see what you're saying, but the way that that would work is they would have to then value whatever it is. I think the point being is whatever the fees that they charge and whatever commissions that they were trying to go after, it still would be a general drop in the bucket. It wouldn't be to the same degree as I think like a massive problem for the cash pile that they had just built. And the other thing is it very rarely is done via some sort of large cash payment. There's normally a payment plan. So there's just a lot of ancillary details around that that again, it's good that it's gone. I'm not arguing that it's not good that it's gone. I'm happy that it's gone. But I just don't necessarily think that it's a absolutely massive impact on things. All right, let's see. So we won the dismissal on Tuesday, accusing him of profitably cashing out of bedbath and beyond shares too quickly, as it was hurting towards bankruptcy, said that two former shareholders could not force Cohen to return",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 84,
      "start_timestamp": "01:57:23",
      "start_timestamp_seconds": 7043.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=7043"
    }
  },
  {
    "text": "think that it's a absolutely massive impact on things. All right, let's see. So we won the dismissal on Tuesday, accusing him of profitably cashing out of bedbath and beyond shares too quickly, as it was hurting towards bankruptcy, said that two former shareholders could not force Cohen to return profits selling his estimated 11 stake because the bankruptcy mooted their claims. Shareholders sued Cohen under federal law requiring corporate insiders, including large shareholders to give up their short swing profits from buying and selling companies stocking in six months period. The client and media comment reviewing the decision, Cohen declined. So this talks about what he did. He abruptly sold his stake, which had grown because of buybacks five months later. He sold for 60 million profit. So this doesn't tell me why he won, though, which I'm kind of curious about. Like what the decision was, EBBY Ryan, Owen lawsuit. Oh, it's a hearing tomorrow. I see. Okay. Got it. June 26. So this one. Whoa. This one's kind of interesting. Was concerned that some of her fellow director shared insider information before he dumped his stake. That's interesting. That's a really interesting angle to take to. The agency hasn't levied claims of wrongdoing. A group sued them for fraud. Yeah. The board member worried about information leaks didn't trust Cohen, founded the credibility that Cohen backed to join the board. Interesting. Yeah, really interesting. I do think that that one probably would be a slightly bigger deal",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 84,
      "start_timestamp": "01:58:44",
      "start_timestamp_seconds": 7124.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=7124"
    }
  },
  {
    "text": "agency hasn't levied claims of wrongdoing. A group sued them for fraud. Yeah. The board member worried about information leaks didn't trust Cohen, founded the credibility that Cohen backed to join the board. Interesting. Yeah, really interesting. I do think that that one probably would be a slightly bigger deal just from Cohen's perspective, because I mean, there's no way that that doesn't impact his movement somehow. So Justin says concerned about potential wrongdoing. Well, the problem is, again, it's that's not going to be the argument. The people who bring these arguments are pretty smart. So they would have at least something pretty logical built. Like this here, right? The suit accuses Cohen of insider trading and misleading investors about his trading plans. It doesn't allege specific piece of non-public information, but says his allies on the board push to give him more information about strategy and critical financing options according to the internal emails. So like this will be the suit, right? It's not going to be concerned about potential wrongdoing. They're actually going to come. They're going to try to come with some heat. Otherwise, it wouldn't even get to this point. Before something goes to trial, a judge has to look at it and see if it's even worth worthwhile for them to take it. So my guess is this. This has happened. So let's take a look. All right, gang. That wraps me up for tonight. Another super fun session. I love doing this with",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 84,
      "start_timestamp": "02:01:05",
      "start_timestamp_seconds": 7265.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=7265"
    }
  },
  {
    "text": "a judge has to look at it and see if it's even worth worthwhile for them to take it. So my guess is this. This has happened. So let's take a look. All right, gang. That wraps me up for tonight. Another super fun session. I love doing this with you guys and diving deep into this absolutely enjoyable. Tomorrow is options trading for beginners. We have a couple of really fun things lined up. Before I punch out for a little bit of time off and then like I said, I will be back in action with live streams starting the 11th of August. You can catch me there. Be an outlier, be an ape.",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": "",
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 84,
      "start_timestamp": "02:02:44",
      "start_timestamp_seconds": 7364.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=7364"
    }
  }
]