[
  {
    "text": "What up ape outliers? It's kind of a specific class of us, I suppose. I kind of grabbed my dog because he ran over and I thought he wanted to say. Here's the mascot. He's here ready to rock and roll. So he and I, we were reading a couple studies. We got some feedback. So we were reading a couple studies recently about GME and the off exchange routing volume and decisions. So I want to spend a little bit of time taking a look at that with you guys today. He gave me a bunch of good things to pay attention to. So I thought we would start there. And then I want to take a look at Rory and Kitty's old trades. And then specifically the options and how he set them up. I'm trying to develop more of like a fingerprint as I like to call it. Of his behavior. Do you like mango? Do you like mango? I guess. Seems like yes. All right. So the or likes mango is what I've recently learned. And then. And then yeah, I want to talk a little bit about the recent price behavior behavior. And. We're back at it. Just a technical difficulty real quick. And yeah, so then for the rest of the stream or anything like that. If there's anything that you guys want to take a look at, just let me know. And we will we will go left go right go whichever direction",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 85,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=0"
    }
  },
  {
    "text": "at it. Just a technical difficulty real quick. And yeah, so then for the rest of the stream or anything like that. If there's anything that you guys want to take a look at, just let me know. And we will we will go left go right go whichever direction you all want to take this stuff. I need to I think turn to volume. How's the volume for you guys? Is it coming through? Okay. I was thinking I might need to raise it just a little bit. I can't tell. All right. Let me grab this chat. Just instead of if there's time could you take a look at Rory and Kitty's charts? Yeah. Of course. So. Lasidio says it's good. Zach says good. Justin says good. That is three greens for go. Means we're in rock roll. All right. Cool. So I'm moving the child over here so I can keep an eyeball on everybody. And as always, I like to say hello to whoever's hanging out. So we got said trick, which is a hell of a name. Zach. The crowd favorite roaring titty. Always my favorite. It looks like Ryan Cohen tweeted again. So let's take a quick look at X. And let's see what our boys up to. Ryan. Oh, and. All right. So we're working with here. Kamala. That's. That's so funny. The dude is just having a good time. You got it. Like I don't know. I love him for it because",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 85,
      "start_timestamp": "00:01:23",
      "start_timestamp_seconds": 83.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=83"
    }
  },
  {
    "text": "take a quick look at X. And let's see what our boys up to. Ryan. Oh, and. All right. So we're working with here. Kamala. That's. That's so funny. The dude is just having a good time. You got it. Like I don't know. I love him for it because if I think you guys are the ones that told me that he. I'm pretty sure you guys told me that he's fucking Canadian. So I don't even think he could vote. So the fact that he's playing all these games is obviously just he's just messing around. Which I'm I am completely here for. All right. So it looks like the tweet that we have here is a Kamala Grande iced mocha with almond milk cookie crumbles. And then the Trump 2024 is the Grande iced Americano. And that's it. Polaris big fan. Zach says I love that a CEO can just be politically incorrect. So the funny part about that I think honestly is the fact that I think especially in general people are starting to get a little bit tired of how it feels like there's a lot of landmines with respect to speech. Like if you say something you say something the wrong way that all of a sudden there's a bunch of problems and it's kind of just like backwards in my opinion of the some of the ideas of free speech, which is if you say something that's fucked up. People have the right",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 85,
      "start_timestamp": "00:02:33",
      "start_timestamp_seconds": 153.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=153"
    }
  },
  {
    "text": "say something you say something the wrong way that all of a sudden there's a bunch of problems and it's kind of just like backwards in my opinion of the some of the ideas of free speech, which is if you say something that's fucked up. People have the right to not like you and that's that like that's it's a completely viable agreement. In case you guys don't know. I'm a Celterwater kind of sore and today I'm indulging one of my favorites, which is these are literally from Iceland. This is a Mexican lime crystal. I like it. It sounds like a stripper some sort of stripper beverage, but it's literally just a seltzer water and it's like the best seltzer water I think ever. Hey, there's a hundred of us in here shout out to you guys shout out to the ape outliers. Listen to you says it's green. We can't see it. I don't have a green screen. So I'm wearing green. That's interesting. So the silver part comes through. What if I put my hand behind it? That works. Huh, check that out. That's kind of nuts that I can just zoom in. And then if I put it in front of my face, can you see my face through it or no? No. It kind of blocks it all out. Not a technical guy. As you can tell, I am about as simple as you all are and I was just very interested in",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 85,
      "start_timestamp": "00:04:21",
      "start_timestamp_seconds": 261.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=261"
    }
  },
  {
    "text": "if I put it in front of my face, can you see my face through it or no? No. It kind of blocks it all out. Not a technical guy. As you can tell, I am about as simple as you all are and I was just very interested in how that worked. But I'm going to enjoy my crystal all the way from Iceland. All right. So let's let's dig in, shall we? I mean, the trick says, can you see my face through it? Yeah. I mean, these are the these are the questions that I have. Like I said, I'm a simple man. I like simple things. All right, let's kill this down. And what do you guys want to do? Do you want to start with looking at GameStop as it sits today? Or do you want to start going through some of the nerd stuff that I was looking at before? Whatever sounds better to you sounds good to me. And like I said, the other thing I want to take a look at is some of Roaring Kiddy's old positions. And I think one of you said that you wanted to take a look at his charts. So completely up to you guys. Wherever you want to start is where I would like to start. Dom D says Eric will chew. We have to file a 13 G when he sells. Yeah. So he will have to provide an update to it. So if",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 85,
      "start_timestamp": "00:05:33",
      "start_timestamp_seconds": 333.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=333"
    }
  },
  {
    "text": "at his charts. So completely up to you guys. Wherever you want to start is where I would like to start. Dom D says Eric will chew. We have to file a 13 G when he sells. Yeah. So he will have to provide an update to it. So if you take a look at the 13 G filing procedures and again, I want to be very, very specific. This is not my strength area. This is typically your guys' strength area over mine. But I've spent time looking at it out of curiosity for this event. So the initial filing passive investors, they have to not file initially within five business days of acquiring more than five percent beneficial ownership. Qualified institutional investors, they can do it within 45 days at the end of the year once they cross the 5 threshold. Amendments must be filed within 45 days after the calendar quarter in which a material change occurs. So that's what that looks like. Nerd stuff cool. Let's take a look at some nerd stuff. There's two studies that I think are relevant to us. And what I wanted to do is there's a lot of conversation about the off exchange volume about the dark pool volume about the impact that it has on price discovery. So I started going down a little bit of a rabbit hole. There's some general context. I am a trader. So the routing of orders in general is not a massive focus",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 85,
      "start_timestamp": "00:06:35",
      "start_timestamp_seconds": 395.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=395"
    }
  },
  {
    "text": "the off exchange volume about the dark pool volume about the impact that it has on price discovery. So I started going down a little bit of a rabbit hole. There's some general context. I am a trader. So the routing of orders in general is not a massive focus for me because it eventually hits the market. Now from the GME side of things, I fully understand if there's some sort of speculation on the impact, especially on lower float stocks. So I wanted to go and understand that more. So I found a few studies that talk a little bit more about routing order volume off exchange so that I could get smarter about it. So I thought we could look through these together. Alfonso says I think that 13G requires an amendment only if a beneficial understake falls below 5 or the change in ownership amounts to 1 more of the obscenities. Yeah, I think I think that sounds right based on what I was looking at before. So I think same plan or same same page. So talking about this dark pool order routing for those that don't know the origin of dark pool order routing is really. It's not all bad now there are bad components to it in that it does obscure price discovery it absolutely does and that's the part I don't like about it. Now the reason why it exists is because honestly traders like me and even smarter traders traders that",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 85,
      "start_timestamp": "00:08:03",
      "start_timestamp_seconds": 483.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=483"
    }
  },
  {
    "text": "is really. It's not all bad now there are bad components to it in that it does obscure price discovery it absolutely does and that's the part I don't like about it. Now the reason why it exists is because honestly traders like me and even smarter traders traders that have high frequency systems. Those kinds of entities will hunt for what looks like big building positions in front run it. So here's what that generally looks like we can look at it on a chart probably not one that's just collapsing down just for general again general understanding. When we see something like this again I'm not saying that this is all some sort of insider trading or institutional I'm just using it as an example but let's just say that this volume being built up is coming from institutions in this example. That's happening and again traders like me that are looking for these kinds of things start to see this and we know at that point an institution is building a position there's a few things I know as a trader they can't get a fill all at once it's near impossible. I also know that they typically are going to build out their fills over several days several periods of time. So it gives me an opportunity to front run the move so if I see volume expanding like this and I see a massive by volume expansion like this I'll start building a position by",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 85,
      "start_timestamp": "00:09:16",
      "start_timestamp_seconds": 556.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=556"
    }
  },
  {
    "text": "typically are going to build out their fills over several days several periods of time. So it gives me an opportunity to front run the move so if I see volume expanding like this and I see a massive by volume expansion like this I'll start building a position by buying shares buying options specifically calls. And it allows me to participate however as I'm doing that that's also driving price up demand is still increasing both from the original entity that's trying to put on a really large trade and small fish like me that are front running it but then you also have really smart systems like high frequency trading systems that are literally hunting for changes in volume like this they're based on very quick reacting algorithms. So what that eventually does is as soon as people like me and other entities see this kind of buying volume we make it more expensive for that entity to get a fill to actually establish their position and again that's the nature of markets do I feel bad about it fuck no they can go fuck themselves but I also understand the problem that it presents to them and why they would look for a solution because that is a problem if you're trying to put on a 40 billion dollar position for not even a hundred percent. For not even it's not even have to be half of that be like 50 million dollars we don't have to",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 85,
      "start_timestamp": "00:10:47",
      "start_timestamp_seconds": 647.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=647"
    }
  },
  {
    "text": "why they would look for a solution because that is a problem if you're trying to put on a 40 billion dollar position for not even a hundred percent. For not even it's not even have to be half of that be like 50 million dollars we don't have to talk about billions we could talk millions and if we're in the millions it still is going to meaningfully move the price observably enough that a bunch of other people want to profit off that same movement because of that known force. So it creates an opportunity so dark pools. Just says how do you sleep at night honestly before I had this bullshit with my sciatic nerve I slept just fine as a lately not super great but it's not to do it is obviously. But so dark pools they originated so that big orders could get put through at a certain size in your transactions so that the orders weren't being front ran continually that's the good side of dark pools again one of the things I try to remind you guys is that you will very rarely find me on a polar position. Because I've spent my entire life trying to be able to analyze things from a midpoint I still will lean towards a certain opinion but even something like dark pools which generally has a really negative undertone to it which I don't disagree with there are still net positives within it now in terms",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 85,
      "start_timestamp": "00:11:37",
      "start_timestamp_seconds": 697.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=697"
    }
  },
  {
    "text": "entire life trying to be able to analyze things from a midpoint I still will lean towards a certain opinion but even something like dark pools which generally has a really negative undertone to it which I don't disagree with there are still net positives within it now in terms of whether it's an aggregate net positive I don't think so because again like whether or not a big institution can get a clean fill I really don't care. I think they should be participating for price discovery just as I should however I also do understand and I can analyze it from their perspective because that would be really annoying after a while without a doubt it would be very very frustrating. So that's kind of the good side now the bad side is because of the way that dark pool orders are routed it then does not help with current state price discovery. Justin says I meant how do you sleep at night after doing the evil things like making money off of these situations oh yeah I know what you meant just a little I was just kind of playing along with you yeah. So the papers that I want to look at with you all are these and I haven't read through these fully yet there was a bunch of them that I shared with Newton to include on his absolutely massive gm e. Google sheet which if you guys are not familiar with it I",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 85,
      "start_timestamp": "00:13:16",
      "start_timestamp_seconds": 796.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=796"
    }
  },
  {
    "text": "that I want to look at with you all are these and I haven't read through these fully yet there was a bunch of them that I shared with Newton to include on his absolutely massive gm e. Google sheet which if you guys are not familiar with it I think you need to grab this. So this is a link to yeah so that's a link to the gm e to the gm e Google sheet that he maintains which is just it's one of the best repositories of information that I could conceivably come across. So when I look at this there's a ton of great data one of the things that I wanted to dump in here is a bunch of stuff about this order routing so I thought we could start by looking through this. Zach says he's got a bounce if you have time later in the stream would love to look at chuey 5000 block calls purchase prior to the RK's six 24 share purchase yeah we can take a look at that let's take a look at that real quick. This will be the easier tool for us to do that with let's do chuey and then you said before the six 24 share purchase. So then there's six 24 so then I think we did this before and then let's see this is calls inputs let's do just calls let's do just at the offer and then let's sort by size. I",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 85,
      "start_timestamp": "00:14:25",
      "start_timestamp_seconds": 865.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=865"
    }
  },
  {
    "text": "do chuey and then you said before the six 24 share purchase. So then there's six 24 so then I think we did this before and then let's see this is calls inputs let's do just calls let's do just at the offer and then let's sort by size. I literally don't see any 5000 blocks see zero of them maybe we'll go back further we'll do like may to 21 June yeah so Zach I see zero of those I see one 10,000 block which was massive. And that was at the 27 but still these were pretty far out of the money at the time so it was a relatively cheap trade so Zach whenever you're checking out the recording I literally don't see any of those. Because I think people asked me to look at this before there were blocks of 500 and this is actually one of the things I wanted to do with you all is go back at some of his older positions because the way that he builds his options positions is again like this is one of the reasons why this is so fascinating to me is that this is literally like it's like it's a big puzzle with a world that I'm infatuated by I love. Markets I love markets it's what I do so the fact that there's this big puzzle in here is just really really interesting to me Anthony says it's hardest they positive what a shitty day",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 85,
      "start_timestamp": "00:15:40",
      "start_timestamp_seconds": 940.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=940"
    }
  },
  {
    "text": "it's like it's a big puzzle with a world that I'm infatuated by I love. Markets I love markets it's what I do so the fact that there's this big puzzle in here is just really really interesting to me Anthony says it's hardest they positive what a shitty day no you can't feel like that man. The way that I would look at stuff like today depending on what really comes down to like what the thesis is and what you're trying to do and I think one of the big things that I find people in the community do is I don't know why you'll do it to yourselves you guys like set yourselves up for this really really tough emotional roller coaster where we try to you know speculate on a specific date for a specific movement to happen like those kinds of things and it to me I would also become exhausted after a while trying to maintain that so when I look at something like GameStop today maybe we'll talk about this for a second then we'll get into the nerd stuff because I do want to address that this is not bad it's going down shit goes down sometimes but if you take a look literally at where it's at now literally from middle of April until today it is over double where it was. That's not bad again I know a lot of people are really really clinging on for this really big",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 85,
      "start_timestamp": "00:17:01",
      "start_timestamp_seconds": 1021.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1021"
    }
  },
  {
    "text": "down shit goes down sometimes but if you take a look literally at where it's at now literally from middle of April until today it is over double where it was. That's not bad again I know a lot of people are really really clinging on for this really big squeeze for Mo as which I'm still learning more about in context of what that actually means for people but I wouldn't get disenfranchised when you see something going down it's part of general natural price movement. And you can also see that there's tons of people that are still at the point of control here so that means that a lot of people like transacting even at higher prices so I wouldn't view this as terrible I wouldn't view this is great like obviously I don't want it to go down either I have a position on in here but it also doesn't mean anything to me necessarily because the stock is going to do whatever it's going to do so if I get too emotionally wrapped up in the movement of lines on a chart that puts me in just a compromised mental and emotional state that I'm literally handing control over my emotions to something I have no control over I cannot pick where GM Egos so I'm not going to base how I feel on something that I can't control when I think about something. Anthony says are you blind or something this is bad fool",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 85,
      "start_timestamp": "00:18:16",
      "start_timestamp_seconds": 1096.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1096"
    }
  },
  {
    "text": "literally handing control over my emotions to something I have no control over I cannot pick where GM Egos so I'm not going to base how I feel on something that I can't control when I think about something. Anthony says are you blind or something this is bad fool again context right when I look at something like this that on nine on 16 April was at 995 and then I look at it even after it's down for you know essentially two weeks straight even after it's down for two weeks straight it's still over 20 it's still double plus where it was a few months ago stocks can try to make this kind of move from 995 to 21 they do that in like five years it takes forever so yeah it absolutely again it's all context based Anthony says technicals are bad I don't disagree with you like right now it is absolutely pulling back there's no doubt stocks do that find me a stock that doesn't do that there this isn't this isn't a thing right so if I look at Tesla a company that is done insanely well and let's take a look at a different context it still hasn't gotten back up to where it was last September right like stocks go multiple directions this is completely completely normal so for something like game stop to be going through a pullback it's like of course this is normal what what stock doesn't do",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 85,
      "start_timestamp": "00:19:33",
      "start_timestamp_seconds": 1173.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1173"
    }
  },
  {
    "text": "a different context it still hasn't gotten back up to where it was last September right like stocks go multiple directions this is completely completely normal so for something like game stop to be going through a pullback it's like of course this is normal what what stock doesn't do this so again to me you have a choice right you can view it as this terribly negative awful scenario and I mean you're welcome to do that to me the argument I kind of offer to you is that your emotional attachment to it literally does nothing for the stock it's not going to make the stock go up so the only thing you're doing is getting yourself wound up over something you have zero control over which to me is it just a grigious waste of time and energy the way that I would look at it if I was like really really really wanting you know game stop to go up I know a lot of people they have this is like a massive part of like the retirement plans and shit like that if that was my scenario I would literally just pick points at where I like it and then DC a dollar cost average that's if I really like it but if you feel weird about it just you don't have to do anything with your position you can always scale your position down there's a million ways that you can play something like",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 85,
      "start_timestamp": "00:21:01",
      "start_timestamp_seconds": 1261.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1261"
    }
  },
  {
    "text": "I like it and then DC a dollar cost average that's if I really like it but if you feel weird about it just you don't have to do anything with your position you can always scale your position down there's a million ways that you can play something like this the other thing I would offer to you that I think you might want to hear although it's uncomfortable is that one of the best one of the one of the like the transformative things I've done as a trader I've been doing this since 2007 I haven't always been this composed I haven't always had this disposition towards markets because it takes time to develop the way you feel about things but when I look at something like this the way I would be thinking about it if I was like a true all in on game stop trader which again I'm I keep it a buck with you guys GameStop is part of my portfolio. I'm a trader but it's not it's not I don't have all my chips on GameStop but for the p I know people do and for the people that do I would think of it from the context of before you finish pushing all of your chips onto think through the life cycle of the product think how it can behave and think how you will feel how you will react and then create a plan that plan is literally what will",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 85,
      "start_timestamp": "00:22:29",
      "start_timestamp_seconds": 1349.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1349"
    }
  },
  {
    "text": "think of it from the context of before you finish pushing all of your chips onto think through the life cycle of the product think how it can behave and think how you will feel how you will react and then create a plan that plan is literally what will sustain you during times when things are not going really well a similar example not exactly on same topic spx So for those that don't know I trade spx a lot with different kinds of structures in a big thing I do are zero dte options and there's a lot of other reasons why I use zero dte options most of you don't care and I'm not going to bore you with it just the context zero dte means options that expire the same day it means that there's a lot of them When you're trading that kind of strategy you can go through pro long periods where you lose money You can lose five days in row six days in row seven days in a row eight days in a row And during those periods you kind of start asking yourself you're like shit Did I get this right? Is there a problem here? Should I do something else? I don't like losing this much But What sustains me through those periods and something like this is I've done a On of research on what I'm doing And I know there's a process called path dependence What that means",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 85,
      "start_timestamp": "00:23:34",
      "start_timestamp_seconds": 1414.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1414"
    }
  },
  {
    "text": "Is there a problem here? Should I do something else? I don't like losing this much But What sustains me through those periods and something like this is I've done a On of research on what I'm doing And I know there's a process called path dependence What that means is every once in a while you're going to have an ugly or beneficial path Where things happen to work in your favor or work against your favor But if you are comfortable with the broader plan and you're like yeah, okay Losing eight days in a row is not my favorite wouldn't pick it But I know that this is all part of a bigger system that in the aggregate works out We will find a good path and take like this is a great example from the 12th of April To the 19th of April They're all consecutive down days like that's not a great path But then if you go over here to the first of July Up until the 10th of July even though this was a down day that's still a cure uptrend this was a down day on a gap up So that's a happy path There's going to be happy path there's going to be sad path But what I try to encourage people to think about is not attaching happier sad by just thinking about the path of returns as they are Things go up things go down If you think of",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 85,
      "start_timestamp": "00:24:52",
      "start_timestamp_seconds": 1492.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1492"
    }
  },
  {
    "text": "happy path There's going to be happy path there's going to be sad path But what I try to encourage people to think about is not attaching happier sad by just thinking about the path of returns as they are Things go up things go down If you think of it in this context it's been going down pretty solidly Since the 17th of July if you take a look at where it was at here on the second of May It essentially didn't get a down tick Until the 14th of May and these are massive up moves look at the difference in context so I would just encourage People that feel that way to reconfigure the the emotional relationship with the market Because Because what I can tell you is that if this kind of movement here makes you feel some type of way This is going to be a tough business whether you use GameStop or another product If something literally goes from 28 to 22 and that's causing like indigestion Then I mean one that tells me you probably need to size your position down That's one of the easiest ways to not care as much about stuff that's not going well But then you have to be prepared to kick yourself because you're going to be pissed off When the thing goes up to 45 in the course of three days and you have a small position on You can't you can't have it both",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 85,
      "start_timestamp": "00:26:04",
      "start_timestamp_seconds": 1564.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1564"
    }
  },
  {
    "text": "about stuff that's not going well But then you have to be prepared to kick yourself because you're going to be pissed off When the thing goes up to 45 in the course of three days and you have a small position on You can't you can't have it both ways And you have to decide what matters to you most are you trying to make sure that you can stay into this for the long run and minimize the downside the drawdowns That's okay. You can do that But then There's going to be an up move at some point and you're not probably going to have the position size You would want for that So as long as you can reconcile those two things and you're good All right little bit of a rant but I I One of the things I think a lot about with respect to trading is just how important the psychological component is to this We all have access to the same stuff So the reason why some people are successful and other people aren't it's not because they have access to better tools And it definitely is really nothing to do with once you have a base level of intelligence It's not because you're smarter. I'm not that smart So once you have a general understanding of things Then it really comes down to how well you can handle yourself as a trader which takes time to figure out so My hope",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 85,
      "start_timestamp": "00:27:08",
      "start_timestamp_seconds": 1628.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1628"
    }
  },
  {
    "text": "once you have a base level of intelligence It's not because you're smarter. I'm not that smart So once you have a general understanding of things Then it really comes down to how well you can handle yourself as a trader which takes time to figure out so My hope is for people that are trading this kind of thing that they can develop a healthy relationship with it So that it doesn't cost stress so that you can kind of play the moves as they come as you feel comfortable and take advantage of the opportunities where they are That's what I think All right, so let me get caught up on some of the chat here Um, Viablo says patience people. Yeah, I think that that's right. I think that's that that's absolutely right Um Money things says gme is 99 of my portfolio the other one percent is split up between 30 other stocks That's hilarious Yeah, and I know a lot of people like to go really gme heavy and that's Absolutely cool like whatever makes sense for you as a trader is what matters again It's not what I would do. It's not what I'm doing. I wouldn't put that much money into something like gme But it's because I always classify myself as an overly conservative investor That's one of the reasons why I'm so infatuated with roaring kitty is because he has literally a different constitution Not even to be essentially in one",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 85,
      "start_timestamp": "00:28:07",
      "start_timestamp_seconds": 1687.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1687"
    }
  },
  {
    "text": "doing. I wouldn't put that much money into something like gme But it's because I always classify myself as an overly conservative investor That's one of the reasons why I'm so infatuated with roaring kitty is because he has literally a different constitution Not even to be essentially in one individual product that is whatever I've been hyper concentrated too But the fact that this dude can look at a position That's up 175 million and just hold it I mean That is What they again, I've told you guys is before what it literally tells me is that this is not about money That's that's literally what that tells me He was at a point in this trade here that he essentially could have conducted a cashless exercise on this entire position If he wanted he had essentially enough money at this point to do that just about and The fact that he just held it and just let it go Like that tells me that there is a different motivation. There's a different focus a different incentive Which is absolutely fascinating to me because Most people if you think of it in terms of like game theory You can kind of war game what the motivations are and why we're doing things a certain way And then you see this and you're like yo This doesn't align with any of that This is a dude that is straight up up 250 million dollars And just hold in this",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 85,
      "start_timestamp": "00:29:15",
      "start_timestamp_seconds": 1755.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1755"
    }
  },
  {
    "text": "can kind of war game what the motivations are and why we're doing things a certain way And then you see this and you're like yo This doesn't align with any of that This is a dude that is straight up up 250 million dollars And just hold in this shit Like Like it's nuts So one of the really cool things about that I think is it just offers another perspective that there's a lot of different things people Want and try to accomplish in markets And I mean this is just Absolutely incredible to see So When it come you know going all the way back to this idea of like setting up a portfolio you just have to figure out what's right for you And in roaring kiddie's video himself. He's like this is a true yellow and the dude has no problem doing that stuff Which is again very very cool. I think it's fascinating to learn about So the punchline on that is you got to set things up in a way that makes sense for you That's the That's really what it boils down to because for me I've made it clear a big part of my motivation for trading was I grew up with a single mom didn't have sheep she had like no money She worked two jobs the job that she spent most of her time working she was an occupational therapist for mentally disabled kids kids that literally are retarded",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 85,
      "start_timestamp": "00:30:34",
      "start_timestamp_seconds": 1834.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1834"
    }
  },
  {
    "text": "part of my motivation for trading was I grew up with a single mom didn't have sheep she had like no money She worked two jobs the job that she spent most of her time working she was an occupational therapist for mentally disabled kids kids that literally are retarded and She doesn't have a retirement so I started trading because I knew She had no retirement that I was going to be the retirement So for me I can't there's no room for yellow Because the way that I trade is Originally was to build money one so that I could change my lot in life to be clear There's also a selfish portion to it as well. I didn't want to live like that But it's because I knew the only way she was going to retire is if Me or my brother were in a position to help her and my brother works really hard But he does things differently than I do so I kind of knew that I was going to be a big part of this So all of that goes back. I don't share any of that as like a sob story I'm very happy with my background But it's so that people understand my context That's why when you hear me say things like I don't really believe in yellows It's that's the subtext that's not to say I don't believe in yellows for anybody you got to do. It's right for",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 85,
      "start_timestamp": "00:31:44",
      "start_timestamp_seconds": 1904.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1904"
    }
  },
  {
    "text": "very happy with my background But it's so that people understand my context That's why when you hear me say things like I don't really believe in yellows It's that's the subtext that's not to say I don't believe in yellows for anybody you got to do. It's right for you It's just slightly slightly different then Yeah, then I think Other people may or may not approach it from so Back over now to the nerd stuff Kind of a fun philosophical conversation. I enjoyed that All right, let's see So this paper is a little bit old and it's called the off exchange routing decision You guys can all download this for yourself off of SSR N I do this on purpose and the reason why I do this is so that you all Can gain access to the same information that I'm looking at you should always be able to repeat Data that you see if the data is not repeatable Then there's a problem. So this is looking at over the counter market specifically So there's it that's just an important context here So it says a rising fraction of us x2d trading volume is being executed away from the national stock exchanges And on the over the counter market. So it develops the theoretical model of the decision to route exchange volume off To an a ts platform and then it uses Finra data to compute weekly time series of market shares for non for",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 85,
      "start_timestamp": "00:32:46",
      "start_timestamp_seconds": 1966.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=1966"
    }
  },
  {
    "text": "executed away from the national stock exchanges And on the over the counter market. So it develops the theoretical model of the decision to route exchange volume off To an a ts platform and then it uses Finra data to compute weekly time series of market shares for non for OTC non a ts trading centers Looking at the individual stock level from 2016 April To 30 June 2018 So let's take a look we don't have to read through all of the specifics in here unless you know you guys really want to I'm always down for that But it looks at essentially what is this like over 2000 2000 stocks it looks at a really really broad basket of things So here we see the average trade of off exchange executions and our sample Shows that only 0.1 of a ts transactions are 10,000 shares or more the traditional block size A block trade size Notes that only 2.53 of the trades through tc non A ts dealers are block size both off exchange markets have small trade sizes even though the majority of trading is institutional This I think is really interesting Because The reason why I find this to be interesting is that it starts to kind of counter some of that broader narrative Around why we route off exchange So let's kind of skip through some of this stuff I want to we'll start actually with the results and then we'll kind of work back",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 85,
      "start_timestamp": "00:34:07",
      "start_timestamp_seconds": 2047.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2047"
    }
  },
  {
    "text": "find this to be interesting is that it starts to kind of counter some of that broader narrative Around why we route off exchange So let's kind of skip through some of this stuff I want to we'll start actually with the results and then we'll kind of work back up into any questions that we have And really what I'm doing is I'm setting the table to work through this with you all You guys aren't familiar with this website. I'm not affiliated with them at all But they have a really cool simplified tool to track off exchange volume For different tickers and I wanted to work through this with you guys for a few reasons And the reason being is because the routing of orders off exchange isn't Probably as crazy as you guys might think it is But there are some really important commonalities that I think we need to be able to talk about Because for example When we look at this kind of movement here Right This is a massive this is when we saw that squeeze In 14 May and during that squeeze take a look at off exchange volume Applements right so we know that this happens this is well I think you guys know this right. I don't think that this is groundbreaking news for anybody When we start to see certain behaviors in the underlying price we know Historically that it moves the market makers and other entities to off",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 85,
      "start_timestamp": "00:35:35",
      "start_timestamp_seconds": 2135.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2135"
    }
  },
  {
    "text": "we know that this happens this is well I think you guys know this right. I don't think that this is groundbreaking news for anybody When we start to see certain behaviors in the underlying price we know Historically that it moves the market makers and other entities to off exchange solutions Cedric says dark pools are normal But so is naked short selling besides when it was invented Yeah, well the interesting thing about naked short selling again It's similar to dark pools in that I don't believe naked short selling is all bad in theory But I don't agree with it personally the reason being is because naked short selling if done What I would consider to be justly Would just increase market efficiency the problem is as with anything related to capital or money People are going to look for ways to game the system And that's exactly what I think has happened with naked shorting I think it's an abomination at this point And I think it's completely fucked up with the way that they've allowed that to run out of control And I think that it's actually My guess is it's not going to stay like that And that's one of the reasons why I'm so happy with this Andrew left case I got like a hair on my nose with this Andrew left case is because it starts to challenge this a little bit And let me grab I actually haven't seen any of",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 85,
      "start_timestamp": "00:36:44",
      "start_timestamp_seconds": 2204.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2204"
    }
  },
  {
    "text": "like that And that's one of the reasons why I'm so happy with this Andrew left case I got like a hair on my nose with this Andrew left case is because it starts to challenge this a little bit And let me grab I actually haven't seen any of the latest here. I don't know if you guys have I'm just looking it up really quick The latest I see is two days ago's uh here we go There's one from stat So we could take a look through this together And then take a look at this together Let me grab the end of this though. I just want to see what this was what this summarizes Hmm Conclusion here we go our model emphasizes that a stock traders routing choice balances possible price improvement Let me just zoom this in more Oh, I'll get myself out of the way for a second so that you guys can see All right, so this says our model emphasizes that a stock trader routing balances um possible price improvement against lower probability of execution in the off exchange market wider spreads entice off exchange routing which makes a ton of sense To trade within the spread a decrease in volatility lowers the range of spreads above and below to a break even level When they're above average leads traders to prefer off exchange executions So one of the things I think that's this is highlighting for you Is that with",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 85,
      "start_timestamp": "00:37:53",
      "start_timestamp_seconds": 2273.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2273"
    }
  },
  {
    "text": "sense To trade within the spread a decrease in volatility lowers the range of spreads above and below to a break even level When they're above average leads traders to prefer off exchange executions So one of the things I think that's this is highlighting for you Is that with something that's really volatile like game stop There's kind of an incentive to route off exchange because of the volatility And what that can do to price And I think that that's also something that we've talked about before I think that we had a general conversation not all that long ago about the impact that um volatility has on The liquidity of things So this doesn't this just doesn't surprise me and it says by leveraging finras transparency data They construct a comprehensive sample We find clear support for our model finras data allows platform that are Theoretical model suggests that heterogeneity among the platforms is primary around the the probability of finding liquidity Yeah, so what this is essentially summarizing Which to me is nothing It's nothing crazy, but it's essentially summarizing that the The decision Generally lies in the pursuit of liquidity which again, I don't necessarily think that that surprises anybody I mean it definitely doesn't surprise me. That's just a logical a logical decision based on the prospects of liquidity So I would fully understand that choice personally So Lucidio says it seems like a self fulfilling prophecy the more you move to ATS in",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 85,
      "start_timestamp": "00:39:24",
      "start_timestamp_seconds": 2364.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2364"
    }
  },
  {
    "text": "think that that surprises anybody I mean it definitely doesn't surprise me. That's just a logical a logical decision based on the prospects of liquidity So I would fully understand that choice personally So Lucidio says it seems like a self fulfilling prophecy the more you move to ATS in a way from the exchanges the harder it is to get liquidity and the let exchange reinforce in the move Yeah, you're absolutely correct. That is 100 correct and The the way that they're playing this kind of problem is they're just leaning on the near term benefit To the individual not the longer term implication which is fairly common Right, I think that I think that that's probably not a giant surprise again to you guys Oh boy Everyone's in a while I just get like one of them Sharp shots of pain like that It's kind of a it's like a shitty game, but I'll tell you what it definitely keeps you on the ball because there is no fully relaxing Um, so yeah, I thought that this was interesting. I wanted to look through it in general with you all I think that you guys can poke through this Pretty much as much as you want. There was a couple other takeaways that I wanted to Talk about which is exactly Literally exactly what Lucidio Is talking about is that this creates a vicious cycle where as more volume is preferentially routed through ATS It inherently decreases",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 85,
      "start_timestamp": "00:40:57",
      "start_timestamp_seconds": 2457.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2457"
    }
  },
  {
    "text": "through this Pretty much as much as you want. There was a couple other takeaways that I wanted to Talk about which is exactly Literally exactly what Lucidio Is talking about is that this creates a vicious cycle where as more volume is preferentially routed through ATS It inherently decreases the depth on lit exchanges And then it increases the probability of more routing off exchange roaring titty who is being awesome Says chiropractor. I actually don't really like chiropractors I was at the physical therapist today. That's actually the photo that I shot you guys In the discord I was sitting there after getting like traction done and whatnot So yeah, you you boys active with trying to fix this whole thing, but I appreciate it. Thank you very much Roryne titty you the homie The the labo says which screws normal investors sort of again I think that's kind of dramatic to be completely honest the the reason why I think it's slightly dramatic is because it These kinds of decisions really impact people who are trading at larger sizes So if you're trading at a smaller size, we still want is liquid of a product is humanly possible We want active price discovery of course we want these things But when we're submitting a trade for 5,000 shares of GameStop It's just not it's just not that liquid for us and you can essentially get a fill I mean, I've done it right like you can get",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 85,
      "start_timestamp": "00:42:17",
      "start_timestamp_seconds": 2537.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2537"
    }
  },
  {
    "text": "possible We want active price discovery of course we want these things But when we're submitting a trade for 5,000 shares of GameStop It's just not it's just not that liquid for us and you can essentially get a fill I mean, I've done it right like you can get a fill on that order pretty easily Over the course of just maybe one or two adjustments So this becomes way more Hurtening to entities that are trying to fill slightly larger trades is all Again, I don't disagree with the point that I would prefer it being on exchange personally as well But again, I keep going back to this for you guys I I really try to look at both sides of things. I want to understand the good the bad the pros the cons That kind of stuff and that there are some pros some cons But in this case the impact to retail traders it's not excessively massive In terms of liquidity. I don't want to be miss misunderstood there I find that especially a lot of people that are Following along with the channel may be relatively new. They'll grab little things that I say and Yeah They'll think that I'm they'll kind of twist it. I've got hit with a few of those so far but um, I think Yeah, I think that there there's essentially with respect to liquidity It's not hyper detrimental to smaller retail traders like us So if it's for",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 85,
      "start_timestamp": "00:43:41",
      "start_timestamp_seconds": 2621.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2621"
    }
  },
  {
    "text": "and Yeah They'll think that I'm they'll kind of twist it. I've got hit with a few of those so far but um, I think Yeah, I think that there there's essentially with respect to liquidity It's not hyper detrimental to smaller retail traders like us So if it's for price discovery, I think that's a pretty clear loss for everybody I think it decreases price discovery that kind of behavior All right, let's take a look at this bad boy Um, this article analyzes the reach of the duty of best execution The off exchange market makers and its implications in the evolving equity market structure covers such key themes such as comparative regulatory perspective On the source of the duty of best execution. This gets really technical So this one I have read actually quite a few times and I can kind of a gloss over This with you guys the reason why I want you to be aware of this though is because This duty of best execution is really tricky And it's really tricky because there's a lot of gray area that comes with it and things like payment for order flow Technically speaking still fit into this concept of best execution even though payment for order flow It could be made better. It's not optimal for retail traders But again, I have to take a step back on that and make sure that I remind everybody that Payment for order flow is still light years",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 85,
      "start_timestamp": "00:44:54",
      "start_timestamp_seconds": 2694.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2694"
    }
  },
  {
    "text": "into this concept of best execution even though payment for order flow It could be made better. It's not optimal for retail traders But again, I have to take a step back on that and make sure that I remind everybody that Payment for order flow is still light years better for us Then what this was when I started trading 15 16 years ago. So while it's not perfect. It's not where I hope it ends up leading us It's not terrible. So yeah, there's that So anyways Let's see let's see where we want to start Carl says does that prevent the squeeze by keeping the stock liquid? um Carl could you Oh, it looks like you both are talking about squeeze. Sorry. Can you guys talk to me about what If it allows large block trades to be removed from the squeeze it favors those institutions in order I see Uh to a degree because the the thing is is if If something if there's an order routing change Orders that are filled on a dark pool they still get factored into the price eventually So can it affect a squeeze? I would say yes But I don't I would argue that it can't stop a squeeze because one of the things that we can objectively analyze When we look at when squeezes occur is the launch of on exchange volume on exchange volume starts to expand typically when we go through different kinds of squeezes so",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 85,
      "start_timestamp": "00:46:21",
      "start_timestamp_seconds": 2781.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2781"
    }
  },
  {
    "text": "don't I would argue that it can't stop a squeeze because one of the things that we can objectively analyze When we look at when squeezes occur is the launch of on exchange volume on exchange volume starts to expand typically when we go through different kinds of squeezes so It's because it kind of forces them on to in exchange So I don't I wouldn't say that it um Yeah, I wouldn't say that it forces I wouldn't say that it decreases the overall severity of a squeeze In terms of the propensity for it to happen again Dark pool volume is still going to be reflected in price eventually and we can actually get to the bottom of that really quick How long do dark pool orders take to be reflected in a stock's price Uh, it says it can vary on the factors Large dark pool trades especially those executed close to the current market price can have an immediate impact Dark pools often have delayed reporting of trades to minimize market impact The reporting delay can range from a few seconds to several minutes So like in that example right there Uh pyro gym says I thought dark pool trades were just private trades that wouldn't ever affect price action Oh interesting No, uh, let's see if there's like a I wonder if there's like a there's got to be like a cool visual or something Let me see if there's like a cool visual Hmm",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 85,
      "start_timestamp": "00:47:37",
      "start_timestamp_seconds": 2857.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2857"
    }
  },
  {
    "text": "thought dark pool trades were just private trades that wouldn't ever affect price action Oh interesting No, uh, let's see if there's like a I wonder if there's like a there's got to be like a cool visual or something Let me see if there's like a cool visual Hmm Don't see anything here that's great No, that's regulation Here I don't know there's a really good book that I have on dark pools that might be useful Oh, he's got to let this get unfrozen and then we'll take a look So So there's uh, well I'm here it goes So Where is it this book right here? If you guys haven't read this It's uh, it really is a pretty solid book That goes through essentially how dark pools were derived why they exist And how essentially they work so There's a lot of interesting nuance when it comes to to dark pools so Typically there are stand alone Prokers or Systems That will match dark pool orders So the orders typically are executed anonymously and then they get like dark pool orders are still disclosed You still can see them there's just a delay So Roaring TD says John Stewart is a great retail advocate. I think he is too. I think um Yeah, and I think that he has an interesting perspective on it I do know that his brother is like a pretty big part of one of the exchanges So I don't know. I'm",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 85,
      "start_timestamp": "00:49:17",
      "start_timestamp_seconds": 2957.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=2957"
    }
  },
  {
    "text": "says John Stewart is a great retail advocate. I think he is too. I think um Yeah, and I think that he has an interesting perspective on it I do know that his brother is like a pretty big part of one of the exchanges So I don't know. I'm a little curious about the actual motivations But yeah, I agree with you. I think he's he's overall decent Alfonso says dark pool must report their trading activities to finner within 10 seconds Yeah, so reporting to finner is one component But then also reported to the actual market is a second component so and they're they're still compulsory so Yeah, after the regulatory reporting the trade details are eventually disclosed to the public typically within a few seconds to a minute And then to your point this says trades executed in dark pools are reported to regularly authorities like finra In the US within a delay to maintain anonymity which is what you're talking about Um Um That talks about why they're there There's a couple different types of own dark pools so broker dealer exchange independent and some of the independence are actually the larger ones But broker dealers are like sigma acts cross finder those those sorts of things so Yeah, the the point is ultimately that There's it still is eventually reported It's literally how We're able to generate plots like this like if you have a bloomberg terminal for example On a bloomberg terminal you",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 85,
      "start_timestamp": "00:51:36",
      "start_timestamp_seconds": 3096.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3096"
    }
  },
  {
    "text": "dealers are like sigma acts cross finder those those sorts of things so Yeah, the the point is ultimately that There's it still is eventually reported It's literally how We're able to generate plots like this like if you have a bloomberg terminal for example On a bloomberg terminal you can see dark pool orders so Yeah, I think that's the that's the interesting thing about them Oh It looked like I dropped for a second. I think we're back So um, let me see there's uh Nolla says if I do a directed trade to a particular exchange Uh, what about that Gravitaris says our options included in dark pools are only shares. It's typically it's typically not options So If you're using something like options they have um They have a different regulatory routing And all options will eventually go through the oh yeah, no list says options are OCC. Yeah, so options are standardized contracts now The other thing that I'm not aware of but I am curious about is with something like dark pools if they can use exotic derivatives like different kinds of custom swaps and stuff So yeah All right, Marcus says I have a few questions what are the rules for pre market and after hour trades who trades Is the any limits to volume? I don't know if there's limits to volume But it essentially just comes down to those who have access and a lot of people have access depending on",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 85,
      "start_timestamp": "00:52:49",
      "start_timestamp_seconds": 3169.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3169"
    }
  },
  {
    "text": "a few questions what are the rules for pre market and after hour trades who trades Is the any limits to volume? I don't know if there's limits to volume But it essentially just comes down to those who have access and a lot of people have access depending on your broker You might have access So pre pre-trait like pre-imposed market hour trading is not quite as elusive as people might think it is The only downside to it is that things are typically very liquid during those periods so Scott says are large derivative contracts reflected on the dark pool or they just flow until realized so Um, trying to understand your question When you say large derivative contracts you talk about options positions because if so then they're going to go across Illite exchange typically Matt says with the overall pain in the market right now do you consider the cash GME raised was a good move definitely I think the cash that GME raised is overall good for them in general and the reason why is because I think By going that route it gives them like literally the best possible opportunity to reinvent themselves because again I know the apes really love GameStop and do a lot to support GameStop which I'm all about I love that from a broader company perspective though as like a brick and mortar business they like they have a offering right they do have things like we talked about",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 85,
      "start_timestamp": "00:54:30",
      "start_timestamp_seconds": 3270.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3270"
    }
  },
  {
    "text": "again I know the apes really love GameStop and do a lot to support GameStop which I'm all about I love that from a broader company perspective though as like a brick and mortar business they like they have a offering right they do have things like we talked about on that one stream with newton Which he and I I think just so you guys know I think he and I are locked in for our next stream on the 17th Because I'm going to be out of pocket for a little bit so the daily videos and stuff like that they're going to dry up For about a week and change just so you guys know I'm not like uh disappearing on you all I'm just stepping stepping out of the office as it were for a little bit But I will be back I will be back But anyways, yeah the next stream with newton will be then which is great because he and I we we're still texting essentially every day And I have a million things that he and I are gonna have to uh That he and I are gonna have to cover So yeah Hmm Back to the original question I think it's good in a nutshell. I think it's good I think having a bunch of cash is going to help them And I think that by them increasing their cash position it'll it'll it'll it does allow them to innovate Now",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 85,
      "start_timestamp": "00:55:47",
      "start_timestamp_seconds": 3347.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3347"
    }
  },
  {
    "text": "yeah Hmm Back to the original question I think it's good in a nutshell. I think it's good I think having a bunch of cash is going to help them And I think that by them increasing their cash position it'll it'll it'll it does allow them to innovate Now one of the things I was curious is they were going to start going on a little bit of a acquisition spree But I haven't seen that really come to fruition yet which actually surprises me a little bit Because they raised a bunch of cash and I thought that they were going to be a bit more active in using it But I and this is one of the things that I understand the frustrations. Let me take a look at uh GME shareholder meeting From the last shareholder meeting I know that there was a lot of Enxed I guess you could say There was some angst I suppose Around what they talked about I'm trying to look for the notes. It was 23 April right is this correct? Do I have this right? GME Q2Ns tomorrow. Yeah, their quarter well a lot of companies are in the same same bucket there Is this the right thing You Is this Was this correct? I just want to make sure I'm looking at the right proxy statement. I wanted to read through this with you guys I just don't know if this is the right the right thing it",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 85,
      "start_timestamp": "00:57:05",
      "start_timestamp_seconds": 3425.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3425"
    }
  },
  {
    "text": "same same bucket there Is this the right thing You Is this Was this correct? I just want to make sure I'm looking at the right proxy statement. I wanted to read through this with you guys I just don't know if this is the right the right thing it looks correct This is This is From 13 June Yes, okay cool. Thank you roaring titty the latency on this is kind of annoying I have it set for low latency, but there's an ultra low setting which I typically use But normally since I'm doing these with new and through zoom there's a little bit more of a delay, but anyways Uh, let's see Uh, this is the board of directors stuff Executive compensation independent stock holder proposal We don't care about these We don't care about these We do not care about these Governance clawback. Yeah, yeah, yeah compensation So it looks like they are all getting 200,000 in two bucks And stock Except Ryan Cohen right I didn't see him. I think he's I think you guys were saying If I'm not mistaken that he just buys his stuff Blackrock wait, did you guys know that That surprises me a little bit It seemed like Blackrock was I don't know when I look through the the GME communities It looks like in general people don't like Blackrock Or is that just citadel that like the apes don't like Be okay pensions Blackrock owns a little bit of",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 85,
      "start_timestamp": "00:58:17",
      "start_timestamp_seconds": 3497.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3497"
    }
  },
  {
    "text": "surprises me a little bit It seemed like Blackrock was I don't know when I look through the the GME communities It looks like in general people don't like Blackrock Or is that just citadel that like the apes don't like Be okay pensions Blackrock owns a little bit of everything They were behind prop four low position for Blackrock So citadel yeah, I definitely saw citadel people don't like Okay, so it sounds like you guys are yeah, no, I'm I'm well aware of how deep Blackrock goes fun fact Um some of the commercial real estate stuff that I do with some partners We actually acquire things like student housing We just acquired a couple more ski resorts that will then operate And we start to find that some of the things that we're looking at which is not like a small level But it's not a big level that we start kind of bumping into to Blackrock Which is interesting homies are literally everywhere But yeah, no, I'm super well aware that Blackrock is nuts Royne titty says look at prop four on the boat. Yeah, sure uh is that up here Let's see prop Uh For can I count? What the fuck's that a Okay, here we go prop one prop two prop three prop four yeah 41 that's what I was trying to get to Okay, so now here's the next question When I click 41 here is it actually going to be this or",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 85,
      "start_timestamp": "01:00:33",
      "start_timestamp_seconds": 3633.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3633"
    }
  },
  {
    "text": "can I count? What the fuck's that a Okay, here we go prop one prop two prop three prop four yeah 41 that's what I was trying to get to Okay, so now here's the next question When I click 41 here is it actually going to be this or is it going to be the stupid pdf difference And 41 will be a couple pages off of this any guesses So like one of my most like most annoying things I hate About pdf documents is it'll say the number here And then when you click it it'll be pdf something else Let's see what page this is what pages this 35 not even close why what Why do they do this? It's so stupid Everybody does this. I hate it so much Just Fucking make it match Literally just make it match Everybody knows that when you're going to use this you're going to flip through like this so give these pages Oh so stupid So stupid You have to go to like not page fucking 41 or whatever it's page fucking 47 Oh so annoying He ate that I hate that so much all right here we go Rans aside We expect prop four to be presented to the control of New York cities custodian trustee employees system E C C C C Proposal was submitted by the comptroller yees Uh Jeffrey Jones what up good to see you Cactus shacks as flip tables. No, I really",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 85,
      "start_timestamp": "01:02:08",
      "start_timestamp_seconds": 3728.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3728"
    }
  },
  {
    "text": "go Rans aside We expect prop four to be presented to the control of New York cities custodian trustee employees system E C C C C Proposal was submitted by the comptroller yees Uh Jeffrey Jones what up good to see you Cactus shacks as flip tables. No, I really I have a really nice standing desk That's actually how you guys will see me stand and sit throughout the things at the electronic big fan big big fan Um this says share holders of GameStop request that board of directors disclose its annual proxies statement self identified bullshit skills Yeah, I don't care about any of that. Roryn titty. What am I here for Tell me what I'm supposed to be looking for Because I typically trust you with what you send me to The board unanimously recommends that stockholders vote against prop four The propose over requesting board skills and diversity matrix proxy solicited. I love that Fuck yes What a shocking what a shocking concept of trying to hire people based on fucking qualifications This is great GameStop does not set a specific minimum qualifications for nominees for Director and does not have a policy regarding the consideration of diversity for such nominees We do not believe diversity whether gendered is a meaningful basis by which to identify and assess the qualifications of a director I love this so much. This is fantastic Our board is composed of individuals who exhibit these traits big fan Big fan",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 85,
      "start_timestamp": "01:03:35",
      "start_timestamp_seconds": 3815.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3815"
    }
  },
  {
    "text": "consideration of diversity for such nominees We do not believe diversity whether gendered is a meaningful basis by which to identify and assess the qualifications of a director I love this so much. This is fantastic Our board is composed of individuals who exhibit these traits big fan Big fan that's awesome Uh Wait, where does it say who proposed it? Let's see if he says Microsoft just fired all the DEI people yeah, well, I think they started I think companies are starting to get abreast My guess is some of what's going on here is DEI was a giant focus for a little while And then as that starts to come out of vogue to a degree I think people are realizing that hiring like specific DEI resources is a giant suck of resources And I think that it I mean, I don't want to go too far down the path of like you know diversity and whatnot I'm you know whatever But my opinion is and has always been just fucking higher qualified people I think that that's essentially the the way I would want things to go Um Hyrogim says the proposal was submitted by the New York City Comptroller Who'd at though We expect to be presented by the Comptroller of New York City as the custodian and a trustee of the New York City employee retirement system I'm confused I'm really confused what is the New York City employee employees retirement system has to",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 85,
      "start_timestamp": "01:05:06",
      "start_timestamp_seconds": 3906.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3906"
    }
  },
  {
    "text": "New York City Comptroller Who'd at though We expect to be presented by the Comptroller of New York City as the custodian and a trustee of the New York City employee retirement system I'm confused I'm really confused what is the New York City employee employees retirement system has to do with this pension fund that owns GME all their investors oh I see Lucidio says read the next paragraph That's literally my favorite comment read you idiot and it'll answer your question. There we go um Wait, you think blackrock owns this Let me see that would be surprising to me if they did You New York State Comptroller yeah because this to me seems like a a government function no Ruined to the says blackrock was behind that I'm pretty sure I thought I heard the comptroller said blackrock was 3.5 of the shareholders Oh I see Chris Demel says he was hidden ahead too many times but thank you very much patience. That's exactly right I've had more than my fair share of concussions at this point in my life I really appreciate the support Because you boy I mean realistically you boy needs it you boy just needs it So yeah Thank you. Thank you Chris spelt with a K my brother's name is also Chris but spelt normally Chris with a K is kind of uh It's kind of aggressive I think it's cool but a little bit different But yeah, this looks like a",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 85,
      "start_timestamp": "01:06:33",
      "start_timestamp_seconds": 3993.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=3993"
    }
  },
  {
    "text": "just needs it So yeah Thank you. Thank you Chris spelt with a K my brother's name is also Chris but spelt normally Chris with a K is kind of uh It's kind of aggressive I think it's cool but a little bit different But yeah, this looks like a government system. I don't see blackrock here So where where is their involvement uh and you're like that you guys are speculating on You're like a blackrock Let me see really quick black rock involvement The okay might be the admin So This says Chatchy PT says the New York City employees retirement system is actively involved with blackrock both as an investor and as a client And and why cres has approximately 40 million invested in blackrock which makes sense And blackrock manages around 19 billion on behalf of and why cres so you guys are absolutely right see this wife In love apes bro you guys are always In on shit you guys know what the fuck is going on So yes recently and why cres has used its annual share power to influence decisions at black rock particularly concerning the appointment of board members And why cres along with the new york city comptroller brad lander urge black rock share holders to vote against The election of a min nacer the CEO of southe Aramaiko to blackrock's board the opposition was based on potential conflicts of interest over human rights climate issues Despite the efforts of n",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 85,
      "start_timestamp": "01:08:49",
      "start_timestamp_seconds": 4129.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4129"
    }
  },
  {
    "text": "along with the new york city comptroller brad lander urge black rock share holders to vote against The election of a min nacer the CEO of southe Aramaiko to blackrock's board the opposition was based on potential conflicts of interest over human rights climate issues Despite the efforts of n y c rs including filing an exempt solicitation with the scc and highlighting the risk of having on the board Blackrock shareholders you ultimately reelected him the filing pointed out that the position SEO of aramako a major fossil fuel company conflicts with black rock stated goals of decarbonization The involvement so it looked that's a really dynamic relationship as I read about it. It's both So it doesn't look like blackrock controls this it looks like there's actually a little bit of back and forth there Which I find really really interesting Benoit balls says pronounced a ramco A ramco I like a romco so they can go fuck themselves I call them I call them eramaiko That's what I call them Marcus says a little long objective in scope to keep jack to these guidelines are to ensure inclusive culture. Yeah That's interesting Well, it's good they got shot down backs Financial statements All right, that's that I was curious if they had anything about the cash I think we can probably kill this All right So the next thing that I wanted to take a look at with some of old roaring kitty option straights for me",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 85,
      "start_timestamp": "01:10:39",
      "start_timestamp_seconds": 4239.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4239"
    }
  },
  {
    "text": "shot down backs Financial statements All right, that's that I was curious if they had anything about the cash I think we can probably kill this All right So the next thing that I wanted to take a look at with some of old roaring kitty option straights for me to develop his fingerprint a little bit more But we can we again anything that you guys want to take a look at throw it in the chat A pyro gem. What was that book on algo wars the there's two of them. So the one that I was referring to you guys before was called Uh Dark pools by Scott Patterson is that one Justin says arcade charts can I post a link yeah happy to take a look I don't think you can post a link roaring titties the one that educated me that that you can't I don't think it lets anybody else because it's straight up disrespectful Money ting says lawsuit. Yeah, let's take a look at that lawsuit And so anyways a couple books that I think you guys should check out Uh dark pools is a great one And then trading in exchanges this is like one of the best Literally one of the best just general it's old unfortunately But it's got a ton of great market structure details in there and then Inside the black box is also I think pertinent to you all here which is pretty cool All right, so",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 85,
      "start_timestamp": "01:12:07",
      "start_timestamp_seconds": 4327.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4327"
    }
  },
  {
    "text": "is like one of the best Literally one of the best just general it's old unfortunately But it's got a ton of great market structure details in there and then Inside the black box is also I think pertinent to you all here which is pretty cool All right, so uh justin says rory rory kit dinger charts Uh wait, do you mean the ones from I was gonna grab the ones from newton no Because newton I think on his google sheet he has like the the list of arcades Arcades charts from yahu finance, right Am I am I off base here Yo, I tell him all the time that I love what he's doing, but I can't find shit on here No, he's to and he has this stuff mapped like the back of his damn head. It's crazy I Know rk has his own stock charts. All right, where am I supposed to go So I thought I was looking at roaring kiddie's charts But you guys are saying that he has his other his his own shit Oh, sorry, didn't mean to hit the mic Where the hell's this chart go to stock charts got it Going to stock charts as directed I am now at stock charts and then I'm supposed to look up roaring Kiddinger Uh, nothing pops up Am I the right spot Oh Rory Rory The disrespect Not giving me shit. All right, Rory Rory Kiddinger Kiddinger This pops up Rory",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 85,
      "start_timestamp": "01:13:38",
      "start_timestamp_seconds": 4418.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4418"
    }
  },
  {
    "text": "it Going to stock charts as directed I am now at stock charts and then I'm supposed to look up roaring Kiddinger Uh, nothing pops up Am I the right spot Oh Rory Rory The disrespect Not giving me shit. All right, Rory Rory Kiddinger Kiddinger This pops up Rory Uh link in the chat down at the bottom I Don't think you guys can drop oh If you put it in the discord I can find it if any of you guys are in the discord if you drop it in there I can grab it in like two seconds. They'd be much faster Rory and titty is making sure you all know that links do not show up in here by default Uh, let me see. I'll try to do like a control F in here Uh Ha this one Did we find it Hey, yeah, this is the one that Newton has on his stuff We found it we did it. I just have to see if I can find it in here because he has it in here somewhere This one This one Man you guys sent me down. Damn it. I knew they had it. All right, we found it. We're good. We found it. We made it I think that this might cause for a slight celebration cheers everybody Hmm That's a problem. It's a big problem So right now we're out of crystal that one's gone The mango orange that's now gone So",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 85,
      "start_timestamp": "01:15:20",
      "start_timestamp_seconds": 4520.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4520"
    }
  },
  {
    "text": "All right, we found it. We're good. We found it. We made it I think that this might cause for a slight celebration cheers everybody Hmm That's a problem. It's a big problem So right now we're out of crystal that one's gone The mango orange that's now gone So we are moving on to the backup beverage Which is what do we have Um black berry lemonade. I forgot I could put my hand behind it. I think so you can see it black berry lemonade There we go We're back in it You boy Consumes a lot of liquid. All right, so Let's see what what do you guys want to look at here anything in particular What do I see uh this one I don't really care about To be honest because it's all intraday. It's like really really short term stuff uh, let me Let me move this back over here Move this over here And then I'll get rid of myself again because nobody really cares to see me And then this way you guys can see a little bit better. I will zoom us in That should be decent for you guys. Yeah All right, so what do we want to look at it looks like Uh Rhyme to the says roll down and then we want to look at rsi pre 2011 Then the ones kiddie has circled are interesting. Let's do it Let's see what those look like. Okay, I see So",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 85,
      "start_timestamp": "01:17:44",
      "start_timestamp_seconds": 4664.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4664"
    }
  },
  {
    "text": "right, so what do we want to look at it looks like Uh Rhyme to the says roll down and then we want to look at rsi pre 2011 Then the ones kiddie has circled are interesting. Let's do it Let's see what those look like. Okay, I see So this is on a weekly and And He's using a 14 day rsi and he's showing it looks like a divergence here Is what I'm seeing So this was back in 2021 And He's just showing a couple instances where it looks like rsi divergence The problem I would say let me slide that out of the way. Let's go to game stop. Let's do again We can essentially recreate it to a degree. We'll do a 10-year weekly And if we zoom this in So it's a little easier to see Let me go to 21 here You zoom this in more So the cci also did a similar thing right so one of the first things to note is Oscillators are slightly notorious for a lot of mixed triggers and again, I've spent a lot of oh shit pie Hi ro mjm. I was calling you pyro gym in my mind But pyro shout out to you welcome to be an outlier supporter really really appreciate it I also realized that I'm still a ghost here. So here I am. I'm back. Can't get rid of me I also just looked at myself for the first time on",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 85,
      "start_timestamp": "01:19:15",
      "start_timestamp_seconds": 4755.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4755"
    }
  },
  {
    "text": "in my mind But pyro shout out to you welcome to be an outlier supporter really really appreciate it I also realized that I'm still a ghost here. So here I am. I'm back. Can't get rid of me I also just looked at myself for the first time on this stream And I didn't realize that one that I was like glowing take hold on. Let's let's play a game Let's turn this brightness like all the way up. Check that out Oh my god that goes super bright. There it is feels like I am Looking at the sun But anyways the other thing I realized looking at myself is that you boy need to haircut because this is just not it Justin says angelic Maybe if we put it behind me it would look a little more angelic, but nothing about me is angelic So anyways looking at oscillators oscillators have a really mixed track record And I think it's important to be aware of that because I can find a lot of instances even with something like cci where cci is very high and prices diverging. So I just I think it's important to point that out but let's add a study here And then let's take a look at rsi specifically and he's using a 14 day rsi which is a default setting by the way Yeah, so we have 14 day rsi here And then we'll just leave that for now and again, I'll",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 85,
      "start_timestamp": "01:20:52",
      "start_timestamp_seconds": 4852.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4852"
    }
  },
  {
    "text": "out but let's add a study here And then let's take a look at rsi specifically and he's using a 14 day rsi which is a default setting by the way Yeah, so we have 14 day rsi here And then we'll just leave that for now and again, I'll get rid of myself so that you can see me and So what I see here is The same thing we're obviously It's going to line up with what you're tracking on his chart right like this big um Big divergence, but the the thing is is you'll find other instances where rsi is peaking or even cci is peaking And stock price isn't necessarily playing ball and you'll find the inverse where you will find something like cci or rsi again, it's it's just a oscillator you can essentially call all the oscillators the same thing It's like they behave slightly differently, but they're all the same shit So You'll find instances where the oscillators are actually declining and the underlying is going up So it's just something to be aware of right there's nothing wrong with using oscillators Again, I have one there's a reason why you cci is because based on my studies for the stuff that I trade cci tends to behave a little bit better for My needs But Yeah, anyways, I figured We would take a look at it in here, but we can go back to these charts though I'm finished poking through",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 85,
      "start_timestamp": "01:21:59",
      "start_timestamp_seconds": 4919.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=4919"
    }
  },
  {
    "text": "is because based on my studies for the stuff that I trade cci tends to behave a little bit better for My needs But Yeah, anyways, I figured We would take a look at it in here, but we can go back to these charts though I'm finished poking through um Dr. Zayas says cci measures the current price level relative to an average price level over a given period time Yeah Oh, I think you were just explaining what cci is for people. Thank you very much I did not realize that uh, it wasn't like well understood my bad That's on me Um Let's see what else is in here quick Uh Money ting says don't forget about the lawsuit. Yeah, we'll pull that up right after this promise. Let me grab that Uh, gme lawsuit dropped And we'll grab that from Rooters So we won't we won't forget we won't forget again Uh Hanyah says nssc is making a new system for exercise options allowing fdds to be infinitely fd tomorrow well Hmm We'll take a look at that We'll take a look at that a little oh fuck sorry the transitions really are Comfortables fuck We'll take a look at that Is well But the the fact of the matter is if we think about ftds there There are already allowed to be perpetually deferred as annoying as it is as much bullshit as that is Because We can see a lot of instances where Things",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 85,
      "start_timestamp": "01:23:22",
      "start_timestamp_seconds": 5002.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5002"
    }
  },
  {
    "text": "take a look at that Is well But the the fact of the matter is if we think about ftds there There are already allowed to be perpetually deferred as annoying as it is as much bullshit as that is Because We can see a lot of instances where Things are running higher ftds And nothing happens so Yeah, I mean we'll we'll take a closer look at that, but let's finish here And it says uh Camp hire says what does the blue dotted line on the first chart represent. Let's go blue dotted line This To me that just looks like a center line You mean this one in here the horizontal line in the rsi or which blue dotted line Talk to me At 23 At Oh and think or swim yo that's confusing to me you have me tripping A blue dotted line and think or swim I don't know if I have one of those You It sounds like you might know my chart better than I know my chart what blue dotted line you talking about In here It's a small dotted line on the chart you had up So this one's think or swim Right doctors a says Blue dotted line and thicker swim Camp hire says it's a small dotted line on the chart you had up which is this one Do you mean here over here that looks like a price level Like right at the end. I see right at",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 85,
      "start_timestamp": "01:25:14",
      "start_timestamp_seconds": 5114.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5114"
    }
  },
  {
    "text": "swim Right doctors a says Blue dotted line and thicker swim Camp hire says it's a small dotted line on the chart you had up which is this one Do you mean here over here that looks like a price level Like right at the end. I see right at yeah, okay. Yeah, that's just a price level I don't think that that really means anything more than that Yeah, I think it's just a price level Is Is there anything else that we wanted to look at on these charts before we go over to that case Also Let me Oh, I kind of want to try one second YouTube Change stream latency midstream Trying to see if there's a way To change the the latency while we're still live I might wait a little bit later just in case it nukes it I think I can stop streaming and then it might let me do it, but I'll try it later Um look at the RSI that rk circled. Okay, let's find that I think we were just looking at that, weren't we? This one We were just looking at this one this I think he was just hiding it highlighting a divergence This doesn't Yeah, this doesn't really At least I don't think I don't think this means a whole lot at least to me There's another one higher to this one you see Cody says cat ears. I mean it could be cat ears if the",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 85,
      "start_timestamp": "01:26:57",
      "start_timestamp_seconds": 5217.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5217"
    }
  },
  {
    "text": "hiding it highlighting a divergence This doesn't Yeah, this doesn't really At least I don't think I don't think this means a whole lot at least to me There's another one higher to this one you see Cody says cat ears. I mean it could be cat ears if the cat has one really good ear and then one terrible fucked up ear that has like a mutation coming out of it Cedric says undersold two times made big move up Well, this wouldn't be this wouldn't be undersold this would be Yeah, like this is something that's technically overbought Things that are running up that high Cedric says volume RSI sloping up after being undersold Yep Yeah, okay, I see you guys are doing I would recommend not doing that The Reason why I think that there's a bit of an issue is because again like The looking back at price movements and corresponding them to different kinds of indicators is like the purest form of overfitting And you can find tons of instances after the fact. It's a very easy to do So it creates a natural conflict in kind of our minds So let me move this up the price chart is a little squished, but that's okay. It doesn't necessarily matter too much And let's like let's do that same exercise right like let's say that I see Uh significant Cedric says you won't find one with big volume after being oversold Right here What do",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 85,
      "start_timestamp": "01:28:50",
      "start_timestamp_seconds": 5330.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5330"
    }
  },
  {
    "text": "up the price chart is a little squished, but that's okay. It doesn't necessarily matter too much And let's like let's do that same exercise right like let's say that I see Uh significant Cedric says you won't find one with big volume after being oversold Right here What do you mean Cedric says you won't find one with big volume after being oversold so this is oversold And then this is big volume during the oversold Cedric says that's the He means another one. Oh, I see yeah, let's let's take a look and but see the one from the chart we're looking at is from 2021 And this one was from yeah, these are from 2021 I see what you mean I'm following now. So you're saying that RK is saying to look back at this and uses this as a reference Okay, got it. Yeah, let's take a look Oh, let's go to Let's do like a 10 year daily Uh right here is an example Where volume was oversold It had relatively big spike in volume and price didn't move much Here's another example Here's another example after the fact So Those are four additional instances three or four additional instances where price was marked oversold and it had larger confirmatory volume And in this case the big move already happened when you got that indicator Cedric says those have bullish for of course they do that's that's what I'm trying to explain to you is",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 85,
      "start_timestamp": "01:30:40",
      "start_timestamp_seconds": 5440.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5440"
    }
  },
  {
    "text": "three or four additional instances where price was marked oversold and it had larger confirmatory volume And in this case the big move already happened when you got that indicator Cedric says those have bullish for of course they do that's that's what I'm trying to explain to you is that this is after the fact Right, so after the fact it's so easy to say like oh yeah, it went up here And then this all happened when you're when you're forward looking the line changes based on what's happening today So what this isn't capturing are the periods like here right this line is also oversold and When like that's the nature of the oscillator Is that you're always essentially going to find that as the oscillator is high price will be high as the oscillator is low price will be low So that part is like really again, it's really easy to align that Looking back in time But when you're looking at Uh Cedric says that's overbought. No. Yeah, that's what the the red is up here above 70 is overbought So that's bullish that tip like in order for in order for it to get to overbought price has to have moved up And in order for it to get to a point where it's oversold price has to have moved down So that that's the concept right overbought meaning too many people bought it driving price up oversold too many people sold it driving",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 85,
      "start_timestamp": "01:32:47",
      "start_timestamp_seconds": 5567.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5567"
    }
  },
  {
    "text": "to overbought price has to have moved up And in order for it to get to a point where it's oversold price has to have moved down So that that's the concept right overbought meaning too many people bought it driving price up oversold too many people sold it driving price down so Cedric says I don't want to see it at red. I mean, I don't know why because when it's at red is when it's peaking the the highest moves You're going to see from a historic perspective are going to be when it's above 70 That's what pushes it above 70 that's what RSI is looking at literally those moves specifically So I think that you actually want I think you want it to be red actually Because that's when you're going to see it making the bigger up moves. That's what drives it above 70 If you don't have bigger up moves like that it won't make that kind of move Justin says I want to see blue then red. I mean if we're up to me. I would want to see no blue Again, in order for it to be blue it means it needs to be pushed down. It needs to be really really low So then you'll see like a period here where it's deep blue And it ran that way and then it just declined from that period for some time and still it started getting strength Right to D says am",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 85,
      "start_timestamp": "01:34:04",
      "start_timestamp_seconds": 5644.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5644"
    }
  },
  {
    "text": "to be pushed down. It needs to be really really low So then you'll see like a period here where it's deep blue And it ran that way and then it just declined from that period for some time and still it started getting strength Right to D says am I the only one confused. Oh shit. I didn't realize that this was confusing. Yeah, let's okay So RSI relative strength indicator. I can grab you the actual permutation for that's calculated one sec RSI I Here you go. So there's two papers that I would refer you to This is a good paper on it So I would highly recommend checking this paper out. It goes through the actual kind of math behind it and so Cedric says I buy oversold stock not overbought. I mean yeah that that could be your approach whatever Whatever makes it happy is cool But what I can tell you is shit that's oversold is going down. So me personally that's that's not when I buy stocks I buy things if I'm buying stock I want something to go up So I'm going to wait for it to be going up the problem is what you're employing is a really common trader behavior Which is bargain buying and it's a misapplication of a really standardized thought process that you have as a human consumer So we're taught from a natural perspective to enjoy bargains. We like sales Right, that's why if you go",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 85,
      "start_timestamp": "01:35:17",
      "start_timestamp_seconds": 5717.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5717"
    }
  },
  {
    "text": "is what you're employing is a really common trader behavior Which is bargain buying and it's a misapplication of a really standardized thought process that you have as a human consumer So we're taught from a natural perspective to enjoy bargains. We like sales Right, that's why if you go to a lot of stores They have sales perpetually. Is it really a sale if there's always one going on? No not at all It's just a marketing ploy because they know people like sales The problem with that with respect to something like carrying that over to the market is that things that are on sale Are on sale for a reason means they're going down So if I'm buying stock and I want something to go Up when I buy stock I don't want to buy it when it's going down I want to buy it when it's going up That takes a long time In order to like reconfigure the mind but you'll make you'll typically do much better in that way Or you can be like Las Sejas the yummy and says it rips. I watch to telephone numbers So they're not trying to buy at a discount or to buy when it's oversold or too low But they're just buying and they're going to keep buying which that's totally chill That's another approach Now the idea yet Chris says oh fuck here we go chat needs fixed ASAP That confused me that sentence not following",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 85,
      "start_timestamp": "01:36:35",
      "start_timestamp_seconds": 5795.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5795"
    }
  },
  {
    "text": "a discount or to buy when it's oversold or too low But they're just buying and they're going to keep buying which that's totally chill That's another approach Now the idea yet Chris says oh fuck here we go chat needs fixed ASAP That confused me that sentence not following you there but yeah I think Cedric says I meant like back test on gme buying oversold and only if bullish volume comes in Um Um I'm trying to think of a way to explain that So you're you're very rarely going to see that condition Where something is wait oversold or overbought let me make sure Oversold and only bullish if volume comes in um again What you're going to find is when volume hits Oversold It's going to be at or when rsi hits oversold. It's typically going to be at the inverse extreme Then when it's overbought So if we look at oversold here. Let's just squish this down look at volume The majority of instances that you're going to see oversold is when volume is Generally speaking going to be relatively high on the sales side but slowing down That's when this will peak Is at that juncture and then to the upside it's typically the inverse where you'll see volume doesn't have to be by volume only But you'll see volume very very high when this is peaking because again, that's what causes these peaks It's a pretty standardized relationship with the tool. It's literally",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 85,
      "start_timestamp": "01:37:54",
      "start_timestamp_seconds": 5874.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5874"
    }
  },
  {
    "text": "that juncture and then to the upside it's typically the inverse where you'll see volume doesn't have to be by volume only But you'll see volume very very high when this is peaking because again, that's what causes these peaks It's a pretty standardized relationship with the tool. It's literally how it's calculated It's what it's looking at Uh leapfrog says why not look at the three-month chart. Oh, we can look at the three-month chart I'm happy to Anything in particular you want to peek out here Justine says I think he means a condition of oversold Followed by relatively high volume days after Uh, what about that? Let me grab my RSI back. Oh, I still have it my bed And we're looking at oversold still um sorry leapfrogs. I have to switch from the three-month so that I can see We're uh Chris says your chat is like three minutes late. Yeah, I know there's a bigger delay than I like Let me try I'm gonna try to stop the stream really quick from OBS and see if it lets me change it give me one second All right, I think we're back unfortunately it doesn't let me change the latency when it's on This is the it's because I'm using the one that I normally am doing when I'm streaming with Newton Um Justin says I think somebody says it would be a good by opportunity Again, like I can tell you from a quantitative perspective.",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 85,
      "start_timestamp": "01:39:37",
      "start_timestamp_seconds": 5977.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=5977"
    }
  },
  {
    "text": "me change the latency when it's on This is the it's because I'm using the one that I normally am doing when I'm streaming with Newton Um Justin says I think somebody says it would be a good by opportunity Again, like I can tell you from a quantitative perspective. It's typically not but if somebody likes it I would not say don't do it But you'll find periods like those two indicators by themselves to me aren't sufficient Like I wouldn't I personally wouldn't base an entry decision off of the condition being light RSI Meaning oversold and Expanding volume like that that would not be enough for me And it's because of the way that the tools are calculated So yeah, I mean it just requires more than that for me because for example this starts hitting oversold here On this day up here, which again the price is so flat here because of the the extremes I don't know if this lets me move the chart up does it That's kind of annoying Uh Pirates is double click it doesn't Yeah, I was gonna say double click doesn't work that auto auto centers it. It's completely different Nick says why don't you use log mode because log mode kind of perverts Um Perverts how price like how you're actually tracking price So I don't hate it. It has its purpose But yeah, it's not my go-to anyways Going back to this it doesn't really matter that much",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 85,
      "start_timestamp": "01:41:13",
      "start_timestamp_seconds": 6073.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6073"
    }
  },
  {
    "text": "Nick says why don't you use log mode because log mode kind of perverts Um Perverts how price like how you're actually tracking price So I don't hate it. It has its purpose But yeah, it's not my go-to anyways Going back to this it doesn't really matter that much because I can see the prices on the on the right hand side This originally became technically Oversold on this day here and this day here was 14 aug And it came in at let's just say the close was 1996 So then the volume on this day was 3.3 million So let's scroll to the right until we see more volume above 3.3 million I see 3.7 million here Which is at 22 Nope My bad I'm gonna go back Oh, where did it go 1.8 4.6 So I see 4.6 million volume here But you can see where that comes in we're out of oversold that's gone that condition has left us So this is the the general problem that you'll have if those are your two indicators personally I don't really see I don't really see the overall benefit to limiting yourself to that He says he means weekly well then if you mean weekly you've had no indicators for the past five years except here And if you had listened to that indicator of Expanding volume so this went from the trowel here is at 88 And then you got 204 million volume here at 19",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 85,
      "start_timestamp": "01:42:40",
      "start_timestamp_seconds": 6160.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6160"
    }
  },
  {
    "text": "means weekly well then if you mean weekly you've had no indicators for the past five years except here And if you had listened to that indicator of Expanding volume so this went from the trowel here is at 88 And then you got 204 million volume here at 19 August it looks like And games stop here closed at 91 cents And then if I fast forward Kind of to I don't know how long you would hold for like what the exit condition is but in February third It was at 95 cents close So you got in at 91 you'd get out at 95 there or if you kept holding you would be in at a low of 64 All I'm saying is like if it works for you I'm happy for you. You should absolutely continue to use it But what I can tell you is from again like an objective trading perspective Like I wouldn't limit myself to those two indicators because there's no imperative to do so and secondly Those two indicators alone are going to put you in a lot of pain very frequently That's not to say that they can't eventually Move where you want it to go But then it's also important to remember that there's an opportunity cost with where we're parking money so If I put money in something here like this right the first of February And the first of February it's trading at 1490 and then come",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 85,
      "start_timestamp": "01:44:21",
      "start_timestamp_seconds": 6261.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6261"
    }
  },
  {
    "text": "where you want it to go But then it's also important to remember that there's an opportunity cost with where we're parking money so If I put money in something here like this right the first of February And the first of February it's trading at 1490 and then come the second of May It's at 12 Not a big price change necessarily it's down a few bucks But it's also been parked there doing nothing for me for three months Right like I want to be able to make money over the course of that three months That's part of being like an efficient trader So yeah The the cliff notes of that is like whatever works for you do that But for me, I demand a hell of a lot more In terms of deciding when I'm choosing to to buy or sell personally But yeah, totally cool All right, what else should we look at we still got a few minutes left I'm actually going to get ready to launch my dinner order But it won't be here for a little bit So tonight we are going to do Greek food I'm going to get me some Baklava, I love some Baklava We're going to do the meat chicken kebab in Euro and then another chicken kebab Money things spot on thank you for the reminder. We're going to look at this lawsuit Otherwise money things I don't think would ever forgive me and I wouldn't blame",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 85,
      "start_timestamp": "01:45:41",
      "start_timestamp_seconds": 6341.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6341"
    }
  },
  {
    "text": "Baklava, I love some Baklava We're going to do the meat chicken kebab in Euro and then another chicken kebab Money things spot on thank you for the reminder. We're going to look at this lawsuit Otherwise money things I don't think would ever forgive me and I wouldn't blame them Because we're supposed to look at this so let's take a look All right, and then hw we definitely can take a look at that Okay, so for this lawsuit This is the wrong one that's kind of annoying Let me grab the actual lawsuit We'll do BCG lawsuit first BCG GME lawsuit And what are we looking for in particular for this one for the BCG lawsuit let me get rid of that one In March BCG filed a lawsuit against GameStop for 30 million and unpaid fees GameStop said it refused to pay the fees because doing so was not the best interest. Oh shit Wow The case is still awaiting trial Wait, when did this this is old? Yo, this is annoying Give me the updated What is this this is memorandum of opinion we can take a look at this What's the view says the update is they dropped the case yeah, that's what I thought that's why it's wondering I was like why is this so old? Let's take a look through here And see what they say in the case filed by plaintiff BCG defendant GameStop presently pending before the court motion to",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 85,
      "start_timestamp": "01:46:53",
      "start_timestamp_seconds": 6413.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6413"
    }
  },
  {
    "text": "update is they dropped the case yeah, that's what I thought that's why it's wondering I was like why is this so old? Let's take a look through here And see what they say in the case filed by plaintiff BCG defendant GameStop presently pending before the court motion to partially dismiss The operative second amended complaint with prejudice filed pursuant to this For the reason set forth below the motion is granted in part and denied in part Okay, so let me zoom this in Show me show me's wait no, give me fucking wider window why are you doing this to oh Jesus No Can you guys see this okay if not I can download it really quick But I can't zoom it in any more than that Okay, cool. Thank you roaring titty All right, so it says the court rates briefly here for the parties who are well familiar Uh, it does so part of March Shhh Oh Which address the defendant's previously filed motion to the to dismiss the first amended the first amended complaint the fact And it does so by making use of the familiar standard for assessing rule Which is they're using they're sharing the reference case here And by considering the same stuff There's only one count in the SAC for breach of contract made pursuant to Delaware law The court will briefly explain why it agrees that count one can go forward pass the pleading stage in many respects All",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 85,
      "start_timestamp": "01:48:38",
      "start_timestamp_seconds": 6518.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6518"
    }
  },
  {
    "text": "they're sharing the reference case here And by considering the same stuff There's only one count in the SAC for breach of contract made pursuant to Delaware law The court will briefly explain why it agrees that count one can go forward pass the pleading stage in many respects All right In March 29 mo the court explained that the plaintiff had sufficiently set out a claim in the fact For failure to pay a certain variable fee rate for the s of w Um Now in the set there's a number of allegations that the court interprets is being related to these type to agreement breach allegations Defendant breached its duty to negotiate in good faith regarding those matters among others court reads plaintiffs allegations Um The many other initiatives discussed at the 2021 thermometer meetings is being this kind of type two agreement claim It reads the allegations in paragraph there As also being generally directed to this type two claim the court does not understand defendant to be Challenging the SACs type two Reach allegations and so those allegations survive here The court reads plaintiffs allegations in paragraph 41 and 45 is being about a different type of breach of contract claim A claim that defendant breached the s of w by failing to pay certain variable fee okay The initiatives referred to these paragraphs yep, okay Defendant moves to dismiss plaintiffs breach of contract claim relating to those agreed initiatives It does so on the ground",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 85,
      "start_timestamp": "01:50:16",
      "start_timestamp_seconds": 6616.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6616"
    }
  },
  {
    "text": "of breach of contract claim A claim that defendant breached the s of w by failing to pay certain variable fee okay The initiatives referred to these paragraphs yep, okay Defendant moves to dismiss plaintiffs breach of contract claim relating to those agreed initiatives It does so on the ground that the SAC does not sufficiently allege that all the parties are actually reached a written agreement Okay Uh Pyros is what's the date on this one this one is from 13 feb So this is before the dismissal what I'm doing right now is I'm just kind of understanding the background behind this because I'm trying to understand more of the the conversation and like what the what the basis was for the argument from the beginning However defendant does have a winning argument on another ground as the breach allegations regarding three initiatives That is because plaintive affirmatively pleads That as to these initiatives defendant only agreed in writing as to portions of profit improvement projections relating to EPPI S-w-requires that the parties reach written agreement on the amounts of credits to be made to each for each initiative So it sounds like a con uh Reach of contract which is really fascinating With the foregoing reason the court concludes that the defendant's motion should be granted in part denied in part more specifically It's granted with prejudice to the plaintiffs claims breach of contract It is denied in all other respects Interesting The cvos says they weren't",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 85,
      "start_timestamp": "01:51:42",
      "start_timestamp_seconds": 6702.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6702"
    }
  },
  {
    "text": "contract which is really fascinating With the foregoing reason the court concludes that the defendant's motion should be granted in part denied in part more specifically It's granted with prejudice to the plaintiffs claims breach of contract It is denied in all other respects Interesting The cvos says they weren't paying for bad consult that's fascinating to me because I mean I worked at Deloitte for a while and I've worked around bcg and that they're they're a good consultancy So I'm actually kind of really curious why Like what the deal actually is because my guess is again, I don't think that They didn't I would find it really hard to believe that they didn't do shit My guess is they might have dubbed done stuff that they didn't like And that I get like that's okay But that's a different context at least in my opinion I don't know well enough But That's part of at least what what what I think all right, so let's take a look at this um Pursuant to and this one is from the 30th Under side parties here. I stipulate dismissal of this action with prejudice. Yes. So with prejudice here matters Yeah So this looks like they are Done and done Cool So money tings this looks This looks great. This looks like it was dismissed with prejudice. So it looks like the the whole thing from bcg will be Kind of flattened out which is good. It's good that",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 85,
      "start_timestamp": "01:53:12",
      "start_timestamp_seconds": 6792.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6792"
    }
  },
  {
    "text": "matters Yeah So this looks like they are Done and done Cool So money tings this looks This looks great. This looks like it was dismissed with prejudice. So it looks like the the whole thing from bcg will be Kind of flattened out which is good. It's good that that's not looming over their heads anymore Which is kind of a bummer To have to operate within at least I think And then we got a couple minutes left I know that there was another case you wanted me to look at but I think somebody also wanted me to look at some That's options in shui so I'm not as worried about that to be honest We can take a look Money things big now our seat tells what he wants to do with the money uh I guess the part I'm curious about is like what do you mean now he can tell us what he's gonna do with the money I don't understand I don't understand the way that you're attaching this case to the plans for the money I don't totally follow that because the the value of this case is still it's only 30 million dollars And they have way more cash than that. So even if this case came through and they were made to pay They still would pay Uh a fraction of their cash. So it's not like they were hiding their money. They know that the money's there so i",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 85,
      "start_timestamp": "01:54:29",
      "start_timestamp_seconds": 6869.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6869"
    }
  },
  {
    "text": "million dollars And they have way more cash than that. So even if this case came through and they were made to pay They still would pay Uh a fraction of their cash. So it's not like they were hiding their money. They know that the money's there so i Maybe there's more to it than I know I typically assume that with a lot of things But based on that I don't actually see The attachment here Money team says I guess I'm just saying why make moves when you got lost oh well, it's because companies almost always have lawsuits ongoing That's like standard fair man. Yeah. Okay. I understand what you're saying now I I personally would decouple those I don't think that the lawsuit really has anything to do whatsoever with what they're choosing to do with that capital or not choosing to do with that capital You have to understand like large companies a lot of these companies literally have built in lawyers that work for them directly that's called in house counsel and it's because there's so much litigation always So if a company essentially waited to do things until there was never any legal problems whatsoever They they would make zero headway nothing would ever happen So I get your point and it definitely is good right it's just one less piece of bullshit to deal with but I don't actually think at least this one um Matters too much in terms of",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 85,
      "start_timestamp": "01:55:57",
      "start_timestamp_seconds": 6957.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=6957"
    }
  },
  {
    "text": "legal problems whatsoever They they would make zero headway nothing would ever happen So I get your point and it definitely is good right it's just one less piece of bullshit to deal with but I don't actually think at least this one um Matters too much in terms of what they were going to do with that money Uh money team says I think bby 16 b case tomorrow is way bigger. Let's see gme bbby 16 b lawsuit Uh, this one is from routers Let's see Uh, Matthew says I think bcg at a cost for commission on gme profit so that was a big deal I don't actually again like I see what you're saying The way that that would work is they would have to then value whatever it is I think the point being is Whatever the fees that they charged and whatever commissions that they were trying to go after it still would be a general Uh, like drop in the bucket. It wouldn't be to the same degree As I think like a massive problem for the cash pile that they had just built and the other thing is it very rarely is done V is some sort of large cash payment. There's normally a payment plan So there's just a lot of Ancillary details around that That again, it's good that it's gone. I'm not arguing that it's not good that it's gone. I'm happy that it's gone But I just don't",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 85,
      "start_timestamp": "01:57:08",
      "start_timestamp_seconds": 7028.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=7028"
    }
  },
  {
    "text": "done V is some sort of large cash payment. There's normally a payment plan So there's just a lot of Ancillary details around that That again, it's good that it's gone. I'm not arguing that it's not good that it's gone. I'm happy that it's gone But I just don't necessarily think that it's a absolutely massive impact on things All right, let's see So we won the dismissal on Tuesday Accusing a hymn of profitably cashing out of bedbath and beyond shares too quickly As it was hurting towards bankruptcy Said that two former shareholders could not force Cohen to return profits selling his estimated 11 stake Because the bankruptcy mooted their claims Shareholders sued Cohen under federal law requiring corporate insiders to including large shareholders to give up their short swing profits From buying and selling companies stocking a six-month period Um The client and media comment reviewing the decision Cohen declined So this talks about what he did he abruptly sold his stake Which had grown because of buybacks five months later he sold for 60 million profit Um So This doesn't tell me why one though Which I'm kind of curious about like what what the decision was EBBB Y Ryan Owen lawsuit Oh, it's a hearing tomorrow. I see okay Got it June 26 So this one whoa This one's kind of interesting Um was concerned that some of her fellow director shared insider information before he dumped his stake That's interesting. That's a really",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 85,
      "start_timestamp": "01:58:26",
      "start_timestamp_seconds": 7106.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=7106"
    }
  },
  {
    "text": "decision was EBBB Y Ryan Owen lawsuit Oh, it's a hearing tomorrow. I see okay Got it June 26 So this one whoa This one's kind of interesting Um was concerned that some of her fellow director shared insider information before he dumped his stake That's interesting. That's a really interesting angle to take to Um the agency hasn't levied claims of wrongdoing A group suit them for fraud Yeah The board member worried about information leaks didn't trust Cohen Downed the credibility that Cohen backed to join the board Interesting yeah really interesting I do think that that one probably would be a slightly bigger deal just from Cohen's perspective because I mean there's no way that that doesn't impact his movement somehow so Justin says concerned about potential wrongdoing well the problem is is again It's that's not going to be the argument The the people who bring these arguments are pretty smart so they would have at least something pretty logical built Like this here right the suit accuses Cohen of insider trading and misleading investors about his trading plans It doesn't allege specific piece of non public information But says is allies in the board push to give him more information about strategy and critical financing options according to the internal emails So like this will be the the suit right it's it's not going to be concerned about potential wrongdoing They're actually going to come they're going to try to come with some heat Otherwise",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 85,
      "start_timestamp": "02:00:13",
      "start_timestamp_seconds": 7213.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=7213"
    }
  },
  {
    "text": "to give him more information about strategy and critical financing options according to the internal emails So like this will be the the suit right it's it's not going to be concerned about potential wrongdoing They're actually going to come they're going to try to come with some heat Otherwise it wouldn't even get to this point Before something goes to trial a judge has to look at it and see if it's even you know worth worthwhile for them to take it So my guess is this this is happened So let's take a look All right gang that wraps me up for tonight another super fun session I love doing these with you guys and dive in deep into this absolutely enjoyable Tomorrow is options trading for beginners. We have a couple really fun things lined up before I punch out for a little bit of time off and then like I said I will be back in action with live stream starting the 11th of august you can catch me there Being outlier being ape",
    "metadata": {
      "video_id": "hRUfZInB234",
      "title": "GME Background Deep Dive | GameStop Analysis Live Ep5",
      "url": "https://www.youtube.com/watch?v=hRUfZInB234",
      "upload_date": null,
      "duration": 7408.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 85,
      "start_timestamp": "02:02:25",
      "start_timestamp_seconds": 7345.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hRUfZInB234&t=7345"
    }
  }
]