[
  {
    "text": "U.S. guy answers, shout out to Ben for this question. He says, why won't my order execute in regards to the whole trying to close the entire trade at once instead of closing one side at a time? It's a great question. And if it's everything to do with liquidity. So here's what happens. If you have multiple legs to your strategy, that's on. Like one, like two, maybe like three and four. What ends up happening? Is if I want to close this trade quickly, I can try to submit in order for all of these. Now, what that requires is a counter party that is looking for all of these at whatever price we pick, maybe 50 cents. So this takes longer. Think of anything that you try to sell. The more complicated it is, typically the more difficult it is to transact. Now, comparatively, if we exit one leg at a time, instead of trying to find somebody that wants all of these things, you're finding somebody that wants just this one thing. And then maybe finding somebody entirely different that wants just this one thing. And then so on and so forth. Now when we talk about the context of one, most of the time for the other side of this trade is going to be a market maker. But these individual trades go into a larger book of things. So this becomes a balance for them where they might want more of these and less",
    "metadata": {
      "video_id": "hT73QtkggMc",
      "title": "complex order fills",
      "url": "https://www.youtube.com/watch?v=hT73QtkggMc",
      "upload_date": "2025-06-26T16:45:07Z",
      "duration": "PT2M34S",
      "channel_name": "",
      "description": "💡Trade alongside Erik and level up your strategy inside the Outlier Pro Community—get exclusive weekly livestreams, private chat access, market & trade analysis, and more. https://www.patreon.com/OutlierTrading\n\n▬ RESOURCES\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Join the FREE Outlier Community. https://www.patreon.com/outliertrading/chats\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n\n▬ DISCOUNTS\n► 50% off Options Omega Backtesting. https://optionomega.com/register/esinvests\n►50% off the ORATS Platform and Tool Suite! \nhttps://orats.com/esinvests\n► Barchart Premium - Try for Free. https://www.barchart.com/get-barchart-premier?fpr=xaiek\n► 5% off Unusual Whales Options Flow Platform. http://unusualwhales.com/referral#esinvests\n\n▬ VIDEO NOTES\n#optionstrading\n\n\n\n\n\n▬ DISCLAIMER\nThe content presented is for informational purposes only and any opinions, news, research, analyses, or other information contained are provided as general market commentary and do not constitute investment advice. Outlier Trading, its affiliates, and employees are not responsible for any investment decisions made based on the information presented. Outlier Trading does not guarantee the accuracy, completeness, or reliability of any information presented and is not liable for any losses or damages arising from the use of or reliance on this information. By accessing this content, you acknowledge and agree to these disclosures and terms of use.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 2,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hT73QtkggMc&t=0"
    }
  },
  {
    "text": "about the context of one, most of the time for the other side of this trade is going to be a market maker. But these individual trades go into a larger book of things. So this becomes a balance for them where they might want more of these and less of these. The last thing is every single one of these has a bit as spread. Now if you've ever played a bit as spread, you know, sometimes you might fill in an order and it can take a while for it to execute. Well, you're literally doing that effectively for all of these. So you might have the case where this individual leg is bid at a nickel and offered at 20 cents. It could be super liquid. So then as you're playing the mid price with your complex order in the center, this could be completely way off skewing whatever the mid price is compared to what the actual value of the spread might be. So this is exactly why it's more complicated and you have to look for a more niche counterparty. As always, if you have any questions, let me know. Ben, I'll answer you later.",
    "metadata": {
      "video_id": "hT73QtkggMc",
      "title": "complex order fills",
      "url": "https://www.youtube.com/watch?v=hT73QtkggMc",
      "upload_date": "2025-06-26T16:45:07Z",
      "duration": "PT2M34S",
      "channel_name": "",
      "description": "💡Trade alongside Erik and level up your strategy inside the Outlier Pro Community—get exclusive weekly livestreams, private chat access, market & trade analysis, and more. https://www.patreon.com/OutlierTrading\n\n▬ RESOURCES\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Join the FREE Outlier Community. https://www.patreon.com/outliertrading/chats\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n\n▬ DISCOUNTS\n► 50% off Options Omega Backtesting. https://optionomega.com/register/esinvests\n►50% off the ORATS Platform and Tool Suite! \nhttps://orats.com/esinvests\n► Barchart Premium - Try for Free. https://www.barchart.com/get-barchart-premier?fpr=xaiek\n► 5% off Unusual Whales Options Flow Platform. http://unusualwhales.com/referral#esinvests\n\n▬ VIDEO NOTES\n#optionstrading\n\n\n\n\n\n▬ DISCLAIMER\nThe content presented is for informational purposes only and any opinions, news, research, analyses, or other information contained are provided as general market commentary and do not constitute investment advice. Outlier Trading, its affiliates, and employees are not responsible for any investment decisions made based on the information presented. Outlier Trading does not guarantee the accuracy, completeness, or reliability of any information presented and is not liable for any losses or damages arising from the use of or reliance on this information. By accessing this content, you acknowledge and agree to these disclosures and terms of use.",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 2,
      "start_timestamp": "00:01:18",
      "start_timestamp_seconds": 78.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hT73QtkggMc&t=78"
    }
  }
]