[
  {
    "text": "game. So I'm going to walk you through what I'm seeing here because yesterday I was not planning on doing an update video and we saw a very meaningful expansion in call volume today. We actually see the same. I'm also seeing a lot of conjecture about roaring Kitty slash DFV by more calls. I'm going to walk you through exactly what I'm seeing in terms of how viable that might be as a theory. Couple things do come to mind for me. The first one is based on the call volume yesterday. I actually entered a position on earlier today myself. And that's specifically because I am designed as an options trader to look for opportunity, agnostic of how it shows itself and that kind of volume actually is something that I tend to trade. So that's how I originally came across this entire saga when roaring Kitty at the time I didn't know is him was buying a bunch of calls and it popped up on a few of my scanners. So let's take a look at what's going on here. 24th of June yesterday I actually wasn't planning on doing an update. So all that crazy call volume. So I was like, let me take a look with everybody. See what I see. And the call volume is interesting. What was really annoying honestly about yesterday was this. I couldn't dig into the details on what was going on. So I actually used another tool that I",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "volume. So I was like, let me take a look with everybody. See what I see. And the call volume is interesting. What was really annoying honestly about yesterday was this. I couldn't dig into the details on what was going on. So I actually used another tool that I have access to to help me pull the tool down a bunch of market data to look at what this looked like. And I'll show you that in just a moment. But starting from the top as per usual, we see a really interesting movement in volatility. And what I mean by that is not just the fact that the front month has expanded nearly 60 points from 142 volatile to 201. But even more interesting. Obviously there's less time. There's only three days left to expiration. And now this is expecting a 3.6 move. It's actually a little higher than that last I looked as compared to the 2.79. That's not an insignificant difference. But that's also nothing that's going to send us to the moon. It's just interesting. Then I look across the options chain here. And it's bumpy. And that might sound a little esoteric. I'll explain exactly what that means. It's kind of weird. It's almost like if you ever watch the matrix when that one dude the operator. There's all the zeros and ones. And it kind of just looks like a full picture to him. That's kind of what this stuff looks like to",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "exactly what that means. It's kind of weird. It's almost like if you ever watch the matrix when that one dude the operator. There's all the zeros and ones. And it kind of just looks like a full picture to him. That's kind of what this stuff looks like to me. I can see the lines that are going on in here in terms of this smile on the surface. And I'll walk you through exactly what I'm looking at. When I see front. Expiration busy. Just mean some things going on in the front end. That's okay. This can happen. But follow along with me. Let's go on a journey together. 201 82 vol 158. 154 55 156. What do you notice right there right out of the gate? That's interesting to me. What's happened was we have this jacked up of all that comes down comes down a little bit more. But then goes back up. Very interesting. And I also don't think it's any mistake that this is the 19th July expiration. Obviously, op X is typically a thing across products. But you can tell that's also part of what's going on here. And I'm going to be off likely into some of what I'm going to find when I go through the time and sales with you all. Then as we continue down this path 156 now drops back down to 150 140 142. Very interesting. The fact that we have volatility that's kind of ebbing",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "be off likely into some of what I'm going to find when I go through the time and sales with you all. Then as we continue down this path 156 now drops back down to 150 140 142. Very interesting. The fact that we have volatility that's kind of ebbing and flowing like this and not observing more either like a standard smile or even a slight decline or even a slight raise. The fact that there's this bumpiness to it. It tells me that the market is pricing in different things in different periods for you guessed at different reasons. We don't always know what's going on as traders and we cool enough don't have to know. But what we do need to do is be able to see something's going on and as I could see it clear as day, something is going on here. I don't know exactly what to what degree. It's so hard to tell and I keep reiterating this message because I think it's so important to be respectful of everybody. I am not here to spread hype or fud. I am here to look as objectively as humanly possible at the data that I see based on what I've seen before over decades of doing this and share that information. I want you all to come to your own conclusions. I am not here to press anything on to you guys. It's your own account. It's your money. You have to do what's",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "I see based on what I've seen before over decades of doing this and share that information. I want you all to come to your own conclusions. I am not here to press anything on to you guys. It's your own account. It's your money. You have to do what's right for you. Okay. This is weird. I think we've hit that. Going down to the implied volatility curve. Again, these kinks are getting massive compared to what we saw even recently. If we go back here, take a look at some of the kinks we're seeing in the front expiration. And then if we start going back to what we were just looking at now, like these are very large now, which is really interesting, especially notice how smooth it is on the put side. The other thing is the put side is continuing to expand. I already told you guys back on Sunday. I fully expect to see this. And again, this is a tradable event for the options traders out there, specifically those who can isolate volatility. This is a very predictable movement at this point right now on the product where we're seeing the near term out of the money far out of the money. All expand pretty meaningfully. And as of late, the far out of the money call volatility is not moving in line with it. Whereas before it was actually outpacing it pretty significantly. Okay. The implied volatility thing cool, but again, there's",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "out of the money far out of the money. All expand pretty meaningfully. And as of late, the far out of the money call volatility is not moving in line with it. Whereas before it was actually outpacing it pretty significantly. Okay. The implied volatility thing cool, but again, there's nothing in here that's screaming at me as something super crazy is going on. Now, let's take a look at this. Somebody sent me this post from Howard Kitty. That's actually a great name. Howard Kitty. Come on, man, don't put yourself down like that. You're smart. Got plenty of wrinkles on that brain. And let's see what they have to say. It says the 20 mark flooding with calls for the 19th of July. I don't see this. And I want to take a look at it with you guys to maybe see what I might be missing. And what time frame you guys are looking at. Because so far, this isn't what I'm seeing. And let's see, keep an eye on this today, but just remember premium on this shot up a week later when he posted his yellow update. Speculation called it then calling it now. Watch this 20 call option today and tomorrow. So this was from earlier today, the 20th of the June. So let's take a look at the 20 call option volume from today. And if I pop in here, we scroll down to this right now, I have it filtered by just",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "this 20 call option today and tomorrow. So this was from earlier today, the 20th of the June. So let's take a look at the 20 call option volume from today. And if I pop in here, we scroll down to this right now, I have it filtered by just the 20s. And I have it limited to minimum 500 size buys. We can open this up just a little bit more maybe to add a little more efficacy behind the thesis. And here's what I see. I see. Three tranches of call volumes go through at the 20 in 19 July, one for 16, one for 28 June. I see all very small size. And again, I'm not trying to put down the idea. The idea might be right still. I'm just telling you what I see here today. I don't see this big massive flow into the 20s today in any expiration cycle. I see overall really small transactions. That's what this shows me. And then I do see actually more put transactions is also somewhat interesting. There could be something to be said about people looking to transact puts. And it's like kind of split right like if we look at the overall volume today, it's kind of split down the middle between people that are selling and buying puts. Whereas on the call side, that's not the case on the call side. They're buying calls 35 which is a six point lead over selling calls. So",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "if we look at the overall volume today, it's kind of split down the middle between people that are selling and buying puts. Whereas on the call side, that's not the case on the call side. They're buying calls 35 which is a six point lead over selling calls. So that's not insignificant, but it's not materializing necessarily centralized in this 20. So then if I get rid of this strike limitation and I open it up, we see that there's 60 calls that have had a pretty big volume. I'm seeing 1474. Then in the 22s, I'm seeing just shy of a thousand. Then I'm seeing that this is put side don't care, don't care. Like even this it's just not a ton of big positions. So then this does beg the question. Is it possible that we're in kitty is buying calls? Yes. Is it possible that he's buying calls in much smaller sizes than what he did previously? Yes, that is possible. The reason why it's possible is because he doesn't have the same amount of liquid capital that he did before. Right. So if I try to find, let me pull this up real quick. Here we go. This is back from an update I did on the 13th of June. I'm pretty sure this is the position he posted on the 10th of June. So obviously it's actually a little bit old now. We don't know what this looks like, but what I'm highlighting like",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "we go. This is back from an update I did on the 13th of June. I'm pretty sure this is the position he posted on the 10th of June. So obviously it's actually a little bit old now. We don't know what this looks like, but what I'm highlighting like he's still has 6 million in cash. It's not as much as he did before because he put on a massive options position before. This case, it's much more conservative. So is it possible that some of the buying activity that we're seeing is wearing kitty? Sure. It is possible. What I can tell you though is based on what I've seen him do previously. This doesn't line up, but it could not line up for those reasons. It could be that he's entering with a much smaller stake. But still, if we kind of go with this theme of looking at the 20s, I really want to focus on a specific point because if we look at the value of these transactions, it's just not that much that we've seen today. So we have 4 at 200, something like that. So it's 80 grand. Like we're not even in the ballpark of his sizes because the thing is is even for. He's still has 6 million at least the last we saw. So punchline could this be him? Yes. Does it seem to be likely it's him based on previous buy activity that I've seen and also based on",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "the ballpark of his sizes because the thing is is even for. He's still has 6 million at least the last we saw. So punchline could this be him? Yes. Does it seem to be likely it's him based on previous buy activity that I've seen and also based on sizing, even if he's not you looking to use all six. But if he's looking to use two, right, putting on an 80 grand position at a clip with just one doesn't really make sense. And I actually started going through the previous periods before he launched his position updates. And I looked at the time frames in between them so I could see and identify what kind of activity he uses. What time frame does he use in between his transactions as he's phasing in and phasing out of these positions because that's the cool part about the fact that we have the screenshots and their time bound. I literally can look at historic data and see what happened. And this just doesn't line up with that. So again, not saying it's not him just so far. I don't see it. Now the other thing is going back to yesterday. This is data that I pulled from the 24th of June. These are kind of just the larger transactions. And again, it's to test this kind of idea about the 20s. And here's what I see at the 20s. The first thing is you'll notice there's not a ton",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "yesterday. This is data that I pulled from the 24th of June. These are kind of just the larger transactions. And again, it's to test this kind of idea about the 20s. And here's what I see at the 20s. The first thing is you'll notice there's not a ton of transactions. The next thing is we have to get rid of a bunch of these right. We're not looking for calendars and all that stuff. We're looking for long calls. So if we break it down to long calls, there's three tranches that are pretty far apart, which is much further apart than what he was transacting at when he was phasing in and out of his previous options positions. And again, these are all very small positions, very, very small position. Don't feel insecure. It's okay. Small positions still a position, but I don't really think that this is roaring kitty again. And not be more clear. It could be, but based on the total breadth of evidence that I see in front of me, it's just not what I see right now. So when I go back to the options chain. And I try to understand what's going on with this volume. So if we come down here, we throw this volume on. Let's take a look at all of it. We still see 200 and almost 200 70,000 calls transacted today against 88,000 puts massive massive call volume. And then if I look at where it's",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "going on with this volume. So if we come down here, we throw this volume on. Let's take a look at all of it. We still see 200 and almost 200 70,000 calls transacted today against 88,000 puts massive massive call volume. And then if I look at where it's happening, take a look at all these large boxes where it's highlighting. It's the 28th of June. It's this front expiration. The probability of roaring kitty putting on a massive options position today, yesterday, that set to expire this week. It's so low because IV is so expensive. He's bidding himself up. He has to do something with the position before the end of the week. So it doesn't really have any time to work. I don't see him coming here. If he's buying, if he's looking to build a position, I would expect it to be further out. But again, who really knows he's done a lot of things so far that when I try to assess it objectively, I can't always connect the dots. And I do think part of that is why he does what he does is purposely for that reason. But if we look at this overall volume today, I mean, like take a look at this. This is at the 25s 24,600 volume volume. I don't want to say, like that in this case. And then if we take a look here, it's at the 24s 19. So if we come in here and",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "this overall volume today, I mean, like take a look at this. This is at the 25s 24,600 volume volume. I don't want to say, like that in this case. And then if we take a look here, it's at the 24s 19. So if we come in here and we take a look at these chains, a ton of this is at the money transactions. This is actually really cool because again, this does start to build a little bit of a gamma RAM. These are out of the money. The market makers are not going to fully had these positions yet. So it's still very probable that they land out of the money. So they're not going to have a bunch of shares to cover these more often than not. And we can tell again, definitively from the volume, even if we wipe out all of the OI with the volume that transacted today, at least 10,000 were opened. So this does look like a lot of buying volume. And the other thing that I find interesting is that it's at the money. That's not the cheapest place because this stuff I see out here. This is more yolo activity in my opinion. Like if we open this up to all, let me go super far out. And we see 8,000 here with 51,000 depth at the 128s. That doesn't that doesn't tell me this is going to 128 at all. This is a really low, low, low",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "yolo activity in my opinion. Like if we open this up to all, let me go super far out. And we see 8,000 here with 51,000 depth at the 128s. That doesn't that doesn't tell me this is going to 128 at all. This is a really low, low, low probability move. This is literally in my opinion, people trying to gain really cheap exposure, not understanding how options work. This also could be a bunch of other activities going on. I'm looking at it specifically from the retail trading perspective, imposterating what I see and that's what it is. So where do we go from here straight up. I am going to be watching like an absolute hawk now this option is chain not even the front expiration again like it's interesting to me with the wall, but I am so curious about this volume that we're seeing because if we click this in and see where most of that 277 is 165 800 is in the front expiration. Then if we go out the next two explorations it's 47 total, then if we go to 19 July 38 against eight so really big call skew in terms of volume here as well. But it's not as much. All of the activity right now is up here in the in the 28 June or massive, massive call volume on a relative basis. So I'm going to keep watching. I'm going to see if any interesting buying activity comes in.",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  },
  {
    "text": "volume here as well. But it's not as much. All of the activity right now is up here in the in the 28 June or massive, massive call volume on a relative basis. So I'm going to keep watching. I'm going to see if any interesting buying activity comes in. I'm going to keep looking at the volatility. See if anything is keying off there and we'll see where we go from here. I always appreciate people sending me stuff like this. I'm always happy to take a look at it. And I hope Howard kiddie is right. That would be really cool to see and not know yet. Any questions. Let me know be an outlier. So you guys are.",
    "metadata": {
      "video_id": "hXt_C7GUmlQ",
      "title": "Roaring Kitty Buying GME Calls?",
      "url": "https://www.youtube.com/watch?v=hXt_C7GUmlQ",
      "upload_date": "",
      "duration": 967.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=hXt_C7GUmlQ&t=0"
    }
  }
]