[
  {
    "text": "What's up, outliers? I did the exact thing I said typically. Don't do this. And it's from a video called buying call option smarter. I'll throw a link to it below. But this trade that I put on in DJT that made me over 45,000 broke a lot of the rules that I typically follow. But I want to walk you through why trading is a game of very carefully building positions that do what we want. And in this case, it definitely included building something that is very different than my go to approach. So we're going to walk through exactly what the trade was, how it was structured, how I managed it, and how it made me just shy 50k. What's up, everyone? Welcome back to the outliers. Shout out to the Patreon family. If you're into trading that kind of thing, consider joining up to great group. And let's get right into it. So the trade here is pretty straightforward and it's centered around DJT. Why DJT? Well, because this has really become a proxy for the election. And if we go back, this is a three year daily chart, you can see that DJT has been all over the place. It's been over 100. It's been down to 1175. And it's rallied back up the jishai of 55 or right around 55. This most recent move that we've had here is literally over 360 a massive move. So what ended up happening here was obviously I'm",
    "metadata": {
      "video_id": "i_TOxBb1d58",
      "title": "Breaking Down My DJT Long Call Trade – Key Takeaways on Gamma",
      "url": "https://www.youtube.com/watch?v=i_TOxBb1d58",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=i_TOxBb1d58&t=0"
    }
  },
  {
    "text": "all over the place. It's been over 100. It's been down to 1175. And it's rallied back up the jishai of 55 or right around 55. This most recent move that we've had here is literally over 360 a massive move. So what ended up happening here was obviously I'm following the overall election probabilities and stuff like that. And a really curious thing happened. So if we go to polymarket here, and you take a look at this red line, which is the probability of Trump winning. And if you take a close look, this movement looks a heck of a lot like what you see here in that funny. Notice how you have this big pop up here right around this area. Then it goes down into this trial and then it starts working his way back up and out. This is an important note. But specifically, I want to draw your attention to this period in here, where we can see around the fifth, the sixth of October, somewhere right around in there. We can clearly see that the probability for Trump overtaking Harris starts to move up. And if we align that with the first trading day after the fifth, which would be the seventh, notice how we have this pop. And then it's been up and away, very similar to what you see here. Interesting. Isn't that. So this has clearly become a proxy for the outcome for the US presidential election. And it's a",
    "metadata": {
      "video_id": "i_TOxBb1d58",
      "title": "Breaking Down My DJT Long Call Trade – Key Takeaways on Gamma",
      "url": "https://www.youtube.com/watch?v=i_TOxBb1d58",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=i_TOxBb1d58&t=0"
    }
  },
  {
    "text": "day after the fifth, which would be the seventh, notice how we have this pop. And then it's been up and away, very similar to what you see here. Interesting. Isn't that. So this has clearly become a proxy for the outcome for the US presidential election. And it's a really important note because it means that the fundamentals of this as a security have not changed. As an overall brand business, they're not doing anything different. There's no fundamental new release that they've had to drive new value. All of this is become a proxy. That means the way that I build a trade in this is going to be very, very different than something like in video, where I think it's going to continue going up longer term, even though it's not right now, because of the potential. It can have to change an industry. There's a different value prospect there than something like this. So let's take a look at the details. Now the first thing to note here is that the allocation is actually undefined. I do this for smaller positions. I don't really care how much money is tied up in the trade because I'm fortunate. I have plenty of room to move around. I'm not running out of capital at any point in time. This is different than when I was trading a smaller account, I'd be very careful and actually allocate each trade. I don't really do that for a lot of these",
    "metadata": {
      "video_id": "i_TOxBb1d58",
      "title": "Breaking Down My DJT Long Call Trade – Key Takeaways on Gamma",
      "url": "https://www.youtube.com/watch?v=i_TOxBb1d58",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=i_TOxBb1d58&t=0"
    }
  },
  {
    "text": "fortunate. I have plenty of room to move around. I'm not running out of capital at any point in time. This is different than when I was trading a smaller account, I'd be very careful and actually allocate each trade. I don't really do that for a lot of these kinds of trades anymore. Now what I do use to manage overall sizing and risk is I use a max risk limit. And in this case, I used 15,000. This is a very, very small fraction of the account. This is for a very specific reason, which we'll talk about in a minute. Why this is such a small amount relative to the total portfolio, less than a percent. And if we take a look at the overall fit, this is clearly going to live within the speculative allocation. This is a highly, highly speculative place can be very short term. Why is it going to be so short term because of the overall idea behind this trade? Because if we take a look at this again, no fundamental change, my expectation is that after the election, whether good or bad in terms of the outcome for Trump and the way that this stock would prospectively move, I think whether he wins or doesn't, this is likely going to contract to a degree because it can only go so high based on essentially nothing. So that's why this is a very short term play that's going to be wrapped around",
    "metadata": {
      "video_id": "i_TOxBb1d58",
      "title": "Breaking Down My DJT Long Call Trade – Key Takeaways on Gamma",
      "url": "https://www.youtube.com/watch?v=i_TOxBb1d58",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=i_TOxBb1d58&t=0"
    }
  },
  {
    "text": "way that this stock would prospectively move, I think whether he wins or doesn't, this is likely going to contract to a degree because it can only go so high based on essentially nothing. So that's why this is a very short term play that's going to be wrapped around the election. It's actually was structured very similarly to the way that I do earnings, where I want to include the closest expiration that includes the earnings event itself. So what's the strategy here? This is where things deviate from my normal. Most people are used to hear me say something like ratio called diagonal or deep in the money long calls. This is different. This is a unit play. And this is one that I don't use that much as you can tell because I typically talk about not doing this. But there are always exceptions to things and this is definitely an exception based on the expected movement that I thought might happen. The way I looked at this trade is that it was either going to move enough in my direction that it was going to compound quickly because of long gamma. Or I was going to lose this 15k. That's kind of it. It was almost a binary outcome in my mind. So I'm essentially building a play that's really built around long gamma. That's really what units means in this instance. And so what is that in context? Let me show you. If we pop",
    "metadata": {
      "video_id": "i_TOxBb1d58",
      "title": "Breaking Down My DJT Long Call Trade – Key Takeaways on Gamma",
      "url": "https://www.youtube.com/watch?v=i_TOxBb1d58",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=i_TOxBb1d58&t=0"
    }
  },
  {
    "text": "lose this 15k. That's kind of it. It was almost a binary outcome in my mind. So I'm essentially building a play that's really built around long gamma. That's really what units means in this instance. And so what is that in context? Let me show you. If we pop over the platform and we look at DJT today, which is the 31st of October, you can see that there's 15 days to expiration for the 15 note. Why the 15 note versus the 8 note? Because these are going to be more liquid. That's why. So even though this is better exposure to the event itself, it's going to take a couple days for the results to come out. But then more importantly, I need liquidity. So that's why I'm here. Now, if we take a look at this notion of building units, if let's say I were to buy an app the money call in this case, you can get one for like 10 bucks. Just call it that for simplicity 10 bucks. And if we go all the way out of the money to these 115s, you can see let's call it 90 cents that they're trading for. You can essentially put on 11 of these for every one of these. So typically, I prefer to pay a little bit more up front and to buy stuff that's at the money slightly in the money because I'm not necessarily expecting a parabolic move. Most of this stuff",
    "metadata": {
      "video_id": "i_TOxBb1d58",
      "title": "Breaking Down My DJT Long Call Trade – Key Takeaways on Gamma",
      "url": "https://www.youtube.com/watch?v=i_TOxBb1d58",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=i_TOxBb1d58&t=0"
    }
  },
  {
    "text": "for. You can essentially put on 11 of these for every one of these. So typically, I prefer to pay a little bit more up front and to buy stuff that's at the money slightly in the money because I'm not necessarily expecting a parabolic move. Most of this stuff I tend to trade has decent moves, but not stuff quite like this. Now, there's another reason for this specific build out. Because let's take a look at the max risk. You'll notice for the size of the position that I'm going to show you, I can't actually hold this indefinitely. So having a lower gamma actually, I'm sorry, having a lower delta helps me a little bit. Because the gamma will rapidly build the delta's if it moves in my favor, but because it's already a pretty low delta, if I don't get a directional move in my favor, it gives me a little more time to be in the trade. So the same reasons why I typically favor the opposite. It fits this thesis a little bit better. So on the 24th slash 25th, it was kind of phased in over two different days. I'll zoom in to this specific time frame here and drop for you. So here's the 24th and here's the 25th. And it's essentially at the same prices, it was just over two days. I got the vast majority of the position on the 24th. And then I got a little bit more, just",
    "metadata": {
      "video_id": "i_TOxBb1d58",
      "title": "Breaking Down My DJT Long Call Trade – Key Takeaways on Gamma",
      "url": "https://www.youtube.com/watch?v=i_TOxBb1d58",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=i_TOxBb1d58&t=0"
    }
  },
  {
    "text": "this specific time frame here and drop for you. So here's the 24th and here's the 25th. And it's essentially at the same prices, it was just over two days. I got the vast majority of the position on the 24th. And then I got a little bit more, just a little bit more on the 25th. So if I look at the core position that was built, this is what went on. And then in my normal annotation, you can see it below. So DJT was trading around 35 bucks. I grabbed 500 of the 15 note, 115 calls at 78 cents. So this was a moderate size position in terms of what the options chain could hold, but still not a very large trade altogether. The delta at the time of entry was 0.09 gamma was 0.01. So the outlay for this was about 39,000 bucks. And then again, for my 15k cap on risk, that would let me go to about 30 and a half. So if we flip back over to the chart and kind of see those two entries, and then we had a big gap up one sided rally. And then we had this topping day, and then we had a bit of a contraction the last two days. Now, before I show you the next part, I want you to comment in the video, where you think I started phasing out. I'm very curious the way that you guys think that I went",
    "metadata": {
      "video_id": "i_TOxBb1d58",
      "title": "Breaking Down My DJT Long Call Trade – Key Takeaways on Gamma",
      "url": "https://www.youtube.com/watch?v=i_TOxBb1d58",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=i_TOxBb1d58&t=0"
    }
  },
  {
    "text": "topping day, and then we had a bit of a contraction the last two days. Now, before I show you the next part, I want you to comment in the video, where you think I started phasing out. I'm very curious the way that you guys think that I went about it. My guess is most of you will have some of it right, but some of it wrong. And I'll explain why. So on the 28th of October, DJT was around 46 bucks. And I sold to close 400 of these for 1.85. So that brought in 74k total and netting it against the outlay for 400. The net PL for this specific position was 42,800 bucks. And that left me with 7,800 in residual risk in the position that was remaining. So 100 lots still at 0.78. So what's going on here? Why did I do this on the 28th? Well, it's really simple. If we take a look at this big giant rally, there was a fantastic exit point for me. Because again, if you go back to the original prospect of this position, it was either make some money or lose 15k. That was kind of what I was expecting to happen. And in this scenario, I got a bigger move than I originally anticipated. And for this kind of profit mechanism, which is a really short term, just insane momentum breakout style play, you can't you can't overstay your welcome. It is as you can",
    "metadata": {
      "video_id": "i_TOxBb1d58",
      "title": "Breaking Down My DJT Long Call Trade – Key Takeaways on Gamma",
      "url": "https://www.youtube.com/watch?v=i_TOxBb1d58",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=i_TOxBb1d58&t=0"
    }
  },
  {
    "text": "what I was expecting to happen. And in this scenario, I got a bigger move than I originally anticipated. And for this kind of profit mechanism, which is a really short term, just insane momentum breakout style play, you can't you can't overstay your welcome. It is as you can tell, like literally as you can tell, it is too easy to overstay your welcome. So my idea here was take some of it off in case this didn't happen or this didn't happen. If it went straight from this to this, because there's also a reality about this day, because I actually would have preferred to hold it a little bit longer. But in fact, life happens. And this is a great example of this because on the 29th, I was actually getting an assessment for a herniated disk in my back. It was like a six hour session throughout the entire trading day, essentially. I was not going to have time to watch the markets on the next day. So I managed some of the risk on this day, knowing that this position needs attention. And I wouldn't be able to give it fully what I needed on this day. That's the reality here. And I purposely mentioned that because trading is a mix of adherence to systems, but then also interacting it with life. And that was going to be the reality for my 29 of October. So that leaves me with just over 40k in profit.",
    "metadata": {
      "video_id": "i_TOxBb1d58",
      "title": "Breaking Down My DJT Long Call Trade – Key Takeaways on Gamma",
      "url": "https://www.youtube.com/watch?v=i_TOxBb1d58",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=i_TOxBb1d58&t=0"
    }
  },
  {
    "text": "this day. That's the reality here. And I purposely mentioned that because trading is a mix of adherence to systems, but then also interacting it with life. And that was going to be the reality for my 29 of October. So that leaves me with just over 40k in profit. I have 7800 left to go in risk. And that leads me to the 30th. So at this point, I decide to let the trade go for a little bit, see what it does. And it starts to consolidate, take back down. So I sold to close 98 of the remaining 100 for a dollar 25. So that brings in a net of 46.06. That takes the total profit here to 47,406 bucks. And you'll notice that this is 98. Why 98? Because I am a degenerate. I left 2 on because I literally couldn't care less to what happens. It's like one 200 bucks total. And I just I literally just want to see the fireworks. I just want to see what happens. So I'm leaving 2 on literally for the lulls. The rest of the trade has been done already. By making this first original phase out, I remove all of this risk immediately from the trade. And I still left a little bit on. In case I get a decent move, there's still 100 lots that could continue to compound. Because again, this was a gamma play. And the gamma was just starting to accelerate. So that's",
    "metadata": {
      "video_id": "i_TOxBb1d58",
      "title": "Breaking Down My DJT Long Call Trade – Key Takeaways on Gamma",
      "url": "https://www.youtube.com/watch?v=i_TOxBb1d58",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=i_TOxBb1d58&t=0"
    }
  },
  {
    "text": "remove all of this risk immediately from the trade. And I still left a little bit on. In case I get a decent move, there's still 100 lots that could continue to compound. Because again, this was a gamma play. And the gamma was just starting to accelerate. So that's why I took the first leg down. Essentially, it removes all risk of the trade. Let's it live a little bit longer in case there's a cool move. There wasn't a cool move. So take down the residual to maximize value. And then leave 2 options on simply because YTF not. So as always, if you have any questions, let me know. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "i_TOxBb1d58",
      "title": "Breaking Down My DJT Long Call Trade – Key Takeaways on Gamma",
      "url": "https://www.youtube.com/watch?v=i_TOxBb1d58",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=i_TOxBb1d58&t=0"
    }
  }
]