[
  {
    "video_id": "icjdKy-5euY",
    "title": "The Real Reason Tom Sosnoff Left TastyLive",
    "text": "I think a lot of us when we heard that you're leaving Tasty Live obviously most people are completely shocked and it's because you've obviously built your whole life around markets doing that whole thing. I think sometimes people forget that your serial entrepreneur did the whole think or swim thing, then made a jump, did something else and this is kind of part of your broader MMO, but I think a lot of us got rolled into a fall sense of security and the news drops. So talk to us about that. What led to the switch? And can you explain a little bit about the timing? Why then? Sure, because so I am definitely an entrepreneur. I'm a little bit of a cycle in that sense. For the last 44 years I have worked essentially for myself. I have even what I've killed basically. The only two times I've ever received a paycheck in 44 years where, well, right when I got a college I had a job for about six months, but that doesn't count. When we got bought out by TD Ameritrade and then when we got bought out by IG, only times I've ever received a paycheck. It simply checks though. Yeah, but not something that I'm used to or whatever, it doesn't. It didn't register with me. At TD, I didn't cash a check for two years until they basically said, you've got to cash these checks and they're not going to be good",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 94.88,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=icjdKy-5euY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=icjdKy-5euY&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 445.0
  },
  {
    "video_id": "icjdKy-5euY",
    "title": "The Real Reason Tom Sosnoff Left TastyLive",
    "text": "a paycheck. It simply checks though. Yeah, but not something that I'm used to or whatever, it doesn't. It didn't register with me. At TD, I didn't cash a check for two years until they basically said, you've got to cash these checks and they're not going to be good anymore. And IG, I cash a check, but I had no idea what they paid me. I got it even no. I didn't even know. I didn't even know. I swear to God, I don't know. So I've been pretty much on my own. I still consider it and you know, always being on my own. And after you get bought out, you lose control. And it's kind of a weird thing. When we got bought out the first time by TD, I stayed on for two years because I just, you know, I was, I had, I had agreed to stay on for three years, but I was very close to the CEO Fred Tomzack at the time. And after two years, I went to him and said, you know, Fred, am I ever going to be the CEO of TD Ameritrade? And he looked at me and he said, not, not over my dead body. And so we laughed about it and I said, listen, you know, I got to do something else. And because I, I'm getting older, I got to, you know, I got to build some stuff. And he's like, I'm surprised it took you",
    "start_timestamp_seconds": 78.32,
    "end_timestamp_seconds": 162.88,
    "start_timestamp": "01:18",
    "video_url": "https://www.youtube.com/watch?v=icjdKy-5euY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=icjdKy-5euY&t=78",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 445.0
  },
  {
    "video_id": "icjdKy-5euY",
    "title": "The Real Reason Tom Sosnoff Left TastyLive",
    "text": "said, not, not over my dead body. And so we laughed about it and I said, listen, you know, I got to do something else. And because I, I'm getting older, I got to, you know, I got to build some stuff. And he's like, I'm surprised it took you this long. He goes, I'm shocked. You're still here. He goes, you could stay as long as you want, but you know, and they were, they're paying me a lot of money and do whatever. But I just was like, I want to go on and build something. And so he goes, what do you want to build? I go, I want to build this company called Tasty Trader. He goes, oh my God, I hate that name. Worst than think or swim. And I'm like, well, think or swim worked out pretty good for you. And he goes, yeah, did. So I go. And he said, what is it going to be? And I said, well, we're going to build this network. And at the time, there was also a single streaming. So I said, it's a streaming network, you know, and he's like, what is a streaming network? And I'm like, you know, we're going to talk about markets. And we're going to talk about trading. We're going to talk about math and quantitative stuff. And he goes, none of that makes any sense to me. But whatever you do, I want in. And so I go, okay.",
    "start_timestamp_seconds": 144.0,
    "end_timestamp_seconds": 215.92,
    "start_timestamp": "02:24",
    "video_url": "https://www.youtube.com/watch?v=icjdKy-5euY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=icjdKy-5euY&t=144",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 445.0
  },
  {
    "video_id": "icjdKy-5euY",
    "title": "The Real Reason Tom Sosnoff Left TastyLive",
    "text": "And I'm like, you know, we're going to talk about markets. And we're going to talk about trading. We're going to talk about math and quantitative stuff. And he goes, none of that makes any sense to me. But whatever you do, I want in. And so I go, okay. So he goes, how much? I go, well, I'll put up my money and you got to put up some money. He goes, I'll put up 20 million. Okay, which is a lot for an idea. And I go, all right, that's more than fair. And he didn't know anything. He hated the name, he hated the idea. And he's like, but I'm vetting on you. Because whatever you do, I think it's going to work. So I'm like, okay, well, I was going to head, we put up the money. They put up a portion of their money at the time. And then I quickly realized, I didn't want anymore of their money. Because I didn't want, I didn't need their money, I didn't want it. But it was very nice and generous. And we cut a marketing deal with them. And we went ahead and built tasty. And it became crazy, successful of the next, you know, 10 years. And I kind of had this old, remember the BOF steam was the GM of the Boston Red Sox took them to the World Series. And then twice. And then he was the GM of the Cubs and took",
    "start_timestamp_seconds": 197.6,
    "end_timestamp_seconds": 276.24,
    "start_timestamp": "03:17",
    "video_url": "https://www.youtube.com/watch?v=icjdKy-5euY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=icjdKy-5euY&t=197",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 445.0
  },
  {
    "video_id": "icjdKy-5euY",
    "title": "The Real Reason Tom Sosnoff Left TastyLive",
    "text": "it became crazy, successful of the next, you know, 10 years. And I kind of had this old, remember the BOF steam was the GM of the Boston Red Sox took them to the World Series. And then twice. And then he was the GM of the Cubs and took the Cubs to the World Series. So he's a very successful GM. And he always used to say, they said, why do they leave the Red Sox to go as well? After 10 years, it was just time. So after 12 years at Thinkerswim. And then it was 15 years at tasty. We started in 2010 until the middle of or end of 2025. And we sold the company in 2021. And I lasted four years after we sold. Because I love what I do. I loved talking about markets. I loved the whole tasting nation. I loved everything about it. But I no longer had to had to see the table because I didn't want them. I was the largest shareholder of the company in a publicly traded company in the UK. But I was, I was the largest shareholder, but I didn't want to say anymore. I didn't want to say. I didn't, if I wasn't going to, I tried to run the company at one point. I went to the board at IG and I said, I think I should run this company because I'm a better CEO than the people that you have. And I understand",
    "start_timestamp_seconds": 256.4,
    "end_timestamp_seconds": 348.08,
    "start_timestamp": "04:16",
    "video_url": "https://www.youtube.com/watch?v=icjdKy-5euY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=icjdKy-5euY&t=256",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 445.0
  },
  {
    "video_id": "icjdKy-5euY",
    "title": "The Real Reason Tom Sosnoff Left TastyLive",
    "text": "want to say. I didn't, if I wasn't going to, I tried to run the company at one point. I went to the board at IG and I said, I think I should run this company because I'm a better CEO than the people that you have. And I understand this business better than anybody this company. And and you guys have been stuck in the mud for 40 some years. Let me run the company and let me take it global. But they love the same thing that TD Ameritrade said to me, which is go pound sand. Which, you know, I mean, obviously everybody's entitled to that. They go, we want your company, but we don't want you to run it. We don't want you to run this whole thing. I'm like, okay, I just wanted to make sure we understood. And I made it pretty passionate, get case for it. You know, to move to London, I wanted to run the whole thing globally. They said, no, it's fine. Well, then I don't want to run the US anymore. I just want to do my thing. And they're like, okay, that's fine. So four years into the deal, I decided it's time. I can finally sell some stock. I decided it's time for me to move on. I have nothing but great things to say about tasty. It's an amazing company. It's probably the best brokerage firm on the planet. You know, I still use the platform,",
    "start_timestamp_seconds": 335.12,
    "end_timestamp_seconds": 412.32,
    "start_timestamp": "05:35",
    "video_url": "https://www.youtube.com/watch?v=icjdKy-5euY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=icjdKy-5euY&t=335",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 445.0
  },
  {
    "video_id": "icjdKy-5euY",
    "title": "The Real Reason Tom Sosnoff Left TastyLive",
    "text": "deal, I decided it's time. I can finally sell some stock. I decided it's time for me to move on. I have nothing but great things to say about tasty. It's an amazing company. It's probably the best brokerage firm on the planet. You know, I still use the platform, you know, 50 to 100 times a day. And the people there are but it was just time for me to go out on my own terms. So to answer your question, the long form, it was just time for me to go out on my own terms. And I had an idea of them working on for a couple of years and it was time for me to go and take over a new company that I'm the lead investor in or one of the lead investors, but I had never run the company until, you know, two or three weeks ago.",
    "start_timestamp_seconds": 392.08,
    "end_timestamp_seconds": 437.92,
    "start_timestamp": "06:32",
    "video_url": "https://www.youtube.com/watch?v=icjdKy-5euY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=icjdKy-5euY&t=392",
    "chunk_index": 6,
    "word_count": 153,
    "upload_date": null,
    "duration": 445.0
  }
]