[
  {
    "text": "What's up, everybody? Eric here. I am back with my friend Matt Caruso from Crucio Insights and I am stoked to speak with a stock trader. He always balances me out. Plus he's Canadian. So he's just a nicer human being than I am. He's kind of like the, the Yen to my Yang or my Yang to the Yen. I don't know which is which whichever one is the good one. That's you. I'm the shitty one. But welcome back. Thanks for having me, Eric. It's always, it's fun to come out here and balance you out to. You balanced me out too. You keep me going. It's good. Yeah. Yeah. I feel like there's a good mix here. So we were talking a little bit before we started recording about ideal locations. And you were saying that you're getting ready to kick off the gray season for what? The next almost half a year. How do you feel about that? That's that's it. You know, it's one thing it's good for productivity because you know, like summertime, it's like it's nice outside. You want to go out like stock charts. They're always fun, but a little less fun in summer. But so like you guys have to look at the bright side, right? So the weather's doom and gloom for a lot of months here, but it keeps you more connected with the market, I guess. It's always a silver lining. You're silver lining. Yeah. I was going",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "in summer. But so like you guys have to look at the bright side, right? So the weather's doom and gloom for a lot of months here, but it keeps you more connected with the market, I guess. It's always a silver lining. You're silver lining. Yeah. I was going to say bright side, not a good war. It's there. So it doesn't seem like there's going to be a fucking bright side for you. Yeah. We were joking about that because for those that don't know, I did my undergrad in Rochester, New York, which I was two. I mean, it's like every time I look back at my life, I'm reminded at like how dumb I am. And we were going to tour the campus. And we went through these tunnels. And I thought, wow, like it was so novel to me. I've never seen it before. So it was so cool because it was novel. I was like, wow, they like, they have these cool tunnels and they like paint the walls. And you know, like they it's neat. And then, you know, Eric completely missing the message here means that for a good part of the year, you're going to be muting to your classes through a freaking tunnel because the weather is so bad. Miss that entirely. Just up the tunnels are cool. So yeah, I really misread that one, I think. It's okay. It passed. You made it through college. You're good to go.",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "year, you're going to be muting to your classes through a freaking tunnel because the weather is so bad. Miss that entirely. Just up the tunnels are cool. So yeah, I really misread that one, I think. It's okay. It passed. You made it through college. You're good to go. That's right. You know, what I say now is that if I have kids, if it's a boy, he can go wherever he wants. If it's a girl Rochester, right? Because there's no bikini parties. There's no boyfriends there. Because you're just trying not to become an ice cube. It's like exactly what I need in my life. So that's why it's served a purpose. Talk to me about the markets. How's trading been? I know specifically, I actually just talked to, you know, I'm sure you did Jim Ropel. I just had him on yeah. And I was actually singing your praises to him because I really like your guy's style of trading. It's super fun for me to to learn about to talk about. And he was explaining a bit about his paradigm, how things have been going for him, you know, not great. But I'm really curious how you've been fairing with with your approach. Yeah. So Jim's a great guy and we'll talk everyone's in a while and he's a wealth of knowledge. So he's great to talk with Jim. So, you know, like I've transitioned over the years. Like we spoke about our own past",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "how you've been fairing with with your approach. Yeah. So Jim's a great guy and we'll talk everyone's in a while and he's a wealth of knowledge. So he's great to talk with Jim. So, you know, like I've transitioned over the years. Like we spoke about our own past calls. Like I was a day trader for the longest time. So I transitioned to the point where I want to be a position trader. And I want just going to change up how I approach things. And I remember when I started my, when I first started getting into stocks was 2003. I started my career in no way. And I always remember looking at that 2000 to 2002 bear market and not just the depth of it, which was a big bear market after dot com. I was the time like, oh, I hope I never like I know somewhere we're going to get this long drawn out type of market again. But I hope it doesn't hit. You know, so you know, transition all these years later, I think we finally hit that same kind of market. If you look past like the mega cap stocks, which is typically just not a focus of mine. You know, like you have yours. I have mine. And you know, typically buying Microsoft for for a, you know, a couple of percentage points is not what I'm looking at. Most other stocks have really been soft. And so for someone",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "is typically just not a focus of mine. You know, like you have yours. I have mine. And you know, typically buying Microsoft for for a, you know, a couple of percentage points is not what I'm looking at. Most other stocks have really been soft. And so for someone who's more kind of long only and I want a position, I want to put on size. I want to get these bigger moves. It's been a boring market. And it's been trying my, my patience in a sense of, you know, I, you know, as well as I do, it's like discipline is priority number one. If you're not disciplined, you're going to fail. And so, you know, my, my goal has been like, this is going to be my focus. Because in the past, I've tried to run dual strategies. And it's one thing if you're totally systematic, like black box kind of thing, like, you know, it could run multiple, multiple strategies. If you have to still interpret mentally, it's very difficult to be running a very short-term strategy, longer-term strategies. Because you tend to get focused and sucked into the world of the really short-term. And then you, you're always late for the really important turning point. So I promised, my, my, promise I'll few years back. I wouldn't do that again. But now this leads me in this kind of year where, you know, there's not a lot going on. So at least me in",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "then you, you're always late for the really important turning point. So I promised, my, my, promise I'll few years back. I wouldn't do that again. But now this leads me in this kind of year where, you know, there's not a lot going on. So at least me in a lot of cash, few trades, which, it's not a painful year. It's just a little more of a boring year. Unfortunately. Do you do anything with the cash to at least earn something on it? Yeah, I mean, I think that's the one good thing about the higher interest rates. At least you're, you're getting a nice return on your, your, your deposits while you sit and wait, you know, but, like for someone who lives, who for many years lived for the juice of like, you know, hundreds of trades a day, it's really kind of testing my, my, my discipline to kind of just stay focused on what we need to do here. Yeah, it's kind of like it sounds like you're talking about, I'm not exactly sure what the experience is like, but it sounds kind of like going from like heroin to caffeine, you know, there's a bit in stimulation. I assume. That's, it's really interesting. And as always, I, oh, I always use this as an opportunity to plug options. I know that you were telling me that you started kind of talking a little bit more about them somewhat here and there with",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "there's a bit in stimulation. I assume. That's, it's really interesting. And as always, I, oh, I always use this as an opportunity to plug options. I know that you were telling me that you started kind of talking a little bit more about them somewhat here and there with their community, which it just elates me, it just makes me so happy. So I'm stoked on that. What are your thoughts, though, genuinely on like the integration of, it's not even options. I don't really care about that, but like of another strategy when you find a year, because to your point, it's a prolonged period of time, right? You're just not getting your pitch. So what's the move there? Do you think that it's better to just wait for your pitch or do you start dusting off the toolbell and grab something else? So it really is an abnormal market. Like if you go back historically, it's very rare. You see this kind of stuff, but it's, you know, abnormal times, breed abnormal markets, but you know, it'll change. But to your point, it's that's one good thing. One of the reasons I want to try this, in a way from day trading, is like, I'm like a market obsessed guy. Like, I mean, my wife has always on me for buying books and this like, it's like a nonstop, like learning process. And so one of the goals I have is, I want to build a smarter",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "a way from day trading, is like, I'm like a market obsessed guy. Like, I mean, my wife has always on me for buying books and this like, it's like a nonstop, like learning process. And so one of the goals I have is, I want to build a smarter way to kind of automate what stocks are going to be the leaders in the next three months, six months, nine months. So a lot of people will kind of look at minimum criteria. I want to see a certain amount of relative strength or price action or be above certain averages or fundamental growth. Like there's all these variables that in reality as individual trades, we're just looking at this massive data. And we have to throw all our experience, kind of figure out how they come together together. So my goal was, was to build like a more intelligent plot from the kind of leverage AI. And I know AI is like a very, you know, kind of generic term. I'm investing now in your business. You can take all my money. I just made a billion dollars. No, but you know, what will make happen? You said AI. I'm pretty sure you should check your email, because it's probably there already. But the funny thing about AI has been around for the longest time. And this is not a generative AI. So like actually all these algals and HFTs and I was building algals for the very",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "AI. I'm pretty sure you should check your email, because it's probably there already. But the funny thing about AI has been around for the longest time. And this is not a generative AI. So like actually all these algals and HFTs and I was building algals for the very short term trading for a shop a few years ago. So I was into this AI stuff like way before with the AI. But you know, ignoring what everyone thinks AI is today, just the kind of black box element to it, like the neural networks, like more advanced stuff. I have someone who we built this neural network. And my goal is to kind of run through this data and build algorithms to really identify, like, okay, these are the variables that are most predictive. How do they come together? Like so each day, you're always dealing with the same variables, but each stock has different, you know, different amounts like this says more earnings less sales or better price action. So like, how do we go from these 10,000 stocks to like, I want a short list of 20 and I want this 20 short list to be like quantitatively driven. I'll do the rest, but I want all this work done. So I've been working on that a lot. That's been a big focus of mine. So to your point of like running multiple strategies, I do, I just want to do it intelligently. And so my",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "like quantitatively driven. I'll do the rest, but I want all this work done. So I've been working on that a lot. That's been a big focus of mine. So to your point of like running multiple strategies, I do, I just want to do it intelligently. And so my goal is to kind of start to automate this stuff. And I read this really good book by Tom Bassow. He's one of the kind of original market wizards all weather, all weather trader. I interviewed him. I interviewed him. Okay, great. Yeah, Tom's great. And he runs like so many strategies. So he's like the other extreme, right? And so my goal is to kind of take a lot of what I'm trying to do now is position trading growth, growth investing, but take it more intelligently and kind of get that equity curve smoother, more effective, make it easier. And so that's like I'm trying to take this time to do that. But my goal going forward, like one year, two year, three years is to be able to run like at least a couple of versions of the strategy simultaneously. I think well, especially when you talk about like smoothing returns, to your point that is one of the fascinating things I find about your your approach versus my approach, right? Where you've had some triple digit years, like deep, triple digit years, right? Which that is I've never seen that. But almost every single year for",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "about like smoothing returns, to your point that is one of the fascinating things I find about your your approach versus my approach, right? Where you've had some triple digit years, like deep, triple digit years, right? Which that is I've never seen that. But almost every single year for me, I know right out of the gate, it will be over 20. I know that almost with certainty, it's been like that for the last decade plus. So it's like the ability to replicate and then scale that I think has been really useful to me. And it's interesting to see you kind of move in at least somewhat a little bit of that direction. So it leads me to what's the hypothesis then? It seems like the majority of like the Cancel and Style of Trading to your point is looking for these big runs, right? So then what's the overall thesis on how you streamline returns if that's the main effort to achieve your returns? Yeah, I think so there's different ways. So I'm really trying to kind of like deconstruct the strategy. I've spent years with it. And so like all the stuff I learned as a day trader and swing trader and running this kind of like like Picasso, like take all the objects but make them know, bring them down to their elements, you know? And so it's, you know, there's different ways, like Willem O'Neill who kind of obviously literally wrote the book",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "a day trader and swing trader and running this kind of like like Picasso, like take all the objects but make them know, bring them down to their elements, you know? And so it's, you know, there's different ways, like Willem O'Neill who kind of obviously literally wrote the book on it. He was like a stock guy. It's like I'm going to find my stock and he was, if you think I'm concentrated, I mean his story is like he was like 200 invested in Amgen in the 90s, like like ridiculous returns, you know? And so he was a very all-in kind of guy, but you know, like markets have progressed. That's one way of doing it. I think there's kind of different, like I love Ray Dalio or Tom Basel, it's about like diversification to minimize correlations between stocks to like make it like a better system to live with. So my goal is to kind of take the heart of Willem O'Neill and everything he's doing, but find ways to systemize it more to bring in these other elements, you know? Like I mean Bill was a maverick. He was, he was a hot shot and he was a mate, not everyone has that skill. So like I really want to try and for myself and for others that, you know, that work with me. And also, you know, in the future, I'd like to maybe run some money where it could be more of an",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "he was a mate, not everyone has that skill. So like I really want to try and for myself and for others that, you know, that work with me. And also, you know, in the future, I'd like to maybe run some money where it could be more of an automated process. I've never got into because I know my process is very concentrated. It doesn't lend well to like other people's money like investors and all of this kind of stuff. So the goal is to kind of systemize and get to that. And to do that, you really need this, this bigger process to go from like just like a maverick trader to like, okay, this is now a system and we're able to leverage that and focus. So that's, that's what I'm working towards. Yeah. Well, I mean, obviously Jim was able to figure out the funding part, right? We even with kind of that canceling style. So I think there's something to be said about the way that it can be positioned for people that believe in it. I think you also bring up a good point though on, you know, like being 200 invested in as something like Amazon and a single stock because the issue I see with those kinds of stories is that it's just from a statistical standpoint, survivorship bias, like hands down. Because if you take 50,000 other people who put on 21 and they pick the wrong fucking stock, you",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "as something like Amazon and a single stock because the issue I see with those kinds of stories is that it's just from a statistical standpoint, survivorship bias, like hands down. Because if you take 50,000 other people who put on 21 and they pick the wrong fucking stock, you know what I mean? So to me, when I see stuff like that and, you know, and that's not to besmirch his capacity whatsoever, to your point, he was incredible. He found a way to pick the right ones. But as we think about something that's scalable, reckled, and something that can be applied to a broader audience, that's real tough, man, especially to be that centralized. And the way that Tom trades is actually, it's actually funny because whenever I talk to him, he and I almost have not the same positions, but a lot of the same positions on. And we follow what I would consider to be kind of like a very simplified rule set. So I'm pretty eager to see what you come up with because you're super fucking smart. And I think the way that you look at the problem set is interesting to me because I do think there's room out there for something that's generally replicable, but then also has a smaller component to it that you can get home runs with. I'm interested to see how you kind of combine it. Yeah, for me, it's like, how do you become, how do",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "because I do think there's room out there for something that's generally replicable, but then also has a smaller component to it that you can get home runs with. I'm interested to see how you kind of combine it. Yeah, for me, it's like, how do you become, how do you become a replicable home run hitter? You know, how do you pull that? That's and think what Bill and you're so right about the survivor ship bias. I mean, I've had my difficult times. I was never concentrated as much as Bill was. But the thing about Bill is, you know, you can do it once you can do it twice. He had a career of 50 years of doing this. So, so he had and he tried to share as much as he could and it's hard to typically, but he had this innate skill. So it's to me, it's like he proved it is doable. It's like almost virtually impossible. It's like saying how many guys are Michael Jordan. There's only a few, right? I mean, so but it can be done. It's like, you know, the four-minute mile, no one thought you could break it, then one guy does and then suddenly everyone starts to do with kind of thing. So my goal is kind of like, again, it's like you said, like trying to figure out what's the problem here. So instead of doing like Bill be 200 of one stock. And I know you're",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "one guy does and then suddenly everyone starts to do with kind of thing. So my goal is kind of like, again, it's like you said, like trying to figure out what's the problem here. So instead of doing like Bill be 200 of one stock. And I know you're an options guy, but through your experience, you've been doing this long enough. Every bull market, there's always that 10, 20 stocks that that are like the outstanding positions to own. Like I mean, there's those 20 stocks that will return to 300 return. Then you like do like a whole like step lower and everyone's at that, you know, 30, 40 return. Like there's their whole magnitude of returns higher. So if I could find those 20 stocks or shortlist to down to 30 and 20 of those 30 are going to be these epic winners, while you've like simplified like a huge amount of the process. Because then after once you you have this shortlist, you can figure out even like options head there's different ways you can kind of concentrate to leverage that, but then diversify risk away a little bit. So like for me, it's like I'm really trying to tackle this with a really big goal. And like I haven't even spoken to anybody about this, like outside of like my team. So you're like the first guy I'm actually going to get into this with. But you know, everyone starts with this one problem.",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "I'm really trying to tackle this with a really big goal. And like I haven't even spoken to anybody about this, like outside of like my team. So you're like the first guy I'm actually going to get into this with. But you know, everyone starts with this one problem. You have this huge mass of stocks. Who do you choose? You know, and the variables will change over time. And so it, but if you can shortlist, I mean, wow, you've really like kind of brought yourself way forward in like the game of getting to that, home run type of scenario. And you can do it with you can do with a little more diversification. If there's 20 stocks and you have 10, you know, 10 stocks is fairly diversified. You know, like there's most even large mutual funds like 10 stocks is usually like 50, 60 of their portfolio. So I mean, once you can get to that 10 range plus there's a fair amount of diversification. It's not all in on one stock. How do you view the problem set in terms of what's more achievable for you? I look at it this way. If you're talking about the entire population of the stock market and you're trying to call it down essentially to the, you know, 20 or 30 top performers, that's one way to solve the problem. Another way that comes to my mind as you're talking about it is what if there's a",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "talking about the entire population of the stock market and you're trying to call it down essentially to the, you know, 20 or 30 top performers, that's one way to solve the problem. Another way that comes to my mind as you're talking about it is what if there's a way expand the hit zone, but then use something like here I go pitching options, use something like options to add the leverage to then still compete with the top 20 but you only need something that moves again in that middle tier that you're talking about. Because I think about like the probabilistic outcome of, you know, if there's 20 to 30 names of picking the majority of those, you probably could do it because you're smart shit. But like I look at that and I say, fuck, that looks real hard. And I try to bring the game down to my level, the Neanderthal level. And I try to figure out like, okay, if you've identified that there's that middle zone where there's maybe a hundred stocks. Now if you get a mix of anything from that hundred stocks all the way up to the 20, it seems like with the right positions, you could still achieve a good return. Is that something you've considered or you, like how do you view that tradeoff between a really small hit zone, but a motherfucker if you can hit it up a home run versus a slightly wider. Yeah, you",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "like with the right positions, you could still achieve a good return. Is that something you've considered or you, like how do you view that tradeoff between a really small hit zone, but a motherfucker if you can hit it up a home run versus a slightly wider. Yeah, you know, like so part of the study I want to do is like my personal preference and this is why again, I always just manage my own money because I like to look for the big home runs, which is harder to do and there's more volatility with it. But my aim of the study is to like, you know, that's my goal. Like how can I replicate other common goals? Like you're talking about something, let's see what the, we'll assume it's like a better sharp ratio. Something that's like a little more stable, but there's still sizable returns. Maybe you lever it up or you hedge it out in other ways. So like the point of the study is going to be to like, how can we figure out what stocks represent these different opportunity sets? And again, if you dial down like the level of awesomeness, if you're not looking for Jordan, just looking for like a good NBA player, well now yeah, you have a much bigger data set, you're more likely to hit it, but there's still one other problem that you have to identify. And again, this is I think where it helps to",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "you're not looking for Jordan, just looking for like a good NBA player, well now yeah, you have a much bigger data set, you're more likely to hit it, but there's still one other problem that you have to identify. And again, this is I think where it helps to have traded for a long time before doing research because most people who do research are like academics, so they don't get markets, you know? So like you can look at the data, you can average stuff out, but markets don't work in averages. There's periods of time where it's, wow, rock and roll, everything moves. And other times where you can average it out over the whole data set, you don't notice it. Like for example, the past year and a half, two years, it's awful. There's nothing going on or big losses. So part of it is going to be how do I identify the best environment to operate in? Like this is a hyper, it's like your counting cards of blackjack, right? You know, okay, we got a positive deck now it's time to, I don't know if I'm going to get 21 next hand, but now's the time to kind of start betting big. And so there's that element of it too, which is going to be part of the study as well as to kind of figure out not just who are going to be the best stocks or, you know, how can we identify",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "the time to kind of start betting big. And so there's that element of it too, which is going to be part of the study as well as to kind of figure out not just who are going to be the best stocks or, you know, how can we identify the mid tier stocks? What's a good time to operate in? So once you kind of put these, even if these are like, I think of them as like the big puzzle pieces. So if you have this like, you know, trading can be complex, super complex, but if you want to simplify it and like, and, and, you know, I know you joke that I talk about a lot of things, but at the end of the day, trading has to be simple. I mean, you can come to it with like a complex view, but when you get to the bottom, you know, uh, end of the story, like it's got to be simple. So to me, those are the most important elements of the puzzle, like which stock when's the right time? If you get those two things right, the rest is just about like, how do you want to go about your strategy? Like those are the two things you need to figure out. Yeah, I love that. And that's a really fun kind of, I wouldn't even call it a problem to solve, because it's not so much a problem, but yeah, it's like a",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "you want to go about your strategy? Like those are the two things you need to figure out. Yeah, I love that. And that's a really fun kind of, I wouldn't even call it a problem to solve, because it's not so much a problem, but yeah, it's like a conditional environment to establish. It's, that stuff fascinates me because I talk about this in my community a lot, but like, I have spent more money than I cared to share on just market data. So I typically buy minute level, full Greek market data from SIBO and anybody can go figure out how much that is for tickers. It's obnoxious, but I love, I love looking at stuff like you're talking about. You hit on one thing though that actually I've been working on a lot, which is kind of classifying broad market regimes and the traits of different market regimes for those environments. How do you view that problem set when you're talking about something like finding like a good environment to operate? And obviously the broad market regime matters to you. How do you think about analyzing that? So this is something like we all do it. Like I spent a lot of time like sitting down to articulate this because if you start dealing with programmers, even like the guy I'm working with is super intelligent guy, you know, but they're like black and white. Okay, tell me what we're looking at. So it's like it's",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "Like I spent a lot of time like sitting down to articulate this because if you start dealing with programmers, even like the guy I'm working with is super intelligent guy, you know, but they're like black and white. Okay, tell me what we're looking at. So it's like it's up to you to kind of break this apart, but if you stop even yourself, like you're looking at this data, you're looking, you're counting cards, you know, you want to know when's my high probability environment? We're all doing it, whether it's a five minute chart, whether you want to build a position for nine months. Again, I've used the same tools for drastically different jobs of like trading in my career and it's just about how you structure your process. So for me, like trying to approach that environment level, like my current view is trying to cash these winners for multiple months, but they're, you know, depending on what you're aiming at, like for example, if you're looking at day trading or one or two day strategy, the environment you're looking at is going to be a little bit different. There's always like the the bigger elements will impact everything. Like if the Federal Reserve is like providing liquidity or lowering interest rates, that helps everything kind of edge higher. But, you know, depending on what you're trying to capture, that environment, you're going to have to figure out what is the best environment for you. And",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "will impact everything. Like if the Federal Reserve is like providing liquidity or lowering interest rates, that helps everything kind of edge higher. But, you know, depending on what you're trying to capture, that environment, you're going to have to figure out what is the best environment for you. And that's what we all have to kind of figure out for ourselves, depending the strategy. Yeah, it's, to me, it's a really fun problem to try to solve because to your point, you said it earlier and it's stuck with me because it's a fascinating problem to consider, you know, that right now you feel like the current markets are anomalous, right? That this is abnormal. And my view typically is like the market is what it is. What's normal or abnormal doesn't really fucking matter because I've learned that the periods, you know, it's kind of like the same thing from the seem to live that he talks about where uncommon things happen way more frequently than we understand. So when you look at analyzing like this kind of market, I agree with you that there's like a confluence of crazy shit all at the same time that I never would have guessed. I literally never would have guessed this. But then I always look at how many times I felt that way and how frequently different variations of abnormal pop up at the same time. So it almost creates this repeat pattern of abnormal behavior. So to pull",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "never would have guessed. I literally never would have guessed this. But then I always look at how many times I felt that way and how frequently different variations of abnormal pop up at the same time. So it almost creates this repeat pattern of abnormal behavior. So to pull on that thread a little bit to understand your perspective, how do you view like a normal market quote unquote broad content context versus an abnormal market? So that's a really good question. Like if you stop and think about it, okay? And a lot of people will say like if they look at a Dow Jones chart or anything Nasdaq chart, I think how could this market keep going up all the way? Like how does that make any sense? It's like it's a, you see people say scam doesn't make sense. Think about every year, the Fed wants that they say stable prices is 2 inflation. That's not stable. That's inflation. Stable should be zero, right? But they say we want 2 to make sure we don't go into deflation. Okay, so that's the Federal Reserve says 2 on top of that, you typically have productivity. So everyone every year we figure out how to do things better, smarter, hopefully as a society. So that's not a two, two and a half percent. So every year you have at least a four and a half percent push on stock prices up. If everything else, nothing else changed, everything's",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "every year we figure out how to do things better, smarter, hopefully as a society. So that's not a two, two and a half percent. So every year you have at least a four and a half percent push on stock prices up. If everything else, nothing else changed, everything's okay. So on top of that, there's this like kind of virtuous circle and vicious circle of credit. So when things are going well, banks lend more, people spend more, then people have higher incomes, they spend more, they borrow more and things go up, up, up. So that four and a half percent turns into 12. And that's why you have these these typical 12 years. But every so often the cycle breaks, people get at a hand, there's something like you're seeing anomalous. Yeah, you're right. It's always something different, right? 2011 was the European like you were calling the pigs that the debt problem, you know, twice either there's a trade war, there's always something different. But something comes along to snap this credit and puts it into reverse, maybe inflation picks up, whatever. And so then you go through this period where you have to kind of like squeeze back down to, to, you know, reverse gear. And once it's we get back into line, we go back into the normal thing of things, you know, assuming capitalism stays in place and freedoms and, and all the rest, you know, so, so that's why over time,",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "of like squeeze back down to, to, you know, reverse gear. And once it's we get back into line, we go back into the normal thing of things, you know, assuming capitalism stays in place and freedoms and, and all the rest, you know, so, so that's why over time, so we have these normal, I call them normal periods, but we call them growth periods where there's no systemic problem. People are happy, people are spending more, which makes people spend more. And you know, the life we live at most people are just worried about living a good life. And that equals rising stock markets for two, three, four years gets at a hand, something snaps and it's bad crazy markets for six months, nine months, this case is longer. Once it finishes washing up problem solve, okay, we go back into our path. And people say, well, how could you keep going? Like I said, the Fed wants two percent inflation. They want, and there's naturally productivity rules. So it, and then there's credit expats. So it does make sense logically that we have these nice trends. So my goal is to like, how do you participate in those happy times? And as much as possible, like step away or hedge those nasty times when we're kind of getting back to a lower reality. So that's how I in my mind kind of segregate the two. Because yeah, you can't, you're right, there's always going to be",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "in those happy times? And as much as possible, like step away or hedge those nasty times when we're kind of getting back to a lower reality. So that's how I in my mind kind of segregate the two. Because yeah, you can't, you're right, there's always going to be something. But if you look at markets, there's the, I mean, look at the VIX, right? So there's the low VIX regime. That's happy times. There's a high VIX regime. It's crazy times. It can be different reasons. But if you can avoid those crazy times or minimize them or whatever, you're, you know, big way away. And high VIX regimes are shorter nature. You have panic. Things happen. Politicians finally get off their, their, their, the chair. They say, okay, I got to fix something. I'm going to lose my job and things get fixed. And then we kind of go back into normal. So that, that's how I separate the regimes and yeah, it's, it's honestly a really beautiful way to describe that. I love the way that you describe the, the expansionary element of the economy. Because that's something I actually have struggled to explain to people before as effectively as you did in terms of like why there's positive drift in the stock market, right? It's the same exact first part of the question. You answered there, which is, I really like the way that you phrase that. I think it makes a lot of sense",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "before as effectively as you did in terms of like why there's positive drift in the stock market, right? It's the same exact first part of the question. You answered there, which is, I really like the way that you phrase that. I think it makes a lot of sense that these are for people to comprehend. When you are analyzing the markets, so going back to kind of this thesis that you have in trying to dissect things to qualify these different regimes, how do you view periodicity? So how far back are you trying to qualify? And then are you applying some sort of waiting factor for the more recent times versus the more distant times? I know this is a little bit more in the weeds, but the reason why I'm asking is because I literally am working on the same stuff. So when I'm looking at the different regimes, I found the window that we analyze is obviously super important. And it's very, very difficult for me to look back at some of the previous events and say, oh, well, you know, it's unlikely we would see that again, but there's always some version of that. So then you have to figure out structurally how to wait the bat and then to be able to kind of classify things in a more recent sense. So to kind of summarize the question, when you're looking at, you know, your data set to create these qualifications, what period",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "So then you have to figure out structurally how to wait the bat and then to be able to kind of classify things in a more recent sense. So to kind of summarize the question, when you're looking at, you know, your data set to create these qualifications, what period are you looking at? And then how do you view the different periods time for them that you're looking at? So it's like anything else, right? When it comes to numbers, the more you have, like the more proof there is that it's likely to continue. And the one thing that's really interesting about kind of working with the guy I'm working with who is like this math like wizard. And he's always telling me that he's like, Matt, you know, he's like, you want to keep as few variables as possible. They may not be the best outcome, but they're more likely to stay true for longer. You know, he's like, or else, all you're doing is making the computer like memorize the data. And it's like, it's like studying for a test. You don't actually study the material, you just study like a B or C. And that exact same test, you can get 100 on. But if the questions are changed in any way, you fail. You know, so, so like that's kind of that's always stuck with me the way he kind of explained that to me. And so like to me, there's there's certain principles",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "exact same test, you can get 100 on. But if the questions are changed in any way, you fail. You know, so, so like that's kind of that's always stuck with me the way he kind of explained that to me. And so like to me, there's there's certain principles like you look back that are just true of the market. Like I spoke about like the Federal Reserve. And you can go back to like when the Federal Reserve even before the Fed, the gold standard, like I like monetary history. I'm weird that way. I'm think one of the few guys who gets excited about reading about like monetary conditions 100 years ago. But the same stuff that led to the 1907 crash is the same stuff that leads to that's leading to this current situation. It's the way money flows happen. So there's there's like high level stuff that's always true. But then after there's certain things that change, you know, that like at least the tools and sometimes the data really readily available. Oh, one second, I think my my phone changed. My problem though we're back. Okay. So like so like there are at some point, even it's interesting. Like one of the data points I look at is new 52 week highs versus new 52 week lows. And for that, you need like a deep data set because you need to know all the securities that are listed. And so, you know, it's funny.",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "point, even it's interesting. Like one of the data points I look at is new 52 week highs versus new 52 week lows. And for that, you need like a deep data set because you need to know all the securities that are listed. And so, you know, it's funny. Like maybe it's me getting older, but I feel like the year 2000 wasn't that long ago, but like data from the 90s and 80s is like hard to come by. It's not as readily available. You know, so there's some tools that are just it's hard. You can't back test them. You can't really check them the same way going back 100 years ago. It's hard to get the kind of data and all that, you know. So so I think it's like you want to have like the high level stuff. And then after you want the data and the tools for the changing markets and I think it's you're never like one and done because like for example, like before 2000, you know, inside our trading, not that it was legal, but like you know, right, right, right, regulation FD came out in 2000. And now you have all these massive gaps on earnings, which you didn't have before because the market changed, you know, HFTs are a new phenomenon. So you have to always kind of understand the tools that you're using. How susceptible are they to kind of breaking if like an actual market dynamic",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "have all these massive gaps on earnings, which you didn't have before because the market changed, you know, HFTs are a new phenomenon. So you have to always kind of understand the tools that you're using. How susceptible are they to kind of breaking if like an actual market dynamic changes? So to me, there's like certain principles that are everlasting, like you know, like monetary conditions. And then there's different tools about how you go about measuring things. If you're going to build something systematic, you know, you want to keep it simple and you really want to understand what's driving it. Because if that snaps, well, you got to know, you know what I mean? So that's like, I don't know if I answered your question correctly, but that's kind of like how I think about it. Well, there's two things. The first thing is I actually think about it the same exactly. So when I'm going through and I'm trying to qualify the different market regimes, I'm not looking to replicate the individual anomalies that are popping up in each thread. But I'm looking to understand the quality of the anomaly and then apply a weighting to it. And then I use that. And that's actually worked really well for me. So it's interesting that you're going down that that thread because I think that that's a really fair approach. And I think it works about as good as you can get because to your point, I",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "it. And then I use that. And that's actually worked really well for me. So it's interesting that you're going down that that thread because I think that that's a really fair approach. And I think it works about as good as you can get because to your point, I think one of the issues I found is that the impacts of different events changed drastically based on even the market structure at a point. How many participants are there? What's the daily volume of the market? Like all of that stuff has an impact on how that event impacts the markets. So that makes a lot of sense. And then I also did want to definitely reaffirm that you are pretty fucking weird for enjoying market monetary policy and structure from 100 years ago. I consider myself a bit of a nerd, but I would not quite say that it excites me. But now I know that if I ever need to talk dirty to you, I'm going to break out my monetary policy speak and then get you going that way. So it's good. It's good to know you turn on. It's funny. You know, I used to be in a band, you know, always to play guitar and all this kind of stuff. So it's like I'd be going to practice. But I from like a young age, I was obsessed with this kind of stuff. So it's like I'd be reading like Ludwig von Meises, which",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "be in a band, you know, always to play guitar and all this kind of stuff. So it's like I'd be going to practice. But I from like a young age, I was obsessed with this kind of stuff. So it's like I'd be reading like Ludwig von Meises, which is like an Austrian economist from like, yeah, many decades ago. And it's like very like deep like, like, you know, monetary type of tools. And so it's like I'd wrap that up and okay, let's go play some like monthly crew and guns and roses, you know. So it's I don't know, we all have our, I swing between guns and roses and monetary policy as my, my pleasures. It's good. I definitely think that they offer balance to one another. So talk to me about the way you've viewed the markets this year. And the reason I want to touch on this is because we had a chance to cover some of this the last time we spoke for a lot of like my friends, like I genuinely do consider you a friend. I try to like get you guys on periodically because it's really fascinating to me to catch a snapshot of how we think about things and then how it progresses. So yeah, talk about the markets writ large. What do you think about them? So this is something like that I've the terms I've come to I haven't seen other people kind of talk about",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "to catch a snapshot of how we think about things and then how it progresses. So yeah, talk about the markets writ large. What do you think about them? So this is something like that I've the terms I've come to I haven't seen other people kind of talk about this way, but like I feel really confident. Like I've been going over and over with this for a while. I actually had dinner with a bunch of the guys from the trading desk who still get together. At least I always try once a year and I was, you know, pitching them this idea and they hadn't heard it before either. But there's this huge disconnect between the Nasdaq 100 and everything else is, you know, like everyone's talking about it. And there's some guys will say like, uh, who cares? You know what I mean? It's up anyways. You know, you're complaining because you didn't catch it. Then other people are going to say, you know, what you talk? What kind of a bull market is like seven or eight stocks, et cetera, et cetera. But I think this dynamic going beyond why these stocks went up nothing else did. I think there's a strong reason and it's never happened before like in modern, ever in the history. So if you think about every kind of bad market event, where do people go? So the markets worry is bad. The economy looks bad. You go to the bonds.",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "else did. I think there's a strong reason and it's never happened before like in modern, ever in the history. So if you think about every kind of bad market event, where do people go? So the markets worry is bad. The economy looks bad. You go to the bonds. Bonds are safe back by the US government. And that's where you go. Now people say, look at the 70s, you know, bonds fell too because there was inflation and the market also fell. Yes. And so why is it different this time? Well, I think one market has become more sophisticated. And I think institutional investors looked at themselves. They saw the inflation. They said, I can't go to bonds. I don't want to be in general stocks. But Microsoft is pretty much as close to get to a bond. Like their future cash flows are fairly consistent. I mean, it has closed. So like financial engineering has come a long way. So I think investors have been using like the big cap tech as they're like their bond proxy. Like, you know, like they can, you know, they figure if Microsoft could adjust prices for inflation, it's like smooth returns for like the next five or 10 years. Like, you know, Microsoft office is not going anywhere. And so we can't buy bonds. So everyone rushed into Apple Microsoft Google because they figure it's super liquid. It's it's it's they have very predictable cash flows and they were",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "smooth returns for like the next five or 10 years. Like, you know, Microsoft office is not going anywhere. And so we can't buy bonds. So everyone rushed into Apple Microsoft Google because they figure it's super liquid. It's it's it's they have very predictable cash flows and they were kind of inflation protected. So it ends up being kind of this new bond proxy. So it's it's created. It's really weird dynamic because there's such a big part of the market where everything's falling bonds are falling like, you know, all the most stocks are falling yet the index is going the Nasak 100s like going up. And you can just see if it's the Nasak 100, it's up like 30 plus percent this year. The S and P's up like 16. Then if you go to small caps or negative on the year. And you could just see like the further you get away from this like safe haven status of stocks, the worst year returns are on the year. So it's a really odd year. And I think there's going to be repercussions going forward because think about it. Like once the problems are solved, once inflation is peaked and you know, the worst of like, you know, we think the economy is going to turn around. I think we're going to see this kind of go backwards. So like all these funds are hanging out in Microsoft and Apple and you know, the valuations are staying",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "is peaked and you know, the worst of like, you know, we think the economy is going to turn around. I think we're going to see this kind of go backwards. So like all these funds are hanging out in Microsoft and Apple and you know, the valuations are staying high versus everything else. At some point, bonds are going to become attractive again because there's so be down and they'll be that swing up and all these small stocks that you know have been obliterated and a better economy are going to come back. And so there I think there's going to be this weird point in time where the Nasak will kind of not go anywhere. But that money will rotate out of these like icebergs of like Microsoft and Apple and everything else will have a huge bull market under the surface. So this year was kind of confusing because the Nasak 100 gave this I think false vision of what's going on in the marketplace because of this safe haven status. And equivalently another time it'll look like all the markets doing nothing but there's a huge bull market and nobody's in no way because they're just looking at these five stocks which are not going anywhere anymore because they're fully priced. So that's why I think this is a really weird year because it's never really happened before. There's never been five stocks that make up like half of an index with predictable cash flows",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "just looking at these five stocks which are not going anywhere anymore because they're fully priced. So that's why I think this is a really weird year because it's never really happened before. There's never been five stocks that make up like half of an index with predictable cash flows and that are so systemic. Like America's literally never had that kind of situation before. So that's why I think this year is such a weird year because these stocks took the place of bonds. It's a really interesting perspective. I actually think that I mean the jives really well with what we're seeing if you look at something like the SP 500 you know 28 of that index is IT. So even the 10 that that's up on the year very heavily attributable to tech. So I think that makes a lot of sense. And I also agree with your thesis, not that whether I agree or not matters. But I do agree with your thesis on small caps and bonds. For me, I view the Fed pivot to be the point in time where those would kind of have the foot lifted off their neck. What do you think about that? Yeah, I think so. I think it's once like everyone's confident inflation is peaking the Fed can go easy. All this is going to go into reverse. You know, and I know like, and look, I'm a like a technical analyst first. Like I mean, for years,",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "think about that? Yeah, I think so. I think it's once like everyone's confident inflation is peaking the Fed can go easy. All this is going to go into reverse. You know, and I know like, and look, I'm a like a technical analyst first. Like I mean, for years, I day treated like I know a symbol and not what the company does all pretty much like just a broad industry kind of thing. So some people say like, man, this guy's really overthinking it. But there's one thing I've noticed for myself because I like the position of like the going size. I've always made money trading, but I've always made like by far the biggest money like the outlier, you know, speaking of outlier like the out the outlier returns is when I had a good idea of what I thought was going to happen. And then it worked out that way because like think about it. It's like you know, you could make money in a lot of markets. But when you're expecting things to play out a certain way and you're prepared for it, I mean, you have the size on, you have the right movements, you know, what you're expecting, you know, what to buy. And so you're doing everything right. And so you have this massive year. Like I mean, I've had like really big months, you know, just even just one or two quarters where it's like, man, this is what's going",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "movements, you know, what you're expecting, you know, what to buy. And so you're doing everything right. And so you have this massive year. Like I mean, I've had like really big months, you know, just even just one or two quarters where it's like, man, this is what's going to happen for these these reasons perfectly positioned. And it's like, wow, bang, like huge market returns. So for me, I always play the mental game of what I think is going to happen. But I always have like market tools to make sure I don't like get offside, right? So I could think whatever I want, but I'm not one of those guys like, oh, it's lower. So now it's even cheaper. I got to buy more like no, if the market disagrees with me, I'm out of the way. I'm not going to just get run over. But I like to kind of plan because when I just when I'm right about direction and it plays out that way, for me, that's when the fire works happen. Definitely. And I think the way you view it is also the way that I tend to view things, which is not so much as a predictive outcome, but more of a probabilistic assessment. And because to your point, if you find a scenario that you think it's likely to play out X, Y, or Z, you position yourself because that's the way you dominantly think it'll play out. But then",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "not so much as a predictive outcome, but more of a probabilistic assessment. And because to your point, if you find a scenario that you think it's likely to play out X, Y, or Z, you position yourself because that's the way you dominantly think it'll play out. But then if the market doesn't confirm that, it's not like this giant disbelief factor, how it could market. Right. And I think that that's one of the problems that people that try to do any sort of predictive modeling fall into is that they think their assessment is what should happen. And then if it doesn't happen, they're besides themselves. And then that leads to, you know, lake getting out, not putting the trigger on other trades that need to go on and stuff. So I think that that's a really healthy way to look at it. When you're looking forward to the rest of the year, where are the next market leaders going to come from within small caps? So you were kind of talking about growth, not even small caps, but growth stocks. So within growth stocks, what sub-sactor do you think the market leaders are going to come from? So it's kind of hard because when the markets are rough, like a lot of stuff has weight on them. But there's like some key themes that are showing themselves. Like, you know, I think AI, obviously, is one that is strong. I think there's a long path to",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "from? So it's kind of hard because when the markets are rough, like a lot of stuff has weight on them. But there's like some key themes that are showing themselves. Like, you know, I think AI, obviously, is one that is strong. I think there's a long path to that, but you can't just buy it any price, you know, like an add-on. Like, you know, like, you need to get it at the right time. So that's one. You're all the weight loss, you know, drugs, you see like novel norris. I forget the name of them. It was emphozozempic and those other ones. Look, I mean, Bill Neal made a fortune with Amgen because they found a way to like, you know, fix your blood after a certain thing. I mean, so they found a way to help people lose weight. There's definitely a problem in society if that's the way it is, you know. My hope here is that I'm going to petition a new way for people to lose weight. It's going to be put the fucking fork down and go for a walk. That's my platform. You know, I'm someone where like, like, just personally, like, I believe as much as possible, like, you know, avoid pharmaceuticals for as much as you can, isn't that. But for some people where like, you know, it could be willpower, it could be like a genetic, I don't know, there's like reasons why people, you know, are",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "personally, like, I believe as much as possible, like, you know, avoid pharmaceuticals for as much as you can, isn't that. But for some people where like, you know, it could be willpower, it could be like a genetic, I don't know, there's like reasons why people, you know, are overweight life happens, you know, like the amount of negative repercussions from being overweight is super high, you know, like it causes so many other problems. And people are on so many other medications that are triggered from the heavy weight in the first place. So if they found a way to help people lose weight and there's not many big side effects, I mean, that eliminates all the other medication that people will likely have to take in better lifestyle. So look, I mean, it's, if it helps, it helps. I mean, like I said, my personal preference is not to have to go there in the first place. But, you know, if it solves a solution with less harm, why not, I guess, you know, but I think that's an important, that's a theme. But I think there's a lot of stuff waiting in the wings that we had. The IPO market has been frozen. There's a lot of like young companies, mid-tier companies that want to come to market. So like, yeah, I mean, I could spit out some other themes that are doing pretty well. Like I think like Uber's still growing. There's a lot of",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "had. The IPO market has been frozen. There's a lot of like young companies, mid-tier companies that want to come to market. So like, yeah, I mean, I could spit out some other themes that are doing pretty well. Like I think like Uber's still growing. There's a lot of like mid cap stocks that are doing great cyber securities doing well. If you look at everything that's kind of like security related, there's like a PSN, AVAV, which are all kind of like security related stocks, you know, with the wars and all that spends going up. So they've been acting very strongly with strong growth. But I'm really looking forward to seeing that IPO market unfreeze because I think there's so much in terms of like AI that is not in the market. Like it's not going to be a video that's going to go forever. You know what I mean? Like there's going to be other players who take this and develop new products, new services. Like think of internet, you know, circa 1995. Like all the players that come out and each guy leverages the other guy's technology, there's like a lot of stuff that's going to be coming. So like, you know, I'm not really quite sure how it's going to play out. Who's going to be the super big winner? Like there's key teams showing strength now. But you know, that changes over time. So I have to see how the data moves. How",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "to be coming. So like, you know, I'm not really quite sure how it's going to play out. Who's going to be the super big winner? Like there's key teams showing strength now. But you know, that changes over time. So I have to see how the data moves. How do you view the AI landscape? Do you think that it will be like a really fragmented come to market where it's a really wide industry that grows together? Do you see that there will be a couple of names that gobble up other names and kind of, I want to say monopolize, but definitely cut down the herd. Yeah, you know, and I think it's so easy. And everyone will always kind of say, Matt, like, you know, you know, Google or like Microsoft, the own everything. Like who's going to compete with them? But you know, the history of like capitalism is that it's always these big players that get eaten by smaller guys who are faster and quicker. You know what I mean? Like many other times, there's industries where people could have said like, oh, who's going to beat IBM or who's going to beat Xerox and they fall like every single time. Like if there's anything we've learned from like history, that the bigger stocks fail and usually fail quickly. So I'm not saying Microsoft's going down, but I'm saying like, there's going to be a lot of people who are going to, first of",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "and they fall like every single time. Like if there's anything we've learned from like history, that the bigger stocks fail and usually fail quickly. So I'm not saying Microsoft's going down, but I'm saying like, there's going to be a lot of people who are going to, first of all, the returns, like if you're already a 3 trillion company to get a double, you have to increase another 3 trillion in market cap. So like the law of large numbers alone will not make Microsoft like a five-bagger. I mean, unless it's like the entire U.S. economy. So you can find these great like I'm I'd like to look for like a 10 billion company that becomes a 50 billion company or a hundred like that's your five 10-bagger. And there's a lot of companies that can come to market with it, you know, five 10-billion dollar valuation. They're they're solving a new problem and you issue like there's a Sam Sarah symbols IoT. Like they have all these chips like that you can put like tracking type things on on your vehicle. So if you're like I think Delta Airlines uses them. Think about you have vehicles all over this massive airport. Atlanta airport it's huge. Who's idling? You know, where can you save gas on idling? Where can you save employee time from having to find these vehicles? How do you have them positioned? This is all stuff that can be saved where if you have,",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "all over this massive airport. Atlanta airport it's huge. Who's idling? You know, where can you save gas on idling? Where can you save employee time from having to find these vehicles? How do you have them positioned? This is all stuff that can be saved where if you have, you know, proper tracking on all these vehicles and usage and then you have like an AI brain to say like, okay, well, you're idling too long here. Like why don't you switch to like a generator instead of jet fuel for that one hour that you know, like that could be saved money. And so there's going to be these small upsides that are 10 billion dollar market caps that solve these great problems and make everyone's life better and they go from 10 to 50 billion. And that to me that's that's my my interest. That's what peaks my interest like that part of the stock market landscape. Yeah, well, it's also a really cool way to learn about technology and stuff, right? Like specifically AI. It's I'm similar to you in your thought process. My specific curiosity is whether or not we'll see like a couple bigger AI names like not existing names, not in video, but startups or kind of things that pivot in a AI that start to become, you know, the apple of AI or something like that because it seems like those kinds of markets are fascinating because it's very new. There's just",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "AI names like not existing names, not in video, but startups or kind of things that pivot in a AI that start to become, you know, the apple of AI or something like that because it seems like those kinds of markets are fascinating because it's very new. There's just a ton of opportunity in front of it. There's already widespread integration efforts. So I'm really looking forward to seeing the way that companies go to market and how competitive that gets because I imagine it's going to be there'll be enough for everybody to eat, but I'm imagining that there's going to be a couple companies that get it really right and start to dominate. Well, you know, think about it. I think a recent history like Google's not that old. I mean like, you know, it's two guys in an apartment. They created a better algorithm for search. And I mean, they're one of the biggest companies in the world like and it didn't take them very long like with technology stuff scales so quickly. So yeah, like Google Microsoft, they have huge team smart guys like untold resources, but there's always going to be some people out there that they're going to build a better mouth trap somehow. And like, you know, I know like data is important, but there's ways to get data. Look at, look at chat GPT and open AI. I mean, they did who was open AI three, four years ago, right? And",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "there that they're going to build a better mouth trap somehow. And like, you know, I know like data is important, but there's ways to get data. Look at, look at chat GPT and open AI. I mean, they did who was open AI three, four years ago, right? And suddenly they're the fastest scaling business ever in history from I think to 100 million users. So like perfect case in point, like there's so many of those that are going to come out and people also like look at companies as a company, you know, we've remembered people. So if you're let's say you're like this genius working or you're Elon Musk, like is Elon Musk working for Google? No, he's so smart. He went out on his own and he did his own thing. So there's going to be people who are at Microsoft or at Google saying like, yeah, I make like a, I don't know, a million dollar salary because they need me, but if I would like do this upstart and I can get funding because everyone knows me and I can bring that upstart to like a nine billion dollar valuation. Like I'll make 500 million dollars instead of like five million dollars and the next five. So these guys leave these big shops and they start new and that that's how this this rotation always happens because eventually all this talent doesn't want a salary. Like I mean, it's hard to like, I",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "500 million dollars instead of like five million dollars and the next five. So these guys leave these big shops and they start new and that that's how this this rotation always happens because eventually all this talent doesn't want a salary. Like I mean, it's hard to like, I mean, Google's not going to start paying guys 50 million dollars a year, right? That's what the CEO makes or not even. So these guys eventually say, like, look, why why why stay here? Go start my own thing and then it just gives birth to these new cut. And that's what I love. Like that's what that's really what gets me excited about growth investing. It's not just about the stocks and the patterns and momentum. It's like understanding this kind of stuff. You know, it's that's where all the wealth comes from. Well, it's really fascinating way to analyze the world around us. That's one of the things I love about the stock market is whenever I'm learning about different things, in my opinion, you get one of the most unbiased perspectives possible. Whereas if you pull up one of the other news agencies and read about whatever, there's always just a ton of skew, right? Based on whoever's producing that content. Yeah, when it comes to the markets, it's you already know this skew. How does this supply of money? Like where's the finance here? Where's the opportunity? And I actually love that about markets. When you",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "there's always just a ton of skew, right? Based on whoever's producing that content. Yeah, when it comes to the markets, it's you already know this skew. How does this supply of money? Like where's the finance here? Where's the opportunity? And I actually love that about markets. When you think about AI, I'm curious your thoughts on kind of this specific section of it. To me, it seems in order to really dominate that landscape, there has to be pretty serious infrastructure. Like pretty serious infrastructure in order to support it. Do you think that that would lead to one, the birth of a new supporting infrastructure business as well? And do you view something like that performing in line as AI expands? Do you think about that at all? I think, yeah, I mean, part of the play, if you look at SMCI, which Supermicro computer, like they had a big year because they're like part of the infrastructure play. But if you look right now, I would compare where we are now as early internet, where like now we take for granted that there's ethernet cables everywhere. And that's why you have fast internet in your house, but someone like had to lay those physical cables down for you to have this internet. So guys like Nvidia, Microsoft with their cloud, which they just reported tonight and they beat on the cloud, or like, you know, Amazon with their Amazon Web Services, that's the ethernet of the",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "but someone like had to lay those physical cables down for you to have this internet. So guys like Nvidia, Microsoft with their cloud, which they just reported tonight and they beat on the cloud, or like, you know, Amazon with their Amazon Web Services, that's the ethernet of the current era. So same with the internet, the first big bull markets were infrastructure guys. And then after it went to people who implemented that kind of stuff. So Nvidia, I mean, they're chips. They're not really AI. They're giving the stuff to people to do AI. So I think we see it, but I think they're already really big and there's probably going to be growth. That's why the Nasdaq is strong. But the big money, I think that the real surprising stuff is that people, the smart guys, where they say, how do I take this and like create something new? And even with existing companies, I think you can see like a stair step higher in earnings because you can be XYZ company. And you're not an AI company, but just like every company uses the internet today and they create like new, you know, they run more efficiently. Like imagine if companies today had the same number of employees and the same kind of cost, they did everything physical. I mean, they'll be like astronomical. Like you wouldn't have the valuations or the stuff we have today. So people are going to get leaner, meaner, faster,",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "more efficiently. Like imagine if companies today had the same number of employees and the same kind of cost, they did everything physical. I mean, they'll be like astronomical. Like you wouldn't have the valuations or the stuff we have today. So people are going to get leaner, meaner, faster, better, more efficient. And you'll see earnings grow. That's why I think the 90s, yeah, at the end, it became a bubble for tech. But like the market and even way before the bubble hit was flying because like the internet made everything like earnings better for everybody. Everything became more and more efficient and faster and better. And earnings grew. So that's why capitalism and like free markets, like never mind the profits it brings to people. Like it makes everybody's life better. I guess it's the system like you need to have that exists in the world. Anything else is you can end up with a a worse off society in my opinion. Clearly, I mean, it's one of the few things that like really incentivizes innovation. And yeah, even really big players out there, you can still to your point compete with them and still to really fucking incredible. It's incredible. Think about it. Yeah, it's incredible. It's an incredible system to have in place where you can have these like galayettes and they're still someone's gonna come up and take them down. It's it's it's incredible. Speaking of taking them down, I know we're coming up",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "fucking incredible. It's incredible. Think about it. Yeah, it's incredible. It's an incredible system to have in place where you can have these like galayettes and they're still someone's gonna come up and take them down. It's it's it's incredible. Speaking of taking them down, I know we're coming up on time, but I cannot not get your take on this when the Fed starts its pivot. What do you think happens to the market? And I specifically want to ask you this because I know that you've looked at and only imagine all of the historical references that we have for this kind of action. And I have as well out of sheer curiosity, but I know that you have a much wider breadth of understanding of these things. So yeah, I'd love your take on that. So I'm gonna give the ridiculous answer and say like we can go up a lot or we can go down a lot. You know, but I'm gonna explain that I think it's likely that we go up a lot. And people can you know, I've had this conversation with super good friend of mine retreat with things like it says you know like Maddie in 2008, it's when the Fed started cutting rates at things went bad because they saw the economy was unraveling. But if you if you go back to me, there's two different errors. There's there's errors with inflation and there's errors without inflation. So if you look",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "know like Maddie in 2008, it's when the Fed started cutting rates at things went bad because they saw the economy was unraveling. But if you if you go back to me, there's two different errors. There's there's errors with inflation and there's errors without inflation. So if you look at the inflation errors, which is like the 70s until like 82, inflation caused these bear markets. Inflation came in the fed at the hike rates and that crushed the economy. If you look at the bottoms of like 74, 78, 82, they always bottomed when rates start to come down because if Fed was start to cut rates when inflation was easing. So the problem of that time was over. If you look at 2008, for example, the Fed started cutting rates because they broke everything and because everything was imploding. So the problem was not inflation. Like the problem was like, oh my goodness, like the economy is like seizing up. So the cutting of rates was like a different. They weren't cutting rates because things were improving. They were cutting rates as things were getting much worse. So my view is that we're coming at this inflationary period. And that's why if you look yesterday, I know Bill Ackman put that tweet saying that I don't know if you saw it where he says, you know, I was short bonds, but there's too much risk in the world to be short bonds. So as soon as he",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "period. And that's why if you look yesterday, I know Bill Ackman put that tweet saying that I don't know if you saw it where he says, you know, I was short bonds, but there's too much risk in the world to be short bonds. So as soon as he said that, the bond market leaped. But like to me, that was a tell of the market. Because when the bond market leaped and yields came down, the market also went up. So I think the market's looking for that point and time where inflation is over. Yeah, the economy's not great. But I think once inflation is fully dead and rates start to come down, the stock markets are going to be saying, okay, the economy's not great, but inflation was our problem. If rates can come down, the economy's going to come back. The economy is not broken. So that's why I think likely we take off what would break what would break that what would make that knock on true? Like the smaller probability scenario, well, there's a lot of debt out there and rates have gone from zero to high very quickly. So if the Fed over cooks it, like if they look at too much lagging data and they wait so long to cut rates that the economy does start to seize up, then after now they have to actually save the economy because they broke it. So like I think they have the opportunity",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "over cooks it, like if they look at too much lagging data and they wait so long to cut rates that the economy does start to seize up, then after now they have to actually save the economy because they broke it. So like I think they have the opportunity here to like soft land it. And if they're not too stubborn and you know, they're not just, you know, I hope they're just like talking tough to kind of keep things going the way they want it to go. But if they react in time as inflation easing to start to cut, I think we enter a nice bull market. But if they really get stubborn and like draw it out too long and things start to implode, then I think we can get a little we can get downside with the first cut. But I'm saying it's a nine out of 10 chance that we rally when rate cuts start. A couple data points before I let you go again, just to amplify the conversation around this. I'm looking out at just bond pricing and subsequent probabilities of rate changes. Right now for one know, the overwhelming probability is no change. 13Ds, no change with a 25 chance of a hike. Going to 31 Jan, it goes to a 35 chance of a hike. 20 March 31 chance of a hike. And then it doesn't really show the first majority probability of an ease until 12 June 24.",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "is no change. 13Ds, no change with a 25 chance of a hike. Going to 31 Jan, it goes to a 35 chance of a hike. 20 March 31 chance of a hike. And then it doesn't really show the first majority probability of an ease until 12 June 24. And that's only a 53 probability of an ease. You know, but I think that can change because even this year, if you if you remember, when we were earlier in the year, they were pricing cuts already for like right now, you know, and that's not like that's not the case. Now they're actually like you said, you know, 35 chance of a hike. So that can change. Like I really think like the inflation battle is one like like all we have to do is wait around like the trend of inflation is coming down. If you look at like I think you know, shelter, I think it's like 70 of like core inflation, which is the problem. And if you look at more real time readings, I mean, they're showing like 2 inflation or lower. So I think it's just like a waiting game. It's just that you don't want the economy to blow up until the data comes in, but we're going in the right direction. Like inflation is no longer accelerating. It's coming down. It's coming down. So that's why I'm optimistic. Like some people will say, God, the economy's just about to go off",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "you don't want the economy to blow up until the data comes in, but we're going in the right direction. Like inflation is no longer accelerating. It's coming down. It's coming down. So that's why I'm optimistic. Like some people will say, God, the economy's just about to go off a cliff and you know, this bear mark is just getting started. I don't think so. Like first of all, that goes back to how the big cap tech have skewed the NASDAQ because it's the safety trade. If you look at the average stock, small caps or whatever mid caps, like it's they're not going on like over two years of a bear market. Like this is not early. If we get one more flush down, if we even get that and and you know, inflation starts to come in 3, sub 3, I think we start to like I think we're like, if this is a baseball game, we're like in the seventh or eighth inning of this bear market, I think. Interesting. It's also curious to hear when folks like you, I know Jim also feels the same. What do you guys use for your reference period for the bear market? So for me, well, I think the general market top November 21, growth top February 21. So I mean, growth is a subset, but the general market, I think did have that last little push into the end of 21, but stocks really didn't do much",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "for the bear market? So for me, well, I think the general market top November 21, growth top February 21. So I mean, growth is a subset, but the general market, I think did have that last little push into the end of 21, but stocks really didn't do much from the peak of February to the end of the year, but that I counted from growth is going to be almost three years of bear market general stocks. It's about two years. Got it. Okay. Yeah. And it's that I think your hypothesis on this is really interesting because I agree with you on kind of the overall tenor of inflation. I find it interesting where we're still seeing pretty sticky inflation in other measures. So like fuel, food, like some of those things are still pretty awful for people. Part this out. What do you see going into the end of the year? Do you think that there will be any significant catalysts that you're looking forward to seeing the outcome of or do you think it's kind of business as usual? We'll see information as we get it. Yeah, I think I think we'll see as we get it. I think we'll get more downside person. I'm actually I mean, I never want to see anyone suffer things to go bad, but from a stock market perspective, like if we got good downside from here, I think that would be enough to kind of put an end",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "get it. I think we'll get more downside person. I'm actually I mean, I never want to see anyone suffer things to go bad, but from a stock market perspective, like if we got good downside from here, I think that would be enough to kind of put an end to all of this would rip the bandaid off. And the Fed would then start to say like, oh, we have to start balancing the risk of the economy with inflation because the Fed's the market's breaking. If you look at 2018, Powell was talking tough. The Nasak fell 20 and he flipped. So they do watch markets. So I think there's pressure on the market now because the Fed's been talking tough. And even like if you look last week, he was talking even tough regarding the longer term yield. So he's really putting the pressure on and stocks are starting to buckle. So that's why I think it's going to happen. But I would I would always remind people because it's easy. It's super easy to get negative. You know, when things look bad, but like if take a second and look at every bear market bottom, it's always awful. You're never going to get a good feeling market bottom. So if you go by what you feel or what your friends tell you or seeing someone close in their business or what the news is saying, you're never going to buy stocks like in size at the",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "always awful. You're never going to get a good feeling market bottom. So if you go by what you feel or what your friends tell you or seeing someone close in their business or what the news is saying, you're never going to buy stocks like in size at the right time. So like I mean, you should be expecting to be buying stocks when everything looks terrible. Like I mean, some of my good years was like, you know, I started training pro and oh, eight. And like it was financial crisis. Like the bull market started March of 2009. I mean, the economy was going off a cliff. Like companies were banks were failing everything. Like think of COVID. Like we had an amazing bull market. The world was shut down bang. We go vertical. So it's like the good stuff comes out of the bad stuff. You know, so it's like I expect more downside. But like I'm looking at it from like an I always try it takes a mental process like a specific process to keep yourself optimistic when things are negative. But you really have to because it's so easy to fall into that sense of like, off things are bad. What was me bad economy? Things can't go up. And then bang, you miss like the best opportunity and everything runs. Massive massive advice. And I think when people get into that to that mindset, I always remind them like zoom out, like",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "sense of like, off things are bad. What was me bad economy? Things can't go up. And then bang, you miss like the best opportunity and everything runs. Massive massive advice. And I think when people get into that to that mindset, I always remind them like zoom out, like zoom the chart out, zoom whatever you're looking at out because they're to your point. Always periods where things look awful. But I've never seen US indices not make new highs. But you know, for me, like I know from personal experience. I won't I know we're going late. I won't go long. But like when I was a market making and pro trading on the desk like being in Canada, we had a lot of the gold stocks, oil stocks and all that. So like I really got to know the gold industry very well. These commodity industries. And the gold industry is like, you know, tends to be built on like things are going to be bad. It's a store of wealth and all that. And at the time, I think it was Ron Paul was running as a Republican nominee. And he's all about hard money. And they have really, I mean, again, if you like monetary history, you know, the US is to be backed by gold and all this. And so Peter Schiff had really nailed like the old nine like financial crisis. And I was listening to his podcast. And it's so easy to",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "they have really, I mean, again, if you like monetary history, you know, the US is to be backed by gold and all this. And so Peter Schiff had really nailed like the old nine like financial crisis. And I was listening to his podcast. And it's so easy to fall. That's like negative thing of like all look at these politicians. They're bad. And these people, it's so easy to fall into that. And I remember I had missed like a really big market leg up because I had this like frozen negative bias. And like it's like it came like one day, I'm like, what am I doing? Like I mean, like it's like you're saying like you're looking at the date in front of you going up. And it's like you're just telling yourself like, no, it's bad. It's bad. It's bad. And I remember promising myself, I would never do that again to myself. Like one, we came out of World War two. I mean, as bad as things look, things were a lot, a lot worse other times in history. You know, so like look to the good as much as possible, but protect yourself when the data says it's a bad time. That's that's my perspective. Or or great options and you trade all the stuff. There's that too. There's always that option, the option of options. Well, Matt, honestly, man, I'm stoked. I love catching up with you. It's always elucidating for me,",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  },
  {
    "text": "when the data says it's a bad time. That's that's my perspective. Or or great options and you trade all the stuff. There's that too. There's always that option, the option of options. Well, Matt, honestly, man, I'm stoked. I love catching up with you. It's always elucidating for me, tying into a little bit of your thought process, your perspective. So thanks for hanging out, man. Where can people find you? Most of my folks know you're ready, but just in case. So there's a Corusso Insights.com. I'm also on, I'm trying to be a little more active on YouTube, so you can look me up, Matt Corusso or Corusso Insights on YouTube. And of course, Twitter is my main place where I chat. So it's at Trader underscore M Corusso. Awesome, brother. Thank you. I'll throw all those links in the notes below. Thank you for hanging out. We'll catch you another time for everybody else. Don't forget being outlier. We'll see you guys.",
    "metadata": {
      "video_id": "iCPgZN_UxQw",
      "title": "Finding the NEXT Market Leaders - Matt Carusso | The Outlier Podcast Ep 52",
      "url": "https://www.youtube.com/watch?v=iCPgZN_UxQw",
      "upload_date": "",
      "duration": 3769.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iCPgZN_UxQw&t=0"
    }
  }
]