[
  {
    "video_id": "IE8hUnhYeP8",
    "title": "4 Common Mistakes to Avoid AFTER Placing an Options Trade",
    "text": "What's up, Alias? Let's talk about four critical mistakes to avoid after you place an options trade. The ironic thing about trading is most of the work is done before you place a trade, but a lot of people then might have something that's good, good idea, good trade, and then they mess it up. The goal of this video is to walk you through four of the absolute most common circumstances that I see happen with this. The very first one is setting P&L management, which you'll get a sense of why that one's on here in a second. Next is over emphasizing individual trades. Third is focusing only on realized, which again I'll explain all of these with examples, and then a hyperactive management. That one's probably the easiest to get. In the context of setting P&L management, the reality is that should unequivocally be done before you enter the trade every single time period. If you are doing that, when you are in the trade, you're a day late dollar short. And like I said, I have specific examples for each of these, so I'm just giving you an overview and then we'll double click. Next we have the individual trade concept, which is the being of my existence, because it's very, very difficult to explain this concept to traders in a way that makes sense until they're ready to hear it. We will explain more about that in a moment. The next one in terms of",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 89.16,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=IE8hUnhYeP8",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IE8hUnhYeP8&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 841.0
  },
  {
    "video_id": "IE8hUnhYeP8",
    "title": "4 Common Mistakes to Avoid AFTER Placing an Options Trade",
    "text": "have the individual trade concept, which is the being of my existence, because it's very, very difficult to explain this concept to traders in a way that makes sense until they're ready to hear it. We will explain more about that in a moment. The next one in terms of realized, there's a big gap sometimes between what your idea was, what ends up happening separate from the outcome of the trade. What this means is you could lose money, but had the right idea, or you can make money with the wrong idea, and there's some really key downsides to that. And the last one is, exactly what it sounds like, is just getting too involved. Let's take a look at some examples, P&L management. This is hilarious, because I cannot tell you how many posts I've seen, how many times I've had people reach out to me, asking what they should do in a trade that they're already in. The reality is this goes into what I've saying at the beginning, the work is done before you enter. When you enter a trade, when you finally click the button, that genuinely should be the easiest part of the transaction going forward if you do a good job. And the reason for that is because all of the work and all of the research should be done already. And if it's not, then yeah, you're gonna be in for a little bit of a bumpy ride. So the simplest",
    "start_timestamp_seconds": 73.04,
    "end_timestamp_seconds": 164.24,
    "start_timestamp": "01:13",
    "video_url": "https://www.youtube.com/watch?v=IE8hUnhYeP8",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IE8hUnhYeP8&t=73",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 841.0
  },
  {
    "video_id": "IE8hUnhYeP8",
    "title": "4 Common Mistakes to Avoid AFTER Placing an Options Trade",
    "text": "transaction going forward if you do a good job. And the reason for that is because all of the work and all of the research should be done already. And if it's not, then yeah, you're gonna be in for a little bit of a bumpy ride. So the simplest solution to this one to avoid this, every single time is before you enter a trade, you have some ideas in terms of where you're gonna manage your P&L. This doesn't have to be hyper-specific. So for example, if we look in O&DS, literally just because it's up, let's say that you entered long calls here. That doesn't mean that you have to pick a specific price. I'm gonna get out when it hits nine. More often than not, that actually makes absolutely no sense, based on what the profit mechanism is and what you're attempting to capture. So let's say in this, you're trying to capture a breakout or really strong near-term momentum. Well, if you bought those calls and this thing did this move, then it starts rolling over like this. This actually bleeds into one of the other mistakes that we're gonna talk about in a second. But let's instead say that you were using the 10 day moving average and your game plan was to manage your position based on a close below the 10 day moving average to take advantage of the short-term trend. Well, that keeps you in the trade, even though it goes",
    "start_timestamp_seconds": 141.32,
    "end_timestamp_seconds": 231.24,
    "start_timestamp": "02:21",
    "video_url": "https://www.youtube.com/watch?v=IE8hUnhYeP8",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IE8hUnhYeP8&t=141",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 841.0
  },
  {
    "video_id": "IE8hUnhYeP8",
    "title": "4 Common Mistakes to Avoid AFTER Placing an Options Trade",
    "text": "But let's instead say that you were using the 10 day moving average and your game plan was to manage your position based on a close below the 10 day moving average to take advantage of the short-term trend. Well, that keeps you in the trade, even though it goes through this bit of a drawback and even though now it's continuing to make money, the point is you don't have to pick a specific price. But you do need to identify spots where whatever your profit mechanism is is determined to be wrong. That's how you know when it's time to get out, both to the upside and to the downside because at some point, the momentum will slow down and the underlying will close below the 10 day MA. That's when the trade has ran its course and it's time to move on to something else. Okay, let's move on. Next up, over emphasizing the individual trade and for those keeping track at home, this is funny to be number two again, it's not. I'm just referring to an older video that I did where this just happened to come in as the second point twice. But let's talk about this as a concept and what it boils down to, your performance as a trader is going to come down not after an individual trade, 10 trades, 100 trades. If you're doing this successfully for a career or for your primary income source or even as a secondary",
    "start_timestamp_seconds": 214.84,
    "end_timestamp_seconds": 310.24,
    "start_timestamp": "03:34",
    "video_url": "https://www.youtube.com/watch?v=IE8hUnhYeP8",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IE8hUnhYeP8&t=214",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 841.0
  },
  {
    "video_id": "IE8hUnhYeP8",
    "title": "4 Common Mistakes to Avoid AFTER Placing an Options Trade",
    "text": "talk about this as a concept and what it boils down to, your performance as a trader is going to come down not after an individual trade, 10 trades, 100 trades. If you're doing this successfully for a career or for your primary income source or even as a secondary income source, it is going to be done over thousands of trades, over hopefully decades. What that means is getting good feedback on what you're doing is more important than making money on any one individual trade. I know that might sound weird, but I'll explain it using this exact example we're just talking about. Let's say that your strategy called for going long here with the expectation of more this style movement, right? So this big massive green candle and then like a couple days trickling up on gaps. If this was your expectation and this is what you got, you were wrong. Even though if you bought those calls, let's say down here and let's say that you didn't sell during this or this, you're making money. But in that approach, you're making money for the wrong reasons. Now sometimes that can be okay, but as far as a feedback mechanism, as you're going through an analyzing what you're doing, how your strategies perform to then make decisions going forward, you now have a bad data point unless you accurately identify that, yeah, this one made money, but it's not for the right reason. It made money just",
    "start_timestamp_seconds": 290.44,
    "end_timestamp_seconds": 389.36,
    "start_timestamp": "04:50",
    "video_url": "https://www.youtube.com/watch?v=IE8hUnhYeP8",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IE8hUnhYeP8&t=290",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 841.0
  },
  {
    "video_id": "IE8hUnhYeP8",
    "title": "4 Common Mistakes to Avoid AFTER Placing an Options Trade",
    "text": "a feedback mechanism, as you're going through an analyzing what you're doing, how your strategies perform to then make decisions going forward, you now have a bad data point unless you accurately identify that, yeah, this one made money, but it's not for the right reason. It made money just because it happened to go up in a different way than I expected. This is really important to drill down and really nebulous to new traders because most new traders are just like, well, shit, I'm just happy to make money. Or like this person that's like, oh, I just wanna fix this one call and Disney because I don't wanna lose money on it. So here's some ways that I can do it. The issue with that is over time, your performance is a trader is gonna approximate towards your systems. If you have bad systems with bad feedback loops over time, you're gonna lose money. You have to avoid that. Each individual trade serves as a sample in the data collection of a strategy. The Realize P&L is a buy product. You want that Realize P&L to be positive long-term, but you also wanna know if what your strategy is doesn't work. So that then you can pivot and go do something else that's better. It saves you a ton of ways to time effort energy. This dovetails off of exactly what we were just talking about. Now, to build on this a little bit, when you're collecting",
    "start_timestamp_seconds": 369.04,
    "end_timestamp_seconds": 470.0,
    "start_timestamp": "06:09",
    "video_url": "https://www.youtube.com/watch?v=IE8hUnhYeP8",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IE8hUnhYeP8&t=369",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 841.0
  },
  {
    "video_id": "IE8hUnhYeP8",
    "title": "4 Common Mistakes to Avoid AFTER Placing an Options Trade",
    "text": "strategy is doesn't work. So that then you can pivot and go do something else that's better. It saves you a ton of ways to time effort energy. This dovetails off of exactly what we were just talking about. Now, to build on this a little bit, when you're collecting your data samples in terms of your P&L, you wanna pay really close attention to what happened against your thesis versus the Realize Move. So a great way to do that is actually to in your trade log have a section that's relative to signals, right? And you should make it really easy to run data analysis on in terms of the inputs. But if you do that, then you'll be able to generate good feedback separate from the P&L. Because your P&L is not the only feedback that matters. It's the one that we ultimately prioritize for sure. But in short-term timeframes, it can be really, really misleading. This is also really common in the world of selling when volatility is high. What traders will do is to look at something like O&DS, and let's just pretend that the implied volatility percentile was really high, right now it's only 38. But let's say that it was really high. A lot of times, traders will say, oh, the implied volatility percentile is really high, and they'll sell vol. However, they're just, let's say, selling puts. A lot of times, they might make money, but if we actually looked at what",
    "start_timestamp_seconds": 444.2,
    "end_timestamp_seconds": 547.48,
    "start_timestamp": "07:24",
    "video_url": "https://www.youtube.com/watch?v=IE8hUnhYeP8",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IE8hUnhYeP8&t=444",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 841.0
  },
  {
    "video_id": "IE8hUnhYeP8",
    "title": "4 Common Mistakes to Avoid AFTER Placing an Options Trade",
    "text": "38. But let's say that it was really high. A lot of times, traders will say, oh, the implied volatility percentile is really high, and they'll sell vol. However, they're just, let's say, selling puts. A lot of times, they might make money, but if we actually looked at what happened to volatility, it might not have actually changed that much. And they might have just made money because the underlying went up. So again, what is that give them if they're just looking at their P&L? They're saying like, oh, this idea made money. But again, as far as their ability to detect and capture high implied volatility, this did not give them any good feedback on their ability to do that. So then as they try to do that more and more times in the future, again, their performance is gonna start to suck. The last thing, this one is really straightforward. But there's two pieces to hyperactive management. The first one is the cost. Everybody knows that there's commissions. One of the simplest things you should do is track your commissions relative to the average trade P&L. So what that means is, look at your year-to-date performance. Then just take a look at what the average P&L of that is per trade. Then take a look at your commissions relative to that. This will give you a ton of context. And I'll give you a quick example. Just made a little table for you guys. Let's say",
    "start_timestamp_seconds": 526.48,
    "end_timestamp_seconds": 628.72,
    "start_timestamp": "08:46",
    "video_url": "https://www.youtube.com/watch?v=IE8hUnhYeP8",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IE8hUnhYeP8&t=526",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 841.0
  },
  {
    "video_id": "IE8hUnhYeP8",
    "title": "4 Common Mistakes to Avoid AFTER Placing an Options Trade",
    "text": "Then just take a look at what the average P&L of that is per trade. Then take a look at your commissions relative to that. This will give you a ton of context. And I'll give you a quick example. Just made a little table for you guys. Let's say that you made $250,000. And let's say that your commissions are 25 cents per option. Let's say that you have two scenarios, a trader that made that $250,000 over a thousand trades or a trader that did it with $10,000. Think of the $10,000 being the kind of trader that might be doing intraday scalping where they're having multiples of trades on an individual day typically low average P&L per trade. You can see that represented here. If we take a look at what their total commissions are relative, the $1,000 trades is at $250,000. The $10,000 is at $2,500. If we take a look at the commission to your P&L, this first trader is experiencing about 25% friction commission total per trade. This isn't an apples to apples comparison because this is comparing your total commissions against individual trades. Don't necessarily want to take that too literally. This is designed though to give you context in terms of what your commission's look like in total against your individual trade basis. Because something like this would immediately inform me that we are doing way too much and not getting enough on a per trade basis in terms of the total",
    "start_timestamp_seconds": 611.4,
    "end_timestamp_seconds": 711.24,
    "start_timestamp": "10:11",
    "video_url": "https://www.youtube.com/watch?v=IE8hUnhYeP8",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IE8hUnhYeP8&t=611",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 841.0
  },
  {
    "video_id": "IE8hUnhYeP8",
    "title": "4 Common Mistakes to Avoid AFTER Placing an Options Trade",
    "text": "designed though to give you context in terms of what your commission's look like in total against your individual trade basis. Because something like this would immediately inform me that we are doing way too much and not getting enough on a per trade basis in terms of the total friction induced. Now again, you could do this on a per trade basis. That's also completely fine and that's more of a like comparison. This just blows out the numbers a little bit so that you can identify hopefully inefficiencies when you carry this down to individual strategies. Because the next question is taking this total commission but then not doing it necessarily per trade but per strategy, that's really where you want to get. But this is a good starting point to help identify some of those inefficiencies. The last piece of this is you make doing what you did a nightmare going forward, replicating this hyperactive management. So let's say in the case of this call for this person that owned Disney and with this short call that they sold, could they navigate so that that short call ends up and ends up out of the money, they get to keep their premium and they get to get the keep their stock. Sure, that's definitely doable. But what does that teach them about their strategy long term and their way that they're selling calls not very much? Now I'm not saying you shouldn't do what you need to",
    "start_timestamp_seconds": 691.92,
    "end_timestamp_seconds": 790.92,
    "start_timestamp": "11:31",
    "video_url": "https://www.youtube.com/watch?v=IE8hUnhYeP8",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IE8hUnhYeP8&t=691",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 841.0
  },
  {
    "video_id": "IE8hUnhYeP8",
    "title": "4 Common Mistakes to Avoid AFTER Placing an Options Trade",
    "text": "get to keep their premium and they get to get the keep their stock. Sure, that's definitely doable. But what does that teach them about their strategy long term and their way that they're selling calls not very much? Now I'm not saying you shouldn't do what you need to do to manage an individual trade you should. But you should always think about it in the context of how can I use this as a data point to make what I'm doing more efficient, better, over, longer, durations. So in this scenario that I outlined, the traders ability to replicate that with this specific strategy against that specific profit mechanism is really low. So then all of this ties together because if you notice a lot of volatility in your P&L, meaning each month you're kind of all over the place, it's because of shit like this. If you can dial this in, your P&L volatility will come in a lot and that leads to smoother sailing more profitability. Be an outlier, see you later.",
    "start_timestamp_seconds": 776.32,
    "end_timestamp_seconds": 839.16,
    "start_timestamp": "12:56",
    "video_url": "https://www.youtube.com/watch?v=IE8hUnhYeP8",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IE8hUnhYeP8&t=776",
    "chunk_index": 10,
    "word_count": 176,
    "upload_date": null,
    "duration": 841.0
  }
]