[
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 16,
    "text": "Hey everyone, Eric here. The next car chat segment is more or less directed towards kind of the younger investors, but I really do think it applies to everybody anyways, but nonetheless, it really is something that as I reflect on it, it's stuff that I wish I thought about a little bit more when I was starting off. For those of you that don't know, I started investing pretty young and that's a great thing. It gives you more time, more exposure to the market. All of that is good stuff. Now, one of the things that people don't widely talk about is some of the downsides of starting early and I found that, honestly, there's a lot of them. It's not as easy as just start young and then you'll be good, you'll benefit. It's just not how it works, especially if you want to be an active investor. If you're a passive investor, I can see that. But if you're actively investing, it's really not so much the case and it's important to kind of understand that. I say that because not everybody is dramatic. Most folks who are financially savvy will encourage people to invest and start young. Good, that's a good start. The problem with it is without good direction, that early start can just perpetually set you back and that's the bad part of it. A lot of younger traders do not think through what they're doing and essentially they just start losing money.",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=0"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 16,
    "text": "start young. Good, that's a good start. The problem with it is without good direction, that early start can just perpetually set you back and that's the bad part of it. A lot of younger traders do not think through what they're doing and essentially they just start losing money. When you lose money early on, you're really starting to take your future wealth away from yourself and losing some money is natural. It's going to happen to anybody who's starting to invest. But there's got to be a line in the sand somewhere where you realize that you're being counterproductive. I wanted to run through a couple things that really, I guess I would call it, it fights to myself if I were to sit my younger self down that's first starting and really, I guess that would apply to other folks who are younger. When I started at 17, the very first thing that I would tell myself is learn to take paper trading seriously. I know that it's a pain point for a lot of folks. It's very difficult to take paper trading seriously for this reason or that reason. When I look back at it, if you can't find the discipline to take paper trading seriously, you're going to have a hard time with most of this shit. That's one of the very first things I would tell myself is learn to take paper trading seriously because the only thing it's going to do is save",
    "start_timestamp_seconds": 75.48,
    "start_timestamp": "00:01:15",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=75"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 3,
    "total_chunks": 16,
    "text": "you can't find the discipline to take paper trading seriously, you're going to have a hard time with most of this shit. That's one of the very first things I would tell myself is learn to take paper trading seriously because the only thing it's going to do is save you money. It will allow you to get most of the big kinks out of your approach without you having a fucking pay for them. To me, that's really big. That's an important fucking thing because especially when we're starting, most of us have limited capital and you really can't afford to just kind of piss it away. That's the very first thing. Learn to take paper trading seriously. The next piece of advice that I would give myself is one that I actually reiterate pretty frequently and it's that the money I am trading with is not going to be the source of my future wealth. That's something I completely missed the fucking train on. I don't know. I guess that I thought that I was going to be able to aggressively grow that money to start drawing on it and it's just not the fucking case. What I wish I would have told myself or what I would tell myself is the money that you're going to truly benefit from is stuff that you're not going to see it until you're 25, 30 and even that's young. I'm really fortunate in that sense. But you get the point.",
    "start_timestamp_seconds": 163.24,
    "start_timestamp": "00:02:43",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=163"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 4,
    "total_chunks": 16,
    "text": "wish I would have told myself or what I would tell myself is the money that you're going to truly benefit from is stuff that you're not going to see it until you're 25, 30 and even that's young. I'm really fortunate in that sense. But you get the point. The fact is is the money that you're trading when you're first starting, that's not the money that's going to be your wealth. The focus should be developing a strategy that's consistent. Once you can maintain consistency, it means that you can control variables and then that's something that you can adapt and scale to become profitable. That's something that if I were to give myself one solid piece of input, that would be the one thing. It's stop trading that small account as if it's going to be your future wealth. Because you start focusing too much on dollar returns on the account as compared to good fundamentals that as you earn more money, as you spread into different business ventures and create more capital that you could then move to that account and deploy successfully. First thing, learn to take paper trading seriously. The second thing is to understand the context of the account and really what the strategy is. The next thing that I would absolutely tell myself, and this is one that I think everybody hears but they don't listen to you. I have a different message. The message would be the summary message, would be",
    "start_timestamp_seconds": 239.64,
    "start_timestamp": "00:03:59",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=239"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 5,
    "total_chunks": 16,
    "text": "understand the context of the account and really what the strategy is. The next thing that I would absolutely tell myself, and this is one that I think everybody hears but they don't listen to you. I have a different message. The message would be the summary message, would be learn patience. The job trying to rush this shit and the only thing that's happening in those scenarios is again, just setting myself back. What I would tell myself, obviously I would like to be able to tell myself that message but again, just self identifying, none of us can listen to that. It doesn't work. It just doesn't fucking connect. What I then would offer myself as a follow-up is at the very earliest, the account will start to develop some sort of meaningful value after I hit 25. The reason why I think that that's helpful is it just kind of puts the idea out of my mind that this is going to be wealth that I'm going to be using in my early 20s. Again, I continue to say this because it's true, 25 is still super fucking young. That's the earliest point that I started developing any sort of meaningful wealth and a lot of it is due to good circumstance. I wouldn't say that that's the norm. I'm not saying other folks can't do it but I just like to reiterate that message to level set because if that's the mark you put on it,",
    "start_timestamp_seconds": 319.08,
    "start_timestamp": "00:05:19",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=319"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 6,
    "total_chunks": 16,
    "text": "any sort of meaningful wealth and a lot of it is due to good circumstance. I wouldn't say that that's the norm. I'm not saying other folks can't do it but I just like to reiterate that message to level set because if that's the mark you put on it, you might be kind of upset when that doesn't happen. The third message is understand the timeline that the account really needs in order to do anything for you and that is if you're consistently successful. So that would be the third thing. The fourth thing that I would say to myself is one that I think I focus a lot more on it now as a trader but it's focus more on learning to manage risk as compared to pretty much anything else. When I look at the overall world and space of trading, I find that the thing that really separates traders that exist perpetually or can stay in the game long term is their relationship with risk and their ability to modulate it at different points in time to accomplish different things. I find that to be super important and definitely something that I would reiterate to myself really on because it's so easy to try to focus on finding that good trade or finding that next strategy, whatever the case is and all that stuff is good and important in and of itself but I really should have paid more attention to managing risk and I",
    "start_timestamp_seconds": 401.0,
    "start_timestamp": "00:06:41",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=401"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 7,
    "total_chunks": 16,
    "text": "myself really on because it's so easy to try to focus on finding that good trade or finding that next strategy, whatever the case is and all that stuff is good and important in and of itself but I really should have paid more attention to managing risk and I think that that would have done a good job for me to just limit the amount of capital wasted. So that's the next thing. The fifth thing I think I would tell myself and this is, I guess I kind of just recently started thinking about this one but it's the value of that external audit that I talk about. When I first met my mentor, I was kind of on the fence really of what I thought about him, how much I could trust him and that kind of stuff. So I was kind of keeping some of my cards a little close to my chest which I think is fine but what I found is even verbalizing my process with a friend who has a limited understanding of investing was still super helpful. By taking the time to verbally walk through what I was doing, it's something that we all kind of know exists but it really helps us a lot with really flushing through the details of the strategy. So that's something I think that I could have benefited from earlier and I guess that dovetails perfectly into the next thing is right up plan. Right up",
    "start_timestamp_seconds": 485.4,
    "start_timestamp": "00:08:05",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=485"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 8,
    "total_chunks": 16,
    "text": "we all kind of know exists but it really helps us a lot with really flushing through the details of the strategy. So that's something I think that I could have benefited from earlier and I guess that dovetails perfectly into the next thing is right up plan. Right up plan. I don't know what it is about investing in how few people really want to take the time to write a plan because I was one of them. I wanted to just trade and make money but the thing I would tell myself is that trading is one of those interesting things where anybody can start. If you have a tax ID number, so security number and a bank account that you can link to, you can start trading. It is a very select small subset of traders that are able to beat the market and let alone the component to be profitable, I guess I should have phrased that obviously. It's a small subset of traders that are profitable, that actively invest and it's even a smaller subset still that beat the market consistently. I think to me that's a really powerful message in terms of the amount of time and effort that it takes to actually get good at this craft. One of the things that I really would compare it to is the amount of effort that it took me to kind of groom myself to go the marine officer route, the physical component, the mental",
    "start_timestamp_seconds": 567.16,
    "start_timestamp": "00:09:27",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=567"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 9,
    "total_chunks": 16,
    "text": "of time and effort that it takes to actually get good at this craft. One of the things that I really would compare it to is the amount of effort that it took me to kind of groom myself to go the marine officer route, the physical component, the mental component, all of that stuff. I put in a lot of effort to be successful in those endeavors and when I first started trading I put a fraction of that effort into trading for some reason. I think it's because most people think you can start and just make money. It's not the case. I would tell myself that example. Essentially the amount of effort that I was putting in to groom myself to be a marine officer is I would almost say the baseline level of effort required in the investing game to be successful. I think that that lays a good context again for my younger, previous self. For those of you that haven't gone that route, that example may not make sense. I would also maybe liken it to if you're a D1F or something like that. Pretty much the amount of effort required to rise to the top of a pack in a competitive environment. That's a fairly suitable analogy. One of those things is putting in that planning, putting in that mental rigor and developing a written plan. I cannot overemphasize the value of that written plan enough because it forces you to come to",
    "start_timestamp_seconds": 642.56,
    "start_timestamp": "00:10:42",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=642"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 10,
    "total_chunks": 16,
    "text": "the top of a pack in a competitive environment. That's a fairly suitable analogy. One of those things is putting in that planning, putting in that mental rigor and developing a written plan. I cannot overemphasize the value of that written plan enough because it forces you to come to terms with what you're thinking on paper objectively and be able to answer your thought process. There's a lot of value in that for me. The next thing that I would tell myself is do not be a one trick pony, but be focused on these strategies and approaches that I take the time to learn. When I was first starting like a lot of folks, I was trying just a ton of strategies, just a ton of them. Airflies, calendars, vertical spreads, iron condors, short puts, like pretty much everything. A lot of that would have been better suited in a paper account. That's what I do now is when I'm testing a new strategy, I don't immediately go live with it. I'll do it in a paper account for a little while and see if I like it and can develop a good outline for it. For whatever reason, when I first started trading, I was doing all that shit live and pissing a lot of money away doing it was stupid. Carefully, I was really careful with size and I was very judicious in maintaining good size, so that was helpful. But otherwise, it was still generally",
    "start_timestamp_seconds": 718.36,
    "start_timestamp": "00:11:58",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=718"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 11,
    "total_chunks": 16,
    "text": "reason, when I first started trading, I was doing all that shit live and pissing a lot of money away doing it was stupid. Carefully, I was really careful with size and I was very judicious in maintaining good size, so that was helpful. But otherwise, it was still generally a wasted capital. That is another good note. You find yourself not focusing on size or risk allocation. It's something that's worthwhile. The last thing that I would say that I really would kind of tell my younger self is don't focus just on the investing markets, like stock markets. I found that a really key component to my ability to develop wealth at a relatively young age was spreading into other business ventures and you kind of come across different opportunities that way. The market is a really helpful way to continue to enhance your wealth. Like I said, if you're starting with a relatively small amount of money, it's probably not going to be your source of future wealth. I say that a lot. Some of the business ventures that I got into a little bit later in life that would have been helpful earlier, things like real estate. Obviously, that's tough to get into when you're super young, but the sooner you can get into stuff like that, I think it's helpful. Another thing, another general business venture that I think would be pretty wise to crack into is finding ways to turn hobbies into sources of",
    "start_timestamp_seconds": 805.0,
    "start_timestamp": "00:13:25",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=805"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 12,
    "total_chunks": 16,
    "text": "estate. Obviously, that's tough to get into when you're super young, but the sooner you can get into stuff like that, I think it's helpful. Another thing, another general business venture that I think would be pretty wise to crack into is finding ways to turn hobbies into sources of income. One of the things I used to do in college was by cars that were in disrepair and I would fix them. I would sell the fixed car and that actually was a pretty good source of money and one of the bigger producers of my wealth development early on. I would echo getting into things like that a little earlier. I felt like I took a while to get started on that because I was scared to take risk. I think that's where I would wrap this video up is do not be afraid to take risk. It can be scary, but if you don't risk anything or if you don't take good risk, there's a little return on whatever that is. I would tell myself, take good risk and when I talk about good risk, that's something that has good prospects of return, whatever it is. For example, those cars, I would avoid different cars that I didn't think would sell well. That would be bad risk and I'm thankful for doing that. Whatever version of that applies to whatever you get into, I think I would make sure to be comfortable and willing to take risk,",
    "start_timestamp_seconds": 889.32,
    "start_timestamp": "00:14:49",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=889"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 13,
    "total_chunks": 16,
    "text": "example, those cars, I would avoid different cars that I didn't think would sell well. That would be bad risk and I'm thankful for doing that. Whatever version of that applies to whatever you get into, I think I would make sure to be comfortable and willing to take risk, but make sure that it's calculated and it's good risk. If you take risk just for the sake of taking risk, sooner or later you're going to get caught in a shitty spot and you're just going to fucking lose money. It's like if you go to a casino, there are certain games that have worse or more even house odds, some of the better games, Blackjack, Crap's, stuff like that. Then there's some really, really shitty games, slot machines, the worst house odds you can find. I do like to gamble if I go to the casino, I'm not going to play the slot machine. I don't go to a casino to make money, really it's more for entertainment, but nonetheless I'm still going to pick something like Crap's that's enjoyable but not the worst odds, like that kind of thing. Make good risk. If you are too risk adverse, it's going to be hard to fucking make anything and if you are too reckless, you're going to lose everything you have. It really is about finding that balance and it's an unforgiving scale to try to develop. If you are unsuccessful in developing that balance, like I said,",
    "start_timestamp_seconds": 985.6,
    "start_timestamp": "00:16:25",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=985"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 14,
    "total_chunks": 16,
    "text": "adverse, it's going to be hard to fucking make anything and if you are too reckless, you're going to lose everything you have. It really is about finding that balance and it's an unforgiving scale to try to develop. If you are unsuccessful in developing that balance, like I said, you're either going to miss a lot of opportunity or you're going to start losing a bunch of money. If I were to skew my approach, it would be to be kind of less risky as compared to too risky. I say that because I generally am pretty conservative and what that means is, you know, like these people, like Bezos, Bezos, sorry, in Steve Jobs and Bill Gates, like these people who fucking like stop doing everything and put all of their resources into this idea that they have, I'm not sure that I have the intestinal fortitude for that. That's fucking scary to me and I feel really uncomfortable in those kind of scenarios. So that kind of risk where you're taking like a big fucking gamble but for a really big reward, it works for some people. But my general approach really isn't really like that. It's way more of these base hits until I can develop something a little bit more meaningful and that's just kind of a reflection on how I take risk. But spend some time to understand your risk profile and how you approach risk so that you can develop a good relationship",
    "start_timestamp_seconds": 1058.56,
    "start_timestamp": "00:17:38",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=1058"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 15,
    "total_chunks": 16,
    "text": "way more of these base hits until I can develop something a little bit more meaningful and that's just kind of a reflection on how I take risk. But spend some time to understand your risk profile and how you approach risk so that you can develop a good relationship with it early on. That's going to be important for your longevity and investing. So those are a handful of things that I would tell myself first starting out. I was actually thinking about turning this into a little bit of a mini series kind of, like a monologue with my younger self because I see a lot of young traders on Reddit and in the Discord groups I'm a part of and I just see so much of myself because we, most of us are very similar. If we're trading, there's a lot of similarities in what we're doing. And I think that we can seriously stand to learn so much from one another and kind of enhance the process. Looking back, I have been super fortunate in kind of the risk that I've taken and where I've been able to navigate myself to. And if I can impart some of that to folks so that they don't have to take the steps back that I did, fuck man, like you could be super fucking successful really early if you still benefit from the education side of things without having to pay for it. So that's really my goal",
    "start_timestamp_seconds": 1132.32,
    "start_timestamp": "00:18:52",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=1132"
  },
  {
    "video_id": "IFtkGhU5FjA",
    "title": "IFtkGhU5FjA",
    "url": "https://www.youtube.com/watch?v=IFtkGhU5FjA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 16,
    "total_chunks": 16,
    "text": "some of that to folks so that they don't have to take the steps back that I did, fuck man, like you could be super fucking successful really early if you still benefit from the education side of things without having to pay for it. So that's really my goal with this self monologue thing. But anyways, as always, let me know if there's anything that you want to see me talk about in particular, happy to do it. And I will catch everybody later.",
    "start_timestamp_seconds": 1202.6,
    "start_timestamp": "00:20:02",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=IFtkGhU5FjA&t=1202"
  }
]