[
  {
    "text": "So wall of red, a little bit of blood letting out there today. Let's talk about the market. I want to walk through high level overview of what this is and how to think about it. Because there are a lot of similarities with what I'm seeing driving this kind of sell off. As you can tell, a lot of these bigger boxes that happen to also be quite red fall within tech. So this does not surprise me. If we go over here to the NASDAQ to get a little closer and see what's happening, we had Google report their earnings and it wasn't as good as the market would have liked to have seen. They're losing ad revenue. It's slowing down. And things of that nature were getting this sense that potentially a lot of this AI craze might be slowing down a little bit. So if we take a look at Nvidia, you can see that they're definitely down over 6.8 today. So and it's still kind of hovering right around 1114. So what this tells me is not that the sky is crashing that the world is over. This just kind of tells me that things got priced a little frothy and now some of that is being blown off the top as people are taking some profits here. Now this is something to keep close eye on because these kinds of moves while not anything that's make me nervous yet, they can become something that",
    "metadata": {
      "video_id": "ILHEm19JYs8",
      "title": "QQQ, GOOG, & GME | Market Update",
      "url": "https://www.youtube.com/watch?v=ILHEm19JYs8",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ILHEm19JYs8&t=0"
    }
  },
  {
    "text": "got priced a little frothy and now some of that is being blown off the top as people are taking some profits here. Now this is something to keep close eye on because these kinds of moves while not anything that's make me nervous yet, they can become something that makes me nervous. So what I'm looking for is any sort of continuation, meaningful continuation to the downside. Because when I look across stuff like this down here, our net highs lows for a general breadth indicator, you can see that this doesn't look all that bad. We do see net highs. And within the NASDAQ, we are seeing a little bit of acceleration on gross lows and a little bit of deceleration in gross highs. But we're still maintaining that highs. So what this tells me is that there are a few names like Nvidia that are really leading this downward movement. And again, the market got so exuberant about trying to price an AI. This is one of the things that leads to opportunities in markets is that it's not a instantaneous ingestion of accurate pricing based on new information. So you can see that there's this big, big rally, essentially most of the year, if we zoom this out to a year to date, look at what this has done. It's gone from 47 on a split adjusted basis to 140. It's a tremendous move. And a lot of this is predicated on people not wanting to",
    "metadata": {
      "video_id": "ILHEm19JYs8",
      "title": "QQQ, GOOG, & GME | Market Update",
      "url": "https://www.youtube.com/watch?v=ILHEm19JYs8",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 10,
      "start_timestamp": "00:01:15",
      "start_timestamp_seconds": 75.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ILHEm19JYs8&t=75"
    }
  },
  {
    "text": "big rally, essentially most of the year, if we zoom this out to a year to date, look at what this has done. It's gone from 47 on a split adjusted basis to 140. It's a tremendous move. And a lot of this is predicated on people not wanting to miss the AI rally train. They think that they're getting in late. And you can see where most people got in year to date was down here kind of at the 89 and a half handle. But if we zoom this in, you'll notice that this will start to scoot up as more and more people are entering the party late. And that causes a problem because there's a lot of people that entered the party in here that aren't necessarily really happy with things are going, right? And this is a tale as old as time itself in the markets where people just dog pile into things hoping that it's going to go up. And it doesn't necessarily always mean it's going to continue, especially when you price and stuff that aggressively essentially, everything has to execute near perfectly in order for there to be no issues, no market pushback. So none of this surprises me. It seems almost overdue in my opinion, but I mean, who am I to say when it's due? I'm just a dude. But there's just something I've been thinking about for some time now. And it's something that's been on my radar, especially",
    "metadata": {
      "video_id": "ILHEm19JYs8",
      "title": "QQQ, GOOG, & GME | Market Update",
      "url": "https://www.youtube.com/watch?v=ILHEm19JYs8",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 10,
      "start_timestamp": "00:02:31",
      "start_timestamp_seconds": 151.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ILHEm19JYs8&t=151"
    }
  },
  {
    "text": "pushback. So none of this surprises me. It seems almost overdue in my opinion, but I mean, who am I to say when it's due? I'm just a dude. But there's just something I've been thinking about for some time now. And it's something that's been on my radar, especially as you start seeing the moving averages all start to get super congested like this. Yeah, you got to be careful with the risk is what that boils down to. So that's broadly what I'm seeing across the market within the tech sector for a little while the Russell was kind of the only little bit of strength we saw. It was actually up for a little bit today. And then it just joined that downward party move, which funny enough, I was stopped out yesterday after the close. So I was flat in here, although I really have been enjoying the rut trade. So I wanted to get back in, but today was more of just a watch kind of day. So that's actually what I'm doing right now. Making some alerts to keep my eyeballs on it is it starts to move outside of these range bound phases here. Hopefully continuing to the upside. It's still technically showing ever so slight moderate strength compared to the SP, but the NASDAQ is really what's driving us down. And then as I look across the sectors, it's generally blood in the street. We have XLE, which is hanging in there",
    "metadata": {
      "video_id": "ILHEm19JYs8",
      "title": "QQQ, GOOG, & GME | Market Update",
      "url": "https://www.youtube.com/watch?v=ILHEm19JYs8",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 10,
      "start_timestamp": "00:03:36",
      "start_timestamp_seconds": 216.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ILHEm19JYs8&t=216"
    }
  },
  {
    "text": "here. Hopefully continuing to the upside. It's still technically showing ever so slight moderate strength compared to the SP, but the NASDAQ is really what's driving us down. And then as I look across the sectors, it's generally blood in the street. We have XLE, which is hanging in there just a little bit better than some of the others in XLE who's actually enjoying a little bit of an update here. And then XLV and even bigger up day. So if you're looking for areas of strength that continue to persist, this is exactly what I do. And these are the kind of products that I start looking at that tend to be a bit more defensive in nature. And they tend to perform pretty well in that format. So that's kind of the broad market scenario here. Now I do want to pivot over, take a quick look at GameStop. It's another generally quiet day. So when I look at this, a big thing I'm trying to keep an eye on is how is price behaving, especially as we get near this point of control. And we're now firmly below it. We actually just closed below the 50 day moving average. So I don't love that. I actually adjusted my position because of the movement today. I still have a small position on, but I've paired down a lot of it. And it's now a waiting game for me. As you can see, I have a couple of",
    "metadata": {
      "video_id": "ILHEm19JYs8",
      "title": "QQQ, GOOG, & GME | Market Update",
      "url": "https://www.youtube.com/watch?v=ILHEm19JYs8",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 10,
      "start_timestamp": "00:04:39",
      "start_timestamp_seconds": 279.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ILHEm19JYs8&t=279"
    }
  },
  {
    "text": "day moving average. So I don't love that. I actually adjusted my position because of the movement today. I still have a small position on, but I've paired down a lot of it. And it's now a waiting game for me. As you can see, I have a couple of alerts set that I want to see how it behaves beyond a few different levels. So the first of this one has two alerts kind of baked in. There's one right there and then one right at the bottom of this, like right there, just for context. And so far it's just kind of slowly meandering, but not in necessarily a positive direction. We did see an expansion in volume today, but the majority of it being sale volume. So you can see that again, represented in the candle that you see, it's just kind of this relatively on this scale, a larger red candle. So it looks like people are selling. I mean, I am wound some of my position today. So I'm part of that. I still have, again, part of the position on via shares and I do have some short calls against it still. I took the short calls from yesterday down because they paid out today. And I put some new stuff out a little closer in time because it doesn't look like I'm adding my options positions as quickly as I thought I might have been, which is part of how this whole thing",
    "metadata": {
      "video_id": "ILHEm19JYs8",
      "title": "QQQ, GOOG, & GME | Market Update",
      "url": "https://www.youtube.com/watch?v=ILHEm19JYs8",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 10,
      "start_timestamp": "00:05:41",
      "start_timestamp_seconds": 341.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ILHEm19JYs8&t=341"
    }
  },
  {
    "text": "the short calls from yesterday down because they paid out today. And I put some new stuff out a little closer in time because it doesn't look like I'm adding my options positions as quickly as I thought I might have been, which is part of how this whole thing goes. So let's take a look at what we're seeing from a volume perspective. I see 167,000 calls versus 70,000 puts. So by all of chords, a quiet, a quiet day. Typically we're seeing volume on the call side over 200,000 easy put side about that. Most of the call volume is in 26 July for usual. And then we are seeing more and more and more positions building out into this 16-Aug expiration cycle, which again, that does not surprise me. I would continue to expect to see that trend. Actually, if we take a quick look at the breakdown between that, 70,800 in this front expiration, 34,000 is about half of it are out in 16-Aug. And then two AUG is 29,000 calls. And then nine AUG is super quiet, 9,000 to 3,000 calls to puts respectively. So not much happening in a nine AUG yet. So my guess is this. We'll still continue to see positions being built out in 16-Aug slowly. We will continue to favor the front expiration. So then as this 26 July starts to come up and pass, then it'll probably rotate into the two AUG, into the nine AUG. But I still",
    "metadata": {
      "video_id": "ILHEm19JYs8",
      "title": "QQQ, GOOG, & GME | Market Update",
      "url": "https://www.youtube.com/watch?v=ILHEm19JYs8",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 10,
      "start_timestamp": "00:06:47",
      "start_timestamp_seconds": 407.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ILHEm19JYs8&t=407"
    }
  },
  {
    "text": "guess is this. We'll still continue to see positions being built out in 16-Aug slowly. We will continue to favor the front expiration. So then as this 26 July starts to come up and pass, then it'll probably rotate into the two AUG, into the nine AUG. But I still think over that entire time frame, you're going to see the 16-Aug building out more and more and more. That's just so far what I'm seeing. Now from a general trade perspective, there are a couple of positions that came through that were a little bit larger in size, but not a bunch. So I'm still seeing relatively quiet markets here. So this is looking at both bid and offer for both calls and puts for today. And I just want to see like, what's the premium that's trading? And it's all under 100,000. So nothing there that I would highlight as of supreme interest to me just yet. As you can tell, I'm here keeping an eyeball on it. When I start looking at stuff like this on a decide that I want to keep looking at it, I'm going to keep looking at it. So that's where I'm at. I'm waiting to see my new changes. And this is actually kind of useful for the way that the market is setting up now. It gets to a point where the premium, the volume, the size of the positions we see putting on, they're all kind of smaller here.",
    "metadata": {
      "video_id": "ILHEm19JYs8",
      "title": "QQQ, GOOG, & GME | Market Update",
      "url": "https://www.youtube.com/watch?v=ILHEm19JYs8",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 10,
      "start_timestamp": "00:08:00",
      "start_timestamp_seconds": 480.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ILHEm19JYs8&t=480"
    }
  },
  {
    "text": "at. I'm waiting to see my new changes. And this is actually kind of useful for the way that the market is setting up now. It gets to a point where the premium, the volume, the size of the positions we see putting on, they're all kind of smaller here. So then when you see bigger positions, they stick out like sore thumbs. You can see them clearly today. So that is a really big benefit of the market here slowing down a little bit specifically for GME getting a little bit more quiet. So so far, that's what I got. As always, if there's anything you want me to take a look at, let me know. I'm doing a live stream on Saturday about game stop. My boy Newton is unable to make this week. He'll be back next week. So this one is just going to be me looking through the stock more in depth, really trying to pick up more of the history. So I'm going to be going through roaring kiddie's old videos, posts and stuff like that. So I'm actually going to lean on the chat pretty heavily to help me, you know, direct my attention to this stuff you guys think I should be learning about next. So if you're able to join, it's at 5 p.m. Same exact thing we'd be doing the last few weeks. So being outlier. See you guys later.",
    "metadata": {
      "video_id": "ILHEm19JYs8",
      "title": "QQQ, GOOG, & GME | Market Update",
      "url": "https://www.youtube.com/watch?v=ILHEm19JYs8",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 10,
      "start_timestamp": "00:08:59",
      "start_timestamp_seconds": 539.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ILHEm19JYs8&t=539"
    }
  },
  {
    "text": "attention to this stuff you guys think I should be learning about next. So if you're able to join, it's at 5 p.m. Same exact thing we'd be doing the last few weeks. So being outlier. See you guys later.",
    "metadata": {
      "video_id": "ILHEm19JYs8",
      "title": "QQQ, GOOG, & GME | Market Update",
      "url": "https://www.youtube.com/watch?v=ILHEm19JYs8",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 10,
      "start_timestamp": "00:09:51",
      "start_timestamp_seconds": 591.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ILHEm19JYs8&t=591"
    }
  }
]