[
  {
    "text": "Let's talk about the best zero DTE options trading strategy. Do you know what it is? My guess is you probably don't because I don't either. The fact is nobody knows. There's not enough time in zero DTEs to have a definitive answer, but we have some pretty good ideas on what's working so far. So the goal of this video is to walk you through some of the research I've been doing from my data set as well as my actual trading data and talk you through what I'm seeing. That's working and what's not working. And then most importantly, I want to give you some ideas on how you can apply a similar methodology to figure out an approach for yourself. That might work really well for you and your trading book based on your specific needs. What's up, everyone? Eric here. Welcome back to the outliers. Shout out to the Patreon family. Consider signing up for weekly workshops on this exact kind of stuff. And let's dig right in. Okay. So what's the profit mechanism for these trades? Well, it's variance risk premium. And if you're unfamiliar with that concept, I'll throw a link in the description below that goes through in detail, but to summarize it simply put, it's the propensity for implied volatility to track above historic volatility, which means that we're pricing options more richly than what they're ending up moving. And we can make money off of that. And because of that, that's",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  },
  {
    "text": "below that goes through in detail, but to summarize it simply put, it's the propensity for implied volatility to track above historic volatility, which means that we're pricing options more richly than what they're ending up moving. And we can make money off of that. And because of that, that's why I actually prefer sell style strategies for these time frames, so things like short straddles, strangles, primarily strangles, which you'll see in a little bit. Now, let's get a quick visual on variance risk premium. And essentially, these yellow lines are implied volatility. The white lines are historic volatility. And we make money when the yellow line is above the white line. And when the white line crosses above the yellow line, those are typically periods that we would have a losing trade. That means that in these instances, the markets priced in a lower implied volatility, which we would have sold, then accounted for the overall movement, which was much larger that that implied volatility. So let's take a look then at some of the structures that I've found to work. Now, this is kind of a cliff notes version. If we want a really in depth version, I can share something like that. It would be a long video because to summarize, I've traded these and tracked them both live since launch. And I have a massive data set where I have essentially looked at different permutations down to single delta variances and five minute entry windows.",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  },
  {
    "text": "I can share something like that. It would be a long video because to summarize, I've traded these and tracked them both live since launch. And I have a massive data set where I have essentially looked at different permutations down to single delta variances and five minute entry windows. And I want to share some of the high levels or the highlights of that at a high level for you. So this is looking back around the launch of daily explorations in SPX. And there's a couple reasons why I prefer SPX for this tax advantages is a big one, but also sizing. So I don't have to put on as many positions. So I can decrease the number of transactions I have to make because it's very expensive. I have a video that dives into the world of zero DTEs with a bunch of different studies in depth. I'll also throw that in the description. But traders don't fully appreciate how expensive it is to trade zero DTEs. And it's because the transaction costs are kind of hidden from you. It's on the back end, not the commissions you're paying up front. It's the fills that you get the markets you have exposure to and the slippage on entries. So it's really important to consider that we want to decrease how much we're interacting with this stuff. The other thing that I've noticed that's not in this video, but if you're interested, I can bake it into a",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  },
  {
    "text": "the markets you have exposure to and the slippage on entries. So it's really important to consider that we want to decrease how much we're interacting with this stuff. The other thing that I've noticed that's not in this video, but if you're interested, I can bake it into a future video is a targeted frequency to entry. So what we're going to review today are more of a systematic approach that looks at a broader data set so that we can make informed decisions using as much data as possible. But what I have found is we know that volatility tends to cluster. Right. So if you notice this period right here that crossed above the implied volatility, historic volatility crossed above implied. This was on 22 February. Then on 23 February, it was also above. And then it came back down. So there was a two day period there in this case, it crossed above on the 13th stayed up for the 14th. And then it came back below on the 15th. We'll kind of write even with it. So what I'm highlighting is that you can actually apply a little bit of a momentum factor to deciding when you choose to enter is compared to just mechanically entering. But you don't have to do that. That's kind of the beauty of this stuff. Because again, if we look at this in the aggregate, it's kind of like dollar cost averaging more often than not implied is above",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  },
  {
    "text": "when you choose to enter is compared to just mechanically entering. But you don't have to do that. That's kind of the beauty of this stuff. Because again, if we look at this in the aggregate, it's kind of like dollar cost averaging more often than not implied is above historic. So you can get more specific with it like I like to mostly because I'm a nerd about this stuff. But a general rule that's applicable is it's normally there until it's not and then it generally comes back pretty quickly. That being variance risk premium. So let's take a look at a couple of trade examples here. We have different deltas for short calls, long calls, short puts, long puts. These are all one lots for ease. And the times of entry are in Eastern standard time. So this is 0 935 right after the open. And again, we're looking at from when zero DTE's daily explorations were launched until the fourth of June 2024. So we're not applying any profit or loss protocols. And let's take a look at what we see up front right out of the gate. I noticed that the 15 delta's definitely perform stronger than everything else by quite a lot. I also noticed that if you add wings to things, it helps and doesn't help. What that means is it helps for straddles which have persistently underperformed. So it makes sense that it would decrease the loss profile of those. So you",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  },
  {
    "text": "stronger than everything else by quite a lot. I also noticed that if you add wings to things, it helps and doesn't help. What that means is it helps for straddles which have persistently underperformed. So it makes sense that it would decrease the loss profile of those. So you can see our max loss goes from essentially 12 grand down to six. That helps this a lot. However, or something like the 15 delta short strangle, which if you're not fully sure what that looks like, essentially we would come in here. We would find the option closest to a 15 delta on the put side. So in this case, there's a 16 delta. And then there's a 17 delta right here. So we would sell those. Now this is one DTE. That's only because the markets closed right now. So the zero DTEs have expired. There's no premium in them. Just so you know why I'm looking out of one. But I just want to show you what the structure looks like, which is this right here. So a couple things to keep in mind as we look at this. It has nice big profit zones, which is great. But you'll notice a kind of nefarious component to this. If you look at the purple line, the unrealized loss before expiration, at this point, right at your break even is negative 1200 bucks. But you actually would make two bucks if you held it and essentially time to",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  },
  {
    "text": "great. But you'll notice a kind of nefarious component to this. If you look at the purple line, the unrealized loss before expiration, at this point, right at your break even is negative 1200 bucks. But you actually would make two bucks if you held it and essentially time to cater out and it stayed right there. That matters a lot. The reason why it matters a lot is as we look at applying management protocols, you have to be careful about stopping yourself out too early. So a couple of other things to note here, the super small delta, specifically the fives, they seem to outperform the 10 delta's ever so slightly. And it looks like that primarily derives from reduced max losses and a pretty high premium on the win rate. So notice there's a five delta variance between these, but the win rate is pretty meaningful as compared to if you look at the variance between the 10 and 15 and the difference between the win rates there. So the five delta's have a little bit of an edge for the win rate. However, they're just not collecting that much, which is why they don't perform while. So next, if you're looking at data sets like this, one of the first things we should be eyeballing is, okay, we're the extremes. And we found the extremes pretty simply, right? It's these losses. They're massive compared to the average wins or even the max wins on all of",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  },
  {
    "text": "So next, if you're looking at data sets like this, one of the first things we should be eyeballing is, okay, we're the extremes. And we found the extremes pretty simply, right? It's these losses. They're massive compared to the average wins or even the max wins on all of them. So if I'm building a strategy, the first thing I want to do is look at a really big data set, then I want to start seeing what themes I can find and tinker managing those and see what it does. And then we need to segment the data set to make sure that we're not overfitting too much because right now we're looking at all historic data. Whatever we see in these tests is not going to be what happens in the future. So what we need to see is how much does our management approach impact the performance of the strategies and the robustness? We don't want to see a bunch of variants year over year because then that means that we're getting to a point where we're grossly overfitting. And when we go to out of sample data set, meaning going forward, your performance will probably change drastically from what you back tested. So we're looking for robustness here. Now, this idea of cutting off the tails is nothing novel. I'll actually throw another video in the description below that talks about this exact process and what I'm doing is looking for extreme. So in this",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  },
  {
    "text": "change drastically from what you back tested. So we're looking for robustness here. Now, this idea of cutting off the tails is nothing novel. I'll actually throw another video in the description below that talks about this exact process and what I'm doing is looking for extreme. So in this case, I tinkered with a bunch of different stop losses and 200 tends to work generally well across time frames. Again, without grossly overfitting. So in this case, this is essentially a three times credit received loss. And let's take a look at what happens across the entire data set. First thing that jumps out at me is everything performs better across the board. That matters quite a lot. Even down to the straddles with the five Delta wings, they still lose, but it's a little bit less than over here. The fact that this positively impacts everything across the board to varying degrees, it tells me that we're on the right track in terms of what adjustments were applying. Now cliff notes, if we look through the difference that it makes for these different strategies, pay attention as we look at some of the different permutations going forward. But right now at this point, the 10 Delta's have grossly, grossly outperform the fives as compared to what we saw earlier. Why is that? Because we're controlling the tails. So what this is telling us is that if we looked at each trade in the data, data sample that there",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  },
  {
    "text": "right now at this point, the 10 Delta's have grossly, grossly outperform the fives as compared to what we saw earlier. Why is that? Because we're controlling the tails. So what this is telling us is that if we looked at each trade in the data, data sample that there are a handful of extremes that were greatly skewing our overall performance and what we cut those out specifically to the downside. All of a sudden, this has become a really high performing strategy. The 10 and the 15 Delta's. So now let's take a look at another thing, which is the time of entry. Again, I look at essentially five minute increments throughout every single day, but I'm giving you a slightly abridged version for ease of following. And I want you to notice a couple of things we look across this data set. What do you see? The first thing I notice again is that everything across the board performs way better way better. So this tells me again that we're on the right path. And you can tinker with all different kind of time entries. But I noticed that the afternoon within a few hours of the close performs very, very well. So what do we see happening here? Well, interestingly enough, our straddles now are the top performing strategy. So what's that what that's telling me is that the beginning of the day, the volatility that are being priced into the straddles aren't enough to keep",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  },
  {
    "text": "close performs very, very well. So what do we see happening here? Well, interestingly enough, our straddles now are the top performing strategy. So what's that what that's telling me is that the beginning of the day, the volatility that are being priced into the straddles aren't enough to keep up with the movement throughout the day, but towards the end of the day, it's obviously pretty lucrative, which is a very interesting find in my opinion. So let's move this over one more. And I want to show you the next logical look, which is combining the later day entry with the stops. And what do we see? Well, we see a couple of things. One, the profitability on most of them actually comes down. Why would that be? Because in this case, we're managing a lot of the volatility by time. When you layer on something else on top of that, in this case, stops. What's happening is throughout the end of the day, you're getting stopped out on way too many trades that actually come back in to become winners. So what this tells me is this stop is actually probably too tight. So we can look at actually expanding the stop loss from 200 out to 300 and again, notice what happens here. We see a total expansion across the board because now we're not prematurely stopping ourselves out for trade that end up coming back in to be winning positions. So the last thing I",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  },
  {
    "text": "at actually expanding the stop loss from 200 out to 300 and again, notice what happens here. We see a total expansion across the board because now we're not prematurely stopping ourselves out for trade that end up coming back in to be winning positions. So the last thing I want to highlight is zooming in on this sample. Now where we're entering at 2 p.m. Eastern time exiting at 300 max. Credit received. And I guess it's max loss on the credit received. But looking at this year over year, I want to look for robustness. And one of the things I'm looking for is how crazily do things tend to flip. And it's kind of a really important thing to consider, right? So this is a partial year. This is 2022 the second half of the year. This is all 2023. And then this is 2024. Notice what at least I see is if I look at the performance of the straddles, it essentially flip-flops almost tremendously. So we have it being top performer to being second to worst and the worst with the wing and then back towards the top so far this year. And if I look at kind of the solid performers across the board, it's the 15 and the 10 Delta short strangles. So you have to figure out what's right for you. A couple of things to consider though are for me, I very size based on how much I can quantify the",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  },
  {
    "text": "look at kind of the solid performers across the board, it's the 15 and the 10 Delta short strangles. So you have to figure out what's right for you. A couple of things to consider though are for me, I very size based on how much I can quantify the risk premium and what looks more attractive. I've also started instituting a intraday volatility sampling to help me forecast what it might be throughout the rest of the day. And that also uses kind of that moving average thesis I was talking to you about a little bit earlier. If there's a big catalyst, sometimes it's worth downsizing because you're going to collect more premium anyways because of the implied volatility being so elevated. And the last thing is I've started instituting a Delta rebalancing protocol in another sample of this trade. It's way too early to really derive anything from that. But so far that also looks promising. So what's the best strategy? In my opinion, it would be either short premium via short straddles or short strangles. You can modify the risk protocols based on what you want. It's a little too early to see. But for me and what I'm looking to expose myself to, it's primarily looking more like short strangles, although they slightly underperformed. There's much less year over year volatility in the performance of the strategies. So we'll see. Let me know what you think in the comments below. Be an outlier. I'll see",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  },
  {
    "text": "and what I'm looking to expose myself to, it's primarily looking more like short strangles, although they slightly underperformed. There's much less year over year volatility in the performance of the strategies. So we'll see. Let me know what you think in the comments below. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "IM2LefSdT5g",
      "title": "Searching for the Best 0DTE SPX Options Strategy",
      "url": "https://www.youtube.com/watch?v=IM2LefSdT5g",
      "upload_date": "",
      "duration": 899.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IM2LefSdT5g&t=0"
    }
  }
]