[
  {
    "video_id": "ioA0l8F6RzI",
    "title": "ioA0l8F6RzI",
    "url": "https://www.youtube.com/watch?v=ioA0l8F6RzI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 2,
    "text": "Here we have the case of a trader who posts it on the R option subreddit, which I love hanging out on because it's super fun. And they were asking about iron condors and what's going on here? Well, there's two big callouts for this person. The first thing is the market is perpetually showing them that it will move and you have absolutely got to have a plan for what you're doing and clearly they don't. They're kind of trying to build the plan as they're flying it, which never works well in trading. More importantly, you can see that they completely misunderstood that the strategy they were trading. So they had a trade here and it says they bought calls expired worthless and sold in bought puts that they would lose the difference between those. But all of a sudden they got assigned. So what happened here? Well, obviously they can identify why they were assigned, but they didn't understand that it's a potential. So always keep in mind, if you have a short option, even if it has other legs as part of the trade that you put on that short option is treated as a standalone option in the market's eyes. And if a counterparty to that option, short option chooses the exercise and you might be randomly paired with them. So you have to be prepared even if the rest of your portfolio makes sure that the risk is tolerable, meaning you still have the",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ioA0l8F6RzI&t=0"
  },
  {
    "video_id": "ioA0l8F6RzI",
    "title": "ioA0l8F6RzI",
    "url": "https://www.youtube.com/watch?v=ioA0l8F6RzI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 2,
    "text": "option in the market's eyes. And if a counterparty to that option, short option chooses the exercise and you might be randomly paired with them. So you have to be prepared even if the rest of your portfolio makes sure that the risk is tolerable, meaning you still have the spreads on. It doesn't change the risk profile as long as the other options are there. But you might get a scary email like this. That's completely avoidable, but it's also navigable if you know it's going on. You know, let's see it.",
    "start_timestamp_seconds": 66.24,
    "start_timestamp": "00:01:06",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ioA0l8F6RzI&t=66"
  }
]