[
  {
    "text": "I'm going to walk you through a trade that I made today. I made 4,000 in it. And it's nothing right home about, but the name of the game of trading is creating consistent profits based on an observable hypothesis that you can reliably execute over time. That's really all there is to it. Nothing super sexy. I don't have some sort of briefcase to open up and to stand in front of a aircraft for you. I'm going to walk you through a trade that I'm going to open up and to stand in front of a aircraft for you guys. I apologize. My only fans was doing very poorly. I can't imagine why. And this is essentially what I'm relegated to do for a living. So all that aside, I do want to talk to you about a trade. And it's a short straddle. I think this is a really useful strategy that can be adapted a lot of different ways for different account sizes. And it explicitly allows us to take to take advantage of some certain market conditions that probably belong in a lot of people's toolbox. Because when we have catalyst driven events, this is actually a really great way to capitalize on those instances on a large sample size. So I'm gonna walk you through the trade, how I like to structure it, how I think about it, why I made the trade I did today. And then at the end of the video,",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "actually a really great way to capitalize on those instances on a large sample size. So I'm gonna walk you through the trade, how I like to structure it, how I think about it, why I made the trade I did today. And then at the end of the video, I'm gonna talk to you about some details essentially that you can use to modify it so that it fits into your individual tool kit because we all will have our own takes on it. So what's up everybody? Eric here, we'll come back to all the outliers, shout out to the Patreon members, as well as YouTube members. And let's talk about trading from straddles. So this was in SPX. And if you were in the YouTube live session yesterday, which was 15 May, I actually talked about this exact trade. And I talked about why I was going to place this trade. And this is kind of the full circle life cycle of what happened. So the ticker, like I said, SPX is just a broad market index. And there's a few reasons why I trade the SPX. Although, if you have a smaller account, you're not relegated to SPX. You could always trade the spy, but I like SPX because it's cash settled. This is an important note because as we talk about the way I like to manage these positions, it being cash settled is important because I want to hold it into expiration. Why would",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "to SPX. You could always trade the spy, but I like SPX because it's cash settled. This is an important note because as we talk about the way I like to manage these positions, it being cash settled is important because I want to hold it into expiration. Why would I want to do that? These cost. Expensive. It's expensive. It's expensive for retail traders to interact with the markets. And I remind people about that because it's not relegated to the commissions you pay. It's the slippage on the backside. It's the payment for order flow in terms of where your order actually gets routed and executed against. If you look at the backside of trading, it's very expensive. So I think it's important for retail traders to be mindful of it. I want to be very clear that does not mean that I would purposefully build entire strategies around decreasing my cost structure. That I think becomes a little too over the top, but on the flip side, if you're completely not paying attention to cost structure, structure, structure, and you try something like scalping, you'll realize real quick how expensive it is and how you're getting eaten alive very slowly, even on a lot of small trades. So this trade is really pretty simple. This is the trade that went on and I'm gonna talk to you about the details as to why I selected this. This was shortly after the open, it was around 7.30 AM",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "alive very slowly, even on a lot of small trades. So this trade is really pretty simple. This is the trade that went on and I'm gonna talk to you about the details as to why I selected this. This was shortly after the open, it was around 7.30 AM Pacific time is like 7.31, 7.32, something like that. And the SPX was trading around 4125. So let's take a look at SPX quick. So this is a one day, one minute chart. So that's why it kind of looked so crazy. And I'm actually gonna zoom us out just a bit here, maybe to like a six month daily. And we've been trending sideways for a little bit here. So this is part of my overall hypothesis, but there's a couple of the things that really go into why I structured the trade the way I did and I'll show you some of them right here. The very first thing is today was a busy day. We had retail sales, industrial production, capacity utilization, business inventories, the housing index, and six fed speakers. This just in general tells me volatility and it's not that any one of these events were super massive, although retail sales definitely was impactful. When I see busy days like this, I start thinking, how can I take advantage of volatility? Because volatility around days like this tends to be busy. It's not quite to the same degree of what you would see for like",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "were super massive, although retail sales definitely was impactful. When I see busy days like this, I start thinking, how can I take advantage of volatility? Because volatility around days like this tends to be busy. It's not quite to the same degree of what you would see for like an earnings release, but it's still noteworthy enough that I'm gonna take a look at it. So going back over to think or swim, if we take a look at volatility, I'm gonna pull this up and I'm gonna move my stupid face up out your way. And if we look down here yesterday was the 15th. Implied volatility again is the yellow and then the white lines, gray lines was realized and notice how it was trending. Implied was pretty elevated, especially compared to last Friday over the weekend. We saw a spike up on Monday and a lot of this in my opinion is due to anticipation of today's numbers, but there's a lot of other stuff going on right now and I'm not gonna try to add a discreet explanation for very complex systems. Really what matters here is implied volatility looked overstated compared to realized volatility. Now, one quick note is I did actually run this through a my implied volatility surface model to come up with my own volatility calculation and it doesn't really matter that much because my calculation is not gonna be something that's super sophisticated able to even counterplay with the larger",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "Now, one quick note is I did actually run this through a my implied volatility surface model to come up with my own volatility calculation and it doesn't really matter that much because my calculation is not gonna be something that's super sophisticated able to even counterplay with the larger entities out there. So that's why in a lot of instances literally just using this simple IVHV plot is useful. This is not the NLB although because unless you have ways to calculate the intraday volatility, which I also do that, but for most people this would get you pretty damn close. And that's really what I want to hone in on here. Because if we take a look at implied volatility for the 30 day, it was 1761 for seven days, it was 1801 and then historic volatility for that same trading week. Five days was 0.06 and for the same month was 13. So the point being is IV was overstated relative to HV. That's it. That's really the main thing I'm looking at here. So I saw a catalyst, I observed IV to HV and then I wanted to understand if there's anything else going on in the markets that I should be aware of that I'm not paying attention to the trade and that wasn't the case. So this trade went on. So I sold the 16 May 4125 calls and puts. So it was a straddle at 1808. Now the Delta's weren't perfect 5051 I",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "the markets that I should be aware of that I'm not paying attention to the trade and that wasn't the case. So this trade went on. So I sold the 16 May 4125 calls and puts. So it was a straddle at 1808. Now the Delta's weren't perfect 5051 I put it on. I think it was like 48 or 49, but nonetheless, yet I picked the same strike because it was close enough. And let's talk about kind of the math behind the trade and then the way I managed it. The math behind this trade is simple. I had a 10 lot. So on a 10 lot, I collected 18,000 and 80 and you say, oh, wow, that's a lot of money. It's really not. And it took a lot of money to do that. So it took 594,000 to put on this trade. So this is on portfolio margin. So if you don't have a portfolio margin account, you might say, oh, I can't do that. Why would I even bother watching this video? And I encourage you to continue watching because there's a bunch of stuff you could do. You could scale this down. You don't have to do a 10 lot. You could do a one lot. I actually think trading these kinds of strategies in smaller sizes and products is really prudent. So in this case, yeah, just scale this down to whatever makes sense for you or change products because if you go",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "have to do a 10 lot. You could do a one lot. I actually think trading these kinds of strategies in smaller sizes and products is really prudent. So in this case, yeah, just scale this down to whatever makes sense for you or change products because if you go from SPX to spy, you're already going down to a 10th the size and then you could close down the lot. The whole point is talking to you about the hypothesis. Just just happens to be the trade that I had on. So this represents a 3 return on invested capital in a day. That's actually really good. So I wouldn't let this significant margin number confuse you into thinking, wow, you put up a ton of money to only potentially make 18. A 3 return on invested capital in a single day is massive. If you annualize that, it's like a several million compounded percent return literally. I think it's like 4.0 million percent return if you analyze that. So the point being I was on a relative scale, this is fine. Now, what happened in the trade? Well, I just took it in an expiration. It expired around 1450. And this is exactly why I chose SPX. One, because of the size it makes sense for me. But then two, most importantly, it's cash settled. So I don't have to worry about a round trip on the back end. And this is an important note, because when you're",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "1450. And this is exactly why I chose SPX. One, because of the size it makes sense for me. But then two, most importantly, it's cash settled. So I don't have to worry about a round trip on the back end. And this is an important note, because when you're trading strategies like this, volatility specifically focus strategies, you have to be prepared to hold the trade. Because if you try to institute all of these various kinds of stops, it's really difficult to actually make these make work. Make these make work. I don't know really what that means, but I think what I was going for is to make these work. And what I'm specifically driving at here is when we're trading a high implied volatility to realize volatility over statement hypothesis or just that IV is expensive, something like that. If that's your hypothesis, we still need to expect something to move. It's going to move within that range. Really, all I needed it to do was not move 18 in one direction. And then I was going to be OK off of the 4125. That's essentially what this trade boils down to. I just needed it to stay within 18. So I'm going to walk out with a profit. So letting this go into expiration, it benefits the strategy in multiple ways. That's not to say do not have risk management in mind. You have to have risk management in mind. In this case, the plan",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "to stay within 18. So I'm going to walk out with a profit. So letting this go into expiration, it benefits the strategy in multiple ways. That's not to say do not have risk management in mind. You have to have risk management in mind. In this case, the plan was if it started to break out in one direction or another, I was going to make a decision. So what I mean by that is if I pull us back down and I take a look at what the percent move was today compared to the five day average daily range or the average true range, it's about a percent. So if we started trending above the five day ADR or if we started getting close to the ATR, that tells me that we're trending. We're trending in a pretty big way. And it probably makes sense for me to get out. I want to avoid doing that. I want to give the trade as much room as possible. And if I have to take it into expiration at a loss, that's OK. But as long as it's within a reasonable bounds so that I'm not holding on to something that's running away. So in this specific instance, I didn't use a percent credit receive like a lot of people like to do. I simply use the data on recent movements to create thresholds for me to observe and then essentially to exit the trade. If these ever get",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "something that's running away. So in this specific instance, I didn't use a percent credit receive like a lot of people like to do. I simply use the data on recent movements to create thresholds for me to observe and then essentially to exit the trade. If these ever get to essentially like a five times loss, I'm getting out. That's absolute worst case scenario just to create some sort of significant threshold. I pretty much never hold to that point because I know I'm wrong before then. If I see this start trending in one way or another, I very frequently will exit. But the problem is the markets the way they've been trading and this way the context is so important. Because if you look at the way that the markets literally have been trading essentially since February, it's these intraday trending movements. Notice how big these candles are. So all of that is baked into the specific profit and loss management approach that I take here. And this is why I needed to give it room to move. And it's exactly why I simply was going to use the ADR ATR. If it started to exceed ATR, it's probably time to get out. Might give it a little bit more room to move. But I've traded these enough that I trust myself to execute accurately. If you're a new trader that can be really dangerous because we get super emotional and we start to make mistakes, I",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "it's probably time to get out. Might give it a little bit more room to move. But I've traded these enough that I trust myself to execute accurately. If you're a new trader that can be really dangerous because we get super emotional and we start to make mistakes, I am not exactly in that bucket because I've been doing this for a minute. But that's exactly how I went about planning the lost side of the trade. So what does this come out to? About a 3,130 return, which is a 0.53 return on invested capital. I think I might have seen you guys that made four grand. So sorry, I lied to you. It's 31.30. And somebody might be saying, oh, wow, that kind of sucks. Only 0.53 return on invested capital. First of all, this was in a single day. So again, if you annualize that return, it's 589. That's not saying I want to do this every single day. But people have this awful habit of not understanding the context of percentages and raw numbers. And it leads to these really skewed insane expectations because most of you guys are too busy seeing people on Twitter and on YouTube talking about 50 X in your money in two days. And now you're fuck mentally because those are now your expectations. This is what's worked for me. Like I said, it's nothing super sexy, but that's a few dollars for me to go buy another drone or",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "and on YouTube talking about 50 X in your money in two days. And now you're fuck mentally because those are now your expectations. This is what's worked for me. Like I said, it's nothing super sexy, but that's a few dollars for me to go buy another drone or some shit. And hopefully not crash that one into the ocean. I'm just kidding, I didn't crash my drone. But I am prepared to do that because I get real close to the water. But the point being is this is kind of the name of the game. It's just a matter of looking for a series of observable events and creating trades around it. In this case, I'm using volatility and catalysts to develop the trade structure to take advantage of implied volatility being overstated. Now, the last thing I will know is it's really important to run these kinds of trades in aggregate. Just as this one went right, I was posting about this in the discord a few days ago on several that went wrong. It's important to realize that you do need a decent sample size for this to actually materialize. Because if we have smart implied volatility calculations and the market essentially meets that expectation, the trade's not going to make much if any money probably be a small loss. So those instances happen pretty regularly. But the cool part is even though people get really scared about things like short straddles because it's unrealized",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "implied volatility calculations and the market essentially meets that expectation, the trade's not going to make much if any money probably be a small loss. So those instances happen pretty regularly. But the cool part is even though people get really scared about things like short straddles because it's unrealized loss potential or an undefined loss potential, it still tends to be okay. And it's because of the same exact function that implied volatility pricing tends to be pretty good. And if it's off, it's not typically off by 100, which is the kinds of moves you would need to have, like just absolutely catastrophic losses on these, especially if you're asleep at the wheel. And the last thing I will say is that if you choose to put on these kinds of strategies, you got to be around. You got to watch it. This is not my typical set and forget. Let me come back at the end of the day and see what it did because I don't have hard manual stops placed at a given point in time. I need to pay attention because if I do not pay attention and that starts to trend or we start to get a big move, I expose myself to massive asymmetric downside risk, which I cannot accept. I want these to typically work within a specific range as I define using the ADR-ATR in this instance. Sometimes that will vary to actual individual support and resistance levels. But more",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  },
  {
    "text": "start to get a big move, I expose myself to massive asymmetric downside risk, which I cannot accept. I want these to typically work within a specific range as I define using the ADR-ATR in this instance. Sometimes that will vary to actual individual support and resistance levels. But more often than not, I want to give the trade room to move, but not allow it room to run into the wrong direction without being touched. That's why I have to monitor these trades. So hope you enjoyed. Like, subscribe, be an LR. See you guys later.",
    "metadata": {
      "video_id": "iS-EvlwliI8",
      "title": "0DTE SPX Short Straddle Option Strategy",
      "url": "https://www.youtube.com/watch?v=iS-EvlwliI8",
      "upload_date": "",
      "duration": 918.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iS-EvlwliI8&t=0"
    }
  }
]