[
  {
    "text": "Music what's going on with the ape Community time for a gme update because somebody sent me uh this post actually from Super ston and this is from Mojo Master 5 and the post says he's back Keith in the house and speculation opinion so the post here we'll go through it and I just want to share my thoughts on what this is what it looks like um I haven't gone through the whole thing yet obviously I can tell from the top here what this is about and let's see what's going on is roaring Kitty getting back into gme options that's the Assumption I have taking a look at this so let's get right in so it says see that yeah that run beginning around uh 1430 so I'm assuming that they're using eastern time was a block of 5,25 calls for 15 nove picked up at the offer so this is assuming that they buys and a really important note here is when there are the different classifications for the price based on if it's executed closer to the bid or the offer it's not perfect uh in this case I'm assuming it's representative of them being purchases but just a general note for people to be aware of because it's not as simple it's not definitive you should just know that um could be our boy decided to make a splash today and triggered a little gamma squeeze action while doing so looks like a",
    "metadata": {
      "video_id": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "title": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "url": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?&t=0"
    }
  },
  {
    "text": "being purchases but just a general note for people to be aware of because it's not as simple it's not definitive you should just know that um could be our boy decided to make a splash today and triggered a little gamma squeeze action while doing so looks like a couple big boys followed in his wake as well and let's take a look here at this at their screen shot and they're just showing the movements in this is the volume for that contract now a couple notes specifically with respect to gamma squeeze gamma squeezes are really specific in 5,000 options is is just not going to do it the other thing to keep in mind is if we take a look at GameStop here and let's Zoom this in just a little bit so that we have kind of near-term price action on a really cool note if you guys remember I drew this 20 and a half level a long time ago and that was where I was expecting support to be found just based on prior price activity around that level going back uh longer term time frame right going all the way back to here and the really cool part about this is that it does seem like that might be close to what this new floor might look like for GameStop which would be maybe mid-20s on the lower end maybe mid 19s but it looks like it's really respecting this General range",
    "metadata": {
      "video_id": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "title": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "url": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:01:14",
      "start_timestamp_seconds": 74.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?&t=74"
    }
  },
  {
    "text": "here and the really cool part about this is that it does seem like that might be close to what this new floor might look like for GameStop which would be maybe mid-20s on the lower end maybe mid 19s but it looks like it's really respecting this General range meaning lots of people are buying and selling in here so for the near term it doesn't look like it's moving parabolic either direction but I don't think it's a bad thing because I think it's starting to base out here and have kind of a new generalized value now if we take a look at the options in here though I want to show you a couple things quickly looking at the 15 nove the 25s if we see the current Delta they're about a 33 Delta as it sits now and the gamma is like a 0.09 now the idea of building a gamma ramp actually isn't about individual strikes a gamma ramp is built over several strikes being ramped up because the way that uh gamma ramp will work is as the underlying rallies and options fall in the money especially as the closer to expiration market makers who are typically the counterparty would start buying shares to cover the new risk meaning in case they fall in the money and they have to deliver then as they are buying shares that moves price up a little bit into the next strike and if there's enough open",
    "metadata": {
      "video_id": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "title": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "url": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:02:28",
      "start_timestamp_seconds": 148.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?&t=148"
    }
  },
  {
    "text": "makers who are typically the counterparty would start buying shares to cover the new risk meaning in case they fall in the money and they have to deliver then as they are buying shares that moves price up a little bit into the next strike and if there's enough open interest at the next strike that was at the money they have to start buying more to hedge that risk and then it pushes it to the next strike and then that's how a gamma ramp is built so right now there's just not enough depth in these options to actually serve as an actual gamma ramp just for a a General understanding about more so how those will perform so um and then the idea of a couple other players following along it does look like that because the volume today was over 20,000 so this actually popped up on a couple of my scans today just because of the activity pretty drastically exceeding in already high oi so yeah definitely other people moved along however if you've watched my other videos on stuff like GameStop you already know that at these kind of more primary expirations as I refer to them as you're going to tend to see more concentration so what that means is anything that ends in like a zero or a five will tend to have more volume than things that are in the middle and definitely whole number strikes as compared to half strikes",
    "metadata": {
      "video_id": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "title": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "url": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:03:45",
      "start_timestamp_seconds": 225.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?&t=225"
    }
  },
  {
    "text": "refer to them as you're going to tend to see more concentration so what that means is anything that ends in like a zero or a five will tend to have more volume than things that are in the middle and definitely whole number strikes as compared to half strikes so if we look at the 20s there's 4,000 of those if we look at the 21s there is 427 then if we look at the 22s there's 1,500 and you kind of get the point here until we get to the 25s which even before today had 18,000 and then if we get to the 30s you can see that had 13,000 so that's just a a really natural tendency as people buy options so again just a a general note uh for you all this looks like just some of the other trades that went through says these are short dated calls if he doesn't close this trade right away for a profit which he absolutely could then he must anticipate something else is coming down the pipe maybe it's him maybe it's a copycat in any case exercise caution so I like that they're being objective in their analysis specifically in turn in terms of um maybe it's him maybe it's a copycat I think this is already very presumptive in terms of saying if he doesn't because again we we have no idea now I want to talk about a few things the very first thing",
    "metadata": {
      "video_id": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "title": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "url": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:05:04",
      "start_timestamp_seconds": 304.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?&t=304"
    }
  },
  {
    "text": "their analysis specifically in turn in terms of um maybe it's him maybe it's a copycat I think this is already very presumptive in terms of saying if he doesn't because again we we have no idea now I want to talk about a few things the very first thing I want to show you are some of roaring kitties habits and if you're unfamiliar here I've been doing a live stream every Saturday for like the last what 3 months 4 months now and we've spent at least two of those months analyzing every single trade that he's made and going through one by one now there's a couple really highlevel tendencies that I've been able to pick up looking at his stuff the first thing is if I take a look at the various days to expiration that he tends to get in at the overwhelming majority have entries that are much longer days to expiration that's actually what this is here it's tracking the actual days to expiration for his entries the shortest was a 3 DTE trade I literally could see it this was back in 2020 and it was a very specific trade that was wrapped around a thesis he had around a console release and the impact around earnings so this was the only the only circumstance that I've seen anything shorter than a month for him now that being said there was a circumstance here where in April it did look like there",
    "metadata": {
      "video_id": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "title": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "url": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:06:08",
      "start_timestamp_seconds": 368.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?&t=368"
    }
  },
  {
    "text": "wrapped around a thesis he had around a console release and the impact around earnings so this was the only the only circumstance that I've seen anything shorter than a month for him now that being said there was a circumstance here where in April it did look like there was some activity that appeared to be him but we have no idea because he didn't post any sort of yellow updates nothing like that and these were actually slightly shorter term options but still not super short so the main thing I want to highlight is that if this is him it would be very very contrary to his standard positioning at all meaning um just days to expiration selection would be quite novel in this case now as far as Delta selection I think that's about right so he does tend towards the slightly out of the money so this looks fine the main thing I see here is just way too short in duration now if we go to unusual whales and we take a look at this there's a couple other notes that I want to highlight the first one is that again if this were him this is still a very small position for him so 350,000 again for most Mortals that's a ton of money but for him if you're trading a several hundred million dollar account it's tiny and I would be really surprised the other thing is I don't think this is",
    "metadata": {
      "video_id": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "title": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "url": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:07:24",
      "start_timestamp_seconds": 444.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?&t=444"
    }
  },
  {
    "text": "him this is still a very small position for him so 350,000 again for most Mortals that's a ton of money but for him if you're trading a several hundred million dollar account it's tiny and I would be really surprised the other thing is I don't think this is him phasing into a position because going back to that we tend to see multiple entries on his prior quote unquote phasing in of positions that then hits a Crux that he sizes in more aggressively now this is using the 21 june2 calls that he was getting into about a month out in 20 may this ended up being a massive position so this was scaled in over several days if he was trading a really shortterm idea he doesn't have this much time to scale in like this so I would actually expect him to size in much more heavily UPF front if I thought that that was him which again I'm a little uh dubious of it in in in short I this just doesn't look like his activity now there are things that do match though the strike selection absolutely does the 5,000 lot size certainly does but again it's always important to remember he doesn't have any sort of hold of 5,000 Lots right other people transact in 5,000 Lots the position size is a little bit small the timing is about right because as we went through all of his old trades here I",
    "metadata": {
      "video_id": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "title": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "url": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:08:42",
      "start_timestamp_seconds": 522.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?&t=522"
    }
  },
  {
    "text": "does but again it's always important to remember he doesn't have any sort of hold of 5,000 Lots right other people transact in 5,000 Lots the position size is a little bit small the timing is about right because as we went through all of his old trades here I definitely noticed a lot of towards end of day entries as well as beginning of Day first hour was pretty common for some of his other positions and definitely towards the this is Pacific Time towards the end of the day is very common the majority of the trades were done um a little bit later in the day so that fits as well in general it looks like a slightly mixed bag I lean towards this doesn't look like him if you have an opinion let me know in the comments if you think this is him or not be an outlier be an ape I'll see you guys later",
    "metadata": {
      "video_id": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "title": "Is_Roaring_Kitty_Buying_GME_Calls?",
      "url": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:10:00",
      "start_timestamp_seconds": 600.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Is_Roaring_Kitty_Buying_GME_Calls?&t=600"
    }
  }
]