[
  {
    "text": "you you you you . did happen. And when I pretty much, let me see if this changes the thing automatically really quick as I'm talking. I didn't. Okay, cool. So I made sure to click back into OBS. But yeah, when I was flying right around there, the wind was absolutely insane. And it made it very difficult. You'll see in the next time that we do a live stream on Monday, when I do like the Iceland video, I have a bunch of drone footage. So we're still working through the Iceland one. What's up, everybody? It's great to see you all. We actually had two live streams today. I just finished one, like 45 minutes ago, where I was kind of just talking about a strategy thing that I think will be kind of fun to do together. But this video is entirely different. This video is about the crowd favorite, the fabled GameStop. So let me get my study materials. And we have a couple of ways we can start the video. We can either do like a quick recap of GameStop. I was actually planning on doing a little bit more of like a current state GameStop analysis tomorrow for tomorrow's market prep video because I haven't done one in a while. And so today we can dig straight in to take a look at the cats old stuff and see what we can dig up and learn. We still have a long ways to",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 86,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=0"
    }
  },
  {
    "text": "state GameStop analysis tomorrow for tomorrow's market prep video because I haven't done one in a while. And so today we can dig straight in to take a look at the cats old stuff and see what we can dig up and learn. We still have a long ways to go with respect to analyzing his trades and making sure that like I'm actually building the trades as I want. So we can dive right into that if we want. I'm going to grab his YouTube channel as well because I want to take a look at some of the stuff we were picking up on last time. So we have a lot to get into. Now as for always before we get too far started, let me grab the chat. And I would love to do two things. First, say hello to everybody. Second, I want to take a look at our map, the good old app map. So as I'm saying, hello, if you haven't told me where you're from before, please let me know. As you can see, we're getting built out here. This has actually been a completely unexpected but very fun side project view of where all the apes are from. So we have raptures who was here early. We have I'd rather be skiing, Lauren Ricky, Ben Joe. Oh, that's a that's a hell of a name. Ben Joe MacCowzee. Mac, Mac, how do you say that? Ben Joe, Mick Kazooie, McCazooie, Ben Joe",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 86,
      "start_timestamp": "00:03:38",
      "start_timestamp_seconds": 218.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=218"
    }
  },
  {
    "text": "where all the apes are from. So we have raptures who was here early. We have I'd rather be skiing, Lauren Ricky, Ben Joe. Oh, that's a that's a hell of a name. Ben Joe MacCowzee. Mac, Mac, how do you say that? Ben Joe, Mick Kazooie, McCazooie, Ben Joe McCazooie. Let me know if my third grade teacher is proud or not proud right now. And then we have Joe Tato, D'Rschlup, Oli, good to see you, Oli, James. James says how much longer till spy is a good dip by if you wait until it depends on what you're trying to do. Because if you're trying to if you're trying to wait for a dip, there might not fucking be one. And that's the problem if you're trying to put money into spy via something like dollar cost averaging is that people spend I think too much time waiting and not and not of time investing. James says I have 10k I can't lose a thousand getting in at the wrong time. If you have 10k and you can't lose a thousand, don't get in the market's not for you. That's a it's a terrible terrible place to put your money. That's it's yeah, just don't don't do that because there's just about nothing you could put your money into. And you create yourself in that scenario that you just gave me James, you gave yourself essentially an unwinnable scenario because you don't want to get in if",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 86,
      "start_timestamp": "00:04:49",
      "start_timestamp_seconds": 289.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=289"
    }
  },
  {
    "text": "put your money. That's it's yeah, just don't don't do that because there's just about nothing you could put your money into. And you create yourself in that scenario that you just gave me James, you gave yourself essentially an unwinnable scenario because you don't want to get in if it's too early, but then you're not willing to experience an unrealized loss of a thousand dollars. So yeah, pick a poison. That's that's how markets be. So yeah. T Digger, that's a great name. What up T Digger? We got Mr. Off Poon, good to see you. Off Poon says how's the food in Iceland? I don't think that I've ever seen an Icelandic restaurant even in New York City. Yeah, it's not I don't know. I think well, you've been on enough of the streams by now. You probably know in general, but like I'm not a foodie, right? Food is not like I don't really care. The food was fine, but I can tell you that there's nothing remarkable about the food in Iceland. What I can tell you though genuinely is the skier that they eat is walking fantastic. So big, big, big, big, big fan of the skier that they have. That's actually what we get now back in the States because I don't know, I just really like that Greek yogurt is good. I think skier is light years better. So that part highly remarkable. Just about that part, I don't really, yeah, there",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 86,
      "start_timestamp": "00:06:06",
      "start_timestamp_seconds": 366.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=366"
    }
  },
  {
    "text": "of the skier that they have. That's actually what we get now back in the States because I don't know, I just really like that Greek yogurt is good. I think skier is light years better. So that part highly remarkable. Just about that part, I don't really, yeah, there was nothing really too remarkable. The other thing that I thought actually it's funny because you mentioned an Icelandic restaurant even in New York City is because one of the things that comes across in Iceland that's very similar to New York City is they really like hot dogs. They really, really like hot dogs. So if you go into a gas station, they all have like this little griddle and it's like super normal to get hot dogs. I got a bunch of hot dogs while I was there. Whenever I go places, I eat local. So if I was in Tanzania, literally I was drinking fucking snake blood mixed with goats milk or goats milk mixed with goats blood because that's what they fucking ate there a lot. So that's the moss eye. So I like I would have that when I was there and when I was in Iceland, I dumped into the fucking the hot dog game because apparently they like fucking hot dogs that that shit was everywhere. It was actually really surprising. I don't know what it is. And it's like very American style hot dogs. Whereas in Norway, they also do the hot",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 86,
      "start_timestamp": "00:07:15",
      "start_timestamp_seconds": 435.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=435"
    }
  },
  {
    "text": "in Iceland, I dumped into the fucking the hot dog game because apparently they like fucking hot dogs that that shit was everywhere. It was actually really surprising. I don't know what it is. And it's like very American style hot dogs. Whereas in Norway, they also do the hot dog stuff, but it's more like like a bratwurst. It's I don't like those. I don't like like a bunch of like little pieces of fat in the hot dog. I prefer the hot dog to be just purely highly ultra processed meat so that I can't discern the fat from like the chicken toes. But yeah, the bratwurst thing not so much. So yeah, that was very strange about Iceland, but they I'm telling you, they were really big into that. And like you could go into just about everywhere and they might not have much, but they have a fucking hot dog. And yeah, I just strange how culturally that happens. It's absolutely fascinating to me. James says with spy, if it falls hard, I'm scared it'll just be more than a one K issue. Yeah, could be, but that's the nature of buying hold, right? Like if and that's okay. Like if you determine that your risk is that tight, that's why I said, don't put your money in the market. It's just not a good place for you. And that's okay. The market is not necessarily the right place for everybody to put their money. But",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 86,
      "start_timestamp": "00:08:30",
      "start_timestamp_seconds": 510.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=510"
    }
  },
  {
    "text": "and that's okay. Like if you determine that your risk is that tight, that's why I said, don't put your money in the market. It's just not a good place for you. And that's okay. The market is not necessarily the right place for everybody to put their money. But yeah, like if somebody tells me I like I can't or I don't I don't know how to frame it. Like I can't handle risk. I don't want to handle risk or whatever framing you want to use. If somebody tells me that the first thing I would tell them is like literally don't put your money in the market. It's not a good place for your money. And all right, let me get caught up on our map. We need the map. So we have Oh, oh, my, okay, do we have oh, my, huh? We do have oh, my, huh? So oh, my, huh is on our list. Do we have Vienna? We do not have Vienna. Vienna is now added to our list. That's fantastic. Hey, you're like our first Slavic country. It's perfect. Great. Detroit. I'm almost positive we have. Okay, then maybe I look like I was wrong. We didn't have Detroit. Now we got that. James says San Diego, which we already have San Diego for sure because that's where your boy is. I am a rep in us in San Diego, but I'll add San Diego proper if that's you're down that way.",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 86,
      "start_timestamp": "00:09:37",
      "start_timestamp_seconds": 577.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=577"
    }
  },
  {
    "text": "I was wrong. We didn't have Detroit. Now we got that. James says San Diego, which we already have San Diego for sure because that's where your boy is. I am a rep in us in San Diego, but I'll add San Diego proper if that's you're down that way. Do we have that? Off-Punsa's Vienna is in Slavico. I didn't say Vienna was Slavic. I said it's in a Slavic region. Everything around Vienna is very Slavic like Slovakia, like Hungary, like Austria, like pretty, pretty much all of these. Beverly Hills, we don't have that one yet. Beverly Hills, that that James is from Coronado, okay? Nope, that's Corona. I'm an idiot for a Nado. Perfect. Very good. Akron. Akron, I feel like I've heard before, but we'll add that. Perfect. All right. So we still have homework because we still need to find representation either from Iceland or from Greenland and then Madagascar or what was Tasmania? Those were the choices. That's what we need to add to the list. We're very close. We had a New Zealander at one point. We're very, very close. But we need to get a Tasmanian on here. So just remember that we have a little work to do. So we really need to get you guys out there, combing the streets. If you can get on the superstar on subreddit, if you're there, the GME reddit or wherever, wherever you like to be. And if you can find a fellow",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 86,
      "start_timestamp": "00:10:57",
      "start_timestamp_seconds": 657.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=657"
    }
  },
  {
    "text": "that we have a little work to do. So we really need to get you guys out there, combing the streets. If you can get on the superstar on subreddit, if you're there, the GME reddit or wherever, wherever you like to be. And if you can find a fellow ape that is from any of these places, that would be, I mean, they don't even have to stay for the whole time. They just got to pop in and say, yo, I'm from Greenland. I'm out. And then that's fucking, that's mission complete as far as I'm concerned. So yeah, great. That's really, and we're really missing Africa, huh? Nobody from Africa. Ukrainians are probably a little bit busy right now. As I imagine, most of the Iranians and Israelis are Kazakhstan would be kind of cool too. Okay. We got a few more on our map. Nice job. All right. So let's kill that. Let's kill that. And let's get into the workbook. And then we need to get over here to the CACs trades. Okay. So this was looking at the last thing we did, we looked at all of his 20 calls that he had scaled into. So we're right in here. Arab says Arab Rick Arab Rick Arab Rick don't do me dirty like this. Do not tell me that your name is Arab Rick and you're not from a fucking somewhere somewhere around here. I'm grabbing the map back again. So Arab Rick, I'm",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 86,
      "start_timestamp": "00:12:40",
      "start_timestamp_seconds": 760.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=760"
    }
  },
  {
    "text": "into. So we're right in here. Arab says Arab Rick Arab Rick Arab Rick don't do me dirty like this. Do not tell me that your name is Arab Rick and you're not from a fucking somewhere somewhere around here. I'm grabbing the map back again. So Arab Rick, I'm just going to slowly start zooming in and you could just tell me where to stop. Anything, anything starting to feel like home. Does this feel right to you? Maybe if I scroll a little bit to the right Arab Rick. Is this Arab Rick says where I'm watching from or where you're from, not where you're from or you're watching from. And with the name like Arab Rick, I'm expecting you to be watching from any of these. Let me know. You'd zoom in a little bit more. Let me know if the mouse is starting to feel like it's Texas mother what a fucking catfish. What a catfish. I thought Arab Rick that we were really going to be able to do some magic Palestine. You're I don't care if you're from fucking Palestine Rick. You're in Texas. I could have checked off Palestine. That would have been pretty cool. We would have just been sitting here clicking in and slowly clicking in and getting warmer and warmer and sure is shit. Rick out here just playing games with my heart. Damn it Rick. Damn it. Arab Rick says, well, I'd be impressed to be on the internet",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 86,
      "start_timestamp": "00:14:01",
      "start_timestamp_seconds": 841.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=841"
    }
  },
  {
    "text": "pretty cool. We would have just been sitting here clicking in and slowly clicking in and getting warmer and warmer and sure is shit. Rick out here just playing games with my heart. Damn it Rick. Damn it. Arab Rick says, well, I'd be impressed to be on the internet there. Fucking starlink dog. Don't play me like this. I really can't read any of this. These literally just look like squiggles. That's nuts. Netherlands. I think we have. Let's see. Yeah, we do have the Netherlands. We have two different areas in the Netherlands. We have in Shenday in Sheday and Amsterdam. Robo says ads on FYI. Yeah, I literally have no say in it anymore. I have that. I literally have them turned off. So I think that might be a a new thing because that slowly started to change. But only I'm always curious how many people like it because it doesn't look like everybody's. Dan says boring Colorado. Hey, that might be where I'm moving to. Chill on Colorado. Right now we're eyeballing outside Colorado Springs. Arab Rick says I'll reach out to some friends in Saudi, Qatar and Jordan when they wake up. Yeah, see, that's what I'm talking about. That's what I'm talking about. Hit those dudes up. We're like, yo, there's a really important mission right now. We have a real need to check off more of these little blocks on this on this map. That would be sick. All right. Time to",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 86,
      "start_timestamp": "00:15:43",
      "start_timestamp_seconds": 943.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=943"
    }
  },
  {
    "text": "that's what I'm talking about. That's what I'm talking about. Hit those dudes up. We're like, yo, there's a really important mission right now. We have a real need to check off more of these little blocks on this on this map. That would be sick. All right. Time to get to work, though. We need to we need to dive in and talk a bit about some game stop. Now, I already made a video that talked about the fine for the cat reporting and stuff. So I'm not sure that we really need to dive too deep into that unless there's any specific questions anybody has on it. But that just, yeah, I mean, it's entertaining enough as it is. Like that, I don't know anybody that saw that video, but it was essentially just satire the whole video just because I think the the scenarios kind of entertaining. But that I don't think that there's a massive impact. And then from a broader game stop perspective, there's a little bit interesting stuff going on, but there's not like a ton. So I figure I can spend a little bit more time probably tomorrow. And I can go, you know, further in the detail on everything. But like I said, if there's anything in the interim that you're really, really interested in taking a look at, let me know. I'm happy to take a peek at it. But Robloz says, well, Ken, be okay. Well, like I've told",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 86,
      "start_timestamp": "00:17:41",
      "start_timestamp_seconds": 1061.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=1061"
    }
  },
  {
    "text": "you know, further in the detail on everything. But like I said, if there's anything in the interim that you're really, really interested in taking a look at, let me know. I'm happy to take a peek at it. But Robloz says, well, Ken, be okay. Well, like I've told you guys, and I hope I made it clear in that video, I think right now what Ken probably needs more than quite literally anything is your thoughts and prayers. So I think it's always important to take care of those who take care of us. And right now Ken is going through a very, very challenging time. So you know, I just try to remind everybody to let's just keep Ken in our thoughts because you never really know, right? Ken is he's he's going through some trying times. That's I mean, I said that I think as clear as I could in the video, because I mean, right now Ken is worth what 43 billion dollars. So even if he was personally culpable for that, it's just that's a lot to take on for poor Ken. And I think that it's incumbent on us to just always take care of those who take care of us. And Ken is in a he's in the fight really the fight for his life. So yeah, poor Ken. Doctors, they says oligarchs going to oligarch. Yeah, I know. When I saw that, I mean, I get I'm I'm not of the",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 86,
      "start_timestamp": "00:18:46",
      "start_timestamp_seconds": 1126.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=1126"
    }
  },
  {
    "text": "care of those who take care of us. And Ken is in a he's in the fight really the fight for his life. So yeah, poor Ken. Doctors, they says oligarchs going to oligarch. Yeah, I know. When I saw that, I mean, I get I'm I'm not of the opinion genuinely that, you know, we should be or that Ken should be like raked over the calls genuinely. And I definitely think you should be held accountable for sure, but I don't think you should be raked over the calls. And the reason why I don't think you should be raked over the calls is because that that individual thing does look like a process issue. But he literally has he gets no pity from me because he could hire an entire team of PhDs if he wanted to do just that to just do compliance. So it's very clear that he just doesn't give a fuck. And for that, I think he should be raked over the calls because it's it's I think it's clearly clearly an indication of not caring at all. And if you think about it, he's not made to care. There's nothing about a million dollar fine for Citadel, which did 2.9 billion in trading revenue last quarter alone. Like that's super frustrating like that. I really don't like that. Long Swayze says, do they have to correct the reports? I don't know. I assume that they would have to amend them because I",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 86,
      "start_timestamp": "00:20:16",
      "start_timestamp_seconds": 1216.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=1216"
    }
  },
  {
    "text": "million dollar fine for Citadel, which did 2.9 billion in trading revenue last quarter alone. Like that's super frustrating like that. I really don't like that. Long Swayze says, do they have to correct the reports? I don't know. I assume that they would have to amend them because I think that in the article I read, they had already amended some of them, but they needed to go through and amend more of them. So because they had found another error going back. So I do think that they'll probably have to go through and fix them. The problem is, and I think a lot of people might be thinking that there's some sort of like really nefarious activity going on underneath the surface and there could be, but I just really doubt it. The reason why I really doubt it with respect to this specific thing to be clear, not with respect to Citadel, but with respect to the reporting is because with like even if they don't comply or they try not to comply, it's not like they're going to get away with it and they know they're not going to get away with it. It's like if you fuck your taxes, you could fuck your taxes for a year and maybe slide that under the radar or something, maybe. But like if you fuck your taxes every single year, you're literally going to get caught. It's just a matter of time. So a place like Citadel",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 86,
      "start_timestamp": "00:21:47",
      "start_timestamp_seconds": 1307.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=1307"
    }
  },
  {
    "text": "if you fuck your taxes, you could fuck your taxes for a year and maybe slide that under the radar or something, maybe. But like if you fuck your taxes every single year, you're literally going to get caught. It's just a matter of time. So a place like Citadel that already has the ability to make so much fucking money. I don't think that they would purposefully not comply with this thing to try and make a little bit more money thinking that they might not get caught. Like I just that I don't really see happening personally. They're smarter than that. Like it is what it is. They're smarter than that. Citadel. Citadel says I don't think that he is evil, but it's weird that most traders or trades are internalized. So it feels like he's moving price where he thinks is right, but I'm also retarded. So who gives a fuck? Yeah. Well, I mean, the order internalization process I don't like. Now again, they're they're playing the game as it's laid out for them. Right? So the reason why they do that is because they can and it's advantageous for them to do so. So it's kind of like it's like when Trump was debating Hillary Clinton and he came out with that again, not getting political, just the comment and the content of what I'm saying. And there was during that one debate where Hillary says, oh, well, you know, Trump doesn't pay his taxes",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 86,
      "start_timestamp": "00:22:57",
      "start_timestamp_seconds": 1377.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=1377"
    }
  },
  {
    "text": "kind of like it's like when Trump was debating Hillary Clinton and he came out with that again, not getting political, just the comment and the content of what I'm saying. And there was during that one debate where Hillary says, oh, well, you know, Trump doesn't pay his taxes and Trump says, no, like I do pay my taxes, but I use these write-offs so that I can decrease how much I have to pay. And I think the question that the moderator asks is like, do you use like these tactics or whatever to, you know, decrease how much you have to pay? And Trump says, of course, I do because you know, it's the same reason why I do it in like her donors use it. So really what he's signaling there is if he's not supposed to use that series of tax breaks as he can, then it should be written out of legislation. And really, he was just highlighting how, yeah. I'd rather be skiing says to be very, he doesn't the team of accounts he hires does. Yeah, definitely, but he's the reason why I say he it's because he's ultimately responsible. Even if you have an account and do your taxes, you the individual are culpable for what's done. So yeah, like in if he said I don't want you to use these loopholes, then they wouldn't use the loopholes, right? He could dictate that to them if he was so inclined. But",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 86,
      "start_timestamp": "00:24:12",
      "start_timestamp_seconds": 1452.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=1452"
    }
  },
  {
    "text": "you have an account and do your taxes, you the individual are culpable for what's done. So yeah, like in if he said I don't want you to use these loopholes, then they wouldn't use the loopholes, right? He could dictate that to them if he was so inclined. But again, like it would be, it literally would be dumb. If Trump didn't do that, I would think that's dumber than thinking some type of way about him using that loophole. And it's not even a loophole. Like we call it loophole, but it's it's just literally following the laws it's written. So if I actually don't really know what loophole means, maybe it is a loophole. Let me look at one second. I'm going to look at the definition. No, no, this one. I'm grabbing warm and chat GPTX. We're going to need it to find loophole. Let's see. A loophole is a gap ambiguity or inadequacy in a law ruler system that allows someone to circumvent its intent without technically breaking it. Yeah, then I don't think that's a, I don't think he's using loopholes like he's literally following it as it's written. Like for example, there's a really important, I try to talk to traders about a holistic approach to wealth. And then we'll get to games that I promise. But I hope this point is well received slash useful for some of you. So one of the things about being really smart about being a trader",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 86,
      "start_timestamp": "00:25:26",
      "start_timestamp_seconds": 1526.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=1526"
    }
  },
  {
    "text": "really important, I try to talk to traders about a holistic approach to wealth. And then we'll get to games that I promise. But I hope this point is well received slash useful for some of you. So one of the things about being really smart about being a trader is developing a holistic approach to wealth. How can you do that? By having different asset classes, there are different asset classes that behave differently that provide different benefits. So for example, I think it's exceedingly smart for most people to get some sort of exposure to real estate. And the reason why I think it's super important to get exposure to real estate is because there is insanely better tax treatment there than other places. As a trader, you are destroyed on taxes. In real estate, you are not. It's very, very tax incentivized. So having a broader approach to wealth typically leads to better outcomes. But that's my two cents. Okay. So let us get into GameStop. Close. Don't need that anymore. So last time, let me put us into on demand so that I can see where we left off. And let's go to here. Okay. Yeah. So my memory is just jogged. So the first thing I need to do is update this really fast. I like to add timestamps for people so that they know when this thing actually starts because we always spend a little time kind of like fucking around in the beginning.",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 86,
      "start_timestamp": "00:26:50",
      "start_timestamp_seconds": 1610.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=1610"
    }
  },
  {
    "text": "So my memory is just jogged. So the first thing I need to do is update this really fast. I like to add timestamps for people so that they know when this thing actually starts because we always spend a little time kind of like fucking around in the beginning. I always enjoy that. But so what time is it in the video 2854? We'll call it 29 29 000. BME content starts. For anybody that watches it afterwards, you're welcome. Okay. Hey, Roy Titties here. What up, Roy Tittie? Great to see you. Everybody, you know, big shout out for Roy Tittie. Crowd favorite here. Big fan of that name. There's a couple. There's a couple names that really make me happy. And that's one of them. Okay. So where we left off was we were deconstructing a series of trades. And there was actually a broad conversation that underwent about another series of trades that we are trying to attribute to the cat, which I think we should take a look at. So we spent a little time looking at a series of trades. And we took the time to build this. And if I'm not mistaken, off-pooden, let me know. I think it was somewhere in like the 22nd is where the additional 20 000 would have been put on at some other strikes. Or no, I'm sorry, not some other strikes, just at different points during the day. So what I'm highlighting here is I think",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 86,
      "start_timestamp": "00:28:32",
      "start_timestamp_seconds": 1712.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=1712"
    }
  },
  {
    "text": "let me know. I think it was somewhere in like the 22nd is where the additional 20 000 would have been put on at some other strikes. Or no, I'm sorry, not some other strikes, just at different points during the day. So what I'm highlighting here is I think we have a pretty good idea of the position that he built out when he built it out and how he built it out. And when I looked at the way that he moved into this position, I did find it really interesting. Because if we kind of color code this a little bit, we'll run that orange for the 20th. Then we'll go that for the 21st. 22nd, which again, if I'm not mistaken, I think off-pooden said that there's two more here. Vladimir says, I haven't recorded from my alternative universe, but it does add up looking at premiums, oh, and volume. And put in just for my context, was that on the 22nd, am I remembering that correctly? Or did you find, was it another day? I just wanted like add a mental note so at least I can track it. So there's, oops. So here's the 24th, the 28th, and then the 30th. Putin says the 20th to the 29th, oh, that's super not helpful. You're saying that the additional 20,000 appear from his position, you're saying that the additional 20,000 occurred over all of these days, not on a single one of the days. Is",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 86,
      "start_timestamp": "00:29:47",
      "start_timestamp_seconds": 1787.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=1787"
    }
  },
  {
    "text": "24th, the 28th, and then the 30th. Putin says the 20th to the 29th, oh, that's super not helpful. You're saying that the additional 20,000 appear from his position, you're saying that the additional 20,000 occurred over all of these days, not on a single one of the days. Is that correct? I just want to make sure I'm following. 22nd was the big day at 70K. Okay, so 22nd here, let's track. Yeah, okay, so I have it right. So because I'm tracking 50 that came through in these blocks. So you're tracking 70, which would mean that there, that's, this is exactly what it would have been. Okay, I didn't think that I was missing that. I'm going to add additional, but it wasn't in 5K blocks though, correct? Additional 20K, 20 calls. Putin, can you let me know if you saw it in small, this was 5K. Well, I tracked all of the 5K. All right, let's do this together really quick. Oops, well, while I'm in here, I might as well pick an emoji. Is there a cat? That would be good. Hey, here's some cats. Cool. All right, so let's take a look at the 22nd. Okay, what do you mean? We need to go to May 22. So here's, I think I caught that one at the mid. Let me double check. Okay, all that's good. All right, so I'm going to filter it by 2021 June. That's kind of annoying. Do I have",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 86,
      "start_timestamp": "00:31:09",
      "start_timestamp_seconds": 1869.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=1869"
    }
  },
  {
    "text": "22nd. Okay, what do you mean? We need to go to May 22. So here's, I think I caught that one at the mid. Let me double check. Okay, all that's good. All right, so I'm going to filter it by 2021 June. That's kind of annoying. Do I have to like manually type it in? If it's old, 21, 06, 2024. Can I do that? Yeah, that's silly. That's real silly. Okay, so I'm looking on the 22nd. There were no larger than 5K. I don't think so. Let me see, actually, let me take that back. Yep. Okay, so there were no larger than 5K. That I can see. I wish I could filter by this freaking contract. Oh, frustrating. All of Putin says 70K was the total. Yeah, that's what I'm trying to calculate here. So let me grab handy dandy workbook on this side for the 22nd. I'm just going to do a quick count. One, two, three, four, five, six, seven, eight, nine, ten. One, two, three, four, five, six, seven, eight, nine, ten, 11, 12. So there's two more that are missing from here that we need to add. Now I get to play the very fun game of figuring out out of this whole thing, which we're missing. Love this for me. So 335 is there, 338, aha. There's another right here. 22, may 24. This one came through at 1203. 1203, 45. A GME would be at the same price. It does",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 86,
      "start_timestamp": "00:32:49",
      "start_timestamp_seconds": 1969.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=1969"
    }
  },
  {
    "text": "the very fun game of figuring out out of this whole thing, which we're missing. Love this for me. So 335 is there, 338, aha. There's another right here. 22, may 24. This one came through at 1203. 1203, 45. A GME would be at the same price. It does matter. 523, 5000, 3.53 million. Okay. You want to have 293, 275, 313, 2925, 198. That's another one that's missing. 22, may, 198. This one came through at 0936, 0936, about 34. We have 5000. And then premium was 1.98. Got it. Then we have 3125. Where's this 25? 0918. That's not here. Oh, there it is. Oh, it came in at the mid. Do I have 25 twice? 08525. No, that's okay. Let's just just 093. So this just needs to be moved. 09325, then 275 goes up here. 4. Oops. Delete this. So now we are missing 10,000. Let's see if any more of these might have gotten broken up. 21. Let's limit it to the 20 call. 20, 20. So this is all. I just don't see this being him. These are just way too small. Yeah, I don't see this. Vladimir, where's the rest that you see from here? Because you're telling me that you're tracking 70 here. Vladimir says where is it written that unusual documents all our options trades? I don't understand your point. I can pass on what I have. Yeah, well, if you can, you can throw it in either shoot it",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 86,
      "start_timestamp": "00:34:59",
      "start_timestamp_seconds": 2099.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=2099"
    }
  },
  {
    "text": "see from here? Because you're telling me that you're tracking 70 here. Vladimir says where is it written that unusual documents all our options trades? I don't understand your point. I can pass on what I have. Yeah, well, if you can, you can throw it in either shoot it to me via email or you can throw it in the discord. If you're in there, I'm not sure. Where you're at. But yeah, if you send it to me, I'll take a look and see if we just compare notes. Because otherwise, really, my guess is it might have happened on one of these other days. So if we look at the 21st, let's take a look. 1, 2, 3 blocks. The 20th. 1, 2 blocks. The 24th. Another 23rd. Hmm, looks like no. 24th. 1, 2 blocks. 27th. Nothing. 28th. 2 blocks. 29th. No blocks. 30th. 1 block. 31st. Aha, there it is. Found it. It was the 31st. There she blows. 12, 54, 44, 5,000. And this was at 2.8 mil. Found it. So Putin. It's not. It's not 70,000 on the 22nd. It's only 60,000. That's where he built most of his position. And then. I can see. 1 came through on the 31st. Nothing on the June. I'm just going to do this whole week really quick. Okay, so there's five left to go. Don't know where the five is. Off Putin says 10k on the 23rd. 23rd. I didn't see any on the 23rd.",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 86,
      "start_timestamp": "00:38:33",
      "start_timestamp_seconds": 2313.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=2313"
    }
  },
  {
    "text": "can see. 1 came through on the 31st. Nothing on the June. I'm just going to do this whole week really quick. Okay, so there's five left to go. Don't know where the five is. Off Putin says 10k on the 23rd. 23rd. I didn't see any on the 23rd. It wouldn't be 10k on the 23rd anyways. That would be wrong. Because that would put us at over this. Yeah, so Putin, I don't think the 23rd is accurate. What I can, what I can clearly see is the. There's definitely something on the 31st. That I missed before because we didn't go there. But yeah, there's not 10k on the 23rd. And then the 24th, there's 10k. And then you have 5k on the 20th and the 21st. That's not right. So Putin on the 20th, there's 10k. And then on the 21st, there's 15k. Yeah, so I think your numbers are off a bit from what I'm seeing here at least. But. I'm still missing five. So maybe I'll go back. Let's just do all of me really fast. Oh, no, that's not it. Yeah, it's in here. It's definitely in here because I just counted 24. It's definitely in here. Going to sort this by date. 31st. 30th. 29th. 1, 2. 24th. 1, 2. 23rd. Nothing. 22nd. 1, 2, 3, 4, 5, 6, 6, 7, 8, 9, 10. 11. Oh, I fucked up my account. Yeah, I'm it. Now I have to double check. I'm just",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 86,
      "start_timestamp": "00:41:09",
      "start_timestamp_seconds": 2469.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=2469"
    }
  },
  {
    "text": "It's definitely in here. Going to sort this by date. 31st. 30th. 29th. 1, 2. 24th. 1, 2. 23rd. Nothing. 22nd. 1, 2, 3, 4, 5, 6, 6, 7, 8, 9, 10. 11. Oh, I fucked up my account. Yeah, I'm it. Now I have to double check. I'm just going to change this size minimum. I can make this way cleaner. Let's do a minimum of 1000. Yeah. Okay, good. Good. One, two, good. One, two, good. One, two. Four, five, six, seven. 11. So I have an extra one in here now. How did that happen? How did that happen? So this, I need to double check. So let's continue on the 21st. There's three. 20th. There's two. Ah. But this is four May 17th. I don't think that's it. Where the fuck? Where the fuck? He posted this when to June. Then maybe. April. Oh, man. That's frustrating. That's so frustrating. There's something. There's something of a gap here. Vladimir says, keep in mind since you are pinning the results on 5K blocks. You know the premiums, the total. Unless match with RK paid. Yeah. I'm not pinning the results to 5K. So if you notice I'm doing a minimum size of 1K. It's just because like there's a reality at some point. Instead of doing a 5K block, you did, you know, a few 1000 blocks. But like what I am taking is an assumption is that if he's going to build the rest of this",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 86,
      "start_timestamp": "00:44:07",
      "start_timestamp_seconds": 2647.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=2647"
    }
  },
  {
    "text": "doing a minimum size of 1K. It's just because like there's a reality at some point. Instead of doing a 5K block, you did, you know, a few 1000 blocks. But like what I am taking is an assumption is that if he's going to build the rest of this position, he probably wouldn't have been able to do it. By. By small trades. So let me run through these really quick. 353338333333. Wait. Fuck. This is a different order. How did I order this before? I don't want to have to redo this. Okay. Okay. So 3533383532529325275. 3531329253131. So this is the extra one. Now before I, oops. Before I do that though, I want to see what I saw here. Let's do 0 9 36. I'm going to sort it by time. Yeah, okay. You can stay. All right. So now. Fuck. Now I'm like really, really confused. Because we're missing 10 literally 10,000. And I have no idea where they are. Let's look at maybe 500. And it still doesn't let me pick the fucking expiration cycle. That's so frustrating. This would be so much cleaner if I could just pick the correct expiration cycle. Brain Titty says he could have had them before it. Yeah, we'll probably have to go back. Yeah, months before maybe it absolutely could be the case. I just want to verify that I'm not missing missing anything short term here. But I'm generally agreeing with you. The wrong. All right. So",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 86,
      "start_timestamp": "00:47:11",
      "start_timestamp_seconds": 2831.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=2831"
    }
  },
  {
    "text": "says he could have had them before it. Yeah, we'll probably have to go back. Yeah, months before maybe it absolutely could be the case. I just want to verify that I'm not missing missing anything short term here. But I'm generally agreeing with you. The wrong. All right. So now let's go back. I mean, let's start from fucking 24. Let's see. That's not it. That's not it. Those are me. My head isn't a fucking blender right now. Ah, I have another idea. I have another idea. I have one more idea. Let's try this. Let's go to when did he post his update to June? Is that correct? Dr. Zays says you're missing 5K and 529. Oh, perfect. Maybe this is easier than you say I'm missing 5K on 529. So that would go in here. Let's check that would be a fucking hope that's true. 529. Market open to market close. I don't think I am. Dr. Zays, where are you seeing that? I see nothing that returns here. 529. Whole market day. Minimum size 500. Strike 2020. All those are on board. There's nothing to do with multi-leg. Yeah. I don't see that, but I have another method here. So what I'm going to do is this is on demand. I'm going to look at the 21 June 20s. Let's wait for this to load here. And then let's analyze the volume. Okay. So this we can zoom in massively. So right now what this",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 86,
      "start_timestamp": "00:49:31",
      "start_timestamp_seconds": 2971.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=2971"
    }
  },
  {
    "text": "have another method here. So what I'm going to do is this is on demand. I'm going to look at the 21 June 20s. Let's wait for this to load here. And then let's analyze the volume. Okay. So this we can zoom in massively. So right now what this is showing me is the volume for the options themselves. This specific option. Off Putin says volume was 8460 on the 29th. Yeah, the volume could be 8460. Yeah, exactly. The volume's 8460, but that doesn't mean that he traded it. Because if I look if I'm limiting it by 500. Yeah, it's that's not him. Because this is going to look at any of the larger trades that happened. So what that likely means is that there's a lot of small trades that happened. Which would make sense because again, I've told you guys this already. This is how I found the trade being built out because of really interesting volume. So let's see what days had over 5000 volume. The 9th of May. Vladimir says I just don't know that unusual whales captures everything large. Yeah, I mean, I just I. I hear you, but in this instance, I have no idea why they would screen out. Two 5000 blocks, right? Like they're tracking every other one of these blocks. Dr. Zayas says 529 at 1053. Okay, so let me do this then. I'll check another data source to see if I can corroborate what Dr. Zayas found.",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 86,
      "start_timestamp": "00:52:13",
      "start_timestamp_seconds": 3133.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=3133"
    }
  },
  {
    "text": "I have no idea why they would screen out. Two 5000 blocks, right? Like they're tracking every other one of these blocks. Dr. Zayas says 529 at 1053. Okay, so let me do this then. I'll check another data source to see if I can corroborate what Dr. Zayas found. So let me log into this super fast. Because Dr. Zayas, are you getting that from unusual whales? Or are you getting that from another provider? Delete this. Really, can you send me a screenshot? Yeah, please, because that's crazy. And this does not help at all. With my absolute, aha. There it is. This is at the bed. At. Just doesn't make sense. I want to see the. There's like the actual. Contracts. This isn't it. Wow, it's so confusing. That's so confusing. I mean, sorry, I'm like really stuck on this because there's the part of me that is clearly not reading into this. And what I'm reading through is I cannot help but think at the 5,000 size, it's him. I cannot help but think that. However, I just fully do not comprehend. How this would have been at the bid. I don't understand that. So let's take a look really quick. The premium. The premium on this. Was two, seven, five million. Two, seven, five million. About five thousand hundred five five. How. How is that coded at the bid? I'm not sure. So frustrating. Okay, I mean, I'm going to. My best guess. We'll be",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 86,
      "start_timestamp": "00:54:17",
      "start_timestamp_seconds": 3257.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=3257"
    }
  },
  {
    "text": "take a look really quick. The premium. The premium on this. Was two, seven, five million. Two, seven, five million. About five thousand hundred five five. How. How is that coded at the bid? I'm not sure. So frustrating. Okay, I mean, I'm going to. My best guess. We'll be to take it at. Is what it is. Doctor says, It's so weird that it's at the bid. Because the bid. It is especially for an order of that size. It is essentially next to impossible to get filled at the bid. So Ricky says we need PB or Richard here to help. No, not not to sound conceded, but neither of those guys would know the answer to this. Like it literally looks like a codifying error. Because the transaction here. Literally is not at the bid. Right, like that's what. Right, look. The bid ask was 545 by 565. Spot, which is what he transacted at here was 550. that's mid. It's towards the bid, but it's not the bid. So the coding on this one is very strange, very, very strange. I'm glad that we found it. It's a great find, but it doesn't make sense. So I'm going to flag it anyways is something to take a look at out of curiosity. But yeah, this is a very weird, very weird fill. So 0753. 53. Got 39. Yeah. Gc says, no, the Viking knows more. Yeah. On this thing I, and again, it's not the sound",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 86,
      "start_timestamp": "00:57:27",
      "start_timestamp_seconds": 3447.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=3447"
    }
  },
  {
    "text": "I'm going to flag it anyways is something to take a look at out of curiosity. But yeah, this is a very weird, very weird fill. So 0753. 53. Got 39. Yeah. Gc says, no, the Viking knows more. Yeah. On this thing I, and again, it's not the sound conceited, but I'm very confident that, yeah, in the way I think about this one. And then this was 2.75. Okay. Let's find this other Gremlin. Doctors, hey, as you said that there was another day, 529 and the 20 second is where I'm missing another one. Let's go to the 22nd. And then it should be flagged at the bid. We'll go by size. There it is. See, this one, this one makes more sense. This one makes a lot more sense. It's still unbelievably unlikely, but it, it does make sense. Like this, this is conceivable to occur. 335, 338, 353, 2.5. So this is the other 2.5. I was missing about it. Okay. So then copy you. You came in at 0904 54. And then size was 5. And then 2.5. First of all, shout out to everybody for getting through this. This is fantastic. Let's take a look at here. Total cost was 6500. This is tracking total cost at 67. That's close enough. There could be like rounding errors and stuff like that. I'm not super pressed on it. I think this, this is super helpful. Okay, great. Beautiful. Glad that that's done. Great job,",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 86,
      "start_timestamp": "00:59:21",
      "start_timestamp_seconds": 3561.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=3561"
    }
  },
  {
    "text": "a look at here. Total cost was 6500. This is tracking total cost at 67. That's close enough. There could be like rounding errors and stuff like that. I'm not super pressed on it. I think this, this is super helpful. Okay, great. Beautiful. Glad that that's done. Great job, friends. So, now, let's take a look at, there is another series of trades that we needed to look at as well. Okay. I wanted to find those other blocks. I think it was from April. We got the, let me see. Vladimir says, do your premiums add up to around 68.1? There's 67.7.9. And I see his total cost at 65.7. So there's definitely a variance there. His price paid was 5.67.4. So let's see. Um. Yeah. Like literally almost perfect. So I have his basis here at 565, which again, I think that that's that's probably about right. And then you yeah, exactly. So then there's a little bit of commissions that'll be added on top of it. So his pure his pure cost here, 565, and then his basis is 56754 equals no, let's do. How do I want to do this? I'm going to add a row here. Get rid of this. This would be a little size to a premium move those here. This will be a long option basis. And then his long option reported basis is 5.6754 and equals 100 times this. So his total premium comes to 68104800. And then the variance",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 86,
      "start_timestamp": "01:01:50",
      "start_timestamp_seconds": 3710.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=3710"
    }
  },
  {
    "text": "row here. Get rid of this. This would be a little size to a premium move those here. This will be a long option basis. And then his long option reported basis is 5.6754 and equals 100 times this. So his total premium comes to 68104800. And then the variance between these, this minus this times this times 100. 314,000. So then this divided by this, this, this is 62. It seems, it seems steep. Off Putin says need to be around 681. Yeah. So I see 681 for his value on price paid. My long option basis is correct. My long option basis is 565, his is 565. So I think this is fine because this is using just the premiums. This isn't including anything. So then we can see what is overall fees were, which is about 314,000, but that seems too much. Because you guys are saying each rate is like 50 cents a contract. Let's see. Let's see. Those this times 0.5. That's only 60. Yeah. Interesting. So the variance is a little bit higher. I don't, I don't totally have an answer to it right now, but I don't actually think it matters that much to be honest. I'm not ultra concerned about it. So there's a couple of things that stick out to me here. The first thing that sticks out is the way that he scaled into it. Because these, these look a little bit like an after, after thought. Let's take a",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 86,
      "start_timestamp": "01:04:55",
      "start_timestamp_seconds": 3895.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=3895"
    }
  },
  {
    "text": "to be honest. I'm not ultra concerned about it. So there's a couple of things that stick out to me here. The first thing that sticks out is the way that he scaled into it. Because these, these look a little bit like an after, after thought. Let's take a look at GameStop on those days to start with. We'll take a look on the 29th, the 30th, and the 31st. Jimmy, we're going to go back the year. I'm going to turn my air off in my house. Don't need the air running right now. 29th, year, 3031. Very interesting. So he started scaling into this looks like the 20th. I'm here. And then I know that there's some conjecture about him putting on another trade before this. Because the other thing that I would love to know is when did he build his share position? He had 5 million. Let me clear this stuff out. So then he had 5 million shares. The last we saw was 200,000. He had at 200,000, 55.1774. And now when he comes back the basis 21274. So from the ape community, what's the current best guess on the variance? And when he bought this stuff, I don't know what the larger theory is. So this was on 21 July. Is that right? And then 2 June. 2 June 24. And then this was like 21 July, I think 21 April. I'm sorry, 21 April, 21. Something like that. Hard to tell. So",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 86,
      "start_timestamp": "01:07:58",
      "start_timestamp_seconds": 4078.06,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=4078"
    }
  },
  {
    "text": "bought this stuff, I don't know what the larger theory is. So this was on 21 July. Is that right? And then 2 June. 2 June 24. And then this was like 21 July, I think 21 April. I'm sorry, 21 April, 21. Something like that. Hard to tell. So does the do you know if the community has, like I haven't seen any prior DD or anything like that? I just don't know if anything like that exists. BH Mordek says I think Newton has a good breakdown. I looked at Newton's stuff. I think we looked at this together for the cat. I'm going to zoom out really far. I thought it was in here. Wait, I'm confused. No, not DRS. Where's his stuff? Wait, I'm so confused. I thought it was on this tab. Oh no, there was a tab called DFV. There's a, we're missing a tab here. I got a text them. I was literally just texting them. Did he fucking get rid of DFV? I'm texting Newton. Quick question. Did you get rid of the DFV tab? I'm asking because I'm trying to understand the prevailing theory behind when he bought the, how many options is it or how many shares? 4.8 million. When he bought the 4.8 million shares from his April 21 update, 2.8 million is 2.24 update. Let's see what Newton says. Magnum says stock split in 22 price adjustment. Yeah, we would have to, oh, that's a great point. Actually,",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 86,
      "start_timestamp": "01:11:51",
      "start_timestamp_seconds": 4311.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=4311"
    }
  },
  {
    "text": "options is it or how many shares? 4.8 million. When he bought the 4.8 million shares from his April 21 update, 2.8 million is 2.24 update. Let's see what Newton says. Magnum says stock split in 22 price adjustment. Yeah, we would have to, oh, that's a great point. Actually, great, great point. What was the split that happened in 22? 2022 stock split. And it's a 4 to 1. Okay, thanks. Equals this times 4. So then this equals this divided by 4. Okay, that's super helpful. Thank you guys. This was 2022 4 to 1. Great catch. See, this is, this is why genuinely, why I love doing this shit with you guys because you know stuff like this that I genuinely do not know. So this is going to be our summary stuff. So then really it's not that it equals this minus this, 4.2 mil. Okay, I got to change that really quick. 4.2 mil. Okay. All right. And it looks like, it looks like there's no general. Let me see if, let me see if chat GPT can dig up any research on it. And then his basis then was 13, 7, 9, 4. I'm going to go grab another drink or two because I'm super thirsty right now. I'll be right back. Thank you. B Without thinking. few moments longer than usual, but I thought the time would be well received because I went and got a guest for us. You know. We have",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 86,
      "start_timestamp": "01:14:18",
      "start_timestamp_seconds": 4458.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=4458"
    }
  },
  {
    "text": "going to go grab another drink or two because I'm super thirsty right now. I'll be right back. Thank you. B Without thinking. few moments longer than usual, but I thought the time would be well received because I went and got a guest for us. You know. We have the one and only Thor. He's coming into inspect. He wants to know when we're going to get to the bottom of this whole mystery. And you could tell he's very eager to get to those details. So Thor is ready to rock and roll. He's going to inspect what we're doing very carefully. There you go. All right. We're ready to. Uh, um, Ricky says Thor one is GM. He got a moon. When is Jimmy going to move when it's going to go up? Huh? When is Jimmy going to go up? You know. What's it going to go up? We're going to have to come up with like a Thor equivalent of a magic eight ball. I'm not sure what it is. I try to get him to hold stuff sometimes. He's not really good at holding things. Hello. Yeah. It doesn't really like holding stuff. You would think he might. He has these little tiny paws. Paw. Paw. Oh boy. Okay. I always figure it's worth a couple extra seconds on the break time to grab, grab the union lead here. Also, Norna's Thor. Robo says belly equals moon. I guess that's true because his tuxedo",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 86,
      "start_timestamp": "01:17:06",
      "start_timestamp_seconds": 4626.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=4626"
    }
  },
  {
    "text": "would think he might. He has these little tiny paws. Paw. Paw. Oh boy. Okay. I always figure it's worth a couple extra seconds on the break time to grab, grab the union lead here. Also, Norna's Thor. Robo says belly equals moon. I guess that's true because his tuxedo is very white. So maybe that's what he was indicating is that that went to the moon. Knife he says I just subbed about the content but damn Thor is a sweet. Yeah, Thor is a straight homie. He's also he's trained pretty well. Actually, I keep forgetting. I'll take a couple videos of him tonight on our walk, which his head just tilted when I said that because he, yeah, he's I spent a while kind of teaching him different stuff that I think is some useful, some not. Nothing from Newton yet. So we will we'll see what Newton. Newton has for us. I'll keep an eye on when he responds. Uh, often says don't forget. RK had cash position, cost basis of two or four. Yeah. Well, we'll take a look really quick. So the residual. Let's see. So this is equals this times this. So 106. One, two, wait, what is this? We want to do some for. Yeah. So then his cost basis here is what 22. For seven, oh eight. Which this equals. 2247, oh eight. That's on the delta shares. Oh, man, this is tricky. 94 mil. Uh, Robo says. Newton's video touched",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 86,
      "start_timestamp": "01:20:59",
      "start_timestamp_seconds": 4859.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=4859"
    }
  },
  {
    "text": "One, two, wait, what is this? We want to do some for. Yeah. So then his cost basis here is what 22. For seven, oh eight. Which this equals. 2247, oh eight. That's on the delta shares. Oh, man, this is tricky. 94 mil. Uh, Robo says. Newton's video touched on an RK exercise into force naked shorts to buy. When do we think he exercised from that video, Robo? We can take a look at that. So you mean on this most recent one? Or when? In May? When in May? When in May? Buy and may go away selling may go away. There's also a saying that goes along with may of some shit. Some about may. Yeah. If you guys let me know, um, well, Robo, if you can take a look at the video at some point, let me know and we can take a look. The, the reason why I think this happened here is because everything was caught completely off sides. That's what I think. Because we started seeing volume ramping in the stock. And let's take a look at the options markets from one to 10 May. And let's get rid of, we'll keep the bids for now. It doesn't really matter. May 10th, May 17th. So this is a big part of what I think happened here. Let me get rid of the restriction on the 20s. You know, that looks like. The thing that I don't think aligns well is the",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 86,
      "start_timestamp": "01:22:50",
      "start_timestamp_seconds": 4970.78,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=4970"
    }
  },
  {
    "text": "keep the bids for now. It doesn't really matter. May 10th, May 17th. So this is a big part of what I think happened here. Let me get rid of the restriction on the 20s. You know, that looks like. The thing that I don't think aligns well is the duration. Because this is like 11 days. But let's take a look. We now have references. Let's take a look at some of his old work and see if he bought like really short dated options like that. So this looks like all exits. This we can get rid of. I'm going to add a column here. And then I also, I want to go back to the beginning. Because we started from like one step here. So let me, let me finish satiating this desire. What I want to do is I'm just going to add a column like one he bought options. Because Newton already has somewhere where stock was bought. I know that that was done. But so I'm not going to replicate him adding stock. Plus we can also see when some of it changes. But I want to specifically look at the options. Because there's not a ton of times that he did it. So this should be, this should be pretty fast. Flip through. Because I started building this tracker after we had looked at a couple of these. Okay, so here's the beginning. This was 8 sap 2019. Let's do 8 step 2019.",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 86,
      "start_timestamp": "01:25:09",
      "start_timestamp_seconds": 5109.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=5109"
    }
  },
  {
    "text": "not a ton of times that he did it. So this should be, this should be pretty fast. Flip through. Because I started building this tracker after we had looked at a couple of these. Okay, so here's the beginning. This was 8 sap 2019. Let's do 8 step 2019. These I'm going to change the format because I want the year to be included since we're going back so far. Okay. Custom there we go. What the fuck? 2019. I don't care where Jimmy was. So total gain from the starting point. I think there might be a couple updates. So I'll start this one up here. So total gain was 40. 6. 4. 3. 3. 9. 6. Cash. I'm going to slide this over a little bit. You guys won't be able to see some of it. But that's okay. Cash in the account was 13962. 962. 13962.21. Value is 113962.21. Okay. So these I'm just going to copy up. Oops. None of that. And then here we're going to start with what he had. So here he's holding 15, Jan 21 calls. And his basis was 53 cents total. So then add this. And then this will be option trade. So this is already holding. So there's no trade that I'm going to flag for this. This is just what he's holding. And the thing that I want to track here. Trade this will be basis. This will be. ETE. Okay. So here's the 15 or it's.",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 86,
      "start_timestamp": "01:27:20",
      "start_timestamp_seconds": 5240.06,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=5240"
    }
  },
  {
    "text": "be option trade. So this is already holding. So there's no trade that I'm going to flag for this. This is just what he's holding. And the thing that I want to track here. Trade this will be basis. This will be. ETE. Okay. So here's the 15 or it's. Let's do. Expiration. Right. So here we have 15, Jan 21. Right price is the eight. Vases is 0.53. And then DTE is pretty simple, which will just be this minus the post date. But it's what he has to start, which is already kind of interesting. Okay. Let's eat. This is 11, 17, 11, 17. EG. 46. 433. 9.6. Damn, I thought we were dealt with this part. I didn't realize that I started so late. I thought there was only a couple that I was going to have to do. But it looks like I don't know how many times he posted 113962.21. And then there were no trades, no options trades. Okay, cool. 11 step. Oh, okay, cool. Yeah, I don't think there's a ton then. This one is 30 step. 2019. A EG. EG was 62.433.96. Passes 1124.98. Value is 117124.98. And 1000 at 53. Oh, I forgot. Good. Absolutely. Add size. Good. And I. Size is 1000. And then we'll add another one here just because it'll calculate it automatically. No work off our back this times this times 100. So no change still. October. 31 oct 2019 31 oct 2019. EG. 51 933.96. Cash",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 86,
      "start_timestamp": "01:30:32",
      "start_timestamp_seconds": 5432.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=5432"
    }
  },
  {
    "text": "I forgot. Good. Absolutely. Add size. Good. And I. Size is 1000. And then we'll add another one here just because it'll calculate it automatically. No work off our back this times this times 100. So no change still. October. 31 oct 2019 31 oct 2019. EG. 51 933.96. Cash is 11 939.05. Value is 117. 439.05. Okay. And there's no change to his option still. So the first thing I'm seeing is. I'm going to add another column here preemptively. Which is going to be. DTE at management. Because what I want to track here is the DTE that he runs. When he starts is massive. Right. So he's starting at 495 days. Which is obviously a really, really significant. These are just going to kill all of that. Is it's not going to have like any variant stuff to offer me. So there's 31 oct. Yeah. Okay. So this will be super quick. How many days are in November 29? Is that right? There's more than 29 days in November. He's just been. No. Okay. So TG 176. 433.96. Ash 628.66. Value 23628.66. Okay. And no changes. Okay. 11Ds. 19. James says November is 30. Thank you. I never there was like a knuckle thing you could do. But I never I never knew anything about that knuckle thing. TG here is 21882.38. 577.02. Value is 83 077.02. This will be also really interesting. I'm going to plot the change in portfolio value. That's going to be a",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 86,
      "start_timestamp": "01:33:42",
      "start_timestamp_seconds": 5622.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=5622"
    }
  },
  {
    "text": "never there was like a knuckle thing you could do. But I never I never knew anything about that knuckle thing. TG here is 21882.38. 577.02. Value is 83 077.02. This will be also really interesting. I'm going to plot the change in portfolio value. That's going to be a really, really interesting visual. Off-pun says arcade bought is very last long call. First campaign on 31. That first trading day after it was vealed through SEC that co-inid bought a 9 state got it. Okay. So let's see. That's 11Ds. I'm assuming there would be a month thing. Yep. 31Ds 31Ds 19. TG 21529.17. Damn it. 21529.17. Ash 22300. Oh, this is perfect because there's some movements in the options. 112 900.13. Eager to see what these are. All right. So let's see what changed in these options. Shall we? I don't know why it would stop there. So it's this one. So we sold 400 of the 15 Jan 21s. Okay. So this we are going to have to add. Sold 400. 15 Jan 21 calls. Added. 21. Okay. This is useful. 20. This is super useful. 21. Feb. 21. Feb. calls. At. Eight. Falls. Point one nine. We're going to have to check the DTE. Because that's what two months from this. Um. Yeah. I'll just add it in a second. Then the 17 April. 10 calls. We added 400 of these. 17 April 10 calls. We added 400 of those. At 0.2. At 0.2. Zero. And",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 86,
      "start_timestamp": "01:37:00",
      "start_timestamp_seconds": 5820.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=5820"
    }
  },
  {
    "text": "We're going to have to check the DTE. Because that's what two months from this. Um. Yeah. I'll just add it in a second. Then the 17 April. 10 calls. We added 400 of these. 17 April 10 calls. We added 400 of those. At 0.2. At 0.2. Zero. And then he added. 17 July. 12 calls. 600. And those were done for point one eight. And then I'll add one other note here so that he's still holding. He has the 15 Jan. 21. Eight calls. Four notes 600 of those. And that's at 0.4417. Okay, so this I'm going to have to this is kind of an annoying series of trades just because there's a bunch that happened there. But what I what I'm going to do is track the DTE for the closest. And then for what he added. So here the closest is 15 Jan. 21. And. It is 31 December 2020. So 31 days 2020. And then 15 Jan. 21. And is this. He's holding these with 15 DTE. Okay. Make sure I'm on the right one. I have to go down one row. Okay. So. This is fascinating. So we added 21 Feb. 21 Feb 21. He added 52 DTE. So we add. Here. Here. 52 DTE. 17 April. 107 DTE. And then 17 July. 17 July. 188 DTE. And then these are. 15 we said 15 Jan. 21. Yeah. 15. These are 15 DTE. Okay. I'm just reorganizing some of the. Some of",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 86,
      "start_timestamp": "01:39:41",
      "start_timestamp_seconds": 5981.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=5981"
    }
  },
  {
    "text": "Feb 21. He added 52 DTE. So we add. Here. Here. 52 DTE. 17 April. 107 DTE. And then 17 July. 17 July. 188 DTE. And then these are. 15 we said 15 Jan. 21. Yeah. 15. These are 15 DTE. Okay. I'm just reorganizing some of the. Some of the numbers here. So normally the lot size goes in the beginning. I'm just going to keep that standard. Throughout this whole thing. So it's easier to track. And then I'll be able to track all the DTEs. Despite the fact that there's. I don't love this format, but it'll work for us. Okay. So these I'm actually just going to kill these rows. 15 Jan 21s. And that was on 8. Step 19. So 8. Step 19. 495. I'm just going to keep the same format. Holding. 1000. 15 Jan 21 calls. 15 Jan 21. These are the eight calls. 495. DTE. 0.53. Then these are just going to kill for now. Okay. So let's D's. And 14 Jan 14 Jan 21. DG. I'm glad. I'm glad that this is going to be holistic. So there's the main benefit to going back and fill in this in. This should be 14 Jan 20. And there shouldn't be too many more. Total gain. Negative. 34 829. 0.03. Cash. 6441.9. Value. 56 541.9. All right. Let's see what's changed here. 17. Okay. So this is. This. This is interesting. This is really interesting. Oh, this is very exciting. Yes. So there",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 86,
      "start_timestamp": "01:42:29",
      "start_timestamp_seconds": 6149.82,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=6149"
    }
  },
  {
    "text": "be 14 Jan 20. And there shouldn't be too many more. Total gain. Negative. 34 829. 0.03. Cash. 6441.9. Value. 56 541.9. All right. Let's see what's changed here. 17. Okay. So this is. This. This is interesting. This is really interesting. Oh, this is very exciting. Yes. So there is absolutely evidence of him. There's absolutely evidence of him buying super shady cheap out of the money options. That are very short DTE. So we bought to open. 217 Jan 20. Which is 3 DTE. And that was done for 0.03. That's so cool. Very, very cool. So then he's still holding. 21 Fab. I'm going to do no change. Otherwise. And then 16 April. Do we have those in here? 17 April. Oh, how do I. I want this to. There we go. 17 July. So he still has the Jan 15s. But it looks like those 16 April. 21s were added. Yeah, because those weren't there before. So here he bought to open. 516 April. 21. 12 calls. Exploration here is 16 April. 21. The day of this update is 14 Jan. 14 Jan 20. 458 days. 458 DTE. And this was done for 60 sons. Okay. And. Okay. So now he has some 3 DTE options. Here. Here the closest DTE. This isn't 15. These are way longer. This should be 15 Jan 21 from 31 D's 19. 15 Jan 21 from 31 D's 19. 391 DTE. 391. And what I'm going to do is change",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 86,
      "start_timestamp": "01:45:46",
      "start_timestamp_seconds": 6346.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=6346"
    }
  },
  {
    "text": "And. Okay. So now he has some 3 DTE options. Here. Here the closest DTE. This isn't 15. These are way longer. This should be 15 Jan 21 from 31 D's 19. 15 Jan 21 from 31 D's 19. 391 DTE. 391. And what I'm going to do is change this. So that the order remains the same compared to his updates. So now the closest thing he has to expiration in this bundle is 58 52 52 DTE. So this is Ricky says yay question mark. Yeah. So the reason why this is very exciting to see is because I can clearly identify. This is the first time I've seen him buy really short dated options, which means it's much less of a departure for him to do this kind of thing as compared to if he never did this sort of thing. So the fact that this is part of it actually is really really cool to me. So it is yay. It's actually a pretty big yay for me at least. This is 31 Jan 2020. So 31 Jan 2020. TG. Negative 4 A 1 2 5.75. Cash here is 6441.99. Value is 42. 541.99. I'm going to release the how and really quick so that Mel can feed him. Okay. All right. So let's take a look at what happened here. We are now. The 17 Jan 21s are gone. 17 Jan 20s. 17 Jan 20. Looks like. I don't know what GameStop was trading for.",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 86,
      "start_timestamp": "01:49:08",
      "start_timestamp_seconds": 6548.38,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=6548"
    }
  },
  {
    "text": "to release the how and really quick so that Mel can feed him. Okay. All right. So let's take a look at what happened here. We are now. The 17 Jan 21s are gone. 17 Jan 20s. 17 Jan 20. Looks like. I don't know what GameStop was trading for. I'm going to go out on a. A. Wild guess here. And assume that they expired. I'm an idiot and I didn't catch the. The strike price from before. Over these seven calls. Yeah. I'm going to guess that it didn't get there. Is that correct? Vladimir says expired. Can anybody corroborate? This is January 2021. All food and said just look at his cash and cost basis they expired. Yeah. Let's take a look. So here. Cash no change. Yep. Agreed. So 17 Jan 20 these expired. Worthless. And then 400 600 600 500. Yeah. 400 600 600 600 500. Yep. Okay. Other than that no change. So then the closest DTE now would be those February 21s. So 21 feb 21. And then he has the. Was this up to eight 31 Jan 31 Jan. And. When he wait for those are 21s 20s. 21 DTE. 21 DTE. So now he's at 21 DTE for the near term. Okay. So now let's add another. Another one. And. Feb. This one is what 28 29 29 feb 20. Okay. And. Man, this is so fucking interesting. Fiji negative 42 377. 3 9. Cash 1 83. 83 value 44. 4",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 86,
      "start_timestamp": "01:51:31",
      "start_timestamp_seconds": 6691.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=6691"
    }
  },
  {
    "text": "So now he's at 21 DTE for the near term. Okay. So now let's add another. Another one. And. Feb. This one is what 28 29 29 feb 20. Okay. And. Man, this is so fucking interesting. Fiji negative 42 377. 3 9. Cash 1 83. 83 value 44. 4 83. 3. 83. All this stuff drops down. And really the main thing I want to see here now. Okay 17 April. We had 21 DTE. He did have something in feb. So we had the 21 feb. And. This should be 20. So yeah, the 21 feb. 20. And. Those were the eight calls. 315 28 calls. And. What's happened here? Cash is down so he spent money. Glad says sold those 21 feb for 4k. Okay. I don't think you can't. I don't think it's possible for you to confirm that. So. Yeah. That's tricky. I don't uh Vlad, how are you? It's been going to. In two, 10,000 to 58 20 for the yeah, it's not that simple though because at this point he's moving money in and out of the account regularly so like here 12k went out here 10 was added here 11 was dropped. The math doesn't confirm it Vlad. like it doesn't confirm it at all. It confirms that there's a delta, but you're completely foregoing the ability for him to add and remove money. Like there's a solid chance he could have added money. So again, to your point, he could have",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 86,
      "start_timestamp": "01:54:39",
      "start_timestamp_seconds": 6879.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=6879"
    }
  },
  {
    "text": "The math doesn't confirm it Vlad. like it doesn't confirm it at all. It confirms that there's a delta, but you're completely foregoing the ability for him to add and remove money. Like there's a solid chance he could have added money. So again, to your point, he could have sold those and actually we can take a look at it. We can see what the maximum value would have been, but look at the going price for those contracts. Yeah, let's do that. So this was the 21 Feb 28 calls. Let's take a look. Let's go to 21. Oh, yeah, okay, 21 Feb. 21 Feb. And well, now I have to go back a little bit. When did that was the end of Jan? And he still had them. And then the end of Feb, they're gone. So it would have been between Jan and Feb. And this is the Feb 21s. So let's take a look at that here 21 Feb. And then he had 400 of the eight. 400. So his position wasn't there. So he had the end of January. So the last they traded, it doesn't matter. So the next time they traded 4 of 18 Feb, then 19 Feb, there was another volume of 4. And then there's no transactions until 21 Feb. So off Putin, I don't think you're correct. At least based on what I see here. Because there's no volume, it looks like they expired worthless to me. And my",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 86,
      "start_timestamp": "01:57:23",
      "start_timestamp_seconds": 7043.18,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=7043"
    }
  },
  {
    "text": "of 18 Feb, then 19 Feb, there was another volume of 4. And then there's no transactions until 21 Feb. So off Putin, I don't think you're correct. At least based on what I see here. Because there's no volume, it looks like they expired worthless to me. And my guess is he added money. Because the going rate for the contracts, there's no volume. So maybe we go later in the day. And since. Well, and since. Yeah, but Putin, you're missing my point here. My point is there's no volume. Like there's no again, following his Feb update here. There's no volume is the so that that's what's confusing me here. I don't see how you're drawing that. I don't see how you're drawing that the eights came down. For 10 cents, because I don't see any volume for those eights. So yeah, that would be helpful to understand. Because what I like from what I see now, from the last point he updated, there were essentially no changes to the position. And then from what I can see here, there was no volume. Hence, hence my supreme confusion here. Let's see what it looked like in this time period. We got to grab the crowd favorite Yahoo Finance. Those are 21. No, they're not. What are you talking about, dude? These are 21 Feb 20. Oh, you're saying the ones I'm looking at. Wait, no, I'm not. Yo. Lad, you got to give me a break here.",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 86,
      "start_timestamp": "01:59:49",
      "start_timestamp_seconds": 7189.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=7189"
    }
  },
  {
    "text": "time period. We got to grab the crowd favorite Yahoo Finance. Those are 21. No, they're not. What are you talking about, dude? These are 21 Feb 20. Oh, you're saying the ones I'm looking at. Wait, no, I'm not. Yo. Lad, you got to give me a break here. You know that I am a I'm a simpleton. Yeah, okay. You can't confuse me. I'm easily confused. I'm very easily confused. I can be confused. If like colors change too fast, it's like it's like doing magic on a child. I'm very easily confused. It can happen in moments. All right. So we're looking in 2020. We're looking in Feb. Let's zoom in. Yeah. Yeah. So those look like they expired worthless, man. What is it? Two dilutions or does this account for the dilutions? Do you know if Yahoo Finance automatically updates the old chart? I think toss does. Matt says, brother, Kitty is a plant. Your math isn't off. What what does that mean, though? Like, what is the what is that theory behind the cat being a plant? I've heard other people say that before, but I don't understand the I don't understand the argument. Like, what's the what's the point of that? Of the cat being a plant? But yeah, based on what I see here so far at least, this looks like those expired worthless. I'll double check in a second, but that's what it looks like. So now the closest expiration that he",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 86,
      "start_timestamp": "02:02:03",
      "start_timestamp_seconds": 7323.66,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=7323"
    }
  },
  {
    "text": "what's the what's the point of that? Of the cat being a plant? But yeah, based on what I see here so far at least, this looks like those expired worthless. I'll double check in a second, but that's what it looks like. So now the closest expiration that he has from this update on 29th, Feb. That Lawrence is a plant like a fern. I love ferns too. So fun fact, I have a plant called Mr. Burns that I've taken with me everywhere. It's a piece of my dad's plant who's dead now. And I still it's it's come with me everywhere. And I actually have pieces of Mr. Burns that I've left all different kinds of places as because they it's the aloe vera grows like a mother. So then you have to like cut little pieces off to take a little piece with you because it's too big to take the rest of it. And yeah, that Lawrence says you named your plant. Yeah, I named it Mr. Burns because I remember I burned the shit out of my hand playing with fire as a young child when when I was with my dad we did a lot of hood rat shit. So Mr. Burns helped me a lot with the series of different burns that I've had. So yeah, 100. Cemicrition says I named my cars. I used to name my motorcycles, but I haven't named any of my cars yet. I don't know why.",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 86,
      "start_timestamp": "02:03:49",
      "start_timestamp_seconds": 7429.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=7429"
    }
  },
  {
    "text": "a lot of hood rat shit. So Mr. Burns helped me a lot with the series of different burns that I've had. So yeah, 100. Cemicrition says I named my cars. I used to name my motorcycles, but I haven't named any of my cars yet. I don't know why. But Mr. Burns is an OG. Cedric says the theory is that there's a rico case going on to catch all stock manipulation and he works for the state, but what? I don't understand that at all. Yeah, that argument wouldn't make any sense. I would love to hear Matt's argument or like what his position is. So I just don't understand it. Lance says could cause a lot of retail to fomo in and lose tons and premiums for worthless contracts. Now that at least I could understand the incentive there. Again, I I think that it's a really, really silly theory to be completely honest. Just because even in that scenario, hedge funds can make or not even hedge funds, but market making firms hedge funds institutions can make so much more money than what they could conceivably pull from retail by, you know, playing little games like that. So I struggle. I struggle with it from that perspective, but knifey says why would he stream to 600 people in claim it's just him working alone? I mean, what, what is it, what could you explain that to me? I don't understand that argument either. Yeah, I don't.",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 86,
      "start_timestamp": "02:05:21",
      "start_timestamp_seconds": 7521.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=7521"
    }
  },
  {
    "text": "that. So I struggle. I struggle with it from that perspective, but knifey says why would he stream to 600 people in claim it's just him working alone? I mean, what, what is it, what could you explain that to me? I don't understand that argument either. Yeah, I don't. Oh, okay, God, I was super confused. Matt says not saying he's not a phenomenal trader, but he drops his tweets to the minute of when price action violently hits. No one can know when volume. Oh, I see what you mean. I actually think you're looking at that backwards, to be honest. Right. I don't think that he is dropping tweets right ahead of when something moves. Most of what I see so far is when he tweets now, which is important to know. I mean, let's take a look at it. I'm down for a fucking and it's a field trip. Let me finish. Deb, let me more do we have. April, okay, perfect. Yeah, this is going to go fast. Let me finish this. And then let's do an analysis on when the cat tweets and what game stop price did. Can one of you do me a huge favor? And can one of you grab a list of dates that he tweeted from 2020 to presents, we can pick random dates. And what I'm going to do is I'm literally going to download GameStop data. And I'm going to do minute level data for those specific",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 86,
      "start_timestamp": "02:06:45",
      "start_timestamp_seconds": 7605.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=7605"
    }
  },
  {
    "text": "a huge favor? And can one of you grab a list of dates that he tweeted from 2020 to presents, we can pick random dates. And what I'm going to do is I'm literally going to download GameStop data. And I'm going to do minute level data for those specific days. And then we'll look at price behavior like to literally to the minute. I just need a list of dates to look for tweets. And I don't want like cherry picked dates. I don't want you to pick a date where he tweeted and we know it moved. I know that happened recently a couple times. I think it would be good to do it a little bit like sporadic picking random dates. Because that's how you test these kinds of things. But I just don't have an archive of like, oh, wait, wait, wait, wait, I think Newton does. This could be perfect. Hold on. Does this have dates? Posted date. Oh, fuck Newton. Newton fucking breaks my balls with this stuff. The formatting in his Google sheets makes it so difficult to analyze data. Matt says not saying he's not a phenomenal trader. No one can know. Yeah, we'll take a look, Matt. I don't think, yeah, I think that based on what I understand and like what I've seen, I do think that that's reversed. But we'll take a look. Because the other thing is again, like if he was tweeting right before that there's a",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 86,
      "start_timestamp": "02:08:21",
      "start_timestamp_seconds": 7701.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=7701"
    }
  },
  {
    "text": "Yeah, we'll take a look, Matt. I don't think, yeah, I think that based on what I understand and like what I've seen, I do think that that's reversed. But we'll take a look. Because the other thing is again, like if he was tweeting right before that there's a move, that that would literally get caught onto so fast, like so fast. 41122.59, cash is 117356.83, values 215, 589.33. And let's drag these down. Any changes here? All right. I'm going to do myself a huge favor. This is going to be a little bit annoying for a second, but I think it's going to be worth it. Oh, I want a little extreme there. So there's 1000. Okay, so this is the first trade. So here, sold to close, 400, 15, 2, 1 calls. What I'm doing is I'm just reformatting this so that it'll be much easier to look at all of this stuff going forward. So here he bought to open. Here he bought to open. And then here you bought to oh, perfect. So what I'm going to do is now I can essentially track all of these. Which will be much easier. All right. Go. edge to What size is we want all this size to be nine. Nope, that wasn't it. Why is this all fucked up? That's one. Okay, so here I'm actually going to add more. So then what I'm going to be able to do is look at all these",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 86,
      "start_timestamp": "02:09:53",
      "start_timestamp_seconds": 7793.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=7793"
    }
  },
  {
    "text": "Go. edge to What size is we want all this size to be nine. Nope, that wasn't it. Why is this all fucked up? That's one. Okay, so here I'm actually going to add more. So then what I'm going to be able to do is look at all these different positions and track when they're open and closed like this. 17 Jan. These. 17 Jan. 20. 21 calls. Or the eight calls. Wait, what fucking calls are these? Remember. When was this? Let's get it right. It was 3D to E. Wait. I'm fucked up. Oh, here we go. I got it. I got it. Everybody relax. I got it. Okay, perfect. So these go over here. So the 17 Jan. 27 calls. Those expired worthless. I. Okay. Yeah, need more water. So now. There was another that expired worthless. Is that what we were just talking about right now? Where we at. We are at 30 April. This is from the FAB update. I just want to confirm the positions I had for FAB. So we sold to close 400 and then he holds. 600. Those 20 ones. Okay. Good. Okay. So then. FAB has gone April. July. Jan. So we're missing some positions here. What was this one for? 14 Jan 2020. This post is from FAB. Stay here. 29 FAB. This is down here. And let's go to Jan. This is. This is. 10. Okay. So here. 21 FAB. Here. This belongs here. Do we have",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 86,
      "start_timestamp": "02:12:34",
      "start_timestamp_seconds": 7954.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=7954"
    }
  },
  {
    "text": "Jan. So we're missing some positions here. What was this one for? 14 Jan 2020. This post is from FAB. Stay here. 29 FAB. This is down here. And let's go to Jan. This is. This is. 10. Okay. So here. 21 FAB. Here. This belongs here. Do we have April? Yes. And calls. Yes. So this belongs here. July 12 calls. Longs here. He still has the same. Here. No change. And then. 16 April. So these belong further down. So we're going to go to Jan. Okay. Here. Okay. Cool. So now. This is Jan. So now we go to 29 FAB. Here. Perfect. 29 FAB. We still have. These. 21 FABs look like they're gone. Yeah. 21 FAB 20 calls. So these are gone. So 21. And then. So we have. So the FAB 20. Eight calls. Fired worthless. And then. And then. And then. 11. This goes here. Then he has April 17. So he still has those. The lie has those January has those. Then he has April 16. Yep. Okay. So that's good. And now let's go up here. April. So now April is the 30th. And this is where we left off. Right. So. July 17th 20. I don't know where these go. Oh, right here. So that goes there with 3D to E. Okay. Cool. So that's good. The lie is here. So that still exists. Is a 6 and a 12. So then he bought. And then. And so he was",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 86,
      "start_timestamp": "02:16:11",
      "start_timestamp_seconds": 8171.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=8171"
    }
  },
  {
    "text": "So. July 17th 20. I don't know where these go. Oh, right here. So that goes there with 3D to E. Okay. Cool. So that's good. The lie is here. So that still exists. Is a 6 and a 12. So then he bought. And then. And so he was on. 30. Well, between this update for 30 April. He bought. 17 July 6 calls. So here. About to open. About to open. Off food and says he sold. What do you mean he sold? He didn't sell. You mean like the total number. So he was. He was. He was. He was. He was. He was. He was. He sold. He sold. It looks like 100 of those. I'm looking at these six calls. Is those look like that got added. Let's go back here real quick to check. Yeah. So those got added. No, fuck me out, man. I told you. So, a lot of screws has had to log away. noise. It is mostly that. Highly, highly susceptible to getting completely fucked up. So here. He now. No, he didn't sell 100. What are you talking about? That they didn't exist before. So, watch with me. Here, there's no six call. There's none of them. 10, 12, 8, 12. There's no six call. Doesn't exist. No six call and a feb. We get here, the end of April, there is now a six call right there. Bro, look at 414, Yolo. Ah, ha, great catch. Necky snake.",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 86,
      "start_timestamp": "02:19:43",
      "start_timestamp_seconds": 8383.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=8383"
    }
  },
  {
    "text": "there's no six call. There's none of them. 10, 12, 8, 12. There's no six call. Doesn't exist. No six call and a feb. We get here, the end of April, there is now a six call right there. Bro, look at 414, Yolo. Ah, ha, great catch. Necky snake. So, we added the sixes on the 14th. So, we missed an entire day because of that sneaky little update. Great catch. So, this is 14 April, 20. So, TG is 127, 869. Dot 39. Passes 103, 857. Dot 12. Value is 298 394.62. Perfect. Yeah, great catch. I totally missed this entire update from this entire series because that was a fucking sneaky thing that completely was different from all the other ones. So, fantastic. Okay. So, let's take a look at the positions. So, the jans are gone. So, we sold to close, that right? This looks like he sold to close or exited. Now, these would have been sold to close. So, it took close 600. That right, that just seems so off. 15, Jan 21. Is the... All Putin says sold for 83. You can't, I'm gonna keep telling you, man, like you can't determine that. Because the problem is, is we don't know what cash is being added or removed from the account. So, you can't look at... You can postulate. It's completely okay to say, I think, but it is not okay to say sold for ex number of dollars, because we don't know",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 86,
      "start_timestamp": "02:22:12",
      "start_timestamp_seconds": 8532.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=8532"
    }
  },
  {
    "text": "Because the problem is, is we don't know what cash is being added or removed from the account. So, you can't look at... You can postulate. It's completely okay to say, I think, but it is not okay to say sold for ex number of dollars, because we don't know that. Okay. So, the 15 jans are now off. So, I'm going to... I'm gonna fill this as like a closing trade that I can use the same columns. I want all of these to not wrap, but to not expand. Okay. This is just gonna make it way easier for me to find stuff. So, these are still here. The 10 calls are still there. 17 July, 12 calls are still there. And then he bought to open some new ones. But these are still here. Okay. When did he do these? The 17 Jan 20s. I need to go back and fix those. Oops. 17 Jan 20s. That would have been here. Nope. Well, 31, thank you. Where's the December. That's January. Okay. Here we go. Thank you. Okay. No, he didn't get those here. He had the 15 Jan's. So then I think it's here. 14 Jan. Yeah, that's it. Okay. So 14 Jan. Is this one. So here. I need to add another row. So here he bought to open these. 3DT. I'm going to add that over here. Okay. And then this on his next update end of Jan. Which would have been the 10th",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 86,
      "start_timestamp": "02:24:51",
      "start_timestamp_seconds": 8691.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=8691"
    }
  },
  {
    "text": "Yeah, that's it. Okay. So 14 Jan. Is this one. So here. I need to add another row. So here he bought to open these. 3DT. I'm going to add that over here. Okay. And then this on his next update end of Jan. Which would have been the 10th on the row. This one. Perfect. Okay, cool. We are. We are in a great spot. Okay. All right, let me get caught up on the ideas. Jonathan says as far as when we look at the timing entry, I don't think it's a Jesse a special information. Yeah, I completely agree. I do not think he has any sort of special information based on what I see so far. Also shout out to the chat. There's 69 people in here, which is. Quite literally the exact correct number of people for this series. It would again, it would be great to have 169. That would be that would be like dream material for me. But I love the fact that it's 69. So yeah, really, really stoked. Damn, 70. Well, I'm glad somebody else joined, but I'm a little I'm a little bummed because we had a we had a perfect arrangement just one moment ago. I am sending Mel her dinner order before she murders me because she likes to wait for me to eat, but obviously. These go however I always tell her to like these are going to go however long they're going to go. I",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 86,
      "start_timestamp": "02:27:24",
      "start_timestamp_seconds": 8844.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=8844"
    }
  },
  {
    "text": "a perfect arrangement just one moment ago. I am sending Mel her dinner order before she murders me because she likes to wait for me to eat, but obviously. These go however I always tell her to like these are going to go however long they're going to go. I don't think anybody has any control. I don't have any control over it. I don't think you have any control over it. I think it just kind of happens. All right. So. Okay. I have like a. B H C or B H Murdoch says, dude was a millionaire before his GME position was greater than 50 K. I don't know if he was a millionaire, but I do think he had money. Because you like it was very clear that he opened up like a specific YOLO account. Matt says Moas will never happen. I wouldn't be surprised to see a run to a new all time high GME can't be valued at something. It's not worth the market one. Allow it. Well, Matt, I agree to a to a degree specifically related to. Moas, but I don't agree in terms of the market not allowing it because. Not permitting valuation at something it's not worth because that's actually not how markets work. Markets aren't perfect valuation machines. They're supply and demand measurements. So I don't agree with that. I do agree with the market won't allow it because the numbers that I've seen for Moas are literally insane.",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 86,
      "start_timestamp": "02:29:24",
      "start_timestamp_seconds": 8964.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=8964"
    }
  },
  {
    "text": "permitting valuation at something it's not worth because that's actually not how markets work. Markets aren't perfect valuation machines. They're supply and demand measurements. So I don't agree with that. I do agree with the market won't allow it because the numbers that I've seen for Moas are literally insane. Because I mean, they turned off the buy button before. And that was to prevent like quite literally a systemic collapse. So I completely agree with you. That they wouldn't allow GameStop to run into forever. Now, I also do think though that they could let GameStop run more and hurt the people that probably should be hurt. At least in my opinion. But yeah, I mean, they're not going to let GameStop just go into infinity. So the people that are like really hoping for Moas and whatnot, I get it. But yeah, I don't think it would happen. Okay, so this is 14 Jan. Which is row nine. Just make sure we're good. This worry bought those. Yeah, perfect. Okay, good, good, good. So all of this. Could be up one. So I need to lock this. How do I freeze this? Can you not freeze a column? Here. This will make my life much easier. Beautiful. Right now we're here. And this is where he did all this stuff. Perfect. Great. Now we go to 31 Jan. Beautiful. Okay, good. So 31 Jan. We believe these expired worthless. Cool. And then any other changes. So on 31",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 86,
      "start_timestamp": "02:31:00",
      "start_timestamp_seconds": 9060.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=9060"
    }
  },
  {
    "text": "Here. This will make my life much easier. Beautiful. Right now we're here. And this is where he did all this stuff. Perfect. Great. Now we go to 31 Jan. Beautiful. Okay, good. So 31 Jan. We believe these expired worthless. Cool. And then any other changes. So on 31 Jan here. As I look at it today, he should have 21, 5, 8. He does 17 April, 10. He does 17 July. 12. 16 April. 12. So that's good. Fantastic. Now we go to fab. Where is this one? What was this one from? Off Putin. Sold 100 each of the July. Six and 12s. No, I'm not there yet. He doesn't have those yet. It's the. That's up where he has those two updates that I missed the one. This one here. So this one is 14 April. Wait, no, where's the end of Fed. Here. 31 Fed. Okay, those are gone. Okay, great. So now we're down here. And a fab. So, and a fab. The 21 fabs are gone. He still has. The April 21s. So, 17 April 20s. So, 17 April 20s. So, 17 April 20s. So, 17 April 20s. So, 17 April 20s. Oh, no, they're there. I'm just an idiot. There's still there. So, there's 400 of those. That's good. The 21 fabs are gone. The 15 Jan 21s. Still has. 600 of those. Okay. 16 April 2112 calls. So, he bought those. It still has those. But now he has more of",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 86,
      "start_timestamp": "02:32:50",
      "start_timestamp_seconds": 9170.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=9170"
    }
  },
  {
    "text": "no, they're there. I'm just an idiot. There's still there. So, there's 400 of those. That's good. The 21 fabs are gone. The 15 Jan 21s. Still has. 600 of those. Okay. 16 April 2112 calls. So, he bought those. It still has those. But now he has more of them. So, here, he bought to open 500. 16 April 21. Calls. And these are April 21s. And these are April 21. And these are April 21 calls. And these. This update is 29 fab. So, 16 April 21. And then 29 fab 20. 412 DTE. 412 DTE. Perfect. Got that. That is fab. Beautiful. Okay. So, now is where he has the sneaky one. Yep. So, here's the April one. This is the one I missed before. 14 April. Okay. So, 14 April. He sold to close 600 of the 15 Jan. So, that's flat now. The 17 April. He offloaded 100, those. So, sold to close 100. Of this 17 April 20. I think these are the 10 calls here. Yeah, 10 calls. So, he got rid of. 100 of those holds 300. Okay. 17 July 12 still here at 600. No change. 16 April 21. No change. And then he added the July six calls, right? He has the 12s there. Yeah. So he bought to open 500 of the 17 July 20 six calls, which is what DTE 17 July 20. 17 July 20. Let's take a look at these. This is from 14 April 14",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 86,
      "start_timestamp": "02:36:09",
      "start_timestamp_seconds": 9369.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=9369"
    }
  },
  {
    "text": "And then he added the July six calls, right? He has the 12s there. Yeah. So he bought to open 500 of the 17 July 20 six calls, which is what DTE 17 July 20. 17 July 20. Let's take a look at these. This is from 14 April 14 April 20. This is 94 DTE. 94 DTE. And he did that for one five. What is it? Six calls one five. Okay. All of Pluten says, don't forget his first purchase of GME shares. I honestly don't care about the shares here. Be completely honest. Newton already has all the shares. I'll add it just at a respect since you flagged it. So 250 GME shares. But yeah, I don't really care about the shares. I've already done all the analysis on like the shares and stuff like that. I'm less, less interested in those in general. But off Putin says in the end, he only holds shares. It doesn't really mean anything to be honest. That sounds more of an idealistic kind of thing than anything, right? Because he, it like it, it like quite literally doesn't matter at all. He holds options straight up all the time. So I don't think that that really matters. Okay. So now we're good here. Let's go to this. And then after this one, I forgot what we were going to do. But I want to go do whatever it is we were going to do. What was that? Do you",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 86,
      "start_timestamp": "02:38:52",
      "start_timestamp_seconds": 9532.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=9532"
    }
  },
  {
    "text": "So I don't think that that really matters. Okay. So now we're good here. Let's go to this. And then after this one, I forgot what we were going to do. But I want to go do whatever it is we were going to do. What was that? Do you guys remember? And in April, here we go. I totally forgot what we were going to do. Okay. 17 July six calls. What you're here. Sold to close 100 of these. He's now holding 400. And then the 12 calls. 17 July 12 calls. Sold to close 100 of these. Holding 500. Okay. 16 April 12s. Thousand of those has those. These are gone. So the 17 April 20s. 17 April 20s. All Putin says we did this right. Yeah, we did. We did it for stop starting up here. I'm just getting caught up to close this gap because I didn't do it for this early stuff. So I want to, yeah, I just want to have it for this. So here the 17 April 2010 calls. They. 17 April. Let's see. So the last update was 4FAB 14 April 30 April. Okay. So let's see what it looked like there in 2020. April. This looks like these are split not split adjust. So what would these have been trading for? 14 he bought them. And then on the 30th of April. You guys know if Yahoo. If Yahoo is if they split adjust these are not because it",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 86,
      "start_timestamp": "02:41:05",
      "start_timestamp_seconds": 9665.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=9665"
    }
  },
  {
    "text": "like there in 2020. April. This looks like these are split not split adjust. So what would these have been trading for? 14 he bought them. And then on the 30th of April. You guys know if Yahoo. If Yahoo is if they split adjust these are not because it doesn't look like it because these would have been trading for what like four. 12 since two weeks prior. No, no, I'm talking about the stock. I'm just trying to see what the stock was going to be worth around here because we can see when he got into them in 17 Jan. Way back machine. Yeah, we could take a look. I don't know what thinkorswim does either, but let's take a quick look. Yeah, because it does this weird goofy shit that I can't tell what's what. Where we at 30 April. Putin says 573 close. Yeah, okay. So this is trying to do the split adjusted thing. It looks like on the. There it goes. So it looks like on the day that you look at it, it gives you the actual day, but then it does the split adjusted. So then. 598. Yeah, so those tens definitely would have expired worthless. So this would be 500 expired worthless. Okay, so that calms free now. Okay. Okay. And then what is this 17 Jan those are gone. 17 July. Oh no, okay, good. So he has those sixes though. Great. Okay, cool. Got it. I think we",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 86,
      "start_timestamp": "02:43:41",
      "start_timestamp_seconds": 9821.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=9821"
    }
  },
  {
    "text": "definitely would have expired worthless. So this would be 500 expired worthless. Okay, so that calms free now. Okay. Okay. And then what is this 17 Jan those are gone. 17 July. Oh no, okay, good. So he has those sixes though. Great. Okay, cool. Got it. I think we Gucci here. And then. That's 30 April. May, June, July, August, September, first. So I pick it up at September, first. We only have a couple left. May, June. This is 31 May, 20. Okay. PG. Negative. N554.75. Ash 8848.89. So fuck ton of eights. Value. 148.713.89. This all gets populated for us. No work required. And then let's take a look at these positions. So we have. 17 July. 12 calls. Those are still here. 500. At least the lowest 500. No change. Here. 16 Aprils. Those are still there. Thousand. That's done. Does he have 400. Of the July sixes. He does. Okay. Then he is the 16 oct 20s. Thought to open 200. With a 16 oct 20. Eight calls. And he did that for 35 cents. And then what's the DTE on those 16 oct 20. 31 May 20. So 138 DTE. The 80. Okay. So those are net new. 15 Jan 21s. So. I'm just getting this spacing on these so that I can more readily. See this stuff. Yes, we added those. 15. So bought to open 200. Of the 15 Jan 21. 15 calls. He did that for 20 cents. And then he",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 86,
      "start_timestamp": "02:45:39",
      "start_timestamp_seconds": 9939.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=9939"
    }
  },
  {
    "text": "those are net new. 15 Jan 21s. So. I'm just getting this spacing on these so that I can more readily. See this stuff. Yes, we added those. 15. So bought to open 200. Of the 15 Jan 21. 15 calls. He did that for 20 cents. And then he bought to open. 15. 200. 15 Jan 21. 20 calls. He did that for 0.1. So he's buying stuff that's like pretty far out of the money, which is also very interesting to me. So this is again 31 May 20. 15 Jan 21. 229 DTE. 148 kingdom Aideo mask. So. So it looks like so far, he's only done the short DTE option stuff once. And my guess is he realized that it doesn't actually... At least there, I think he realized it doesn't actually work that great. 30 June... 20... TG here is negative 15377.26. PASH 51101.69. Value 121271.69, Gaggedy. All right, let's see if there's any changes here. So we have... 16 oct, the 8, he's got those. He has got... 15 Jan 21s, 15s and 20s. Those got bigger. We added three block to open. I'm just going to do... plus 300. Comment plus. We added 300 both of those. This, I'm just going to change the format. So it's a little easier. Minus 100. Minus 100. Okay. So I see... 500 there, 500 there. What about these 16 ox did he do anything with those? Yeah, he did. He added 300. That's sneaky snake. Plus",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 86,
      "start_timestamp": "02:49:24",
      "start_timestamp_seconds": 10164.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=10164"
    }
  },
  {
    "text": "300 both of those. This, I'm just going to change the format. So it's a little easier. Minus 100. Minus 100. Okay. So I see... 500 there, 500 there. What about these 16 ox did he do anything with those? Yeah, he did. He added 300. That's sneaky snake. Plus 300. So he's building out here. The 17 July 12s. 500 of those fell the same. 17 July 6s. He had 400. So he sold another 100. The April's, there's a thousand. That's the same. Okay. So here it looks like... Any changes to the 12s? He had 500 of the 12s. Same. Okay. So he didn't add anything here. Well, I mean, any new line items. He bought... He bought more option. And sold some. Okay. That's June. July... Okay. Okay. Okay. So TG. Negative 61, 275.17. Ash. 26, 6, 3, 8.7, 8. Value. 112238.78. Okay. This all copies down. No effort required. All right. Let's see. Look at these options. The ox 16s. These are coming up soon. These are coming up. So, plus 300, which makes him at 500. So he added here, which is hilarious. So plus 300 here, which puts him at 500 here. Plus 300 here. Put some at 500 here. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Let's put some at 400 here. Let's put some at 1000. Plus. Which. Plus 500, which puts him at 1000. And then here minus 100. This put him at 400. Minus",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 86,
      "start_timestamp": "02:52:47",
      "start_timestamp_seconds": 10367.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=10367"
    }
  },
  {
    "text": "300 here. Put some at 500 here. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Let's put some at 400 here. Let's put some at 1000. Plus. Which. Plus 500, which puts him at 1000. And then here minus 100. This put him at 400. Minus 100. Put him at 300. Okay. Okay. Okay. Okay. Okay. Okay. All right. So here he added another 500. Yeah. Plus. Plus 500. Put some at 1000. He 15. It looks like you just moved to everything to 1000. Is one open? One. Okay. Okay. Okay. Something came off. I don't know what though. Okay. Put something came down. Off. Off. Off. Off. Off. Off. Off. Off. Off. Off. Off. Off. Off. Off. Five 15. And he won. What are these 15 calls for the 15s. and calls. And call. So here plus, plus 500, take some to a thousand. And that's for the tens, same thing for the 15s. The 15 Jan 2120. So we added those. So let's get rid of what we cleared out first. The 17 July. So these are gone. And these were the, no, wait, these aren't gone. They, they might be. Yeah. Ah, damn. So these expired worthless. These April 21s are still there. He's at a thousand. So that's the same. These July six is what we've done the same. That leaves them one, two, three, four missions, one, two, three, five. Okay. So I forgot which one he added, the 15s,",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 86,
      "start_timestamp": "02:55:54",
      "start_timestamp_seconds": 10554.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=10554"
    }
  },
  {
    "text": "damn. So these expired worthless. These April 21s are still there. He's at a thousand. So that's the same. These July six is what we've done the same. That leaves them one, two, three, four missions, one, two, three, five. Okay. So I forgot which one he added, the 15s, the June 1515. Let's do here. So here he bought to open 1000. Of the 15 Jan 2115. All's needed that for zero point one for. And then let's just do a quick pack and 31 July 20 168. 168. Okay. Excellent. All right. We are just about caught up then. We have August and then we're good. Most excellent. 31, 2020. 31, 2020. 441, 410.93. Cash 8391.84. Value 612.191.84. Hey, Newton texted me. Let's see what he says about the sheet. I can ask him what the sheet. It's at the value tab now at the bottom. So we just moved it. Still there. That's good to know. All right. So let's see if there's any. He changes here 16 oct 8's has him. So there's one, one, two, three, four, five, six, one, two, three, four, five. So we added something. The ox are there in 21s, 10s, 15s, it looks like he added the 17s. So here he bought to open 1000 of the, what is this? 15, Jan 21, 17 calls at 0.15. This is nuts. So he's just building massive, massive unit positions out here. See, this is, this is exactly what I was hoping",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 86,
      "start_timestamp": "02:59:19",
      "start_timestamp_seconds": 10759.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=10759"
    }
  },
  {
    "text": "15s, it looks like he added the 17s. So here he bought to open 1000 of the, what is this? 15, Jan 21, 17 calls at 0.15. This is nuts. So he's just building massive, massive unit positions out here. See, this is, this is exactly what I was hoping to start being able to identify with him because if you look at the movements that he's making, like this is literally just building units, like that's all this is this is 31, 20, 130, 70, and the part that I actually that's a lie, I actually take that back entirely. He's not building units. He's, he's creating leveraged directional exposure, like that's what this is. The reason why I say it's not building units is the options term when you buy like cheaper out of the money options, trying to gain a bunch of gamma that's building units, but these are so far out in time that their gamma is essentially going to be tiny like let's take a look at let's go back to this one because he did a bunch here on 31 July, 2020. And then we're finally all cut up here, which is fantastic new. But let's take a look at this. Let's go to what did I say 31 July 2020. 31 July. And let's take a look at those options. Because. The behavior is really interesting here to me. I'm going to wait for this to finish free buffering as it were. All",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 86,
      "start_timestamp": "03:02:35",
      "start_timestamp_seconds": 10955.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=10955"
    }
  },
  {
    "text": "But let's take a look at this. Let's go to what did I say 31 July 2020. 31 July. And let's take a look at those options. Because. The behavior is really interesting here to me. I'm going to wait for this to finish free buffering as it were. All right. Let's take a look at these. 15 Jan 21s. Yeah, man. That's crazy. That's absolutely crazy. So the normally if you go far out of the money like this, it's to build units and that's if you start to get a big move that gamma of your options will compound quickly and you can buy more of them right. And why he's able to buy a thousand of these he had some money at this point. So he could afford it anyways, but he can afford to buy more gross number of options by going super far out of the money like this. Now the really interesting part about this though is that my guess is that he had not priced targets because I don't think he trades with price targets. He literally have spent I haven't I haven't actually tabulated yet like how many gross hours I've spent looking at this stuff now, but we it's dozens. I think I think he's trading under the general premise of he thinks the stock is going to go up right. Obviously, but like that's the main thing to me. It looks like he's he's focusing on. So the really fascinating",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 86,
      "start_timestamp": "03:04:12",
      "start_timestamp_seconds": 11052.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=11052"
    }
  },
  {
    "text": "looking at this stuff now, but we it's dozens. I think I think he's trading under the general premise of he thinks the stock is going to go up right. Obviously, but like that's the main thing to me. It looks like he's he's focusing on. So the really fascinating component to this is he's essentially trying to play these as a leveraged delta play because if you can get a few thousand of these for super, super cheap on something. That you think is going to go up even though it's not building a massive gamma ramp necessarily so far out in time like for example, if I go 49 DTEs and we look at some of the options that are still super far out of the money. Like you'll notice that the game is are much like massive comparatively right. So if we look at a 10 delta here or even a 13 delta the gamma on these 168 is eight, but up here there's 16. Because options that are closer in time are going to have way, way, way more gamma. So it's not building a gamma ramp. It's way too far out in time for that. And this looks far more like trying to build leveraged directional exposure. The other thing that I cannot help it notice is that so far we've literally seen him do this once where he buys these much near term DTE options. He literally did it this once and then it",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 86,
      "start_timestamp": "03:06:11",
      "start_timestamp_seconds": 11171.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=11171"
    }
  },
  {
    "text": "And this looks far more like trying to build leveraged directional exposure. The other thing that I cannot help it notice is that so far we've literally seen him do this once where he buys these much near term DTE options. He literally did it this once and then it doesn't look like he touched it again, which I can't help but find that interesting the vast majority of his entries here, 495 DTE. He added more which would still be a couple hundred DTE 52 DTE 107 DTE 198 DTE 458 DTE 3 DTE. It's the only one that you see like that, which is 94 DTE for this one. Here it's 138 229 229 168 137. So if we were to plot those numbers the overwhelming majority of them are greater than 100 and essentially all of them except for one are greater than 90. I think that's really important because this this I don't know what this was. I don't know if he thought was there news on this day that you guys are aware of the 14th of Jan. Because that's also a weird day for the update. So what what happened there? 14th Jan. Here you go. All of a sales readout. So that's my guess. My guess that he thought something was going to happen around this it looks like he was playing the event itself because there's really no other reason for the departure on that and it ties well the fact that",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 86,
      "start_timestamp": "03:07:31",
      "start_timestamp_seconds": 11251.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=11251"
    }
  },
  {
    "text": "you go. All of a sales readout. So that's my guess. My guess that he thought something was going to happen around this it looks like he was playing the event itself because there's really no other reason for the departure on that and it ties well the fact that there was an event there. So that's what that looks like him trying to play that event with a little bit of money. So the overwhelming information that I have available now based on all of these old trades analyzing literally all of these old trades is that he has some very very clear tendencies in terms of holding duration. Delta selection DTE selection. And this clearly was a departure that was predicated on a specific event. So one of the artifacts we can take away from this is that if we see him play near dated options that probably in first he thinks an event is happening because otherwise all of these other options that I can see they tell me that he looks at them as just longer term opportunities to trade something to the upside with leverage. And then he doesn't touch these again until 25 know it looks like and it looks like he sold the 17s so I mean let's just break this down so he sold the 15 Jan 21 17s is that this one 15s the 17s so here. So I don't know what he did so here exited. I don't know exactly",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 86,
      "start_timestamp": "03:09:26",
      "start_timestamp_seconds": 11366.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=11366"
    }
  },
  {
    "text": "it looks like and it looks like he sold the 17s so I mean let's just break this down so he sold the 15 Jan 21 17s is that this one 15s the 17s so here. So I don't know what he did so here exited. I don't know exactly what happened it doesn't really matter. But what matters is I can see the change and then here he exited on the 15s alone. These ones on this one. And then no change no change change change and then here he took the tens down. 5 Jan 21 he took the tens which were this one. And then he takes the 15 Jan 21s. These ones. Oh yeah sorry BH Murdock. Okay so one Newton move the value tab to the it's on the value value tab at the bottom. So what he says that we don't have visibility on the shares or what price. He thinks he never sells GME he thinks he sells calls which I don't agree with. If he sold calls and played cycles yeah so he just talks about the Delta I see. So I'm going to let him got it interesting. Thanks. He's sold calls but could have. We've gone through all of his old options trades and not once has he sold. I think it's contrary to his thesis. So that's why I think that. So the 16 April 20s he took 200 down here so here it's minus 200 and then he's",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 86,
      "start_timestamp": "03:10:40",
      "start_timestamp_seconds": 11440.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=11440"
    }
  },
  {
    "text": "calls but could have. We've gone through all of his old options trades and not once has he sold. I think it's contrary to his thesis. So that's why I think that. So the 16 April 20s he took 200 down here so here it's minus 200 and then he's holding 800. So then the 15s he sells 300. He sells 500 shares. And then it looks like he exercised the 16 April. And these look like they would have expired worthless these 16 ox. And here. So these look like they expired. And then yeah that resolves them for what we have absolutely fascinating. And then we have the two June 24 come back that's where we'll pick up. BH Mordox says new and had a tab called Biggie's theory. Yeah I don't know I can ask him about that one but I have to hop off it's time to go grab dinner. And then I'll go grab a drink and then I'll go grab a drink and then I'll go grab a drink and then I'll go grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 86,
      "start_timestamp": "03:13:00",
      "start_timestamp_seconds": 11580.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=11580"
    }
  },
  {
    "text": "and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink and then I'll grab a drink",
    "metadata": {
      "video_id": "IsiLvT-L3vk",
      "title": "Analyzing Roaring Kitty's Trades Pt6 | GameStop Analysis Live Ep14",
      "url": "https://www.youtube.com/watch?v=IsiLvT-L3vk",
      "upload_date": "",
      "duration": 11739.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 86,
      "start_timestamp": "03:15:10",
      "start_timestamp_seconds": 11710.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=IsiLvT-L3vk&t=11710"
    }
  }
]