[
  {
    "text": "the best option strategy for busy traders. I went through a pretty significant portion of my trade and career on active duty in the Marine Corps, which as you probably can guess meant that I had very little control over my schedule. Yet I still traded for those six and a half years on active duty and it's by doing a lot of this. So I want to walk you through the strategy that I used and then I want to specifically get into details on how we can structure it so that it is super simple but still effective. What's up everybody? Eric here. We'll come back to all the outliers. Let's talk about trading some options. Okay. So the very first thing like I already discussed is the concept for this trade is we are willingly sacrificing optimization for simplicity. And what I mean by that is once you set up this strategy, which does take time after hours, you can literally deploy it within 60 seconds of having access to a computer for whatever the trading period is that you choose, which is the next bullet point here that it is flexible. So you can choose something as far out as six hundred eighty days plus or you could select something that's in the weeklies or something that's eleven days out. So you can select a time frame that fits your trading opportunity. What I will tell you is we want to try and keep them within",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "as far out as six hundred eighty days plus or you could select something that's in the weeklies or something that's eleven days out. So you can select a time frame that fits your trading opportunity. What I will tell you is we want to try and keep them within 60 days. That's our typical window that we're looking for and I'll explain why. And in case you couldn't tell from the preamble here, the strategy we're going to be talking about is the coverage triangle. So the very first thing I want to follow up with there is I'll throw a link in the video description below on how I trade the coverage triangle in depth because this is going to be a surface level overview. This is going to be way more of me telling what I think works best for me and less of the optimization aspect, which takes a lot more time because there are different ways I would trade the coverage triangle if I had more time in front of a computer. But this video is not for that circumstance. It's for the one we're talking about the business people. Alright, so what does this look like? We need to select a ticker up front. Again, I'm not going to go into scanning, screening, picking the best tickers. We're keeping it simple here. So for me, I would pick anything that you already like for buy and hold. So if you have a typical buy",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "look like? We need to select a ticker up front. Again, I'm not going to go into scanning, screening, picking the best tickers. We're keeping it simple here. So for me, I would pick anything that you already like for buy and hold. So if you have a typical buy and hold portfolio that you're looking to optimize or enhance just a little bit through options, this is really the kind of product that I would be selecting. So for me, I used index ETFs, IWM, anybody that follows the channel knows that I trade IWM a lot and there's a handful of reasons for that. I'll link to that in the video description below as well. But I also would venture into individual tickers. I have a few on right now actually today is too fed and I have the coverage triangle on in Tesla and Amazon. So I stfizer. I still trade it in individual tickers as well. liquidity. This is increasingly important depending on how you choose to deal with some of these optional components that we can add on and I'll explain that in a minute. But really, we just need something that has options. You're not going to be interacting with it super much unless you choose to. So liquidity becomes less important. Most of the trades are going to be taken to expiration. So you're not worried about a ton of adjustments. When we're talking about selecting the option, there are a few criteria",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "not going to be interacting with it super much unless you choose to. So liquidity becomes less important. Most of the trades are going to be taken to expiration. So you're not worried about a ton of adjustments. When we're talking about selecting the option, there are a few criteria that are important to us. I already mentioned the days to expiration. But reason why I like to keep them within 45 days is multiple full. The first one is if you take a look on a relative basis. So let's say this 45 day trade, this is using TD Ameritrade's on demand feature by the way. So this is back in time. Really right now we're looking at the market on four March 2019 because I want to walk through an example with you all. So anyways, just so that this stuff is going to look different than what it is today because this is back in time. So anyways, back in March, if we pick something that's 45 days out and let's call it a 30 delta, this 151, you're going to get 1.94. If we look at something that's 32 days out at that same 30 delta, it's a dollar and 62 cents. So you can see that there's really kind of an incremental loss and time value as we come further and further in. The real difference is you're moving slightly closer and closer to the money. So what's the point here? It's not that it's",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "it's a dollar and 62 cents. So you can see that there's really kind of an incremental loss and time value as we come further and further in. The real difference is you're moving slightly closer and closer to the money. So what's the point here? It's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not that it's not something we have weaklies here, then we go to monthleas and quarterleas. As you go further out in time liquidity in just the number of options change available to us changes. So the short answer here when it comes to DTE and delta and strike for a day's expiration for both the short put and short call I'm going to be looking ideally 60",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "go further out in time liquidity in just the number of options change available to us changes. So the short answer here when it comes to DTE and delta and strike for a day's expiration for both the short put and short call I'm going to be looking ideally 60 days in typically somewhere between 20 and 30 for I'm sorry 20 and 40 for delta and strike on the short put it's going to be something between a 15 and a 35 delta more often than not. The reason why I select those is to capitalize on the variance risk premiums. There are slight differences based on the expiration but we're keeping it simple. So anything between there is fine. And the strike price I'm talking about this more specifically for the short calls. I'm less concerned with the delta on the short calls once the trade is on because once we have the short calls against long stock I'm not really using delta to select my strike. I'm using the strike price against whatever my basis is which I'll show you the beginning of an example which will get into later but let's say if I buy 100 shares of or 200 shares of I WM at 100 and I sell a one oh I'm picking this one oh five call based on the relationship to my basis here I'm not picking it because it's a whatever delta the main thing is I don't want to have upside",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "shares of or 200 shares of I WM at 100 and I sell a one oh I'm picking this one oh five call based on the relationship to my basis here I'm not picking it because it's a whatever delta the main thing is I don't want to have upside risk so I'm going to avoid selling short calls below my basis because they just turn into a problem more often than not. And again we want this handspray relatively easy. The overall way that this strategy can roll out is once you refine it literally you put the trade on you come back after expiration you see what happened and then you adjust that is it. So that's why I select the deltas and the strike prices based on that. We'll talk about management in just a second I want to talk about some of these optional components. So like I said we are prioritizing simplicity. When I'm laying out here is probably one of the absolute simplest versions of this strategy that we can have but if you have a little bit of time you can start layering in just a little more detail. It's a little more time consuming but it can have really significant impacts on our profitability and the strategy. So for example we can integrate things like using moving averages linear aggression channels so to follow that example through if I pop over to the chart and I say okay I see the 150",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "time consuming but it can have really significant impacts on our profitability and the strategy. So for example we can integrate things like using moving averages linear aggression channels so to follow that example through if I pop over to the chart and I say okay I see the 150 day in the 50 day these are really the more important moving averages again for a simpler strategy for me. I as you can tell I use four moving averages because in my day to day normally I have more time I can do this so I am a little more specific on what I like but in this case again keeping it simple I would use 5150 if the underlying specifically falls below the 50 I come to a pause meaning I may not add more risk if it falls below the 150 or 200 I would consider either flattening or waiting to add risk until the 50 flattens out so if we follow that move here so we have the 50 that's trending it fell below the 50 so right now let's just pretend we were now paused whatever position we have on were paused and then price falls below the 150 now I'm not really wanting to add risk until I see the 50 flatten out and as you notice it's not flattening out it's not flattening out and then in here it starts to flatten out so a couple things happen you're gonna have some risk",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "falls below the 150 now I'm not really wanting to add risk until I see the 50 flatten out and as you notice it's not flattening out it's not flattening out and then in here it starts to flatten out so a couple things happen you're gonna have some risk on for this move unless you flattened which is a choice but it essentially keeps you from getting ran over on the way down now we didn't bottom ticket what I mean by that is we hit the low and you miss out on this move from 125 81 all the way back up essentially to 140 that is the lack of specificity but that's why it's so simple there's a trade off here we're picking very simple moving average protocols but there's gonna be a little bit of delay when they when they trigger the other thing is linear regression channels so one of the things I like to do is in the same exact example I would integrate once it starts getting below a minus one and especially a minus two linear regression channel I probably would add a little bit of risk and the way that I modulate that risk is through scaling and I'll talk about that in a second but you can use technical analysis just like that in really really simple ways to help optimize the performance with just a little extra time added or you could say I don't have time for that",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "modulate that risk is through scaling and I'll talk about that in a second but you can use technical analysis just like that in really really simple ways to help optimize the performance with just a little extra time added or you could say I don't have time for that and that's also fine it will still work just fine and then the last one is rolling auto box roll out you can choose to roll options I have plenty of videos on that or you could choose not to it really doesn't matter but that is another way you can optimize the profitability of these trades I just rolled a trade recently to increase my overall profit potential by a few hundred dollars I have the time so I did it but you don't have to if you don't have the time let's talk about how this looks the management so we talked about identifying the ticker that we like right so we have that we're gonna sell a cash secured put there's two scenarios that happen either you get a sign on that cash secured put or you do not that's it if you don't get assigned you can just sell another cash secured put if you do get assigned there's now two more choices available to us we can sell an additional cash secured put if we want to add more risk or we can sell an uncovered call provided we can sell that short call above",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "can just sell another cash secured put if you do get assigned there's now two more choices available to us we can sell an additional cash secured put if we want to add more risk or we can sell an uncovered call provided we can sell that short call above our basis you know what you're saying Eric why uncovered it's because we don't want to cap our upside potential so our PL graph of a normal covered call will have a flat top at some point when your long shares are equal to the short shares tied into the short call by doing an uncovered call our upside looks like this it remains an upward slope it means that we don't have a max profit potential on the trade it's unlimited when you're using a hands-off strategy not capping your upside is very very important this is such an important detail that a lot of people miss because they'll say well covered calls they don't keep pace with the market what the hell they can if you're smart about it and this is one of those details that makes a big difference and then on that uncovered call if you're assigned it just means you're gonna sell the shares at that price and then you just go back to selling cash secure puts if you're not assigned you can choose to continue selling uncovered calls you may get to a point where you can't collect enough premium in order",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "you're assigned it just means you're gonna sell the shares at that price and then you just go back to selling cash secure puts if you're not assigned you can choose to continue selling uncovered calls you may get to a point where you can't collect enough premium in order to or I'm sorry you might not be able to sell a short call that gives you really any premium that's above your basis and in that case that's when selling additional coverage cash secure puts or buying additional shares to reduce your average basis is really useful. Okay last thing I want to talk about are these couple scenarios and then I want to give you an example so in these scenarios if the stock lands between your strikes meaning the short call and short put you just keep doing what you're doing you just reload come on back if the stock is above your short call you're gonna lose the shares go back to selling more short puts to get the risk back out there if the stock is below your short put you're going to buy additional shares at that strike price keeping the premium that's it that's how this whole thing works so this is one of the best possible ways to optimize a buy and hold portfolio so let's take a look at an example here let's say we have a hundred thousand dollar account iwm's training around a hundred bucks we decide to include",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "that's how this whole thing works so this is one of the best possible ways to optimize a buy and hold portfolio so let's take a look at an example here let's say we have a hundred thousand dollar account iwm's training around a hundred bucks we decide to include some scaling I think it's a really smooth way to make sure that you have room to adjust your basis if we're in a prolonged down move so for example some scaling protocols you might consider you could have an initial outlay of 70 and then you can have whatever scaling details you want on the way down but the main thing is the initial so what this means is on this one hundred thousand dollars account you can use up to 70 on your first trade that's if we are greater than 20 away from all time highs in the underlying why do I select this it's because the propensity when we're near all time highs is you have much farther to move down than when you're near all time lows but this is important to remember using the moving averages is part of this thought process because something that is decreasing can keep on decreasing for a long time before it slows down so you don't want to run out of money too fast so the other thing you could do is if we're not greater than 20 off of all time highs your initial trade is up",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "that is decreasing can keep on decreasing for a long time before it slows down so you don't want to run out of money too fast so the other thing you could do is if we're not greater than 20 off of all time highs your initial trade is up to 50 so that means you can use up to 50,000 on your initial trade. Okay great that's just an idea I have slightly different variations I've used this in different market environments based on volatility but this is just a again very simple back of the napkin here's an idea let's talk about the outlay here so on the initial trade we're going to buy 200 shares at a hundred dollars 20k then we're going to sell to open two of the 95 puts at a dollar so we're going to collect 200 bucks and then we're going to wrap up another 19k essentially we're just taking whatever the cash security amount is for this that gives us that 200 credit then I'm going to sell one 105 call the reason why it's only one is because we have 200 shares and I want uncap profit potential so I'm going to only do one there's a trade off here the more short calls I sell up run the more money I get the lower my future profit potential the other thing the closer my short call strike is to my actual basis the more money I'm going to collect",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "going to only do one there's a trade off here the more short calls I sell up run the more money I get the lower my future profit potential the other thing the closer my short call strike is to my actual basis the more money I'm going to collect up front but the less total profit potential the trade will have you got to pick whatever's right for you the next thing is that'll bring in a dollar so it's a hundred dollar credit so overall I brought in three hundred dollars in total credit on the initial outlay of 39,000 and then we have the profit potential for another five hundred dollars in capital gains so overall you're looking at about a two percent return on your money in a month now that's two percent on thirty nine so what do we do with the remaining money that's not being tied up in the trade so we have sixty one thousand thousand dollars that's tied to this that we're not using you have some choices you could use more of it if again if you're a typical buy and hold investor you're using most of it anyways because if you're a buy and hold investor you have to buy the stock and that's all the capital being outlaid so it's same same the other thing you could do is if you have the time you can set up box spreads you can use box spreads on the remaining",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "if you're a buy and hold investor you have to buy the stock and that's all the capital being outlaid so it's same same the other thing you could do is if you have the time you can set up box spreads you can use box spreads on the remaining sixty one thousand dollars in this scenario to earn the risk free rate while the rest of is being used there are lots of ways to structure this but the name of the time is keeping it simple you should be able to log into the platform you should place your traits takes less than sixty seconds straight up you come back not mid week not mid month after expiration if it's set up like this it doesn't matter what happens you just come back to see what happened so that you can make the necessary next steps in the strategy if you want to be a little more involved that's when we look at things like having more detailed scaling protocols based on volatility off of all time highs moving averages technical analysis things like that you can also start creating rolling to make sure that you're increasing your absolute maximum profit potential but all of that optimization starts to add a little bit of complexity here and there which may or may not be for you overall you don't need it you can trade something just like this pretty effectively I double this with my ratio leap diagonals",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  },
  {
    "text": "absolute maximum profit potential but all of that optimization starts to add a little bit of complexity here and there which may or may not be for you overall you don't need it you can trade something just like this pretty effectively I double this with my ratio leap diagonals and those are most of the strategies I trade while I was on active duty in the Marine Corps because I didn't have the time so if you made it to the end don't forget like subscribe be an outlier see you all later",
    "metadata": {
      "video_id": "ITG5Za7EH4o",
      "title": "SIMPLIFIED Covered Strangle Option Strategy",
      "url": "https://www.youtube.com/watch?v=ITG5Za7EH4o",
      "upload_date": "",
      "duration": 907.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ITG5Za7EH4o&t=0"
    }
  }
]