[
  {
    "text": "What's up outliers launching one of the very few giveaways we do to celebrate hitting 30,000 subscribers when we get there? I am currently here the man with the plan. He just moved underneath me instead of his heated blanket, but we were talking about it and we think we have a pretty good plan for what we're gonna do. The idea here is I really do celebrations like this just because I know 30,000 isn't that many, but in the context of our audience and like what we do, that's actually pretty cool. So what I want to do is host a live stream and then also a giveaway. The live stream will be to tell some trading war stories, give you a bit of a behind-the-scenes look into what goes into building the YouTube channel and the community. I know I'm always interested in that when I see other channels, so figure it out and be kind of cool to give you all look into that. But then the giveaway will be for a one hour one-on-one strategy session with me. We're gonna take a comprehensive look at your entire trading approach and look for ways to optimize it and make it better. This is what I've done over the last 18 years of trading in my life and I hope and think it will be pretty useful for whoever wins. So to enter, it's pretty straightforward. All you have to do is hop in the comments. In",
    "metadata": {
      "video_id": "iToGJQco6Tw",
      "title": "30K Giveaway - Win a Portfolio review! #optionstrading #trading",
      "url": "https://www.youtube.com/watch?v=iToGJQco6Tw",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 2,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iToGJQco6Tw&t=0"
    }
  },
  {
    "text": "it and make it better. This is what I've done over the last 18 years of trading in my life and I hope and think it will be pretty useful for whoever wins. So to enter, it's pretty straightforward. All you have to do is hop in the comments. In drop, your biggest trading lesson that you've learned so far. This is so that we can share ideas with one another and subscribe. If you do those two things, you are entered. And then if you would like a second entry for yourself, all you need to do is share the video with one of your friends. And then add a comment with what trading topic your friend would find interesting. And then I'll use those to build videos in the future. So if you have any questions, let me know. We'll announce the winner during the live stream after we hit 30,000. So the sooner we get there, the sooner we kick all this off. Be an outlier. See you all later.",
    "metadata": {
      "video_id": "iToGJQco6Tw",
      "title": "30K Giveaway - Win a Portfolio review! #optionstrading #trading",
      "url": "https://www.youtube.com/watch?v=iToGJQco6Tw",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 2,
      "start_timestamp": "00:01:02",
      "start_timestamp_seconds": 62.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iToGJQco6Tw&t=62"
    }
  }
]