[
  {
    "text": "the market doesn't always do what we want. If you're anything like me actually most of the time it does is the exact opposite kind of makes things difficult. The goal of the video for today is to walk you through in advanced rolling technique for options. Now I have a bunch of videos that go through the ins and outs of what rolling is the basics, the accounting, all that stuff will throw links to that in the notes below. So we won't waste any time on it, but I want to pick up from one of the really interesting elements of an option. Now we're a quick recap for those that might need to refresh. A roll is super simple. You have trade one. This is an opening trade. You have trade two. This is a closing trade. And then you have trade three which is an opening trade. So effectively what's happening during a roll is you are opening a trade and then you are closing it. This realizes the position. Now this can be for a profit or a loss depending on if you made a loss money. And then the concept of a roll is we're opening another trade that's tied to this prior trade. And this is essentially what rolling amounts to be. You have a realized PL from this portion of the trade. Now you have a new open trade with an unrealized PL. And a really important note, I was actually just",
    "metadata": {
      "video_id": "iwQmDPafTCc",
      "title": "Rolling Options Explained: Advanced Techniques",
      "url": "https://www.youtube.com/watch?v=iwQmDPafTCc",
      "upload_date": "",
      "duration": 950.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iwQmDPafTCc&t=0"
    }
  },
  {
    "text": "we're opening another trade that's tied to this prior trade. And this is essentially what rolling amounts to be. You have a realized PL from this portion of the trade. Now you have a new open trade with an unrealized PL. And a really important note, I was actually just having this conversation with somebody in the comment section, is that this realized PL will hit your net liquidating value. And then your unopened PL, the credit that you receive, your net liquidating value is hunch. So your net lick is hunch, meaning it doesn't change, but you will have that credit in your cash and sweep. The reason why this is so important is because of longer duration rolls and how your account can erode in net lick, which at some point can lead to your cash and sweep not being large enough or your margin requirement exceeding your cash and sweep or your net lick, which leads to either trading on margin margin calls again. We have a couple of videos in the notes that we'll talk through this. So let's use a recent trade, actually, that I did this exact technique I'm going to talk to you about. And again, the way to think about rolling is it's just a series of traits. There are no rules. So one of the things that I like to do is let's say up here in T-TripleQs that I had sold to open puts. And then as it goes down,",
    "metadata": {
      "video_id": "iwQmDPafTCc",
      "title": "Rolling Options Explained: Advanced Techniques",
      "url": "https://www.youtube.com/watch?v=iwQmDPafTCc",
      "upload_date": "",
      "duration": 950.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 13,
      "start_timestamp": "00:01:05",
      "start_timestamp_seconds": 65.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iwQmDPafTCc&t=65"
    }
  },
  {
    "text": "about. And again, the way to think about rolling is it's just a series of traits. There are no rules. So one of the things that I like to do is let's say up here in T-TripleQs that I had sold to open puts. And then as it goes down, I buy to close those puts and then I sell to open new puts, trying to adjust my basis. And then it keeps going down. Well sooner or later you might find yourself assigned. Or an alternate scenario is you actually just bought to open shares. Up here. So we have shares. Now, at some point during this, you might say to yourself, well, if I hold shares, there's only a couple of ways I can effectively adjust the basis of my shares. The first one is to buy. The second is to sell more shares. That's effectively how you change your basis if you hold shares. So what I'm highlighting here is that your cost basis is static, not dynamic. One of the cool part about this rolling scenario is my basis here might be 80. And then as we're going down, I might be able to get my basis down to 77, right? So my basis just changed three points. Effective, useful. So I have a mobile basis. Now again, there's tradeoffs to everything. The tradeoff here is that if for whatever reason, the underlying decides to start skyrocketing up, you have to be pretty on top of",
    "metadata": {
      "video_id": "iwQmDPafTCc",
      "title": "Rolling Options Explained: Advanced Techniques",
      "url": "https://www.youtube.com/watch?v=iwQmDPafTCc",
      "upload_date": "",
      "duration": 950.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 13,
      "start_timestamp": "00:02:19",
      "start_timestamp_seconds": 139.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iwQmDPafTCc&t=139"
    }
  },
  {
    "text": "basis down to 77, right? So my basis just changed three points. Effective, useful. So I have a mobile basis. Now again, there's tradeoffs to everything. The tradeoff here is that if for whatever reason, the underlying decides to start skyrocketing up, you have to be pretty on top of your game to either buy back in or so on and so forth. We'll talk more about it. Now, I want to talk about now a really uncommon approach to rolling an option. And it's very different than what a lot of people will talk about. But it's effectively taking your first trade from shares or whenever you end up with shares. So again, trade one is going to be long shares. Trade two is going to be sell to close the shares sell to open puts. So we're effectively moving from asset classes. We're moving from shares into puts. Now, how does this work? It's actually really, really simple. It's taking the concepts of rolling, which again, is just taking different trades and tying the accounting together for the trades. That's literally what you can do to move between shares, options, options, shares. And this is to lean into the benefits of both because if you're an option trader, you shouldn't always just bucket yourself into only trading options. There can be points where trading some of these other things can be really, really effective. So in the concept in this case, we don't know that this part of",
    "metadata": {
      "video_id": "iwQmDPafTCc",
      "title": "Rolling Options Explained: Advanced Techniques",
      "url": "https://www.youtube.com/watch?v=iwQmDPafTCc",
      "upload_date": "",
      "duration": 950.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 13,
      "start_timestamp": "00:03:38",
      "start_timestamp_seconds": 218.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iwQmDPafTCc&t=218"
    }
  },
  {
    "text": "the benefits of both because if you're an option trader, you shouldn't always just bucket yourself into only trading options. There can be points where trading some of these other things can be really, really effective. So in the concept in this case, we don't know that this part of the market happens. Right. So this entire side of the chart get rid of it. Pretend you're still back where the tariffs are coming out. The tariffs are bad. It looks like the tariffs might have some sort of give. And then they don't have any give in the rest of the world is starting to say, well, we're going to have retaliatory tariffs. So the news is bad. And the depth of this is completely unknown. So in this case, it was a real trade where at this point, I had 800 shares. This is part of the model covered triangle portfolio. If you've been following that series and teach teach real cues and other ETFs. But I had 800 shares of TQs at a basis of 64.3. Now, if you'll notice down here, we hit a low of 35. So what ends up happening is as your basis. So let's say that this is share price on a scale. Let's say that this is us with our basis of 64.3. If the equity is still trading around this rate, we're going to range. It's no problem. We can still sell calls that we're going to get a decent",
    "metadata": {
      "video_id": "iwQmDPafTCc",
      "title": "Rolling Options Explained: Advanced Techniques",
      "url": "https://www.youtube.com/watch?v=iwQmDPafTCc",
      "upload_date": "",
      "duration": 950.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 13,
      "start_timestamp": "00:05:11",
      "start_timestamp_seconds": 311.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iwQmDPafTCc&t=311"
    }
  },
  {
    "text": "So let's say that this is share price on a scale. Let's say that this is us with our basis of 64.3. If the equity is still trading around this rate, we're going to range. It's no problem. We can still sell calls that we're going to get a decent credit. We don't have to go super far out of the money and those kinds of things. However, if the equity starts to go down here into the 40s, well, now there's a big difference between these. And if I choose to sell calls, if I want to collect anything resembling a decent premium, it's going to have to be below my basis, which puts me in at risk. Now, again, it's not the worst risk on earth. There are things you can do to manage it. But nonetheless, it's a risk that has to be managed because the scenario here is if it rallies super hard like this and you have these short calls below your basis, you can get stuck. Now, on the short call side of things have to sell below your basis. It's a whole other problem to have. So what I ended up doing was saying, well, I don't want to deal with that part of the equation. And I didn't want to bother holding the shares of T-Triple cues, and I'll show you a specific reason why it's because of this. Now, I know it's a little blurring, it's just a screenshot. But what",
    "metadata": {
      "video_id": "iwQmDPafTCc",
      "title": "Rolling Options Explained: Advanced Techniques",
      "url": "https://www.youtube.com/watch?v=iwQmDPafTCc",
      "upload_date": "",
      "duration": 950.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 13,
      "start_timestamp": "00:06:25",
      "start_timestamp_seconds": 385.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iwQmDPafTCc&t=385"
    }
  },
  {
    "text": "saying, well, I don't want to deal with that part of the equation. And I didn't want to bother holding the shares of T-Triple cues, and I'll show you a specific reason why it's because of this. Now, I know it's a little blurring, it's just a screenshot. But what I want you to pay attention to is this is showing you the price of price performance year to date of QQQQ. And today is the 20th of May and you can see QQQ is up 1.2. Great. However, you can see T-Triple cues is down 12. This is volatility to K. So this is why I'm disinterested in holding the shares as it's plummeting this way. You can choose to dollar cost average and stuff like that. Again, there's a lot of different ways to manage it. But I chose this route instead. All I did was sell to close my shares and I closed them when TQQs was trading around, let me see, 41.95. So this realizes a loss of 17,880. So what do you notice? If we go back to the basic concept of rolling, well, here's trade one technically, it wasn't just 800 shares at 64. It was averaged in, but we'll just call it trade one. Then here's trade two. So what comes next in a row? Right three. Get into the options. And that's exactly what I did. And we'll take a look at the options position now in the way that I thought",
    "metadata": {
      "video_id": "iwQmDPafTCc",
      "title": "Rolling Options Explained: Advanced Techniques",
      "url": "https://www.youtube.com/watch?v=iwQmDPafTCc",
      "upload_date": "",
      "duration": 950.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 13,
      "start_timestamp": "00:07:29",
      "start_timestamp_seconds": 449.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iwQmDPafTCc&t=449"
    }
  },
  {
    "text": "It was averaged in, but we'll just call it trade one. Then here's trade two. So what comes next in a row? Right three. Get into the options. And that's exactly what I did. And we'll take a look at the options position now in the way that I thought about getting into that options position. So if we hide this and we jump over here, this was effectively where T-Triple cues was. I'll update this 41.95. And this little unassignment trackers super easy to build. You can tell you literally only need six inputs. Let me zoom this in so it's a little easier for you to follow along. Hopefully that's maybe we'll go a little further than that. We're going to do honey. There you go. Even if you're visually disenclined, this should meet your need. So you can see that we have the current spot price at the time. This was on the seventh of April. Fun fact, literally completely bottom-ticked it perfectly. Seventh April, this is where I exit at the stock, of course. Going back to the beginning of the video. Rarely goes the way that you want such as the life of a trader. So I exit there. And the reason why I exit there is because for the coverage triangle, I was using about as much as I wanted to use because you never know how far T-Triple cues is going to go down. So at this point, I wanted to gain that",
    "metadata": {
      "video_id": "iwQmDPafTCc",
      "title": "Rolling Options Explained: Advanced Techniques",
      "url": "https://www.youtube.com/watch?v=iwQmDPafTCc",
      "upload_date": "",
      "duration": 950.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 13,
      "start_timestamp": "00:09:01",
      "start_timestamp_seconds": 541.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iwQmDPafTCc&t=541"
    }
  },
  {
    "text": "So I exit there. And the reason why I exit there is because for the coverage triangle, I was using about as much as I wanted to use because you never know how far T-Triple cues is going to go down. So at this point, I wanted to gain that spot price sensitivity through the vector I told you by having a very variable basis super important. So then I told you the basis for the shares already was 6430. It was 800 shares. So it means that I originally spent 51-4440. And I at the time of closing ended up realizing them where their value was 33-560. So if I reorder this so it's a little easier to follow along with the math for those that might not find the super intuitive, I'm essentially realizing that PL of 1780. So then what I did is I moved into options. So on the seventh of April, I went out to the two May 63's. So the first thing to note is take a look at my basis here's 6430 and I was able to get into the 63's. Those are still deep in the money. The Delta on those was an 82 Delta super deep in the money. The premium I collected on that was 21. Now notice what I can do. I can literally do the math and I can say how many do I need to sell at these details? Well really these two details in order to",
    "metadata": {
      "video_id": "iwQmDPafTCc",
      "title": "Rolling Options Explained: Advanced Techniques",
      "url": "https://www.youtube.com/watch?v=iwQmDPafTCc",
      "upload_date": "",
      "duration": 950.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 13,
      "start_timestamp": "00:10:10",
      "start_timestamp_seconds": 610.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iwQmDPafTCc&t=610"
    }
  },
  {
    "text": "an 82 Delta super deep in the money. The premium I collected on that was 21. Now notice what I can do. I can literally do the math and I can say how many do I need to sell at these details? Well really these two details in order to cover this loss. This is the idea of rolling for a credit. So all I did was say in order to cover this loss, I really would need to have sold nine. Well you can't do parcels and so that's why it would be nine. However, I chose to sell eight and it was to manage more of the portfolio because again, I have it with the specific allocation. So if I add another hundred shares for the sake of just covering this loss, it can put me in a disadvantage position in case it keeps crashing. Again, at this point we don't know what's going on. So I went with eight lots. The reason why I did this is because I actually am able to reduce some of the basis on the trade because as you can see, the original cost to get into the trade was 5140 and that was to get 800 units. Don't worry about the basis of the units, 800 shares of TQs. So then in this case, I'm able to stay at 800 shares of TQs. I'm able to reduce my basis 6430 to 63, which is where that basis reduction comes from that",
    "metadata": {
      "video_id": "iwQmDPafTCc",
      "title": "Rolling Options Explained: Advanced Techniques",
      "url": "https://www.youtube.com/watch?v=iwQmDPafTCc",
      "upload_date": "",
      "duration": 950.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 13,
      "start_timestamp": "00:11:26",
      "start_timestamp_seconds": 686.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iwQmDPafTCc&t=686"
    }
  },
  {
    "text": "that was to get 800 units. Don't worry about the basis of the units, 800 shares of TQs. So then in this case, I'm able to stay at 800 shares of TQs. I'm able to reduce my basis 6430 to 63, which is where that basis reduction comes from that you see in the trade. So the original cash secured put requirement is here and then you can see where we landed. We don't need as much money from the original outlay because it's at a cheaper basis. So the whole point in doing this is to give us room to adjust the trade. So then what happens? The net PL for all of this. I take those shares down for 17,880. I can calculate the total credit I received here is 16,800. So I would be walking out with the net PL of down 180 bucks. So this doesn't fully cover the cost of that trade. It's not perfect. But I chose to accept this small loss in the beginning with the full intent of doing other activity to get the position back where it needed to be like it is today. However, at this time, by not adding that additional loss. Because again, if I add that additional lot, you'll see this becomes a positive number. And we're in the black and if we're not super deep in the money running out of capital for utilization out of the total allocation, we can do this. But in this",
    "metadata": {
      "video_id": "iwQmDPafTCc",
      "title": "Rolling Options Explained: Advanced Techniques",
      "url": "https://www.youtube.com/watch?v=iwQmDPafTCc",
      "upload_date": "",
      "duration": 950.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 13,
      "start_timestamp": "00:12:36",
      "start_timestamp_seconds": 756.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iwQmDPafTCc&t=756"
    }
  },
  {
    "text": "that additional loss. Because again, if I add that additional lot, you'll see this becomes a positive number. And we're in the black and if we're not super deep in the money running out of capital for utilization out of the total allocation, we can do this. But in this case, preparing for a bigger drawdown, what I'm doing now is moving myself back into options and out of shares. Because then let's say, T-TripleCue's did continue going down. Now what we can do is follow the rest of our standard rolling protocols with dynamic lot sizing. So if we take a look at the hypothetical scenario, this now is pretending time is passed. So the seventh of April is when we got into this trade that you see listed here. And we're pretending now it's the 18th of May. And let's say rather than it rallying back up the market continued down. And TQs was now at 35. What I can do is because I didn't burn that extra lot here, I can bake it into my new trade, increase my lot size by one point, so that I can try and reduce my basis. So notice we started in this hypothetical at the basis of 6430. The only got the basis to 63. Now what the basis says 63, if it continues going against this, we might be able to get it down to 61 or better, something like that. And this is the process of having a",
    "metadata": {
      "video_id": "iwQmDPafTCc",
      "title": "Rolling Options Explained: Advanced Techniques",
      "url": "https://www.youtube.com/watch?v=iwQmDPafTCc",
      "upload_date": "",
      "duration": 950.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 13,
      "start_timestamp": "00:13:50",
      "start_timestamp_seconds": 830.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iwQmDPafTCc&t=830"
    }
  },
  {
    "text": "in this hypothetical at the basis of 6430. The only got the basis to 63. Now what the basis says 63, if it continues going against this, we might be able to get it down to 61 or better, something like that. And this is the process of having a dynamic position in using roles to move in and out of different assets to end yourself in a better position so that even though today, as I showed you, T triple Qs is still down 12, my covered strangle is up money. And it's from doing stuff like this. Do you have any questions? Let me know be an outlier. See you later.",
    "metadata": {
      "video_id": "iwQmDPafTCc",
      "title": "Rolling Options Explained: Advanced Techniques",
      "url": "https://www.youtube.com/watch?v=iwQmDPafTCc",
      "upload_date": "",
      "duration": 950.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 13,
      "start_timestamp": "00:15:06",
      "start_timestamp_seconds": 906.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=iwQmDPafTCc&t=906"
    }
  }
]