[
  {
    "text": "Hey everyone, Eric here. One, do a small stacks update. I made a couple trades in the current diagonals that I have on. And then I am analyzing another potential called diagonal. Somebody was mentioning that they were, you know, essentially hoping that I could share real time, like when I'm analyzing a trade. So that's what I'm doing in the trade. I'm going to go through with you guys today. Walk through some of it. I didn't put it on yet. I'm going to watch it. But I intend to put it on when I see that the conditions are right. And then I have some hot air balloons that are going up right now. So I'll show you that real quick. Well, that was a big bummer. The camera wouldn't focus. So I'm sorry. You don't get to see the hot air balloons. But trust me, they're dope. So let's go over to the main screen real quick. This is small stacks part 12. So I didn't write it in because I'm lazy. And I just copy and paste it everything. So this is what we're looking at in the portfolio right now. Utilization is 2263. So we're still under 40 utilized. Total PNL is now at 757. So that represents just over 13 return since kicking this off on one September. Credit outstanding right now is 182, which represents a 3.16 return on the portfolio. Everything's looking healthy. We're not super utilized right now. So we still",
    "metadata": {
      "video_id": "j-ZxrbKG9SE",
      "title": "Trade Adjustments & Diag Prospects",
      "url": "https://www.youtube.com/watch?v=j-ZxrbKG9SE",
      "upload_date": "2020-10-10T07:44:23Z",
      "duration": "PT9M8S",
      "channel_name": "",
      "description": "I made a few adjustments to my F and KR call diagonals. I explore a potential call diagonal in INTC to gain some exposure to tech.\n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j-ZxrbKG9SE&t=0"
    }
  },
  {
    "text": "still under 40 utilized. Total PNL is now at 757. So that represents just over 13 return since kicking this off on one September. Credit outstanding right now is 182, which represents a 3.16 return on the portfolio. Everything's looking healthy. We're not super utilized right now. So we still have room to add positions on, which is exactly what I want to talk about. Okay, so next up is some of the adjustments that I made. First off in Ford. The 9 October, obviously put that trade on today. But I sold one more of the seven calls, expiring 30 October, which is right after their earnings. And I collected 58 cents on that. The reason why I did that is I have three long call options right now. And now I have three short calls against it. And the reason why I did that is when I looked at the risk profile, I generally like to keep the leap uncovered, which I did for a while. But now that I see Ford kind of making a move up, I perceive more room to the downside at this point. So by adding that final short call to essentially, to essentially collect that premium upfront, if Ford stays essentially where it's at, or if it goes up about 20 more cents, I will make more money with the three short calls as compared to the just two short calls. Now where that will start to change is if it goes",
    "metadata": {
      "video_id": "j-ZxrbKG9SE",
      "title": "Trade Adjustments & Diag Prospects",
      "url": "https://www.youtube.com/watch?v=j-ZxrbKG9SE",
      "upload_date": "2020-10-10T07:44:23Z",
      "duration": "PT9M8S",
      "channel_name": "",
      "description": "I made a few adjustments to my F and KR call diagonals. I explore a potential call diagonal in INTC to gain some exposure to tech.\n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 8,
      "start_timestamp": "00:00:59",
      "start_timestamp_seconds": 59.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j-ZxrbKG9SE&t=59"
    }
  },
  {
    "text": "essentially collect that premium upfront, if Ford stays essentially where it's at, or if it goes up about 20 more cents, I will make more money with the three short calls as compared to the just two short calls. Now where that will start to change is if it goes up over 20 cents additional from where it's at right now, is when I would have made more money with the two short calls as compared to the three. So right now based on my assumption, expecting a little more downside movement, especially with earnings coming up. That's why I put that additional call on, collect that money upfront, because I think that there's a higher propensity for it to stay where it's at, or maybe even go down a little bit as compared to increased greater than 20 cents. So we'll see what happens, but that is just why I made that adjustment. The other adjustment I made was really easy. It was actually the day after I did the last update, and I think the last time we did was six October. So on the seventh of October, in Croger, I sold the six NOVE 35 short call. So that took this to a one-to-one ratio as well. Except it was a really, really simple trade. I ended up taking it down very, very shortly thereafter. Sorry, I just realized I'm a spoke, because I'm changing the dates down there for when I took it off. So this",
    "metadata": {
      "video_id": "j-ZxrbKG9SE",
      "title": "Trade Adjustments & Diag Prospects",
      "url": "https://www.youtube.com/watch?v=j-ZxrbKG9SE",
      "upload_date": "2020-10-10T07:44:23Z",
      "duration": "PT9M8S",
      "channel_name": "",
      "description": "I made a few adjustments to my F and KR call diagonals. I explore a potential call diagonal in INTC to gain some exposure to tech.\n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 8,
      "start_timestamp": "00:02:24",
      "start_timestamp_seconds": 144.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j-ZxrbKG9SE&t=144"
    }
  },
  {
    "text": "So that took this to a one-to-one ratio as well. Except it was a really, really simple trade. I ended up taking it down very, very shortly thereafter. Sorry, I just realized I'm a spoke, because I'm changing the dates down there for when I took it off. So this was on last time we spoke that second call, and this was taken down on the seventh of October, which is the day after the last video. And I took these down for 0.58. So that realized 75 PNL, which is a 5.53 return on Vesit Capital. Essentially, that was an easy decision for me, because I was getting very, very, I was already over 50 Max Profit pretty early into the trade. And most importantly, by doing this, I uncovered the Max potential gain on Croger again. So I will continue to do this same exact system, where I'll either allow it to move up until I proceed more downside risk, then add that short call to collect more money. Sometimes I move the strike a little further out. It kind of just depends on the scenario. But as of right now, I left it with just the 6 NOVE 355 call, so it's uncovered. And that's because that trade is still not... It's about at par, as you can tell, from the other trade that I took down. Okay. So now, kind of the more important part, I want to talk to you about Intel. So I am",
    "metadata": {
      "video_id": "j-ZxrbKG9SE",
      "title": "Trade Adjustments & Diag Prospects",
      "url": "https://www.youtube.com/watch?v=j-ZxrbKG9SE",
      "upload_date": "2020-10-10T07:44:23Z",
      "duration": "PT9M8S",
      "channel_name": "",
      "description": "I made a few adjustments to my F and KR call diagonals. I explore a potential call diagonal in INTC to gain some exposure to tech.\n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 8,
      "start_timestamp": "00:03:27",
      "start_timestamp_seconds": 207.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j-ZxrbKG9SE&t=207"
    }
  },
  {
    "text": "NOVE 355 call, so it's uncovered. And that's because that trade is still not... It's about at par, as you can tell, from the other trade that I took down. Okay. So now, kind of the more important part, I want to talk to you about Intel. So I am eyeing a call diagonal in here. I really want some tech exposure, which in the small stacks right now, I have very little. And by very little, it's essentially only if I play smaller products like Zingga. So right now, what I'm eager to do is keep an eye on Intel. I like them at large. I've liked them for a long time. I've been trading them in my margin portfolio very frequently. And as of right now, it's a little bit of a too far run up for me. It's not a good entry just yet. I want to see a little bit more of a pullback. But seeing it already starting across above the 50 day, approaching the 200 moving day average, I'm like, those are very bullish symbols to me. So I'm actually hoping for a little bit of a pullback closer to the 48 handle so that I can look at an entry. What I was eyeing as of right now was taking a look at the 18 June 2140s. And this would only be a one lot. I wouldn't want to offer more than one in this position, just to avoid over sizing the account.",
    "metadata": {
      "video_id": "j-ZxrbKG9SE",
      "title": "Trade Adjustments & Diag Prospects",
      "url": "https://www.youtube.com/watch?v=j-ZxrbKG9SE",
      "upload_date": "2020-10-10T07:44:23Z",
      "duration": "PT9M8S",
      "channel_name": "",
      "description": "I made a few adjustments to my F and KR call diagonals. I explore a potential call diagonal in INTC to gain some exposure to tech.\n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 8,
      "start_timestamp": "00:04:51",
      "start_timestamp_seconds": 291.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j-ZxrbKG9SE&t=291"
    }
  },
  {
    "text": "that I can look at an entry. What I was eyeing as of right now was taking a look at the 18 June 2140s. And this would only be a one lot. I wouldn't want to offer more than one in this position, just to avoid over sizing the account. And that would tie up around 1,400. Essentially, you can call it 1,400. So that would be a little oversized compared to a couple of the others. It would put it about on par with Kruger. And then Ford would be the smallest of the pack. But in general, I would be okay with that with that risk profile. So we're going to see how it reacts, especially as it moves closer to earnings. If I see an opportunity to get into these, like I said, when Intel looks like it's a little closer to the 48 handle, I would be interested. But until that point, I will probably stay hands off because with these small stacks portfolio, it's very intolerant of periodic moves where I would have to sit and wait. And in comparison, in my margin account, if I wanted to put a trade on this because I liked it, I would just put on a partial position right now, maybe a third of the overall position, and then continue to add into it as it goes, because that allows me to capture upside if it occurs, but then add and scale into the position as it goes",
    "metadata": {
      "video_id": "j-ZxrbKG9SE",
      "title": "Trade Adjustments & Diag Prospects",
      "url": "https://www.youtube.com/watch?v=j-ZxrbKG9SE",
      "upload_date": "2020-10-10T07:44:23Z",
      "duration": "PT9M8S",
      "channel_name": "",
      "description": "I made a few adjustments to my F and KR call diagonals. I explore a potential call diagonal in INTC to gain some exposure to tech.\n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 8,
      "start_timestamp": "00:06:04",
      "start_timestamp_seconds": 364.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j-ZxrbKG9SE&t=364"
    }
  },
  {
    "text": "liked it, I would just put on a partial position right now, maybe a third of the overall position, and then continue to add into it as it goes, because that allows me to capture upside if it occurs, but then add and scale into the position as it goes down. Obviously, in the small stacks portfolio, that strategy doesn't work, which is the reason why we have this segment to look at a different way of trading a portfolio. So overall, that wraps up where we're at on the small stacks portfolio, still cruising right along, happy, primarily happy, honestly, with the utilization. I'm really, really stoked that we're returning very well without redlining the account, which is important to me. So I'm going to continue eyeing other opportunities. Financials is also on the docket, something like a Bank of America. I've traded them a lot. It's a cheaper product for financials. That's another tool that I'll keep an eye on. But right now, I just don't feel super warm and fuzzy about banks with interest rates being held where they're at, which is why I'm not prioritizing financials over tech. Right now, I think tech is definitely looking better, as you could tell us the same reason why I picked Kroger. I think things like that in the middle of the pandemic would perform well. And then the other thing, obviously, is Ford, that's a longer term, kind of COVID play, because I do think that it's still",
    "metadata": {
      "video_id": "j-ZxrbKG9SE",
      "title": "Trade Adjustments & Diag Prospects",
      "url": "https://www.youtube.com/watch?v=j-ZxrbKG9SE",
      "upload_date": "2020-10-10T07:44:23Z",
      "duration": "PT9M8S",
      "channel_name": "",
      "description": "I made a few adjustments to my F and KR call diagonals. I explore a potential call diagonal in INTC to gain some exposure to tech.\n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 8,
      "start_timestamp": "00:07:17",
      "start_timestamp_seconds": 437.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j-ZxrbKG9SE&t=437"
    }
  },
  {
    "text": "better, as you could tell us the same reason why I picked Kroger. I think things like that in the middle of the pandemic would perform well. And then the other thing, obviously, is Ford, that's a longer term, kind of COVID play, because I do think that it's still a strong company. It's had a significant pullback. So we'll see, also where that winds up. But so far, Ford's also looking good for me. In the meantime, I will always cover whatever you guys want me to. Anything that you want me to talk about, let me know. And we'll catch everybody later.",
    "metadata": {
      "video_id": "j-ZxrbKG9SE",
      "title": "Trade Adjustments & Diag Prospects",
      "url": "https://www.youtube.com/watch?v=j-ZxrbKG9SE",
      "upload_date": "2020-10-10T07:44:23Z",
      "duration": "PT9M8S",
      "channel_name": "",
      "description": "I made a few adjustments to my F and KR call diagonals. I explore a potential call diagonal in INTC to gain some exposure to tech.\n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 8,
      "start_timestamp": "00:08:27",
      "start_timestamp_seconds": 507.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j-ZxrbKG9SE&t=507"
    }
  }
]