[
  {
    "text": "Boom, we're back. What's up, outliers? Today we're talking about GameStop because we have some pretty exciting news as I imagine most have seen already, which is this right here. So the at the market equity offer is now complete. This is as of today, 23 September, and we can see exactly what happened here. It says it filed a prospectus supplement with the SEC to offer to sell up to a maximum of 20 million shares for the at the market offering. And it says the aggregate gross proceeds are approximately 400 million. So what's going on here? Take a look at this. GameStop intends to use the net proceeds from the ATM program for general corporate purposes, which may include acquisitions and investments. I think this is mostly what we've been expecting to see in here. And I know that this isn't necessarily earth shattering this line here, but they also didn't have to include this. And the fact that they did, I think that's important to know because it's telling us pretty clearly that they're starting to message. There's something going on with this money as we know, for a company to just raise money to just have money in the bank, it doesn't actually make sense. And this is something that we've talked about before because a lot of people will say like, oh, they're just earning really good interest on the cash that's sitting there. Interest is fine on large sums of money. But again,",
    "metadata": {
      "video_id": "j4-v_JEq8Sw",
      "title": "GameStop ATM Offering Complete: In-Depth Options Analysis",
      "url": "https://www.youtube.com/watch?v=j4-v_JEq8Sw",
      "upload_date": "",
      "duration": 752.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j4-v_JEq8Sw&t=0"
    }
  },
  {
    "text": "have money in the bank, it doesn't actually make sense. And this is something that we've talked about before because a lot of people will say like, oh, they're just earning really good interest on the cash that's sitting there. Interest is fine on large sums of money. But again, it's a drop in the bucket compared to a business doing what a business does, which is sales revenue. It's going to way better than 5 that they're going to get on their money. So they're not just applying like a standard individual trader or investor mindset of, let me just get a good yield. And then that'll be good enough. That's obviously not the case at all. They're going to do something with this money. It's the only reason why you raise it now. What that is, we don't know still, but I actually really, really like that they include this because this also builds off of what we recently saw back in August, where they filed this 8K that essentially saw them cutting ties with creditors. So this starts to unlock their ability to do things like MA investments, depending on, you know, what warm this all takes. It enables them to do that unencumbered. They don't owe anybody anything. They're able to move autonomously. So what I'm seeing here is a breadcrumb trail. And it's starting to piece together. Now what it turns into again, I have no idea. I'm very eager to find out. Also, still",
    "metadata": {
      "video_id": "j4-v_JEq8Sw",
      "title": "GameStop ATM Offering Complete: In-Depth Options Analysis",
      "url": "https://www.youtube.com/watch?v=j4-v_JEq8Sw",
      "upload_date": "",
      "duration": 752.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 12,
      "start_timestamp": "00:01:32",
      "start_timestamp_seconds": 92.86666666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j4-v_JEq8Sw&t=92"
    }
  },
  {
    "text": "It enables them to do that unencumbered. They don't owe anybody anything. They're able to move autonomously. So what I'm seeing here is a breadcrumb trail. And it's starting to piece together. Now what it turns into again, I have no idea. I'm very eager to find out. Also, still nobody has told me what this is up here. I like some video games. I'm not like a huge gamer. And I don't know what this is. Is this just like a fantasy drawing or is this actually from like a video gamer something? And if so, please tell me which one because every time I see it, it's on a bunch of these. I just don't know what it is. Also, everybody listening to this with earphones on you, omia, huge favor that I have cat like reflexes because I just caught myself in the biggest sneeze on planet earth and was able to pause the recording fast enough so I didn't blow out all of your eardrums, which I'm pretty sure it would have. Okay, so recap. ATM done 20 million shares out 400 mill in the bank. We have this that I need to know what this is. Nobody's helping with that yet. And we are now looking forward to the rest of this puzzle to come together in terms of what kind of acquisitions or investments this could look like. So from my perspective, just really exciting stuff. And the reason why it's so exciting is",
    "metadata": {
      "video_id": "j4-v_JEq8Sw",
      "title": "GameStop ATM Offering Complete: In-Depth Options Analysis",
      "url": "https://www.youtube.com/watch?v=j4-v_JEq8Sw",
      "upload_date": "",
      "duration": 752.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 12,
      "start_timestamp": "00:03:05",
      "start_timestamp_seconds": 185.73333333333335,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j4-v_JEq8Sw&t=185"
    }
  },
  {
    "text": "is. Nobody's helping with that yet. And we are now looking forward to the rest of this puzzle to come together in terms of what kind of acquisitions or investments this could look like. So from my perspective, just really exciting stuff. And the reason why it's so exciting is because there's opportunities. There's so many opportunities that are available here. We've seen everything from getting deeper into collectibles. We've been seeing conversations about moving further into the peripheral lines. I've been seeing conversations about starting to acquire either synergistic companies or completely different style companies and nobody knows. That's kind of the fun part. Now, my guess is GameStop and Ryan Cohen probably has a decent idea of where they're trying to take things at this point. I do not think that they're just like, oh, let's just keep raising money and then we'll see what happens. I don't fully see that as the case. I'm not saying that they have something lined out discreetly. But my guess is they have some ideas on where they want to go with this because that's the other thing is with how much money they have in the bank to add 400 million dollars is actually really interesting to me. That's a strategic move. I don't know why they pick that. But it's not happenstance. They're not just like, ah, you know, this will be fun to have another 400 million in the bank. I don't think it's that. So what this",
    "metadata": {
      "video_id": "j4-v_JEq8Sw",
      "title": "GameStop ATM Offering Complete: In-Depth Options Analysis",
      "url": "https://www.youtube.com/watch?v=j4-v_JEq8Sw",
      "upload_date": "",
      "duration": 752.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 12,
      "start_timestamp": "00:04:38",
      "start_timestamp_seconds": 278.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j4-v_JEq8Sw&t=278"
    }
  },
  {
    "text": "million dollars is actually really interesting to me. That's a strategic move. I don't know why they pick that. But it's not happenstance. They're not just like, ah, you know, this will be fun to have another 400 million in the bank. I don't think it's that. So what this actually is, I don't know yet. But to me, this looks like a series of strategic movements that are leading them towards something to do with this. Now, how does this translate to stock price movement really, really well? Because as you can see, after earnings, we came down massively big spike in volume. And then we can see that daily volume leading into the last couple days. I see nine and a half mill, eight mill, five point nine, six point three, 10 point seven, eight point nine, 61 point nine. So obviously on the 20th, and this is we reviewed these orders already. There were massive dark pool orders that came through on the 20th. And that doesn't surprise me. And we can see that we kind of cleaned up today. Overall volume today was still 13.7 million. That's high compared to the relative averages. So the beautiful part about this is look at the price movement here. This is an again example of as soon as overall pressure starts to be relieved, GameStop starts to rally. Look at these days. Post earnings really ugly didn't look good, didn't like earnings. We had a bit of a trail",
    "metadata": {
      "video_id": "j4-v_JEq8Sw",
      "title": "GameStop ATM Offering Complete: In-Depth Options Analysis",
      "url": "https://www.youtube.com/watch?v=j4-v_JEq8Sw",
      "upload_date": "",
      "duration": 752.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 12,
      "start_timestamp": "00:06:11",
      "start_timestamp_seconds": 371.4666666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j4-v_JEq8Sw&t=371"
    }
  },
  {
    "text": "part about this is look at the price movement here. This is an again example of as soon as overall pressure starts to be relieved, GameStop starts to rally. Look at these days. Post earnings really ugly didn't look good, didn't like earnings. We had a bit of a trail down and then we just have a couple massive spikes following through, which is really, really cool to see. So now a couple other general technical notes. I do see RSI sloping above its moving average. And I see both of those trending above the 50 handle on again, the RSI. So that's just generally money moving in, which again, you don't need that to see that that's what's starting to happen here. There's a lot of buy volume that's driving this kind of price movement. Now if we take a look at the options flow and let's take a look at options flow specifically for today. And I'm looking at the call side options that have been bought relatively quiet. There's nothing that I would consider overly remarkable here. If I throw on the bid to see what's been sold, a couple more larger trades, but still not a lot of remarkable movement, at least for today alone. Again, I continue to remind you guys, I don't come in here and try to spin everything I see as the most crazy thing on planet earth. I'm a trader. What I try to do is objectively analyze information. And again,",
    "metadata": {
      "video_id": "j4-v_JEq8Sw",
      "title": "GameStop ATM Offering Complete: In-Depth Options Analysis",
      "url": "https://www.youtube.com/watch?v=j4-v_JEq8Sw",
      "upload_date": "",
      "duration": 752.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 12,
      "start_timestamp": "00:07:44",
      "start_timestamp_seconds": 464.33333333333337,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j4-v_JEq8Sw&t=464"
    }
  },
  {
    "text": "lot of remarkable movement, at least for today alone. Again, I continue to remind you guys, I don't come in here and try to spin everything I see as the most crazy thing on planet earth. I'm a trader. What I try to do is objectively analyze information. And again, right now that's information I see here. It's relatively quiet. It's nothing too crazy. Now let's take a look at GameStop on the dark pool side of things because I know that this will look a little bit different. And we can see today that if I sort this not by time, but if I sort this by size, we've had a handful of really large trades come through. So we're seeing you know, things several 10,000s, right? So 74,000, 19,000, 20,000. So a bunch of those still, that's about the same. But here's the thing that we have to look at as per usual is if we look in filter by 5,000, there was a bunch of 5,000 blocks again today. So if we take a look at the 20th in isolation, a bunch of these 5,000 blocks. And again, I have to actually add more so that you can see all of them. And this is now going back from the 20th. So now let's take a look at essentially the last week, including today. And we can see that what I like tracking is what's the relationship of these blocks and how are they coming in? So",
    "metadata": {
      "video_id": "j4-v_JEq8Sw",
      "title": "GameStop ATM Offering Complete: In-Depth Options Analysis",
      "url": "https://www.youtube.com/watch?v=j4-v_JEq8Sw",
      "upload_date": "",
      "duration": 752.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 12,
      "start_timestamp": "00:09:17",
      "start_timestamp_seconds": 557.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j4-v_JEq8Sw&t=557"
    }
  },
  {
    "text": "can see all of them. And this is now going back from the 20th. So now let's take a look at essentially the last week, including today. And we can see that what I like tracking is what's the relationship of these blocks and how are they coming in? So like the 23rd, we can see that there's a bunch of them. On the 20th, we can see that there's a ton of them, literally a ton of them. That's all me scrolling through the 20th. Then I can see on the 18th, a few 17th, a few 16th, less. So I can look and see what's the flow of these 5,000 block orders. And again, it just is interesting to follow along. And I want to keep an eye if they continue after this next order flow is done. Now that GameStop announced it's complete. I wonder if that's going to have any impact on these 5,000 blocks that we see. I don't know yet. Now the last thing I want to take a look at with you quickly are the options chains, as you know. So if we jump in here, there's a couple things that jumped out at me. The first thing is that volume today was super heavy call side. 173,000 calls against 38,000 puts massive calls skew. Most of that transacted at the offer or above, meaning these are people buying calls. So still generally bullish configuration. But the open interest is most interesting to",
    "metadata": {
      "video_id": "j4-v_JEq8Sw",
      "title": "GameStop ATM Offering Complete: In-Depth Options Analysis",
      "url": "https://www.youtube.com/watch?v=j4-v_JEq8Sw",
      "upload_date": "",
      "duration": 752.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 12,
      "start_timestamp": "00:10:50",
      "start_timestamp_seconds": 650.0666666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j4-v_JEq8Sw&t=650"
    }
  },
  {
    "text": "at me. The first thing is that volume today was super heavy call side. 173,000 calls against 38,000 puts massive calls skew. Most of that transacted at the offer or above, meaning these are people buying calls. So still generally bullish configuration. But the open interest is most interesting to me. Because we can see that the open interest didn't contract that much. That means people from last expiration, because there was over 100,000 options that should have expired. Well did expire Friday that were rolled out into this week and with new positions established. But this is the most interesting thing to me so far. Take a look at where all these big positions are. This is the first time truly that I see the front expiration cycle being way less dense than the front, the next expiration cycle, the next expiration cycle after that until you get to the next primary expiration cycle, the 18 oct. And if you take a look at these, kind of these white rectangles, those are all 18 oct. Those are several weeks out. But that's where most of the li is right now. That's very cool because that's sticky open interest. That's not going to come down every single week with people having a bunch of options expiring worthless. So if we take a look at this front expiration cycle, there's 103,000 calls in there. We take a look at 18 oct. It's double and a half almost 243,000. That's really important",
    "metadata": {
      "video_id": "j4-v_JEq8Sw",
      "title": "GameStop ATM Offering Complete: In-Depth Options Analysis",
      "url": "https://www.youtube.com/watch?v=j4-v_JEq8Sw",
      "upload_date": "",
      "duration": 752.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 12,
      "start_timestamp": "00:12:22",
      "start_timestamp_seconds": 742.9333333333334,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j4-v_JEq8Sw&t=742"
    }
  },
  {
    "text": "not going to come down every single week with people having a bunch of options expiring worthless. So if we take a look at this front expiration cycle, there's 103,000 calls in there. We take a look at 18 oct. It's double and a half almost 243,000. That's really important because the way that the options have been flowing so far and games not have been inverted to that where the front cycle has been the heaviest by far leading to a bunch of turnover. That's not what we're seeing here, which again, I just find it remarkable, not remarkable as an unbelievable, but worth remarking. So that's that. The other thing is when I look at the wall, it's come down a lot. This has been highly informative for me. So I keep a really, really close eye on volatility and the volatility surface because it helps me understand market perception of movements. And I typically like this kind of view something like this and we can see a bunch of things. Now, one of the things I noticed with certainty is that we are back again to a generally normal configuration where in general, the put side runs higher vault than the call side. I track that because when I see the call side running higher vault than the put side, that's something I typically will trade. And it's also something that tells me something about market expectations of movement. So right now, we've kind of reverted back",
    "metadata": {
      "video_id": "j4-v_JEq8Sw",
      "title": "GameStop ATM Offering Complete: In-Depth Options Analysis",
      "url": "https://www.youtube.com/watch?v=j4-v_JEq8Sw",
      "upload_date": "",
      "duration": 752.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 12,
      "start_timestamp": "00:13:55",
      "start_timestamp_seconds": 835.8000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j4-v_JEq8Sw&t=835"
    }
  },
  {
    "text": "higher vault than the call side. I track that because when I see the call side running higher vault than the put side, that's something I typically will trade. And it's also something that tells me something about market expectations of movement. So right now, we've kind of reverted back to what I would consider to be more normal. So overall, right now, GameStop is in a really interesting spot in my opinion. And I really hope that we start to see more of this puzzle unfolding because price is starting to move a little bit better. And I mean, right now it looks like we're starting to bump up against some near term resistance here at like the 22 and a half handle. See how that goes. But the point of control is still up here at 24 and it would not surprise me. Now that the suppression of the ATM is completed to see this start to drift back up because it's very clear to me that a lot of this downward pressure was due to that because as soon as that's been generally abated, we can see this thing flying. So I am really eager to see where we go from here. As always, if there's anything you want me to take a look at, let me know. I'll see you with the YouTube live stream later today at 5pm Pacific time. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "j4-v_JEq8Sw",
      "title": "GameStop ATM Offering Complete: In-Depth Options Analysis",
      "url": "https://www.youtube.com/watch?v=j4-v_JEq8Sw",
      "upload_date": "",
      "duration": 752.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 12,
      "start_timestamp": "00:15:28",
      "start_timestamp_seconds": 928.6666666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j4-v_JEq8Sw&t=928"
    }
  },
  {
    "text": "where we go from here. As always, if there's anything you want me to take a look at, let me know. I'll see you with the YouTube live stream later today at 5pm Pacific time. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "j4-v_JEq8Sw",
      "title": "GameStop ATM Offering Complete: In-Depth Options Analysis",
      "url": "https://www.youtube.com/watch?v=j4-v_JEq8Sw",
      "upload_date": "",
      "duration": 752.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 12,
      "start_timestamp": "00:17:01",
      "start_timestamp_seconds": 1021.5333333333334,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j4-v_JEq8Sw&t=1021"
    }
  }
]