[
  {
    "text": "sell outliers, 31 July, what happened in the market today? Well, a few things. And we're going to talk about it. As you can see, in the top left hand side, it might be a little bit small. Actually can't increase the text size there, unfortunately. But I wanted to give you an outline of what we're looking at today. I'm going to talk about FOMC, the indices, meta, crowd strike, and then our fabled GME at the end for any of the apes that aren't interested in the rest of this stuff. Just skip towards the end of the video that will be where you want to be. But for everybody else, let's start off here. And the first thing I want to talk about is what happened today with Big Daddy J-Pow and what he's talking about. And it's because it matters from a market perspective. And you actually saw the market react pretty heavily to what this was talking about today. I actually had some zero DTSPX options on that I managed almost like halfway through his talk, because watching them move as he was speaking made a decent bit of money today actually on the volatility. There was a lot of volatility baked into the zero DTS today. Obviously, I'd look at them every day. So what did he say? Kind of not much, to be honest, but not much is also important because he continues this very steady drum beat of the same thing. And",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "There was a lot of volatility baked into the zero DTS today. Obviously, I'd look at them every day. So what did he say? Kind of not much, to be honest, but not much is also important because he continues this very steady drum beat of the same thing. And he's messaging the same exact thing. So here, it obviously no surprise saying that the Fed interest rate right now is hanging out still at 5.3. And there's a bunch of people saying that it should be lowered. We've had those conversations at nauseam at this point. And then you'll notice Powell said, if inflation continues to fall of reduction and our policy rate could be on the table. And this is standard messaging for him so far. He's not over under selling. And he's trying to keep the market from running away too fast on hopes. But I mean, let's be honest, market is going to do whatever the market wants to do. And it's just kind of part of the game here. Now this, I think is interesting. He says we're getting closer to the point at which it will be appropriate to reduce the rate, but we're not quite there. And he's reiterating this point multiple times. I think this is, again, a very standard fair for what he's been talking about. And you can see now interestingly enough that in the 18 set meeting, we're looking at a 12 and a half percent probability of half",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "not quite there. And he's reiterating this point multiple times. I think this is, again, a very standard fair for what he's been talking about. And you can see now interestingly enough that in the 18 set meeting, we're looking at a 12 and a half percent probability of half a point coming off and 87 and a half probability right now of a quarter point, which I think, I mean, if I were to place table stakes here, I would guess quarter point. And it looks like a quarter point each successive meeting throughout the end of the year. So this essentially would mean that we would have three cuts potentially. A couple notes here. This isn't, this is a overwhelming edge here, right? So 68 probability of 25 basis points on top of the previous from September plus the 9.3, which is essentially the probability of a total cut between this. So the probability here is really good for the November meeting. But you'll notice in December, it's not quite as good necessarily. And the reason why I say that is because my guess is after we have these two cuts, if we have these two cuts, likely to have this one, if this one goes, which would still be my expectation, it gives to me half a point seems viable here. I don't know anything though. I'm not an economist. So as I say, half a point seems viable, that should mean nothing to anybody. It doesn't",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "to have this one, if this one goes, which would still be my expectation, it gives to me half a point seems viable here. I don't know anything though. I'm not an economist. So as I say, half a point seems viable, that should mean nothing to anybody. It doesn't mean anything to me. That's what I think though. So looking at December though, my guess is based on how Powell has played this like really slow rolling a lot of this stuff, right? We're getting closer, but not quite reduction or a policy could be on the table like he's being overly conservative in my opinion with respect to the messaging at this point. So my guess is I would be surprised to see him go through three consecutive cuts in a row without taking a pause somewhere to see what the feedback is because one of the most dangerous things here is if he cuts and then rates rise, that becomes very problematic. And it'd be kind of like letting a genie out of the bottle. You've got to try to stuff it back in. If you've seen Aladdin, the genie does not like going back in, especially when you're far get some and yeah, you know, it gets out of hand fast. So that's what I'm seeing here. Overall punchline market liked this news today and we'll talk about the indices now in relation to that. So let's navigate away from meta and let's start with the",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "when you're far get some and yeah, you know, it gets out of hand fast. So that's what I'm seeing here. Overall punchline market liked this news today and we'll talk about the indices now in relation to that. So let's navigate away from meta and let's start with the broad indices overview, which is right here. And the E-minis are still happy. They had a huge day today and they're rallying up now still. Nasdaq is up in the Russell. The Russell had a fascinating day. If we take a look at small caps, they had this was just a day of emotions. Look at this. So it opened at 2262, rallyed all the way up to 22 or I'm sorry, to 2320. So essentially a 100 point rally. And then it closed at 2272, I think. I'm sorry. Yeah, 2273. So it up like a five point day after being up like 100 points. This is a crazy move in my opinion there. Very interesting. This comes a lot during the conversation that Paula had today. So if we zoom this in to like, I don't want to do it today one minute. That's a little excessive. Let's do a one day five minute. And you can see, you can see exactly how the market reacted during his conversation. Oh man, everything's great. Oh, shit. Here we go. That's kind of what happened here. So there was a couple of things I think that he talked about during",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "do a one day five minute. And you can see, you can see exactly how the market reacted during his conversation. Oh man, everything's great. Oh, shit. Here we go. That's kind of what happened here. So there was a couple of things I think that he talked about during the meeting that can lead to that kind of behavior. But the market is trying to front run this to a pretty big degree. That's the real punchline here. And it's not to be, it's not surprising. The Russell has had an amazing move so far this year playing a big game of catch up. So as I look at something like the IWM, specifically just because that's what I have in my little tracker here, year to date, it's up 12.7. Literally all of that 12.7 year to date return essentially happened from here starting on the 11th. That's the lion share of what happened. Which is nuts. All of this was baked into small caps finally getting a glimpse of sunlight at the end of the tunnel with the rate environment potentially changing for them. So that's what we're seeing across the indices writ large. The percentage of SP 500 stocks above their 50 days 72. So still overall what I would consider to be in bullish territory, the E-minis and really just the SP 500 in general. To me, it's tentative here though. I say that because we're kind of at an important point, I believe. We",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "SP 500 stocks above their 50 days 72. So still overall what I would consider to be in bullish territory, the E-minis and really just the SP 500 in general. To me, it's tentative here though. I say that because we're kind of at an important point, I believe. We started breaking down pretty reasonably, meaning we broke down, bounced around here, consolidated, hanging right out on the 50 day moving average. And it's starting to pop above here, which is good to see. And I think that this was kind of the near term resistance. It was going to have to navigate through and it kind of popped right up through it. Didn't really care so much here is where that resistance was based on this volume node. So people are interested here, which is good. So Raleon, maybe that's more more likely than not what I'm seeing here at least as of now. We're seeing breath indicators expand. So if I slide myself out of the way so that you can see, you'll see that this is for the NASDAQ. But net highs lows is moving up pretty meaningfully. We see highs accelerating and we see lows decelerating. So all in all, that's a generally bullish breadth configuration to me. And this is where I keep an eye on the market. I want to see how I want to use my money and find awesome opportunities. There are no shortage of them. I want to switch to meta",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "So all in all, that's a generally bullish breadth configuration to me. And this is where I keep an eye on the market. I want to see how I want to use my money and find awesome opportunities. There are no shortage of them. I want to switch to meta quick, talk about their earnings at a really high level. They had a great earnings release. So they close today at force 7483. And right now after hours, they're at 508 and a half ish. So you can see the breakdown of its earnings. Let's take a look through this quickly together. So we see Q3 revenue. And it looks like their projections looked pretty good. And they're holding off on quantitative guidance for 25 into a Q4. So they're giving themselves a little bit of time to pull themselves together. It says we anticipate our full year 24 capital expenditures to be in the range of 37 to 40 billion updated from our prior range of 35 to 40 billion. While we continue to refine our plans for next year, we expect significant capital expenditures growth in 25, which is pretty cool. As we invest to support our AI research and product development efforts. So again, the market is very excited about AI as it should be. I believe it's one of those truly revolutionary technologies that we haven't seen since what I would consider to be the internet. I think that this offers depending on how it scales.",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "research and product development efforts. So again, the market is very excited about AI as it should be. I believe it's one of those truly revolutionary technologies that we haven't seen since what I would consider to be the internet. I think that this offers depending on how it scales. And if the terminator is spawned, hopefully not, I think AI can just change a lot of stuff. So yeah, overall, it looks like this is interesting. It says meta AI on track to be the most used AI assistant in the world by year end. So they're really leaning into that segment. And it's working well for them so far. Earnings is again, they're coming off the shelf here, still hovering right around 508. So up, up almost 35 points, big run for them, all 35 plus. So that's meta quick pivot over to CRW. Oh, yeah, sorry, before we do that, I wanted to take a look at some meta options. Market stays on the ball. There were 1.2 million calls to about 900,000 puts. And then let's see what was isolated around this earnings release 103,000 to 87,000. So this is kind of like a mixed bag. Lots of people hedging positions out there is what I saw. And then we got some solo dole homies out here at the eight hundies. Swing for the fences is what I say, good, good for them. So the options in here are pretty active. All right. So now let's",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "Lots of people hedging positions out there is what I saw. And then we got some solo dole homies out here at the eight hundies. Swing for the fences is what I say, good, good for them. So the options in here are pretty active. All right. So now let's get back over here. And we need to take a quick look at Crage Strike because this one's been interesting and lower. She goes. This has been pretty continual. At this point, this has been one of the easiest fades I've come across in my trading career, especially after I got back in after this breakdown. And all I'm doing is sliding stops down. And I mean, I'll follow this as low as it goes. I'm very, very curious where that is. I do see a volume node building here. So you notice when it was transacting around here, we started seeing these volume nodes expanding out as people are picking up shares. And this one got out pretty far. Right. So this is where the point of control is up here before the drop lots of people interested to hear, but this is from before. Right. So this volume node is built back here. Then this volume node you can tell is being built right now because it didn't trade back here earlier on this chart. So people are interested in here. Now we see today two things. First thing I notice is the volume node is building a",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "node is built back here. Then this volume node you can tell is being built right now because it didn't trade back here earlier on this chart. So people are interested in here. Now we see today two things. First thing I notice is the volume node is building a little bit slow, but it needs more time to even see if we're going to outpace this one. More importantly, though, volume today is slowing down. So what I'm looking for is how much sale volume are we getting? That's highly informative to me. So here on this day, the 29th, there was 9.8 million sale volume on the 30th, 17 million sale volume. So sale volume is accelerating here. It accelerated from here. Then today sale volume is down to 6.8 million. So sale volume is slowing down. Does that mean that it's done? I have no idea. But what it does mean is right now, this becomes where I manage the short to the upside, give it more room to run if it feels like it, I probably will set a prelimal alert here to scale out a little bit if it starts making that run early enough. Otherwise, I will follow this thing into the dirt happily. And to be honest, I have nothing wrong with CrossTrack. It's just doing exactly what I want, which is very rare, as a trader, as most of you probably know. But what I'm highlighting here is the importance of following",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "Otherwise, I will follow this thing into the dirt happily. And to be honest, I have nothing wrong with CrossTrack. It's just doing exactly what I want, which is very rare, as a trader, as most of you probably know. But what I'm highlighting here is the importance of following a trade through, not just immediately seeing from here when I got my breakdown. And then just bouncing as soon as it started consolidating, like let the trade work. If you move your stops down, give it enough room, it again, something with this kind of weakness, just flow with it. Now, the other thing I will note in here though is I do believe whenever this does turn around, it offers inverse opportunity where we probably have overextended this and then some in my opinion at this point. I think we're at an extreme. But that doesn't mean that we stop and it doesn't mean we're not at an extreme. The market's going to determine what that is. But I would not be surprised at all to see this whenever the dust starts to settle. The news calms down to see a nice rally out of CrowdStrike. We will see. All right. Last thing. The bell of the ball. GME. First and foremost, got a positive print today. So we landed up 1.21 percent, which was really nice to see. Big fan. And it looks like unfortunately, though, in my opinion, that we didn't make much headway above and",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "see. All right. Last thing. The bell of the ball. GME. First and foremost, got a positive print today. So we landed up 1.21 percent, which was really nice to see. Big fan. And it looks like unfortunately, though, in my opinion, that we didn't make much headway above and again, this is just a line, right? I don't want people to look at this and be like, well, I can't believe it's not breaking through that. It's just a line. I drew this yesterday. It doesn't mean anything. The price will go through it whenever it feels like it. But I did want to see it go through it today. And it did. You see if we zoom this in that we had some interest above here, but then it collapsed back down a little bit. So a bit of mixed price action. That's what I call it today in GameStop. But I love that it's starting to fight back here. And it's difficult to see. But do you notice the black zone here? And or maybe you just take my word for it. There's a volume note right here is what I'm showing you. And I love seeing this volume note all the way out here because this is what I was talking about in terms of really wanting to see people buying in and filling in this giant gap of a volume node. The reason why I care about that is because it tells me where people",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "this volume note all the way out here because this is what I was talking about in terms of really wanting to see people buying in and filling in this giant gap of a volume node. The reason why I care about that is because it tells me where people are interested in transacting. So for example, what I'm showing you guys before is like, this is devoid of volume. Nobody really traded in this level. So frequently as price drift towards that level, it becomes either in a place where new volume node will be built if there's interest or a place where people aren't interested in transacting writ large. So this is cool to see because it means people are starting to want to transact at these levels, which is fantastic. Now, let's take a look at the options chain. And I see a bit of a slowing down process in terms of the gap between calls and puts. I see 676,000 calls to 324,000 puts. Again, that's just reiterating when I see GameStop and like it's really bullish configuration, there's at least two to one calls to puts. But again, options are derivatives. Their values are derived from an underlying contract. So if the GME starts getting bit up, you probably will see the options start getting more active. But it's also kind of interesting because sometimes options lead things a little bit, which is what happened actually during the squeeze that we saw here. Options started",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "from an underlying contract. So if the GME starts getting bit up, you probably will see the options start getting more active. But it's also kind of interesting because sometimes options lead things a little bit, which is what happened actually during the squeeze that we saw here. Options started getting active before these moves. So people were positioning for this to in some degree, which is just very interesting to me. We'll take a look at more at that tomorrow during the GME live stream. So when I see this now, I'm seeing a lot of build out in 16og, which continues to reiterate that same message, the takeaway in my opinion from a trading perspective from there that people are interested as I would expect them to be in the 16og expiration. And this is just the next standard expiration. There's definitely some hype built up around early aug, which I'm also hyped to see how it goes. But this is also people moving out to the next primary expiration cycle. The other thing I notice is this here, where in 6CEP, we can see that we have 103 IV that tells me something's coming up then and I look over here and I see earnings. And earnings is on the fourth as it sits now before the market. So again, this is how you can use options to come up with ideas on where we think something might be going on because I can see 92, 83,",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "I look over here and I see earnings. And earnings is on the fourth as it sits now before the market. So again, this is how you can use options to come up with ideas on where we think something might be going on because I can see 92, 83, 90, right? So we're looking at like the high 80s low 90s here and then something at 100. That's anomalous. So that's what that is though. I could tell something and it's just earnings. So looking at the transactions today, there is 110,000 calls transacted against 37,000 puts, which is great. That will build out this OI discrepancy. The problem I have with this, unfortunately, is just a ton of this is in twoog. And we don't know exactly yet how much is opening and closing volume. So we'll take a look at these 25s in twoog. And let's see. So we added 3,920 over yesterday and there was 10,000 that transacted today. I'm actually very interested to see what this does tomorrow because it's not clearly all going to be ad, but the trade is running out of time and these are decaying away super fast, right? So these are midpoint seven cents. They did a case six cents. You wait another day. Your options essentially become worth us unless you get a big price move. So these become really, really dangerous to hold onto. I wouldn't be surprised to see some of this 10,000 being closing out volume.",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "are midpoint seven cents. They did a case six cents. You wait another day. Your options essentially become worth us unless you get a big price move. So these become really, really dangerous to hold onto. I wouldn't be surprised to see some of this 10,000 being closing out volume. And what I see the majority of time in people doing this is trying to gain exposure to the next to the next expiration. So the 25s here you can already see are starting to get built out. There's 5,000 contracts OI 2000 volume 500 added over yesterday. So people are starting to build out in the next nearest expiration cycle. But as I look at the overall OI for nineog it's still very quiet. So 48,000 calls against 19,000 puts. This is good that it's 2 to 1 again a slightly more bullish configuration. But it's just generally light for GameStop again for comparison if we look at 16 off 220,000 against 107 in 16og. And as I continue to reiterate, a million times liquidity is a thing here. So today I actually made some adjustments in my 20 step calls. They're still there. This is just my pass through account. So it doesn't show my positions. But I still have long shares and I still have short calls against them. But what I did for the short calls is I actually rolled them down closer to add the money. Do this for two reasons. In doing so, I'm",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "through account. So it doesn't show my positions. But I still have long shares and I still have short calls against them. But what I did for the short calls is I actually rolled them down closer to add the money. Do this for two reasons. In doing so, I'm out in 20 step for a few reasons. If I take a look at 30og and I take a look at the Theta decay for the at the monies, it's about 3.4. If I look at 3.7. DTE, it's about 3.4. If I look at 51. DTE, it's about 3. So by going further out in time, I'm not actually pulling away a bunch of Theta decay from my options from the short calls against the long shares. I have to continue reminding people of that because as soon as people hear short calls, they think I'm fading GameStop and I'm not. I'm long GameStop. Now that's also not to say that I've absolutely traded GameStop to these down moves, but I just maintain long shares during it. I will use options to trade price movement both directions. That's one of the fascinating things about GameStop is that it moves around a lot. And the long shares are component of the trade. But then I also have options that I can deploy to try to extract as much as I can from GameStop, build a position out. So anyways, back to this though, when I see this, I'm not really",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "around a lot. And the long shares are component of the trade. But then I also have options that I can deploy to try to extract as much as I can from GameStop, build a position out. So anyways, back to this though, when I see this, I'm not really giving up on Theta decay and I'm giving myself a little bit lighter gamma. So here the gamma is eight. Here the gamma is five. The reason why that matters is because these will just move a little bit slower, which is what I want from a short option. I want to just pull in the premium as I can. I don't want it to fly around too much. And by keeping them a little further out in time, I don't want 51 days to be clear. I would prefer this to be like 40, but there's no 40 day expiration. And these are less liquid than where I'm at now. So I'm making sure that I'm maintaining upside profit potential. But I'm keeping a higher delta on these short calls so that if GameStop does have a bit of a consolidation period or a down move, I can again, make some money on the short calls and roll those into either long options when I decide to play it to the upside. But it's kind of moving with the product as much as I might want it to do one thing or the other. I don't get to pick.",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  },
  {
    "text": "make some money on the short calls and roll those into either long options when I decide to play it to the upside. But it's kind of moving with the product as much as I might want it to do one thing or the other. I don't get to pick. I have to play the game as it chooses to play the game and my job is to work with it as best as possible. So that's what I have going on. That's what I'm looking at right now. I will see you guys tomorrow during the GameStop livestream for those interested. And then Friday is Options Trading for Beginners. We have another part to that series come hang out, learn about options, be an outlier. See you guys later.",
    "metadata": {
      "video_id": "j7hF0WXnfxA",
      "title": "Market Recap: FOMC, META, CRWD & GME Position Adjustment",
      "url": "https://www.youtube.com/watch?v=j7hF0WXnfxA",
      "upload_date": "",
      "duration": 1341.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=j7hF0WXnfxA&t=0"
    }
  }
]