[
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "What's up, outliers? Welcome back to our training on filtered. Where we have a community member, Tray Jay, who actually spawned this idea, which has been super fun. Where we just chat about markets and spend a little time finding that middle ground between kind of like more seasoned retail trader and earlier slash late early stage trader. So Tray, looking forward to chatting again, what's on the dock in? Yeah, thanks. He sounds good. Hey, everyone. Hey, outliers. First of all, happy birthday to the Marine Corps. I see you back. I see you back to Punishing yourself. How how was your back through all of this? Are you doing all for doing? It's not good. I literally, it's so funny. So what he's referring to is, I have our hernieded disc at L4 L5, which is a little bit abnormal. Most people that have hernieded discs, they're between L5s1, but genetically for whatever reason. L5s1 for me is like just not there. Just don't have a disc there. So like those two vertebra are already together. I never noticed that seem fine. But that just put excessive movement on L4 or a 5 to pick up the slack. So I hernieded that like a year and change ago and I've been trying to fix it non-surgical, which has definitely been a challenge. It's actually why in a lot of videos, even this video, you'll see me fidget a lot. And it's just because like sitting hurts and stuff",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 83.84,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "So I hernieded that like a year and change ago and I've been trying to fix it non-surgical, which has definitely been a challenge. It's actually why in a lot of videos, even this video, you'll see me fidget a lot. And it's just because like sitting hurts and stuff like that, it's gotten a lot better. But as I was going to the gym today, I literally, as I was driving up, I was just like, they're literally is nothing productive. That's going to come out of this. It's not like, oh, I'm going to like grow muscle or build muscle endurance. Like that's not why I went there today. And I just kind of accepted it. So yeah, no, it hurt the entire fucking time, but that's just how it goes sometimes. You put it on mad, mad, so absolute mad, mad. Okay. Okay. What did you think of the markets today? Anything catch your attention? Yeah, I think we got the move, right? We talked about this playbook related to government shutdowns and the playbook is super simple. It was built on an analysis of every single government shutdown that we've had before. And there are a couple high level items that were very clear. One of them is that over the lifespan of the shutdown, it's like a coin flip 50 50 chance, whether or not you're going to be positive or negative over the lifespan. So effectively, not tradable. Oh, that's okay. I got to",
    "start_timestamp_seconds": 67.52,
    "end_timestamp_seconds": 146.48,
    "start_timestamp": "01:07",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=67",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "couple high level items that were very clear. One of them is that over the lifespan of the shutdown, it's like a coin flip 50 50 chance, whether or not you're going to be positive or negative over the lifespan. So effectively, not tradable. Oh, that's okay. I got to take a step back and clarify that just because something's a 50 50 split doesn't mean it's not tradable, but it's also because of the size associated, meaning in the frequencies that it was up, there wasn't like some massive upsidescue compared to the downside. So what that means is you can have a strategy that might have a lower success rate where the thing you think is going to happen happens, but if it happens big enough, you can still trade it. That's not the case here. So it's more genuinely like a 50 50 split, both in terms of probability and severity. But one thing we noted is that, literally, every single time the announcement that the shutdown is coming or the shutdown is like winding down once that comes out, the government typically is starting to stabilize, production of overall volatility in terms of what we think might happen in the cascading impacts, that all the baits and it's generally followed by market up. So as we talked about it, there's a bunch of different quirky ways to trade that stuff. It's not as intuitive as you might think. Especially for like futures open yesterday. That followed",
    "start_timestamp_seconds": 132.0,
    "end_timestamp_seconds": 215.52,
    "start_timestamp": "02:12",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=132",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "might happen in the cascading impacts, that all the baits and it's generally followed by market up. So as we talked about it, there's a bunch of different quirky ways to trade that stuff. It's not as intuitive as you might think. Especially for like futures open yesterday. That followed a very specific playbook that I've seen literally thousands of times for other events, not government shutdowns. We haven't had that many of them. And then the movement today, again, it was a 50 50 chance in terms of what it looked like, but the broader expectation of up was obviously realized to a pretty significant degree, S&P was up about what one and a half percent over the last trailing 20 days or so. That represents a 2.1 standard deviation up move. So a decent size up move on the day. So yeah, that's hands down the biggest thing I saw. Yeah, I think I agree with that. There's also the potential of a whole bunch of backlog of data that's not being released, the delugia fit coming along with you know, as soon as they open. So do you think that could also add to the, you know, probably to your having that move? Yes and no, I think the thing is most of those things that are like really far back, don't really matter. It'll be whatever the most recent one is. That's going to have the most weight and how far off that is. So even",
    "start_timestamp_seconds": 197.52,
    "end_timestamp_seconds": 289.68,
    "start_timestamp": "03:17",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=197",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "probably to your having that move? Yes and no, I think the thing is most of those things that are like really far back, don't really matter. It'll be whatever the most recent one is. That's going to have the most weight and how far off that is. So even though we've gone a while and going a while without information, naturally would lead to a higher potential for being off. A lot of times the estimates are very close to the actuals and it's because it's, you know, just 0.8 a point B. Have every single month, very, very row easy to predict. When you add this kind of slack to those systems, the prediction becomes more difficult because A to B now isn't over the course of or five consecutive weeks. Now it's going to be one week to five weeks later. So that higher potential for some sort of skew, but again, and as usual, the market's pretty good at this stuff. So seeing VIX down, where it was, it's even down after hours now, it's at 1840. So VIX is still slightly elevated longer term, but again, if you give it the context that you just gave us, not really that elevated, considering the fact that there's literally like four or five weeks of data that we're pending. So summarize that thought, I think that there's definitely a potential for a larger variance, but I don't think that it would be enough to necessarily cause some",
    "start_timestamp_seconds": 273.92,
    "end_timestamp_seconds": 361.44,
    "start_timestamp": "04:33",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=273",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "gave us, not really that elevated, considering the fact that there's literally like four or five weeks of data that we're pending. So summarize that thought, I think that there's definitely a potential for a larger variance, but I don't think that it would be enough to necessarily cause some sort of profound move unless something genuinely broke. And it's always that outside moved. So what I mean by that is like, I don't think it's going to be like this insane sensitivity if the numbers offer a bit, but I think if the numbers like grossly off, you could see you could see that, but right now, the market really isn't tipping its hands that it necessarily expects that. If I look across the wall surface right now, and just eyeballing term structure, in the front, I see 15.24% in spy. That's using the full chain, I typically prefer to use like the at the money vault. So the at the money vault is like 12, high 12s, low 13% that's for the 11th for the 12th, same thing. It's like 13% or the 13th, it's like 13.2%. So you kind of see the general trend here, as I click through this week, it doesn't really look that crazy. The only real notice on the 14th goes up to like 13.6% or 14, if you're using just the out of money on the call sides, that's like 14.6% which is a little elevated, but not a ton. So that's",
    "start_timestamp_seconds": 346.88,
    "end_timestamp_seconds": 440.24,
    "start_timestamp": "05:46",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=346",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "click through this week, it doesn't really look that crazy. The only real notice on the 14th goes up to like 13.6% or 14, if you're using just the out of money on the call sides, that's like 14.6% which is a little elevated, but not a ton. So that's really just using the volatility surface to at least come up with an estimate, but right now it doesn't look like the market is pricing it anything too crazy. Yeah, I would I would put the title of sold so in the same category, I think they're looking past it's a non-concernt at least for now, but until it could be a concern based on the Supreme Court decision or something. Yeah, there was some news today about negotiations with tariffs across EU down to 15% and some India as well. So interesting, making some moves. And there was another thing you mentioned that either on Sunday, stream or on Saturday stream about index wall being compressed while single stock wall expanding. Do you think the dispersion trade is back on the table in full-left factors? Is that what does happening or is it not related? That comes in and out. Yeah, that's like really really hard and it's also the kind of thing that generally speaking, especially if you're going to do it correctly, that's one of those things that like just really is an accessible to retail traders. So you can glean a little bit of information on",
    "start_timestamp_seconds": 424.96,
    "end_timestamp_seconds": 506.72,
    "start_timestamp": "07:04",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=424",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "out. Yeah, that's like really really hard and it's also the kind of thing that generally speaking, especially if you're going to do it correctly, that's one of those things that like just really is an accessible to retail traders. So you can glean a little bit of information on whether or not it's like, whether or not it seems really fat, but most of the time it's not and you'll see that come in an out of Vogue a lot or to say if it would be on in full force, I still think that broader wall right now probably wouldn't be hyper-condu-sift to it. So I just I think it got priced down so far. What ends up happening and what we're talking about for those that aren't familiar with the concept of dispersion trading is a lot of times institutions, larger entities, they're able to trade the difference in relative volatility between an index and then the primary components of that index. So it's not necessarily all 500 names. You don't even have to do all 500 names, right? Like if you're looking at some P5 100, the top 10 companies are like fucking whatever percent of it huge now. So you really just need like 50 to 100, maybe 200 if you want to be a little more precise, and then you're just trading the relative vault disparity between those two. Now a lot of people found that edge and as it got more and more",
    "start_timestamp_seconds": 493.36,
    "end_timestamp_seconds": 577.84,
    "start_timestamp": "08:13",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=493",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "it huge now. So you really just need like 50 to 100, maybe 200 if you want to be a little more precise, and then you're just trading the relative vault disparity between those two. Now a lot of people found that edge and as it got more and more crowded, it actually got overpopulated, which is why we saw periods of time where it literally wasn't happening. But now it does look like on and off again, it's still I'm not sure if I would consider it in full effect, but it's definitely there and it's always going to be something that's intermittent, I think going forward. Yeah, yeah. How has earnings being for you so far just trading them? I'll be honest, I've had a rough time this season. Some of the, yeah, I've had a really bumpy time this season, ready to try. I don't know, I think one, there was one big loss that throughout like, it happens with earnings, right? It was still within like tolerable loss because of the sizing of the trade itself. But overall when I'm looking at the trades that I picked, I haven't done a good job. So I'll just when you're talking about it, and I just wanted to get your thoughts and how it's worked for you so far. Some of the, some of the, I'd be sad to opposite. That's great. So back to zero. Yeah, it's been literally a completely mellow season. That's why I'm honestly",
    "start_timestamp_seconds": 560.4,
    "end_timestamp_seconds": 641.84,
    "start_timestamp": "09:20",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=560",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "when you're talking about it, and I just wanted to get your thoughts and how it's worked for you so far. Some of the, some of the, I'd be sad to opposite. That's great. So back to zero. Yeah, it's been literally a completely mellow season. That's why I'm honestly so shocked because that would lead me to believe that there might be some sort of sizing issue and what you're doing or selection issue. Like that's the best. And again, the selection issue, I don't lean on that to heavy. The reason why I say selection issue in my mind is more if you're just not doing enough of them, because you really do need a decent number of them. But what was, do you know how big the move was realized against, expecting? I, I remember the move and I was one ticker, Pfizer or Pfizer. It had a 50% move F5. I think it's a stop name, ticker name. It had a 50% move of 4.7 standard deviation moving price and 4. Wait, what's the ticker? What's the actual ticker? F5. F5. Oh, I thought you're saying Pfizer like, like, PFP, like Pfizer Pfizer. I was just like 50% what the fuck happened? Oh, Pfizer moving like tap. Man. Oh, no, beautiful. Doubt of nuts. All right. Let's take a look at this one. I'm so curious right now. I just want to know what the, because I didn't trade that one. I want to know what",
    "start_timestamp_seconds": 631.76,
    "end_timestamp_seconds": 717.68,
    "start_timestamp": "10:31",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=631",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "like 50% what the fuck happened? Oh, Pfizer moving like tap. Man. Oh, no, beautiful. Doubt of nuts. All right. Let's take a look at this one. I'm so curious right now. I just want to know what the, because I didn't trade that one. I want to know what the expected was in that. So that was expected. Yeah, that you shouldn't have traded that man. Yeah, I agree. I wanted more trades in that cycle. So I took a chance on this one. Fair enough. So one thing to note specifically when trading earnings, there's a lot of little details that you got to work out in the system. But one of the things to shortcut you is that two things. If you see something that within the last four earnings seasons has more than two moves outside of the range that's acts. Unless you're getting paid in a noxious amount of money to take that risk and if you do you size it down, the other thing is that if you see something that has successive moves outside of the range and based on what multiple tells you a lot of information. So F5 for example, in July, it was expected at 638 came in at 138 two times off. In April, 5 7 came in at 185. Three times off. And then even the one before that was still outside or two at 7 1. So what that tells me is that the vol pricing going",
    "start_timestamp_seconds": 698.8,
    "end_timestamp_seconds": 801.04,
    "start_timestamp": "11:38",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=698",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "July, it was expected at 638 came in at 138 two times off. In April, 5 7 came in at 185. Three times off. And then even the one before that was still outside or two at 7 1. So what that tells me is that the vol pricing going on in here is literally a bismal. So if we look at what the implied was for this coming earnings release, it was 117. That 117 is still under the realized move from the most recent two. So all of that means that this doesn't seem like it's pricing vol well, at least favorably to the seller side of the equation. This would be a complete pass. The easiest way to summarize all of that shit that I just said is that if you see something that had two moves or more, that's a massive problem. If it's over two, that's a no. It's a period no. This one had three. Complete no. But that part aside, if it has two moves, it's like it would need to have so much vol premium. So great example using this one. If October 25, if the implied was, let's say 30%. Okay, I'll take that risk. Generally, even though it doesn't misdirect the parameters, I would go in expecting to lose. But that's so much that I would take it. But if it's not something that's like, agree, just like that. And the reason why it would have to be so high",
    "start_timestamp_seconds": 781.04,
    "end_timestamp_seconds": 871.12,
    "start_timestamp": "13:01",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=781",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "I'll take that risk. Generally, even though it doesn't misdirect the parameters, I would go in expecting to lose. But that's so much that I would take it. But if it's not something that's like, agree, just like that. And the reason why it would have to be so high is because of the 185 and the 138. So yeah, that that makes a lot of sense, honestly, because the thing that you got hit with here is two fold, which is kind of shitty. The first one is you got hit with a big move. And exactly as you said, every once in a while, that big move is going to happen, period. And all things considered, it wasn't that big. It was big. But it's not that big. So the way that you framed it in terms of impact, that makes sense. That sounds about right. We're definitely was probably bigger than planned, but still within we walk away alive. But even even with that, you went in with such small vol that the margin for error is effectively null. So yeah, bummer, bummer that you had that, I would definitely say good job sizing it so that it didn't really, really hurt you. But that definitely would explain like the lumpy return cycle. Because yeah, that's a tough one. There is one I'm trading right now. I'll literally tell you what it is because it's this will come out after it goes. Where is it? This one?",
    "start_timestamp_seconds": 858.24,
    "end_timestamp_seconds": 939.52,
    "start_timestamp": "14:18",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=858",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "it didn't really, really hurt you. But that definitely would explain like the lumpy return cycle. Because yeah, that's a tough one. There is one I'm trading right now. I'll literally tell you what it is because it's this will come out after it goes. Where is it? This one? I and oh, oh wait, no, sorry, that was, no, that's correct. I know, is that one that I was able to get in the picture? I can't remember. I think I, yeah, I think I did this one, I'll try to make up. So this one while I'm talking about it, the reason why I just, I just think, I remember looking at one of these and think, no, it's not that one. So I couldn't get a fill on that one. It was too small. So which one was it? I think it was, I think it was, I think it was RGTI or Rocket Lab, one of those two. And the, the cliff notes for it is, it was Rocket Lab. So Rocket Lab had one out of the last two or one of the last four that was outside pretty significantly. But the largest multiple I saw was a two-time move, which again, that can always guide up. I don't rest too heavily on that. But the main thing is the implied that that we were going in with was so high that I just say, yeah, sure, I'll take that risk. And that's literally all",
    "start_timestamp_seconds": 924.8,
    "end_timestamp_seconds": 1018.88,
    "start_timestamp": "15:24",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=924",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "saw was a two-time move, which again, that can always guide up. I don't rest too heavily on that. But the main thing is the implied that that we were going in with was so high that I just say, yeah, sure, I'll take that risk. And that's literally all it is. It's not anything more interesting than that. But that selection criteria in terms of the risk that we're taking against what we're getting paid definitely is a little bit tricky. So good exercise, glad that it didn't hurt too bad. But yeah, that one, that one's like big red flashing signs that this one doesn't look good. It's, it's had so many outside the expected range even over the last eight. So one more question to not over dissect you, but just had a sheer curiosity. Like why this one verse any of the others that you were looking at, I assume that there is others at the time? Ever. I did see the red lights and I didn't really like it. But I did, so this was among the second bucket of shot listed. Because I was training, I got the first bucket out. And in the second bucket, I found this to be the most well priced. I think despite it being having this. Yeah, yeah, yeah, yeah, that's a logical reason. I was actually hoping that you were going to arrive at lesser revivals to be honest. Yeah, the the only small change that I",
    "start_timestamp_seconds": 999.76,
    "end_timestamp_seconds": 1084.16,
    "start_timestamp": "16:39",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=999",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "second bucket, I found this to be the most well priced. I think despite it being having this. Yeah, yeah, yeah, yeah, that's a logical reason. I was actually hoping that you were going to arrive at lesser revivals to be honest. Yeah, the the only small change that I would make on that is that if you are looking at things that just don't fit, they just don't fit, that is what it is. You go in light. Like we were looking at earnings yesterday during the market prep stream and it's light this week. It's just going to be light this week. That's how it goes sometimes. But as long as you get on the numbers over the preceding weeks, even if you only can get like three to six on, you're fine. Because last week, we before, you're able to get on whatever number you want effectively. So yeah, I think I think this scenario makes way more sense. Thank you for explaining. It's it's a good, it's a good case study to to think through. Yeah, and definitely I my screening process needs, you know, refinement for sure. Easiest, easiest thing. If it's more than two, it's a no period. That makes it that's very helpful. Thank you. That's way. Yep. More than two out of the last four, we say no. If it's at two, we say, probably no unless I'm getting paid handsomely. If it's one or below, that's when it's on on the",
    "start_timestamp_seconds": 1066.56,
    "end_timestamp_seconds": 1144.0,
    "start_timestamp": "17:46",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1066",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "it's a no period. That makes it that's very helpful. Thank you. That's way. Yep. More than two out of the last four, we say no. If it's at two, we say, probably no unless I'm getting paid handsomely. If it's one or below, that's when it's on on the dance floor. We should be getting to the topic for today. Yeah, let's go for it. Cool. The topic I have today is what does normal look like in the markets? The idea for it really originally came from a group discussion and I grew about paid post earnings announcement drift, particularly the period between the two earnings events, where typically and traditionally the the research suggests that the wall remains low and is you know, the impact of wall is low there. But it doesn't seem to be the case in notice it's just feels a lot more event driven. Treat driven and a lot of things can happen at any given point between the two earnings events itself. So in there are different market participants, the composition is different. The ability to position and react is also different. This structurally things have changed. So for us retail traders to bring it all the way back and shout out to the lads and discord, hardcore ban and phoenix. Their question was, how do we even begin by describing this as normal? How do we where is the definition for normal? Is it based on price? Is it based on",
    "start_timestamp_seconds": 1131.12,
    "end_timestamp_seconds": 1228.96,
    "start_timestamp": "18:51",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1131",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "to bring it all the way back and shout out to the lads and discord, hardcore ban and phoenix. Their question was, how do we even begin by describing this as normal? How do we where is the definition for normal? Is it based on price? Is it based on volume? Could it be based on volatility, market breadth, a combination of these things? If we were looking back historically, would it be, how do we know what time frame? So there's a number of ways to look at this and there are so many other signals that we haven't even talked about. So if you if you were you, Eric with your blistered palm and pumped up shoulders starting today, how would you go about framing your approach to understanding this is what is normal for me in the market? Two separate things. The question on how I will approach, I'll get to that in a moment. I want to talk first about this concept of normal normalcy. If you were call, when we were just looking at the movement in spide today and I had said, the recent standard deviation move was like two or whatever. That's based on a rolling window. That's not based on spise life span. That's based on a trailing 20 day realized window. The purpose for that is you guys are identifying normal changes and normal is not always the same thing that you've seen. So you can even see this expressed in",
    "start_timestamp_seconds": 1207.28,
    "end_timestamp_seconds": 1307.84,
    "start_timestamp": "20:07",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1207",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "on a rolling window. That's not based on spise life span. That's based on a trailing 20 day realized window. The purpose for that is you guys are identifying normal changes and normal is not always the same thing that you've seen. So you can even see this expressed in the weather, right? And this isn't going to like global warming, not global warming, but there definitely is change and you can see it. You can measure it. So with stuff like that, though it happens slowly and then you kind of look up one day and you're like, oh shit, like this is actually pretty different than what this typically looks like. So the way that I would think about normal is that I would start by understanding that it will never always be exactly what you think normal is. It's more about like ranges of behaviors. Now to get into the second part of that about how would I start? I would start by just conducting research and contextualizing that research. So for example, the first few questions I would have about the research that you are citing before is and I don't know if you remember if not it's fine. But do you know what time frame it analyzed? I don't depend on that. That's okay. But that's typically a really big thing to look at. And more often than not in studies like that it will be multi-year periods. And if it's a good study which",
    "start_timestamp_seconds": 1281.2,
    "end_timestamp_seconds": 1377.6,
    "start_timestamp": "21:21",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1281",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "not it's fine. But do you know what time frame it analyzed? I don't depend on that. That's okay. But that's typically a really big thing to look at. And more often than not in studies like that it will be multi-year periods. And if it's a good study which if you're getting it off of where I think you are, please like us as our end. In the bottom and the appendices they typically have tables. So what I would do is start with the research see what they say and then I would go to the tables and I would say, okay, they looked at a 30-year window and they're measuring whatever the you know pieces that you're talking about. And I would look at I would literally just look at it and say what did these numbers look like? And if I can't piece anything out visually by looking at it just plot it. And it's really easy to do especially because you can get the papers digitally. So you can convert it into an Excel doc or Google sheet and then just look at it. But that's the first thing that I would do. If you were to call another example of this is with the earnings season prep that we do because the way that I wait different things has changed, it used to be I favored a longer look back window. But I literally just finished when I made that announcement to you guys",
    "start_timestamp_seconds": 1357.68,
    "end_timestamp_seconds": 1438.08,
    "start_timestamp": "22:37",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1357",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "were to call another example of this is with the earnings season prep that we do because the way that I wait different things has changed, it used to be I favored a longer look back window. But I literally just finished when I made that announcement to you guys it was a four-year study that I was wrapping up. And I had conclusively decided that the additional data gathered by 12 cycles so for beyond the broader window that I look at are effectively not predictive. They're like flat. It doesn't hurt you, but it doesn't help. Whereas the other is true focusing on last eight and four waiting it appropriately is massively helpful. So it's the same thing as that. So zooming back out and thinking about like how to approach this concept of normal. The first thing you're starting with research and contextualizing that research. The thing after that is really difficult because you won't know what normal is for a while. Think if you commute for your job. You probably know where traffic is, where traffic is and where if you see a cop you might say like, ah, normal. I don't see a cop there. That's weird. And how do you get to that level of understanding? How do you know that that cop sitting there is weird? Well, it's because you've driven that route X number of times. You have a pretty good data sampling your mind. And you say out of all the",
    "start_timestamp_seconds": 1418.4,
    "end_timestamp_seconds": 1508.0,
    "start_timestamp": "23:38",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1418",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "That's weird. And how do you get to that level of understanding? How do you know that that cop sitting there is weird? Well, it's because you've driven that route X number of times. You have a pretty good data sampling your mind. And you say out of all the other samples, this thing sticks out because it's normally not there or the inverse. If you always see the cop there and then he's not there, then it's the inverse of that. But that process of looking at things repeatedly and understanding how they behave and just watching to build the base layer context, that's where all of its based off of. Now, you can speed up this process by looking at his story stuff. It doesn't replace it just like paper trading doesn't replace live trading, but you can look at his story stuff. And a logical follow-on question is like, what's stuff? This is where things get tricky because there is so much to look at when you're a new trader that you can look at a ton of stuff and really see nothing. You can't really pull that much because you look at this one thing, randomly on a Tuesday, then you don't look at it again until another Wednesday, you can't do it like that. You have to be more precise. So an easy way to think about it is like, if this whatever this thing is that I'm looking at, I'm going to track it",
    "start_timestamp_seconds": 1495.44,
    "end_timestamp_seconds": 1573.36,
    "start_timestamp": "24:55",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1495",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "on a Tuesday, then you don't look at it again until another Wednesday, you can't do it like that. You have to be more precise. So an easy way to think about it is like, if this whatever this thing is that I'm looking at, I'm going to track it for a relevant matter of time. When I say relevant in this context, that depends heavily on the sample. If I'm looking at zero DTE options over the course of a week, I get five samples. So in that one week, I get a ton of information. If instead I'm looking at how the market behaves around non-farm payroll or unemployment numbers, those don't come out as frequently. So if I do the same one week study, I might walk out with one or none, depending on where we're at. The point there is that you have to think about what it is that you're trying to analyze and collect. You have to get specific. If you don't do that, you're going to spend so much time looking at a ton of different stuff and I've nothing to show for it. And then you have to analyze it in a way that's logical to whatever it is that you're looking at. So a way to think about this is just to create dedicated time, whether you trade daily, whether you look at the markets once a week, that part really doesn't matter quite that much. But again, if you're going",
    "start_timestamp_seconds": 1560.8,
    "end_timestamp_seconds": 1644.16,
    "start_timestamp": "26:00",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1560",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "way that's logical to whatever it is that you're looking at. So a way to think about this is just to create dedicated time, whether you trade daily, whether you look at the markets once a week, that part really doesn't matter quite that much. But again, if you're going to trade once a week, I would build stuff that makes sense for that periodicity. If I was trading once a week, I'm not going to look at opening range breakouts and NASDAQ to try to trade those. That's outside of my window. I wouldn't be able to trade that anyways. It's inefficient. I would base it more so on first what's your frequency, what's your habit of looking at markets. And then the second, I would build first. I would get super, super zoomed in and I would focus with profit mechanisms first. And the reason I'm saying that is just because with profit mechanisms first, that's the ultimate thing that matters. So if we talk about the markets reaction around GDP, there is a trade around stuff like that. But those don't happen that frequently. That's not going to be or shouldn't be a primary profit mechanism or a regular retail trader that's trading once a week. Again, it's a mismatch. It doesn't logically make sense. That regular retail trader has to pick things that allows them to at least get close to the goals in a reasonable amount of time based on what their windows are. And",
    "start_timestamp_seconds": 1626.56,
    "end_timestamp_seconds": 1722.72,
    "start_timestamp": "27:06",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1626",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "a regular retail trader that's trading once a week. Again, it's a mismatch. It doesn't logically make sense. That regular retail trader has to pick things that allows them to at least get close to the goals in a reasonable amount of time based on what their windows are. And then it's picking things that are relevant to that. So for example, let's say that you work a job where you can't look at the market, let's say before the close. Well, what does that mean? earnings are probably not going to be in your bag. Why? Because that's when you need to enter. And you need to be able to access the market the next morning to take it down. And if you can't do that, that sucks. Because it's a fantastic profit mechanism. But we're working within our constraints. There has definitely been periods in my career, especially when I was on active duty in the Marine Corps. It's impossible. When I'm in fucking 29 poems in the middle of the fucking desert, we have no access to anything. Like you're not checking shit. That's just how it goes. To summarize that broader thought that I'm happy to get more specific on whichever elements you guys want to hone in on. If I were to think about how I would go about understanding what's normal, I would first define the universe of what I'm looking at. And then I would research. I would say, based on what exists,",
    "start_timestamp_seconds": 1704.48,
    "end_timestamp_seconds": 1789.68,
    "start_timestamp": "28:24",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1704",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "get more specific on whichever elements you guys want to hone in on. If I were to think about how I would go about understanding what's normal, I would first define the universe of what I'm looking at. And then I would research. I would say, based on what exists, what can I find out? I would wait that research for the more recent data from there, I would get hyper focused on things relative to a profit mechanism that fits what I'm trying to do. If we're fortunate enough, we have a few profit mechanisms that we've built the same context in. Then we can start moving to like second order and third order things. An example of this is let's say that you're trading a cover triangle as one of your primary strategies, which is generally based on a momentum factor of some sort. Your profit mechanism there is momentum. So I would first focus on what are the things that define momentum? And I need to look at those a lot. I need to see what they look like and into the other behave. Then from there, I can start, once I have a mastery of at least the things that I think are most relevant to the profit mechanism directly, then I can zoom out a click. I can say I wonder if there are things that preempts changes in momentum. Maybe that brings you to something like breadth, which is effectively momentum. But that's one",
    "start_timestamp_seconds": 1769.6,
    "end_timestamp_seconds": 1864.24,
    "start_timestamp": "29:29",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1769",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "least the things that I think are most relevant to the profit mechanism directly, then I can zoom out a click. I can say I wonder if there are things that preempts changes in momentum. Maybe that brings you to something like breadth, which is effectively momentum. But that's one layer removed and so on and so forth. The hard part and I really wait, I really really wish that there was a good solution here for people. But I haven't thought of one yet although I do think about it, it's really hard to know those things if you don't know. But the good part is, is you can learn them by looking at the stuff. It's just one of the kind of things that takes some time. And again, it is a shameless plug for the community. But that is one of the reasons why I built a community is because if you're looking at earnings and somebody else is looking at something else, then YouTube can talk about it. And you guys can share that collective knowledge, which is effectively taking two people and replicating half of it so that you can at least have something. But the only way that those things kind of work is if you're working with people that pull their fucking weight. It's not like the thing on Reddit where people will go on to be like, hey, can you explain your strategy to me? And it's like, no bitch, do the",
    "start_timestamp_seconds": 1845.36,
    "end_timestamp_seconds": 1926.08,
    "start_timestamp": "30:45",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1845",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "the only way that those things kind of work is if you're working with people that pull their fucking weight. It's not like the thing on Reddit where people will go on to be like, hey, can you explain your strategy to me? And it's like, no bitch, do the work? No, they're like, here, let me just give it fuck you. There's no way. So it's the same thing when you're trying to develop that base contextual understanding. It does take repetitions, but there's things you can do to shortcut it. The biggest thing I would mention up front though is especially early on, you've got to be focused because if you're not focused, you'll just get shoot up in all of the million things going on. And it'll be, it'll feel like you're doing a lot. You'll feel probably tired, but you won't have much to show for it. It's kind of like the worst of all worlds that I can think of. That's a high level overview. Happy to double click on any part. Yeah, I mean, you bring a really good point about repetition and just putting ourselves to observing these things frequently, right? There was another discussion in a group about setting daily return targets. After much discussion and deliberation, I think the group somewhat decided that maybe it's a better idea to replace the daily return target and to daily routine target. So what do I do when I come back come to the",
    "start_timestamp_seconds": 1916.24,
    "end_timestamp_seconds": 1993.6,
    "start_timestamp": "31:56",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1916",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "another discussion in a group about setting daily return targets. After much discussion and deliberation, I think the group somewhat decided that maybe it's a better idea to replace the daily return target and to daily routine target. So what do I do when I come back come to the desk first thing in the morning, pop open the platform? I look at the economy, look at the sectors, sorry, the indices, what's wall doing, what the sectors are doing, the same thing, right? The inverted parameter approach of analyzing stuff. And doing that every day, it goes back to the point that Chris Abdulmeiss made in your recent podcast with him about intuition. Something in our subconscious are brain logs information that's not otherwise logged in the logs. That I think I thought that point was really powerful and that really when we do that every day and day out and then we bring it to a group discussions every weekend. That has given me added me some level of confidence to synthesize my own opinion of where things are, what normal is. I don't have to anchor to opinions of market commentators. What is the change to your opinion? Do I have to switch my portfolio now because someone's which they're opinion on something? That's quite liberating actually. I really wanted to share that with beginners to just have a process, replace any return target, whatever you have that high frequency to having high frequency of information gathering,",
    "start_timestamp_seconds": 1976.0,
    "end_timestamp_seconds": 2067.44,
    "start_timestamp": "32:56",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=1976",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "opinion? Do I have to switch my portfolio now because someone's which they're opinion on something? That's quite liberating actually. I really wanted to share that with beginners to just have a process, replace any return target, whatever you have that high frequency to having high frequency of information gathering, kind of thing. What do you think about that? I think it's perfect. I think it actually focuses on one of the broader things that I literally harp on my entire time whenever I'm doing anything online. I'm glad that you give me the opportunity to do that here. It's process over outcome. It's very backwards because at the end of the day, the only thing that matters is the outcome. But what you will find is that I hate these kind of things because it's so nebulous to somebody that doesn't have a process that doesn't understand how this works. If you do focus on the process, the outcome will happen. A way to think about this is if I'm trying to learn how to shoot a basketball and the only thing that I care about is balling the net, all going through the ram into the net, that's the only thing I care about versus if I'm the person that's focusing on correct fundamentals, which typically feel really awkward up front. The ball sometimes doesn't even go anywhere near the net, no more near your desired outcome. But over time, as you refine your jump shot, what you'll",
    "start_timestamp_seconds": 2051.2,
    "end_timestamp_seconds": 2151.04,
    "start_timestamp": "34:11",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2051",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "the only thing I care about versus if I'm the person that's focusing on correct fundamentals, which typically feel really awkward up front. The ball sometimes doesn't even go anywhere near the net, no more near your desired outcome. But over time, as you refine your jump shot, what you'll find is you become way more consistent and the ball will go in the net way more than if you started and just focused only on putting the ball in the net. It's like that same exact thing with trading because if you're only focusing on what's the positive cash flow to the account, that is the epitome of a newer trader, of an inexperienced trader and somebody that is absolutely focusing on the wrong things, especially like a daily piano because a daily piano is probably, I don't know, I haven't run like dedicated studies on that, but I would wager that it's largely outside of your control. I don't, I would imagine that there are some really short-term traders that specialize in that timeframe that might not be the case for them, but I would say in general that would be my guess. And it's just because really really short-term timeframes are laden with all sorts of other effects going on that literally are not predictable. So I think switching from some sort of daily piano target to a process is literally setting up like literally setting a foundation for success. Verse says, not knowing how to shoot",
    "start_timestamp_seconds": 2130.96,
    "end_timestamp_seconds": 2224.48,
    "start_timestamp": "35:30",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2130",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "really short-term timeframes are laden with all sorts of other effects going on that literally are not predictable. So I think switching from some sort of daily piano target to a process is literally setting up like literally setting a foundation for success. Verse says, not knowing how to shoot a ball and just continuing to just purely focus on trying to get the ball in the net, you're probably shooting really close. You like standing two feet away, you can get it in if you bounce it off the backboard and you love that. But again, the problem is as soon as you try to do that in a game, you're going to get stuff every single time and it will matter literally for nothing. In trading, it literally is the same thing. You have to build those same repetitions, which can feel like they're not necessarily moving things forward right away. And you might not see the direct outcome in your account right away, but it's the kind of thing that if you do over time, it will typically work out much more effectively. And there's one other point I want to make on that, which is the people that are typically worried about daily returns or the people that are typically worried about like individual trade, P&L, they typically have small accounts. And the irony there is those accounts would be literally so much better off just dedicating extra time to making more money. Realistically, like go",
    "start_timestamp_seconds": 2205.44,
    "end_timestamp_seconds": 2298.4,
    "start_timestamp": "36:45",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2205",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "people that are typically worried about daily returns or the people that are typically worried about like individual trade, P&L, they typically have small accounts. And the irony there is those accounts would be literally so much better off just dedicating extra time to making more money. Realistically, like go door-dash, go do something because the amount that you're going to make ex-annie in the market and have a meaningful impact on your small account is very low. So if you find that you can't focus in that way, you might just not be ready for it. It might be the perfect time to just paper trade for a bit. But the way that I would think about any small account trading is that it really is nothing to do upfront with growing the small account. It is everything to do with laying a bedrock to be able to trade long-term successfully. Because the $5,000 account, we've talked about different versions of this in different forums, but saving is your best friend. If you save a certain amount of money on a monthly basis, it's literally a guaranteed return that will probably outperform whatever you can trade. Again, once you include friction and fees. Going back to this idea of focusing on process versus like a daily outcome, that also helps shrink the universe. Like we were talking about before, how it can be really really difficult sometimes when you're trying to look at a bunch of different benchmarks and",
    "start_timestamp_seconds": 2270.32,
    "end_timestamp_seconds": 2363.52,
    "start_timestamp": "37:50",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2270",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "include friction and fees. Going back to this idea of focusing on process versus like a daily outcome, that also helps shrink the universe. Like we were talking about before, how it can be really really difficult sometimes when you're trying to look at a bunch of different benchmarks and see how it directly impacts your P&L and you can't necessarily get the level of detail or information that you need. Everything that you find that you do in trading longer-term, it all becomes connected. And if you can refine the individual pieces, that's when you refine the whole jump shot. So maybe when a coach is trying to fix your busted-ass jump shot, they don't even have you jump. They don't even have you bend your knees. You are literally just focused on holding the ball with an upright elbow. That could be it. One hand, stuff that you'll never do in a game or typically wouldn't do in a game. That's not even a full jump shot. You're just focused on one piece to unfuck that and get that right. And then you can start adding another stuff, same exact thing. So I think focusing on processes really, really smart, the only massive caveat to that is you do have to observe outcome. And if you're focusing on process without observation of outcome, your process could be fucking terrible. And you could be really, really disciplined and focusing really hard on your process. But if it's not actually",
    "start_timestamp_seconds": 2346.08,
    "end_timestamp_seconds": 2435.44,
    "start_timestamp": "39:06",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2346",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "really smart, the only massive caveat to that is you do have to observe outcome. And if you're focusing on process without observation of outcome, your process could be fucking terrible. And you could be really, really disciplined and focusing really hard on your process. But if it's not actually translating to making money at some point, what's the fucking point of the process? But especially in the beginning, you have to give yourself some grace. It might not always be about, oh, am I making a bunch of money? It could be that before when I would plot my P&L volatility upside was up here and downside was down here. And then as I started doing this more regimented approach, I kind of noticed that this only trickled down this much, but this actually trickled up like quite a bit more. So now my return distribution is in here versus out here. That's still a win. Even if it's not looking good, even if you're not making tons and tons of money, what that shows is that the volatility of what you're doing is going down. What that means is the direct output of your input is approximating, which is what has to happen. So only way to know of what you're doing is ultimately working. So I completely agree with that focus in that shift from daily P&L to more like a process cadence. The only massive caveat with that is that it still needs to be tied",
    "start_timestamp_seconds": 2415.04,
    "end_timestamp_seconds": 2505.52,
    "start_timestamp": "40:15",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2415",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "is what has to happen. So only way to know of what you're doing is ultimately working. So I completely agree with that focus in that shift from daily P&L to more like a process cadence. The only massive caveat with that is that it still needs to be tied to outcome observations. They just have to be taken in context. Versus what most people do, which is hyper focused on them. That's why for me, like my daily P&L, I see it, but I literally don't care. It doesn't even register. It's like weekly and monthly. That's what I care about. Yeah, that's a really good point. What would you say are some tools new traders can use to both collect and then, and then inform themselves about what is happening kind of thing if we're starting to. Yeah, I think the easiest thing to start with, definitely, as you mentioned before, would be the indices and volatility, because just about no matter what you're doing that will impact. And those are things that you can very easily track. So indices, you can literally just use a price chart, right? It shows you everything you need. Same thing with some volatility, VIX is plotted for you, but that's 30 day vault. So you might need to track your own seven day vault or one day vault or zero day vault or whatever other periods are interesting to you. Those things I think are great starting points. From there, I",
    "start_timestamp_seconds": 2483.44,
    "end_timestamp_seconds": 2573.2,
    "start_timestamp": "41:23",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2483",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "some volatility, VIX is plotted for you, but that's 30 day vault. So you might need to track your own seven day vault or one day vault or zero day vault or whatever other periods are interesting to you. Those things I think are great starting points. From there, I would use relevant tools. So if I'm looking at the indices and trying to understand how the indices are doing, well, they're percent return matters. They're percent return relative to one another matters. I care about broader price trend and momentum. All of those kind of things can be tracked with different style indicators, but without making it overly complex, of really, really, really simple way to start, especially just monitoring that the health of the indices is to use a short-term moving average and a longer-term moving average. Again, relative to kind of like your target time frame. So if you're looking to hold things for like a month, two months, you wouldn't want to use like a one day three day moving average combination. It's to be hyperactive for what you're doing. An easy way to think about that. And again, it's not perfect, but I would start with something that's like maybe three times your holding window. That would be like your longer term. And then something maybe like one step, one click in from your holding window. Ish, that might be viable for your shorter term window. Again, it's like really, really loose issues to give",
    "start_timestamp_seconds": 2556.48,
    "end_timestamp_seconds": 2644.88,
    "start_timestamp": "42:36",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2556",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "with something that's like maybe three times your holding window. That would be like your longer term. And then something maybe like one step, one click in from your holding window. Ish, that might be viable for your shorter term window. Again, it's like really, really loose issues to give somebody an even fucking clue on where to start. So going back to that month example, maybe I use like a two-week moving average, 10 day, and maybe like a 60-day, 50-day, moving average, like probably fine to start. That kind of thing will get you started. And the other thing specifically with those is that I would just not really worry too much about trying to predict for the first several months of looking at it. I would literally just look at it and see what you see and just write down what you see. The purpose of writing down isn't really because there's going to be some sort of like massively useful information later for you to look at. It's way more just to connect the learning process. We know, again, from a ton of research that note taking helps a lot. So this is the kind of thing where I think it would still make sense to do in like a Google sheet or Excel sheet that you could analyze more broadly. But if you feel like just jotting it down on a stick, you know, I think that's fine too. Like at this point, you really",
    "start_timestamp_seconds": 2628.56,
    "end_timestamp_seconds": 2708.32,
    "start_timestamp": "43:48",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2628",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "thing where I think it would still make sense to do in like a Google sheet or Excel sheet that you could analyze more broadly. But if you feel like just jotting it down on a stick, you know, I think that's fine too. Like at this point, you really just need to connect the wiring. Yeah. That's how I would start with indices and volatility as well. From there, I would just immediately go to the profit mechanism. So we can talk about a specific one if you want to like work through one of those examples. But the way to think about the profit mechanism side of things is just thinking about what's relevant to the profit mechanism. The way that you can figure out what's relevant is saying stuff to yourself like what information would help me do this better. Like what would I want to know if I could wave a magic wand and know everything I need to know in order for this thing to, you know, for me to place an effective trade. That's not knowing the outcome. Obviously, you would say I just want to know which direction it's going to go. But if you can wave a magic wand and have all the details and information that you need in order to place a high confidence trade, what are those details? That's probably a good intuitive spot to store relative to a profit mechanism. Yeah. The profit mechanism point is really everything.",
    "start_timestamp_seconds": 2699.44,
    "end_timestamp_seconds": 2770.32,
    "start_timestamp": "44:59",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2699",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "if you can wave a magic wand and have all the details and information that you need in order to place a high confidence trade, what are those details? That's probably a good intuitive spot to store relative to a profit mechanism. Yeah. The profit mechanism point is really everything. And like you said after the indices and wall, it just comes down to that's the driving force behind all kinds of being all the different forms. But we could take an example. I think we have a few minutes. What about breakout? What do you think what do you think would be signals or? Yeah, it's a great, it's a great example. So when we're talking about breakout, the traditional setup that I personally look for is something that has some sort of consolidation period. I typically want it to be at least three days. It's not always in ideally a little bit longer within specific relative ranges to itself. And then at some point, we will see price breakout side of this range, typically on higher volume, yada, yada, yada. So if I'm trying to understand, like just how breakout's behave, the first thing that I need to do is define what I think a breakout is, just like I defined here. And let's say somebody doesn't know those details. That's okay. The first thing you could do is again, go to SSRN, just look at like breakouts. The point of that is to shortcut what you're trying",
    "start_timestamp_seconds": 2754.0,
    "end_timestamp_seconds": 2842.08,
    "start_timestamp": "45:54",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2754",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "do is define what I think a breakout is, just like I defined here. And let's say somebody doesn't know those details. That's okay. The first thing you could do is again, go to SSRN, just look at like breakouts. The point of that is to shortcut what you're trying to learn. You might not find anything. But the reason why I insist on going to a place like SSRN versus X or YouTube, I wouldn't fuck with YouTube for stuff like this because everything will sound good. And that's really misleading. So by focusing on what's scholastically is available, that at least will be vetted to a degree. And I would start there. Then after that, I would refine my idea. I would write down again what I think it is. Because for example, if somebody says, oh, a breakout is when it goes up. Okay, maybe it is. Let's start there. Let's pull up charts of stuff that's going up. Do these all look the same? Of course not. You will see things that go up over the course of six months. But sometimes it's like completely fucking sideways. They drop, they go up whatever. So we can refine off of that. We now know our original statement of something that goes up is insufficient. So then what's the thing that defines it? Well, six months is a little too long. I think that's too long of a timeframe for what I would consider a breakout. What timeframe",
    "start_timestamp_seconds": 2823.12,
    "end_timestamp_seconds": 2905.92,
    "start_timestamp": "47:03",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2823",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "refine off of that. We now know our original statement of something that goes up is insufficient. So then what's the thing that defines it? Well, six months is a little too long. I think that's too long of a timeframe for what I would consider a breakout. What timeframe do I think is relevant? Maybe five days, maybe two days, maybe one day. And it's that process of kind of querying. But then when you come up with something, it's testing it. The problem most people have here and the easiest way to fix it, because I used to do this is I would say something like, oh, a breakout is when price exceeds a recent consolidation zone. Okay. And I would just look for as many instances of that as I could. The problem with that approach is I'm literally just looking for what I want to see. I'm not looking for what actually defines what I was just talking about. So if I'm saying something like, I'm looking for places where, you know, prices higher than a recent consolidation, that means that I need to include all of the instances of where something just pops just above and then the next day it's lower. And maybe volume was anemic or maybe there was an earning. Right. Like, there's a million of the things that that would actually capture outline that way. The main point on that piece of it is when you say whatever the thing is",
    "start_timestamp_seconds": 2890.24,
    "end_timestamp_seconds": 2979.04,
    "start_timestamp": "48:10",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2890",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "and then the next day it's lower. And maybe volume was anemic or maybe there was an earning. Right. Like, there's a million of the things that that would actually capture outline that way. The main point on that piece of it is when you say whatever the thing is that you look, you think you're looking for for a breakout, you need to take it as what you said. So if you said, it's when price goes up, you need to look at every instance that you can find in recent history with in reason of where price went up. And then you need to say what are the commonalities here and again, if you start with something that's that wide open, you're going to be like, oh, I don't know. And you won't know. You shouldn't know. Now you need to double click. So it's it's following that process. The easiest way to do this is when you start with research of some sort, it gives you some clues. It gives you some things immediately to tip you off to what's relevant or not. Again, shameless plug for the community. It's one of the reasons why I started it because and again, it's free. Like people can join the free side to ask questions and people are super engaged there. That's by design. It's because I recognize that there are a lot of people that don't have disposable income to like pay for a paid community, but they're",
    "start_timestamp_seconds": 2959.2,
    "end_timestamp_seconds": 3036.48,
    "start_timestamp": "49:19",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=2959",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "it because and again, it's free. Like people can join the free side to ask questions and people are super engaged there. That's by design. It's because I recognize that there are a lot of people that don't have disposable income to like pay for a paid community, but they're at a point where I firmly remember being at. So I will always take the time to try to help them where I can. And that can be something as simple as, hey, I think I'm trying to focus on a breakout strategy. These are the things that I think are relevant. These are like the conditions that seem to exist for this. These are the signals that I think makes sense. Can someone just weigh in here? You'll get some feedback. And if you again, aren't in a community to do that, you can try using something like a large language model, chat you be tea or whatever. Again, you have to take those in context because I don't know if they fix chat you be tea yet, but some of them can be like way too people please are. And they can be like, yeah, that's right. And then they could like elucidate on your points. But it just sends you off the wrong fucking direction because it won't just be like no bitch. You're so wrong. But it's got a protector feelings. So it won't do that. Which is lame. I'm waiting for AI to just be",
    "start_timestamp_seconds": 3026.4,
    "end_timestamp_seconds": 3095.76,
    "start_timestamp": "50:26",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=3026",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "then they could like elucidate on your points. But it just sends you off the wrong fucking direction because it won't just be like no bitch. You're so wrong. But it's got a protector feelings. So it won't do that. Which is lame. I'm waiting for AI to just be like, you're fucking idiot. That's wrong. This is what's right. That will get through quickly. I think, cut through all the crap. But that that process is how you figure out what's relevant to your strategy, what's relevant to your profit mechanism. And then thus, when you look at those conditions, you can now figure out what's normal or what's abnormal. Right example, the recent recent government shutdown play that we talked about. We defined what's normal, what's abnormal. So for example, if the shutdown was announced in the market went down, I imagine most people in the community would have been like, that doesn't seem right. That doesn't seem normal. Just because the government ended up or is in the process of opening in the market went up. Does mean it had to go up. It could have gone down. It could have gone down for a bunch of other reasons. But that opens a trade idea because we would figure out why it went down instead. And then you know the government opening up is a tailwind. So it tells you that whatever happened was powerful enough to overcome that tailwind and push it down. Now there's another",
    "start_timestamp_seconds": 3079.28,
    "end_timestamp_seconds": 3164.64,
    "start_timestamp": "51:19",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=3079",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "other reasons. But that opens a trade idea because we would figure out why it went down instead. And then you know the government opening up is a tailwind. So it tells you that whatever happened was powerful enough to overcome that tailwind and push it down. Now there's another idea. But that's like a perfect example of defining what normal is versus abnormal. And then it's not betting the entire house on the normal condition occurring. I have no fucking idea if the stock market's going to go up after the government opens. But I have a good guess. And then if that doesn't happen, then I now know there's something else I need to look at. That's the broader process around a specific strategy, even something like breakouts. It's understanding what normal looks like because one of the things is you're researching breakouts, you'll find instances of what we refer to as failed breakouts. Something that seemed to completely qualify looked good based on typical criteria with NFL's. It doesn't work. And then you have to figure out, well, why? Why does this one not work? Sometimes you're not going to have an answer. Sometimes you will have to acknowledge the fact that you can attach something specific to this. And this is just an artifact of it. How do we know then if a strategy is viable? We need to figure out how frequently those failed breakouts happen, what our loss is against when they don't happen,",
    "start_timestamp_seconds": 3148.8,
    "end_timestamp_seconds": 3233.12,
    "start_timestamp": "52:28",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=3148",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "to acknowledge the fact that you can attach something specific to this. And this is just an artifact of it. How do we know then if a strategy is viable? We need to figure out how frequently those failed breakouts happen, what our loss is against when they don't happen, against what our wins are. If it's still net positive, still net positive, you're still okay. But that defining process is huge and it can be really simple. You can just start by asking yourself some simple questions. If I were to trade breakouts, what are all the pieces of information I think I would need to have in order to do this successfully and take guesses. Track it and then you can see how effective they are. So for example, if you say, well, I think I need like the last six months of data. Okay, right. Probably not going to matter to you. But you can try it. And just see what kind of predictive value it brings. But you have to be ruthless. If you don't have a basic understanding of like again, like basic researching principles of how to conduct basic data analysis, a lot of this stuff will be very difficult to you. And that will need to proceed all of these so that you at least have some sort of approach to answer questions like this. Because if you don't do that, then not only are you working in a system that you don't",
    "start_timestamp_seconds": 3218.24,
    "end_timestamp_seconds": 3298.96,
    "start_timestamp": "53:38",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=3218",
    "chunk_index": 46,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "this stuff will be very difficult to you. And that will need to proceed all of these so that you at least have some sort of approach to answer questions like this. Because if you don't do that, then not only are you working in a system that you don't know what it should look like. But then you're also using setup or an approach to analyze the system that you don't know what it should look like. That's tough. Yeah, you can make some really good points. A lot to think about and digest for various new traders. I think that wraps me up on the questions I have on the topic, but just wanted to get your thoughts on what you're seeing for the rest of the week, how you're thinking about it. I assume tomorrow you're going to kill yourself running the hell, so something for veterans to celebrate veterans day. So I don't know what your plans are. Yeah. So normally there is actually a spot on camp penultimate where the dudes carried like telephone poles and stuff like that up a fire break on top of a little mountain. So it's normally that. So yeah, the the body is getting fucked this week and it's just going to have to deal with it. But generally speaking, I think the rest of this week, I'm really just same shit, same shit different day. I'm trading earnings. I'm trading the coverage strangles as I typically do. I'm",
    "start_timestamp_seconds": 3278.16,
    "end_timestamp_seconds": 3361.12,
    "start_timestamp": "54:38",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=3278",
    "chunk_index": 47,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "the the body is getting fucked this week and it's just going to have to deal with it. But generally speaking, I think the rest of this week, I'm really just same shit, same shit different day. I'm trading earnings. I'm trading the coverage strangles as I typically do. I'm trading index ball. Those are the main things that I'm focusing on right now. I'm not really worried about finding breakouts. I'm not really looking for break downs. I'm not spending a ton of time looking for weird options activity and like those kinds of things. And it's just because everything else right now is productive enough that I don't really have a massive need for that stuff. For me, coming into the end of the year, like at this point, I really just don't want massive slippage because I have had an insanely good year. So one of the the dumbest things that I can do in times like this is just start getting way too overzealous. Again, it's still if I see good opportunity, I'll take it. But in the context of something like this week, there's a lot of weird stuff still that needs to come out and go on. And as you noted earlier, we are in a very catalyst driven market. So this it's one of the reasons a great example of this is the weekend trader used to run a vault trade over the weekend. I haven't ran that in weeks now. And it's",
    "start_timestamp_seconds": 3348.4,
    "end_timestamp_seconds": 3430.56,
    "start_timestamp": "55:48",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=3348",
    "chunk_index": 48,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "and go on. And as you noted earlier, we are in a very catalyst driven market. So this it's one of the reasons a great example of this is the weekend trader used to run a vault trade over the weekend. I haven't ran that in weeks now. And it's because of shit like yesterday. Right? Like there's news that the government shutdown might be abating. And it's just like there's so many instances of shit like that going on right now that that's again, understanding what looks abnormal compared to what looks normal. And there's a chance that what currently looks abnormal becomes the new normal. But we'll have to see. I don't know yet. I'm not expecting that. So we still have earnings season. I would say that that's that's the main thing for me. That's good. You tell that. Beautiful. Well, thanks so much, Shrey, for disjacking and serving is kind of like a conduit. It's it's super useful. I appreciate the time that you put into this and then also that the community is spending it's one of the really cool things is somebody that is in like a teaching side of the lens is like seeing what happens, right? And how this stuff that's being taught is functionally applied, especially in something like trading because trading it's like you can talk about stuff. But then you can have people that go out, place an earnings trade and something that that's a curious choice. So it's",
    "start_timestamp_seconds": 3419.44,
    "end_timestamp_seconds": 3503.68,
    "start_timestamp": "56:59",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=3419",
    "chunk_index": 49,
    "word_count": 250,
    "upload_date": null,
    "duration": 3538.0
  },
  {
    "video_id": "J8E9IARs4_k",
    "title": "Can Beginners Really Trade Like Pros? | The Outlier Podcast Unplugged Ep2",
    "text": "seeing what happens, right? And how this stuff that's being taught is functionally applied, especially in something like trading because trading it's like you can talk about stuff. But then you can have people that go out, place an earnings trade and something that that's a curious choice. So it's very interesting. That's right. I would blame it on somebody else it's the right move. But that it's really interesting with trading. So yeah, I always enjoy the chats. Thank you for doing these. And then for everybody else, again, we're doing these once a month. So you can check us out in about another month. And we all have linked to the episodes in the description for anybody wants to check those out. But otherwise, we are wrapping up. Thanks for hanging out. And thanks, Ray. For doing what you do. Thank you for that.",
    "start_timestamp_seconds": 3486.48,
    "end_timestamp_seconds": 3533.68,
    "start_timestamp": "58:06",
    "video_url": "https://www.youtube.com/watch?v=J8E9IARs4_k",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=J8E9IARs4_k&t=3486",
    "chunk_index": 50,
    "word_count": 146,
    "upload_date": null,
    "duration": 3538.0
  }
]