[
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "What's up, Alia. Welcome back to our third episode of Alia Trading podcast on plot. And this is where we have a friendly face, a longstanding community member, Shray J, kind of serve as a mouthpiece for the broader organization and the broader community. As I've mentioned before, he kind of has a decent background in terms of the way I think about things on the earlier end of his trading journey. So, I think he's like a perfect go between in terms of ideas. So, stoked to chat today. You had a couple things on the agenda. Some of them are kind of how to analyze performance level stuff. And then you also had a little bit about the heart and soul, Thor just walked in as expected. The heart and soul of trading, which is that of profit mechanism. So, I am always down to talk about profit mechanisms and ARs. Those are two things in my opinion that if you think of like the heart and soul of what trading is, that's the center of it. And most traders look right past them, rightfully so, understandably so. So, just not an appointment to like understand and like see where those pieces fit into the broader equation. So, I think those are great topics. I'm stoked that you suggested those. So, I will turn the reins over to you. We go wherever you want. Sounds good. Thank you. Good to be back in evening outliers. Before we get",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 93.0,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "see where those pieces fit into the broader equation. So, I think those are great topics. I'm stoked that you suggested those. So, I will turn the reins over to you. We go wherever you want. Sounds good. Thank you. Good to be back in evening outliers. Before we get into the topics, I thought we could recap as usual. What you saw on the markets today, if anything caught your attention. What you're thinking through the Wii just broadly. Yeah, the market right now. I think the biggest thing is, vol is oscillating in the low end of its range. I actually posted a thing on social media yesterday on a piece of a study that I did related to zero DTEs and the tail time frame, the last 60 and 30 minutes in funny today. Literally a perfect representation of that trend. But I would say at a really high level that's the big thing. Obviously there's a ton of stuff coming out the end of this week. I'm not sure when this podcast will aeropryl to be next week. So, we will already have the results of like the Fed rate statement and stuff like that. So, we'll see how that goes. But I markets when they're hanging around places like this are really interesting. I always view it is during the process of making a big decision. And when I look across the market itself, that decision is really mixed. So, like materials is falling off",
    "start_timestamp_seconds": 77.0,
    "end_timestamp_seconds": 164.0,
    "start_timestamp": "01:17",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=77",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "we'll see how that goes. But I markets when they're hanging around places like this are really interesting. I always view it is during the process of making a big decision. And when I look across the market itself, that decision is really mixed. So, like materials is falling off utilities is absolutely falling off. We looked at that actually yesterday, I want to say as one of the sectors. And it's just because there's weakness and that trend is opening up. A lot of the stuff that I've identified from an interesting trading lens, at least, is that we are not in some longer term trending markets. We're in these pockets where anywhere from like three to eight weeks, you're getting big oscillations in direction. And it's kind of across everything, which is beautiful. It's a great way to trade. So, yeah, besides that, really nothing too crazy. I don't think other than volsiphoning out, Brett looking good, that kind of stuff. Yeah, I mean, you're great-collar on the long term trending market, but that's really gives a contextual idea of what environment we are operating, and what kind of profit mechanisms we can deploy in that. I agree on the material side of it, despite the potential for rate cut this month, and then for 90 more cuts next year, it seems like there's price down to two cuts next year, as opposed to forward at some point, a couple of weeks ago. So, the weakness in materials",
    "start_timestamp_seconds": 145.0,
    "end_timestamp_seconds": 236.0,
    "start_timestamp": "02:25",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=145",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "on the material side of it, despite the potential for rate cut this month, and then for 90 more cuts next year, it seems like there's price down to two cuts next year, as opposed to forward at some point, a couple of weeks ago. So, the weakness in materials is really surprising. Yeah. I also don't know their seasonality. Stuff like that, a lot of times, we'll have some level of seasonality. I'll tell you right now. Yeah, as expected. So, December is typically a week season for materials. So, it's generally a negative return over the month of December. Some things are quirky like that, that you'll see energy is also typically weak in December for those wondering, same thing with calm services, same thing with real estate. And to get to the bottom of that stuff definitively, it takes a tremendous amount of research, but you can also loosely think of it, right? Like overall building in the winter probably chills out, no pun intended, but especially over the holiday seasons. So, it's not like super surprising to me, but there's probably more to it than that. Yeah, yeah, fair point. Fair point. Talking about dropping make-ups instead, shouldn't be getting to the first topic for today. Yeah, and of course, well, the idea was really the topic should be how straight and further the cowards trying to take use. But I see more on here, but it's to, despite being the best bit of this kid",
    "start_timestamp_seconds": 222.0,
    "end_timestamp_seconds": 313.0,
    "start_timestamp": "03:42",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=222",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "instead, shouldn't be getting to the first topic for today. Yeah, and of course, well, the idea was really the topic should be how straight and further the cowards trying to take use. But I see more on here, but it's to, despite being the best bit of this kid to call it profiling profit back. It's, but appreciate you hopping on with me earlier a couple weeks ago to jump on a voice chat to help me figure out and descend angle of what I was doing wrong just in the whole process of it. So, they, without going to too much details, they brought team of that discussion came out to be the information that I was thinking in my head, the information that I had versus my execution life, there was a big gap between it. And it was really hard for me to figure out why this gap was coming because I thought I would done the work to understand the profit mechanism I understood drift, I thought I understood drift, I thought I understood momentum. And I was applying the mechanism so a management that would get me to capture that profit mechanism. But it isn't the case. Obviously, there's a big gap in between those two things that I am doing. And after much deliberation, you kind of helped me identify that that gap is really from lack of confidence. And as you say, often confidence comes from demonstrated the ability over a period",
    "start_timestamp_seconds": 297.0,
    "end_timestamp_seconds": 383.0,
    "start_timestamp": "04:57",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=297",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "isn't the case. Obviously, there's a big gap in between those two things that I am doing. And after much deliberation, you kind of helped me identify that that gap is really from lack of confidence. And as you say, often confidence comes from demonstrated the ability over a period of time continuously. So, the end result of that discussion was like, hey, go back to step one, look at the outliers strategy process. What does it say? Profiling profit mechanism. So, talk to us about it. Why is it so important that we start there? We really have a good fundamental and sound understanding of profit mechanisms. The irony is, in something like, T-TripleQs, you can have like a theoretical idea of how you want to employ it and what you think it will look like. And I distinctly remember that as part of the conversation with you because it was exceedingly clear to me that in your case, you had done research. You understand the underlying profit mechanisms and the market effects that you were looking to capitalize on. But what I also distinctly remember is when I was going through some very basic probing questions in terms of how we think about different scenarios. It was clear to me that there's a gap there. And if we think of it in terms of an analogy, I use basketball a lot, I like basketball. And if you think about like shooting a free throw, and let's say that",
    "start_timestamp_seconds": 363.0,
    "end_timestamp_seconds": 459.0,
    "start_timestamp": "06:03",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=363",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "of how we think about different scenarios. It was clear to me that there's a gap there. And if we think of it in terms of an analogy, I use basketball a lot, I like basketball. And if you think about like shooting a free throw, and let's say that you know sometimes when you shoot a free throw, the ball just rolls off the wrong side of your hand for whatever reason. I should say it's a physical ailment or something. The ball just goes a completely different direction than you would expect. It's really difficult to be confident when you're stepping up to shoot the ball. If you know that there's some even low probability of the ball going, hey, why are? When we're trading, it's very similar in the context that like you were at a spot where you have a good theoretical understanding. But the practical understanding and the application of it was broadly missing. And it was leading to what I could tell like a couple competing interests in your brain. And the funny thing about this stuff is I made a video not that long ago about trap tasks. One of them because you did the correct stuff, but there was some gaps in terms of the execution of those things. So for example, one of the things that we have to consider one more trading is exactly what you're talking about there, which is this idea of a profit mechanism. And I'm going",
    "start_timestamp_seconds": 441.0,
    "end_timestamp_seconds": 534.0,
    "start_timestamp": "07:21",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=441",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "did the correct stuff, but there was some gaps in terms of the execution of those things. So for example, one of the things that we have to consider one more trading is exactly what you're talking about there, which is this idea of a profit mechanism. And I'm going to share my screen for those that are watching the video version of the podcast. And then if you're not, I'll kind of describe as well. That was fascinating. Literally just completely crashed. So I have no idea what that does. Oh, no, it looks like it's still going. Okay. So anyways, this idea of profit mechanism and why that's really the defined starting point for our conversations. I want to just work through an example. I use any version of this example to help elucidate the point, but let's say that you entered T-Triple Cues here. I don't think you did, but just proverbial. Somebody does. If you enter at this point and you buy shares, if you sell puts, if you synthetic long, if you buy calls, if you buy leaps, just to differentiate these slightly. And so on, no matter what you did out of these buckets, this bucket of ideas, all of them made money. Every single one of them would have made money. Inversely, if you did any of these at this point, all of them lost money, no matter what, what this is designed to really illustrate is the fact that there's no magic",
    "start_timestamp_seconds": 512.0,
    "end_timestamp_seconds": 622.0,
    "start_timestamp": "08:32",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=512",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "this bucket of ideas, all of them made money. Every single one of them would have made money. Inversely, if you did any of these at this point, all of them lost money, no matter what, what this is designed to really illustrate is the fact that there's no magic powers in option structures. There's nothing that they provide you exactly zero baked in edge, zero. Once we come to that understanding, and we arrive, and we're comfortable, and we can like wrap our minds around this idea, that you, as the individual trader, you do not enjoy any sort of edge based on these structures alone. That's a really important concept, because it then begs the question, okay, well, it's not this, then what is it? That's what the profit mechanism is. So in the case of trading something like teachable cues, there's a bunch of different ways you could trade it. There's a bunch of different profit mechanisms that are baked into this thing. One of them is if I zoom out over a longer term duration, I can clearly see that Nasak, QQQ, is trending up. It's trending up over this duration. If you add something that's three times leverage on something that's broadly trending up, it's going to do well. So one of your base profit mechanisms is a levered long position in something that's trending in the direction that we broadly want. Now, there's a bunch of sub pieces to that. So for example, you",
    "start_timestamp_seconds": 605.0,
    "end_timestamp_seconds": 713.0,
    "start_timestamp": "10:05",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=605",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "three times leverage on something that's broadly trending up, it's going to do well. So one of your base profit mechanisms is a levered long position in something that's trending in the direction that we broadly want. Now, there's a bunch of sub pieces to that. So for example, you don't just have to buy and hold. You don't have to dollar cost average. You can trade things like momentum. And you can trend follow a little bit more. The concept of trend following is that's where we want to play along in these broader up moves. And then as the market starts going through these broader down moves, we want to get out. We don't want to go through the rest of this drawdown. We wait for some sort of reentry point. And again, this isn't specific to TQs. This is not anything. But this is a trend following approach. Then we also have the options layer to this equation in the context of a coverage triangle, where we can access risk premiums. So if we take a look at a 30-ish delta put here, you're getting over the course of 39 days. Let's say that you're getting like 245-ish. That by itself, if you think of it in the context of how much money you would be putting up, even a cash secure this at a strike of 51.5, it's a 4.8% return on invested capital over 39 days. If you annualize that, that's a nice return. So",
    "start_timestamp_seconds": 692.0,
    "end_timestamp_seconds": 786.0,
    "start_timestamp": "11:32",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=692",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "245-ish. That by itself, if you think of it in the context of how much money you would be putting up, even a cash secure this at a strike of 51.5, it's a 4.8% return on invested capital over 39 days. If you annualize that, that's a nice return. So to move out of like the example, and to talk about this more as a concept, profit mechanisms are the thing that actually make money. And it's funny because in your scenario, you know that and you understood what they are. You research what that is. But it's a beautiful example of the gap between a theoretical concept and then the practical application of it. Because there's a lot of other small sub-processes that we got to get right along the way. And like we said in your scenario, it was actually pretty easy for me to identify broadly what was going on. And other people's scenarios, it can be really, really different, where I was literally having a conversation today with somebody trading. And this is a institutional level trader, but they're not as familiar with options. And what they were saying is, hey, there was something that they wanted to play earnings in this week, but they're slightly bullish in their disposition. And they were like, how do I use options to come up with something? And I walked them through what that could look like. And they were like, well, why would I wait until right before",
    "start_timestamp_seconds": 760.0,
    "end_timestamp_seconds": 861.0,
    "start_timestamp": "12:40",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=760",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "wanted to play earnings in this week, but they're slightly bullish in their disposition. And they were like, how do I use options to come up with something? And I walked them through what that could look like. And they were like, well, why would I wait until right before the close right before it releases? Why wouldn't I just sell the options today and collect theta? And again, like this is the gap between a theoretical understanding of what theta is in the practitioner understanding of, that's not the risk that we want in this kind of strategy. It could make money short, but it doesn't matter because that's not the risk that we want. To summarize all of that up and Shray, I would love if you poke holes in any gaps that you think I might be leaving folks behind in this, because I can see the potential for a few, just in this explanation in this concept. To summarize all that up, whenever you're placing a trade, it's really important to ask yourself a really simple question, which is, how does this thing actually make money? And there's nothing wrong if you sell an option, and you say something like the passage of time, theta, you can make money objectively through theta, absolutely. But that's not your edge. And the reason why that's not an edge is because of gamma, it has a counterparty. Just think of it in a game theory. If one of them",
    "start_timestamp_seconds": 848.0,
    "end_timestamp_seconds": 935.0,
    "start_timestamp": "14:08",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=848",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "you say something like the passage of time, theta, you can make money objectively through theta, absolutely. But that's not your edge. And the reason why that's not an edge is because of gamma, it has a counterparty. Just think of it in a game theory. If one of them was fundamentally superior better than the other, right from the jump, would do the opposite. Nobody. It would literally make no sense. So because of that, and even though theta might be the way that you, one of the ways that you make money, that's not the actual thing that's driving your profit, then it begs the question, what is? And that's where you have to go in into your next level of research based on what the effect is that you're attempting to trade. But the idea of profit mechanisms is funny because everybody kind of subconsciously knows it's there, even if they acknowledge it or not, and what they're doing. But the disconnect between profit mechanisms and what people do is, it's exceedingly common. And it's because it's not quite as clear as a lot of people would think again, a great example is the one that I just gave. If you sell options, a lot of people think theta, but overwhelmingly theta is not your edge. So it's something else. And then a lot of people wouldn't even know what it is. That's a good example. Yeah, yeah, absolutely. And not only that the profit mechanisms and",
    "start_timestamp_seconds": 917.0,
    "end_timestamp_seconds": 1003.0,
    "start_timestamp": "15:17",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=917",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "just gave. If you sell options, a lot of people think theta, but overwhelmingly theta is not your edge. So it's something else. And then a lot of people wouldn't even know what it is. That's a good example. Yeah, yeah, absolutely. And not only that the profit mechanisms and tell us how we make money through that particular trade, it actually defines the sizing, the management around it, it's similar to another thing that you say, begin with the end of mind. So you're working back from the idea of profit mechanisms and how we want to structure and manage everything along that line. So there's no there's no tension between, oh, should I do this? Should I do that? Hey, if I have a long culture, I manage it at 20 day moving average or stop or at some other point, because my profit mechanism will tell me what I'm trying to isolate. So that was another really important thing that you, that in that discussion that came up, but other than that, you actually helped me to, okay, now there is a gap. Now we have identified that there is a confidence gap. So how do we get that confidence? How can an individual trader find that confidence? So that that was something that I didn't know where to start. So I'm becoming a role in the decks of Eric's code. So this is again talking about the confidence is in the work that you're doing. So",
    "start_timestamp_seconds": 990.0,
    "end_timestamp_seconds": 1067.0,
    "start_timestamp": "16:30",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=990",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "get that confidence? How can an individual trader find that confidence? So that that was something that I didn't know where to start. So I'm becoming a role in the decks of Eric's code. So this is again talking about the confidence is in the work that you're doing. So you're working with the work that you're avoiding, the alpha is in the work that you're avoiding. So you told me download the history of this particular product you want to treat. Run the back test, run the statistical analysis. And say you want to try to, and use the simplest way you can isolate a profit mechanism, so moving averages for momentum. So talk to us about that. You know, how can a trader take, identify the gap and then work their way step by step through. Yeah. Definitely. So I'm going to share my screen again. And one of the things that we refer to back to a lot is this. And it's just because it literally captures the essence of what's going on. And for those that haven't seen this, this is effectively like a framework that I built. This is something that I inherently followed, but I didn't even know it. Like I didn't put a label on it or anything until I started making videos and trying to share these ideas. I'm like bite size and more palatable, but this is effectively the process that I use. What I'm trying to build a strategy. So",
    "start_timestamp_seconds": 1051.0,
    "end_timestamp_seconds": 1129.0,
    "start_timestamp": "17:31",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=1051",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "I didn't even know it. Like I didn't put a label on it or anything until I started making videos and trying to share these ideas. I'm like bite size and more palatable, but this is effectively the process that I use. What I'm trying to build a strategy. So if I sit down with myself and I'm saying, I am going to trade. How do I make money trading? This is what I'm going to do. Now, what trade is talking about broadly is this step. The interesting thing that I will always point out in the, in the game of building a strategy is notice how there's nothing about options literally until down here. You even talk about what kind of structures you might use, what kind of management you might use any of that until you get down here. So then those questions like trade was giving is an example. Do I want to manage at 50% max profit? Do I want to follow the 20 day moving average for the long call momentum? Do I want to set a stop at 50% law? Whatever, right? Like all of those things without doing these first two steps are literally just random. It's completely random. And the funny thing is, is like, even if you lie to yourself and you say like, oh yeah, this 50% management, it makes sense intuitively because, you know, this reason in that reason. The funny thing is, is your subconscious is going",
    "start_timestamp_seconds": 1115.0,
    "end_timestamp_seconds": 1195.0,
    "start_timestamp": "18:35",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=1115",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "are literally just random. It's completely random. And the funny thing is, is like, even if you lie to yourself and you say like, oh yeah, this 50% management, it makes sense intuitively because, you know, this reason in that reason. The funny thing is, is your subconscious is going to call the fucking bullshit. And it's going to say like, yeah, sure, bro, I don't trust that. So that's when you find yourself deviating. If you're in a trade and you have this sensation, let's say that you have this loosely scoped out idea of what you're going to do. But then you find your brain saying like, well, what if this happens? Maybe I should do this. All of those are literally signs of your subconscious calling bullshit on your understanding of what the thing is that you're doing. In order to control that, this is exactly how you do that. Going back to basketball. If you put Steph Curry to shoot free throws and for those that don't know he's a really good, shooter. And if you put him to shoot free throws, there is not going to be questions in his mind about how should I roll my fingers. Where should my elbow be? Should my elbow be tucked? How do I want to set up my feet? All of that is all ironed out. As soon as he steps up to the free throw line, what's his job? Literally to execute to just do the",
    "start_timestamp_seconds": 1175.0,
    "end_timestamp_seconds": 1263.0,
    "start_timestamp": "19:35",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=1175",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "roll my fingers. Where should my elbow be? Should my elbow be tucked? How do I want to set up my feet? All of that is all ironed out. As soon as he steps up to the free throw line, what's his job? Literally to execute to just do the thing. That's it. What I'm highlighting here is that in order for him to be at a point that when he steps up to the free throw line to shoot a shot, he's he's already done all this shit in the background. He's done thousands of repetitions shooting the ball to understand how it behaves, how it bounces, how his hand feels on it, what feels wrong, someone and so forth. All of that is in here. So to take this to a trading lens. When we're considering profit mechanisms to give you a starting point, just ask yourself, how do things make money, right? Like how do things make money? What we know that price can go up. Price can go down. Balthility can go up. Balthility can go down. Price can oscillate sideways. Valtility can oscillate sideways, but remember, even when something is oscillating sideways, more often than not, those are just smaller versions of up and down over different time frames. These are great broad buckets to start drilling down into to figure out what a specific profit mechanism is. So for example, the one that most people are going to be familiar with price going up.",
    "start_timestamp_seconds": 1241.0,
    "end_timestamp_seconds": 1338.0,
    "start_timestamp": "20:41",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=1241",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "not, those are just smaller versions of up and down over different time frames. These are great broad buckets to start drilling down into to figure out what a specific profit mechanism is. So for example, the one that most people are going to be familiar with price going up. If we think about price going up, and we just want to build a genuine overall relationship with the price going up. Let's just eyeball some stuff real quick. If I look at this, for example, if I look at T triple cues over the last year, I can see it's gone up. I can see that using the standard deviation channels. I'm literally just using the slope of the standard deviation channels. You can also just use the price relationship. But one of the things I noticed about T triple cues as it went up over the last year is that it went from split adjusted 45 down to 17. For those that aren't keeping score to 62% drop. Okay. If you have no context, you should just put that in your back pocket. You should just identify that. See that that exists. From there, you could say, well, how does that compare to like maybe one of its constituents apple? And I look at how apple did. Well, apple looks pretty interesting. It also had that same general drop, but let's measure this one. 34. About half of what you saw on T cues. Okay. That's useful. Now",
    "start_timestamp_seconds": 1315.0,
    "end_timestamp_seconds": 1421.0,
    "start_timestamp": "21:55",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=1315",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "how does that compare to like maybe one of its constituents apple? And I look at how apple did. Well, apple looks pretty interesting. It also had that same general drop, but let's measure this one. 34. About half of what you saw on T cues. Okay. That's useful. Now maybe we move out of this asset class, out of tech. And we go into some sort of healthcare. So now I'm looking at Pfizer. How did Pfizer do during this drop? 22, even less. It's also down on the year, which is slightly different. The point that I'm making is when you first start this idea of exploring a profit mechanism, you're not going to know that details. You're not going to know if what you're looking at is drift or momentum or a breakout or a breakdown or whatever other labels you want to associate with it. The most important thing you can ask yourself in the beginning there is do I think whenever price goes up or down? Does it always look the same? You inherently know the answer to that is no. So then it's clicking in another level and it's saying, how is it different? And trying to build an understanding of what those differences are. Now a way that you can accelerate a lot of this is by doing some cursory research on a platform called as a platform. It's a platform called SSRN social science research network. It's completely free and there's a",
    "start_timestamp_seconds": 1399.0,
    "end_timestamp_seconds": 1487.0,
    "start_timestamp": "23:19",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=1399",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "And trying to build an understanding of what those differences are. Now a way that you can accelerate a lot of this is by doing some cursory research on a platform called as a platform. It's a platform called SSRN social science research network. It's completely free and there's a lot of research on there, which is awesome. What that means is you could just type in keywords that interest you and you could just see what exists. What kind of research has been done and you'll find things like momentum. It's exceedingly researched. It's very robust to great starting point. So then you can now drill down into this individual profit mechanism of momentum and better understand how it behaves. But then also how to identify it. That's the next key part of this process is we begin by just brainstorming how something makes money. We did that price goes up. The next part of that is price looks different when it goes up. It does things differently. So we do a little bit of cursory research. We come across the concept of momentum. Then we start seeing how momentum bays. What are the traits that help me identify momentum? What's the underlying driver of momentum? Once I understand how it typically looks, then I can brainstorm ways to find it. If you don't know what the thing looks like that you're attempting to trade, how on earth and you find it. You cannot. It's like trying to find",
    "start_timestamp_seconds": 1472.0,
    "end_timestamp_seconds": 1574.0,
    "start_timestamp": "24:32",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=1472",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "momentum? What's the underlying driver of momentum? Once I understand how it typically looks, then I can brainstorm ways to find it. If you don't know what the thing looks like that you're attempting to trade, how on earth and you find it. You cannot. It's like trying to find somebody who you don't know what they look like. Doesn't make sense. It's the same exact thing. Once you understand what momentum might look like. So for example, let's go to spy. We know the indices exhibit both positive drift and momentum. We can measure the momentum in spy based on different iterations into avoid going too far in the weeds. There's different lookback periods that help us spot an identifying momentum. So then that starts going into your signal bucket. How do you know that there's different lookback periods by going on SSRN? If you read some of those research papers on momentum, they will literally tell you. Stuff like a 12-month lookback period. Stuff like a six-month lookback period. Our positively correlated with future price movement over different iterations. Some of them even go as far as to say it's the trailing 12 months less the most recent month to avoid reversals. And so on and so forth. There's a bunch of different versions of it. Once you understand what kind of signals you can use to spot it in measure it, now you can go look for it and you can just track the profit mechanism by",
    "start_timestamp_seconds": 1548.0,
    "end_timestamp_seconds": 1645.0,
    "start_timestamp": "25:48",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=1548",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "month to avoid reversals. And so on and so forth. There's a bunch of different versions of it. Once you understand what kind of signals you can use to spot it in measure it, now you can go look for it and you can just track the profit mechanism by itself. For this specific example of momentum, here's a perfect starting point for you. If you go and you look at the different SNP sectors, these are the individual constituents of the SNP 500 broken down by the sectors. You can trade what we refer to is cross-sectional momentum. Cross-sectional in study terms means that we're just looking across different things at the same point in time. That's cross-sectional analysis or over the same windows. And you can figure out which of these are strong relative to the others. And you can track that. Give yourself a weekly or a monthly rebalance. So what that would look like is today is a December. You would sit down on a December and maybe Friday or whatever day you want to do it. Mondays fine too. It doesn't really make that big of a difference although there are some days that are better than others. You'll learn that in time. And you just mark down which of these are doing best over the last year. So let's use the 12 month cycle. I can see that Excel K is trending higher here and its 12 month return is 22.4%. So I'm just",
    "start_timestamp_seconds": 1629.0,
    "end_timestamp_seconds": 1730.0,
    "start_timestamp": "27:09",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=1629",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "better than others. You'll learn that in time. And you just mark down which of these are doing best over the last year. So let's use the 12 month cycle. I can see that Excel K is trending higher here and its 12 month return is 22.4%. So I'm just going to look across the remainder 12 month returns. And I'm going to see if I can find something that beats 22.4%. And I don't see it. This is the strongest performer over 12 month look back here. This would be the thing that we buy. How do you track how all of that works super simple? All we do is not worry about the option structure. We don't worry about any of those details yet. Don't get slowed down on any of those. All we do is build a little tracker. I think we have one of those in one of these. On sec. Here. That's a lie. Well anyways. I thought we had one in here. I must have got rid of it. Oh, there it is. Boom. So what this is doing is we can literally just track the momentum across these different sectors. We can see how they're doing on different timeframes. And we can measure their price. And we could just see how does this behave using a week over week month over month look back period. And then we can track the performance of our approach. Just by looking at the price of the",
    "start_timestamp_seconds": 1708.0,
    "end_timestamp_seconds": 1817.0,
    "start_timestamp": "28:28",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=1708",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "how they're doing on different timeframes. And we can measure their price. And we could just see how does this behave using a week over week month over month look back period. And then we can track the performance of our approach. Just by looking at the price of the underlying not worrying about structures strategies. You can get rid of literally all of that at this point and just focus on measuring the profit mechanism. Last point on this. Once you have the profit mechanism measured once you know how it behaves and what it looks like. Guess what's naturally going to start happening in your brain. You're going to say stuff to yourself like, oh, I kind of know how I might be able to make money in that because you should be. Going through when still working on your foundational options knowledge in understanding in detail how options behave. So then you might say to yourself, well, it's the average move for the top performer in the sector rotation strategy over a month window is typically 1.8%. Now you can start making informed decisions. Do you want to sell super far out of them or do you want to buy super far out of the money calls that are really near term to capture that? No, you're probably going to like your money on fire. Doesn't move that much. So then if you want to buy calls, maybe you go a little further out in time at",
    "start_timestamp_seconds": 1799.0,
    "end_timestamp_seconds": 1883.0,
    "start_timestamp": "29:59",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=1799",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "want to buy super far out of the money calls that are really near term to capture that? No, you're probably going to like your money on fire. Doesn't move that much. So then if you want to buy calls, maybe you go a little further out in time at the money in the money, something like that, or maybe you choose to sell puts or puts spreads, whatever. But the main point there is once you understand what it looks like and how to find it, it's naturally going to inform to you what kind of structures you would use to trade it. Yeah, really, really awesome conversation that I think I said, I at least I know how my world cut out for me for next year just to scope out and plan out all these things. And how how I personally executed right and just picking it to our own sensibilities also comes into play there. But yeah, thank you. Yes, sorry, just one note on that specifically in your scenario, because I think it's really useful to people is one of the things we talked about for you is because you're looking to trade something like teach real cues. What we can do is use the behavior of teachable cues to create money, carless simulations. The point of that is we don't know what's going to happen going forward all of this backwards looking statistical analysis is to give us something to go off of. Not",
    "start_timestamp_seconds": 1872.0,
    "end_timestamp_seconds": 1954.0,
    "start_timestamp": "31:12",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=1872",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "teach real cues. What we can do is use the behavior of teachable cues to create money, carless simulations. The point of that is we don't know what's going to happen going forward all of this backwards looking statistical analysis is to give us something to go off of. Not because the future is going to look exactly like the past, but they typically look close enough, they're not that crazy apart. But for Shrey J specifically, what we discussed doing was pulling down price data of teachable cues, beating it into our Python, your thing of choice. And having it simulate price behavior completely random. And then what you can do in that kind of scenario that's really useful is if it runs 10,000 simulations. What you can do is say, okay, I want to practice on something towards the middle in terms of the distribution of returns. But then you can also save yourself, well, I want to practice also running this on things that are in the upper desk style, right, like the top 10% of those runs and pick one random. And you can also do that to the downside. You can say, I want to find the bottom desk style of performers, the worst performers. And I just want to click through and see how I would do in that kind of scenario. Think of the confidence that comes with doing that. You already know that you're trading a completely random environment that's trained based",
    "start_timestamp_seconds": 1921.0,
    "end_timestamp_seconds": 2017.0,
    "start_timestamp": "32:01",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=1921",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "find the bottom desk style of performers, the worst performers. And I just want to click through and see how I would do in that kind of scenario. Think of the confidence that comes with doing that. You already know that you're trading a completely random environment that's trained based loosely off of prior price behavior. And that training is important is so that you know that what you're looking at now, well, at least somewhat resemble the thing that you're actually trading versus completely random. That doesn't work that well. Then you can literally feed yourself data a week at a time. You could say, give me the price data for the next trading week and figure out what your price data is. You can plot it in something if you want. You can practice your decision making and then you can measure how you do because now you have a bunch of different data points. You have an understanding of how this thing behaves in the past. You use that to help generate how you might want to trade it. Then you test it. But you're not testing it just in the past, which is what I would do to start. It's an easier way to test and it gives you ideas. But then you can live test it and you don't have to just live tested by paper trading and in the existing market, which is also what I would do. That's time consuming. You literally have",
    "start_timestamp_seconds": 2001.0,
    "end_timestamp_seconds": 2071.0,
    "start_timestamp": "33:21",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2001",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "do to start. It's an easier way to test and it gives you ideas. But then you can live test it and you don't have to just live tested by paper trading and in the existing market, which is also what I would do. That's time consuming. You literally have to wait a week in order to get a week's worth of data so then you can simulate it. So now you're back testing. You understand this thing from a historical frame. Your live testing using current market data. You're also live testing using simulated data. That's you being Steph Curry and shooting thousands of jump shots so that when it comes time to actually position yourself with your actual portfolio. You have that same confidence that Steph Curry does if he's going to walk up to the free throw line. So that's one of the projects that we have Shray working on in the context of his approach and it's for those reasons. It's for that exact confidence building component. Sorry to cut you off. I just thought that was a perfect time to slide that in. No, that was a great great point there because I did take your input from our last conversation and start working on it and realize I needed to learn techniques to get it working. So there was a whole bunch of new learning there. I've been enjoying it. The whole process is really really challenging. The whole concept of creating is challenging.",
    "start_timestamp_seconds": 2065.0,
    "end_timestamp_seconds": 2144.0,
    "start_timestamp": "34:25",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2065",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "your input from our last conversation and start working on it and realize I needed to learn techniques to get it working. So there was a whole bunch of new learning there. I've been enjoying it. The whole process is really really challenging. The whole concept of creating is challenging. We take it like you say, the bar of entry so low, but to get better continuously. I'm maintaining that slope just you require continue learning different techniques and you know pursuing it. Yeah, we'd say that the interesting part on that is you can also pick your adventure, right? You can, for example, in teach triple cues. If you just dollar cost average in and you were comfortable with 90% drawdowns, you could do that and it would probably work fine over a longer term time frame is that optimal will depends on how much effort you want to put in and how comfortable you are with massive drawdowns. So then you might say to yourself, well, I'm okay with drawdowns, but like I don't want to draw down 90% so then you can then go one step of effort in and you can just say, well, how do I, I'm okay with 60% drawdowns, but I want to go to 90% how do I knock it out 90% and you could build something really basic around that. But then you say to yourself, well, I don't mind 60% drawdown, but I actually think I can make way more",
    "start_timestamp_seconds": 2126.0,
    "end_timestamp_seconds": 2206.0,
    "start_timestamp": "35:26",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2126",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "I, I'm okay with 60% drawdowns, but I want to go to 90% how do I knock it out 90% and you could build something really basic around that. But then you say to yourself, well, I don't mind 60% drawdown, but I actually think I can make way more money on this thing. How do I do that? And we're just kind of progressing along this continuum of how much effort do I want to put into this thing and what do I expect to get out if you don't want to put in that much effort. So genuinely can get by with the parade of principle, which is you're doing minimal amount of work 20% to get the 80% result. The thing that I remind people in the context of trading and I typically do this with a compound interest calculator is that the smaller percent. So let's say you do 20% work to get the 80% result. Well, that 20% excess result that exists. Even if you capture 15 of it over the long run, that's tens of millions of dollars. If you do a good job at this thing. It's fucking worth it. But to your point, there's a lot of learning as you go deeper on that continuum, which if you have the right mindset, it's actually really, really fun. But if you look at all of it in the context of how do I do the least amount of work to get the most",
    "start_timestamp_seconds": 2186.0,
    "end_timestamp_seconds": 2263.0,
    "start_timestamp": "36:26",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2186",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "point, there's a lot of learning as you go deeper on that continuum, which if you have the right mindset, it's actually really, really fun. But if you look at all of it in the context of how do I do the least amount of work to get the most output. That's generally a terrible, terrible fit for trading at that point, you're better off investing dollar cost averaging something like that. That's the Pareto principle in this context. Yeah, absolutely enjoying it. So speaking of challenging here, I thought we could discuss a little bit about how traders could review their performance for the year and you know, frame their approach for next year. What are some high level like if I break open my trading log and see hundreds and thousands of trades for the year, what what can I take insights from that what are some high level things I can take from it. So I have a video on the channel. I'll throw a link to it in the description below that it's titled stop guessing master trading improvement with after action reviews. And it's effectively doing that process in after review process. Now for those in the military that will sound very familiar to you, it's something that we do all the time. It's actually a written thing that we typically do. And there's a few key questions that we typically ask ourselves in an after action review cycle. Most of the time, it's some",
    "start_timestamp_seconds": 2255.0,
    "end_timestamp_seconds": 2335.0,
    "start_timestamp": "37:35",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2255",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "in the military that will sound very familiar to you, it's something that we do all the time. It's actually a written thing that we typically do. And there's a few key questions that we typically ask ourselves in an after action review cycle. Most of the time, it's some variation of what did you expect to occur, what occurred. And what elements do you want to sustain, meaning they're good, and you want to continue doing those and what elements do you want to improve, meaning it didn't go well and you want to fix it. It's essentially doing that across different levels and I will share my screen again so that I can give you a little bit of a visual and then again for those just listening, I'll give you a verbal walk through as we go through this. But this is the way that I would look at it. You have two broad three broad levels, you have a portfolio level. This is how did things work across the portfolio, then you have things like strategy level. How did we employ a specific strategy and then you kind of like this trade level. The funny thing about these three different levels is when I talk about risk, these are the same levels that risk applies to. So this is one of those things where if you invest the time understanding like these different quote unquote levels, they persist across other pieces of analysis you might do.",
    "start_timestamp_seconds": 2316.0,
    "end_timestamp_seconds": 2403.0,
    "start_timestamp": "38:36",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2316",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "about these three different levels is when I talk about risk, these are the same levels that risk applies to. So this is one of those things where if you invest the time understanding like these different quote unquote levels, they persist across other pieces of analysis you might do. Now, in the context of a portfolio, you're going to ask yourself naturally first how much money did I make. So what was my starting value? What was my ending value at the top line? That's what you're after. At the portfolio level, there's other stuff that's really important that you're probably not going to hear talked about, which is something like, what's my savings rate? I watched it. I add on average to the portfolio and how good of a job that I do staying consistent to that. I will always, always remind people, especially when you have a smaller portfolio, you have, you have to prioritize saving because it is a miracle point of your career. You have a $10,000 portfolio and you save $1000 over the course of a month. You literally just gave yourself a 10% return in a month. This is not going to continue forever because what ends up happening is you have a $100,000 portfolio. Now, you gave yourself a percent and then as you have a million dollar portfolio, which hopefully you guys do, well, now you're at 0.1%. Right. So you like you get the point. It's the saving is in",
    "start_timestamp_seconds": 2394.0,
    "end_timestamp_seconds": 2496.0,
    "start_timestamp": "39:54",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2394",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "forever because what ends up happening is you have a $100,000 portfolio. Now, you gave yourself a percent and then as you have a million dollar portfolio, which hopefully you guys do, well, now you're at 0.1%. Right. So you like you get the point. It's the saving is in an absolute power power mode in the beginning in terms of what it does for your portfolio returns. So if you view it that way, it becomes easier to prioritize it and the most important thing you remember is it's diminishing returns. And it's supposed to be. What'll end up happening is over time your gross returns, based on whatever percent you can generate, will matter way more than what you can save. And that's the beautiful part of compounding. So these are two really easy starting metrics. Now there's other metrics stuff like the total number of trades. How active was I. Another really common one that people miss is commission. And then if you're a little more adept, you can also do execution quality. So in case you don't know, you can reach out to your broker and you can request documentation relating to how your orders were routed and you can measure what your total. Execution quality looks like in the aggregate, which is really, really useful. The reason why we want to do that is because every single time you press the button as an option straight or your incurring cost, whether you make money or",
    "start_timestamp_seconds": 2474.0,
    "end_timestamp_seconds": 2570.0,
    "start_timestamp": "41:14",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2474",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "routed and you can measure what your total. Execution quality looks like in the aggregate, which is really, really useful. The reason why we want to do that is because every single time you press the button as an option straight or your incurring cost, whether you make money or not doesn't matter your incurring cost. By understanding how your execution quality is that typically will lead to some different decisions in terms of what strategies you're trading, what kind of things you trade in. These becomes way more relevant as your account grows. So these are kind of like still really, really high level performance metrics. We also might want stuff like total P and L volatility. This can be something like a high low range. Meaning what was the peak of your account value, what was the trout and what is it look like in between those points. You can also track things like your max drawdown at the portfolio level. Whenever I start thinking about this AR process, I think of it in the context of like what information would I want to have in order to make. In order to make better decisions for newer traders are really, really big one is something like this, the number of trades and then you can plot the average P and L per trade. You might find that you're trading a shit ton and you're not actually generating that much money per trade. Which then leads us into a",
    "start_timestamp_seconds": 2551.0,
    "end_timestamp_seconds": 2671.0,
    "start_timestamp": "42:31",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2551",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "are really, really big one is something like this, the number of trades and then you can plot the average P and L per trade. You might find that you're trading a shit ton and you're not actually generating that much money per trade. Which then leads us into a subsequent analysis at the strategy level, what strategies are doing this and you will typically find your really, really short term intraday scouting stuff. He's not doing that much for you. And then if you actually overlay your commissions and execution quality on top of all that, you probably find you're not making much. Now again, that's not to say you can't make money doing that. You can. I actually know some people that do, but it's very, very rare. Most people don't. There's other P and L level metrics that are relevant. So you can think of your portfolio level metrics in terms of like structural, which is kind of like this stuff. And then you have P and L metrics. So again, these are things like vol max drawdown cumulative returns. So on and so forth. Then once you get through this, we move into the strategy level. The strategy is literally looking at effectively the same stuff here, but within an individual strategy. So this means if I had six strategies, or each of these six, I'm going to look at stuff like the number of trades. The average win average loss, cumulative P and L. And",
    "start_timestamp_seconds": 2645.0,
    "end_timestamp_seconds": 2764.0,
    "start_timestamp": "44:05",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2645",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "The strategy is literally looking at effectively the same stuff here, but within an individual strategy. So this means if I had six strategies, or each of these six, I'm going to look at stuff like the number of trades. The average win average loss, cumulative P and L. And so on and so forth. Now the trade level, this is more spot checking if there's stuff that I'm doing that deviates from what I'm supposed to do. And more often than not at the trade level, this is where I'm looking at the tails, both good and bad. So I'm looking for outliers. If I plot my P and L here and let's say we're looking around. And this is generally what you see. But then you see something like this and something like this. These individual trades require some analysis to figure out what happened here. Is this something that we might be able to recreate in some way? Is this something that we might be able to cut out that won't drastically affect our total P and L? This is a way to inform strategy decisions, but based on individual trades that look funny. And that's exactly how I would think about the trade level. Most of the work that you're doing in an after-action review to analyze like how you're performing is really at these two levels. So then how do you carry this forward into like the next year or in terms of whatever you're",
    "start_timestamp_seconds": 2731.0,
    "end_timestamp_seconds": 2841.0,
    "start_timestamp": "45:31",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2731",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "how I would think about the trade level. Most of the work that you're doing in an after-action review to analyze like how you're performing is really at these two levels. So then how do you carry this forward into like the next year or in terms of whatever you're wanting to do next? Well, that's where you define stuff. So you would say this year I was targeting a 50% return next year. I'm going to target a 20% return. Out of what happened this year, what do I think I can do to help me get there? Well, you might be able to identify at your strategy level. What things performed well relative to each other and relative to the market? You can also overlay things like a regime analysis. So you can ask yourself a question like, okay, when the market was up, which of my strategies were up the most? When the market was down, what are my strategies performed the best? Guess what that does? It reinforces your playbook next year. So then if it starts with a really hot year and things in the broad market are going well, we're probably going to focus a little more on this bucket. If things start going to hell in a hand basket and the market starts cratering down, we're probably going to look more at this bucket. And this is a way that you can use the performance of these things in the course of an",
    "start_timestamp_seconds": 2831.0,
    "end_timestamp_seconds": 2911.0,
    "start_timestamp": "47:11",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2831",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "a little more on this bucket. If things start going to hell in a hand basket and the market starts cratering down, we're probably going to look more at this bucket. And this is a way that you can use the performance of these things in the course of an individual year. And that's actually one of the cool parts about this year is because we did have a pretty good pullback here. So it gives you a good sense of how your things work during a pretty healthy correction that still ended up being in up year. So to summarize all of that at the portfolio level, I want to look at structural details. I want to look at P&L metrics and then I want to look at risk metrics. Any sort of regime analysis that I can identify. I'm looking at things like utilization, how much of the account on my using and how does that impact my P&L. So on and so forth. And then at the individual strategy level, I'm literally just starting the problem set from saying to myself, what details do I need relative to this strategy in order to either sustain it or make it better? We first have to start by analyzing it, which is some of these metrics. And then in terms of follow on research questions, once you get that data, that's when you can start saying, well, maybe for my intraday scalping strategy that after I look at my",
    "start_timestamp_seconds": 2901.0,
    "end_timestamp_seconds": 2980.0,
    "start_timestamp": "48:21",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2901",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "make it better? We first have to start by analyzing it, which is some of these metrics. And then in terms of follow on research questions, once you get that data, that's when you can start saying, well, maybe for my intraday scalping strategy that after I look at my average P&L per trade, it's not that good. And I'm hyperactive, maybe I modify that strategy a little bit. Maybe you still do your intraday trading, but maybe you're just not trading it quite as actively. And you test that idea and so on and so forth. Now for a deeper dive into effectively all of that, again, you can check out that video that I have linked below. It'll give you effectively all of those details, but that's kind of a thing for itself. Yeah, that was helpful. I'll have to remind the video again, as usual, it was densely packed with information. And if you go back and we will do a couple of times together all of that. If you had a few minutes ahead, another question. This is a bit of a question. How would you, what were your top highlights from the trading year of 2020? How would you describe your performance or what were your key takeaways? And so, the interesting, because as you know, I'm in the process of doing my end of year A, R, and there's a lot, actually, that stuck out to me. I would say in terms of like",
    "start_timestamp_seconds": 2960.0,
    "end_timestamp_seconds": 3059.0,
    "start_timestamp": "49:20",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=2960",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "2020? How would you describe your performance or what were your key takeaways? And so, the interesting, because as you know, I'm in the process of doing my end of year A, R, and there's a lot, actually, that stuck out to me. I would say in terms of like the broad market and analyzing how the market performed, which is actually a really important part of what I do. I want to understand like how volatility behaved and those kinds of things, how did different sectors behave, how did things trend? So, I'm not sure if you're going to be speaking, we had a pretty good year of generally elevated, not much, but generally elevated. One of the things that really stuck out to me from a volume, is that I noticed that the transitory periods were a little more aggressive than they are typically, and volatility clustered for shorter durations at highs and longer durations at lows. All of that is been, again, not like anything monumental, but generally informative, because as I'm looking across the individual strategies and I'm looking at the portfolio and kind of seeing like what's working, what's not working. That gives me a lot of context, and it's the same thing with the covered-strangle segment of the portfolio. The covered-strangle segment of the portfolio really is not doing that great on the year. So, right now, if I look across the market, S&P is up like 16%, queues is up like 21, TQs",
    "start_timestamp_seconds": 3037.0,
    "end_timestamp_seconds": 3139.0,
    "start_timestamp": "50:37",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=3037",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "lot of context, and it's the same thing with the covered-strangle segment of the portfolio. The covered-strangle segment of the portfolio really is not doing that great on the year. So, right now, if I look across the market, S&P is up like 16%, queues is up like 21, TQs is up like 38, I bit is down 6.2, and when I took the snapshot for last month, so over the course of November, but this is year to date performance up to the end of November, that was the qualification was up only 13.8%. And a big part of that had to do with this here. So, this is absolutely hurt the portfolio in terms of total performance, and it's not even just being down on the year. It's actually this accelerated down move recently. That happens pretty regularly with the covered-strangle. You can get rain over and again, the overall return for the covered-strangle is under the market in general, but my total volatility of P&L is a third of what the broader market P&L volatility was. So, that's the benefit of this thing is I'm pretty comfortable scaling capital into it. But the other thing that I noticed that was a really interesting mental exercise is I was told you guys in a couple, you know, like recaptures, that so far this is lining up easily to be my third best year, if not my second best. The irony behind all of that is that this year,",
    "start_timestamp_seconds": 3125.0,
    "end_timestamp_seconds": 3236.0,
    "start_timestamp": "52:05",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=3125",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "noticed that was a really interesting mental exercise is I was told you guys in a couple, you know, like recaptures, that so far this is lining up easily to be my third best year, if not my second best. The irony behind all of that is that this year, I absolutely was not like pursuing that performance. And I find it to be a really interesting mental exercise, because it reminds me of just my underlying human baseline that I operate out of no matter what, which is starting from a bit of a scarcity lens. I definitely grew up in a more constrained environment, physically. And I think that's left a pretty long-standing imprint on even my subconscious. So what I mean by this is there's a really good psychological experiment that exists that analyzes this kind of scenario. So let's say that we have a few different levels. Let's say that this is baseline and we're talking in a survival setting. This is baseline survival. Let's say that this is one wrong below baseline and this is one wrong above baseline. The way that our brains typically work is when you're at this level, you are way more risk open typically. And it's because you're already in an uncomfortable scenario. So then the way we think about it is I'm already hungry. I already get wet when it rains out. So the prospects of taking a risk to move up to this, compared to the prospects of",
    "start_timestamp_seconds": 3213.0,
    "end_timestamp_seconds": 3324.0,
    "start_timestamp": "53:33",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=3213",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "more risk open typically. And it's because you're already in an uncomfortable scenario. So then the way we think about it is I'm already hungry. I already get wet when it rains out. So the prospects of taking a risk to move up to this, compared to the prospects of losing a little bit and getting a little bit more wet in the rain are not laid the same. Your brain is like the prospects of getting to this, where I'm not wet when it rains. And I'm eating better is worth this risk. Then when you get to this baseline level, you do not view the upside and downside the same. You can take, let's just call it a one to one risk. You can move yourself up to maybe where you're a little bit warmer in your shelter. And maybe you get some warm food or something compared to your baseline, which is cold food in a cooler shelter. But the risk to get there involves the potential to go back to this, where you're wet and you're not eating enough. You do not view that one to one reward the same. Most people would say, I don't want to take this chance. Even though it's a 50-50 chance, I have a 50% probability of having a better scenario. Because the 50% probability of a loss moves me below this comfort baseline, I don't view it as a 50-50 scenario. That Concept is really important, especially in my",
    "start_timestamp_seconds": 3304.0,
    "end_timestamp_seconds": 3398.0,
    "start_timestamp": "55:04",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=3304",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "want to take this chance. Even though it's a 50-50 chance, I have a 50% probability of having a better scenario. Because the 50% probability of a loss moves me below this comfort baseline, I don't view it as a 50-50 scenario. That Concept is really important, especially in my life. What I've learned is I've always set return targets, and broadly that's because I use them as planning factors. Have an idea of like, what I'm shooting for and why and what that might do for me. But I found in the last few years, I've actually guided down my return targets, and it's because of the really fortunate scenario that is your portfolio scales. You don't need as high of a return to create the same gross dollars that you want. It's kind of funny because a lot of people are so focused on their returns. They're like, yeah, I want to make 20% 25% 50% whatever. But there actually comes a really cool point in time where you're like, well, I can make three quarters of a million dollars returning six percent. And we're really care about the 20% at that point. I'm cool, living off of a lower return that generates a perfectly reasonable gross dollar amount. Now, what that's led to, for me at least, is being really selective in terms of what risk is. And I find myself not really forcing anything, not putting on stuff because I have to have stuff on. I'm",
    "start_timestamp_seconds": 3378.0,
    "end_timestamp_seconds": 3480.0,
    "start_timestamp": "56:18",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=3378",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "a lower return that generates a perfectly reasonable gross dollar amount. Now, what that's led to, for me at least, is being really selective in terms of what risk is. And I find myself not really forcing anything, not putting on stuff because I have to have stuff on. I'm not scaling into the coverage angles because I have to scale into them in order to sell enough puts or in order to have enough risk in order to generate my annual return. And I'm really just focusing on really interesting opportunities that when I evaluate them on a risk or award profile. I kind of can't not want to take advantage of it. And there's a really good example of this pretty recently in crude oil. And I gave you guys this example because to me, this was like one of the easiest, no brainers that I've traded this year, which was in June, oil started peaking up above like 74. It even got above 75. And as soon as I saw oil at those levels, I immediately started building a playbook to fade it. And it's not because I had some sort of super strong opinion on oil, although my base opinion was that it was going to go down. But I viewed the upside risk that I was taking relative to where it might go down to is just too good of a risk rewards scenario. So let's say, for example, at 76. If I shorted at",
    "start_timestamp_seconds": 3451.0,
    "end_timestamp_seconds": 3556.0,
    "start_timestamp": "57:31",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=3451",
    "chunk_index": 46,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "although my base opinion was that it was going to go down. But I viewed the upside risk that I was taking relative to where it might go down to is just too good of a risk rewards scenario. So let's say, for example, at 76. If I shorted at 76 and it rallies up to its annual high of 80. Okay, I take four points. But what if it goes back down to its longer term baseline levels of like 60. I'm risking six points and I'm targeting 15 points, 14 points. I'll take that. And because of that kind of preference and because of that kind of imperative, I find myself just naturally holding the trigger on a lot of really lucrative trades. And again, not in terms of like making a bunch of money always, but more so in terms of the risk to reward profile that I'm taking and the last thing I'll say on all of that is I also do think that the culmination of my learned experience continues to magnify. And that's just a artifact of doing this for a long time. And I do believe, even if I look at my returns, it's not even like a postulation. It's like very, very clear that if I look across my returns, my annual returns, my monthly returns, my profile gets way tighter in terms of what I'm making and when. And that's also the maturation of my execution approach and my overall process",
    "start_timestamp_seconds": 3535.0,
    "end_timestamp_seconds": 3636.0,
    "start_timestamp": "58:55",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=3535",
    "chunk_index": 47,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "it's not even like a postulation. It's like very, very clear that if I look across my returns, my annual returns, my monthly returns, my profile gets way tighter in terms of what I'm making and when. And that's also the maturation of my execution approach and my overall process of what I do. So to summarize all of that, I think that there's a couple really key factors with respect to my performance on the year. There's the lower imperative, which is led to much more effective opportunity seeking that coupled with continually expanding learned experience to help identify really good opportunities. Coupled with a really mature execution approach has led to a really, really successful year for me and successful prior years. Now I say that a little premature because the year's not over yet, but I also know that with the way that the portfolio is set up, there's no way I will return less than 70% on the year. It's just not going to happen. So because of that, I'm still really confident in what I'll do on the year and the overall return profile. It's a really fascinating mental exercise. I don't know. I'm curious, Tray, when you look through your performance, how do you, how do you evaluate like that kind of same thought process in terms of like the stuff that you're trying to trade. Do you view it is like you're trying to force and put stuff on or what does that",
    "start_timestamp_seconds": 3614.0,
    "end_timestamp_seconds": 3703.0,
    "start_timestamp": "01:00:14",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=3614",
    "chunk_index": 48,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "Tray, when you look through your performance, how do you, how do you evaluate like that kind of same thought process in terms of like the stuff that you're trying to trade. Do you view it is like you're trying to force and put stuff on or what does that feel like for you. It's all over the place and you can tell that it is the lack of experience like knowledge. There's no smoothness in it. It's it's volatile. Sometimes I feel like I need to I know sometimes I feel like I need to scale back. Yeah, it's not uniform. It's not fluctuating to the year. What do you think causes those fluctuations for you? I think I don't know. I don't really know. I don't have a good answer for that. I think my guess would be that just just the solid understanding behind what I'm doing and how I want to get there. I had a quote like last week was something that said, it's all great. If you have a target and a forecast where you want to get to, but we as traders get paid managing the path that we take to get there. And I keep messing up the management of the part kind of where that's where I think I myself. Because I'm focused on where I want to get to. So I do things that might not be optimal. I'd currently to get to where I want to get to. Do",
    "start_timestamp_seconds": 3703.0,
    "end_timestamp_seconds": 3796.0,
    "start_timestamp": "01:01:43",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=3703",
    "chunk_index": 49,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "And I keep messing up the management of the part kind of where that's where I think I myself. Because I'm focused on where I want to get to. So I do things that might not be optimal. I'd currently to get to where I want to get to. Do you think that's stemming from you're not sure how to blend all the things that you're doing together into like a cohesive package? I think I have some ideas. I just need more time. I think just practice time on this and just really more rigorous exercise and clearly defining what I'm trading because I mentioned this like trading long calls. There are even within that there are several different profit mechanisms right could be sequential breakouts with gapups. It could be breakout then consolidation break and then move like all of these different things require different management techniques. But I've been mixing them all up because I entered thinking one thing and then while it's happening. I'm changing that that I'm adding noise to what I think I want to do. That's interesting because when we think of the coverage triangle side of it that mirrors that right which is not like fully defined profit mechanisms in terms of like the profile for them because interestingly enough we we reviewed this. What yesterday I think the current trade that I have on in what is it, ax yeah I think yeah X to I all pull up my screen",
    "start_timestamp_seconds": 3779.0,
    "end_timestamp_seconds": 3869.0,
    "start_timestamp": "01:02:59",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=3779",
    "chunk_index": 50,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "is not like fully defined profit mechanisms in terms of like the profile for them because interestingly enough we we reviewed this. What yesterday I think the current trade that I have on in what is it, ax yeah I think yeah X to I all pull up my screen really quick. This is a really simple example of like a post earnings announcement drift gap in continuation play for me and. The way that I trade this is very very specific and it's based on this specific condition not necessarily just earnings to be clear it's like a catalyst it has to have a catalyst that causes a gap. And then from there there's other specific pieces to it that matter a lot to me that will lead to in entry. But the way that I figured out that is I would go back and I would find things that had a catalyst and then just generate price data around. Before the catalyst so three six months 12 months before the catalyst into the catalyst and then from the point where I see the catalyst on. And just like anything else you can create define the universe that you're attempting to trade so for example you know that you want somewhat liquid stocks that might have higher movement patterns in terms of average daily ranges so let's say at least 5% 80 are. And you can create a universe of those types of names and then analyze how they",
    "start_timestamp_seconds": 3852.0,
    "end_timestamp_seconds": 3958.0,
    "start_timestamp": "01:04:12",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=3852",
    "chunk_index": 51,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "attempting to trade so for example you know that you want somewhat liquid stocks that might have higher movement patterns in terms of average daily ranges so let's say at least 5% 80 are. And you can create a universe of those types of names and then analyze how they behave if they have. Catalyst gap. From there you can then break them out into their individual performance components so just like the thing with the coverage triangle I feel like that's probably a missing piece when it comes to the to the long calls because you're absolutely right like. I don't think it makes sense to bucket of strategy like long calls because if you do that it's not really aligned properly based on the profit mechanisms so. When you're placing the long call do you have an idea in your mind of like the specific profit mechanism and then they get jumbled. Is that what's happening? Yeah, yeah, I have it. No, no, you go ahead. No, I was just thinking I have a decent idea of a nice start and then while it's moving through. I'm bringing all others profit make all the management techniques that I use everywhere so it's not it's not clean. I see and. What do you think you would need to do or change. In order to have a smoother like entry and management experience. And just to clarify what I mean by that's like what information do you think that you",
    "start_timestamp_seconds": 3941.0,
    "end_timestamp_seconds": 4046.0,
    "start_timestamp": "01:05:41",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=3941",
    "chunk_index": 52,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "use everywhere so it's not it's not clean. I see and. What do you think you would need to do or change. In order to have a smoother like entry and management experience. And just to clarify what I mean by that's like what information do you think that you would need to have. I'm really just the solid understanding of what I'm doing what I intend to do through the life cycle of that tree. Not just at entry and not just at exit that you know just see the whole trade through it before I executed that way I'll have it planned out and then I can see what I thought and have to match the variance. Okay, you know close the variance from that. The coolest part about that is literally this skill that you're building in the coverage triangle in you know in terms of like running the simulations to me it's exactly how to do with this. What I would do is I would find you know maybe 50 underlines 25 is probably plenty actually 25 to 50 underlines that exhibit one of those specific profit mechanisms you know that you're attempting to trade. And download the previous 12 months of price data upload it again you can use our Python and you can run just simulations for fake stocks right give it different tickers XYZ one XYZ two X whatever you can give it fake tickers and you can practice your management over the",
    "start_timestamp_seconds": 4023.0,
    "end_timestamp_seconds": 4102.0,
    "start_timestamp": "01:07:03",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=4023",
    "chunk_index": 53,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "download the previous 12 months of price data upload it again you can use our Python and you can run just simulations for fake stocks right give it different tickers XYZ one XYZ two X whatever you can give it fake tickers and you can practice your management over the life cycle of literally the same exact thing that you're doing in T triple cues I would rough out the idea using historic data because it's. A name and it gives you something to begin the process with versus just going into it guessing. So I would back test first it's always a great way to rough out ideas then after back testing. I would do that version of live testing first and then once you have like one or two pretty good ideas that you think generally work well. Then I would layer on the live testing itself so this is where you're analyzing the market current market as it is running your scans and then tracking those live. But I think the coolest part about that is that it literally is the same exact thing that you're doing for TQ so once you get that process that analyst brought the analysis process outlined. It's literally just lifted and shifted and then to do it with other stuff. Yeah, that's that's really helpful thanks that actually is very encouraging because I'm enjoying this and get me closer to. Building out a simulator and you know running the test so",
    "start_timestamp_seconds": 4102.0,
    "end_timestamp_seconds": 4189.0,
    "start_timestamp": "01:08:22",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=4102",
    "chunk_index": 54,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "brought the analysis process outlined. It's literally just lifted and shifted and then to do it with other stuff. Yeah, that's that's really helpful thanks that actually is very encouraging because I'm enjoying this and get me closer to. Building out a simulator and you know running the test so but I did have a question a follow question on your. Performance here mostly about how you're thinking of setting targets next year do you find yourself restraining. How where you want to target to be how do you like clearly like you mentioned you have way out performing you're blowing it past water right so how do you match that up is it like a really difficult conflict in your head. No it's it's actually is seamless is it's ever been because. I have the the base return that I know I need to hit in order to achieve the general return that I want and again it's not the general return in terms of like a percent although that's the base target but it's the gross dollars that that person provides. Beyond that it's really a function. For me of. Looking at markets scanning because I always do that and then looking for things that I consider to be really really good opportunities and then whatever that upside leads to. I actually generally don't really care because anything that's above the target puts me ahead of base so it doesn't actually matter beyond that because. I think we're",
    "start_timestamp_seconds": 4168.0,
    "end_timestamp_seconds": 4273.0,
    "start_timestamp": "01:09:28",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=4168",
    "chunk_index": 55,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "that and then looking for things that I consider to be really really good opportunities and then whatever that upside leads to. I actually generally don't really care because anything that's above the target puts me ahead of base so it doesn't actually matter beyond that because. I think we're doing it here to a lot of people I think a lot of people when they hear that sort of thing it's confounding because most people. When you're in the realm of like you don't have what you want yet in terms of how much money. I mean, the brain is like I just I need to make is much money is humanly possible right like that's the way that the brain typically thinks. But then you get to a point where you start to have a good amount of money and then you really start to ask yourself some questions in terms of like. How much do I actually need right and there's an exercise that I encourage people to do a call at the. The money mindset exercise it's one that I built for myself but the whole point of that exercise is to like literally force myself to think through that exact kind of scenario. I think that's what I want to be honest with myself so it's not judge what I want what I don't want it's to not judge if I want to fly first class every time I fly like some people might look",
    "start_timestamp_seconds": 4248.0,
    "end_timestamp_seconds": 4329.0,
    "start_timestamp": "01:10:48",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=4248",
    "chunk_index": 56,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "to think through that exact kind of scenario. I think that's what I want to be honest with myself so it's not judge what I want what I don't want it's to not judge if I want to fly first class every time I fly like some people might look at that and be like, wow that's like really wasteful I wouldn't want to do that with my money and you know it's completely cool. You value what you value but it's to allow yourself to like really. honest with yourself and when I did that exercise I realized that like there's a couple different dollar amounts that have always resonated with me the first one was trying to get to a million bucks. I felt like that's like the first threshold then after that was 10 million bucks once you're at 10 million bucks you're at a point where. not only can you kind of do whatever you want monetarily but it's in a pretty padded cycle you're still not what I would consider like truly fat fire which is like excess access but you're definitely chubby fire at that point you could live a great life and do just about anything you could possibly want. I'm clearly cool so then after the 10 million mark then it's like well. Where do you go what matters after that like what's the material difference between like 10 million and 20 million or 25 million and there is a material difference",
    "start_timestamp_seconds": 4317.0,
    "end_timestamp_seconds": 4407.0,
    "start_timestamp": "01:11:57",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=4317",
    "chunk_index": 57,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "just about anything you could possibly want. I'm clearly cool so then after the 10 million mark then it's like well. Where do you go what matters after that like what's the material difference between like 10 million and 20 million or 25 million and there is a material difference at those levels for sure. And then once you start thinking the difference though between like 25 million and 50 million that's where for me it starts to get kind of fuzzy in terms of like. Once you're at 20 25 million dollars. What realistically would I spend additional on if I had 50 and that's where I don't really see a big difference so all that summarizes to. I mean like I'm still 34 right like I'm not looking to not work I don't want to just not do anything. I'm exceedingly interested in in working and adding value I think it is super super important I don't see myself ever not doing that that's the other ironic thing. Is I had the closest thing to like a midlife crisis actually during COVID which is what like five years ago and I went through a period where I was genuinely depressed I never felt that before I didn't even know what it was. I went through this really weird period because I realized from a financial lens I was at an exceeded the spots that I originally was planning and then I was like. What the fuck do I",
    "start_timestamp_seconds": 4380.0,
    "end_timestamp_seconds": 4490.0,
    "start_timestamp": "01:13:00",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=4380",
    "chunk_index": 58,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "genuinely depressed I never felt that before I didn't even know what it was. I went through this really weird period because I realized from a financial lens I was at an exceeded the spots that I originally was planning and then I was like. What the fuck do I do like what is the subsequent point beyond that because right now melan I we still don't have kids we go back and forth on that. I think that's a lot of people would be really easy just pivot and you know focus on raising kids which is a completely noble cause we're just not quite there yet not sure what route we want to go so what that is the context it was like. The fuck do we do and that exercise is what led to a lot of this or that time frame is what led to a lot of this subsequent exercise analysis but. I realized for me that I really really value I've always valued helping people always it has been throughout my entire life. I I like if somebody stopped on the side of the road I will always stop and try it's just like that and it's just because the environment I grew up in was like that and I value that a lot all of that is designed to. At least give people some context in terms of how you evaluate what's valuable to you because for me it's not the escapism of",
    "start_timestamp_seconds": 4465.0,
    "end_timestamp_seconds": 4546.0,
    "start_timestamp": "01:14:25",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=4465",
    "chunk_index": 59,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "that and it's just because the environment I grew up in was like that and I value that a lot all of that is designed to. At least give people some context in terms of how you evaluate what's valuable to you because for me it's not the escapism of make a bunch of money and then never work I actually work way more now. Then I had before like even when I was in the Marine Corps even when I was working at the Lloyd is a consultant I work way more now and because there's a ton of shit that's like super interesting to me. Taking that all the way back to like return targets in goals. I have found that as long as I'm hitting that baseline return it keeps me exactly where I want to be in terms of trajectory and then when I have years like the last few years I haven't returned under 70% in the last three years. I mean that's just like compounding exponentially at that point it's insanely fast and then that's when you start looking at. More money and then you're like what do I do with this and the funniest thing that I've come across with having more capital is that whenever I see people online it's one of my favorite things. There will be a thing where like a celebrity doughnates money or something like that and then like all the the internet comes out and they're like",
    "start_timestamp_seconds": 4534.0,
    "end_timestamp_seconds": 4619.0,
    "start_timestamp": "01:15:34",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=4534",
    "chunk_index": 60,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "funniest thing that I've come across with having more capital is that whenever I see people online it's one of my favorite things. There will be a thing where like a celebrity doughnates money or something like that and then like all the the internet comes out and they're like oh they only download or they only donated $250,000 like they have so much more money than that's like. Nobody is more giving with money than internet people with other people's money. It's like okay internet person if $250,000 is enough then you make more and then you donate more but I always get such a kick out of that the internet people are so good with other people's money and how much other people should donate. But I always found trying to have a couple buckets because I still watch over my mom and then I'm also working on something for my brother and it's because you know he was in a Marine Corps he got fucked up and then he you know is a sheriff which is still quite physical. So I know that he's not going to be able to do that into perpetuity it's tough on his body so then I also need to have a plan for him also the guy that introduced me to investing I want to make sure that. He is good which he's good on his own and then some but just in case if it ever became not so. I",
    "start_timestamp_seconds": 4607.0,
    "end_timestamp_seconds": 4699.0,
    "start_timestamp": "01:16:47",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=4607",
    "chunk_index": 61,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "his body so then I also need to have a plan for him also the guy that introduced me to investing I want to make sure that. He is good which he's good on his own and then some but just in case if it ever became not so. I would want to be in a position to do that which is when I was thinking about my targets that's why the target just kept going up because it's like. There's a certain amount of money that I would want I think is an individual like a good general target it's like 5 million. And then I think once you're at around that number you're like really free it's not like lean fire I have to clip coupons to be free it's like you're free. And then once again you're at like the 10 million mark is an individual then it's like not only are you free but you can like do stuff and it's kind of whatever you want at that point. Think of it this way at. 10 million you are in 10 percent million dollars even if you keep half of it after taxes. It's a decent amount of money right like you're you're still half a million dollars cash flow by itself which is more than enough to do just about anything you can want. Yeah, now thanks for sharing that and being comfortable sharing with us. I don't have anything else but thank you again",
    "start_timestamp_seconds": 4679.0,
    "end_timestamp_seconds": 4763.0,
    "start_timestamp": "01:17:59",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=4679",
    "chunk_index": 62,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "amount of money right like you're you're still half a million dollars cash flow by itself which is more than enough to do just about anything you can want. Yeah, now thanks for sharing that and being comfortable sharing with us. I don't have anything else but thank you again for having me on appreciate you and I'd speak for the community in this instance we do really appreciate you taking the time and breaking it down for as the subject matter we are dealing with the so complex and we appreciate your time. And the skills you have to make it simple for us. Yeah man I and I appreciate here in that it actually puts a lot of wind in my sales when I see like individual people picking up some of the concepts like when you see the light bulbs turning on because I always remind people that like. I've been a lot of my time especially getting to the proficiency where I ultimately ended up being at doing that completely on my own. But in the beginning I had a handful of people that got me started and if it weren't for those two people my life trajectory would be completely different and that is always. Imprinted on me like the impact you can have on somebody's real life in a really positive way and that's why with the channel and stuff like that I'm very comfortable with. You know the way the channel grows the",
    "start_timestamp_seconds": 4748.0,
    "end_timestamp_seconds": 4830.0,
    "start_timestamp": "01:19:08",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=4748",
    "chunk_index": 63,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "life trajectory would be completely different and that is always. Imprinted on me like the impact you can have on somebody's real life in a really positive way and that's why with the channel and stuff like that I'm very comfortable with. You know the way the channel grows the way that I produce things because I really focus on authenticity that naturally restricts some of my reach and it's because I don't get you know pass around quite as much because it's not the how to make it super ton of money and. ton of money and no time with no effort but. I found that even in that context and even with that audience restriction there's still like a very real impact you can make which is something that I would just offer to other people that are listening. Even with a financial sense even if you don't find yourself like that savvy with options and you're a beginner in that sense. The reality is if you're in the world of even loosely learning about options you probably have some good sound. Financial basics like saving investing even into an index ETF which is something that you can share with other people and for a lot of other people. They don't even know that that's the funniest thing is the stuff that we take for granted in this kind of financial space and the conversations that we have. They're literally our millions of people that don't even know",
    "start_timestamp_seconds": 4805.0,
    "end_timestamp_seconds": 4896.0,
    "start_timestamp": "01:20:05",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=4805",
    "chunk_index": 64,
    "word_count": 250,
    "upload_date": null,
    "duration": 4960.0
  },
  {
    "video_id": "jcfgHCLBLzI",
    "title": "Inside Profit Mechanisms and AARs | The Outlier Trading Podcast Unplugged",
    "text": "share with other people and for a lot of other people. They don't even know that that's the funniest thing is the stuff that we take for granted in this kind of financial space and the conversations that we have. They're literally our millions of people that don't even know that so the cool part is is if you're here having these conversations with us you're in a position to help a lot of people even at that level. Yeah, yeah financial literacy is really bad. It's criminal that it doesn't get told more and thought in the school across countries even from where I come from it's not it's not existing really. Yeah, it's a fascinating paradigm but the cool part is is either's information online now you can you know making impact around but is always sure I really really thankful for you putting this together and serving is a conduit for the community and it always gives me. Good feedback in terms of the way I think about things and then how to connect them better so I appreciate you doing what you do as well and for everybody else you will catch us on the next episode in January. We will see you guys later.",
    "start_timestamp_seconds": 4876.0,
    "end_timestamp_seconds": 4957.0,
    "start_timestamp": "01:21:16",
    "video_url": "https://www.youtube.com/watch?v=jcfgHCLBLzI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcfgHCLBLzI&t=4876",
    "chunk_index": 65,
    "word_count": 209,
    "upload_date": null,
    "duration": 4960.0
  }
]