[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you So I'm going to do the logical thing. I'm going to ask chat GPT. What time is considered afternoon and then evening? Let's see. Then we got Jonathan from North Carolina. I have a buddy out there. I actually think he just recently moved. But it was he in Ashburn. I think it was called from Not Mistaken. That's in North Carolina in it. Vladimir says sunset. I think sunset's legit. OK. So chat GPT says afternoon typically begins at 12. Yeah, that's easy. In lasts until around 5 or 6 p.m. The exact transition can vary slightly based on regional customs or personal preferences. But afternoon generally refers to the period when the sun is still high in the sky after lunchtime. Yeah. OK. Evening starts around 5 or 6 and lasts until 9 or just after sunset. Evening marks the transition period from day to night when activities are winding down. Sun begins to set. Well, little did I know, little did you know that if you work in the military when it's dark out, that's actually when activities typically just start. So by that definition evening never happens. Because that talks about activities winding down. That's just when the fun begins because most of the people that we currently will use to decide to fight don't have fucking night vision. So it makes those kinds of interactions",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 99,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=0"
    }
  },
  {
    "text": "activities typically just start. So by that definition evening never happens. Because that talks about activities winding down. That's just when the fun begins because most of the people that we currently will use to decide to fight don't have fucking night vision. So it makes those kinds of interactions pretty one-sided, TBH. But OK. So let us start with the market. That's what I wanted to start with. So this week, again, I'm just going to essentially pick up where we left off from yesterday. So I am not going to talk about all the market relationships and all that kind of stuff. I just really want to talk about the follow-through today just because for anybody that's interested in the current market analysis, it's all bullshit anyways. It's just making guesses at shit. But the thing that I do want to talk about are just the data pieces that came out because those actually genuinely do matter to us. So let's grab our friends over at Benzinga. I'm going to change this setup here just a little bit because I don't really care about the period. I care about the actual. I care about the consensus. And I care about prior. That's what I care about. The rest of that stuff is all just not enough. OK. So we had PPI and PPI came in. Is that right? Did PPI come in flat month over month? Is that correct? I have to double check that. I haven't looked",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 99,
      "start_timestamp": "00:01:39",
      "start_timestamp_seconds": 99.4020202020202,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=99"
    }
  },
  {
    "text": "care about prior. That's what I care about. The rest of that stuff is all just not enough. OK. So we had PPI and PPI came in. Is that right? Did PPI come in flat month over month? Is that correct? I have to double check that. I haven't looked yet. But PPI flat, that's interesting. If that is the case, let's see. Let's fact check this, shall we? So this is telling me, what's today? It's already fell off there. See, that's the one problem with financial juice. Is that I like financial juice a lot. This is another economic website that I use. I'm not affiliated with them. I used to be, but I'm not anymore. It's just like literally lapsed. It's not because of any bad blood or didn't like their 20 more. But one of the issues I have with it is that it goes away too fast. It's 1,700 Pacific time. I would love to be able to go back even to see the whole week, to be honest with you. Not even just the today. So that's one of the problems with that in my opinion. But let's see. PPI month over month. And let's see what it is. Yeah, okay. So 0 okay. So it's accurate. I just again, you guys have seen on these streams multiple times now where I look at something. And then I find out it's inaccurate to some degree. So I double check just about everything, even if",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 99,
      "start_timestamp": "00:03:18",
      "start_timestamp_seconds": 198.8040404040404,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=198"
    }
  },
  {
    "text": "let's see what it is. Yeah, okay. So 0 okay. So it's accurate. I just again, you guys have seen on these streams multiple times now where I look at something. And then I find out it's inaccurate to some degree. So I double check just about everything, even if it, especially if it's something that I don't fully trust in its entirety. And I have any inkling that it might be slightly off. Then I'm going to double check it. So so yeah, PPI came in 0, which was expected at 0.1 growth. I don't we have to look at that a little bit. So I'm actually not positive what I think about that. Let's check out Y charts. Yeah, so that's about like flat flat. I can't go back 10 years. Am you. I don't know. Vladimir says it's 2024 facts don't matter anymore. Just make shit up. I forgot. No wonder why that trading is going so well for me lately because it's just a matter of making it up and then off Putin actually to double off of that. One of the things I've learned that I really, really hate massively is the idea of manifesting. I have no problem with visualization and I'm sure that that is very close to manifesting. When I talk about manifesting, I talk about the near term version of that or I guess like the more colloquial version. Where it's like we just kind of like think and think about",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 99,
      "start_timestamp": "00:04:58",
      "start_timestamp_seconds": 298.2060606060606,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=298"
    }
  },
  {
    "text": "I have no problem with visualization and I'm sure that that is very close to manifesting. When I talk about manifesting, I talk about the near term version of that or I guess like the more colloquial version. Where it's like we just kind of like think and think about something that might happen and we think that the process of thinking about it is enough. And obviously it's not so. Yeah, so there's it's we can just manifest what we want to happen in the trading accounts and then it just happens. So we therefore just get to make shit up. Yeah, I love that Mr. off Putin. I think that's spot on. But yeah, okay, so this has been pretty pretty flat for a little while now. And let's take a look actually from BLS. So goods. Goods is contracted. And services expanded slightly. Interesting. So PPI for final demand unchanged in September services rise. 0.02 goods. 0.02. Let's see. And next for final demand rose 1.8. So this I'm not going to lie this is a little interesting to me like this came in slightly different than expected. I had I had expected slight contraction but I didn't expect it to be quite like this. So most of September decrease in prices for unprocessed goods for intermediate demand can be traced back to crude petroleum, which fell 16.7. So that's that's interesting because production is still pretty high there prices for ungraded chicken eggs. Have to be",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 99,
      "start_timestamp": "00:06:37",
      "start_timestamp_seconds": 397.6080808080808,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=397"
    }
  },
  {
    "text": "didn't expect it to be quite like this. So most of September decrease in prices for unprocessed goods for intermediate demand can be traced back to crude petroleum, which fell 16.7. So that's that's interesting because production is still pretty high there prices for ungraded chicken eggs. Have to be honest and you have to ask the question why are we tracking ungraded versus graded that I don't totally get slaughter steers, heifers, coal, fresh veggies, except potatoes, recycle paper moved down index for slaughter poultry moved up 5.8. Yes, he like this is this is the interesting thing is they see it is that like there's still lots of different pockets of movement that is different than I expected. Very much so. So. And I have to say recent videos with PB and Lauer bangers I'm glad it's actually funny because there's somebody hold on a second I have to show you in the comments. Is this. Oh, it looks like two people. Not going to lie. Seems sus because both of these comments came in at like the same time. But let me show you this it's kind of funny. So for those that liked the the podcast that I did both with PB and Lauer. Let me show you an alternative view. Which is our friend. And the long tro team. Who is letting me know that I'm a shell which I'm very, very thankful for. And then active rehab mobility which I have to be honest.",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 99,
      "start_timestamp": "00:08:17",
      "start_timestamp_seconds": 497.010101010101,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=497"
    }
  },
  {
    "text": "that I did both with PB and Lauer. Let me show you an alternative view. Which is our friend. And the long tro team. Who is letting me know that I'm a shell which I'm very, very thankful for. And then active rehab mobility which I have to be honest. I'm a little upset at this one because right now I am literally trying to actively rehab my mobility. And it sucks that the person that it seems like they could help me with that they're also. I'm asking if I'm a shell. Which obviously I would just answer them right because they they should know. It's only fair for me to come clean since they peg me down. I think what I need to do is actually define show. Because I think that this is probably one of the most crazy misuse terms now. Yeah, that's what I thought. The shell is someone who promotes or endorses a product service or cause in a deceptive or dishonest manner. Interesting. Okay. Well, we just have to let rehab mobility in. And then the long tro team. The other thing that I can't help but find kind of interesting is this. It looks like they. Here's my guess genuinely and this is the funny thing about people. I these comments came in at like the same time. So my guess is this one came in same time is this one. I think this is the same person. And I literally think",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 99,
      "start_timestamp": "00:09:56",
      "start_timestamp_seconds": 596.4121212121212,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=596"
    }
  },
  {
    "text": "It looks like they. Here's my guess genuinely and this is the funny thing about people. I these comments came in at like the same time. So my guess is this one came in same time is this one. I think this is the same person. And I literally think this person wanted to respond to this person. But forgot to switch their fucking account. I have nothing to validate any of that. But I just think it's hilarious. I literally think it's hilarious if that is the case. That's my favorite. So shout out to these guys. You should definitely pop over to the YouTube channel, give them a sub just because I mean this guy's ready. They're starting to build their audience, right? They're they're rolling in deep. So shout out to them. I think that's hilarious. All right, back to this though. Um. That Lauren says heffers. Yeah, man, I know it's like one of those words that it's weird to hear used. But yeah, that's a fucking word now. Wrong to the says graded or probably processed and ready for sale. Unprocessed. Probably have been collected but not checked for suitability for sale yet. So graded is the idea. So grading is just. Applied to whether or not it's processed. Right to the air you guessing or are you telling me because I don't know that sounds legit. But. But if you tell me that I would believe you if you're guessing we can check it",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 99,
      "start_timestamp": "00:11:35",
      "start_timestamp_seconds": 695.8141414141413,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=695"
    }
  },
  {
    "text": "is the idea. So grading is just. Applied to whether or not it's processed. Right to the air you guessing or are you telling me because I don't know that sounds legit. But. But if you tell me that I would believe you if you're guessing we can check it because I don't know the difference. What's the difference between graded and ungraded chicken eggs? This is admittedly one of genuinely one of my favorite parts about markets is right now I'm in the process of. Learning about chicken egg grading. One of the coolest things that you'll find as a trader or investor in the markets is that it is one of the most interesting lenses to learn about the world. And you will learn about so fucking much it'll make your head spin. Okay. So graded eggs are they go through a quality inspection process where they assessed for external and internal factors. Shells quality, yolk and album in condition. So there's grade double a grade a grade B. And ungraded eggs have no official inspection they're not inspected or rated according to quality. This happens with farm fresh or backyard eggs sold at local markets or directly from farms. So I think the main thing is you actually like farm fresh eggs then would still be sold. But they're just they don't go through an inspection process. So rowing titty to your to your point. That would lead me to believe that if you're getting your farm",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 99,
      "start_timestamp": "00:13:15",
      "start_timestamp_seconds": 795.2161616161616,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=795"
    }
  },
  {
    "text": "from farms. So I think the main thing is you actually like farm fresh eggs then would still be sold. But they're just they don't go through an inspection process. So rowing titty to your to your point. That would lead me to believe that if you're getting your farm fresh eggs there's a chance you might get a little more protein in it. There's a little baby chicken in there might have a crunch. You know what I mean. That's what it looks like interesting and there's those three grades. Double a a and B. I don't know why it has like why who invented that. Like I don't actually get it because why couldn't it just be ABC like that's a pretty standard fucking thing. Interesting. All Putin says why do they refrigerate eggs in the US but almost nowhere else in the world that's due to the washing process. So there's a this is actually funny that I know this. There's a outer part of the egg called a cuticle like the cuticle of your nail. And that washing process strips the cuticle away. So when that cuticle is stripped away then the egg is more prone to decaying salmonella bacterial and stuff like that. So all Putin that's why we refrigerate eggs in the US is because ours are inspected washed a certain way. And once you go through that washing them it strips away the cuticle. That's I don't I don't know like I'm kind",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 99,
      "start_timestamp": "00:14:54",
      "start_timestamp_seconds": 894.6181818181818,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=894"
    }
  },
  {
    "text": "to decaying salmonella bacterial and stuff like that. So all Putin that's why we refrigerate eggs in the US is because ours are inspected washed a certain way. And once you go through that washing them it strips away the cuticle. That's I don't I don't know like I'm kind of thinking about what the fuck I'm talking about and thinking how useless of a data point that is like think of think of a good piece of information that I could have just remembered right then instead of understanding the fucking cuticle of an egg. Not my proudest moment but yeah, okay. Don't feel a little weird about it. Oh see, Paul has it. I didn't notice. Yeah, okay, good. I didn't read the comments. So, Paul, you're also a fucking nerd. I love that. Off-Poon says my guess is that a little poop is gross to Americans. I have to be honest. I hope it is to you as well. That's standard sanitation, like especially on something that I intend to consume. I would prefer it to be fecal free as it were. I don't know maybe if we need to like start a movement for Putin, wherever you're from. But something like fecal free would be okay, something like that. But yeah, you that's I think that should be a universal thing that we that we are generally concerned with at least to a degree in my humble opinion. All right. So the last thing I want",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 99,
      "start_timestamp": "00:16:34",
      "start_timestamp_seconds": 994.020202020202,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=994"
    }
  },
  {
    "text": "you're from. But something like fecal free would be okay, something like that. But yeah, you that's I think that should be a universal thing that we that we are generally concerned with at least to a degree in my humble opinion. All right. So the last thing I want to talk about from a market perspective is let's take a look at the the grid here. One of the things that I started noticing is that this is using ADR this here. So if we take a look at IWM, let me blow it up a little bit here. Big, big, big, big, big breakout. You have seen this on my chart for some time now. So this is something from I actually don't remember when I drew this. But if we go back far enough, we can see when I first started drawing this channel, but a massive breakout from this channel. Now the reason why this is interesting to me is because this is one of the most quintessential breakout patterns that you can absolutely trade. I traded just the move today. I used futures. It was an intraday trade. I still have about two thirds of the position on. But this is something that I talked about not too long ago yesterday. I talked about another trade that exhibit similar similar tendencies to this kind of style of setup. But this is a standard breakout play. So the profit mechanism as I look at something like",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 99,
      "start_timestamp": "00:18:13",
      "start_timestamp_seconds": 1093.422222222222,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=1093"
    }
  },
  {
    "text": "the position on. But this is something that I talked about not too long ago yesterday. I talked about another trade that exhibit similar similar tendencies to this kind of style of setup. But this is a standard breakout play. So the profit mechanism as I look at something like this is velocity. It's something that starts to get really really constrained in price. And then sooner or later it makes a big decision. And that's exactly what happened today at a 2 day on the day for the index. And as soon as I started seeing this move, this very one-sided candle, this led to a series of other trades. And I'll show you. Because if you go into the heat map, you go within the Russell, take a look at where you see super bright green. You can see this happen right on the day. The other thing that we should take a look at for something like this is where you see red. The reason why it matters to look for red on days like today is because it's giving you views on stocks that are clearly bucking the broader trend. So by looking at a heat map like this, we get to do two things. The first thing we get to do is find leaders that are driving price performance. The second thing you get to do is find weak stocks that are slowing or moving against the broader trend despite the amount of support that",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 99,
      "start_timestamp": "00:19:52",
      "start_timestamp_seconds": 1192.8242424242424,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=1192"
    }
  },
  {
    "text": "map like this, we get to do two things. The first thing we get to do is find leaders that are driving price performance. The second thing you get to do is find weak stocks that are slowing or moving against the broader trend despite the amount of support that there is for the movement. Because the other thing I want you to notice is take a look at the individual sectors. Do you notice anything interesting about the sectors in general? I want you to specifically focus on what the relationship looks like in terms of the number of red that you see within the different sectors. And then I'm updating the time stamps for whoever else ends up watching this in the future so that they can skip past all the random bullshitting in the beginning. There we go. Of course says crypto huge exactly. Rointit is says one sector has no red exactly that's exactly correct. Joey says small amounts of red in each sector that's also correct. So one thing to know is that financials that's this whole sector. So there's definitely red in financials just to be clear. These are just different kinds of reets and stuff like that. But the main points is if we look at the performance of the sectors this is literally the process of being a trader is coming up with these broader themes that stick out to us from a macro broader perspective, not macro economic macro market perspective",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 99,
      "start_timestamp": "00:21:32",
      "start_timestamp_seconds": 1292.2262626262627,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=1292"
    }
  },
  {
    "text": "and stuff like that. But the main points is if we look at the performance of the sectors this is literally the process of being a trader is coming up with these broader themes that stick out to us from a macro broader perspective, not macro economic macro market perspective and use it to define ideas. So one of the things you hide up you highlighted is financials financials look super strong today. Where's the weakness in financials in real estate? ABR, REIT, PMT, REIT to very much real estate heavy MFA, REIT, RC, REIT. You get the point. REITs are not doing great. So when we look at financials in general, they're doing quite well. If we take a look at something like information technology, you can see that there's a little bit more of a mixed bag here. We can see that there's some strong performers, but there's also kind of a mix of not super strong performers and then some slightly negative performers. Learning to look with a purpose is so important for your evolution as a trader. When we look at stuff like this, we should not open up a heat map and think, oh, I want to see if I can find blank, blank being whatever your preconceived notion might be. What our objective is when we do this is to find tradable information. Some of that tradable information is going to be indirect, meaning I might look at financials and decide, okay, I'm going",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 99,
      "start_timestamp": "00:23:11",
      "start_timestamp_seconds": 1391.6282828282826,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=1391"
    }
  },
  {
    "text": "want to see if I can find blank, blank being whatever your preconceived notion might be. What our objective is when we do this is to find tradable information. Some of that tradable information is going to be indirect, meaning I might look at financials and decide, okay, I'm going to trade financials. That's direct or I might look at financials and just mentally note financials are strong. Maybe I'll scan and set up some alerts for financials, but maybe not place a trade right now that's indirect. Both of those are completely useful data points for you to house in your brain and specifically your subconscious. So the other thing again, when you're looking at heat maps, we want to look at breath, meaning across the board, what does the tenor look like? And again, when we look at small caps, most of it's up. How many of them are very bright green, meaning larger up moves, a good bit of them. If I were to eyeball this, I would guess maybe 15 something like that 20 if that. How many of them are green compared to red? It looks like a decent majority, probably 70 75. So by just eyeballing this, I'm not taking the time to download all the information, to run it through Python and see the individual details, although we can, and there's different ways to look at that, I'm just eyeballing. The other thing that I'll do, as I already mentioned, is I will",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 99,
      "start_timestamp": "00:24:51",
      "start_timestamp_seconds": 1491.030303030303,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=1491"
    }
  },
  {
    "text": "just eyeballing this, I'm not taking the time to download all the information, to run it through Python and see the individual details, although we can, and there's different ways to look at that, I'm just eyeballing. The other thing that I'll do, as I already mentioned, is I will look at what is showing really great moves. And I want to see why is it something that's pertaining to the entire sector, or is it something pertaining to the individual stock? So for example, IT, MSTR, obviously it's 16 today. This is very not representative of most of this sector. Most of this sector is up, but it's not up huge like this. So then we have to begs the question, what's going on with MSTR? And we already know MSTR is full of idioms and critic risk. So it's kind of like looking at a specific piece of the overall tech sector from the small cap side of things. This in my opinion is not indicative of all small caps, and it's showing me that the IT sector right now is being moved within small caps by something like this. That's the idea. So this is the way that we can use heat maps to come up with ideas. Alright, let me catch up on the chat. James says, M2K futures or something else. I didn't use the minis because I wasn't building a position over time, so I used RTY. We're referring to the to the Russell",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 99,
      "start_timestamp": "00:26:30",
      "start_timestamp_seconds": 1590.4323232323231,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=1590"
    }
  },
  {
    "text": "that we can use heat maps to come up with ideas. Alright, let me catch up on the chat. James says, M2K futures or something else. I didn't use the minis because I wasn't building a position over time, so I used RTY. We're referring to the to the Russell scalp today, and it's not a scalp to be clear, intraday trade. I use scalp in the common parlance just because people will more accurately identify what I mean by that. So yeah, I just use Russell futures. We got Joey good to see you Joey. Paul says, what are those reds and industrials? Yeah, let's see, look. And that's a great thing to look for. NVEE, E-B-F, and rock. Oh, rock. That's a fun one. So let's take a look at these. So we want to look at NVEE. They had a split. We have rock. Gap down. E-B-F. Massive gap down. Looks like dividend. CMRE. Slowly rotating down. G and K. Same. SB. So the thing for me when I look at this structure within industrials is it's not exactly where I necessarily want to fade. So like this starts to look a little more interesting to me. When I'm looking for sectors that I want to fade within, I'm going to look for stuff that looks sad. Consumer discretionary looks kind of sad. Energy still looks a little bit sad. Com services looks a little bit sad. Let's take a look in consumer discretionary. There's not a",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 99,
      "start_timestamp": "00:28:09",
      "start_timestamp_seconds": 1689.8343434343433,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=1689"
    }
  },
  {
    "text": "When I'm looking for sectors that I want to fade within, I'm going to look for stuff that looks sad. Consumer discretionary looks kind of sad. Energy still looks a little bit sad. Com services looks a little bit sad. Let's take a look in consumer discretionary. There's not a bunch of stuff that's making like crazy big down moves, but there's also not a bunch of stuff making really big up moves. So we can look for stuff that's making bigger moves like W. W. Who here says W as W? I mean, I don't even know what to do with that other than nothing. Shack. No, Shack. D-N-U. If you got that reference that I just did, let me know. F-L. Ooh, see like this. I like this. I like. I love this. Create an alert at or below. If you fall below that, fade into oblivion. That's the rule. Sorry gang, the old up, the old sciatica. Still, still proven some problems here. We're working through it, but it's slow as shit. I have to be honest with you. It is a much slower healing process than I would like to like to admit, but that's how she goes. That Lawrence is why do you like it? Well, let's talk about it. What's everybody's opinion of it? Give me in the chat. Doesn't have to be like a massive word picture, but give me a couple things that you see about the stock. And what your disposition",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 99,
      "start_timestamp": "00:29:49",
      "start_timestamp_seconds": 1789.2363636363636,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=1789"
    }
  },
  {
    "text": "she goes. That Lawrence is why do you like it? Well, let's talk about it. What's everybody's opinion of it? Give me in the chat. Doesn't have to be like a massive word picture, but give me a couple things that you see about the stock. And what your disposition is towards the stock. And then I'll explain to you why I like it. This is the exact kind of thing you can already see that I set an alert. This is how I trade in general is I use alerts all the time. How I find stuff that looks interesting before it's actually doing the interesting thing so that then I can try to get into it when it's doing the interesting thing. Because otherwise that's one of the big issues that I see with people is that there's a pretty significant gap in entry timing. And I think that it's kind of a actually a pretty profound problem if I think of it from a slightly larger perspective. So that's the idea behind this is to find things that are moving in a way that I can trade them. But before they make a move so I can set alerts so that then I can catch them for those that were on the live stream yesterday posted about this in the discord following up with you all. Gold Gold last night while we were on that live stream kicked off an alert and I literally stopped in the",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 99,
      "start_timestamp": "00:31:28",
      "start_timestamp_seconds": 1888.6383838383836,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=1888"
    }
  },
  {
    "text": "set alerts so that then I can catch them for those that were on the live stream yesterday posted about this in the discord following up with you all. Gold Gold last night while we were on that live stream kicked off an alert and I literally stopped in the middle of the live stream to put on my position in gold. And it's because I have an alert that sitting that then I can identify a move. All right. Paul says bearish is access down trend higher highs and lows. Yep. So it's definitely breaking down. But Cedric says I would look for a bounce, but I know that is stupid. Yeah, that is stupid. That's not to say it's stupid in the fact that like it couldn't get a bounce. It can get a bounce. But it's stupid in the fact that that's applying a really, really, really broken down expectation of price performance. And that comes from the bargain buying side of a standard traders brain. A normal trader will think of things as being at extremes and then play contrarian because we think it's gone too far, stuff like that, which yeah, typically isn't super favorable. He says, hey, we still have eyesight love that podcast and stoicism. Oh, that's awesome. I'm glad that that was good. I Kyle and I we go back a while actually. He's one of my, my, my better friends in the finance space. You guys should definitely make sure you",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 99,
      "start_timestamp": "00:33:08",
      "start_timestamp_seconds": 1988.040404040404,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=1988"
    }
  },
  {
    "text": "He says, hey, we still have eyesight love that podcast and stoicism. Oh, that's awesome. I'm glad that that was good. I Kyle and I we go back a while actually. He's one of my, my, my better friends in the finance space. You guys should definitely make sure you check his stuff out when you can because Kyle is a relatively new trader himself. He's a prior Navy guy and he's just so unbelievably authentic and genuine in the space that it's, it's just, it's why I draw to him like a magnet. He and I used to do a regular series on his podcast and then we did a series together on my pot or it wasn't really a podcast was just on my YouTube channel. We did a bunch of things on my YouTube channel. We did like a teaching options trade together. Then we used to do service reviews for different trading services and we would dig into those. But yeah, Kyle, he's just a super genuine dude. He's still figuring out his approach to trading and he's, he's just unbelievably honest in a space that I think most people really, really struggle with being honest because a lot of people aren't used to the idea of being like quote unquote, a knowledgeable authority figure in something but still acknowledging the fact that we don't know everything. And it's okay to not know shit. I actually think it's important for people. I go out of my",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 99,
      "start_timestamp": "00:34:47",
      "start_timestamp_seconds": 2087.4424242424243,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=2087"
    }
  },
  {
    "text": "because a lot of people aren't used to the idea of being like quote unquote, a knowledgeable authority figure in something but still acknowledging the fact that we don't know everything. And it's okay to not know shit. I actually think it's important for people. I go out of my way to show people when I don't know stuff all the time. It's it's, it's very purposeful because there's this really bad notion that if you develop eminence and something, it means that you're infallible and know everything about it. And I tell you, I tell you this all the time for context, right? I started trading in 2007. I've been in markets. I'm coming up on me 17th year. I typically track my hours per year. I haven't finished up this year. But I'll probably be about like 33 to 34,000 hours analyzing trading markets. A lot of time. And I still don't know a ton of shit. And I want you to see that. I want you to see that it's okay to not know. It's okay to have experience and something and still not know details because again, as soon as we can break that part away from our ego, the better off you are. Because that's the only reason why I would go out of my way to pretend like I know everything or that I always have everything under wraps. Because the entire concept about that is it's just so that people's perception of me",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 99,
      "start_timestamp": "00:36:26",
      "start_timestamp_seconds": 2186.844444444444,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=2186"
    }
  },
  {
    "text": "from our ego, the better off you are. Because that's the only reason why I would go out of my way to pretend like I know everything or that I always have everything under wraps. Because the entire concept about that is it's just so that people's perception of me isn't changed in some way, which is most of you probably know at this point, like I generally don't give a fuck. I am who I am. I am what I am. So I and I think it's important for people to see that because the aspiration of knowing everything I think is completely flawed. And when we look at mastery of markets, it comes from continually not knowing shit and learning about it. So Kyle is a fantastic representation of that because he spent a lot of time really trying to learn this trading skill set, like pretty massively. And he's still so approachable and he acknowledges his own fallibility all the time. And it's rare to find really like authentic people like that. He does this stuff the same reason why I do this stuff is that he genuinely just fucking loves markets and he loves the process of trading. And there's not a lot of people like that out there like if you look at the trading space. It's generally especially like the bigger brands, it's what you would expect it's people that are trying to make money explicitly off of their audience. And I don't want",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 99,
      "start_timestamp": "00:38:06",
      "start_timestamp_seconds": 2286.2464646464646,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=2286"
    }
  },
  {
    "text": "of trading. And there's not a lot of people like that out there like if you look at the trading space. It's generally especially like the bigger brands, it's what you would expect it's people that are trying to make money explicitly off of their audience. And I don't want to say there's anything wrong with that there's nothing wrong with that. It's okay if you're sharing your expertise learned over time if you are providing that and there's an exchange that's how we do everything. If I pay for somebody to come out and to do my roof, I expect to not just pay them for the materials. I expect to pay them for their time for their expertise, be able to do it faster than I could do it. So like there's no problem with people that are like that, you know, that are trying to sell their stuff, whatever that is. If it's a book that they have, whatever, that's okay. But there's a lot of predatory practices that prey on people's ignorance. That's where it sucks. Super, super bad. And that's why I did that trading review thing for a little bit because when I did the trading service reviews stuff, it wasn't to shame any individual service at all. The whole idea actually was to just try and teach people how to evaluate a service for themselves. It's the same thing that I try to help with the trading side of things. I'm not sitting",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 99,
      "start_timestamp": "00:39:45",
      "start_timestamp_seconds": 2385.6484848484847,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=2385"
    }
  },
  {
    "text": "the trading service reviews stuff, it wasn't to shame any individual service at all. The whole idea actually was to just try and teach people how to evaluate a service for themselves. It's the same thing that I try to help with the trading side of things. I'm not sitting here trying to show anybody what to trade, when to trade, nothing like that. The last possible thing I do, nothing I give is financial personalized financial advice. I absolutely give financial advice with the context of telling people that saving is good. Like you should save your money, shit like that. And that's still general advice. And that's I think important to share with each other. But like personalized, I do none of that because the whole idea is to try to teach people how to do this shit for themselves, which that's a tough gig. A lot of people struggle to do something like trading by themselves. And it takes time, but unfortunately newer traders don't know what they don't know. And they get sucked into one of these spheres that then just puts them through a series of giving money away. And I genuinely fucking hate that. It drives me crazy. Super frustrating to see. That Lauren says, I know a lot of stuff about hair. I've been doing that for 26 years. This stuff hurts my brain, but I'm learning. Okay, Lauren, if you know shit, if you know stuff about hair, why does my hair",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 99,
      "start_timestamp": "00:41:25",
      "start_timestamp_seconds": 2485.050505050505,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=2485"
    }
  },
  {
    "text": "It drives me crazy. Super frustrating to see. That Lauren says, I know a lot of stuff about hair. I've been doing that for 26 years. This stuff hurts my brain, but I'm learning. Okay, Lauren, if you know shit, if you know stuff about hair, why does my hair grow at an alarmingly annoying pace? Because I hate getting a fucking haircut every week to two weeks. It's super annoying. My hair's too long right now. I don't like that. So would riddle me that Batman because I would love for that to chill the fuck out. Vladimir's there was a question from Zach. Okay, Zach says stupid question. How are you able to put on a position in gold after hours? I only trade gold ETFs. Yeah, they still trade. So different futures markets will have different trading hours. You can check with your broker. So like, for example, let me look at Schwab futures trading hours. During the week, they close down for just a brief bit after the after the market closes and then they open right back up. So here you go. Equity futures goes Sunday to Friday from 1800 to 1700. So there's a one hour break between 1700 and 1800 Eastern time. For commodities like crude oil gold, they go Sunday to Friday. Over night trading starts at 1800 on Sunday and continues until 1700 on Friday with a one hour break from 1700 to 1800 each day. And then treasury bonds. This",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 99,
      "start_timestamp": "00:43:04",
      "start_timestamp_seconds": 2584.4525252525254,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=2584"
    }
  },
  {
    "text": "one hour break between 1700 and 1800 Eastern time. For commodities like crude oil gold, they go Sunday to Friday. Over night trading starts at 1800 on Sunday and continues until 1700 on Friday with a one hour break from 1700 to 1800 each day. And then treasury bonds. This is for Schwab. Same schedule essentially. So that's one of the benefits of trading futures. And that's actually another thing that I think a lot of traders don't don't fully pay attention to. And the reason for that is because if let's say you have a portfolio on and it's one of the reasons why I'm more comfortable using leverage is because I can always track my beta weighted portfolios and make adjustments. So let's take a look at at, you know, an Eric special. Well, you already know the next question. It's probably the biggest question that we're going to cross together here. You guys already know. Oh shit, Rowan Titty. Yeah, great call. So I like this for a breakdown trade. So when I look at the overall trend here on a six month chart, well, go out to a year first on a year we had a high below lower high, right? Like this really choppy choppy movement. If I zoom in to a shorter term timeframe, we can see that it peaked up here, gap down on earnings that wasn't well received. It came in at negative five cents. It was estimated at negative seven seven",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 99,
      "start_timestamp": "00:44:43",
      "start_timestamp_seconds": 2683.854545454545,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=2683"
    }
  },
  {
    "text": "high below lower high, right? Like this really choppy choppy movement. If I zoom in to a shorter term timeframe, we can see that it peaked up here, gap down on earnings that wasn't well received. It came in at negative five cents. It was estimated at negative seven seven zero point seven or I'm sorry point zero seven seven rally down, hit a low, rallyed up lower high, rally down, lower low. So now I like this just for a breakdown continuation. That's all. And we can see that volatility in here is massive, right? So if we look at a five day average ATR's 3.56. 20 days 4.74 and then 90 days 5.46. So pretty, pretty significant overall volatility in here something like this. Paul says, would you take fundamentals into account in this FL trade? No, not at all fundamentals for me for the timeframe fundamentals for me matter. If I'm trading something that's going to be like a year plus, which is about nothing. So for me, fundamentals are generally just for context. It's again, just because I'm genuinely interested. So when I look at the earnings and I go through the earnings report, it's not to build up some sort of big bear thesis thinking I'm going to find something in the earnings report that other people didn't see and they're not pricing in because it doesn't matter. Right. When I look at the way markets move in different time frames, if you have a",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 99,
      "start_timestamp": "00:46:23",
      "start_timestamp_seconds": 2783.2565656565653,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=2783"
    }
  },
  {
    "text": "to build up some sort of big bear thesis thinking I'm going to find something in the earnings report that other people didn't see and they're not pricing in because it doesn't matter. Right. When I look at the way markets move in different time frames, if you have a company that's showing solid fundamental performance and it's continuing to grow meaning fundamentals or growing. That means that the company is growing. That's about all you need. And that means for longer term holdings that the company is more likely to appreciate and value than depreciate all context dependent from a trading perspective where my average holding time for stuff is like maybe six weeks and that's on the long side. Most of my holdings for like the past two, three years have been less than two weeks. So there's obviously a longer term holdings than that for sure, but I'm talking on average across the majority of the trades. So when I analyze this, the fundamentals are baked into the price. That's what it boils down to the fundamentals as it sits today are baked into the price. And the thing that's more important for this is when we have movement. That's what I'm trading the reason for the movement is not predicated on the fundamentals quite literally. So for example, some of the movement that we can see in foot locker over the last two through two, three weeks literally I don't know what's causing it. Obviously it's",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 99,
      "start_timestamp": "00:48:02",
      "start_timestamp_seconds": 2882.6585858585854,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=2882"
    }
  },
  {
    "text": "have movement. That's what I'm trading the reason for the movement is not predicated on the fundamentals quite literally. So for example, some of the movement that we can see in foot locker over the last two through two, three weeks literally I don't know what's causing it. Obviously it's going down. So it tells me people are selling it. Why they're selling it. It doesn't ultimately matter to me other than I'm just curious about it. And it does provide a little bit of context for the move. But the fundamentals themselves don't really matter in this circumstance. Because it let's just say another scenario where it had really, really great fundamentals, fantastic fundamentals. And it looked like it was growing massively quarter over quarter year over year. It's like it looks super good. If it's going down, it's fucking going down like that's it. If it's going down because a big hedge fund doesn't want their position anymore. That's why it's going down. If it's going down because they got sued because their CEO did some shit that he's not supposed to. I'm not saying that that happened. I don't think it did. But that's why it's going down. So from a trading perspective, we. The fundamentals largely are going to be priced in. That's what typically has us about where we're at. And then the broader market is going to respond to fundamentals differently depending on their position durations. Because think of the average hedge fund or",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 99,
      "start_timestamp": "00:49:42",
      "start_timestamp_seconds": 2982.060606060606,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=2982"
    }
  },
  {
    "text": "down. So from a trading perspective, we. The fundamentals largely are going to be priced in. That's what typically has us about where we're at. And then the broader market is going to respond to fundamentals differently depending on their position durations. Because think of the average hedge fund or mutual fund or pension fund. They're not going to float in and out of the stuff like I would as a trader, the vast majority, the vast majority of money moves very, very slow. And it's because it takes time to broker a deal to get into a position to scale into the position at size. Then to make sure that all your compliance is in place like all that stuff and then add regulation on top of it means big money moves slow. So because big money moves slow, that's why we see this kind of information in discreteness where price takes time to move to different points. And it's why we have things like under reaction and over reaction. Those are tradable events in the market. So all of that boils down to it doesn't fucking matter what anything is saying or going on what matters is what price is doing. That's it. That is the only thing that matters to us as traders because I could fundamentally value this company and it could go down easy. Why would it go down litany of factors. So if we're building an investment thesis. That's completely different because in an",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 99,
      "start_timestamp": "00:51:21",
      "start_timestamp_seconds": 3081.462626262626,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=3081"
    }
  },
  {
    "text": "price is doing. That's it. That is the only thing that matters to us as traders because I could fundamentally value this company and it could go down easy. Why would it go down litany of factors. So if we're building an investment thesis. That's completely different because in an investment thesis, we're thinking shorter term positioning has to sort itself out. And if I'm investing for a year plus, I don't care about this 10 move. I really don't because as long as the fundamentals and the company is still growing and moving in line with expectations on a longer term timeframe, which this is not. But let's pretend it was going up into the right. Well, it's a completely different story. A good example of that is if we look at something like Nvidia. And I'm using my little my little grip tool. So my hands are starting to slow down already. So if we look at Nvidia. And we'd look at like this period here. Right. Not a not a huge down move, but not insignificant. And then it's kind of been trending sideways. It hasn't hit new highs quite yet. But I mean, like look at the movement. It's absolutely beautiful. It's slightly broken down, but it's still overall good. Where we had a high, we had a pullback correction essentially posted a low ran up to a high posted a higher low trended sideways posted a slightly lower high. That's not a great look, but",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 99,
      "start_timestamp": "00:53:00",
      "start_timestamp_seconds": 3180.8646464646463,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=3180"
    }
  },
  {
    "text": "the movement. It's absolutely beautiful. It's slightly broken down, but it's still overall good. Where we had a high, we had a pullback correction essentially posted a low ran up to a high posted a higher low trended sideways posted a slightly lower high. That's not a great look, but that happens sometimes trends down a little bit catches on the M a starts to rally up and out. And now it's moving closer to all time highs. All of that is movement from a trading perspective that doesn't really matter for an investor. Because if you look at this from an investment perspective, the answer is just buy you buy whenever you feel like it and you hold on to it because as long as it continues to grow as it should, that's ultimately what matters. So the biggest lesson from this entire section of the video is that you have to define what kind of investment thesis you're applying and what's the corresponding timeframe. Because if I'm going to trade on something that I'm using a three year daily chart, fundamentals matter guaranteed. If I'm trading something where I'm looking at a three month chart, fundamentals do not matter. There's nothing about fundamentals that matter to me in this timeframe. So creating alignment between those is exceedingly important, I think. All right. Reese says I've spent so much time grasping options. It seems like another world, but there are essentially options contracts, right futures. No, futures are different.",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 99,
      "start_timestamp": "00:54:40",
      "start_timestamp_seconds": 3280.2666666666664,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=3280"
    }
  },
  {
    "text": "matter. There's nothing about fundamentals that matter to me in this timeframe. So creating alignment between those is exceedingly important, I think. All right. Reese says I've spent so much time grasping options. It seems like another world, but there are essentially options contracts, right futures. No, futures are different. So futures are another type of derivative. There's a bunch of different. If you think of securities, I actually have a slide for this in Eric's, you already know what it is. Eric's handy dandy, a combination of a slide deck. Oh, yeah, this upcoming video I'm going to do. But what am I, what am I looking for? Markets. Something like this is somewhere in here. Where's it at? Here you go. Securities. So you can see within the basket of securities in the market, there are kind of a couple big buckets. There's actually a few more than this. But inside of derivatives, there are options, futures, swaps, convertibles, there's Bermudian, Bermudian options. There's a lot of different kinds of derivatives that live in here. So futures are a different kind of derivative than options. They're very different. And there's actually options on futures. So there's a derivative on a derivative as well. Rointitdy says farmers use futures to sell their products. They actually don't. Yeah, they typically don't. Farmers, the advent of futures was actually to essentially add stability to commodities prices. So essentially a futures contract is similar to option in that there is a contract",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 99,
      "start_timestamp": "00:56:19",
      "start_timestamp_seconds": 3379.6686868686866,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=3379"
    }
  },
  {
    "text": "on a derivative as well. Rointitdy says farmers use futures to sell their products. They actually don't. Yeah, they typically don't. Farmers, the advent of futures was actually to essentially add stability to commodities prices. So essentially a futures contract is similar to option in that there is a contract between two parties. And it pertains to a specific asset for a time in the future. And the general purpose is if I'm a farmer and I'm trying to sell corn and then there's a grocery store that's going to use the corn, we can both add stability to our lives. If I talk to that grocery store and I set up an agreement with them where next year I'm going to deliver to you X amount of crop and it will call it X or or we'll call it Y value. So it's to stabilize price. Now the way that farmers and agriculture will use them now is literally to primarily hedge their selling of the products. So you can see this expressed in this. Let me move this over here. Get rid of this. Here. So you can go to the commitment of traders report and you can look at something like wheat. And you'll notice something based on this. So you can look at the relationship between producers and speculators. So producers are going to be these red lines and you notice how speculators are kind of the inverse. And then you'll notice that non commercials are",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 99,
      "start_timestamp": "00:57:59",
      "start_timestamp_seconds": 3479.0707070707067,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=3479"
    }
  },
  {
    "text": "look at something like wheat. And you'll notice something based on this. So you can look at the relationship between producers and speculators. So producers are going to be these red lines and you notice how speculators are kind of the inverse. And then you'll notice that non commercials are kind of like this fucking middle of the middle of the road group. So what's happening here is commercials when they're buying stuff up like this. That doesn't mean that they think that their underlying contract is going to appreciate in value. And that they're going to sell the contract for a profit. That's actually not what they want. What they want is that value the contract to just be there as a hedge and then to be able to conduct their business and then to sell things at prices that makes sense for them. So this is a big thing if you look at something like airlines. They will use futures and trading activities to hedge the cost of fuel, which is highly variable. It creates a bubble for them and a general planning factor if they hedge their risk with respect to price changes. So futures are a little bit different in that sense in terms of like what their construction is. But the way to think about futures that they're kind of like a delta one variant of options for the base contracts. So you can use futures to trade things that you can't trade with options",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 99,
      "start_timestamp": "00:59:38",
      "start_timestamp_seconds": 3578.4727272727273,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=3578"
    }
  },
  {
    "text": "little bit different in that sense in terms of like what their construction is. But the way to think about futures that they're kind of like a delta one variant of options for the base contracts. So you can use futures to trade things that you can't trade with options directly. So for example, that gold trade that I talked about yesterday, you can't trade gold outright with other securities. You can't trade the commodity itself. That's that's literally what futures were for is to trade the commodities themselves. So for something like that gold trade, it pertains to a certain amount of gold, physical gold. So Reese says in their leverage to the tits, some of them, yeah, some of them, not all of them and options can also provide the same or more leverage in certain circumstances. It entirely depends on the position. So it's relative and that that's a common misconception about futures is that people think that futures are this insanely jack to the tits leveraged product. And some of them are big, some of them are not big. So yeah, yes and no is the answer. Some things can move a lot, some things cannot move a lot. And there's a difference between the amount of leverage, something provides and also its volatility because you have to keep in mind, you can have something that might perceivably pertain to a lower dollar amount, but have a much more, much more leverage tied to it. So",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 99,
      "start_timestamp": "01:01:17",
      "start_timestamp_seconds": 3677.8747474747474,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=3677"
    }
  },
  {
    "text": "move a lot. And there's a difference between the amount of leverage, something provides and also its volatility because you have to keep in mind, you can have something that might perceivably pertain to a lower dollar amount, but have a much more, much more leverage tied to it. So this is a common thing that you'll find with net gas. Net gas is always touted as like the widow maker. It's like this big terrible thing. Net gas is not that bad. It really is not that bad. What's bad about net gas is people confuse it. And they misunderstand periods of complacency as great times to put on way over sized positions. And then every once in a while, something like net gas becomes super busy, like a lot of other things. So people misposition notoriously in something like net gas. But if we look at the volatility of something like net gas compared to other stuff, it's it's really not that crazy. But people are mispositioned and they trade really poorly around it. Because there's a reality here. We can see net gas hit a low of 144 back in 2020. And it literally hit 10 in 2022. And then it's a massive move on a relative basis for a commodity. That's a giant move. So one of the issues, I think, is people just misposition pretty pretty frequently even big firms because they don't always fully respect. Hail risk is what it boils down to. And",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 99,
      "start_timestamp": "01:02:57",
      "start_timestamp_seconds": 3777.276767676767,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=3777"
    }
  },
  {
    "text": "2022. And then it's a massive move on a relative basis for a commodity. That's a giant move. So one of the issues, I think, is people just misposition pretty pretty frequently even big firms because they don't always fully respect. Hail risk is what it boils down to. And then the same says in futures, try starting with MES is it moves like spy and the multiplier is small so you won't get surprised. Yeah, I think that that's fair. I mean, in my opinion, I would just paper trade them. You already know that answer. No reason to start trading futures at all before paper trading them for a year plus. There's there's literally no reason not to because the problem with futures is that there are a lot of other elements that people don't really understand. For example, carry. There's an optimal time to roll a futures contract depending on what it is based on the carry, which is a cost that you pay to hold it, but it's an indirect cost. So I think. Roaring City says, where can you pay for trade futures without paying a subscription, fucking Excel dog open up a Google sheet. There's in just track your own shit. There's zero reason to paper trade in a paper trading platform literally zero reason. Paper trading in a paper trading platform is it's it's literally pure silliness because you're not going to get real fills. And the data is gone as soon as",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 99,
      "start_timestamp": "01:04:36",
      "start_timestamp_seconds": 3876.6787878787873,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=3876"
    }
  },
  {
    "text": "There's in just track your own shit. There's zero reason to paper trade in a paper trading platform literally zero reason. Paper trading in a paper trading platform is it's it's literally pure silliness because you're not going to get real fills. And the data is gone as soon as you hit reset it's gone. Just open up Excel and paper trade in there that's it's literally exactly what I do. I'm starting to move some of my stuff over to Google sheets. So it's a little more portable. But for like the bigger data sets that I track I still use Excel just because it's much faster than Google sheets. And it's exactly what I do. Yeah. Roaring City says, first he wants me to save now he wants me to do data entry. I roll. Yeah, exactly. I hear you. That's the. That's the plight of being a trader. I know hold on you already know this is the perfect time to promote my my biggest most banger is videos. This one. Whoa, I think last time we spoke this video had 200 views. And I want to be. I will it's at 3 10 now. This is from 21 September. So that video is about flying off the shelf as fast as you can. If there was a video to watch. I would I would watch that one before YouTube decides that it's too hot in YouTube I pull it down because of how many views it's",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 99,
      "start_timestamp": "01:06:16",
      "start_timestamp_seconds": 3976.080808080808,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=3976"
    }
  },
  {
    "text": "from 21 September. So that video is about flying off the shelf as fast as you can. If there was a video to watch. I would I would watch that one before YouTube decides that it's too hot in YouTube I pull it down because of how many views it's gotten it could be too big of video. So yeah, I think futures are completely completely fine to tinker with in Excel. But I like I wouldn't jump into them. There's no reason to jump into them. There's slight benefits to them. But I would you got to focus. If you're trying to learn about trading options going into futures. It's not the right place to go. It's genuinely not. And it's because there's just added. There's added complexity. That's not difficult to learn. It's entirely easy to learn. But it's added complexity that just slows down the broader learning process. So yeah, that's that's exactly why I think futures are fine. And if you feel like you have a good understanding of options and you kind of get the world of derivatives. Then there's no problem with starting to venture into into some future stuff. So futures have really important production cycles that you have to be aware of so that you don't get on the wrong side of essentially the futures version of binary events and shit like that. It can it just catches people off I think. So I would try to avoid those instances. So great",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 99,
      "start_timestamp": "01:07:55",
      "start_timestamp_seconds": 4075.482828282828,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=4075"
    }
  },
  {
    "text": "important production cycles that you have to be aware of so that you don't get on the wrong side of essentially the futures version of binary events and shit like that. It can it just catches people off I think. So I would try to avoid those instances. So great thing on futures is if you're a counter small, there's no PDT genuinely didn't know that that's actually great for me to know. Yeah, I think. Yeah, that's fascinating. I think traders trying to get around the PDT rule is always silly. I know I did the same thing. But the PDT rule is not it's really not there to hurt you. It's genuinely not. I think it's really not going to slow you down from hurting yourself because the overwhelming majority of traders do and that's not me endorsing it. I believe people are grown fucking adults and if you don't want to wear a seatbelt, don't wear a seatbelt. And if you want to try to day trade with a 5,000 account, fucking whatever, go go crazy. I don't believe in being babysat, but it's not there to hurt you. It's genuinely not because most traders take care of that by absolutely hurting themselves and entirely themselves. Yeah. I've got a, Zack says there's got to be a way to have AI fill it in for Excel. Yeah, there's something like that. But the again, if you watch that video, one thing I talk about is developing a",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 99,
      "start_timestamp": "01:09:34",
      "start_timestamp_seconds": 4174.884848484849,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=4174"
    }
  },
  {
    "text": "of that by absolutely hurting themselves and entirely themselves. Yeah. I've got a, Zack says there's got to be a way to have AI fill it in for Excel. Yeah, there's something like that. But the again, if you watch that video, one thing I talk about is developing a relationship with the data. I genuinely believe that's an important process. The reason is because if you, if you understand if you're closer in the process of conducting data entry, you're inherently going to be closer to the information. It's just a function of doing it. And you will learn more like again, like purposeful observation is is pretty useful. So I think there's nothing wrong. If you want to use some sort of Excel tool or API to, you know, speed up the process, but I cannot recommend highly enough, just manually inputting stuff in your paper trading logs. I still do it today. I literally still do it today. And I make it a purposeful exercise. So I think it's valuable. Anthony says, futures were also taxed at section 1256. Yeah. So futures indices will indices and stuff like that are. So section 1256 of the tax code. I have a really old video. I don't think I've redone this video because I don't really care enough. Yeah. Yeah. If you guys want to see an OG, this isn't even like a full OG Eric video, but that's like a partially OG Eric video. This is from 2021.",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 99,
      "start_timestamp": "01:11:14",
      "start_timestamp_seconds": 4274.286868686869,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=4274"
    }
  },
  {
    "text": "I have a really old video. I don't think I've redone this video because I don't really care enough. Yeah. Yeah. If you guys want to see an OG, this isn't even like a full OG Eric video, but that's like a partially OG Eric video. This is from 2021. I think OG, I started in May of 2020. So that's about a year in a YouTube. But that goes over section 1256 of the tax code. Rory, Teddy says 69 minutes in. Look at us go. The only issue is that we, I don't even think we cracked. I think we had 50 viewers. Maybe. So we unfortunately, we didn't hit our 69, which is, you know, sad. Sad for me, as I think about it makes me sad. Resets shirt better be off. Sometimes it is. Sometimes it isn't. You never really know. There's, there's females now that show up on the streams and stuff. So that's literally why I remain clothed. It's straight up just trying to be respectful. It might be a little too old school or presumptive, but I do try to be respectful of the ladies for the dude, you can go fuck yourselves. But for the women, it's not so much that case. Try to be, try to be respectful. All right. Now, let's get back over to this. I was going to talk about futures and I was going to talk about the utility. So I wanted to talk about using huge",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 99,
      "start_timestamp": "01:12:53",
      "start_timestamp_seconds": 4373.688888888888,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=4373"
    }
  },
  {
    "text": "But for the women, it's not so much that case. Try to be, try to be respectful. All right. Now, let's get back over to this. I was going to talk about futures and I was going to talk about the utility. So I wanted to talk about using huge futures to hedge. So let's say that you have a portfolio. I'm literally just randomly, randomly naming stocks. And then Nvidia. So let's say that you have this portfolio and let's say it's now, let's say it's Tuesday. And it's at 20 hundred Pacific time. And let's say that Iran invades Israel. What do you think would happen to the stock market? If that happened, if I ran invaded Israel, 20, 200 Pacific time on a Tuesday, what would be your guess? What would happen here? Nothing good. Yeah. You probably. You probably would see the market do this. Here's the opening candle. That's what it would do. And then for those that are reading between the lines here, don't forget that we have. You guys know who this is. Probably as long here. The wind blowing in the wind. Except she is actually going to grab. She has a telescope. Here. A little siding picture. So oh yeah, and I forgot. She made a bunch of money before. So she has a gold chain. And it has diamonds on it. So Lauren is over here. And she has a like a monocular. And she's keeping an eye on things.",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 99,
      "start_timestamp": "01:14:33",
      "start_timestamp_seconds": 4473.090909090909,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=4473"
    }
  },
  {
    "text": "telescope. Here. A little siding picture. So oh yeah, and I forgot. She made a bunch of money before. So she has a gold chain. And it has diamonds on it. So Lauren is over here. And she has a like a monocular. And she's keeping an eye on things. Oh yeah, shit. You guys can't see the whole second. There you go. Perfect. So she's keeping an eye on things. And she sees that over here. There's a tank. Let's point it. I kind of put it in the middle, which I shouldn't have done. So there's a tank over here. That is shooting a projectile. At a tank that's over here. This one has a lot of wheels. This guy's looking the wrong way though, kind of sucks to be him. So now what's happening is Lauren's over here with her telescope. And she sees this thing unfolding. She's like, oh shit. Over there in the Middle East, this tank is shooting at this tank and they're driving towards each other. I think the market is probably not going to react well to this. And while the two tanks are going at it, you can see that this person over here. Is Israeli. And in their chat bubble, they're all like, hey, yo. Fuck you. And then over here. We have this person that's like a yo. Fuck you. So we can see that we have a clear issue starting to unravel. And Lauren. Over here. She can",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 99,
      "start_timestamp": "01:16:12",
      "start_timestamp_seconds": 4572.492929292929,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=4572"
    }
  },
  {
    "text": "person over here. Is Israeli. And in their chat bubble, they're all like, hey, yo. Fuck you. And then over here. We have this person that's like a yo. Fuck you. So we can see that we have a clear issue starting to unravel. And Lauren. Over here. She can see all this. And she's all like. Oh, damn. Let me check. The port. Obviously the port is the portfolio. So she doesn't want to take her eye off the microscope for the, the monocle. And over here, she's going to whip out her cell phone. She's going to touch some buttons. And she's going to look at her portfolio that looks like this. So. Because she has chameleon eyes. She has this one looking this way, this one looking this way. And as she has her chameleon eyes looking in different ways. She sees this thing getting worse. Is now this guy shooting back. I'm going to get the right color. This guy finally turns his tank around. A little bit like this. And then he gets, get some heat off himself. Quickly exclaims. Bam. Be watch. And he sends his round back over here. Okay. What I'm highlighting is war is heating up. And getting spicy over here in the old war front. And Lauren can see all this. And Lauren is a highly, highly perceptive trader. So she says. My portfolio. I need to manage this. So what she can do is she's going to be like,",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 99,
      "start_timestamp": "01:17:51",
      "start_timestamp_seconds": 4671.894949494949,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=4671"
    }
  },
  {
    "text": "is war is heating up. And getting spicy over here in the old war front. And Lauren can see all this. And Lauren is a highly, highly perceptive trader. So she says. My portfolio. I need to manage this. So what she can do is she's going to be like, yo, let me check the port. Hmm. I have 1000. Beta weighted. Spy deltas. Then she might say. I'm a scrub. Some. Dem. So here. Lauren looks at her portfolio. She sees. That she has. She has 1000 beta weighted spy deltas. And she wants to, she's going to scrub some of them off. Right. She's going to scrub them. So what can she do? She's going to be like. Oh, wait, wait, wait, wait, wait, wait, wait, wait, wait, my bed. She's going to be like. Deep. This is her pressing buttons on the cell phone. And as she's pressing on buttons on the cell phone, she gets that that beep boop going. Then she's going to be like, I'm going to sell to open. Maybe. What do you guys say? Maybe five. Something like that. You could do MES here. MES futures. Maybe more. Or more. If more. Thanks. I just pulled this up on OBS. And I just realized how unbelievably absurd this looks. Here's what it is. This is the scenario. So. We can put this order in. After the market's closed. And we can put this order in to take off some of these beta",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 99,
      "start_timestamp": "01:19:31",
      "start_timestamp_seconds": 4771.296969696969,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=4771"
    }
  },
  {
    "text": "Thanks. I just pulled this up on OBS. And I just realized how unbelievably absurd this looks. Here's what it is. This is the scenario. So. We can put this order in. After the market's closed. And we can put this order in to take off some of these beta weighted deltas for spy. And we can put this in to take off some of these beta weighted deltas. So that our portfolio. Doesn't blow up. Because right now. The equivalent of what's going on here from all of this. Is like. There is a giant. And we can put some. Pulse on it from flying through space. That's. Hurling. Towards her portfolio. And she can protect her portfolio. Even though the market's closed. By putting on a futures trade like this. This is one of the benefits of trading futures. And we can put this in to manage black swan risk. Without having to carry a hedge forever. So. I'm going to pause here. I've been seeing the chat flying around. Let me get caught up. It looks like there's. B Williams gifted. A shit ton 20. B Williams gifted 20. Outlier trading memberships. That's. I hope everybody enjoys B Williams. Make sure you guys say thank you to him. Especially if you were the ones that got it. I don't know how that works. I literally don't. But. Make sure you guys say thank you, please. And on behalf of everybody else, thank you. That Lauren says funny.",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 99,
      "start_timestamp": "01:21:10",
      "start_timestamp_seconds": 4870.69898989899,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=4870"
    }
  },
  {
    "text": "B Williams. Make sure you guys say thank you to him. Especially if you were the ones that got it. I don't know how that works. I literally don't. But. Make sure you guys say thank you, please. And on behalf of everybody else, thank you. That Lauren says funny. I have binoculars because I'm kind of nosy. Yeah, exactly. So I could tell Lauren. I'm going to say that you're fucking long ass legs and shit. You're out here. Look in at war unfolding. And you're making trading decisions. But this is one of the good parts about. Futures is they give you exposure to something like this. And it helps offset. Some of the risk. All right. Back into here. I think we had learning in future. I think we got through most of them. Okay. Who were the key influences or mentors that help shape your trading career? And what was the most valuable lesson you learned from them? There's two people. And this is actually pretty short. The first one is the dude that introduced me to invest in not trading at all. By the way, he didn't introduce me to. This guy. Which. He's not fun fact. He's been dealing with cancer. And he just had more cancer that popped up. And it doesn't look super great. He was just out here to visit me. But I might be flying to New York to go. Hang out with them for a bit. So anybody that",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 99,
      "start_timestamp": "01:22:50",
      "start_timestamp_seconds": 4970.10101010101,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=4970"
    }
  },
  {
    "text": "fun fact. He's been dealing with cancer. And he just had more cancer that popped up. And it doesn't look super great. He was just out here to visit me. But I might be flying to New York to go. Hang out with them for a bit. So anybody that does prayers or thoughts. Would love for you guys to keep them in your prayers. His name is. I call him E man. His name is Ed. I'm not sure if you can tell me. I'm not sure if you can tell me. But this. This is. This is quite literally the dude that changed my life. Like genuinely. Because he is the one that introduced me not only to. Investing, but. I used to spend. A ton of time. In his office after school hours. Because well for a lot of reasons. I didn't want to go home. I was also going home. Yeah, but bunch of bullshit. So. I used to spend hours just learning from him. Asking him about life, asking him about experiences. And he has been. Yeah, kind of a massive influence. So. When I consider what my life would look like. With and without him. I think it's. It's literally night and day. I would be in a completely. Completely different spot. So he's had cancer a few times. He has he's had melanoma a few times. And then he just had prostate cancer. He went through that. And now he's. Looking at it",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 99,
      "start_timestamp": "01:24:29",
      "start_timestamp_seconds": 5069.50303030303,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=5069"
    }
  },
  {
    "text": "him. I think it's. It's literally night and day. I would be in a completely. Completely different spot. So he's had cancer a few times. He has he's had melanoma a few times. And then he just had prostate cancer. He went through that. And now he's. Looking at it again. He has some shit. Like a mass underneath his shoulder. And then I guess it looks like it's spreading again. And then I think it's going to be a lot more. And then I think it's going to be a lot more. So yeah. So he's the first one. And it's not just from a trading perspective. It's literally just from like a. A manhood perspective. Like teaching me how to think. And. Yeah. Stuff like that. But he and I. I didn't realize it. But he and I. I was very receptive to kind of like his. He also had a son that he adopted. And his son had committed suicide. So he also had a void. Because at this point in my life. I didn't really have. I my dad was still alive. And I love my dad. My dad loved us as best as he could. Especially as we got older. But I didn't have like a father figure in my life. Like Eman genuinely became that. Like when I went to advice. Even today. As I'm thinking about different kinds of things. He's always the first person that I go to for advice. So he's",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 99,
      "start_timestamp": "01:26:08",
      "start_timestamp_seconds": 5168.905050505051,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=5168"
    }
  },
  {
    "text": "Especially as we got older. But I didn't have like a father figure in my life. Like Eman genuinely became that. Like when I went to advice. Even today. As I'm thinking about different kinds of things. He's always the first person that I go to for advice. So he's influenced more than just my trading. He's the one that introduced me to trading. And then the second person. Is a guy that I met online. And I would indirectly learn from a lot of what he talked about. He was somebody that clearly didn't have a lot of motives. And the reason I say that is because he was not nice to people. He's not like I would consider myself much nicer than him. Although I'm very direct. And sometimes people interpret that. As like being not nice or or something like that. Especially like via messaging. His messaging definitely comes across very terse typically. But that that mentor. Talk me that I didn't know shit about trading. Even though I had been trading for a while. And I didn't go into it thinking that I was hot shit knowing everything. But just in the conversations I would have and watch him have. I learned that there was a lot of massive gaps in what I do. And that second mentor is a big reason why I started the YouTube channel. Because YouTube was around then. But it wasn't as big of a deal then. And he wasn't doing",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 99,
      "start_timestamp": "01:27:48",
      "start_timestamp_seconds": 5268.30707070707,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=5268"
    }
  },
  {
    "text": "and watch him have. I learned that there was a lot of massive gaps in what I do. And that second mentor is a big reason why I started the YouTube channel. Because YouTube was around then. But it wasn't as big of a deal then. And he wasn't doing a YouTube. He had no interest in doing a YouTube channel. I actually invited him onto mine. So that I could talk to him and. Kind of show the impact that he's had on my life. And hopefully just put that in front of people. But he didn't want to be he doesn't even I don't even mention his name because he doesn't want to be named. So. He taught me that. Even though I was really eager to try to make a lot of money. At a young age. My eagerness didn't matter. And I could be as eager as I wanted. But what really mattered was taking the time to plan. And creating a plan that made sense. Now. He's teaching style is actually very, very similar to my teaching style, which is. I. I try to aim people in the right direction. But it's self learning. I you should learn a lot of the nuance in the details by yourself. I obviously teach a lot of the fundamentals and foundational stuff, right? Like this whole spin off series is essentially that to a T and going through in very, very deep detail teaching a lot of concepts.",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 99,
      "start_timestamp": "01:29:27",
      "start_timestamp_seconds": 5367.70909090909,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=5367"
    }
  },
  {
    "text": "you should learn a lot of the nuance in the details by yourself. I obviously teach a lot of the fundamentals and foundational stuff, right? Like this whole spin off series is essentially that to a T and going through in very, very deep detail teaching a lot of concepts. So it's not like I just say go learn this. It's definitely nothing like that. But it's also not overly prescriptive where I do not. To heavily define. The things that should be learned when I try to teach people to be autonomous to very military style of training, especially for officers because you have to be. A self sufficient thinking being so he very much taught me that he taught me that I needed to have a defined plan that's written out that has a lot of thought put into it. And he taught me that the only person that is going to care about this stuff is you. So it's on you the individual to do it. So yeah, that's number one there. B Williams says that he's going to be praying for. Thank you so much. I appreciate it. Thank you. Yeah. And I really appreciate you guys keeping them in his thoughts. Nima. Oh shit. That's a tough. Oh shit. That's a tough name. Damn. Ne. Neomaya. Neomaya. Derosie says how many years do you think a person with some trading experience should invest in learning options before potentially trading. And options seems a bit difficult",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 99,
      "start_timestamp": "01:31:07",
      "start_timestamp_seconds": 5467.111111111111,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=5467"
    }
  },
  {
    "text": "guys keeping them in his thoughts. Nima. Oh shit. That's a tough. Oh shit. That's a tough name. Damn. Ne. Neomaya. Neomaya. Derosie says how many years do you think a person with some trading experience should invest in learning options before potentially trading. And options seems a bit difficult to grasp let alone finding an edge. Well, the edge that you will find in options is not all too dissimilar from what you would do in trading. So from that perspective, I actually think it's quite easy. Now, just in terms of like application, but in terms of like starting, I have a couple videos that would probably be useful. This one. So for Neomaya and correct me if I'm wrong, I try to pronounce people's names just because it's kind of a fun exercise for me. So that video is about like how to start trading. But in terms of like how long it's not a duration based thing. And it's absolutely a skills based thing. I recommendation like if I were to advise myself starting over again, I would tell myself to paper trade for three months at least. And I really think a year would be ideal, but I just know how impatient I am. So I'm pretending that I'm talking to 17 year old Eric again. So I'm compromising to try to get a level of compliance because I could say a year, but it doesn't matter if I think a year is too long",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 99,
      "start_timestamp": "01:32:46",
      "start_timestamp_seconds": 5566.5131313131305,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=5566"
    }
  },
  {
    "text": "ideal, but I just know how impatient I am. So I'm pretending that I'm talking to 17 year old Eric again. So I'm compromising to try to get a level of compliance because I could say a year, but it doesn't matter if I think a year is too long because I can't synthesize that at that point in time. I'm trying to make money fast. So I'm trying to be realistic with with what I would tell myself three months is what I would tell myself. And over the course of that three months, you're not going to learn anything pertaining to making money. That first three months is going to be making a bunch of mistakes. It's going to be developing a relationship with the markets. It's going to be very, very slowly learning. Now, the process of developing edge in actually finding ways to make money. If you're a stock trader, it's literally the same thing. You can just use options to gain leverage. That's it. Right. So if we go back to the again, a combination of a slide deck. And we look at the big four strategy and trade process. It's quite simple. But let's say that you're a stock trader and you're able to find things that move directionally. Okay. Well, that's your profit mechanism is you're able to accurately identify directional movements. So however you do that in stock trading is the same is what you would do an option trading. So then",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 99,
      "start_timestamp": "01:34:25",
      "start_timestamp_seconds": 5665.915151515152,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=5665"
    }
  },
  {
    "text": "say that you're a stock trader and you're able to find things that move directionally. Okay. Well, that's your profit mechanism is you're able to accurately identify directional movements. So however you do that in stock trading is the same is what you would do an option trading. So then you essentially just need to find things that allow you to capitalize on that profit mechanism. But that's again, there's there's not an inherent edge to options options provide exposure to different kinds of phenomenon that can offer edge like variance risk premiums. You can't get that with equities. So that exists. But options in and of themselves provide precisely zero edge. It's the same thing as people who debate buying or selling options and they go back and forth on. If you know, buying is better than selling or selling better than buying and the reality is again. There's really inconclusive edge between them. It's it's that's really not the question to ask. So that's that and roaring titty is asking for the paper trading link. There you go. So let me know if that answers your question. So we have South. Pack dad. As hope you're having a great night. Love the content great to have you glad glad you stopped buying. Thanks so much for the comment. So your ability to identify patterns with within markets is edge. Rointitty says why is it called edge instead of skill because you can have skill and no edge. There",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 99,
      "start_timestamp": "01:36:05",
      "start_timestamp_seconds": 5765.317171717171,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=5765"
    }
  },
  {
    "text": "great night. Love the content great to have you glad glad you stopped buying. Thanks so much for the comment. So your ability to identify patterns with within markets is edge. Rointitty says why is it called edge instead of skill because you can have skill and no edge. There are a lot of people who can trade for a long time have skills right they can know how to build trades they can know those kinds of things. If they have bad risk management or if they're too nervous about putting on risk or you know whatever insert whatever the thing is they can still not have an edge. So in edges is a quantifiable metric where we're expecting to make money and something and that's why edge is quite important. Now edges like this really weird topic there's a lot of different permutations and there's a lot of different ways people internalize what it means and stuff like that. But because oh that's way too bright because sometimes people they'll think if edges something like beta or you know alpha and a lot of times alpha and edge will go hand in hand. So you can definitely not beta from a trading perspective but you can have you can definitely create excess return using different betas but it's just a different concept. Joey says I always thought edge was a secret mechanism you profit off of not doesn't have to be secret it's yeah no definitely not secret",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 99,
      "start_timestamp": "01:37:44",
      "start_timestamp_seconds": 5864.719191919191,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=5864"
    }
  },
  {
    "text": "beta from a trading perspective but you can have you can definitely create excess return using different betas but it's just a different concept. Joey says I always thought edge was a secret mechanism you profit off of not doesn't have to be secret it's yeah no definitely not secret most edges is really not secret like momentum that's not a secret variance is premiums that's not a secret but those are definitely. Quantifiable edges that people people have like this really miss I find like a like a wide array of edge where some people that are too much efficient market hypothesis they would argue that there is no edge which obviously we know that there is and I mean I you shouldn't use anecdotes but I for a personal scenario no for a factor's fucking edge so. That's from a theoretical perspective if you take you know strong form efficient market hypothesis which we know is is not so much the case. Be William says I think a big thing when it comes to options is do your research on how the market makers choose price point what the mechanics are about beneath the surface. Once you know how it works you can make it I would I would actually argue differently than that be Williams because realistically like the way that market makers determine price or the way market determines price ultimately doesn't actually matter that much right it's consensus driven. So you can understand market mechanics",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 99,
      "start_timestamp": "01:39:24",
      "start_timestamp_seconds": 5964.121212121212,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=5964"
    }
  },
  {
    "text": "how it works you can make it I would I would actually argue differently than that be Williams because realistically like the way that market makers determine price or the way market determines price ultimately doesn't actually matter that much right it's consensus driven. So you can understand market mechanics intimately well and still not be able to make money from it so for me I think the north star for edge it's literally this process is outlined like this is the process to build edge is right here. And the reason for this is because again a lot of people will start trading options thinking that there's some sort of magic solution in options to their trading problems and that they're going to be able to just trade options and make a bunch of money and it's just not the case. The way that you build edge in trading is by finding ways to make money it's literally that simple so then how do we find ways to make money well that's the idea behind profit mechanisms that's why I label it as. Such because they are things that lead to making money so yeah the understanding markets market structure the different players all of that stuff is good information but if a trader is really good at trading directionally they could literally not know any of that and make money so for example if i'm really good at trading directionally I can just buy option. By calls in",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 99,
      "start_timestamp": "01:41:03",
      "start_timestamp_seconds": 6063.523232323231,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=6063"
    }
  },
  {
    "text": "structure the different players all of that stuff is good information but if a trader is really good at trading directionally they could literally not know any of that and make money so for example if i'm really good at trading directionally I can just buy option. By calls in the money out of the money both whatever and I can still make more money than if I just bought the stock that's with knowing nothing it's literally just buying the options now obviously you can optimize those returns by understanding what is expiration might make sense what delta might make sense what game are you looking for but that starts to really amplify the returns it's not going to generate the returns picking your DTE. So if you're going to buy options or sell options or do both what matters is if you have a quantifiable profit mechanism that you can take advantage of that's what matters and then your ability to detect the returns that you can take advantage of that's what matters and then you're ability to detect the returns that you can take advantage of that's what matters. So if you've backed it and then your ability to trade it but the profit mechanism comes first and that's before you ever touch an option. So yeah. So Liam says options were really only created to hedge positions yeah well hedge and speculate right because if you're going to have a hedging component that there has to",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 99,
      "start_timestamp": "01:42:42",
      "start_timestamp_seconds": 6162.925252525252,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=6162"
    }
  },
  {
    "text": "ability to trade it but the profit mechanism comes first and that's before you ever touch an option. So yeah. So Liam says options were really only created to hedge positions yeah well hedge and speculate right because if you're going to have a hedging component that there has to be somebody to speculate on the other side because for example i'm not going to take the other side of a hedge unless I have some sort of speculative perspective on whether or not I think their hedge is going to work out. So yeah it's definitely born out of hedging but it's not like you need the other side of that equation in order for that play out so if we take a look at this. So this is cool finally Google oh this is great so Google sheets his finally created tabs I love this because I hate having a like scroll through this whole thing but let's take a look at the history I have this in my trading plan let's go to 350 BC fails and the all of harvest. Literally so this is like these are the notes i'm literally going to read you the notes directly from a trade log so let's talk about the the advent one of the earliest references to options trading was seen in a book written by eras stottle and it's from the 4th century or about 350 BC the book was named politics and it talked about fails",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 99,
      "start_timestamp": "01:44:22",
      "start_timestamp_seconds": 6262.327272727272,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=6262"
    }
  },
  {
    "text": "notes directly from a trade log so let's talk about the the advent one of the earliest references to options trading was seen in a book written by eras stottle and it's from the 4th century or about 350 BC the book was named politics and it talked about fails of militus and I'm going to read it. So I'm going to read it from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and and he says there is a particular sort of item that says... he agrees to that as well. He agrees to that as well. He",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 99,
      "start_timestamp": "01:46:01",
      "start_timestamp_seconds": 6361.729292929293,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=6361"
    }
  },
  {
    "text": "a book written by eras stottle and it's from a book written by eras stottle and it's from a book written by eras stottle and and he says there is a particular sort of item that says... he agrees to that as well. He agrees to that as well. He agreed to that as well. The Archival Market Division. However Hallrooms Circuit Vision. However Hallrooms Priests Bureau. However Hallrooms Court Returners forfeit As The owners agreed to this as they would get a guaranteed amount, even if fails opted out of the deal, they would still be able to sell the rights to use the press every year. When the growing season set in, all of the presses saw a harvest much higher than usual, since the crop is time sensitive, the farmers acted in desperation to bid up the payment to the olive mill to quickly process their harvest, though the terminology wasn't official, that's literally a call contract. So if you think about what that was, that's literally that example from 350 BC is straight up a speculative trade. So fails for a military shows us actually that the very first options trade technically speaking is not a hedge at all, but he was speculating. He was speculating that demand was going to be massive in the coming harvest and he ended up being correct. Now again, in general, a lot of the more common use of early options definitely is very similar to hedging that's a big",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 99,
      "start_timestamp": "01:47:41",
      "start_timestamp_seconds": 6461.131313131313,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=6461"
    }
  },
  {
    "text": "hedge at all, but he was speculating. He was speculating that demand was going to be massive in the coming harvest and he ended up being correct. Now again, in general, a lot of the more common use of early options definitely is very similar to hedging that's a big part of it, but that's also that's more so futures why futures were invented was specifically for hedging. But yeah, anyways, in case anybody was interested in a history lesson, I literally go through essentially all of the early uses of options. So I go from 360 BC to 1636 to the 17th century to the 1800s all the way through. So yeah, I mean that literally I nerd about this stuff just a tad, but I spent a lot of time digging into the history of derivatives because it was just super, super interesting to me. He william says, what I've been very successful in trading is following the stock for about two weeks and understanding the momentum and what's going on with world news. Yeah, that's okay. So some people will define individual tickers that they like to trade. I very much am not like that. I look for specific conditions and I tend to be agnostic of the ticker. And it's just because I can get more repetitions in by doing it that way. If we focus on one individual ticker, you really narrow your scope a lot. And again, that's okay if you like that. But",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 99,
      "start_timestamp": "01:49:20",
      "start_timestamp_seconds": 6560.533333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=6560"
    }
  },
  {
    "text": "for specific conditions and I tend to be agnostic of the ticker. And it's just because I can get more repetitions in by doing it that way. If we focus on one individual ticker, you really narrow your scope a lot. And again, that's okay if you like that. But I actually think using a conditions based approach will get you much more looks at things that fit those specific conditions that should statistically yield a positive outcome in the aggregate. The funny thing about this story is if you go on the discord was for anybody here yesterday was anybody here on the live stream yesterday and then I have another question for you. There was a stream yesterday. Okay, so Reese was there. Got it. So we went through a bit of a case study. Yeah, on a trade. And if you take a look at what I posted in the discord earlier today, what do you notice about this? Different holding than what we reviewed yesterday. But what do you notice about the general looking feel? Super fucking similar. Super fucking similar. So the point is if we use some sort of conditions based rules set, we can find more opportunities that fit those conditions. So this I already have a position on. I started scaling in actually on the gap up today just because again, that's the nature of speculating I put on a small trade to start with. And then as it started running, I",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 99,
      "start_timestamp": "01:50:59",
      "start_timestamp_seconds": 6659.935353535353,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=6659"
    }
  },
  {
    "text": "can find more opportunities that fit those conditions. So this I already have a position on. I started scaling in actually on the gap up today just because again, that's the nature of speculating I put on a small trade to start with. And then as it started running, I literally just scaled in for the first part of the day as it was running its way up. And then as soon as I got the alert that it had broken meaningfully above that resistance line, I finished scaling in the position. And I actually sold a call on top of it that was short dated at a ratio as per usual. Very, very light ratio. It's like 15 covered. So very, very light ratio. And that's it. It's literally running almost an identical setup to what I just showed you in APP. Almost identical. And this I'm still in as you can see, like I literally am still continuing to move up the stop and to just run it upside. So the main point there is that if we develop conditions based rules, we can then very efficiently scan for occurrences of those and then try to play them when they look right. So that's that's the idea. I just thought it was hilarious that literally yesterday we had talked about this setup. And then I mean, if we look at AFRM, it's it's so similar. It's not the same obviously, but it's a very, very similar move overall.",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 99,
      "start_timestamp": "01:52:39",
      "start_timestamp_seconds": 6759.337373737373,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=6759"
    }
  },
  {
    "text": "when they look right. So that's that's the idea. I just thought it was hilarious that literally yesterday we had talked about this setup. And then I mean, if we look at AFRM, it's it's so similar. It's not the same obviously, but it's a very, very similar move overall. Now the scale of the chart and stuff looks different now because it hasn't had that big of a run yet. But we'll see if it does. Who knows? It can always revert back. And what I would do in that instance is just start scaling out because I'm already in for a decent profit at this point. So it would be a really, really simple trade to me. This is one that I essentially would not take a loss on at this point. Unless there's a massive gap down, then I eat the loss. That's how it goes. You play the game. You take risk. That is how the whole thing goes. All right. Um, Cedric says you going around a little on superstar glately. That makes me nervous. I don't know if that's good or bad, but superstar, I know has a very specific opinion of things. So hopefully not bad news. I wonder, I'm guessing that the video I did yesterday would probably crack a couple people up. Um, yeah, the, the stuff. That was my, that would be my guess. Cedric says it's good comments, but it's not a good thing. Why? Yeah. For, for overall",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 99,
      "start_timestamp": "01:54:18",
      "start_timestamp_seconds": 6858.739393939394,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=6858"
    }
  },
  {
    "text": "hopefully not bad news. I wonder, I'm guessing that the video I did yesterday would probably crack a couple people up. Um, yeah, the, the stuff. That was my, that would be my guess. Cedric says it's good comments, but it's not a good thing. Why? Yeah. For, for overall brand, it's always a good thing if, if people are at least somewhat interested to share the stuff that I do. So that I imagine is probably not a bad thing. But if I'm just guessing that it would have been the video from yesterday, because otherwise I haven't done anything too recently. Maybe, maybe the stuff about the cat. I don't know what it is. You'll have to tell me. But, um, yeah, that's interesting. The next question here is, how do you continue to learn and stay updated with market changes after all these years of experience? Uh, that's easy. That's just literally this, right? Like the time I spend with, with you all going through stuff essentially shows how I do this exact process. So it's just a matter of staying in touch with the markets. That's kind of easy. Yeah. Zedrick says also proving in the one million, yeah. Okay. So I figured it was from the video yesterday just because if for those that haven't seen the video that I did yesterday on Citadel, essentially it was just a, I was just fucking around because I can't help but find the the whole thing pretty,",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 99,
      "start_timestamp": "01:55:58",
      "start_timestamp_seconds": 6958.141414141413,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=6958"
    }
  },
  {
    "text": "one million, yeah. Okay. So I figured it was from the video yesterday just because if for those that haven't seen the video that I did yesterday on Citadel, essentially it was just a, I was just fucking around because I can't help but find the the whole thing pretty, pretty hilarious. But yeah. Thank you, Zedrick. That stuff's honestly, it's helpful for me to know at least that, that's something like that is going on because I've already told you guys and I tell people this like pretty regularly, like I literally consume essentially no, no financial media. Like I read news and stuff that comes up, but I don't really consume any financial media. I kind of just do my own shit. Tedrick says sarcasm for 10 minutes straight, pretty impressed. Yeah, it's well for me to riff like that is just the norm. I don't script any of my videos. So yeah, the videos, like that one, I kind of knew what I wanted to talk about, obviously in the context. And but it wasn't planned to be a full, a full video of just sarcasm and satire. It didn't really wasn't. I just kind of started with it. And then the next joke and framing kind of kept rolling. I just kept going with it until it stopped essentially. I'm not going to lie though. I thought the ending was pretty funny though. That's probably my favorite part of that video. Joey says no squawk box,",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 99,
      "start_timestamp": "01:57:37",
      "start_timestamp_seconds": 7057.543434343434,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=7057"
    }
  },
  {
    "text": "with it. And then the next joke and framing kind of kept rolling. I just kept going with it until it stopped essentially. I'm not going to lie though. I thought the ending was pretty funny though. That's probably my favorite part of that video. Joey says no squawk box, no squawk box. Nope. Ben Zinga has one, but I don't listen to it. It doesn't matter to me. Like that's not that's not the way that I trade. So catching news as soon as it's happening to try to play those really short term moves, it's not so much my style. Again, what I do is very conditions based. So if there's something that's getting caught in the news that then hits my radar, I'll typically be a little bit late to it. But that's just kind of how it goes. I don't mind. I'm not trying to top tick or bottom tick everything. Joyce says I have no idea what a squawk box is actually. So it used to be these literally like a box. It was like those conference call tools, but it was always on. And so people would have it on the floor. And then they would have the other end like wherever their office is for their firm. So then it's essentially an open line of communication between the floor and use. So you can hear what's going on, although you're not there. So that's the idea behind a squawk box. It's just for",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 99,
      "start_timestamp": "01:59:16",
      "start_timestamp_seconds": 7156.945454545455,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=7156"
    }
  },
  {
    "text": "they would have the other end like wherever their office is for their firm. So then it's essentially an open line of communication between the floor and use. So you can hear what's going on, although you're not there. So that's the idea behind a squawk box. It's just for essentially the flow of information. Troll box. That's more. Tommy, I think that's more accurate. I like that one better. The troll box. All right. Next question here is what resources, books, courses, mentors had the most significant impact on your development options as a strategic investor for sure. And then Nate and Berg's book probably. And then you and books after that, at least from a fundamental understanding of things. And then I think oh, Sean, is he's book was good. I think. Yeah. I think that's most of like what have had the most significant impact because I'm at a point my trading career where it's incremental gains. Like I have to put in multiple hours of effort to learn like one new unit of information. That's like, you know, really dense information of sorts. So what I do now is is a lot different now, but it's not efficient. It can't be efficient at this point. It kind of is what it is. How do you recommend new traders filter through overwhelming amount of information? This is hilarious because this is literally why I built this for you. Let me grab it. This here. And again, this",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 99,
      "start_timestamp": "02:00:56",
      "start_timestamp_seconds": 7256.347474747474,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=7256"
    }
  },
  {
    "text": "not efficient. It can't be efficient at this point. It kind of is what it is. How do you recommend new traders filter through overwhelming amount of information? This is hilarious because this is literally why I built this for you. Let me grab it. This here. And again, this isn't like an end to end thing, but it's a starting point. So the short answer to this is I think the way for new traders to filter through the amount of information that's there is actually to create a syllabus for yourself. And then from that syllabus, I would just make sure that it makes sense. You can use literally a book like options as a strategic investment as your basis for your syllabus. And you can create a learning path for yourself. When I try to remind people when it comes to learning anything that you learn in school, there's normally a very defined path. There's test quizzes, projects, stuff like that homework. And there's none of that in trading. Most people just kind of go off and, you know, go forth and do their best or whatever the case is. And I actually think that's a pretty big mistake. I think that when we try to learn like that, it's very circuitous. We just go around and fucking circles. We learn a little bit here. I call it movement for the sake of movement because you might look at a lot of stuff. You might do a",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 99,
      "start_timestamp": "02:02:35",
      "start_timestamp_seconds": 7355.749494949495,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=7355"
    }
  },
  {
    "text": "big mistake. I think that when we try to learn like that, it's very circuitous. We just go around and fucking circles. We learn a little bit here. I call it movement for the sake of movement because you might look at a lot of stuff. You might do a lot of stuff, but it doesn't mean that you're actually like deriving a lot of value from all that stuff. So yeah, that's essentially how I would filter through things is I would just be very purposeful with the learning steps. And again, you can use a book like options as a strategic investment. You can use the link that I dropped there. But just just think of how you learn in school and create that or learning options. It's kind of like the same thing. How is your trading style evolved to adapt to recent market changes such as the rise of meme stocks and zero DTE options trading? That's funny. So zero DTEs I trade. Most people know the the size and stuff that I do in zero DTEs is is not a significant part of the account value though. And zero DTEs continue to be a decent return. But there are like it's for me at least I'm not going to be making buckets of money trading zero DTEs is just not how my strategy works with it. And the way that I trade it continues to evolve you guys have already seen some of those changes",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 99,
      "start_timestamp": "02:04:15",
      "start_timestamp_seconds": 7455.151515151514,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=7455"
    }
  },
  {
    "text": "return. But there are like it's for me at least I'm not going to be making buckets of money trading zero DTEs is just not how my strategy works with it. And the way that I trade it continues to evolve you guys have already seen some of those changes over the last couple years where I used to very heavily favor straddles and now I favor strangles. And there's those kinds of pieces that will continue to evolve as I understand more and how markets move with respect to the to the phenomenon or in this case your DTEs. Memestock's that's easy. I just trade the movement. And you know, obviously I'm way deeper into meme stocks now mostly to participate with you. But meme stocks for me are still a very small part of what I do in my total portfolio. It's by yeah, by and large a really small component of my speculative allocations. I tend to trade things again that are kind of conditions based that look interesting to me. The AdWriner says every course is for ADD people literally skipping around every subject in course. Or in city says there should be an options course for ADD and dyslexic people. That's funny. I think the problem is honestly if you have ADD and if if somebody is afflicted with ADD and or dyslexia like options trading is probably not for you. Like there's just the that's the God on a truth. And it's because there's",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 99,
      "start_timestamp": "02:05:54",
      "start_timestamp_seconds": 7554.553535353534,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=7554"
    }
  },
  {
    "text": "for ADD and dyslexic people. That's funny. I think the problem is honestly if you have ADD and if if somebody is afflicted with ADD and or dyslexia like options trading is probably not for you. Like there's just the that's the God on a truth. And it's because there's a lot of fucking details. And if you're not good at staying focused in like managing the details, it's not it's just not a good it's not a good fit. It's like the same thing is somebody like I might like the idea of being a fucking ballerina. But I don't know like I probably wouldn't be very good at it especially with my fucked up back right now. I don't necessarily have the physical setup to be a ballerina. It's like the same thing. You kind of have to find stuff that align with your personality and individuality because that's the reality. You can see you can see a lot of you know my tendencies a lot of you have watched me on these live streams for enough now to have a pretty good feel. But I'm very very much obsessive. I am somewhat detail oriented. I'm detail oriented on the stuff that I think matters to be detail oriented. And then a lot of stuff I'm not detail. It is highly variable. So like those kind of tendencies translate pretty well to the market. So yeah. Six is what training technology or tools do you consider essential for",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 99,
      "start_timestamp": "02:07:33",
      "start_timestamp_seconds": 7653.955555555555,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=7653"
    }
  },
  {
    "text": "on the stuff that I think matters to be detail oriented. And then a lot of stuff I'm not detail. It is highly variable. So like those kind of tendencies translate pretty well to the market. So yeah. Six is what training technology or tools do you consider essential for a trader? Excel. Excel or Google Sheets. That's what's essential. Think scripting doesn't matter. You can literally use chat GPT for most of it. Yeah. Some sort of tracking Excel slash Google Sheet and then a trading platform. Like that's literally all you need. You don't need a bunch of other shit. Other data sources can be good. They can be useful. I like some of them. But especially in the beginning, it's kind of like when you watch. If you watch people that are really good at something, they tend to have like stuff that works. So for example in Jujitsu, most black belts will have these old, ratty-ass black belts. And it's just because the belt does what it does. And it's also a status symbol to show that the belt has a lot of wear and tear on it. But you'll notice that a lot of people when they first start something new, is they go get all the best new shit that they can find even though the skill set's not there. So in this, the skill set is not dependent on any of that shit. So I would start very basic. Um. That Lauren says.",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 99,
      "start_timestamp": "02:09:13",
      "start_timestamp_seconds": 7753.3575757575745,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=7753"
    }
  },
  {
    "text": "when they first start something new, is they go get all the best new shit that they can find even though the skill set's not there. So in this, the skill set is not dependent on any of that shit. So I would start very basic. Um. That Lauren says. I'm ADHD. And once I get all the details of something I'm extremely successful, it's just that it takes me longer to learn the details. Yeah. So for something like ADHD with that set, I think you just have to figure out then what the learning process is. Because here's the other thing. Is I think modern day society, one, we like, for example, if somebody has ADHD, the first thing I would do is say you get literally no social media. There's no social media for you. You don't get Instagram, you don't get YouTube shorts, you don't get TikTok, you get none of that. And I think that it's because it massively contributes to it. Then I think it's starting to reel back the underlying behavior because I think we overdiagnosed stuff like ADD and ADHD. I really do. Because I think like I have trouble focusing. Maybe it's not, you know, a chemical imbalance or stuff like that. And I'm not saying that it doesn't exist. But I absolutely think that we live in a society that leads to those tendencies. And then I think we overdiagnosed those tendencies. So if a trader has something like attention",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 99,
      "start_timestamp": "02:10:52",
      "start_timestamp_seconds": 7852.759595959596,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=7852"
    }
  },
  {
    "text": "it's not, you know, a chemical imbalance or stuff like that. And I'm not saying that it doesn't exist. But I absolutely think that we live in a society that leads to those tendencies. And then I think we overdiagnosed those tendencies. So if a trader has something like attention deficit, hyperactive, I don't care so much about. But if somebody is attention deficit, the markets are a bad place to be attention deficit. You have to have attention. And you have to have to attention that can be essentially like held for long durations of time, even through very uninteresting or non-moving components. That's just a general mismatch to me. Now again, I would jokingly say I have ADD or ADHD as well. But in a reality, I can fully control my focus. It's just not always easy. The there's a period that's very easy if you're in like a flow state. But most of the work that I do is not in a flow state. Most of the work that I do is really, really thoughtful, dedicated time to sit down and learn something. And I literally create an architecture for me to do so. It's one of the reasons why I have a standing desk is you'll see me even during the live sessions that are a couple hours long. Part of it is because my back hurts. But I'll sit down, stand up, sit down, stand up. Like I will move during it because those changes",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 99,
      "start_timestamp": "02:12:32",
      "start_timestamp_seconds": 7952.161616161616,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=7952"
    }
  },
  {
    "text": "the reasons why I have a standing desk is you'll see me even during the live sessions that are a couple hours long. Part of it is because my back hurts. But I'll sit down, stand up, sit down, stand up. Like I will move during it because those changes of pace help refresh my mental clock. I also set very specific work and break windows for myself based on a lot of human lab protocols. I don't dis purposely disrupt a flow state. But I respect when I go through periods where I'm effective versus ineffectual. And if I notice myself being ineffectual, I have to differentiate. Is it because of a lack of discipline? And I'm being lazy and easily distracted because I'm not being disciplined or am I literally cognitively fatigued? And I need that 10 minute rest period to go do something else to refresh my mental perspective to then come back into another bout of very focused work. So again, I think a lot of people would just summarize, and I'm not saying you Lauren, I'm just talking about this in general generalities. But I think a lot of people would just quickly summarize a difficulty in focusing to something like 80, 80, 80, HD versus applying the rigorous process to try and be focused because yeah, like it's really difficult to focus on a lot of this stuff for a lot of people. So Jonathan Colors says, what are some of the non obvious",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 99,
      "start_timestamp": "02:14:11",
      "start_timestamp_seconds": 8051.563636363636,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=8051"
    }
  },
  {
    "text": "difficulty in focusing to something like 80, 80, 80, HD versus applying the rigorous process to try and be focused because yeah, like it's really difficult to focus on a lot of this stuff for a lot of people. So Jonathan Colors says, what are some of the non obvious dangers of a 20 strike GME leap considering the options are as cheap as they've been since the late 2020s. Obviously being sideways forever or as cheap as they've been, I don't know what that means. What does that mean? I don't really know what that means. Obviously, I understand that the inference, but I'm saying from like a broader perspective. I'm grabbing a video for you. So this video is about buying call options smarter. It's literally for the meme stock slash ape crowd. So you can check that out. But yeah, off Putin says Newton talking about options could be dangerous. Yeah, he texted me. I don't know what did he say in his video? Because I don't want to go into detail on what he and I spoke about unless he already talked about this stuff. So what what did he say? I haven't seen his video. What did he say in the video about options? It looks like Jonathan had had watched it. Nada. Well, anyways, let me know what it was because obviously I'm happy to talk about it, but I just don't want to low IV, I believe. Okay, let's see. So IVP implied",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 99,
      "start_timestamp": "02:15:50",
      "start_timestamp_seconds": 8150.965656565656,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=8150"
    }
  },
  {
    "text": "What did he say in the video about options? It looks like Jonathan had had watched it. Nada. Well, anyways, let me know what it was because obviously I'm happy to talk about it, but I just don't want to low IV, I believe. Okay, let's see. So IVP implied volatility percentile is no. Yeah, that's like that's accurate. I would call that accurate. And then if we're going back to 2020, we need a five year daily. So yeah, I think it's okay to say that. I think on a longer term time frame, the implied volatility is relatively cheap. I think in general, the implied volatilities are, well, implied volatility in something like GameStop is typically very high, just in general. So like here, those 17 Jan 25s are actually relatively expensive compared to the 17 April, 25s, which are about like double the duration. So like the 17 Jan's are expensive on a relative basis. Now again, it doesn't really matter quite that much, but it's one of those things that I would just acknowledge when putting on the trade and just kind of take it for what it is, right? Like, I am willingly paying a little more for this overall, for this overall expiration cycle, because I like it or for whatever reason on a relative basis compared to, you know, vol. But yeah, no, I think, Jonathan, I think what you're saying for whatever Newton was talking about in terms of the cost, I",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 99,
      "start_timestamp": "02:17:30",
      "start_timestamp_seconds": 8250.367676767675,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=8250"
    }
  },
  {
    "text": "little more for this overall, for this overall expiration cycle, because I like it or for whatever reason on a relative basis compared to, you know, vol. But yeah, no, I think, Jonathan, I think what you're saying for whatever Newton was talking about in terms of the cost, I completely agree. Overall, vol is pretty cheap. The problem is is like buying when volatility cheap is not, that's not the move. I wouldn't base it off that at all. You have to remember, volatility is movement. If you buy a call, they make money when it moves. So unless you are structuring a very specific trade to take advantage on the movement of volatility, something like horizontal spread, like a calendar of some sort, or if you're trying to trade like volatility in and of itself, then making the buy decision off of vol is miss, it's really misleading. And the reason is because let's take a look. Cedric says, but what if IV is mispriced? It's not. Yeah, so you don't even have to worry about that. So if we take a look at something like, and to be clear, this is, if I wanted to buy options in something like GameStop, I would go out about 90 days too. I'm not, I'm not shitting on the idea at all. I think this is about exactly where I would go. And it's just because of the way that I buy options. Again, it's in that video that I",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 99,
      "start_timestamp": "02:19:09",
      "start_timestamp_seconds": 8349.769696969697,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=8349"
    }
  },
  {
    "text": "in something like GameStop, I would go out about 90 days too. I'm not, I'm not shitting on the idea at all. I think this is about exactly where I would go. And it's just because of the way that I buy options. Again, it's in that video that I shared up above there. And the 20s, the main issue I have with those is that they're all extrinsic value. Not all. That's kind of dramatic, but it's very, very heavy extrinsic value. Rowan Titty says they were talking leaves January of 26. Oh, shit, I missed that. Sorry. Yeah, it's a lot of extrinsic value. I personally wouldn't like that too much. I would either take a slightly lower, I would take a slightly lower delta, maintain the gamma, take all the extrinsic value and it'd be cheaper. But yeah, for me, this is where I would go. Is something much closer in time. And I wouldn't, I would either decide if I'm going to be slightly out of the money and take like a 50 delta, that's all extrinsic value, but still would be a 50 delta. Or do I want to go slightly further in the money and scrub off a lot of this extrinsic value? Because the problem is is when volatility is low, it means the stock is not moving. And like, there's a reason why it's low. So when stock is low, when volatility is low, buying options can seem more lucrative from a",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 99,
      "start_timestamp": "02:20:49",
      "start_timestamp_seconds": 8449.171717171715,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=8449"
    }
  },
  {
    "text": "and scrub off a lot of this extrinsic value? Because the problem is is when volatility is low, it means the stock is not moving. And like, there's a reason why it's low. So when stock is low, when volatility is low, buying options can seem more lucrative from a volatility perspective. But again, it goes back to the profit mechanism. The primary profit mechanism when you buy a call is stock go up. That's the primary profit mechanism. It's not volatility go up. Volatility go up can help you a little bit, but that's not going to be the thing that really moves the needle on the trade. So I would just make sure that you like a trade is structured in the context of the profit mechanism that you're trying to play. Gibb says, I've learned that a debit spread is pretty useless when the stock doesn't move. But credit spreads seem to be good unless the stock price goes down. I think that's mostly just of general, like your, yes, for the debit spread, that's correct. Debit spreads are going to want movement. And credit spreads are going to want less movement. I assume you're talking about verticals here. But I wouldn't characterize them the way you are personally. I think that you're characterizing the strategies a little bit wrong by saying like debit spreads didn't work out. Right. It's not, it's not debit spreads not working out. It's the profit mechanism that didn't work out. So",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 99,
      "start_timestamp": "02:22:28",
      "start_timestamp_seconds": 8548.573737373737,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=8548"
    }
  },
  {
    "text": "verticals here. But I wouldn't characterize them the way you are personally. I think that you're characterizing the strategies a little bit wrong by saying like debit spreads didn't work out. Right. It's not, it's not debit spreads not working out. It's the profit mechanism that didn't work out. So I, yeah, I would just be, be clear on that. Rointitty says, why do people buy deep in the money leaps instead of just buying the shares? Leverage. Rointitty, come on, man, tell me, tell me you didn't watch this video by telling me you didn't watch this video. I'm a link to it again. Right there. It's entirely for leverage. It's the same thing that we learn from tails from 350 PC. It's the same thing he did. That's why he bought a call because he couldn't afford the presses. Damn, Titty. You know, I can't be mad at you. Last couple of things. What's the biggest shift you've seen in the market since you started in 2007? Oh, liquidity has gone up massively. There's a lot more volatility. And the edge in a lot of things that I used to trade is definitely contracted without a doubt. So yeah, I think that's mostly it. Where do you see your trading career headed in the next five years? Fuck if I know. And are there new markets or strategies you're excited to explore? Fuck. I didn't realize that I'm getting like fucking deep questions here. Um, shit, I don't",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 99,
      "start_timestamp": "02:24:07",
      "start_timestamp_seconds": 8647.975757575758,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=8647"
    }
  },
  {
    "text": "yeah, I think that's mostly it. Where do you see your trading career headed in the next five years? Fuck if I know. And are there new markets or strategies you're excited to explore? Fuck. I didn't realize that I'm getting like fucking deep questions here. Um, shit, I don't know. Next five years, I expect to continue trading, unless I make a massive error at some point, which is not beyond me. That's for sure. And there's not really any new strategies that I'm excited to explore. I guess they're like exploring something like event markets. That's kind of interesting to me. I'm generally excited about that. But I mean beyond that, not so much. Like most of what I do is it's the same stuff. That's actually why I have the time now to sit here and dive into game stop and, you know, stuff like that because it's kind of like side quests, right? Like at this point in my trading career, I know what I'm capable of producing. And I'm fortunate enough that I continue to produce it. Like every single year, I've had two negative years, my entire trading career. And who knows when the next one is going to be, hopefully it's not going to be there. But I don't expect it to be there based on the way that I trade. But I never know. So the way that I trade now is very different in the context of like my goals are",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 99,
      "start_timestamp": "02:25:47",
      "start_timestamp_seconds": 8747.377777777776,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=8747"
    }
  },
  {
    "text": "next one is going to be, hopefully it's not going to be there. But I don't expect it to be there based on the way that I trade. But I never know. So the way that I trade now is very different in the context of like my goals are different. My goals in the beginning were to aggressively grow my account. So I would be very aggressive with positioning for quite, quite some time. And that's not so much the case anymore. I mean, I'm very open about what my annual return targets are. But I've already talked about this conundrum I found myself in. Where last year was my best trading year that I've ever had. And this year is not going to be my best trading year. But it is overwhelmingly looking like it's going to be over a 50 year, I think. Because the last time we did the end of September, portfolio percent return breakdown. I don't know, I don't know if I did this on the main channel or on the Patreon. I don't remember. But the cliff notes version for that is the portfolio at that point was up 46.3 on the year. So I find myself in this really strange scenario where I'm not actually trying to have these larger returns. But the way that I'm trading is continuing to identify them. So I'm just kind of trading opportunities as they continue to pop up. So that's kind of the way I",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 99,
      "start_timestamp": "02:27:26",
      "start_timestamp_seconds": 8846.779797979798,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=8846"
    }
  },
  {
    "text": "So I find myself in this really strange scenario where I'm not actually trying to have these larger returns. But the way that I'm trading is continuing to identify them. So I'm just kind of trading opportunities as they continue to pop up. So that's kind of the way I expect to continue trading. The only thing I have to be really, really careful about is not overextending myself. And that's easy to do. I'm pretty good at monitoring the total risk. And that's actually one of the things I was just talking with a buddy about yesterday that one of my game plans is to one of my game plans is to actually start modifying the number of positions I have in the portfolio a little bit and like sizing them down. Just to decrease no like number of positions and stuff like that to decrease total risk. But yeah, that's kind of it. I don't really see a bunch of massive changes coming down the pike. Maybe starting to add a little bit more income strategies potentially. Not like super jazzed on that though. I'd rather just make money. And then with draw money as compared to like trading income strategies. But we'll see. Give treaty says I limited the upside debit spread because the spread is cheaper than buying the call. Yep, that makes sense. Colonel says, have you traded crypto? Definitely. I don't really trade crypto that much. It's more of like buying hold and staking.",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 99,
      "start_timestamp": "02:29:06",
      "start_timestamp_seconds": 8946.181818181818,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=8946"
    }
  },
  {
    "text": "trading income strategies. But we'll see. Give treaty says I limited the upside debit spread because the spread is cheaper than buying the call. Yep, that makes sense. Colonel says, have you traded crypto? Definitely. I don't really trade crypto that much. It's more of like buying hold and staking. But yeah, I've been involved in crypto for a while. I actually made a bunch of money off of Bitcoin in the mid teens like 20, I forgot what year. But it was like between 2010 and 2020 was somewhere like towards the middle there. And I just I ended up getting out way too early like a lot of people because I thought I made decent money on what I put in and I didn't trust it at all. So I've traded it for a while now. But most of what I do now for crypto is kind of just maintain positions. I don't actively trade the coins too much. Although I do trade the futures. And the reason why I do that is just because they have different relationships with other stuff in the portfolio. And they offer the ability to kind of really tailor risk reward to where I want it. So yeah. Mark says, do you know why the net gas D's 24 options are slightly skewed creating a two six to eight. And the 30 delta shore put us 280. Yep. We know exactly why that's happening. So if you take a look at net",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 99,
      "start_timestamp": "02:30:45",
      "start_timestamp_seconds": 9045.583838383838,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=9045"
    }
  },
  {
    "text": "where I want it. So yeah. Mark says, do you know why the net gas D's 24 options are slightly skewed creating a two six to eight. And the 30 delta shore put us 280. Yep. We know exactly why that's happening. So if you take a look at net gas, you're out there in D's, right? So you need to use the Z24 expiration cycle. So right now you're looking at net gas at spot. You need to use the correct contract when you're evaluating the price for the for the future or for the option on the future. So that's why you're seeing that. So realistically that 30 delta short put strike price is 280 relative to this to this three dot 0 5 0. Cool. Well, that's all I got for you guys. Is there anything else that you guys want to talk about real quick before we wrap or anything like that? I still have a few minutes. I have, I mean, my dinner's not going to be here for a little bit. I'm just going to start working on a video once I pop off here. Oh, Thor literally, I hear him outside the door. Hold on. Hold on. Let me get to do. We have fatso tonight. He just had his dinner. So he's fat and happy. I don't want kisses. Is you smell like your food? Although it's very nice. Hello, baby. I'm always curious like when I bring him up here like",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 99,
      "start_timestamp": "02:32:24",
      "start_timestamp_seconds": 9144.985858585858,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=9144"
    }
  },
  {
    "text": "Hold on. Hold on. Let me get to do. We have fatso tonight. He just had his dinner. So he's fat and happy. I don't want kisses. Is you smell like your food? Although it's very nice. Hello, baby. I'm always curious like when I bring him up here like this, like what he actually sees? Like what is he picking up? Other than he's tired. Yo, let's get your pump on. Yeah. He's getting his pump on. It looks kind of like a bike. Little bird. Little little burpee boy. Thoughts on signals on Tesla when cybertaxley actually becomes a thing. Why was the why was the event disappointing? You Last night Tesla had its long anticipated we robot event, the big unveiling event for their upcoming robot taxis. And as you can see from this box, it is 8.8 decline today. Let's just say it didn't go over well. I don't really the the fucking I mean, I respect what he does and I like his little like bored and stuff, but I hate listening to it. I mean, it just seems like the well, it doesn't really make sense. Tommy says cybertaxley just hype and demo market needs concrete. Yeah, but I mean like that that actually surprises me that it would fall almost 9 from that because that for me that would beg the question like what the fuck was the market expecting there to be this like what what were they expecting? This isn't an",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 99,
      "start_timestamp": "02:34:04",
      "start_timestamp_seconds": 9244.387878787878,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=9244"
    }
  },
  {
    "text": "needs concrete. Yeah, but I mean like that that actually surprises me that it would fall almost 9 from that because that for me that would beg the question like what the fuck was the market expecting there to be this like what what were they expecting? This isn't an earnings release. We know that this is a general concept. So like what the fuck? I don't know what they what they thought. It was expecting robot taxis. So what was the actual thing? Is that not what he showed? Again, I didn't watch it. So you guys will have to coach me on a target here. This concept is since 2016. Yeah, I just I still don't get it though. Like I don't understand the 9 drop. It's musk in his wild promises. It will only be here in two years. I mean, musk is I don't know. I am a little bit of a musk fanboy. So musk in his wild promises is probably he delivers on far more of them than I can think of just about anybody else. And he thinks really big. So yeah, I don't really interpret it that way. But let me see. Where is let me go to Tesla. All right, let's see. Is it all music? Damn, like 50 minutes of this thing are here. From supervised full self driving to unsupervised full self driving where the car you could fall asleep and wake up at your destination. Like that's really",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 94,
      "total_chunks": 99,
      "start_timestamp": "02:35:43",
      "start_timestamp_seconds": 9343.789898989899,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=9343"
    }
  },
  {
    "text": "Where is let me go to Tesla. All right, let's see. Is it all music? Damn, like 50 minutes of this thing are here. From supervised full self driving to unsupervised full self driving where the car you could fall asleep and wake up at your destination. Like that's really cool. But there's also a challenge for a lot of people that cars cost too much. I mean, when you fact, I think the cost of autonomous transport will be so low that you can think of it like individualized mass transit. The average cost of a bus per mile per city. Sorry, I don't want to be yes, yes, yes, all our cars are basically all cars that we make. So one of the things that is really interesting is how will this affect the cities that we live in? You can have your own personal. This looks so cool. These things are, I mean, this is insane. This is why I actually really, really rever Elon Musk is because like he's moving at a pace that just about nobody else can with this shit. So it's like, I don't know, I have a ton of respect for what he's doing and his ability to move stuff. Yeah, I don't know. It's fucking incredible. I can't just think of what nobody else is doing any of this shit. That's the reality. There's so far fucking behind. And he's not even necessarily super close to it. He's talking about concepts",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 95,
      "total_chunks": 99,
      "start_timestamp": "02:37:23",
      "start_timestamp_seconds": 9443.191919191919,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=9443"
    }
  },
  {
    "text": "he's doing and his ability to move stuff. Yeah, I don't know. It's fucking incredible. I can't just think of what nobody else is doing any of this shit. That's the reality. There's so far fucking behind. And he's not even necessarily super close to it. He's talking about concepts here, but still. He's so far fucking ahead of everybody. And everybody has the ability to compete with him, right? Like there's a lot of big companies. But even if you look at Bezos and what they're trying to do with what? Blue origin? Like they're so far behind. It's, it's, I don't want to say it's comical. That's kind of dramatic. But it is they're very, very far behind, which I don't know. Like it, I think it puts Musk in such a, such a different atmosphere. So yeah. It's an equal thought. If Tesla had the goods, they wouldn't hold that to leave it. No, they're smart. They're super smart. It's, it's very, very smart to do stuff like this. It's the same reason why Apple does shut like this. Like building hype and stuff like that is is a massive part of drumming up interest. So yeah, I mean, I think, I think it makes a ton of sense. And it also makes sense to talk about the vision of things so that people know like where your head's at, where you're trying to go with things. That kind of stuff, I think matters a lot, especially",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 96,
      "total_chunks": 99,
      "start_timestamp": "02:39:02",
      "start_timestamp_seconds": 9542.593939393939,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=9542"
    }
  },
  {
    "text": "I mean, I think, I think it makes a ton of sense. And it also makes sense to talk about the vision of things so that people know like where your head's at, where you're trying to go with things. That kind of stuff, I think matters a lot, especially when you're trying to, he's making quite literally world changing stuff. Starlink is a complete game changer. And that's nothing that Musk needed to do. A lot of other people could have done starlink. It's not a crazy concept, but Musk did it. And he did it really well. So I look at a lot of stuff that what he does is it's just insane. It's absolutely incredible. That's what he says people remember Cybertruck being four years late so this could be late. Sure, it could be late. But I don't think that it like the the robot taxi being late matters that much. Again, that's why like when I see the movement today, I just think that's that's really heavily baked in for that kind of drop on something like that. That is the exact kind of that as soon as this starts to base a little bit if it didn't have earnings, I would absolutely play it to the upside because I don't I don't buy that move for a minute. But it's too early to tell because this is where the next low is. So we need to see how it fares in here, which is",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 97,
      "total_chunks": 99,
      "start_timestamp": "02:40:41",
      "start_timestamp_seconds": 9641.995959595959,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=9641"
    }
  },
  {
    "text": "if it didn't have earnings, I would absolutely play it to the upside because I don't I don't buy that move for a minute. But it's too early to tell because this is where the next low is. So we need to see how it fares in here, which is it's too early plus it has earnings coming up. So yeah, interesting find though. I actually need to to watch that a little bit. I'm kind of curious. Cool. All right, gang. Daver apps me up. I'm going to take dog for a walk. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "jcWfEZ8Ol6o",
      "title": "Outlier Options Trading for Beginners Live",
      "url": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o",
      "upload_date": "",
      "duration": 9088.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 98,
      "total_chunks": 99,
      "start_timestamp": "02:42:21",
      "start_timestamp_seconds": 9741.39797979798,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=jcWfEZ8Ol6o&t=9741"
    }
  }
]