[
  {
    "text": "What's up, outliers? Got another email asking to look at DJT again in a couple comments asked if we could look at a few times leading into the election, which makes sense to me happy to do so. And there was actually a couple of things that happened yesterday that I thought were really interesting and I want to talk about it. So first here you can see on the chart, we have spy cues and IWM. And you can see over the last two days, spy has been running slightly negative. IWM has been running negative and cues got a little bit of a bite today and yesterday had a pretty big down day. And then notice DJT, it is up on yesterday hitting new highs and today it's hanging out round about there as well. So what's going on here and why do I find this interesting? Well, it tells us a few things definitively. Now we have a lot of ideas around DJT and how that's behaving and whatnot. But from a broad perspective, this is adding a pretty significant clarifying structure, which is there is pure speculation going on right now and this is being used as speculation to the probability of winning an election. Now I think most people already generally thought that, but the reason why it's so interesting now is that this isn't just following along with general market beta and adding a little bit of spice on top of it. This is",
    "metadata": {
      "video_id": "JkLLg4S1tXk",
      "title": "DJT's Election Surge: Analyzing Market Momentum",
      "url": "https://www.youtube.com/watch?v=JkLLg4S1tXk",
      "upload_date": "",
      "duration": 641.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JkLLg4S1tXk&t=0"
    }
  },
  {
    "text": "as speculation to the probability of winning an election. Now I think most people already generally thought that, but the reason why it's so interesting now is that this isn't just following along with general market beta and adding a little bit of spice on top of it. This is now decoupled slightly in the near term from broad market beta, right? Because you can see on the 17th, spy has hit a high and it's actually been rolling over a little bit here. And if you take a look at the 17th, what's happened in DJT is just going up. So that's interesting. Seeing breakdowns and correlation like that and this now being used quite literally is a speculative measure on election outcome probabilities. Which again, for those that are unfamiliar, you can use prediction markets, things like polymarket to get an idea of what this might look like. So if we go in here, check out the presidential election right now, it's showing about a 64 percent probability of Trump against the 36 percent probability of Harris pretty close. And the reason why I say pretty close is because these relationships can move diverge and converge very quickly. As you can see back here, it was really blown out to the other direction and Harris's narrated quite a bit back and forth. And now we're definitely diverging again right now, but we are not in 90, 10 level. So that part in and of itself is a little",
    "metadata": {
      "video_id": "JkLLg4S1tXk",
      "title": "DJT's Election Surge: Analyzing Market Momentum",
      "url": "https://www.youtube.com/watch?v=JkLLg4S1tXk",
      "upload_date": "",
      "duration": 641.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 10,
      "start_timestamp": "00:01:04",
      "start_timestamp_seconds": 64.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JkLLg4S1tXk&t=64"
    }
  },
  {
    "text": "As you can see back here, it was really blown out to the other direction and Harris's narrated quite a bit back and forth. And now we're definitely diverging again right now, but we are not in 90, 10 level. So that part in and of itself is a little bit interesting to me in terms of just prediction market probabilities. Now a couple notes about prediction markets is they're not perfect. And these are not super liquid markets yet. So if you look at this, there's 2.4 billion in volume. And the reason why it's important to emphasize in volume is because we don't know buys or sales opening, closing trades being moved around. That matters quite a lot. The other thing that I find interesting is that if we take a look at the polls, national polls show Harris with an edge 48.2 percent against Trump at 47. Those are interesting because the polls tend to capture a certain audience and markets tend to capture a different audience. So the truth likely lies somewhere in the middle, which again, we will have to see. Now going back to DJT though, there's a few things that I want to talk about next. So first let's get over to a chart and let's show just where it's hanging out, which again is near highs and it's maintaining this really aggressive volume. The five day and the 20 day average volume has essentially been consistently growing from all the way back",
    "metadata": {
      "video_id": "JkLLg4S1tXk",
      "title": "DJT's Election Surge: Analyzing Market Momentum",
      "url": "https://www.youtube.com/watch?v=JkLLg4S1tXk",
      "upload_date": "",
      "duration": 641.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 10,
      "start_timestamp": "00:02:24",
      "start_timestamp_seconds": 144.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JkLLg4S1tXk&t=144"
    }
  },
  {
    "text": "talk about next. So first let's get over to a chart and let's show just where it's hanging out, which again is near highs and it's maintaining this really aggressive volume. The five day and the 20 day average volume has essentially been consistently growing from all the way back here in the beginning of October, just expanding writ large. And today it's the 20 day average volume is now at 37.6 million shares. The five days all the way up to essential, like 43. So really strong volume and the other thing that's kind of interesting is the lock up period for DJT expired a little while ago. And there's not like this insane sailing volume. There's definitely some likely attributed to that, but not a ton. A couple other things that I note here is look at the volatility. It's continuing to expand even more. So implied volatility right now is 306 percent now. When I did a video on this like two days ago, it was like 300 percent. IV percentiles 98 percent. So it is very, very much just pin near highs. Now if we take a look at average true range for the five days, 7.45 percent. 20 days, 8.3 90 day is 7.43. So the interesting thing that I pick up from here is that we are now getting into a probably very volatile period until we get into the election here. You can look at the expected move on a monthly timeframe, which",
    "metadata": {
      "video_id": "JkLLg4S1tXk",
      "title": "DJT's Election Surge: Analyzing Market Momentum",
      "url": "https://www.youtube.com/watch?v=JkLLg4S1tXk",
      "upload_date": "",
      "duration": 641.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 10,
      "start_timestamp": "00:03:33",
      "start_timestamp_seconds": 213.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JkLLg4S1tXk&t=213"
    }
  },
  {
    "text": "7.45 percent. 20 days, 8.3 90 day is 7.43. So the interesting thing that I pick up from here is that we are now getting into a probably very volatile period until we get into the election here. You can look at the expected move on a monthly timeframe, which is like 88 percent. And same absolute, absolute move. This is likely going to be a binary event, meaning for this stock. If Trump wins, this is likely to get a decent move. But how much of a move is going to be tricky? Because there's going to be a lot of people selling into that move. And if Trump loses, this is probably going to drop like a freaking rock. Because everybody's going to be dumping out. Because it's essentially tripled in value from the middle slash end of September. And there's been very little change in the fundamental picture of this. So this being used as an election proxy is very interesting to me. Now if we pop over to the trade tab, you can see the volatilities around 8 and 15 know of just being astronomically high. I have a position out in 15 know of the reason why I use 15 know of compared to 8 know of is literally just because it's more liquid. The weeklies in this case are still very liquid, but they're still not as liquid as the standard monthly expiration. If you take a look at the 8 November expiration, there's",
    "metadata": {
      "video_id": "JkLLg4S1tXk",
      "title": "DJT's Election Surge: Analyzing Market Momentum",
      "url": "https://www.youtube.com/watch?v=JkLLg4S1tXk",
      "upload_date": "",
      "duration": 641.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 10,
      "start_timestamp": "00:04:45",
      "start_timestamp_seconds": 285.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JkLLg4S1tXk&t=285"
    }
  },
  {
    "text": "reason why I use 15 know of compared to 8 know of is literally just because it's more liquid. The weeklies in this case are still very liquid, but they're still not as liquid as the standard monthly expiration. If you take a look at the 8 November expiration, there's 20,783 calls against 35,000 puts. And if you go to 15 know, it's 156 to 152. So there's lots of people playing this different ways. Now I want to show you another thing that I found, which is over here from unusual whales. And there is a couple really interesting movements this week, one of which is on the 23rd, we can see that there was a couple interesting trades to me. Let's say. So we have a few bids at the 37 calls and we can see some of these are actually pretty large trades near a million dollars over a million dollars. Then we can also see these are longer term up here out in 2026. And these trades are interesting because I don't fully understand what the game plan is here, like why they would go out to 26 for these 20s. But I mean, that's a 2.3 million dollar trade, which is interesting enough. But it's had some really heavy overall premium volume so far this week. And you can see that there's stuff transacting, put side, call side. It's a little bit of a shotgun blast. And I think it's because you're going to see",
    "metadata": {
      "video_id": "JkLLg4S1tXk",
      "title": "DJT's Election Surge: Analyzing Market Momentum",
      "url": "https://www.youtube.com/watch?v=JkLLg4S1tXk",
      "upload_date": "",
      "duration": 641.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 10,
      "start_timestamp": "00:05:57",
      "start_timestamp_seconds": 357.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JkLLg4S1tXk&t=357"
    }
  },
  {
    "text": "2.3 million dollar trade, which is interesting enough. But it's had some really heavy overall premium volume so far this week. And you can see that there's stuff transacting, put side, call side. It's a little bit of a shotgun blast. And I think it's because you're going to see two very different things going on here. There's going to be people trading DJT as a directional thesis for what's going to happen with the election. Again, either upside or downside. But the other thing that you're going to see here are people using DJT as a hedge for the rest of their portfolio. Again, depending on what they think may or may not happen going through the election. So the fact that there's this stock that is being used in a lot of different ways around this binary event. And let's go back to the fact that the stock is not really designed to be an election proxy. So there's going to be fascinating movement that comes from this literally because of those reasons. Now leading into the rest of the election, the question to me becomes, where does this go? How high is reasonable for this based on again, no change in fundamentals and how much how much FOMO is going to lead to people dumping into more of this because I had originally started scaling in just a little bit based on some of these really large average daily range breakouts. And I'm just holding a small",
    "metadata": {
      "video_id": "JkLLg4S1tXk",
      "title": "DJT's Election Surge: Analyzing Market Momentum",
      "url": "https://www.youtube.com/watch?v=JkLLg4S1tXk",
      "upload_date": "",
      "duration": 641.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 10,
      "start_timestamp": "00:07:13",
      "start_timestamp_seconds": 433.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JkLLg4S1tXk&t=433"
    }
  },
  {
    "text": "again, no change in fundamentals and how much how much FOMO is going to lead to people dumping into more of this because I had originally started scaling in just a little bit based on some of these really large average daily range breakouts. And I'm just holding a small position to kind of follow through with it. But I'm sitting here left wondering, I just how far does this run into the election? It's coming up pretty soon. So I have to imagine we're getting near where this might land. But options can help us understand that. So if we go to the Analyze tab and we go to the probability analysis, take a look at this skew, right? So normally you would see this as more of a normal distribution. But this is obviously very, very skewed all the way out here to the downside. But in the near term, it's actually skewed a little bit to the upside. So if we take a look at, let's say over the next week, let's take a look at the probability of a touch. It has a, and this is a one-stand deviation move. So it's going to use around a 16 probability. And as a 16 probability of being all the way out to 60 or 17. So the upside skew potential in this is massive, which is why people like me who don't really care to use this as it's being used right now are still willing to",
    "metadata": {
      "video_id": "JkLLg4S1tXk",
      "title": "DJT's Election Surge: Analyzing Market Momentum",
      "url": "https://www.youtube.com/watch?v=JkLLg4S1tXk",
      "upload_date": "",
      "duration": 641.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 10,
      "start_timestamp": "00:08:17",
      "start_timestamp_seconds": 497.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JkLLg4S1tXk&t=497"
    }
  },
  {
    "text": "a 16 probability. And as a 16 probability of being all the way out to 60 or 17. So the upside skew potential in this is massive, which is why people like me who don't really care to use this as it's being used right now are still willing to speculate. And it's because of this skew and probabilities. So this thing is going to be on wheels coming up without a doubt. And look at the compression around like the 43 probability range and stuff like that. It is just really, really crunch down 300 vol will do that. But again, you can see essentially out, let's see when this starts to flip over. Because all the way out here so far to 60 days, there's still definitely upside skew and it's only because it can only go down so far. But then it starts to really peak and roll back over, which I again, I just find that generally interesting based on the overall perception of what we might see coming into the election. So looks like volatility is the name of the game going forward. We will see what this looks like as always anything you want me to take a look at. Let me know. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "JkLLg4S1tXk",
      "title": "DJT's Election Surge: Analyzing Market Momentum",
      "url": "https://www.youtube.com/watch?v=JkLLg4S1tXk",
      "upload_date": "",
      "duration": 641.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 10,
      "start_timestamp": "00:09:24",
      "start_timestamp_seconds": 564.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JkLLg4S1tXk&t=564"
    }
  },
  {
    "text": "me to take a look at. Let me know. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "JkLLg4S1tXk",
      "title": "DJT's Election Surge: Analyzing Market Momentum",
      "url": "https://www.youtube.com/watch?v=JkLLg4S1tXk",
      "upload_date": "",
      "duration": 641.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 10,
      "start_timestamp": "00:10:36",
      "start_timestamp_seconds": 636.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JkLLg4S1tXk&t=636"
    }
  }
]