[
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "you you you you you you you you you you you you what's up, Alley, I was happy Friday. Today we have a very fun conversation queue up. This is born from a recent podcast and I just released with a Augustine LeBron. For those that don't know, Augustine LeBron is the gentleman that wrote the book Laws of Trading, which is a really cool way to think about markets and trading in general. It talks a lot about how we can view the world through the lens of like trading. And most things that you do legitimately are a trade. So his book is interesting. I've read it before it. I even connected with him on acts or anything like that. I thought it was completely fine. From a practitioner's lens, it's a little bit higher level, which again is okay. But a lot of newer traders when they're reading stuff like that, they're hoping to find do this. Again, you kind of have to train yourself out of that expectation. Now, when that video came out, there have been a handful of fairly spicy comments. And I want to talk about them because it's like really, really, really useful context. So let's do this. I'm going to grab a screenshot from the comments. And then I want to walk through this conversation. The title of the stream is very purposeful. It's very, very purposeful. Because there is a huge gap between what you might want in trading versus",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 244.0,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "useful context. So let's do this. I'm going to grab a screenshot from the comments. And then I want to walk through this conversation. The title of the stream is very purposeful. It's very, very purposeful. Because there is a huge gap between what you might want in trading versus what is in trading. Might sound as so-tarric. It's not that complex. What I mean, most traders come into this game, and they say something, they say something like this. They'll sit down and look their bank account. And they'll say, I want to make money. After they make their money, they'll say things like, I don't know. No. Out to code or program. So I don't want to do that. They want huge returns, all at 30% plus or year. They want low, piano, volatility, meaning most people, as you talk through what their drawdown tolerances are, you find that they're way more sensitive to drawdowns than they might think. I actually come across this in coaching a lot, like a lot a lot, where people will say, I want a 30% return. Well, what kind of portfolio volatility are you okay with? Oh, I don't, these are legitimate answers. I will hear things like, I don't want to lose more than 10% or even 15%. That's real fucking tough. And that is a massive mismatch in expectations, versus what this thing likely looks like. But the other things that traders often want. So they want cheap trades. They",
    "start_timestamp_seconds": 214.0,
    "end_timestamp_seconds": 374.08,
    "start_timestamp": "03:34",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=214",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "answers. I will hear things like, I don't want to lose more than 10% or even 15%. That's real fucking tough. And that is a massive mismatch in expectations, versus what this thing likely looks like. But the other things that traders often want. So they want cheap trades. They want to limit their risk. They want to have high win rates. They want it. What a world. Literally completely froze up. We're going to have to figure out this internet thing. Sorry about that guys. This whole whole fucking I I the last couple days have been awful with this. I don't know what it is. I might just need to do like a complete restart. I was literally just looking at getting a new modem as well. I don't know if that's part of the problem. But yeah, where do we leave off? The main stuff that I was trying to list with you guys are the common things that people want in their trading. And there's also stuff like this, right? Like they want it. They want it to be simple. And then I was asking if there's anything here that I'm missing that you guys can think of off the top of your head. Here's the problem. This is a lot like a lot a lot of wants. This is a ton of wants. We want all that's a great point. Bend super, super great point. We want something mechanical. Programmatic. Great point. It's a ton",
    "start_timestamp_seconds": 346.0,
    "end_timestamp_seconds": 477.84,
    "start_timestamp": "05:46",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=346",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "think of off the top of your head. Here's the problem. This is a lot like a lot a lot of wants. This is a ton of wants. We want all that's a great point. Bend super, super great point. We want something mechanical. Programmatic. Great point. It's a ton of shit. This is a ton of stuff to want from a single thing. Not only do they traders typically want all of this, but they're walking into this at the very beginning pieces of their trading career, which means that they might not necessarily know a ton yet. And that leads to a lot of upsetting things as you go through create as you go through trading. One of the ones that a lot of you might be familiar with is that of rolling options. When traders realize that rolling options really doesn't even mean anything, it's kind of like a piece of their soul gets murdered. And it's because they want to believe that there's this cool little thing that will help them make money. Rightfully so, I do not blame them for wanting that. The issue is again, it doesn't represent reality. Well, at all, we're really at all. That leads to our next point, which is grabbing that screenshot. And I want to talk through this specific example with respect to spreads. That's what this conversation was. Don't think my screenshot saves. Let me take it. That really. All right. So we have that one. We",
    "start_timestamp_seconds": 441.96,
    "end_timestamp_seconds": 580.72,
    "start_timestamp": "07:21",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=441",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "at all. That leads to our next point, which is grabbing that screenshot. And I want to talk through this specific example with respect to spreads. That's what this conversation was. Don't think my screenshot saves. Let me take it. That really. All right. So we have that one. We have this one. Again, this is a scenario where I actually do my best to like interact with the community and to share information. Let's take a look at these. We'll start with this one. This is the top of the comment chain. And jungle cat says when you sell a credit spread, the losing wing massively reduces the margin impact. He's basically suggesting to sell naked options, which is a huge waste of buying power. Tell us you don't understand options without telling us you don't understand options, which is, again, it, I was actually talking to my wife about this last night. How laughable it actually is with how confident people can be in their own knowledge. And it's like abundantly clear that they're actually quite ignorant. It's okay to be ignorant. And it's okay to not know stuff. There's, I don't know tons of shit. But I really think that it's a very dangerous trait when you start to like really believe that you're infallible. And I can even get like that sometimes with something that like I still have this deeper to belief in. But I do my best to be aware of it because it's",
    "start_timestamp_seconds": 541.84,
    "end_timestamp_seconds": 664.84,
    "start_timestamp": "09:01",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=541",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "really think that it's a very dangerous trait when you start to like really believe that you're infallible. And I can even get like that sometimes with something that like I still have this deeper to belief in. But I do my best to be aware of it because it's super damaging. And here's the thing. Let's dissect what's going on in this situation. Jungle Cap is Bend puts it perfectly, confidently wrong. That's exactly what it is. What they're saying is waste of buying power and because that they're inferring to use naked options, then that equals don't no options. Curious, let's take a, literally, let's take a listen to the clip together. I don't know if that was from a short or, it was from a short, that's perfect. So this will even take order. Yeah. All right. There you go. So this is the YouTube short that they came across and commented on. And let me share my audio. You guys should hear as we go along. Here we go. Here we go. Here we go. Here we go. Yeah, of options strategies. As there's ultimate public is like batshit crazy. And I'll tell you why. Okay. Like the whole thing about options and options strategies is that this is a linear operation. So like you cannot take two losing trades and some them and turn it into a winning trade. So like if whatever complex strategy you've come up with is a profitable trade, then at",
    "start_timestamp_seconds": 650.16,
    "end_timestamp_seconds": 760.72,
    "start_timestamp": "10:50",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=650",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "Like the whole thing about options and options strategies is that this is a linear operation. So like you cannot take two losing trades and some them and turn it into a winning trade. So like if whatever complex strategy you've come up with is a profitable trade, then at least one of those legs has to be profitable. Okay. Maybe all four, five or eight of the legs that you're engaging in are profitable legs of the option strategy, but I bet you they're not. I bet you like if it's profitable at all, I bet you one of them is profitable and I bet you three of them are losing you money. And so maybe you should think about doing the profitable thing and not do the things that don't lose you money and manage risk a little bit better and you'll probably come out better in the end. It's literally, it's literally perfection. Like this, I'm actually gonna share this on X again because it's such an important concept. And this piece is actually going to be absolute, it's absolutely correct. There's nothing about what he said that is incorrect inaccurate could be conceived as inaccurate and that's by design. Think of it this way. If you sell, if you sell this, what does he say, a credit spread? Credit spread. Well let's use a credit spread. You guys know credits spreads. If I plot a piano for a credit spread, we have something that looks like",
    "start_timestamp_seconds": 745.16,
    "end_timestamp_seconds": 848.44,
    "start_timestamp": "12:25",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=745",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "that's by design. Think of it this way. If you sell, if you sell this, what does he say, a credit spread? Credit spread. Well let's use a credit spread. You guys know credits spreads. If I plot a piano for a credit spread, we have something that looks like this. We have something that looks like this. What do we enjoy here? We enjoy this. We also enjoy the fact that more often than not, we have a little bit of a buffer in terms of where we start this game. Meaning normally it has to move a little bit against you in order for you to even start losing money. Again, depending on how you trade credit spreads. What's on the inside of a credit spread? We have, we sell to open closer to money and then we buy to open further. This structure is useful. But we cannot confuse what's happening. What's happening here is if this leg is profitable, this one is losing. And if this one is losing, this one is profitable. Every single time. What he's saying is if you are an effective trader, you would be better off doing this when it works and doing this when it works, not doing them together. In the context of a strategy, it makes entire sense. But to somebody like JungleCat, and I understand this consideration, to somebody like JungleCat, it's expensive to trade that. If you wanna trade a short straddle or a short strangle,",
    "start_timestamp_seconds": 824.16,
    "end_timestamp_seconds": 971.48,
    "start_timestamp": "13:44",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=824",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "and doing this when it works, not doing them together. In the context of a strategy, it makes entire sense. But to somebody like JungleCat, and I understand this consideration, to somebody like JungleCat, it's expensive to trade that. If you wanna trade a short straddle or a short strangle, it can be expensive. But there are smart ways you can tweak a credit spread to still have a credit spread for the margin requirement reduction, but have it behave more like a single option. All you do is widen out the wings, but people don't like doing that because then they realize that they're taking 10 points with the risk and making a dollar. So that means they stand to make a dollar and they might lose nine, they don't like that. So they want it to be tighter. So more often than not, I find it is not just a function of capital requirement. It's also very frequently a subconscious projection of risk and risk tolerance that people aren't even acknowledging exists because they say, well, like, oh, I have to be capital efficient. The crux of trading is the market doesn't give a fuck what your capital is. It doesn't care how much you have. And conversely, there are economies of scale. This is why portfolio margin exists on larger accounts. This is why span margin exists. This is why you can increase your overall leverage more and more and more when you have more and more.",
    "start_timestamp_seconds": 945.44,
    "end_timestamp_seconds": 1055.64,
    "start_timestamp": "15:45",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=945",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "is. It doesn't care how much you have. And conversely, there are economies of scale. This is why portfolio margin exists on larger accounts. This is why span margin exists. This is why you can increase your overall leverage more and more and more when you have more and more. There are economies of scale. The thing to take away from this so far is that it doesn't matter if you prefer capital efficiency. It doesn't matter if the naked version is expensive. That's not the decision point. The decision point in the context of the conversation that he was having in that YouTube short is that the single expressed accurately is always going to be better than the credit spread expressed accurately every single time. So rather than trading something like the credit spread, instead get better at being accurate in the thing that you want to trade, you will likely come out better in the end exactly as he said, couldn't agree more. And if you have questions on this, please tell me because it's really, really worth a conversation. But let's continue the discussion. Now, they're saying, here we can hear making fun of the spreads and the manage risk a little bit better advice, which sounds a bit like let them eat cake. And it's kind of dangerous for general audience. Again, you could argue that either way. I don't have a really strong opinion on it. I think the main thing, especially to people like",
    "start_timestamp_seconds": 1032.56,
    "end_timestamp_seconds": 1137.48,
    "start_timestamp": "17:12",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=1032",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "the manage risk a little bit better advice, which sounds a bit like let them eat cake. And it's kind of dangerous for general audience. Again, you could argue that either way. I don't have a really strong opinion on it. I think the main thing, especially to people like him, that come from an institutional side that are doing this at a specific level, is just preposterous. So it's kind of like if somebody tells you, hey man, the sky's green and you're like, the fuck are you talking about? It's blue and you're like, no man, it's green. That's literally the equivalent of what's going on here. It's somebody that just looks at it completely differently, which you can learn something from that. Now, then the funny thing was, the jungle cat offers, there's always fees and commissions. His point is ass and I because it's completely unaccountable. Again, this is an interesting case study. I don't know jungle cat. I've actually never seen them on the channel before. So this is no beef with them literally at all. We could just call them trader A. It literally makes no difference to me. It's what the thought process represents, because I know that they're not the only person that express this way. There are always fees and commissions, which is ironic. It's worse with more legs every single time. Every single time. Here's what happens. If you wanna trade SPX, because we have it up. And you wanna",
    "start_timestamp_seconds": 1119.88,
    "end_timestamp_seconds": 1221.76,
    "start_timestamp": "18:39",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=1119",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "represents, because I know that they're not the only person that express this way. There are always fees and commissions, which is ironic. It's worse with more legs every single time. Every single time. Here's what happens. If you wanna trade SPX, because we have it up. And you wanna sell six day options. If I want to sell the puts, I come in to the 6765, I look to sell these puts. Right now they're 40 cents wide. If I take a look and I wanna turn this into a spread, let's say that I wanna do this five points wide. What needs to happen when you submit it as a complex order is the order routing now changes. Notice the difference in the bit as spread. What do you see here? I just showed you this one by itself is 40 cents. When I look at this one by itself, it's 40 cents. When I look at both of these together, what do you notice? Is it 40 cents? No, and it will never be. Well, that's a lie. Sometimes it can be, but it generally won't be. The reason is now you need a more nuanced counter party in the first scenario, the counter party needs to just say, oh, do I want those puts or do I want those calls? In this scenario now they're saying, do I wanna be short puts there and long calls there? What impact does that have to my total book?",
    "start_timestamp_seconds": 1193.28,
    "end_timestamp_seconds": 1302.88,
    "start_timestamp": "19:53",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=1193",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "party in the first scenario, the counter party needs to just say, oh, do I want those puts or do I want those calls? In this scenario now they're saying, do I wanna be short puts there and long calls there? What impact does that have to my total book? It's a different prospect. That part is not huge if we're being realistic with one another, but it is still another liquidity factor. Then you have the next piece of now you're playing the bit as spread on two legs and you need to route two legs. That's always gonna cost you more money than a single leg. Again, so this doesn't even make sense. Then this last part, again, is just ignorance, right? Like his point is ass and I, because it's an actionable, it's literally entirely actionable. It just means trade less fucking legs. Try and do things in a simpler fashion if you can. Focus on the part that's working and lean into that. So for example, if we have a strategy and we'll look at a case study together and compare these so that you can see. If I look at selling to open a put, versus selling to open a put credit spread. If the underlying goes up, these bills make money, if the underlying goes down, these both lose money. The argument is don't just blindly put this on and be okay putting on because it's risk defined. The point is get better at",
    "start_timestamp_seconds": 1283.24,
    "end_timestamp_seconds": 1384.6,
    "start_timestamp": "21:23",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=1283",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "versus selling to open a put credit spread. If the underlying goes up, these bills make money, if the underlying goes down, these both lose money. The argument is don't just blindly put this on and be okay putting on because it's risk defined. The point is get better at tying it to this so that you don't need the credit spread and you can just run the put. And again, this still applies to wide credit spreads. A lot of times when we're talking about put credit spreads we're talking about stuff that's like a point wide five points wide 10 points wide 15 points wide and it's also underlying dependent. Because if you're trading something that's a cheap name 15 points wide is fucking massive. But if you're trading it in SPX, that's two strikes, three strikes a part, it's nothing. This is the broader point. Does that mean it might impact your tradeable universe? Yes. These are what we refer to as constraints. They're things that you just have to deal with. They're part of your operation, they're part of your structure as a smaller retail trader and none of these are advantages. These are all things that you simply have to endure and find a way to get through. A great example of that is a 5K account. You take a $5,000 account. I did a small stack segment, not that long after I've launched the YouTube channel, like a year or two in. And what",
    "start_timestamp_seconds": 1364.36,
    "end_timestamp_seconds": 1463.56,
    "start_timestamp": "22:44",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=1364",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "that you simply have to endure and find a way to get through. A great example of that is a 5K account. You take a $5,000 account. I did a small stack segment, not that long after I've launched the YouTube channel, like a year or two in. And what I did was it was like for a quarter or something like that, I traded a $5,000 account and I reported it out. I think it was on a weekly basis, what I did. It brought me back, it gave me nightmares, and brought me back to how annoying it is to trade a small account. It is annoying. When I go through to the market and I scan for things, I find that like in order for me to size things appropriately, you have a $5,000 account. In order to size things appropriately for options, and let's say that you're even using one percent risk. You can't risk anything. You have 50 fucking bucks. You can't do much of anything with that, which is exactly why I say for smaller accounts, you are so much better, saving your money. Save aggressively and do your best to not make this number smaller. The way traders make this number smaller is they traded too fast, before they have any economies of scale, and they're forced to just make a series of bad compromises. If you choose to, and if I'm being honest, I absolutely would. I just know myself, even knowing",
    "start_timestamp_seconds": 1445.72,
    "end_timestamp_seconds": 1539.16,
    "start_timestamp": "24:05",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=1445",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "number smaller. The way traders make this number smaller is they traded too fast, before they have any economies of scale, and they're forced to just make a series of bad compromises. If you choose to, and if I'm being honest, I absolutely would. I just know myself, even knowing what I know now, if I had $5,000, I mean, if I had like my temperament now at 34 versus 17, no, I would have a slightly different approach if I just got transported back, but current, everything. Understanding myself, even if I had the knowledge that I had now, I still would start with $5,000. There's no way I wouldn't. And I know that. The way that, so I know, like as I'm saying this, I'm very transparent with identifying my own quirks and shortfalls. That would be one of them. That said, I would do my absolute best to trade it in the most logical way I could conceive. With a small account is, you're gonna run into this constraint. So if you're gonna say, well, fuck, I can't find anything in risk 50 bucks. So I'm gonna have to do something else. I'm gonna have to take a little bit of risk here. What that could look like is maybe you have to find a few trades that you can take like $200 to $500 a risk. And you have to immediately accept the fact that you are oversized. This is oversized. The drawback of being oversized",
    "start_timestamp_seconds": 1519.92,
    "end_timestamp_seconds": 1617.84,
    "start_timestamp": "25:19",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=1519",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "a little bit of risk here. What that could look like is maybe you have to find a few trades that you can take like $200 to $500 a risk. And you have to immediately accept the fact that you are oversized. This is oversized. The drawback of being oversized in this way is if we're trading something like earnings releases, guess what? This is a numbers game. Numbers. I'm gonna look to put on like three to 10, three being like as little as I would want to put on. I wanna put on as many as I can per day. If I take this and I say the high end, 10, and I tie that to my money, I am already completely like I could get wiped out in one day. So then the small account says, like can't do 10, so I'm gonna do three. Here's the problem. Just because you can only do three, doesn't mean that the market is now gonna accommodate you. It doesn't mean that the market's gonna be like, oh, okay, you can only do three, let me throw in a nice mix of what might happen so that this way you have a good shot. The three you pick could be three fucking losers and you don't have a larger number to help offset those losers. That's the nature of trading short-volter earnings. This is what's called a constraint. It's not something that helps you in any capacity. It's just something",
    "start_timestamp_seconds": 1599.84,
    "end_timestamp_seconds": 1693.68,
    "start_timestamp": "26:39",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=1599",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "have a good shot. The three you pick could be three fucking losers and you don't have a larger number to help offset those losers. That's the nature of trading short-volter earnings. This is what's called a constraint. It's not something that helps you in any capacity. It's just something that you have to deal with. What does that look like? You might not be trading much earnings. That might be a good thing to pay for trade when you have a small account. Because otherwise, you are literally throwing your entire account balance into literal fucking coin flips. The house edge on earnings plays isn't fact. It's not like 75% edge. It's more like a casino edge that has like maybe a percent, maybe 2%. Having one to two percent edge, it means you need to grind it the fuck out. Why do you think casinos try to make it so easy to stay there as long as you can? It's why there's no windows. You lose track of time. It's why they pump oxygen into them. It gives you a euphoric feeling if you get heavy doses of it, but it's absolutely gonna keep you awake. While they give you free drinks, have a great time. Ball out. It's why the dealers are super nice to you. They'll help you. They'll explain the game to you as you're sitting there. Some games even like Blackjack at some card casinos here in California, the dealer will play your hand",
    "start_timestamp_seconds": 1674.12,
    "end_timestamp_seconds": 1772.72,
    "start_timestamp": "27:54",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=1674",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "give you free drinks, have a great time. Ball out. It's why the dealers are super nice to you. They'll help you. They'll explain the game to you as you're sitting there. Some games even like Blackjack at some card casinos here in California, the dealer will play your hand for you. What that means is if you're gonna play standard blackjack strategy, which there's a tree, right? That tells you what to do. The dealers know that by heart. They'll literally tell you what to do. So you were straight up a fucking monkey that's sitting in the seat with the money and you can look at your cards. You could look up at the dealer and be like, I don't know what to do. They will literally tell you, the strategy says do blank. Okay, you do that. They'll tell you what's optimal. Based on standard blackjack strategy. Why do they do that? To keep you at the table longer. What I'm emphasizing here is the importance of large occurrences. If you have a casino-like edge, you absolutely have to have occurrences. That's something like earnings place, which is why I don't think they're very suitable for small accounts. They're just too streaky and you need too many of them. So with a $5,000 account to follow this thought to conclusion, I would be looking for asymmetric opportunities. So with risking $500 per tray that puts you at 10% risk, you can survive some of those. You can",
    "start_timestamp_seconds": 1757.12,
    "end_timestamp_seconds": 1852.44,
    "start_timestamp": "29:17",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=1757",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "accounts. They're just too streaky and you need too many of them. So with a $5,000 account to follow this thought to conclusion, I would be looking for asymmetric opportunities. So with risking $500 per tray that puts you at 10% risk, you can survive some of those. You can get a few of them fucked up and you can walk out, okay? You can size things at least reasonably, but going back to the concept of the YouTube short, you would better be good. You would better be really good. So that means when you're looking at stuff, let's say you're looking at a stock price and you're looking at something and you want to trade it to the upside, you have to be good at identifying situations where this happens. Even if you're moderately good, it might not be enough. So for example, the way that I trade things like breakouts, I tell you guys this all the time, my wind rate fluctuates between 40 and 60% anywhere in there. It's a low wind rate. What does that mean? It means that I might take quite a few subsequent small losses. Why does the strategy have good overall return because of severity to the upside? When it's correct, it does really well. But I have to position myself so that I could put on enough of them understanding a good number of them at times the majority are going to be wrong. I have to survive all of",
    "start_timestamp_seconds": 1831.04,
    "end_timestamp_seconds": 1929.96,
    "start_timestamp": "30:31",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=1831",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "return because of severity to the upside? When it's correct, it does really well. But I have to position myself so that I could put on enough of them understanding a good number of them at times the majority are going to be wrong. I have to survive all of those so that when the smaller subset that do make money that I can experience those trades, you can't experience those trades if you have no money. Small accounts got it rough, man. To that end, it doesn't matter. It doesn't matter your convenience. It doesn't matter if you want more capital efficiency, the market doesn't care about your preferences. Then the rest of this, I'm not sure if there's anything really worth here we go. Half-fun using $132,000 of buying power on a single SPX contract because your pompous guests thinks $5 wings are a rip off. This is just Dublin back to what we were talking about before. You can do this way cheaper. Let's just look at an example together. If I wanted to sell the puts here, the 6765s, I don't even know what it costs in a regulation T account. If you guys, if one of you guys could let me know, I don't know what it costs in regulation T. But I'll tell you what it costs in a portfolio margin account for context, everyone's second. Just log in and shit it. Let's see. Also zeros today were good. Okay. So be what expiration",
    "start_timestamp_seconds": 1910.84,
    "end_timestamp_seconds": 2028.96,
    "start_timestamp": "31:50",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=1910",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "of you guys could let me know, I don't know what it costs in regulation T. But I'll tell you what it costs in a portfolio margin account for context, everyone's second. Just log in and shit it. Let's see. Also zeros today were good. Okay. So be what expiration are we in? Six days. Six days. The 30 delta. It costs 93,290. 93,290. It's expensive. So the irony perks says 96. So it's effectively cash will not cash occurring. But it's effectively putting up the entire value. That actual home on, that doesn't even make sense. What's wrong here? This is make sense. I guess it's about right because one contract is what? 675k something like that. Maybe it's about right. Anyways, you can start here and you can say, yeah, my portfolio can't put that down. Okay. Let's take a look at a spread. Let's I'm going to pick easier numbers. I'm just going to do the 6750s. And then let's take a look at a 50 point spread. The 50 point spread, you have, we'll plot it. The 50 point spread, you're trying to make a 35 and you're risking 41 65. Even this in something like this in something like SPX, I would actually argue it was not wide enough. That might mean index options in an index in a actual index like SPX, it might be too rich. It just might be too expensive for you. Again, these are not things that are optimal. These",
    "start_timestamp_seconds": 1996.76,
    "end_timestamp_seconds": 2141.48,
    "start_timestamp": "33:16",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=1996",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "this in something like SPX, I would actually argue it was not wide enough. That might mean index options in an index in a actual index like SPX, it might be too rich. It just might be too expensive for you. Again, these are not things that are optimal. These are constraints, but this is what it is. If I wanted to add something to this and just control margin requirement, but I'm effectively planning to treat it like a single option, I'm going way out. So again, if we do the 6750s, I'm going to find something that's like a five delta. Somewhere in here. How far is this? This is a 6550, 6750. Those are what 200 points wide. I want this to be effectively a naked option. So this is going to make it 18,000, 230. And again, for a small account, they will say, that's a lot. And again, for a small account, it's completely accurate. That is a lot. But because it's a lot for you, it doesn't mean your work around is optimal. Unfortunately, a lot of times, it's a detriment. For the conversation we were just having, that's a massive margin requirement decrease. That's taking something from $90 plus $1000 to sub 20. That's a whole, that's a completely different equation, a completely different scenario. So let's continue. Oh, not I think you guys had a question. Perks says when he was talking about positioning being the most important thing is that total",
    "start_timestamp_seconds": 2117.28,
    "end_timestamp_seconds": 2226.08,
    "start_timestamp": "35:17",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=2117",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "That's taking something from $90 plus $1000 to sub 20. That's a whole, that's a completely different equation, a completely different scenario. So let's continue. Oh, not I think you guys had a question. Perks says when he was talking about positioning being the most important thing is that total Greek exposure, the portfolio relative of the profit mechanisms that are being traded. Yeah, that's definitely part of it. It's not just Greeks, though. It's like also the correlations of things. How aligned you are to specifically the profit mechanisms and the broader regimes. So yeah, what you're highlighting, there is absolutely part of it, but I would say it's part of it. Either still definitely more that goes into what we would call positioning. That's also how are you across explorations? What kind of catalyst are you exposed to? A great example of this is MSOS. In MSOS, I was trading short-val. Here. I was trading short-val because the underlying had really, really high risk premiums and really, really low, relative, realized moves. I also knew, I think it was on like coming into 15 to December that there might be something about Supreme Court taking up a case or some shit, some sort of thing that would impact the stock or this ETF. The decision to trade the short-val was same as usual. My expectation is that that will be less over the lifespan than the realized. But then what was it yesterday last night? Trump made some",
    "start_timestamp_seconds": 2207.68,
    "end_timestamp_seconds": 2309.68,
    "start_timestamp": "36:47",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=2207",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "or some shit, some sort of thing that would impact the stock or this ETF. The decision to trade the short-val was same as usual. My expectation is that that will be less over the lifespan than the realized. But then what was it yesterday last night? Trump made some comments about cannabis. So that sent the underlying flying. That was in part of my original risk. That's not exactly what I was expecting to get into. But fortunately, this is a scenario where I made the right moves for the wrong reason or made the wrong moves. No, made the right moves for the wrong reason. That's the right way to frame it. No, let's blame it. I don't remember when I initiated the trade, but suffice it to say it absolutely would be somewhere in this bucket. I genuinely don't remember when. I'm assuming somewhere in like this subrange if I had to guess. I also knew that on the 15th, so call that like right here, is when we were supposed to hear about this thing by. I'm emphasizing the word by because doesn't mean on. It means by, which is sometime on or before. What I ended up doing was collecting the wall coming in and then over the last couple days, I started buying shares. The purpose for the shares is to hedge the potential upside move, allowing me to keep the trade on. I viewed the risk to the upside, not to the downside.",
    "start_timestamp_seconds": 2286.48,
    "end_timestamp_seconds": 2396.88,
    "start_timestamp": "38:06",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=2286",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "ended up doing was collecting the wall coming in and then over the last couple days, I started buying shares. The purpose for the shares is to hedge the potential upside move, allowing me to keep the trade on. I viewed the risk to the upside, not to the downside. So again, this is a scenario where I'm using the positioning to take the specific risk that I want and to scrub some of the risk that I don't want, but I'm still taking risk and I'm just trying to isolate the specific risk that I want. I ended up accumulating some shares relative to the position in here, and then this move happened. It started after hours, so I actually bought more after hours as it was going. And this actually came down today. And it's because the short-stringle lost money because of the move, but the shares helped. The reason for the shares though was not an anticipation of Trump coming up with some sort of statement about this thing. That wasn't even, that literally wasn't even part of the consideration. I didn't even thought of that because he's already talked about cannabis. There was no part of me that thought that was part of what was going on here. So it ended up working out well, or the reason that this catalyst behaved the same thing as I was planning for. So I made the right move, but for the wrong reason. I could easily convince myself",
    "start_timestamp_seconds": 2375.28,
    "end_timestamp_seconds": 2477.88,
    "start_timestamp": "39:35",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=2375",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "me that thought that was part of what was going on here. So it ended up working out well, or the reason that this catalyst behaved the same thing as I was planning for. So I made the right move, but for the wrong reason. I could easily convince myself and say, oh yeah, I thought I was going to go up for some sort of reason, but that's me completely lying and giving myself bad feedback. The feedback that I gave myself on this trade is that the hedge behaved as exactly as it should have, but Trump coming out and talking about cannabis literally wasn't even part of the idea. It's not even something I thought about. That's a massive gap. I did no analysis on whether or not Trump was supposed to do any sort of conversations about cannabis. Would that have identified this specific event? I don't know. I literally don't even know if he was meant to talk about this. But it wouldn't take me much time at all to figure out if it was even on the plan. So what I'm being very clear about, my analysis here isn't that I wasn't able to predict this. I can't predict this unless it was on Trump's schedule. Then I could have predicted it. The feedback is that I didn't look. That's the piece. I should have thought of Trump potentially having something around this case. That would have been completely logical. The correct move there",
    "start_timestamp_seconds": 2458.88,
    "end_timestamp_seconds": 2560.48,
    "start_timestamp": "40:58",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=2458",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "predict this. I can't predict this unless it was on Trump's schedule. Then I could have predicted it. The feedback is that I didn't look. That's the piece. I should have thought of Trump potentially having something around this case. That would have been completely logical. The correct move there would have been to at least look. But I didn't. So say, lovey. Okay. Then here, this is another really funny thing, which Augustine and I spoke about I've also heard this from you and what he said is he just living off commissions from his book. For those that don't know, you really, I don't know. I've never published a book. But for most of these trading books, these guys are, they're not making a lot of money at all. Like at all, I'm not going to go into their specific economics because obviously that's just a conversation between us. But it is not what you think. It's not what I thought. I literally thought that these books would be making hundreds of thousands if not maybe six figures for them. It's not much. There is why I'm mentioning that is because like this also shows that we again, don't really understand the world around us. I didn't either on that point. But this here, I'll continue to prioritize capital efficiency. And that's okay. For somebody to choose to prioritize capital efficiency, that is a completely reasonable decision to make. But we can't confuse ourselves. Prioritizing capital efficiency is",
    "start_timestamp_seconds": 2536.08,
    "end_timestamp_seconds": 2652.08,
    "start_timestamp": "42:16",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=2536",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "don't really understand the world around us. I didn't either on that point. But this here, I'll continue to prioritize capital efficiency. And that's okay. For somebody to choose to prioritize capital efficiency, that is a completely reasonable decision to make. But we can't confuse ourselves. Prioritizing capital efficiency is not prioritizing total performance. Total performance in terms of risk adjusted returns doesn't care about your capital efficiency. So nothing wrong whatsoever. With saying, I'm going to prioritize capital efficiency, but we cannot trick ourselves. We cannot lead ourselves to believe that somehow that this is optimal. It isn't. It's completely okay to do something that is sub-optimal. I do that all the time. Literally all the time. I was talking about this the last couple of streams about my, what was it? The November performance review, the AR for November, in sharing the percent returns for the different buckets of my portfolio. It is sub-optimal for me right now to continue trading a coverage triangle in I bit. I'm doing it anyways for a bunch of reasons. But I know for a fact, it is sub-optimal. But I'm doing it anyways. Being able to acknowledge that what I'm doing is not optimal is important to our ability to objectively analyze the world around us. Because otherwise, what ends up happening is we hide from the things that we don't like and we don't want to hear. The reason why this person is arguing like pretty viciously, right? Like it's",
    "start_timestamp_seconds": 2631.88,
    "end_timestamp_seconds": 2739.68,
    "start_timestamp": "43:51",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=2631",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "is not optimal is important to our ability to objectively analyze the world around us. Because otherwise, what ends up happening is we hide from the things that we don't like and we don't want to hear. The reason why this person is arguing like pretty viciously, right? Like it's not even debate about ideas. There's a lot of ad homin and attacks in here. They're throwing stones at a gusten because they don't like hearing this. It's disrupting their understanding of the world and it's disrupting the way that they think about markets and what they think works for them. They cannot, they're not able to reconcile the information with their psyche. Which, that will never help them. And again, the reason why I'm having this conversation is nothing to do with this person. I literally have never seen them before. It's just that this conversation really struck me as such a fantastic example or how a lot of people think. And reconciling with yourself is always going to be to your benefit. It's okay if you choose to do something that's sub-optimal if it still makes the most sense for you. But you need to be able to objectively evaluate what you're doing. And then the last thing here, this doesn't matter. Okay, here we go. So I didn't read this one yet. This one says often other legs are there to hedge off something like Delta Exposure to smooth out the day to day moves. Most broken",
    "start_timestamp_seconds": 2715.48,
    "end_timestamp_seconds": 2814.68,
    "start_timestamp": "45:15",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=2715",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "objectively evaluate what you're doing. And then the last thing here, this doesn't matter. Okay, here we go. So I didn't read this one yet. This one says often other legs are there to hedge off something like Delta Exposure to smooth out the day to day moves. Most broken we butterfly traders will freely admit. It's the put credit strategy that makes money. It's the put debit spread there just for Delta hedging. Again, this is honestly, I didn't respond to this one that didn't see it. But this one's also completely mistaken things. Like the put debit spread isn't Delta hedging. It's definitely going to offset Delta's in the beginning, but then it's not. So that's, again, just a misunderstanding of things. For most people, this is just a general preference of strategy because they like to risk profile, right? Like this here, smooth out the day to day moves. So what that means is rather than emphasizing profitability of the strategy, we're saying the profitability is now not the number one priority, but the day to day moves and decrease volatility is important to me, which is okay. It's okay for a trader to say that. You have to acknowledge it in order to stand the drawbacks. The reason why it's important to acknowledge it is because then you need to have a real conversation with yourself and be like, is there enough meat in the edge of this strategy to accommodate this preference? Because unfortunately, like",
    "start_timestamp_seconds": 2792.68,
    "end_timestamp_seconds": 2884.68,
    "start_timestamp": "46:32",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=2792",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "have to acknowledge it in order to stand the drawbacks. The reason why it's important to acknowledge it is because then you need to have a real conversation with yourself and be like, is there enough meat in the edge of this strategy to accommodate this preference? Because unfortunately, like we were talking about in the beginning, a lot of times it isn't sufficient. It's not enough. The edge in a lot of trading strategies is thinner than people think. If that's the case, then you probably have to lean a little harder into the, the more efficient way to capture the thing and accepting the risk. There are absolutely some strategies that you can overlay preferences like that. So let's summarize at least some of the high level items for the beginner's lab from that thread. The first thing you should take away is that there's a difference between what you want and what the markets are. That's always going to be there and that's okay. You have to be able to look at both of those and have a real conversation with yourself. The other thing is that every single position that you put on as you add other stuff, you're including trade-offs of some capacity. You have to determine if those are suitable to you. So I actually thought we could do an example together in on-demand really fast because I think it would be a great learning case study. What I want to do is go",
    "start_timestamp_seconds": 2869.88,
    "end_timestamp_seconds": 2969.28,
    "start_timestamp": "47:49",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=2869",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "other stuff, you're including trade-offs of some capacity. You have to determine if those are suitable to you. So I actually thought we could do an example together in on-demand really fast because I think it would be a great learning case study. What I want to do is go into SLV because SLV is had a pretty strong run up. And what I want to do is like, come in here to what is the September 9th. We'll go to September 9th back in time and we'll place some trades and we'll see how they do. We're just going to go directly to expiration. I'm not going to play games with like different management and shit like that. We're just going to go and see how these different trades do. As usual, the purpose of this is that there's no reason for any of this to be a guessing game. You can literally get the information that you need in order to make decisions. So let's do that. I think I have a trade log in here somewhere. Let's see if we can find that bad Larry. Here it is. Look at us go. One's a little suboptimal. Let me see if I have a different one. Okay, this one work. Here we go. Okay, I'm going to move this off to the side so that I can feel the same as we go. We don't really need the date and all that stuff. I'm just going to pause",
    "start_timestamp_seconds": 2949.28,
    "end_timestamp_seconds": 3055.28,
    "start_timestamp": "49:09",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=2949",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "me see if I have a different one. Okay, this one work. Here we go. Okay, I'm going to move this off to the side so that I can feel the same as we go. We don't really need the date and all that stuff. I'm just going to pause time. I'm just going to view this from the lens of a trader that thinks it's going to go up. But we're going to trade short puts short calls, short put credit spreads, short call credit spreads. Because again, when you're going through and you're testing something like this, there's absolutely no reason. Not to just do them all, right? You're there already. It doesn't take that much longer to look at all these other things. So let's do that. I'm going to drop us to nine set. Our ticker as we discussed is SLV. The underlying price is 3715. We're just going to do a one lot for all of them. We're going to be in the same expiration, which is 17, oct. And again, to give you some workflow stuff, all I'm doing here is filling this out once. And then we can use it for all of the individual trades. So I don't have to fill that out multiple times. Okay. Let us. Shit. Shit. Oh shit. All right. All right. Everybody relax. Relax calm down. I got the. I got our spot. Okay. Let's take a look first at the short put. We will do this",
    "start_timestamp_seconds": 3034.28,
    "end_timestamp_seconds": 3137.88,
    "start_timestamp": "50:34",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=3034",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "the individual trades. So I don't have to fill that out multiple times. Okay. Let us. Shit. Shit. Oh shit. All right. All right. Everybody relax. Relax calm down. I got the. I got our spot. Okay. Let's take a look first at the short put. We will do this 33 delta just because it's there. So we'll do. 36 strike, 0.33 delta. And we're going to get 63 cents. I don't care about the margin and all that stuff. Let's do a spread. I will do a dollar wide spread. Or our dollar wide spread my long put is going to be the 35 strike. It's going to be a 21 delta short is going to be the same 36. Same 33 delta. And on this, I'm going to get 30 cents. X. Let's do a 30 delta short call. Here. So for our short call, we're going to be at the 39. And that's going to be a 29 delta. And for that, we are going to get 56 cents. And we have one more that we're going to do. We're going to have the same short call. But the long call is going to be the. Orty. So the 40 call is a 21 delta. And we are going to get 19 cents. All right, we have everything we need. Let's fast forward. I'm just going to go straight to expiration. It doesn't matter. Effectively what happens. We just want to see what goes down. So let's",
    "start_timestamp_seconds": 3111.68,
    "end_timestamp_seconds": 3227.08,
    "start_timestamp": "51:51",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=3111",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "So the 40 call is a 21 delta. And we are going to get 19 cents. All right, we have everything we need. Let's fast forward. I'm just going to go straight to expiration. It doesn't matter. Effectively what happens. We just want to see what goes down. So let's go to 17 October. Let's see. What's crack? We have the, let me get the dates. So now it's 17 opt. We're going to use the same one for all four. Price is 4719. And let's take a look at what we would close these four. The spread is running for 85 cents. Effectively, we know the funny enough, the irony is that. The width is only a dollar, but because of liquidity, you're getting absolutely scraped because your total risk in this thing. You put it up for 19 cents. So your total risk was 81 cents. So there's a chance in order to get out of this thing, you'd have to come over the top. It's rare for that to be the case, but funny that that is so I'm just going to use the mid point 85 cents. Otherwise, you have different kinds of expiration issues. The 39's are going to come down for 790. The 36 puts. Those are definitely not 50 cents. I'm going to call them up penny. I'm just going to call it a penny for both. Let's see what happened here. It's generally what you would expect. What happened was. The base",
    "start_timestamp_seconds": 3213.48,
    "end_timestamp_seconds": 3357.98,
    "start_timestamp": "53:33",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=3213",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "39's are going to come down for 790. The 36 puts. Those are definitely not 50 cents. I'm going to call them up penny. I'm just going to call it a penny for both. Let's see what happened here. It's generally what you would expect. What happened was. The base short puts out performed. The put credits bread by two times. The overall efficiency for the put credits bread will be much higher, because you needed less capital in order to put that position on. On the other side, you experience the downside to that. Your short call loses way more. It's got ran over and we did nothing until expiration. The call credit spread comes down effectively for a max loss. Let's take a look at one thing. I want to go back and I want to see when we crossed 39 here. I want to take a look at what that short call was trading at so it's on the 22nd. This is to give you a sense of what some management can do in something that's going against you. So at this point in SLV, we're going to go into the same expiration. We're going to look at the 39's. And we're just going to simulate if we close them there. 39.79. The 39's here are a dollar 58. So there's your difference. It's about 600 and 30 bucks. What I'm just pointing out there is understanding the. Like broader implications of what you're doing. You have",
    "start_timestamp_seconds": 3315.18,
    "end_timestamp_seconds": 3478.98,
    "start_timestamp": "55:15",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=3315",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "at the 39's. And we're just going to simulate if we close them there. 39.79. The 39's here are a dollar 58. So there's your difference. It's about 600 and 30 bucks. What I'm just pointing out there is understanding the. Like broader implications of what you're doing. You have to figure out how you want to manage this stuff in how OK you are with doing this. But this is a good example where if you're able to do this thing, which is predict the upper direction. You're absolutely better off selling to put in the put credits bread. When you're wrong, you pay the consequences that's undefined risk. But this is also why more often than not when I test any sort of zero DTE strategies. I have a bunch of videos testing different zero DTE strategies more often than not. You will find that the naked strategies perform better than the non naked strategies. The P and L profile for them can be brutal. So depending on today, I traded spreads instead of short options. Not optimal. I didn't care because based on the false sampling I did, we were in a spot where warranted it. So I didn't care. I accepted the trade off. The trades came down for a full profit. I absolutely would have made more if I sold just the naked instead of having the wings. I'm not sure if I could have a pair of hands or a pair of hands. It",
    "start_timestamp_seconds": 3434.98,
    "end_timestamp_seconds": 3554.98,
    "start_timestamp": "57:14",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=3434",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "I didn't care. I accepted the trade off. The trades came down for a full profit. I absolutely would have made more if I sold just the naked instead of having the wings. I'm not sure if I could have a pair of hands or a pair of hands. It doesn't matter. I was optimizing for the broader strategy into a void, having excessive drawdowns in a circumstance where they're very likely relative to other periods. So, do you guys have any questions on anything that we went over? Anything on the beginner side of stuff? If you guys have anything that you want to touch on quickly, I'm happy to. My biggest hope is that we develop a better relationship with what the markets are and what we're trying to accomplish so that we can make better evaluations and better trade offs. By being able to evaluate things effectively, you can make the best trade off for yourself at that point. But you'll never be able to make good decisions with respect to trade offs if you can objectively evaluate stuff. So just do yourself a solid and as you're analyzing the markets and stuff, try your absolute best to not look at it through the lens of what you want, what you would prefer, what's convenient for you. Do your absolute best to push that to the back of your brain. It doesn't really matter. What matters is what is, what are the markets, what does Edge actually",
    "start_timestamp_seconds": 3540.98,
    "end_timestamp_seconds": 3635.98,
    "start_timestamp": "59:00",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=3540",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "to not look at it through the lens of what you want, what you would prefer, what's convenient for you. Do your absolute best to push that to the back of your brain. It doesn't really matter. What matters is what is, what are the markets, what does Edge actually look like? This is a great example when I talk about Edge being more bound to full than people think. It's really, really easy to find Edge and I'm not kidding. That's not hyperbally. Edge is very easy to find. You can find Edge in trading options or just trading the market in general with six hours of dedicated research. The problem with it is that the Edge doesn't look the way that people want it to look. The Edge isn't millionaire overnight kind of money. It's maybe one to five percent alpha excess market return and sometimes it incurs higher risk. The point I'm making there is that because people have really strongly held preferences, it makes it much more difficult way way way more difficult to find things that they want. And align with the reality of things leads to poor performance. So just something to think about. Kirk says, once you started Delta hedging MSOS, did you know you're going to take down the whole position? Did you know you were going to take down the whole position? Yeah, definitely. The main thing I was waiting for is the when the catalyst happens. If after the catalyst",
    "start_timestamp_seconds": 3618.98,
    "end_timestamp_seconds": 3716.98,
    "start_timestamp": "01:00:18",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=3618",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "Kirk says, once you started Delta hedging MSOS, did you know you're going to take down the whole position? Did you know you were going to take down the whole position? Yeah, definitely. The main thing I was waiting for is the when the catalyst happens. If after the catalyst occurred, if the underlying went up. But it was still within the expected range. Take the shares down for a profit and then just close the rest out as the rest of all bleeds out. If not. And let's say it goes down shares down for a loss. Probably take the strangled down for a profit. It could have come in down for a loss unlikely, but that could have been. Then that's the other general scenario. So yeah, super super easy that the entire purpose really for the shares was just to make sure that there wasn't something priced in excessive. That would hurt the strategy because the let me see what the because when I took him down today, the short calls were in the money for sure. I had a straddle. So I had a straddle that I got a dollar 15 for at the four. So what that means is I had to the upside about to five 15 to the upside. So it exceeded the expected move. The implied range might have still come to fruition in the longer run, but just like the example we were looking at in SLV. That catalyst was also",
    "start_timestamp_seconds": 3704.98,
    "end_timestamp_seconds": 3803.98,
    "start_timestamp": "01:01:44",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=3704",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 3822.0
  },
  {
    "video_id": "jnjGRehToJU",
    "title": "What You Want vs What Is in Options Trading | Outlier Options Trading Beginner Lab",
    "text": "what that means is I had to the upside about to five 15 to the upside. So it exceeded the expected move. The implied range might have still come to fruition in the longer run, but just like the example we were looking at in SLV. That catalyst was also different than what I was planning for. So yeah, led to a slightly different management approach. All right, gang. That perhaps me up being out there. See you guys later.",
    "start_timestamp_seconds": 3773.98,
    "end_timestamp_seconds": 3816.98,
    "start_timestamp": "01:02:53",
    "video_url": "https://www.youtube.com/watch?v=jnjGRehToJU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jnjGRehToJU&t=3773",
    "chunk_index": 41,
    "word_count": 80,
    "upload_date": null,
    "duration": 3822.0
  }
]