[
  {
    "text": "Well, what's happening? We'll give this a couple of seconds to turn on. And then we are going to dive in. How's everybody doing? Cool. It looks like we are alive. Happy Saturday. What's up to all the outliers to the apes and the outlier apes, whatever combination there of. So I was looking through the broader series here and believe it or not, we've gone through this is our 17th episode. That means for 17 weeks, we've been talking about game stop in different ways and for a pretty significant majority for the recent ones. I actually have to look it up super fast for the recent Jimmy live streams to see, what is it part eight? So this is part nine of actually looking at the cat's trades. And this should be, I think the finale for this part because we've literally gone through all of his trades now. And we took a look in the last video at some of his more recent positions. Now I think it's time to reflect, to go back through specifically the cat's trading style. And that was the goal for the session tonight is I wanted to poke through it at a high level, kind of reconfirmed some of the things that I thought I saw as we were going through it. And to go through some of the logs that we've built about some of the tendencies. But there's a few really big ticket items that immediately jump out at",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 60,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=0"
    }
  },
  {
    "text": "a high level, kind of reconfirmed some of the things that I thought I saw as we were going through it. And to go through some of the logs that we've built about some of the tendencies. But there's a few really big ticket items that immediately jump out at me that really represent his trading style. And I have to be completely honest with you. It is 100 different than I originally thought because a lot of the people that I spoke to in the beginning really made me think, and this isn't to their fault, I understand why people would think this. But they really made it made me think that there was this really secret grandmaster plan that was figured out and he essentially was executing pinpoint accurately. And he's obviously crushed it. So let's make sure we emphasize that point specifically because when we first started looking at his very, very, very first trade here posted on Reddit, and I think this is when he was still posting on Wall Street bets. Yeah, the very first thing that he posted here, his account was valued at like, well, the Yolo account I should say specifically was valued at 100,000. And he's taken 100,000 and turned it into over 200 million. That requires an acknowledgement, a massive acknowledgement. That's more money than all of us will probably have. And I mean, I do pretty well. I don't think I'm going to exceed the 200 million mark. Specifically",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 60,
      "start_timestamp": "00:01:24",
      "start_timestamp_seconds": 84.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=84"
    }
  },
  {
    "text": "valued at 100,000. And he's taken 100,000 and turned it into over 200 million. That requires an acknowledgement, a massive acknowledgement. That's more money than all of us will probably have. And I mean, I do pretty well. I don't think I'm going to exceed the 200 million mark. Specifically in a trading account, that's not to cap out what my total footprint could eventually look like in some degree in all asset classes. We'll see about that. But specifically in terms of what's residing just in a trading account, I feel pretty confident in that summation. And it's primarily because as a trader, I recognize the fact that trading is highly tax disadvantaged. It's not like real estate. And trading has a lot of pros associated with it as far as I'm concerned. One of the biggest pros that come with trading is that it genuinely is a solo endeavor that genuinely can be done from anywhere. There's no planning calls. There's no, there's literally no other party that you have to work with in any capacity to make this work and to make a lot of fucking money doing it, right? There are a lot of pros that come from trading. There are also a lot of cons. It's not cheap in terms of commissions, overall friction that we face as retail traders. And it's not tax advantaged in any way whatsoever. And that's a big thing because the US government specifically, because I know that there's people",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 60,
      "start_timestamp": "00:02:48",
      "start_timestamp_seconds": 168.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=168"
    }
  },
  {
    "text": "come from trading. There are also a lot of cons. It's not cheap in terms of commissions, overall friction that we face as retail traders. And it's not tax advantaged in any way whatsoever. And that's a big thing because the US government specifically, because I know that there's people on the stream that pop in from all over the place. And we actually have to do our map in a moment. I'm waiting a few minutes to let everybody funnel their funnel their way in. But it's not tax advantaged. And the US government absolutely tax advantages pretty heavily real estate in a lot of different ways. Both in terms of the leverage they provide to you in terms of the tax treatment on what you can make. The fact that there's fucking 1031 exchanges, it's incredible. For those that are unfamiliar, 1031 exchanges to put it in trading terms, I'll show you. I'll literally draw it out because a lot of people don't understand this. And it's kind of like a superpower. So let's take a look at a standard margin account here. And I want to look at trading first. So trading, you have your 100K account, whatever it is, then you sling a few trades. You make 10K, which is awesome. And in the course of making that 10K, this has happened by buying and selling within a year. And as you're going through this process, you make your money, come end of year, you owe",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 60,
      "start_timestamp": "00:04:11",
      "start_timestamp_seconds": 251.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=251"
    }
  },
  {
    "text": "whatever it is, then you sling a few trades. You make 10K, which is awesome. And in the course of making that 10K, this has happened by buying and selling within a year. And as you're going through this process, you make your money, come end of year, you owe capital gains because you realized profit here. Now in real estate, it's different. Real estate if I buy a house, hopefully the roof looks a little better than that. Otherwise, I probably wouldn't buy it, to be honest. The windows don't matter so much. The foundation is kind of jacked. But if you buy a house and you buy the house for 100,000, you put your 20 down. So you're actually using 20K. And then you go to sell the house. And when you sell the house, you sell it for 110K, ish. And you still only put in 20K, but you still have rights to that 10K profit. But there's a beautiful thing that happens here. There's called a 1031 exchange. And in a 1031 exchange, I can take the proceeds from this. I could essentially directly move it. You can't touch it, meaning it can't go to a personal account and then back out. You have to obviously talk to, talk to a tax professional. I am a talking idiot and don't know what I'm talking about. Always remember that. But you can't touch it. This money can then be put into another house. This one has a",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 60,
      "start_timestamp": "00:05:30",
      "start_timestamp_seconds": 330.26,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=330"
    }
  },
  {
    "text": "personal account and then back out. You have to obviously talk to, talk to a tax professional. I am a talking idiot and don't know what I'm talking about. Always remember that. But you can't touch it. This money can then be put into another house. This one has a worse looking foundation, but a better looking roof. And as long as you haven't touched this money, this is not a taxable event. There's no tax here. So you made the same 10K. However, you've not paid taxes on it. You roll it into another asset. And then you continue on in this manner. So 1031 exchanges are kind of like magic from a tax perspective at least. There's obviously more to it. This is a broken down version of that. So bringing all of this back to the cat, which is what this session is about. The fact that this dude has taken 200 million and put it into a trading vehicle that is exceedingly tax disadvantaged is incredible. And it goes back to the same exact thing that I've been talking about that I cannot help but continue to be purely fascinated by the fact that this dude does shit that financially doesn't make sense. It doesn't make sense. But it still works like a mother. So you can't knock it. But but from a pragmatic perspective, it's kind of crazy to see somebody with that kind of money doing this sort of thing. Cedric says, maybe it",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 60,
      "start_timestamp": "00:07:05",
      "start_timestamp_seconds": 425.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=425"
    }
  },
  {
    "text": "does shit that financially doesn't make sense. It doesn't make sense. But it still works like a mother. So you can't knock it. But but from a pragmatic perspective, it's kind of crazy to see somebody with that kind of money doing this sort of thing. Cedric says, maybe it makes sense for him. You're misinterpreting my point. There's an objective reality about the about the financial implications of using a margin account. That's all I'm saying. And obviously it works for him. There's literally no debate about that. The dude's made 200 million objectively. It has worked and then some. But in terms of this being a when I say when I say like it doesn't make sense, I mean in the context of trying to minimize a tax footprint while doing this, right? This is getting this is taxes to the face. And it goes back to the broader theme that we've talked about before that you can tell repeatedly that this is not done to over streamline stuff. And that's one of the main things that I've come across as I've been analyzing all of these trades that this dude has made is that his motivation is very different. And we've talked about this and I want to take a step back and actually talk about that as well for a moment because when I'm talking about the way that this that this dude has traded and the amount of time that we've spent analyzing his approach",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 60,
      "start_timestamp": "00:08:21",
      "start_timestamp_seconds": 501.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=501"
    }
  },
  {
    "text": "very different. And we've talked about this and I want to take a step back and actually talk about that as well for a moment because when I'm talking about the way that this that this dude has traded and the amount of time that we've spent analyzing his approach is that it really is very unique. It's very specific to him, but one of the overarching themes that is very clear to me is that this is not purely motivated by money. And again, I think we've already known that. But as you guys know as we've gone through a lot of this series, the goal is not to take something that we've heard and just accept it and then apply that as truth going forward, right? The whole point of me doing this is a process that I do with a lot of things that I'm interested in, which is lay my own eyes on the things so that I can see it for myself. And I think it's really, really important for me to see it for myself because then it helps me pick up on different little things along the way which we're going to talk about. But the the fact that this is done this way, it tells this is not purely motivated by money. It's not. I can see that it's not. And it begs the question, what is the motivation? And there's lots of conjecture out there. I still have my Tim foil",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 60,
      "start_timestamp": "00:09:51",
      "start_timestamp_seconds": 591.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=591"
    }
  },
  {
    "text": "about. But the the fact that this is done this way, it tells this is not purely motivated by money. It's not. I can see that it's not. And it begs the question, what is the motivation? And there's lots of conjecture out there. I still have my Tim foil hat ready to go as soon as we need it because I don't know. I don't know what the motivation is. Some people think it's him trying to just play the game. Some people think it's him that's trying to stick it to the system and play with the hedge funds and you know, all these different kinds of things which I have to who knows who knows. But as I look across a lot of what he's done, I honestly think a lot of this is a really smart dude, an incredibly smart dude that knows exactly what he's doing that is fucking around to a pretty big degree. I think he likes trolling a lot. And I think that the nomenclature right from the jump for this whole thing is completely transparent, right? Like it's started with a yolo account. So Josh says, what's the motivation of find the motivation? Because it's fucking interesting. That's why it is fucking interesting. It's kind of like, and I've said this before. Josh says he lives rent free in my head. Yes. Of course he does. I enjoy looking at his stuff. I've talked about this a million times. I'm fascinated",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 60,
      "start_timestamp": "00:11:08",
      "start_timestamp_seconds": 668.66,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=668"
    }
  },
  {
    "text": "the motivation? Because it's fucking interesting. That's why it is fucking interesting. It's kind of like, and I've said this before. Josh says he lives rent free in my head. Yes. Of course he does. I enjoy looking at his stuff. I've talked about this a million times. I'm fascinated by this. The reason why I'm so fascinated by this is because I've spent a lot of time in markets. I've come across exactly zero instances of this kind of behavior from a retail trader. So like in a pure sense, this is not only an outlier, which is my entire fucking brand is this kind of stuff. But more important, that's how my brain works. But more importantly than that, I'm literally looking at an anomaly. Like I'm looking at, it's like the matrix when like that little kid holds up the spoon and they're like, well, what if the spoon isn't a spoon or whatever and he like fucking bent over or whatever. So it's absolutely it's absolutely an incredible thing to see. So he doesn't live rent free in my head. And I've told you guys this before as well. Like he doesn't live rent free that like, I'm trying to crack the code of what he's doing so I can do it. Like I've said that a million times. I honestly would never trade like him. I know that I wouldn't. I honestly don't have any interest in trading like him. But I can fully appreciate",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 60,
      "start_timestamp": "00:12:20",
      "start_timestamp_seconds": 740.66,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=740"
    }
  },
  {
    "text": "like, I'm trying to crack the code of what he's doing so I can do it. Like I've said that a million times. I honestly would never trade like him. I know that I wouldn't. I honestly don't have any interest in trading like him. But I can fully appreciate and enjoy looking at the way that he's trading. So the reason why he lives in my head is because I'm interested in it. Like a lot of stuff, right? Astrophysics lives rent free in my head. I'm fascinated by it. I have a fucking telescope over here that I paid a lot of money for so that I could just look at shit in the sky that my brain can't really comprehend because I'm interested in it. So this is absolutely absolutely something that I enjoy looking at because how could I not? It's like if if you play basketball when Mugsie Mugsie Bose Mugsie Bose was really interesting and he got a lot of attention for some time because he was an anomaly in professional basketball. He had a style based on his size which was an outlier onto to the negative to the downside. Not like a giant dude and he completely created a style around himself. So he also was an anomaly that anybody that was a fan of basketball knew about him and it's for that reason. So yeah, I love looking at this stuff. You guys know, I just said at the beginning of",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 60,
      "start_timestamp": "00:13:46",
      "start_timestamp_seconds": 826.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=826"
    }
  },
  {
    "text": "giant dude and he completely created a style around himself. So he also was an anomaly that anybody that was a fan of basketball knew about him and it's for that reason. So yeah, I love looking at this stuff. You guys know, I just said at the beginning of this, spent the last 17 weeks straight on Saturday night looking at this stuff because it interests me that much. That's why I'm here. So I love it. I think the ability to look at something like this and to just understand what's going on here while try to understand is very, very fun. Very, very fun. It has been a it's been a long ride so far. So just as people collect things, some people collect money. Oh, are you saying that like that's what he's trying to do here is just collect more coupons? Because again, if so, I don't I actually don't think that's the case. He could have made a lot more money with his money at this point if he moved out of stocks. That's just an objective reality. Once you have the kind of scale that he does, if his goal was just to make more gold coins, he absolutely would have moved out into a couple other kind of asset classes that are highly restrictive by the amount of money that you have, which makes it far less competitive to a degree, way more opportunities to a degree and way more structurally advantage",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 60,
      "start_timestamp": "00:14:59",
      "start_timestamp_seconds": 899.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=899"
    }
  },
  {
    "text": "make more gold coins, he absolutely would have moved out into a couple other kind of asset classes that are highly restrictive by the amount of money that you have, which makes it far less competitive to a degree, way more opportunities to a degree and way more structurally advantage in terms of leverage provided. So it's not. I don't think this is an expression at all of him just trying to build more gold coins. So, Cedric says, so what asset classes five extra money in three years? Honestly, a bunch of stuff can. It's, but the thing that we have to remember is that there are economies of scale that we have to be aware of. So let's draw it out. I'll show you what I mean. So, if you have 10, your ability to double this money into 20 is not well suited to buying 10 of stock. Something that makes more sense for you to be able to double your 10 is you go do Uber for two rides and you get 10 in total tips, you've doubled your money. This is a pretty efficient way to do it. Okay, so now let's scale this 100,000. What's a good place to double 100,000? The stock market, the stock market is literally perfect for that kind of thing. The reason why the stock market is perfect for this kind of thing is because this amount of money cannot get you a ton of leverage in the kind",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 60,
      "start_timestamp": "00:16:14",
      "start_timestamp_seconds": 974.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=974"
    }
  },
  {
    "text": "What's a good place to double 100,000? The stock market, the stock market is literally perfect for that kind of thing. The reason why the stock market is perfect for this kind of thing is because this amount of money cannot get you a ton of leverage in the kind of real estate that offers the ability to double and triple and quadruple. So 100,000 in residential real estate, you still can get into a decent-size house, but residential real estate moves very different than commercial. So you are way too small right now to fuck with commercial real estate with this kind of money stock market, literally perfect, perfect place to grow your money. Now, as you start getting into the tens of millions of dollars, your scale is now different. The places that you can play are now different and there are different asset classes that can start to make a lot of sense for your money. So, for example, if you get into angel investing, for example, you can absolutely double your money relatively quickly in angel investing. What's the drawback? Ones of fucking risk. Buckets of risk. Drows of risk, but really effective place if you can find the right kinds of deals. I've been in angel investing for a long time now. So, there's a ton of potential there. Commercial real estate is another fantastic place depending on the asset class and depending on what you're doing. If you're doing value add to properties or",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 60,
      "start_timestamp": "00:17:47",
      "start_timestamp_seconds": 1067.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=1067"
    }
  },
  {
    "text": "can find the right kinds of deals. I've been in angel investing for a long time now. So, there's a ton of potential there. Commercial real estate is another fantastic place depending on the asset class and depending on what you're doing. If you're doing value add to properties or if you're scooping up properties that have been really beaten down, again, it's another really great place to double your money and then some because you gain access to way more leverage than you can in the stock market. Now, that's just going back to other ways to go about growing your money. That's not to suggest at all that you can't continue building your money in the stock market, of course you can. Just saying that there's other places that actually start to make a little bit more sense in terms of the leverage provided against the risk that you're taking because as you're getting into different kind of, as you're getting into different kind of asset classes, for example, looking at something 10 million, if you wanted to double your 10 million by trading a single stock, GameStop, for example, you have to use the 10 million. You have to put all of the 10 million into the stock so that then it can do what you want it to do to try to double your money. You have to use your money to do that. With real estate, you can take that 10 million and you can",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 60,
      "start_timestamp": "00:19:15",
      "start_timestamp_seconds": 1155.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=1155"
    }
  },
  {
    "text": "have to put all of the 10 million into the stock so that then it can do what you want it to do to try to double your money. You have to use your money to do that. With real estate, you can take that 10 million and you can break it out into a bunch of different down payments for things so that instead of having all 10 million in one asset class hoping that that one doubles, you can have it into multiple deals that still provide you full access to the potential gains because of the leverage provided by real estate. The completely different thing. So all of that not to get super far off topic, but that's to answer. It looks like Cedric's question is that there are a lot of things that you can put capital into the main thing to keep in mind is that it changes as your resources scale. That's the main point. What you're able to do is going to change massively by resource scaling. And it looks like this needs to be squished down a little bit so you guys can see the edge of this. Huh? There we go. I was wondering why that was like so far over. Sweet. Rory and Titi. Hey, yo, Rory and Titi, what up? Good to see you. Shout out to Rory and Titi as you know, everybody that's one of the one of the greatest names that we have here. That Lauren",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 60,
      "start_timestamp": "00:20:25",
      "start_timestamp_seconds": 1225.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=1225"
    }
  },
  {
    "text": "I was wondering why that was like so far over. Sweet. Rory and Titi. Hey, yo, Rory and Titi, what up? Good to see you. Shout out to Rory and Titi as you know, everybody that's one of the one of the greatest names that we have here. That Lauren says, what if your account is three and a half K and three Ks in GME? Oh, I see Rory and Titi said gas, not a full porter blast for me. Yeah. So Lauren, it looks like Rory and Titi is now disappointed in you because it looks like you have more money that could be in a stock. That's not. You're kind of reminded me of Warren Buffett by sitting on all of that cash, right? I think Warren Buffett just offloaded more of his Apple stake. And I don't even know how much cash that dude's sitting on at this point. It's like a comical, comical amount. But because even that's another great example, Warren Buffett is a great example of like on the institutional side. Somebody that's been able to make a lot of money through markets, but he's not doing it through trading. He's literally buying, he's buying the entire company and he's running companies. He's running businesses. That's what Berkshire Hathaway does. So it'll hold stock for sure, right? It absolutely gains exposure to stock. But a lot of the holdings that he has are things that essentially they're going to input and work with",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 60,
      "start_timestamp": "00:21:29",
      "start_timestamp_seconds": 1289.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=1289"
    }
  },
  {
    "text": "he's buying the entire company and he's running companies. He's running businesses. That's what Berkshire Hathaway does. So it'll hold stock for sure, right? It absolutely gains exposure to stock. But a lot of the holdings that he has are things that essentially they're going to input and work with management and actually run a business. So that's just a, I think a fascinating point about him. That's what he says. Kitty needs to buy this shit. Damn it. Yeah, that's and that's a really interesting thing that we're going to have to talk about. So first, let's kind of summarize some of the main things that we saw going through his trades. And I would love to hear from you as well because a lot of you have been following along this whole series as we've gone. So a lot of you have seen everything that I've seen. So as you think about this stuff that we've looked at so far, what do we think? What do you think about the trading approach, the trading style? There's a bunch of stuff that jumps out to me, which obviously I will happily, I'll happily explain my thoughts, but I don't want to offer them before you guys have a chance to share yours because I don't want to add any bias to the way that you're thinking. But I think that there's a ton, literally a ton of really, really, really interesting things to pull out from his approach. So",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 60,
      "start_timestamp": "00:22:34",
      "start_timestamp_seconds": 1354.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=1354"
    }
  },
  {
    "text": "want to offer them before you guys have a chance to share yours because I don't want to add any bias to the way that you're thinking. But I think that there's a ton, literally a ton of really, really, really interesting things to pull out from his approach. So I'll give you a couple of seconds there. Vladimir says, Bezos sold another three billion of Amazon stock on Friday. His girlfriend must be fun. Listen, man, if you're out there trying to build new mega yachts, it doesn't happen, right? It doesn't happen overnight. You're going to have to use a couple dollars for it. So yeah, he seems to say, I don't think he's done with GME. I don't think so either. I see, I see nothing that leads me to believe that he's moved away from GameStop. I don't see that at all. One of the things I'm really curious about from his perspective is like genuinely, how does he view his role in the community? Because there is absolutely a 100 reality to the fact that tons of people idolize him, which is okay, right? There's nothing inherently wrong with that. But the thing that makes me a little more interested is that tons of people literally try to follow what he's doing and he knows this. I don't know how he thinks about that. And I've spent actually quite a long time thinking about that. Rowan Tady says he literally thinks he's Batman. I think",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 60,
      "start_timestamp": "00:23:48",
      "start_timestamp_seconds": 1428.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=1428"
    }
  },
  {
    "text": "me a little more interested is that tons of people literally try to follow what he's doing and he knows this. I don't know how he thinks about that. And I've spent actually quite a long time thinking about that. Rowan Tady says he literally thinks he's Batman. I think he's sort of Batman. The reason why I say I think he's sort of Batman is again like Batman has a little bit of a direct impact. And if I were to look at the vast majority of people who trade GameStop trying to copy what he does, I would wager the majority of them have lost money. Like that, that would be my genuine guess. I don't want it to be true. But that would absolutely be my guess. So the reason why I say that is because if Rowan Kitty was really trying to be like Batman and genuinely trying to help and save people from evil or whatever evil in this case just being the stock market or helping them make money whatever the case is, I'm not actually sure that I see that happening here. I don't. And the reason why I say that is because if he was trying to do that, Rowan Tady says you clearly haven't watched his meme movie. Let's take a look at it. I think I have seen it. I'm pretty sure because I know that he has references to Batman, Joker and stuff like that. I'm just talking in",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 60,
      "start_timestamp": "00:25:03",
      "start_timestamp_seconds": 1503.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=1503"
    }
  },
  {
    "text": "if he was trying to do that, Rowan Tady says you clearly haven't watched his meme movie. Let's take a look at it. I think I have seen it. I'm pretty sure because I know that he has references to Batman, Joker and stuff like that. I'm just talking in terms of like his actions, like what he's functionally doing. And he's a smart dude. He's a really smart dude. And this goes back to my prior point that I know that he knows that he has a direct impact on how GameStop moves in the short term. He has a direct impact on investor and trader behavior as it relates to GameStop. I know that he knows that. So then the question becomes what does he think about that? And how does he handle that kind of responsibility? Because I don't know. I don't know how he thinks about that. Even with the stuff that I do in such a small scale, I still contest with like, what's my responsibility? Like as it pertains to what other people do. Because even as I talk about different things, that's one of the reasons why I'm so careful about the stuff that I talk about, when I talk about it, how I talk about it is because no matter what I do, people try to copy what I do. And then I'll get emails from people saying like, oh yeah, what do you think I should do? I put on this",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 60,
      "start_timestamp": "00:26:10",
      "start_timestamp_seconds": 1570.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=1570"
    }
  },
  {
    "text": "that I talk about, when I talk about it, how I talk about it is because no matter what I do, people try to copy what I do. And then I'll get emails from people saying like, oh yeah, what do you think I should do? I put on this too. And like the first thing I think is like, you shouldn't have fucking done anything based on what you think I'm doing. But anyways, all that aside, he knows all this stuff. And I'm curious what I'm curious what he thinks about it. And I'm curious what level of responsibility he takes because there's a big reality here that again, it's just reality. Let me grab Reddit. And let me, oh no, let me just go to his thing really quick. Okay. So, genuine question, genuine question from you guys. I'd rather be skiing. Hey, yo, I'd rather be skiing. Just hooked 10 people up with a trading, outlier trading membership. So thank you, I'd rather be skiing for supporting the channel, supporting the work and you're everybody that got hooked up. Make sure that you say, thank you to him. But one of the things that I look at here, is genuinely, I'm going to put a poll here. All right. So the question and the poll here is, did you genuinely think RK was going to buy into Chewie within 15 days of this yellow update? My answer is no. If I could vote mine 100 would",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 60,
      "start_timestamp": "00:27:36",
      "start_timestamp_seconds": 1656.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=1656"
    }
  },
  {
    "text": "at here, is genuinely, I'm going to put a poll here. All right. So the question and the poll here is, did you genuinely think RK was going to buy into Chewie within 15 days of this yellow update? My answer is no. If I could vote mine 100 would be no. There is nothing, nothing about this that I would have thought that about at all. Vladimir Putin says he publishes many disclaimers on his YouTube channel. I think he's doing a harm. Sort of. I don't think he's doing it any harm either because I absolutely believe in general. I absolutely believe that he should be able to do whatever he wants and then people are responsible for themselves. That's what I believe. There's a reality. There's a reality that there's a lot of really young people or just people who don't think clearly or things like that that aren't as rational and aren't as capable of making good decisions. And there's a reality that people that ascend to different kind of social statuses that they pick up as they gain social status. There's a reality to their influence. So I disclaimers or not, I agree with you. He has disclaimers. Right. For sure. But the disclaimers don't change the behavior. People are so used to the disclaimers. So. Roryntiddy says, why do you think you spend so much time teaching people like us? Oh, I think he loves the community. I think he loves everybody. I think",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 60,
      "start_timestamp": "00:28:53",
      "start_timestamp_seconds": 1733.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=1733"
    }
  },
  {
    "text": "He has disclaimers. Right. For sure. But the disclaimers don't change the behavior. People are so used to the disclaimers. So. Roryntiddy says, why do you think you spend so much time teaching people like us? Oh, I think he loves the community. I think he loves everybody. I think he loves the stock. I think he loves doing this. I absolutely again, I don't think he's a bad actor literally at all. I'm just saying that going back to the Batman concept. If he was really trying to be quote unquote Batman and like save and help people, you have to work with what you have and what the community is. And the fact that essentially the overwhelming majority of people thought the same thing I did where the last time we saw an update, there's a big move out of GameStop. There's a reality if, for example, he got out of GameStop. I don't know that he got out of GameStop with that's totally up for debate. Nobody knows. And that's another point that actually bolsters this point. The fact that nobody knows is telling that he's doing stuff not just for trying to help people, but he's also playing his own game with his own rules to achieve his own ends. So the reason I bring that back is because as people will follow him into something like GameStop. And then if, let's just say if hypothetical if don't know either way, if he did sell his",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 60,
      "start_timestamp": "00:30:42",
      "start_timestamp_seconds": 1842.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=1842"
    }
  },
  {
    "text": "also playing his own game with his own rules to achieve his own ends. So the reason I bring that back is because as people will follow him into something like GameStop. And then if, let's just say if hypothetical if don't know either way, if he did sell his stock to then get into Chewie because he needed the 200 million or so to get into Chewie, if we go back to the stock on 13 June, we got to go back a little further. If he unwound somewhere in here that pushes the price of the stock down, at this point, the stock was still light enough that him unloading a large amount of shares would undoubtedly move the stock near term. So I think in general, he has a tremendous amount of influence. And I'm just curious how he thinks about it. I don't think he should do anything different. I think every person should be responsible for what they do. That's what I think. So going back though to like his broader motivations, that's the part that I can't fully unravel. I'm very interested because it's it's just a mystery as it sits now because I can see elements of all these different things coalescing. But there's definitely not some sort of like clear output that I can get my arms around right now. It's just not there. It's literally and that's going back to the original question I got from somebody earlier of, you know,",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 60,
      "start_timestamp": "00:32:00",
      "start_timestamp_seconds": 1920.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=1920"
    }
  },
  {
    "text": "can see elements of all these different things coalescing. But there's definitely not some sort of like clear output that I can get my arms around right now. It's just not there. It's literally and that's going back to the original question I got from somebody earlier of, you know, why do I focus on this so much? Because I'm literally watching a fucking anomaly and I am fascinated by it. Absolutely fascinated by it. Chicken nugget says like his livestream, GME was halted on and off multiple times during a stream, his silence creates more power behind the words. Yeah. Well, and this goes back to another thing that we've talked about with respect to just communication in general. Because one of the things that I've talked about is that like if he genuinely was trying to communicate via memes and stuff like that, a lot of what he would be doing wouldn't be as cryptic as it sits. Because again, like the messages are clear as mud. Some of them, I think the ones that he really wants to connect to people are very clear clear as day. I think it's almost difficult to mistake it for something else. We can take a look at like and I talked about this very, very early on when we saw all the movement happening with Chewie. The very once we understood this to be Chewie, which a lot of people guessed early on nobody really knew. But that was the",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 60,
      "start_timestamp": "00:33:42",
      "start_timestamp_seconds": 2022.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=2022"
    }
  },
  {
    "text": "else. We can take a look at like and I talked about this very, very early on when we saw all the movement happening with Chewie. The very once we understood this to be Chewie, which a lot of people guessed early on nobody really knew. But that was the guess. And the first thing that I picked up on that I told you guys about is that there's just green eyes. I know that there's like the look left look right as part of the Kansas City City Shuffle. So I'm sure that's baked into this. But I didn't read into that part at all. I just think that this is him playing games because he likes Ryan Cohen and he's in here for the Lowles. But one thing I think unequivocally the case is this here is once we understood this is Chewie. It's clear as day, right? Dog, green eyes, buy. As soon as this came out on the 6th of September, I made a video about it and I immediately took this to believe him is selling. Could it mean something else? Could. I am pretty fucking confident that this was a clear message designed to be clear because he was trying to actually communicate something very specific and he wanted people to understand what it meant. This is a really clear communication in my opinion. He's still doing his game. He's still playing it via memes. But this is much more clear than people that",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 60,
      "start_timestamp": "00:34:54",
      "start_timestamp_seconds": 2094.42,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=2094"
    }
  },
  {
    "text": "be clear because he was trying to actually communicate something very specific and he wanted people to understand what it meant. This is a really clear communication in my opinion. He's still doing his game. He's still playing it via memes. But this is much more clear than people that are trying to interpret, for example, the the list of emojis. That's clear as mud. I mean, it's clear as mud. That's not to say that there's no meaning behind some or all of them or whatever. But if there is, nobody fucking knows it. So then it's not really communication. If nobody understands the message, that's just cryptic messaging. But nobody gets it because I've seen nobody nail what those emojis mean. It's everybody just guessing, right? Fully so because nobody fucking knows. So that's one of the things I can pick up as I spend time looking at him is that when he wants to be understood, he makes it so. When he wants to be less understood, he makes it so. And I think that's exactly I think that's exactly the the levels of communication that he uses. Again, he's fucking smart. He literally knows all of this. Now I'm not saying anything at all that's novel. He knows all of this. He's a smart, smart dude. That Lauren says the amount of holds during his live stream is wild. Yeah, because the market during that live stream, again, the market acknowledges the fact that if he",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 60,
      "start_timestamp": "00:36:13",
      "start_timestamp_seconds": 2173.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=2173"
    }
  },
  {
    "text": "this. Now I'm not saying anything at all that's novel. He knows all of this. He's a smart, smart dude. That Lauren says the amount of holds during his live stream is wild. Yeah, because the market during that live stream, again, the market acknowledges the fact that if he said anything pertaining to GameStop during that period, it would go wild because the market acknowledges and knows that he can and does influence the price. So if you think about it from a institutional perspective, I'd rather be saying he says he was proving he's not the one controlling the stock price that the system accuses him for. No, it's that's not the case at all because he does control the stock price. But he doesn't that people confuse these things massively. Just because he can influence the stock price doesn't mean to your point that he controls it. I don't think anybody thinks that he controls where GameStop goes. Nobody thinks that. But most people acknowledge the fact that he absolutely does influence price. And like most individual actors, just like what's that research firm that does. The fuck is it that they do the not citron research that's one of them in Denver. Pindenburg research. They also influence price citron influences price. They know this, right? That's exactly why citron was doing what they were doing because they knew they influenced price and they could play games around it. So all I'm saying is that there's a",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 60,
      "start_timestamp": "00:37:42",
      "start_timestamp_seconds": 2262.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=2262"
    }
  },
  {
    "text": "that's one of them in Denver. Pindenburg research. They also influence price citron influences price. They know this, right? That's exactly why citron was doing what they were doing because they knew they influenced price and they could play games around it. So all I'm saying is that there's a difference between influencing price, moving price temporarily. So like for example, during that GameStop live stream, if he had said something like, I don't like to I don't like to stock anymore, I'm getting out. What do you think would have happened? This stock would have fucking cratered. It would have absolutely cratered if that happened again, hypothetical. But if it did, it would have cratered. He knows that the market also knows that. So while he's on the live stream, the reason why the stock is flying all over the place is because there's so much volatility around him speaking because nobody knows what he's going to say. It's a live stream. Nobody knows what the reaction is going to be. So if you look at the volatility during that live stream, it was astronomical as it should be. Because things he say can and do influence the short term price movement of the stock. And he's a really big portfolio during the live stream during the live market. There's a reason why earnings are after hours to decrease that kind of volatility. If earnings were during hours, it would be just like that. It would be just like",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 60,
      "start_timestamp": "00:39:04",
      "start_timestamp_seconds": 2344.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=2344"
    }
  },
  {
    "text": "term price movement of the stock. And he's a really big portfolio during the live stream during the live market. There's a reason why earnings are after hours to decrease that kind of volatility. If earnings were during hours, it would be just like that. It would be just like that for the vast majority of them. So it was essentially a live earnings event. But the market was open and it's what the dude that came on to the stream, looking like he would, I got to pull that up. That is, I think that's one of the times when I realized I was in love with this guy because the way that he started that live stream was like, Epic doesn't even encapsulate it. Epic fall short. I don't know what's bigger than Epic. But whatever is bigger than Epic is what it was. I don't know what's bigger than Epic. But whatever that is is what this was in my opinion. I don't. Legendary. Thank you. Yeah. Legendary. I think legendary is the part. Thank you guys. I was at a loss for words. I think legendary is exactly what this was because the fact that he started the stream like this. This. This and as he's doing this, as he's doing this, the fucking news stations are streaming him. So there's these people in fucking suits and ties and like professional people on professional news sites that are streaming this. It was so epic. I just",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 60,
      "start_timestamp": "00:40:33",
      "start_timestamp_seconds": 2433.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=2433"
    }
  },
  {
    "text": "started the stream like this. This. This and as he's doing this, as he's doing this, the fucking news stations are streaming him. So there's these people in fucking suits and ties and like professional people on professional news sites that are streaming this. It was so epic. I just knew that this dude is fucking incredible. Chakin Nugget says, wasn't he like 20 minutes late too? I think he did that once he realized that the news stations were following him because I don't think that he would have been unnecessarily 20 minutes late for all of his people. Like I think that he saw the news stations started like rolling his stuff. And I literally just think it was to fucking the news station. That's actually another great question for his other live streams. Was he on time like when he was live streaming for you guys or was he late to those? Because my sense is that he would be generally on time, but I can also see like the Conor McGregor effect where some people loved Conor McGregor so much that they couldn't care less that he was late. It's like the exact opposite of my brain. If somebody's not punctual, I don't fuck with that. Like punctuality is very important to me, but I understand a lot of people are more La Jai fair about that on time and stoked to start if I recall correctly. Yeah, that would be my guess is that when",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 60,
      "start_timestamp": "00:41:58",
      "start_timestamp_seconds": 2518.42,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=2518"
    }
  },
  {
    "text": "brain. If somebody's not punctual, I don't fuck with that. Like punctuality is very important to me, but I understand a lot of people are more La Jai fair about that on time and stoked to start if I recall correctly. Yeah, that would be my guess is that when he was doing streams for the community, my guess is that he probably would have been on time. And yeah, I think here he absolutely saw that they were streaming that they were streaming his stream. And the opportunity to just fuck around with them and do this. Oh, God, I actually want to see if I can find a video of like CMBC. Was that one of the groups that streamed him? I just want to like I want to see what they talked about. CNBC roaring kitty live stream. Look at these two results. Look at these first two results. Look at this guy. Oh my God, this is epic. That's so good. It's so good. Oh, they have them talking and stuff. Well, they probably would edit out the part that they were like sitting there like fucking idiots waiting for him. God, that's so funny. That's so fucking funny. So fucking funny. But yeah, anyways, the reason why the stock was flying around like that is because Roenton is just play the audio. I don't think we can. The intro to this one or on one of these. I think I can only do like 10",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 60,
      "start_timestamp": "00:43:53",
      "start_timestamp_seconds": 2633.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=2633"
    }
  },
  {
    "text": "so fucking funny. So fucking funny. But yeah, anyways, the reason why the stock was flying around like that is because Roenton is just play the audio. I don't think we can. The intro to this one or on one of these. I think I can only do like 10 seconds because then YouTube turns me off. But which ones we can try? Play the audio with which one? This one or this one? I mean, I'll 100 risk it. News coverage. You can on news. No, you can't. So the thing about fair use is to talk about that for a second is that I can argue the point after the live streams over for them to release it. Well, what they do is during the live streams we've done this before, they literally they cut off the live stream and then they don't let me reconnect. So it kills the live stream and then I can appeal it and I could say no, this was fair use. We were talking about it in a transformative manner. Like you can absolutely argue it, but that it kills the live stream. So I'm still again, we get like 10 seconds that I know we can absolutely run it for like 10 seconds. So if you let me know which one I'm happy to let it run for a few seconds. Again, I'll risk it for this because it's hilarious, but I just don't know which one is the right one",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 60,
      "start_timestamp": "00:45:30",
      "start_timestamp_seconds": 2730.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=2730"
    }
  },
  {
    "text": "that I know we can absolutely run it for like 10 seconds. So if you let me know which one I'm happy to let it run for a few seconds. Again, I'll risk it for this because it's hilarious, but I just don't know which one is the right one because they got two different dudes covering two different sections or the this one. Okay. And is this the beginning of it? All right, here we go. With breaking news because the live stream has finally started, you can see that right there. About 28 or so minutes late, but nonetheless it is underway and we'll see exactly what's going to happen there. Andrew left still standing by will give you updates when they happen. Judge for yourself, what's going on on your screen? You could tell that this dude is so disenfranchised about this. You could tell that he's sitting here thinking like what the fuck? Here I am in a fucking suit and tie. He's been working for 50 years straight. He's been sucking dick for all the people at the place so that he could get his spot on the desk. He has to bow down to whoever's on the teleprompter to make sure that they put the right shit on. And meanwhile, he's looking at this dude who starts his stream 28 minutes late. The fact that he said 28 minutes late, right? It just it tells you you can tell he was pissed off about",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 60,
      "start_timestamp": "00:46:54",
      "start_timestamp_seconds": 2814.82,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=2814"
    }
  },
  {
    "text": "whoever's on the teleprompter to make sure that they put the right shit on. And meanwhile, he's looking at this dude who starts his stream 28 minutes late. The fact that he said 28 minutes late, right? It just it tells you you can tell he was pissed off about that. And the fact that he's looking at a stream with a dude that's dressed up like this that is more money than he will ever have. That's got to be infuriating. You got to. Oh, my God. It's got to be so maddening. You're like, I have to do news on this guy that his band-aids on his shirt. They're literally band-aids on the fucking t-shirt. Oh, God. What did I actually didn't remember that Andrew left was part of this? What did, um, is there a thing? Is Andrew left in there? Because I want to I want to take a look at that. We had a switch to stand in. Man, that's. Andrew left goes up. Sitra was manipulating. But did they, um, did he talk? I was curious if they if Andrew left said anything during this. Oh, man. This is so funny. Roentit. He says, yeah, you've seen that it got run over on Jimmy shorts, closes positions. Then got back in and got ran over again. That sounds so so appropriate. What is the latest with that, dude? He kind of fell off the ether. Didn't he? Andrew left. Update. Here it is. Um,",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 60,
      "start_timestamp": "00:48:32",
      "start_timestamp_seconds": 2912.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=2912"
    }
  },
  {
    "text": "yeah, you've seen that it got run over on Jimmy shorts, closes positions. Then got back in and got ran over again. That sounds so so appropriate. What is the latest with that, dude? He kind of fell off the ether. Didn't he? Andrew left. Update. Here it is. Um, that is a rainman. He entered a plea of not guilty trial set for 30 set. Oh, so trials going on right now. Offwind says his trial was delayed a year. Where does it when did that happen? This looks like the latest. No, this is from 11 September. This one's from four October. I see it here. So from 5th of September. I see it here. Okay. So this is from five September. This one's from four October. Let's look at this. Let's look at these in order. So this one from five September. So this is what like a month ago. Will face trial in September 25 over allegations committing fraud. Federal judges court document Wednesday slated later this month. Yeah. Okay. Also, what's for dinner tonight? You guys think in some Mexican food, eh? I don't know. I don't know. I don't really get down with those. I have no problem with like raw fish per se. Like sushi is fine, but I don't go out of my way to get raw fish. Like if it's there and across my path, I will eat it, but I'm not going to purposely go searching for raw fish. But",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 60,
      "start_timestamp": "00:50:09",
      "start_timestamp_seconds": 3009.38,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=3009"
    }
  },
  {
    "text": "I have no problem with like raw fish per se. Like sushi is fine, but I don't go out of my way to get raw fish. Like if it's there and across my path, I will eat it, but I'm not going to purposely go searching for raw fish. But okay. So this says not guilty. Okay. And this has asked the judge to dismiss the lawsuit by the SEC. Fails to state a claim because it neither alleges a cognizable theory of fraud nor alleged sufficient facts to support the theory alleged. I thought it was. So okay. So it still looks like it doesn't look like there is a plea deal that I see yet. This looks like it's still slated for 30 SAP. Left to pleaded not guilty far more than a decade. Problem in court. Yeah. So same overall, same language, but it looks like no, no change there as far as I can see. God, that's so good. What an epic, what an epic entry. So uh, Royntady says that's his lawyer's Hail Mary argument. He's not going to win. We don't know. Here's the problem is that there are absolutely instances where what I would consider to be like pretty slimy people who have pretty clearly done some pretty shitty things have gotten off the hook. And we saw one of those examples with like pretty damn clear evidence as far as like a normal person would look at of pump and dump in",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 60,
      "start_timestamp": "00:52:05",
      "start_timestamp_seconds": 3125.14,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=3125"
    }
  },
  {
    "text": "would consider to be like pretty slimy people who have pretty clearly done some pretty shitty things have gotten off the hook. And we saw one of those examples with like pretty damn clear evidence as far as like a normal person would look at of pump and dump in manipulation. And most of them got off. The only person that didn't got off was the one that took the plea deal in the beginning because he thought that they were fucked because he knew that they did it. So yeah, it's, it's an unfortunate reality. It's one of the good things and the bad thing simultaneously about the US legal system is that there's in general, it's not perfect. Nothing is perfect. Definitely has plenty of gaps. But in general, it gives a lot of benefit of the doubt to the person that's going through the process. So yeah, there is a, there is a reality that like if there's an issue with the way that they collected their evidence presented it, house documents, like there's a lot of things that have to be done correctly for it to get successfully all the way through. Which again, in the case of somebody like left, I couldn't possibly, that's like one of those ones where I think like, yeah, you know, do process, you know, if only we could do like do process by vote, right? Maybe we need to get, get back to, you know, just, just being able",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 60,
      "start_timestamp": "00:54:03",
      "start_timestamp_seconds": 3243.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=3243"
    }
  },
  {
    "text": "case of somebody like left, I couldn't possibly, that's like one of those ones where I think like, yeah, you know, do process, you know, if only we could do like do process by vote, right? Maybe we need to get, get back to, you know, just, just being able to like stone people in a town square, something if you slightly don't like them, the problem with that, problem with that is the Salem witch trials then become a thing where masses start burning people at the stake because somebody has a wart on their nose or, you know, something unfortunate like that. So, you know, you also, you kind of can't trust people either. That's the tricky part about this whole thing. So, roaring titty says either way, Keith trapped left on his livestream. How did he trap them? Again, I, I'm very confused by people thinking that anybody thought that like this guy was actively manipulating the stock price. I don't, I don't, what's the origin for that argument? I don't understand it because I, yeah, could you help me understand that? I don't really, I don't get it. I'd rather be skiing says who left. No, I just mean, because I've heard a couple people in the chat so far say that like the reason why the cat did this was to like prove he wasn't manipulating the stock price. But I'm just curious like prove to who because who thought that? And where, where do",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 60,
      "start_timestamp": "00:55:17",
      "start_timestamp_seconds": 3317.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=3317"
    }
  },
  {
    "text": "I just mean, because I've heard a couple people in the chat so far say that like the reason why the cat did this was to like prove he wasn't manipulating the stock price. But I'm just curious like prove to who because who thought that? And where, where do we think that somebody thought that? So I see like I don't see any connection there whatsoever. I don't understand it. Willie says it's a fine line to crawl market manipulation. Oh, sort of. I mean, market manipulation is a pretty clear definition. And like that's even what again, that's why there are cases where people kind of clearly are and they're still not guilty of it because it's not easy to prove. It's the media citadel left saying that not very little people, but who do you guys have any? I'd rather be skiing. Do you have any like news articles or do you have any? Do you have anything I can read that talks about citadel or the media, whoever the media is in this context that are saying that he's manipulating the price? I would, I would, I would, I'd really like to read that. I'd rather be seeing says they keep trying to investigate him for market manipulation, Kramer on that committee to again, you have to be so we have to be clear, right? They is very specific and they in the latest one that came out was actually an individual person that was just",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 60,
      "start_timestamp": "00:56:41",
      "start_timestamp_seconds": 3401.06,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=3401"
    }
  },
  {
    "text": "be seeing says they keep trying to investigate him for market manipulation, Kramer on that committee to again, you have to be so we have to be clear, right? They is very specific and they in the latest one that came out was actually an individual person that was just trying to get in his pockets. And if you recall, they rescinded the case, they what dropped it on Friday and they rescinded it on like Sunday. So, but that wasn't like they being large institutions or citadel or market makers or whoever. That was a group of people that were going to try to get into his pockets because there are pieces of shit. People suck that way. People are really shity that way. Okay, got it. H says search on Google and the first few articles have literally exactly what we're looking for. Perfect. Thank you. So for the Google search, what am I doing? I'm doing H. Do you have any like recommended search term? Citrone was on CNBC when Kitty went live and CNBC was live stream is live stream. That's hilarious. Yeah. H, what should I look for? Warren Kitty Ryan Boy, Coix Citrone, Ryan Boy Citrone. Got it. Okay, so I see the charges against him. Is this the dude that? No, I'm asking. So I'd rather be skiing up above. It said that it's the media in Citadel slash left saying that that being that roaring Kitty is manipulating the price of GME.",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 60,
      "start_timestamp": "00:57:58",
      "start_timestamp_seconds": 3478.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=3478"
    }
  },
  {
    "text": "Boy Citrone. Got it. Okay, so I see the charges against him. Is this the dude that? No, I'm asking. So I'd rather be skiing up above. It said that it's the media in Citadel slash left saying that that being that roaring Kitty is manipulating the price of GME. So I'm trying to see where that where that comes from. Like what whether it was a news clip that somebody saw it because again, one of the things I see people in the community do in general and it's just it's something that it doesn't work well with my brain is like people will hear things and then they'll they'll go through those things, right? They'll just keep saying it. But without some sort of source stock, I just want to see the source stock. Okay, cool. Roryntini says they set it on the CNBC clip we were watching. You mean like the longer clip? Because what we can watch the clip, I just have to turn off the sound, I think, because I think that's how YouTube detects when something's rolling. Okay, so it's the longer version of that clip got it. Stand by, let me grab that really quick. So CNBC roaring Kitty live stream full. That's from the cats. All right, let's see if it's this one. I'll save you guys the ad. And then let's see. I'm super interested. I assume that they'll have close captions. Here we go. We'll get an update on the",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 60,
      "start_timestamp": "00:59:27",
      "start_timestamp_seconds": 3567.06,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=3567"
    }
  },
  {
    "text": "really quick. So CNBC roaring Kitty live stream full. That's from the cats. All right, let's see if it's this one. I'll save you guys the ad. And then let's see. I'm super interested. I assume that they'll have close captions. Here we go. We'll get an update on the live stream from roaring Kitty live. Keith Gale is his real name. Dom Chu, what's been happening. Doesn't seem like a lot of news. Nonetheless, it's going on, monitoring this as you can see in the live stream right now. We're also keep a go close high on the market action. We are in the middle of what that's hilarious, by the way, I've never read a teleprompter before, but I just did what I would make fun of just about everybody for with respect to reading a teleprompter. I don't know if you guys caught that, but I was reading this right and it's moving relatively quick. And here I literally read this verbatim and we're also keep a go, which doesn't make any sense, but I was trying to read quickly enough to keep up with it for you guys. So I now have a little more compassion for those that fuck up reading a teleprompter because if that things moving that quick, I'm just trying to read the words. Okay. Close to the market action, we're in the middle of what appears to be the 13th, maybe trading halt of the session. So far, it just looks",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 60,
      "start_timestamp": "01:01:10",
      "start_timestamp_seconds": 3670.26,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=3670"
    }
  },
  {
    "text": "for those that fuck up reading a teleprompter because if that things moving that quick, I'm just trying to read the words. Okay. Close to the market action, we're in the middle of what appears to be the 13th, maybe trading halt of the session. So far, it just looks like we resumed trading again. So I think is by my count, I'll have to go back and check a lot, 13 trading haunts. Right now the volume stands currently at just around my might be a lag because things are going so quickly, 197 million shares have traded in for context over the course of the last 30 days. The average trading volume has been roughly 61 million. So saying it's very, very volatile. We have heard a lot of commentary. He did talk a little bit about the beery's drinking and what's going to happen in the NBA finals early on in the session. But now some of the maybe major, I guess development, even want to call it that he has not reiterated anything that he has expressed the overriding philosophy. If you will, that Ryan Cohen at the helm of GameStop is the person really turned this thing around reiterated some of those feelings. So this doesn't look like they're talking about him manipulating anything. This began again, 20 minutes late, down about 37. Volume is picking up on this. We will bring you anything more. But again, right now it doesn't seem Scott, like there's",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 60,
      "start_timestamp": "01:03:03",
      "start_timestamp_seconds": 3783.38,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=3783"
    }
  },
  {
    "text": "this thing around reiterated some of those feelings. So this doesn't look like they're talking about him manipulating anything. This began again, 20 minutes late, down about 37. Volume is picking up on this. We will bring you anything more. But again, right now it doesn't seem Scott, like there's anything terribly new. And nor is he talked about what that's what it ends. So yeah. So I go back to the original point though, if anybody has anything somewhere of where somebody from like Citroen left Citadel, a news agency, any of them had said that or that they're claiming that he's manipulating the stock. I just want to read it in context to be clear. I'm not, I'm not saying it argumentatively in that I don't believe that it's happened. It very well could have happened. But I want to read the context because based on the way that it's phrased in whatever the source document is, it probably has a different meaning than a lot of people are inferring. I'm guessing. So that's why I want to see it. And then I saw something about Massachusetts initiated investigations. That's all I've read from credible sources. Investigations are one thing, right? So let's see, roaring kitty investigation. So 30 June, I remember this. I was watching this stuff pretty carefully. And then for June 24, we can take a look at this one. Okay. Secretary of State investigating, roaring kitty's game stop trades. Share to screenshot Monday night,",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 60,
      "start_timestamp": "01:04:12",
      "start_timestamp_seconds": 3852.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=3852"
    }
  },
  {
    "text": "one thing, right? So let's see, roaring kitty investigation. So 30 June, I remember this. I was watching this stuff pretty carefully. And then for June 24, we can take a look at this one. Okay. Secretary of State investigating, roaring kitty's game stop trades. Share to screenshot Monday night, 5 million shares. Yep. It is investigating the trading practices of Brockton resident, roaring kitty. They're just talking about the stuff he's doing. Whether it would ban him regarding potential, let's read this. Sharing investigation sharing details about the investigation, saying it's too early. They also investigated when he worked at mass mutual. This latest activity, yeah, this talks about him coming back. Yeah. So there's no real details here. Let's see this. E-Trade having internal discussions about whether the band Keith Gill, who just disclosed a big position in game stop. The brokerage owned by Morgan Stanley reached a decision. E-Trade declined to comment, saying we don't publicly discuss individual activity of our clients. It's brokerage found. Yeah. So there's no real. There's no real nothing in here. So far at least. Search Keith Gill mass mutual on it. Keith Gill mass mutual. This one. This one. This one. These are same things. Okay. So let's see. Mass mutual and best in subsidy agreed to pay 4.75 million to resolve allegations by MSR. Fail to supervise its agents. Yeah. I mean, this is. This is fine. Yeah. This is no problem. This is the reason why this is no",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 60,
      "start_timestamp": "01:05:34",
      "start_timestamp_seconds": 3934.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=3934"
    }
  },
  {
    "text": "These are same things. Okay. So let's see. Mass mutual and best in subsidy agreed to pay 4.75 million to resolve allegations by MSR. Fail to supervise its agents. Yeah. I mean, this is. This is fine. Yeah. This is no problem. This is the reason why this is no problem is because when he was working there, he I'm sure he had very strict rules, compliance rules about what he could or couldn't do. Fail to detect the activities of Keith Gill, who should have been reporting them, which is correct. Inadequately supervised other agents, sure. Yeah. So they they had a sloppy admin process. Yeah. Titi says they had foreign employees who were acting but not registered. Yeah. I saw that up here. They're failing to register. So yeah. So this again, this isn't manipulation or anything. This is his company got fined as they should have because they his company. Like Keith Gill shouldn't have done this while he was working there. It's definitely against compliance. And then with that aside, his company should have detected it earlier to shut it down. Or fire him. And that didn't happen. So then because it came to light in such a public manner, then obviously they they figured it all out. So yeah, there's nothing wrong. Titi, I don't think there's anything in here that. Yeah, none of this surprised me at all. This this looks completely correct. Lack of oversight. So we already read that. What's this one?",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 60,
      "start_timestamp": "01:07:53",
      "start_timestamp_seconds": 4073.78,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=4073"
    }
  },
  {
    "text": "such a public manner, then obviously they they figured it all out. So yeah, there's nothing wrong. Titi, I don't think there's anything in here that. Yeah, none of this surprised me at all. This this looks completely correct. Lack of oversight. So we already read that. What's this one? Still probing Gill's activities around the Reddit rally. Yeah. Or Titi says you're asking what we're talking about with the investigation. No, I was asking. I was just asking if anybody has any sources, direct sources of any of these entities alleging that he is manipulating price. That's that's what I was asking for. The investigations themselves like that's not even an investigation into Roryne Kitty. That's an investigation into mass mutual because of the tie that Roryne Kitty had. But Roryne Kitty or Keith Gill in that sense. It wasn't even about him. That was about mass mutual. Let's see. When hedge funds that shorted a game stop were forced to buy it any price. Fuck them. Fuck them. See, this makes me so angry that these people were saved. That's the problem with bailouts is a lot of times a bailout has a specific purpose for the greater good, which I understand in the context of game stop not allowing entire financial collapse is smart. But I really, really hate that these guys get saved in the middle of it. Roryne City says, so Tron research founded by left did accuse Keith Gill of mark of manipulation June",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 60,
      "start_timestamp": "01:10:20",
      "start_timestamp_seconds": 4220.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=4220"
    }
  },
  {
    "text": "good, which I understand in the context of game stop not allowing entire financial collapse is smart. But I really, really hate that these guys get saved in the middle of it. Roryne City says, so Tron research founded by left did accuse Keith Gill of mark of manipulation June 2024. I saw that article titled Roryne Kitty's three energy and me position sparks mark of manipulation claims. Yeah. So that one that you're talking about. I remember reading that one and left is in he's in an interesting spot here. Andrew left. Roryne Kitty manipulation. I'm trying to find the original here we go. Does I remember reading like the actual thing that he put out? I forgot what it was. This one. I think this is what you are citing. Roryne Titty will take a look at that one too. So much as wrong said left. Monday was totally different. He puts his monster position no thesis, no short term options. I personally do not believe this is own personal money. Size of the trade was 150. Who's fucking money does he think it is? Who the fuck is going to give him 150 million dollars here? Let me try my business pitch for you guys really quick. Let me know if you would give me the money. Hey guys, I just want to grab a quick 150 mill from you so that I can buy options that expire in a month. Is that cool? Can I grab",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 60,
      "start_timestamp": "01:12:01",
      "start_timestamp_seconds": 4321.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=4321"
    }
  },
  {
    "text": "me try my business pitch for you guys really quick. Let me know if you would give me the money. Hey guys, I just want to grab a quick 150 mill from you so that I can buy options that expire in a month. Is that cool? Can I grab those really quick? Just just 150 mill. Oh yeah, if they expire out of the money, the money's completely gone. Yeah, that's a thing. I'm not really worried about that, but that is what would happen. Yeah, see, I guess it works great. So Roryne Titty says he was paranoid of Kitty. I think he thought it was this thing and then he his ass. Yeah, exactly. I think that left was frustrated that Roryne Kitty could, again, influence the price enough that it would fuck his positions. I absolutely think that for sure. I'm assuming he made 200 million first time. I just don't think it's his money. There should be some form of disclosure. If it's not, you know, that he went out there to really shake this world. I don't think there's anything GameStop is going to say in the next two weeks. What he's doing now is trying to take advantage of the retail traders, the same people that he's supposed to represent three and a half years ago. Yeah, like this is him just giving him really negative attributions because he's a fucking hater. Whenever someone shorts GameStop have to do it. Cauchy, it's sleigh.",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 60,
      "start_timestamp": "01:14:00",
      "start_timestamp_seconds": 4440.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=4440"
    }
  },
  {
    "text": "is trying to take advantage of the retail traders, the same people that he's supposed to represent three and a half years ago. Yeah, like this is him just giving him really negative attributions because he's a fucking hater. Whenever someone shorts GameStop have to do it. Cauchy, it's sleigh. It's different this time. I think if given the opportunity to short the stock was at 40 this morning, it's great. I don't recommend people short stocks. I don't think I think they won't have any patience. I remember reading an article by him where he was saying that like, he was saying some shit like it feels like it's different this time that he's doing something different or whatever. Yeah, so where's the actual post though? The Trone research prominent short criticized Gil or alleged manipulation in Diego appearing more like manipulation without a solid thesis. That's what it was. That's right. It was an ex post. I totally forgot about that. Totally forgot about that. I thought it was like an email thing that he sent out. I forgot. Significant near term options appearing more like manipulation without a solid thesis. Yeah. Backed by a larger entity. I'm also so curious like, did he ever justify whatever this means? Like, backed by a lot like what entity? I don't understand that part at all. Off Putin says, Gil walked him in the casino and put 68 million on black and one left his jealous. I mean, it definitely",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 60,
      "start_timestamp": "01:15:09",
      "start_timestamp_seconds": 4509.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=4509"
    }
  },
  {
    "text": "also so curious like, did he ever justify whatever this means? Like, backed by a lot like what entity? I don't understand that part at all. Off Putin says, Gil walked him in the casino and put 68 million on black and one left his jealous. I mean, it definitely does seem like part of that. I absolutely think that. So Tron just rambled about unsubstantiated claims says, ball, I completely agree. Yeah. I mean, this is all that's I couldn't agree more. Like, I think this is all madness, right? To suggest something like this, we think someone is backing Gil. There's no way he made this size trade alone. Like, who? Who? Like could again, like objectively, could there be somebody backing him? Sure. Of course, there could be. But there's no evidence of it anywhere so far. So for him to say this like, as decisively as that is fucking crazy, it makes no sense. It's I completely agree with you guys that this is him just trying to be sour. And I think that he's trying to put a negative spin on him so that people start decoupling because I think left acknowledges that the cat can move the stock. He doesn't want the cat to move the stock because it hurts him. So I think he's trying to break apart the cat's ability to move the stock by disparaging the cat so that his thinking is that the people that follow the cat will read",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 60,
      "start_timestamp": "01:16:47",
      "start_timestamp_seconds": 4607.38,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=4607"
    }
  },
  {
    "text": "can move the stock. He doesn't want the cat to move the stock because it hurts him. So I think he's trying to break apart the cat's ability to move the stock by disparaging the cat so that his thinking is that the people that follow the cat will read this and then be enlightened and then stop following the cat, which would then decrease how much the stock can move. Because again, like the cat himself, he can move the stock to a degree, but not again, like impacting the stock is not like long term in nature. It's shorter term. But one of the reasons why we're in Kitty can impact the stock so significantly is because it's not just him. It's lots of people moving with him. So I think he sees this and he's trying to break that apart. Jordan says didn't Gil say in the live note, yeah, he said that as well. He said that it's his money. He said that it's his only account. He did say that. It's his only position. He said it's his only position. So yeah, this is just fucking bullshit to me. So Tron was the latest short seller to announce a short position that they are short GME again. They lost over a hundred million shorting GME. That's hilarious. Fuck him. For someone who's short GME, you don't pay much attention to your investment. V was buying in the money calls late April, May, 100K at a",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 60,
      "start_timestamp": "01:18:07",
      "start_timestamp_seconds": 4687.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=4687"
    }
  },
  {
    "text": "seller to announce a short position that they are short GME again. They lost over a hundred million shorting GME. That's hilarious. Fuck him. For someone who's short GME, you don't pay much attention to your investment. V was buying in the money calls late April, May, 100K at a time. Those trades were worth over 10 million each on May 13th and 14th. Yeah, it's awesome. You know, it's funny. We had the very same questions about your short positions in which they were reported at over 240 before the squeeze. So lost. Fucking crazy. So oh yeah, here. Sood for securities fraud. Yeah, who did this? This guy. This guy did it. So this dude. And I remember it because they filed it and they rescinded it as fast as they filed it. It was wild. I want to look at the dates. So that's what June 28th. June 28th. Yeah, they filed it on like the 28th and they pulled it back. I want to say like the 30th. I don't even think it made it through the weekend, which is classic. Well, he says it shouldn't be possible to short over 100 completely agree. I want 100 agree. It doesn't make any sense. I have no like how can you how can you short more than exists? Like that's Yes. Yeah, it's complete bullshit. It's absolute absolute bullshit. Dislike that fully. But yeah, this dude. I thought the timing of this was generally interesting. Oh yeah,",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 60,
      "start_timestamp": "01:19:22",
      "start_timestamp_seconds": 4762.26,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=4762"
    }
  },
  {
    "text": "100 agree. It doesn't make any sense. I have no like how can you how can you short more than exists? Like that's Yes. Yeah, it's complete bullshit. It's absolute absolute bullshit. Dislike that fully. But yeah, this dude. I thought the timing of this was generally interesting. Oh yeah, we have to update the map. I have to hop off in a minute. But before we go, we got to see if we have any new ads to our map. And so then we have to figure out for the for the next video on Saturday. One of the things that I want to do is like pick one of the specific ideas or themes and I want to analyze it in depth. So is there can you guys list out for me? A couple of could you list out a couple of like the primary theories around what's going on? And then I'll put it up to a vote to see which one we should go through in depth next week. I want to try to go through like all the different materials and understand how people are coming up with the theories more in depth. And then in the meantime, do we have any updates to our map? We have all the US. We have someone in Mexico, which is good. We have South America. We still have no Africans would be good to get one of those. The Madagascarian theories about what? There's like a ton",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 60,
      "start_timestamp": "01:21:25",
      "start_timestamp_seconds": 4885.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=4885"
    }
  },
  {
    "text": "in the meantime, do we have any updates to our map? We have all the US. We have someone in Mexico, which is good. We have South America. We still have no Africans would be good to get one of those. The Madagascarian theories about what? There's like a ton of different lore and just theories about either the cat or the movement of GameStop. And I want to start that's where I want to pivot to next. Okay, got it. Yeah, so let me try to reframe the question. So from my understanding in the GameStop community, there are different theories that are designed to try to explain what's going on. And to it seems in general to forecast when something is likely to occur again and why I would love to take a look at any of those primary theories. So one of them that I know about is like Biggie's theory. I don't know anything about it realistically. I don't remember anything about it, but I remember that Newton and I on our live stream had talked about that. I don't know if there are others similar to that. If not, we can just I can look up that one and see what we can learn because what I want to do is see what they're suggesting. And then I want to align it against the chart to see what like what has actually been done. So if there's like a Reddit post that talks about the",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 60,
      "start_timestamp": "01:22:50",
      "start_timestamp_seconds": 4970.42,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=4970"
    }
  },
  {
    "text": "up that one and see what we can learn because what I want to do is see what they're suggesting. And then I want to align it against the chart to see what like what has actually been done. So if there's like a Reddit post that talks about the theory or if there's a video that talks about the theory, I'd love to grab that stuff so that we can pick one and then take a take a good look at. Jack says Mo as tomorrow. Now that is a belief. And that one is a I love that one. That's hilarious. I absolutely loved it. I absolutely love that. So yeah, in you can you guys can like throw it in the discord. You guys can throw it in a YouTube comment or something whatever. But that's what I want to do for the next one is like actually go through the Superstalk and GameStop Reddit and see what kind of theories exist so that we can explore them a little bit more. So that's the game plan for next Saturday and for everybody's awareness. I have it in the newsletter for this coming week, but the production or the content schedule is going to be a little bit different. So I'm doing the outlier pro, the Patreon live stream, that'll be Sunday and Wednesday. Then there will be YouTube Lives Monday and Friday. And then Tuesday and Thursday, they're kind of ad hoc. Like if something's going",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 60,
      "start_timestamp": "01:23:59",
      "start_timestamp_seconds": 5039.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=5039"
    }
  },
  {
    "text": "or the content schedule is going to be a little bit different. So I'm doing the outlier pro, the Patreon live stream, that'll be Sunday and Wednesday. Then there will be YouTube Lives Monday and Friday. And then Tuesday and Thursday, they're kind of ad hoc. Like if something's going on, then sure, if not, then no. And the reason why I do that is because I take commitments very seriously. So for the last month, I told you guys I was going to live stream every day, which I did within reason. I think I missed a couple because of the travel, but otherwise I didn't miss anything. And so I still will probably live stream most days because I enjoyed a lot, but I am committing to those days specifically. And then we'll kind of see what happens as the week's go out. Then I'm still going to do the Saturday live streams for GameStop because I still feel like there's a little bit more that I still need to dig into. So yeah, that's the game plan. All right, gang, if you guys need anything, let me know. Be an ape, be an outlier or be an outlier ape. And I will catch you guys all around. Enjoy your weekend.",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 60,
      "start_timestamp": "01:25:18",
      "start_timestamp_seconds": 5118.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=5118"
    }
  },
  {
    "text": "outlier ape. And I will catch you guys all around. Enjoy your weekend.",
    "metadata": {
      "video_id": "JnY9onzLO_k",
      "title": "Roaring Kitty's Trade Fingerprint Pt9 | GameStop Analysis Live Ep17",
      "url": "https://www.youtube.com/watch?v=JnY9onzLO_k",
      "upload_date": null,
      "duration": 5195.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 60,
      "start_timestamp": "01:26:24",
      "start_timestamp_seconds": 5184.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JnY9onzLO_k&t=5184"
    }
  }
]