[
  {
    "text": "What's up everybody Eric here? Welcome back to another top the outlier podcast and today I have my favorite green chicken here with us our friends from Duneberg first off welcome and thank you so much for joining us. Eric great to be here and looking forward to a fantastic discussion. Yeah well so we got to start with the chicken in the room which is what's the genesis of the chicken? Yeah sure the green chicken is the well first of all I'm the head writer of a small team that publishes the Duneberg sub stack we launched it two years ago coming up here on May 3rd our two year anniversary. And we built this brand you know from scratch we have no social media presence whatsoever we were again this ultimate of consultants from the commodity sector focus on energy finance private equity venture capital crypto. And we decided to get into the content creation business after having consulted in the space for about 18 months and you know when you start from nothing you have to create something and and you know we many of the bigger content creators the brand is the face is the person and that that was not something we could do. And we had no pre existing social media to build from and so we decided you know the old adage of marketing as you can't be remembered if you don't stand out. And when we had our sort of initial",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 59,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=0"
    }
  },
  {
    "text": "person and that that was not something we could do. And we had no pre existing social media to build from and so we decided you know the old adage of marketing as you can't be remembered if you don't stand out. And when we had our sort of initial brand brainstorming sessions you know there's a whole market for sort of doom or ism or doom porn or pick your favorite sort of descriptor for it and a lot of it is sort of superficial and click baity and we decided that there was probably a. Anish in the market for a bit more sophisticated doom better written a little better edited a little better research show our homework and we love our Bloomberg terminal and so as we were just sort of brainstorming doomberg sort of just came out of it and then. The concept of chicken little getting a terminal and scrolling through the blueberg machine looking for headlines to be afraid of was one of the sort of. Rifts that we did as a team and we found this cheap clip art anybody can find it the green chicken with the stun dies well it's just a chicken with the stun dies and the clip art that we we purchased and then we colorized it with you know some of the colors from the Bloomberg keyboard and stuff just to just to be fun and. And you know we just launched it almost as bit of",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 59,
      "start_timestamp": "00:00:53",
      "start_timestamp_seconds": 53.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=53"
    }
  },
  {
    "text": "a chicken with the stun dies and the clip art that we we purchased and then we colorized it with you know some of the colors from the Bloomberg keyboard and stuff just to just to be fun and. And you know we just launched it almost as bit of a lot and took off. Beyond our wildest dreams and went paid a year ago and now we're you know the number one paid finance up stack in the world and amongst the top on on the platform across all categories which is you know crazy stunning humbling life changing. Trilling we've one of things I'm most proud of is the team has taken the time to savor the success we've not taken it for granted we don't suffer from the disease of more we've achieved way more than enough and way more than our wildest dreams and we have. Us and our families have been proactive and conscious about waking up every day and like pinching yourself and savoring the reality of having achieved something. That we're proud of that our kids are proud of that help support our kids and our families and friends and charities and things that we're passionate about and so it's been really a remarkable journey couldn't do it without our subscribers. And we are you know 100 subscriber supported and every subscriber's precious and and so yeah it's just been a real whirlwind so it's crazy but yeah once you build something like",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 59,
      "start_timestamp": "00:01:59",
      "start_timestamp_seconds": 119.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=119"
    }
  },
  {
    "text": "that we're passionate about and so it's been really a remarkable journey couldn't do it without our subscribers. And we are you know 100 subscriber supported and every subscriber's precious and and so yeah it's just been a real whirlwind so it's crazy but yeah once you build something like the green chicken you can't de-anautomize like we're talking before we came on the air like. Many many many people in Wall Street know who we are it's not a secret you know. Substack knows who we are when we meet with sub stack we meet as ourselves strike knows who we are obviously for KYC ML purposes our our bankers you know who help us. With the sort of business aspects of things heard our business plan before we went to paid and they know who we are obviously and. But if you de-anautomize you sort of destroy the brand to speak and so even if like. People guessed who we were or tweeted who we were we would just ignore it because you just can't acknowledge it and you just. I don't want to destroy that you don't want to pop the green chicken bubble you know and it's been such a good ride for us that we're. Honestly and sort of protect mode like we wake up every day make sure we don't do anything wrong. And then just keep doing all the things that have worked for us and so that that's the story the green",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 59,
      "start_timestamp": "00:03:03",
      "start_timestamp_seconds": 183.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=183"
    }
  },
  {
    "text": "it's been such a good ride for us that we're. Honestly and sort of protect mode like we wake up every day make sure we don't do anything wrong. And then just keep doing all the things that have worked for us and so that that's the story the green chicken. Yeah it's awesome I love it and a couple of following questions there so we're was your team did you all like work together for like another project before you pivoted over to Duneberg. Yeah we had a spoke consulting firm where we came to see sweet executives and family offices and our our sweet spot was a family office in the commodity space that was sort of running a business. We needed to get unstuck and then we'd bring us in and we would sort of think laterally and leverage our multiple decades of experience in the commodity sector as executives to. Unstick you know certain businesses on a locked value and make money and we had developed a very good book of business and then covert hit and we lost 85 of it in the span of six weeks and like every small business owner you know you have a we call it a high pucker factor moment like what are we going to do do we go back to get a job do we. We invent ourselves do we fold shop and go our separate ways and when you decide to stick it out in a",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 59,
      "start_timestamp": "00:04:03",
      "start_timestamp_seconds": 243.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=243"
    }
  },
  {
    "text": "you have a we call it a high pucker factor moment like what are we going to do do we go back to get a job do we. We invent ourselves do we fold shop and go our separate ways and when you decide to stick it out in a very famous hedge fund manager who I personally had called to get some advice as to how we might go forward and how we could rebuild our business said you know this is whole. So area of content creation that serves wall street or the content creators are super talented but they don't have your business training and sort of execution and discipline expertise that I've come to know of you and maybe you could build a book of business helping content creators run their businesses better and we did that we got. Very next phone call high profile client that we helped a lot and we're still very good friends with one of the few clients we kept but to answer your question we had a small consulting firm that was successful and covert hit. Then we had to rebuild ourselves like many small business owners and you know that 85 kick in the you know what was the best thing never happened to us on hindsight because while we had a good book of business it wasn't really our passion it was fun it was good money. I'm proud of the work that we did proud of the",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 59,
      "start_timestamp": "00:04:50",
      "start_timestamp_seconds": 290.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=290"
    }
  },
  {
    "text": "that 85 kick in the you know what was the best thing never happened to us on hindsight because while we had a good book of business it wasn't really our passion it was fun it was good money. I'm proud of the work that we did proud of the clients that we had proud of the clients that we've kept but since starting to work we've turned down all new clients and trimmed down the existing clients we decided to keep just the very core and and to bring us swamped that business to be totally transparent it's really been. It's you know eaten what you kill kind of as an entrepreneur you know like and the beautiful thing about the subscription businesses we can get another thousand subscribers this week and it wouldn't really create all that much incremental work so it scales we'd still be publishing six to eight pieces a month and we still be doing our podcasts and still doing our tweeting and and now of course working on notes sub stacks new Twitter alternative. But it's also none of this feels like work is a really amazing blessing we we have a bunch of phrases we use around the office the chicken coop we've since bought an office so that we could sort of consolidate ourselves into a really great work environment. And one of the most important metrics that we measure and hold ourselves accountable to is. Every week we take a look",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 59,
      "start_timestamp": "00:05:54",
      "start_timestamp_seconds": 354.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=354"
    }
  },
  {
    "text": "phrases we use around the office the chicken coop we've since bought an office so that we could sort of consolidate ourselves into a really great work environment. And one of the most important metrics that we measure and hold ourselves accountable to is. Every week we take a look at our schedule and say how much of this was stuff that we had to do versus how much of this stuff is things that we got to do. We feel like I get to do that but I have to do this we call it our get to have to ratio and we want to drive that to infinity and so with the. The financial success of the work we've been able to outsource many of the half to's and we keep isolating and optimizing our lives to only focus on the things that we feel like we get to do. Which actually makes us far more productive because when you're in I get to do that mode and it doesn't feel like work. You can sit at your desk from 10 in the morning until midnight and look at your watch and not know what time it is and getting into that mindset that peak performance mindset for something as silly as the do work you know sub stack but it's not silly that you know like we eat live free sleep dream. You know this business and we poured our hearts into it and you know we",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 59,
      "start_timestamp": "00:06:58",
      "start_timestamp_seconds": 418.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=418"
    }
  },
  {
    "text": "and getting into that mindset that peak performance mindset for something as silly as the do work you know sub stack but it's not silly that you know like we eat live free sleep dream. You know this business and we poured our hearts into it and you know we just had a multiple family celebration over spring break. And and and our subscribers wouldn't know it because we you know we we never miss a beat we always publish at the same cadence our subscribers come first we pre-rode a couple of pieces ahead of that vacation that we all took and you know because our objective is to delight our clients and as long as you focus on your ideal clients. And obsessed over delighting them as a small business owner. It's pretty hard to fail. Actually just really important wisdom I think even for me is like a new content creator right like I'm new to all of this I started a little bit before you guys did right during COVID. But I did not start in the content creation business I was just trying to like share information with like my veteran friends and I was repeating myself a lot so I made some videos you know so that they could watch and then we could talk. But I mean a lot of what you're talking about there is actually just really interesting content creation. Information so another question I have is when you think about",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 59,
      "start_timestamp": "00:07:55",
      "start_timestamp_seconds": 475.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=475"
    }
  },
  {
    "text": "repeating myself a lot so I made some videos you know so that they could watch and then we could talk. But I mean a lot of what you're talking about there is actually just really interesting content creation. Information so another question I have is when you think about the world of economics what keeps you guys excited about it why is that your niche. So in the subset of economics our niche is what we know which is commodities energy and related and of course we also have pretty strong finance background on our team with you know private equity and venture capital and combination of those things which is what we were doing in our consulting business which is sort of helping unlock value through private investments or advising C. So it's like here's the technical assessment of this opportunity here's the financial assessment and here's why you shouldn't do it because it's likely to burn your money or here's why you should do it you know. That is really fun to sort of, we sort of specialized into stealing complexity. So like, I remember a client hired us because they had a really tough environmental problem that the internal team really kind of got stuck on it. We have a pretty strong science background. I, in particular, you know, managed pretty large teams of PhDs, scientists working on alternative energy for many, many years. And so I have a pretty good, personally, I have a pretty",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 59,
      "start_timestamp": "00:09:00",
      "start_timestamp_seconds": 540.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=540"
    }
  },
  {
    "text": "that the internal team really kind of got stuck on it. We have a pretty strong science background. I, in particular, you know, managed pretty large teams of PhDs, scientists working on alternative energy for many, many years. And so I have a pretty good, personally, I have a pretty good molecular map of how the economy actually works. Those are the types of problems where you dive in and you read through five years worth of internal reports and you say, aha, here's what they've missed. And you should look at this. And then all of a sudden, the whole team sees a problem from a different, you know, different angle. That was super fun. We've taken all the fun parts of that job, Connecting dots, pattern recognition, explaining scientific concepts to finance professionals in a language they can understand. All of those things are sort of wrapped into the Dumburg brand. And key element of our brand, again, is delighting our ideal clients. We actually have, you know, I was listening to your origin story, which is actually very common from any content creators. And, and, and, and, really what it comes down to is that pivot from doing this for fun, to doing it professionally. And so when you ask me what gets me excited about the economy is the fact that we now have that professional outlet for our work and thoughts and writings in that regard. And the economy is so dynamic. And the energy",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 59,
      "start_timestamp": "00:10:19",
      "start_timestamp_seconds": 619.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=619"
    }
  },
  {
    "text": "doing this for fun, to doing it professionally. And so when you ask me what gets me excited about the economy is the fact that we now have that professional outlet for our work and thoughts and writings in that regard. And the economy is so dynamic. And the energy sector in particular is so dynamic that we're, we just published piece 187 this morning and we have never run out of things to write about. And I don't think we ever will. And so thing that excites me the most is the dynamic nature of it, the ongoing need for pattern recognition and, and, and the distillation of complexity. And that we have found what, like personally, this is what I was meant to be doing in life. And what a gift to wake up every day, knowing that after 20 years of school and 20 years plus of working and many, many years as an entrepreneur experimenting with various business models that you land on the thing you were supposed to be doing, you catch the tiger by the tail and we just don't let go. Like we're not going to do anything else. We wrote a piece, one of the work on my life pieces where we talked about the disease of more. Right. Like we've been offered all kinds of things, you know, hey, sell me your email list. I'll make it lucrative or, you know, you should write a book or you should do this",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 59,
      "start_timestamp": "00:11:20",
      "start_timestamp_seconds": 680.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=680"
    }
  },
  {
    "text": "one of the work on my life pieces where we talked about the disease of more. Right. Like we've been offered all kinds of things, you know, hey, sell me your email list. I'll make it lucrative or, you know, you should write a book or you should do this or you should, we're going to do none of those things. We're going to show up, make our numbers go up and repeat. I mean, that's what we're going to do. We're going to write our pieces. We're going to grow our Twitter following. We're going to grow our free email list. We're going to grow our page subscriber list. We're going to nail every podcast invite that we get. We've probably put in all the work and show up and be professional and treat every podcast like your business depends on it because it does. That's one of our phrases here. Like we want to be the very best podcast guest we can be because what a great engagement, you know, in the customer journey from impression to engagement to email to pay, there's no stronger engagement than the people listening to you and I talking right now. And maybe some of them will think, wow, hey, this Bloomberg is worth checking out. Let me go, let me go to their webpage. And then some of them will eventually sign up and some of them might actually pay. Like that's the way this business works. And so we want",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 59,
      "start_timestamp": "00:12:28",
      "start_timestamp_seconds": 748.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=748"
    }
  },
  {
    "text": "maybe some of them will think, wow, hey, this Bloomberg is worth checking out. Let me go, let me go to their webpage. And then some of them will eventually sign up and some of them might actually pay. Like that's the way this business works. And so we want to be professional about it. We want to be serious about it. And there's just no shortage of fascinating things. You know, when you research, right, edit and publish and promote and defend 187 pieces, you learn a ton along the way as well. So just think of the institutional knowledge that we have built up inside of our very small firm. If we ever wanted to restart our consulting business, man, how powerful would we be given all the things we've written, researched and published and defended? And one of the things we do after every piece is we go thoroughly through all the comments, which are close to just paid subscribers. But they're having to defend it or learn something new or have you thought about this angle? Like it's all part of that continuous improvement learning journey. So that's really to answer your question. The thing that excites me the most is that there's just an unlimited world of learning potential for us to dive into. Yeah, I love that. And I think at least from like a retail trader perspective, a lot of my audience really enjoys trading for very similar reasons. Because you get to",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 59,
      "start_timestamp": "00:13:18",
      "start_timestamp_seconds": 798.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=798"
    }
  },
  {
    "text": "excites me the most is that there's just an unlimited world of learning potential for us to dive into. Yeah, I love that. And I think at least from like a retail trader perspective, a lot of my audience really enjoys trading for very similar reasons. Because you get to learn about the world from the lens of finance, which I always kind of find refreshing because you lose a lot of the partisan stuff in some instances. And it's more about dollars and cents. And for a lot of people that's like an easier way to consume the world. But when you look at kind of the state of the economy right now, what are some of the, and I want to get into commodities and energy, but kind of zooming out one level first to start? When you look at the state of like the US economy first right now, what are some of like the primary themes that you're keying into? The thing we're watching most closely is deposit out close from regional and community banks. And this is something that we believe is being perhaps underestimated by the market. Now, full disclosure, we bank with a very small community bank. We know the sector pretty well. And we're very passionate about the critical importance of regional community banks to the real economy. You know, if you sort of divide the banking sector in the US between the two big to fail banks, sort of banks in",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 59,
      "start_timestamp": "00:14:12",
      "start_timestamp_seconds": 852.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=852"
    }
  },
  {
    "text": "very small community bank. We know the sector pretty well. And we're very passionate about the critical importance of regional community banks to the real economy. You know, if you sort of divide the banking sector in the US between the two big to fail banks, sort of banks in between and then everybody else, all the real hard work that makes the economy go is done by everybody else. Now, J.P. Morgan doesn't really care about, you know, factoring receivables for a local business because they are having trouble financing their working capital because their growth is too strong, right? They're actually looking at people like that as an opportunity to squeeze. Whereas, you know, we have a banker and she has a name and we know her and we know her significant other and we meet about Duneberg as a business. And when we were about to launch, she heard our business plan and she has came to our office and viscerally did her know your customer anti-money laundering obligations by understanding the time in nature and origins of the future cash flows of this new business that we had created that she helped us create. That is such a critical lubricant in the economic gears of America and it's just a fundamental fact when deposits leave small banks, they stop lending. They have to. And when small banks stop lending, the economy goes into what's known as credit crunch. And right now we have a converging factor.",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 59,
      "start_timestamp": "00:15:20",
      "start_timestamp_seconds": 920.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=920"
    }
  },
  {
    "text": "such a critical lubricant in the economic gears of America and it's just a fundamental fact when deposits leave small banks, they stop lending. They have to. And when small banks stop lending, the economy goes into what's known as credit crunch. And right now we have a converging factor. We have a converging set of factors. I'm sorry. One, we've had this recent mini run on the banks. Silicon Valley bank, signature bank, silver gate, first republic, few others. Two, we had Janet Yellen be clowned herself in front of Congress when asked, hey, you know, our deposits in Oklahoma safe asks Senator Langford from Oklahoma and she totally floods the answer. But three and Jim Bianca actually just put a great Twitter thread on this morning, which is really eye opening. We have tax paying season right now and turns out that during last week through the next week, banks experience a significant deposit outflow as people like us have to pay our taxes. You make your estimated taxes for the year then you follow your extension on tax day because you have your LLCs aren't all lined up and you have to make an estimate for how much taxes you own and you write a big check and you usually write a check slightly bigger than what you are so that you can get a small refund in a few months or a few weeks when you follow your final returns and you don't have to pay",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 59,
      "start_timestamp": "00:16:25",
      "start_timestamp_seconds": 985.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=985"
    }
  },
  {
    "text": "much taxes you own and you write a big check and you usually write a check slightly bigger than what you are so that you can get a small refund in a few months or a few weeks when you follow your final returns and you don't have to pay a penalty. There's gonna be huge outflow of deposits from small and regional banks, community and regional banks in the past week and the next few weeks. And this could feed a temporary credit crunch and when banks stop lending the economy, stop growing. And so we would be concerned about access to credit for small businesses and flyover country because neither the big banks nor the national media cares about the flyover country until it's too late. And we live in flyover country. We are immersed in this culture. We understand how the construction company needs to prepare for materials and all that stuff and that's actually 50, 60, 70 of the actual economy. The too big to fail banks make money because they're too big to fail. So it's just that simple. And the small regional community banks need to make money by growing deposits and lending surely. And that is actually the economy. The too big to fail banks aren't the economy. The derivatives books and the counterparty risk and the propped ask insider, that that's not the economy. That's moving money around, hoping to pilfer money from retail investors. The economy is our banker who lends",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 59,
      "start_timestamp": "00:17:45",
      "start_timestamp_seconds": 1065.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1065"
    }
  },
  {
    "text": "And that is actually the economy. The too big to fail banks aren't the economy. The derivatives books and the counterparty risk and the propped ask insider, that that's not the economy. That's moving money around, hoping to pilfer money from retail investors. The economy is our banker who lends to the son who inherited his plumbing business and wants to buy three new vans and hire four new employees to double his business because he thinks he has a competitive advantage over the competitor across town. That's the economy, that's capitalism. That's an entrepreneur taking a risk, leaning on the bank for some help and succeeding and the bank getting their money back with interest and that plumber getting the excess equity that they've earned, literally earned, working 80 hours a week, making their business run. And so our biggest thing, the key thing that keeps us up and right now is deposit out of small banks in the US. And I do, it has a certain subprime is contained feel to it. If we go back to sort of, oh wait, but probably not to that degree, but a very similar feel where it was like, ah, you know, subprimes a small part of the housing market and housing prices only ever go up. Oh, these small community regional banks don't really matter and the big banks can just feel the void, no, they can't, they won't. And so this is really from an economics perspective, the thing",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 59,
      "start_timestamp": "00:18:52",
      "start_timestamp_seconds": 1132.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1132"
    }
  },
  {
    "text": "know, subprimes a small part of the housing market and housing prices only ever go up. Oh, these small community regional banks don't really matter and the big banks can just feel the void, no, they can't, they won't. And so this is really from an economics perspective, the thing we're watching most closely. And you brought up that you felt like the general market is not necessarily fully appreciating that fact. What leads you to believe that just that you're not seeing the movement that you would expect based on that information or something else? Yeah, I think the, the sort of SP earnings estimates and so on that, you know, who knows whether that actually moves markets? I suppose markets are mostly, you know, moved by flow at these points, you know, flows into, you know, into passive investment vehicles and so on. But by and large, we still believe that ultimately, the price of equity should reflect the present and future value of earnings and cash flows and dividends and buybacks. And to the extent that the market might be overestimating the strength of the economy in the back half of the year, then you would expect that there would be a little more bearishness than the markets when we see today. Having said all of that, we're not good traders and everybody listening should understand that. So. And did you see, I'm sure you know, right? Thanks for reporting right now and a lot of them",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 59,
      "start_timestamp": "00:20:06",
      "start_timestamp_seconds": 1206.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1206"
    }
  },
  {
    "text": "that there would be a little more bearishness than the markets when we see today. Having said all of that, we're not good traders and everybody listening should understand that. So. And did you see, I'm sure you know, right? Thanks for reporting right now and a lot of them actually beat on their previous release. Is that factor, and that's the big banks to be very clear? I'm curious how that factor's in the big banks. That confirms my fears. Exactly. Okay, that's what I was figuring. Because this is zero sum game. So if the big banks are all performing, who's underperforming? Right. Right. Again, big banks exceeding earnings expectation is consistent with, again, we're not making a bearish call. We have, that's Bloomberg, you know, nobody comes to us for that rosy, you know, optimistic about it. But if you were asking me where I would be concerned in what milestones I would be tracking, you know, the weekly reports out of the Fed about deposits at small and regional community banks is one that we're looking at. And by the way, I concur with that, you know, we have a proteer where we have sort of a elite subscribers who get a full doom zoom webinar once a month with usually a presentation from us for a high profile guest. And the key part of that is they get open QA, like direct QA with us and the guest. And on the last Fed day, we",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 59,
      "start_timestamp": "00:21:09",
      "start_timestamp_seconds": 1269.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1269"
    }
  },
  {
    "text": "a elite subscribers who get a full doom zoom webinar once a month with usually a presentation from us for a high profile guest. And the key part of that is they get open QA, like direct QA with us and the guest. And on the last Fed day, we had Daniel D. Martino booth on and she gave up really staggering 30 minute presentation, going into all these details. And one of the big, big, big challenges is commercial real estate. 55 of commercial real estate loans are underwritten by small regional community banks. And nobody's going back to work, right? I mean, these office buildings are empty. Nobody's going back to the office, people's still working. Nobody's going back to the office. And you combine deposit outflow with bad loans. And suddenly you can begin to see, you know, the genesis of a federal financial crisis, and truly the market is just sort of pricing in that the Fed has everybody's back. And look, that's been a very good trade. And it probably is true that the Fed still does have everybody's back. But it's something we're working on. Yeah, you mentioned something earlier that I actually talk a lot about specifically from a trading perspective, which is pattern recognition. It's really well documented. It is a super important aspect for long term successful traders. Obviously, you're finding that to be important also in just the world of economics. If you're thinking about the perspective of a retail",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 59,
      "start_timestamp": "00:22:15",
      "start_timestamp_seconds": 1335.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1335"
    }
  },
  {
    "text": "a lot about specifically from a trading perspective, which is pattern recognition. It's really well documented. It is a super important aspect for long term successful traders. Obviously, you're finding that to be important also in just the world of economics. If you're thinking about the perspective of a retail trader, what are some of the key pattern pieces that you think they should start paying attention to in general, if they're not already? Yeah, tough question because retail trading is hard, hard to make, you know, hard to beat the market as a retail trader, as you know. And so our advice to retail traders is don't trade until you've like paper traded for a long time and really understood what makes the work. But even then, you know, there's something visibly different emotionally about having your own money on the line. And then that sort of runs counter to what I was just saying. But if I were given a fixed amount of money to trade and I had to, it's not something I would like to do, I would actually become deeply knowledgeable about a very small subset of the market. Right. And I would go, I would go deep and I would trade three or four stocks, maximum. And I would know their industries. I would know what they mean when they put up press release. I would press releases. I would know what they mean when they say certain things on earnings calls or, you",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 59,
      "start_timestamp": "00:23:21",
      "start_timestamp_seconds": 1401.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1401"
    }
  },
  {
    "text": "would go deep and I would trade three or four stocks, maximum. And I would know their industries. I would know what they mean when they put up press release. I would press releases. I would know what they mean when they say certain things on earnings calls or, you know, for example, if you had a pure play in a very narrow commodity and then you subscribe to the industry magazine or rag that gives you the weekly prices for the market and you could beat the market knowing that prices are taking a dip and you could go short that thing. Or you could see that there's bullish indicators because, you know, one of their competitors went offline and they're running at full capacity and they have pricing power and the market hasn't yet realized that, you know, if you get a fundamental edge and then use some technicals to support your entry and exits, that's sort of the classic way to do it. And that's what I would advise. Like I would become deeply knowledgeable around three or four companies. And I wouldn't, you know, I would keep an eye on the broader macro, just to understand sort of the tide. But I would go, I would trade the same stock over and over and over again. That's actually what I would do. So keen into that though. And I'm specifically curious about the economics side just because that's kind of where your eminence is. So you",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 59,
      "start_timestamp": "00:24:28",
      "start_timestamp_seconds": 1468.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1468"
    }
  },
  {
    "text": "sort of the tide. But I would go, I would trade the same stock over and over and over again. That's actually what I would do. So keen into that though. And I'm specifically curious about the economics side just because that's kind of where your eminence is. So you mentioned at the end there that, you know, you would keep an eye on the economic tide. How would you do that? So let's take an example right now. Crypto. And we've written about Operation Showpoint 2.0, which is tied to this banking crisis, you know, it's not surprising that three of the banks that failed either were directly or indirectly heavily associated with the crypto industry and the epic mania in private markets venture capital. That's a huge headwind or any crypto related stock. And so you might say at the highest level, I am bearish. All things crypto. And so I will be opportunistically seeking rallies to short, you know, and dips to come. And I would say, wow, you know, Bitcoin just went up 2000 points and just take for example, like Gary Gansler has made it very clear what he's going to do. It's all there, like the writings on the wall, like he just charged this bitchress exchange yesterday, you could read the 80 page report yourself. We did, we know what he's doing. And so we know what that might, what should it should mean? Certain stocks in the public market. And you can",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 59,
      "start_timestamp": "00:25:22",
      "start_timestamp_seconds": 1522.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1522"
    }
  },
  {
    "text": "like the writings on the wall, like he just charged this bitchress exchange yesterday, you could read the 80 page report yourself. We did, we know what he's doing. And so we know what that might, what should it should mean? Certain stocks in the public market. And you can then say to yourself, I have a bearish, fundamental tailwind, if I'm going to go, they'll put or I'm going to short stock. And then you have to watch the trade action. And you can say, wow, this thing, you know, Tesla is ramping today. And that means a lot of the sort of meme-ish type stocks are ramping in this thing that I've been watching and thinking about shorting just is up 4.5 on no news that doesn't make any sense. And Gary Gansler's testifying today before Congress and I read his testimony and nothing changed. I'm going to go ahead and short that stock today. And then you know, you have your entry in your exit and your own discipline and everyone I'm sure with, I'm sure you think about discipline all the time. And that's the way that we would look at it. And then, but then you have to be very careful to say, okay, what are the milestones that would make me pivot from being bearish to sector to no longer bearish it and you have to stop trading through that framework immediately. And it might be two consecutive trades that don't work. No, pick",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 59,
      "start_timestamp": "00:26:43",
      "start_timestamp_seconds": 1603.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1603"
    }
  },
  {
    "text": "you have to be very careful to say, okay, what are the milestones that would make me pivot from being bearish to sector to no longer bearish it and you have to stop trading through that framework immediately. And it might be two consecutive trades that don't work. No, pick your favorite rule. Well, the thing about trading, again, don't take advice from me on trading, but I certainly read a lot about it. Try my hand out a few times, had some successes, had some failures. Is really it is literally just a discipline game. You have your rules and the greatest indicator of success or a trader is the discipline with which they follow their rules is not even actually what the rules say. Because the reason why traders loses because of emotion. And so as long as you have a set of rules that you are very disciplined about keeping, you know, within, look, you can't say my rule is I put 50 of my account into ever trade. Like, but you have to have a pretty reasonable, as long as you have a reasonable set of rules. The thing that differentiates good traders from below administrators is the discipline and the lack of emotion and executing that discipline around those rules. Yeah, completely agree. Yeah. At first, when you were saying about the discipline, I was kind of half a green half disagreeing with you. But then as soon as you added the caveat on having",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 59,
      "start_timestamp": "00:27:39",
      "start_timestamp_seconds": 1659.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1659"
    }
  },
  {
    "text": "is the discipline and the lack of emotion and executing that discipline around those rules. Yeah, completely agree. Yeah. At first, when you were saying about the discipline, I was kind of half a green half disagreeing with you. But then as soon as you added the caveat on having rules that provide positive edge, completely agree. Yeah, 100. Yeah. And by the way, experiment to develop such a set of rules with small stakes so that you keep your bank raw. Yeah. Like until you're a really good card, care card counter at the black check table, you shouldn't be betting large. But the moment you were convinced yourself that you could count cards and the casino won't figure it out. Well, when the, when the odds are in your favor, then you could raise your stakes. You know, bank role management alongside a good set of rules is absolutely critical to staying in the game. You know, it's funny as you're talking, I'm seeing behind you, you have two books, options as a strategic investment and supple leopard. And I might be the first guest to have to be a proud owner of both of those books. Oh, really? You know, you know, Dr. Kelly story, double leopard. Yeah, that that that's, you know, I could tell by your physique that you're a power lifter, I may, I may cause it power lifter. And I will say that I have a relative to my weight. I have a",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 59,
      "start_timestamp": "00:28:38",
      "start_timestamp_seconds": 1718.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1718"
    }
  },
  {
    "text": "really? You know, you know, Dr. Kelly story, double leopard. Yeah, that that that's, you know, I could tell by your physique that you're a power lifter, I may, I may cause it power lifter. And I will say that I have a relative to my weight. I have a exceptionally strong head lift. That's my specialty. But anyway, I digress. Wait, is it sumo or conventional? We have to get that out of the way. Oh, I do my favorite deadlift is the hex bar. Oh, interesting. So like from from from or on the legs, then the back. So I love the hex bar. Yeah, that's my peak at my peak. I did lift it to and a half times my body weight. Yeah, that's really good. Yeah, I think, I digress. No, I had I welcome it openly because I actually, I am a huge proponent of fitness in general, not just like physical, but mental fitness. And this is probably one of my most gifted books becoming a supple leopard. I give probably 30 to 50 copies of that out of year. And it's because it's like I genuinely think it's transformative. So I actually think it's super, super dope that you're familiar with. Yeah, I will say I, I, I implemented a pretty significant project around a birthday milestone. And that book was part of my, you know, I set a very strong goal. And I just broke it down into small parts and, you",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 59,
      "start_timestamp": "00:29:30",
      "start_timestamp_seconds": 1770.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1770"
    }
  },
  {
    "text": "it's super, super dope that you're familiar with. Yeah, I will say I, I, I implemented a pretty significant project around a birthday milestone. And that book was part of my, you know, I set a very strong goal. And I just broke it down into small parts and, you know, and that book and a few others really helped me achieve that goal. And it was sort of a crazy goal, a stupid goal, but I managed to do it. And and so I really did enjoy that book, which is why I've seen it since we started talking and I was waiting for my opportunity to bring it up. But I also own the book on top of it. Options as a strategic investment because I have a good feel for numbers and love trading options, even though, you know, I have a good friend, Tony Greer, who runs TG macro. And he says when you're thinking about putting an option trade on slam your hand in the drawer and then thinking about it again, he doesn't believe in trading options. And he's a good friend of mine. We like to joke. I'm a, I'm a, I have a predominantly don't trade, invest privately. But I do have a nickel slots account where occasionally I will head to the horseies, head to the ponies and make a few bets and I still enjoy it. So. Yeah. And I actually think keeping a side of that is still good,",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 59,
      "start_timestamp": "00:30:45",
      "start_timestamp_seconds": 1845.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1845"
    }
  },
  {
    "text": "a predominantly don't trade, invest privately. But I do have a nickel slots account where occasionally I will head to the horseies, head to the ponies and make a few bets and I still enjoy it. So. Yeah. And I actually think keeping a side of that is still good, man, because even if it's low probability, but still asymmetric risk, everyone's on a wall. It does pay out like you said, right? A very small subset of a bank role. But I do think there's a time and place. It's a very, it's a diminimus amount relative to my personal life worth, but it is still admitted in a way that it's almost more fun than, you know, the big bets that pay off in the private world. You know, it's, it, I have a couple of friends that I do it with and we just sort of get the dunk on each other when the trades don't go well and, or when they do for us. And so it's just kind of fun. It's good to have a little skid in the game and, and just, it's like watching football and placing a few side bets on Sunday. You know, who doesn't like to do that? Well, I hate watching football. If I can get you on a rugby, that would be my go to, but, you know, I get to play. Only if I can game a lot of it. Oh, yeah, you can gamble off rugby",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 59,
      "start_timestamp": "00:31:38",
      "start_timestamp_seconds": 1898.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1898"
    }
  },
  {
    "text": "You know, who doesn't like to do that? Well, I hate watching football. If I can get you on a rugby, that would be my go to, but, you know, I get to play. Only if I can game a lot of it. Oh, yeah, you can gamble off rugby all over the place. They're degenerates. It's, it's actually funny, though, that you talk the more I listened to you talk, the more I find a lot of just general common themes from the concepts of stoicism that you mentioned up front, definitely notice that littered throughout. You talked about taking a big problem and chunking it into small problems. We do that in the Marine Corps literally all of the time. We have the saying, how do you eat an elephant one by day at a time? And then you're also into physical fitness, which I find fascinating because I actually think there's a huge correlation between a human beings discipline, as you mentioned, and just their overall impact on life, not just how good they are as a trader, how good they are as an economist or a business owner, but just literally in life. What is kind of your guiding feature? Obviously, in terms of business, you like what you do. Is there a broader impact that you're trying to make as Doomburg the brand or as an individual within Doomburg? I'm curious how you think literally about life large. Yeah. So, you know, obviously, Mary, two",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 59,
      "start_timestamp": "00:32:31",
      "start_timestamp_seconds": 1951.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=1951"
    }
  },
  {
    "text": "of your guiding feature? Obviously, in terms of business, you like what you do. Is there a broader impact that you're trying to make as Doomburg the brand or as an individual within Doomburg? I'm curious how you think literally about life large. Yeah. So, you know, obviously, Mary, two kids love my family deeply, love my business partners and their family. So I'm a big believer that success starts in the home and take care of your stuff. I once said something in grew slack, 20 grew slack that pride of ownership is they found a foundational attribute of a responsible provider. So if you come to my house and you look around my yard, there's a lot of right angles and well cut grass. And if there's a paint chip, it gets, it gets, you know, taken care of it. If a branch falls out of a tree on the my driveway, it gets picked up. Like we, the precise and proper amount of pieces of garbage in my property is zero. And, you know, I don't care where you are on the economic ladder. Proud of ownership is free. And it starts at home. So, you know, personal preparedness, taking care of my kids, you know, straight teeth and then education is my commitment to them. And they'll get both of those things before they leave my home and they will have lifelong allies and support between me and my spouse. And then it goes out from",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 59,
      "start_timestamp": "00:33:35",
      "start_timestamp_seconds": 2015.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2015"
    }
  },
  {
    "text": "personal preparedness, taking care of my kids, you know, straight teeth and then education is my commitment to them. And they'll get both of those things before they leave my home and they will have lifelong allies and support between me and my spouse. And then it goes out from there, you know, like I will take care of my friends and family first and then charitable giving beyond that and helping others. And one of the big ethos is up in Berges. We help every content creator who asks us and I, I do countless Zoom calls one on one with aspiring or existing content creators who want to run their businesses better or trying to pick our brain or advice for us. So by the way, we learn from all of them as well, which is a great way. We firmly believe that the NPV of giving is infinite. So, you know, there will be lots of people who take advantage of your time and never pay you back. And that's perfectly fine because all it takes is one along the way that, that is as transformative as that hedge fund manager who took my call at the depths of our COVID crisis and gave us a really critically important piece of life that changed our lives, you know, like 30 people that we helped ignore us when we truly need it all, it takes us that one person to give you that sort of pivot point in",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 59,
      "start_timestamp": "00:34:45",
      "start_timestamp_seconds": 2085.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2085"
    }
  },
  {
    "text": "depths of our COVID crisis and gave us a really critically important piece of life that changed our lives, you know, like 30 people that we helped ignore us when we truly need it all, it takes us that one person to give you that sort of pivot point in your life and you have to then be prepared to take advantage of it. And one of our favorite phrases, which comes back to your physical fitness comment, then it's a lumbarity, find out what the prices and pay it. Like I'm a firm believer that if you have a reasonable goal and you break it down to a thousand pieces of the elephant and you could isolate all the other variables, except your efforts. Then there's no excuse, but your own inability to work hard enough to get there. And many people actually, well, not to get too philosophical, but this is a great conversation. We're going down various rabbit holes here. Most people don't want to actually do their very best at anything. Because if they if they do their very best and they don't succeed, then they will have nothing other than themselves to blame for their failure. So they proactively look or cop out excuses and reasons why the outside world created a set of conditions that caused them to not succeed. And we would call that loser talk, I mean, to be totally blunt. Like winners win winners go and get it. Like you don't",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 59,
      "start_timestamp": "00:35:35",
      "start_timestamp_seconds": 2135.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2135"
    }
  },
  {
    "text": "failure. So they proactively look or cop out excuses and reasons why the outside world created a set of conditions that caused them to not succeed. And we would call that loser talk, I mean, to be totally blunt. Like winners win winners go and get it. Like you don't get to be in the Marine Corps unless you're a winner. Like you got to go and get it, right? And you're not going to carve out a life as a successful trader if you're always railing about how the market is wrong. Right. And so when I was in the sort of corporate world that we were looking to hire, we had a very strong philosophy, winners win. Let's look for signs of winning on the resume, not signs of pedigree, although there is an aspect of pedigree that matters, but signs of winning. And the number one sign of winning is what I would call that curve. What did you do with the opportunities and when they were given to you at various stages of your career? Right. I don't care where you started. What did you do where you started? And did you parlay that into another opportunity? So you may have enlisted in the army and then, you know, I don't know how it works in the military, but you go and like try to get into the Marine Corps and then you do. And then when you're in the Marine Corps, you climb up the",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 59,
      "start_timestamp": "00:36:38",
      "start_timestamp_seconds": 2198.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2198"
    }
  },
  {
    "text": "opportunity? So you may have enlisted in the army and then, you know, I don't know how it works in the military, but you go and like try to get into the Marine Corps and then you do. And then when you're in the Marine Corps, you climb up the ladder quickly and suddenly you become, you know, very high up in the pecking order and like that's a winner. Like when given an opportunity, you nailed it. And if you have a consistent track record of nailing the opportunities you have, the absolute place where you are doesn't matter as much as the vector. And if the vector is upward forcing and and give me an engine and, you know, you can, you can do wonders with a, with a team full of people with a high motor. And so we have a very small team. We've not expanded. We've not grown. We've spent nothing creating Duan Burke. We can on purpose run a very tight disadvantage. We spend zero on customer acquisition. We've spent a shockingly small amount of money building Duan Burke's all sweat equity. And we have resisted the temptation to build a big team, to outsource a bunch of work. We want to live, eat, breathe, sleep, viscerally feel every aspect of this business. Stop doing almost everything else in our life. And we've just pounded it. And like when you catch, talking about the tail, you keep going like, you know, you just keep",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 59,
      "start_timestamp": "00:37:47",
      "start_timestamp_seconds": 2267.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2267"
    }
  },
  {
    "text": "outsource a bunch of work. We want to live, eat, breathe, sleep, viscerally feel every aspect of this business. Stop doing almost everything else in our life. And we've just pounded it. And like when you catch, talking about the tail, you keep going like, you know, you just keep going. Wake up, show up, make the number go up and repeat. Vance Armado. We attack it with discipline, like a supple leopard. And that book had a big impact on me. And, and it's true. Like, and, and very few people have that far more people have the desire to find an excuse than they have the willingness to lay it all out there. Like if you're not, if you do your best, you will define what your best is not. And you best be prepared for understanding. Like, let's say I studied my ass off for a math test when I was in school. And the kid next to me beat me by three percentage points. Two things happened. I found out that that kid is better than me at math, which is irrelevant. I did my very best on this math test and set myself up personally for the absolute maximum success in life. So our belief is absolute measurements are the one that matter, not relative once. So my personal deadlift record, Pales in comparison to yours. I could tell just by looking at you, compared to looking at me. But for me, that was the",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 59,
      "start_timestamp": "00:38:48",
      "start_timestamp_seconds": 2328.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2328"
    }
  },
  {
    "text": "for the absolute maximum success in life. So our belief is absolute measurements are the one that matter, not relative once. So my personal deadlift record, Pales in comparison to yours. I could tell just by looking at you, compared to looking at me. But for me, that was the very best I could do. And I did it. And I said a goal. I broke it down. I laid it all on the line. They're not, they're not five people in the world that cared that I hit that milestone. I cared because it meant something to me and I did it. And that's the framework. That's the mentality that, and I do believe that comes through and I'm writing in our professionalism in our marketing and our subscribers appreciate it. And they're inspired by it. And we've been very honest with our subscribers from the beginning two years ago that we intended to make this a business that transformed our lives. And we invited them to be part of that journey with us. And I think that has been a real important input into our success. Yeah, it's huge. And I'm a big fan of your guys' writing because there's a lot of writing that I see that it's difficult for me to read. A lot of times there's a lot of baked in agenda or there's just a lot of fluff. It's just words that probably don't need to be there that consume space. And it takes",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 59,
      "start_timestamp": "00:39:54",
      "start_timestamp_seconds": 2394.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2394"
    }
  },
  {
    "text": "because there's a lot of writing that I see that it's difficult for me to read. A lot of times there's a lot of baked in agenda or there's just a lot of fluff. It's just words that probably don't need to be there that consume space. And it takes time to read and admittedly as the consumer, it can be annoying. It can just be laborious. But I notice with your guys' articles, I don't get that sensation. Like they're obviously very well written pieces and just about everything in there has a reason for being in there in terms of telling a full story. When you, oh, sorry, go ahead. No, bad guy. I was going to ask when you're writing about current day events like we're seeing, you know, day over day, a lot of these things have immense complexity. How do you strike a balance between writing a piece that is descriptive of enough and has enough supporting information to give a good solid understanding? But you don't go so far that you're explaining every single thing you mentioned so that it becomes an unreadable piece. How do you find that balance? Yeah. So great question back to our brand ambition. And this is really important. So there's sort of two factors. Our brand ambition and the fact that we have a person who is the editor that is a complete and separate and distinct role from the writer and editing is not proofreading editing is",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 59,
      "start_timestamp": "00:40:52",
      "start_timestamp_seconds": 2452.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2452"
    }
  },
  {
    "text": "back to our brand ambition. And this is really important. So there's sort of two factors. Our brand ambition and the fact that we have a person who is the editor that is a complete and separate and distinct role from the writer and editing is not proofreading editing is editing. And that editor is actually really gets the descriptor of our ideal client. So not a technical background, but a finance background, but pretty, you know, obviously brilliant and literally our ideal client. And so if we can write it away, then our editor gets it. Then our ideal client probably gets it. But back to the brand, our brand ambition and our brand is nothing more than the gut feeling you induce in your ideal clients when they interact with your product. We created Bloomberg with the following brand ambition. When our email shows up in Eric's inbox, the gut feeling we induce in Eric is, ooh, I get to read that. Not I have to read that. I should read that or that might be interesting, but I'll get to it. I'll print it out and then I'll never read it. And it goes in the garbage at the end of the week when I claim my desk. I get to read that. So how do we do that? We broke that down into three brand ambitions. And the third of them hits to your question. The first is we shall be provocative without being polarizing. Nobody",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 59,
      "start_timestamp": "00:42:08",
      "start_timestamp_seconds": 2528.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2528"
    }
  },
  {
    "text": "at the end of the week when I claim my desk. I get to read that. So how do we do that? We broke that down into three brand ambitions. And the third of them hits to your question. The first is we shall be provocative without being polarizing. Nobody wants milk toast, but nobody wants, well, we didn't want to be just an outrage engagement machine. OK. Two, we shall be funny without being silly. Our pieces should entertain you. You should smirk. You should get the inside jokes of our captions on our pictures. And, you know, like there's a lot of embedded fun inside jokes in our pieces that our long time readers get which drives huge engagement and stickiness. And that's the most important parameter for subscription business. And then third to your point, we shall teach without being self-indulgent. And our editor being the manifestation of one of our deal clients is the ultimate arbiter in this is too much. Let's cut that. This needs to be pulled out a little more because you're assuming too much in the reader. And we desperately try to strike that exact balance that you just described. Our ideal readers are financially sophisticated, highly educated, financial professionals that have succeeded in life that pride themselves on their ability to understand complexity, but like the laugh, like the learn, like to be educated and like to feel part of something. And we try to give that to our deal clients",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 59,
      "start_timestamp": "00:43:10",
      "start_timestamp_seconds": 2590.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2590"
    }
  },
  {
    "text": "readers are financially sophisticated, highly educated, financial professionals that have succeeded in life that pride themselves on their ability to understand complexity, but like the laugh, like the learn, like to be educated and like to feel part of something. And we try to give that to our deal clients with every piece. And so like in the piece we published this morning about Saudi Arabia and the rupture with the US and your prospects for peace and on the lease and what that might mean for the brick countries and the US dollar and the price of all in the future. There was a lot of stuff that didn't make it that I had in it when I first handed it over for edit. And one of the most important things we did very early on in New Market around piece 20 or piece 30. Is we decided that we would have a full day for editing before we publish a piece. So when we are going through our timeline for the week right now, I have a mental target to get the next piece done by Wednesday for a Friday morning publication, which gives the editor a full day to rip apart. And we do, I mean, by the way, once it goes to the editor, it's out of my hands. Like we have a work process and we have operations, one of our five pillars to our business. And we have a very systematic 30 point checklist",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 59,
      "start_timestamp": "00:44:13",
      "start_timestamp_seconds": 2653.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2653"
    }
  },
  {
    "text": "day to rip apart. And we do, I mean, by the way, once it goes to the editor, it's out of my hands. Like we have a work process and we have operations, one of our five pillars to our business. And we have a very systematic 30 point checklist for each piece. What's the title? What's the quote? What's the outline? What's the one sentence on my beach paragraph? What are the charts? What are the what are the photoshop? What's the thumbnail? What's the social preview? First draft, second draft, third draft, handed off to edit. First added second edit, third edit, post it. Send it to a few of our friends to make sure there's no glaring typos. And even still, despite all of that, you know, we had a type of the piece this morning, which makes you want to shoot yourself jokingly internally. I did. But the point is, like that level of professionalism is what our audience comes to expect. And we have as an editor, which is a critical role. If you're going to be a writer without an editor and you're just getting your stuff proof, you're not actually operating at the high-split impossible. You need a brilliant editor who has the courage to tell you what's bullshit and to tell you what needs to go and to tell you what's missing and to say, this is self-indulgent. It doesn't teach itself indulgent. Stop. You don't need to bring Eric all the",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 59,
      "start_timestamp": "00:45:08",
      "start_timestamp_seconds": 2708.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2708"
    }
  },
  {
    "text": "high-split impossible. You need a brilliant editor who has the courage to tell you what's bullshit and to tell you what needs to go and to tell you what's missing and to say, this is self-indulgent. It doesn't teach itself indulgent. Stop. You don't need to bring Eric all the way here. Eric Smart, he gets it. You can stop right here. And we do that. It's one of the three brand pillars is how do we make sure we're bringing just enough along? And you know, sometimes if you talk over the head of your reader, that's okay. Because they'll go back and they'll do the research and they'll want to learn and they'll understand it and they'll get it and they'll have new respect for you because of where you're operating out of and they want to join you, right? Like that's part of learning. You know, just feed everybody everything. And so it's okay to talk a little bit in code and to refer to things that they might not know, but it doesn't, it doesn't take from the context. The essence of the message still comes through. And so that's the real key, we believe, to a perfect, a perfect, a perfect number of peace teaches you something you didn't know. Makes you laugh and then leaves you with a feeling that, wow, I'm glad I read that. And that speaks to peace. Slent, it speaks to paragraph length. It speaks to words sophistication. You know,",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 59,
      "start_timestamp": "00:46:02",
      "start_timestamp_seconds": 2762.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2762"
    }
  },
  {
    "text": "a perfect, a perfect, a perfect number of peace teaches you something you didn't know. Makes you laugh and then leaves you with a feeling that, wow, I'm glad I read that. And that speaks to peace. Slent, it speaks to paragraph length. It speaks to words sophistication. You know, like there's lots of things that go into being a great writer. It's not just writing long and fancy words that people don't understand, but they have to pick up a dictionary to go and see what the meaning is. And I'll leave you with one final point. One of our phrases is anybody can say a lot with a lot of words. It takes talent to say a lot with few words. And we pride ourselves on the density of our pieces, recognizing that people's attention spans are shrinking. They're busy. We respect their time. They might only read the first third if we don't capture them. They're not going to read the rest of it. We want them to read all the way through it. And so we think about that all the time. It's great that you ask that question because this is really, really the key element of our operational plan. I love it. Yeah. It reminds me of Leonardo da Vinci. One of my favorite quotes of his is simplicity is the ultimate sophistication. And I actually really subscribed to that concept, even in my trading. People ask like what I do for trading and,",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 59,
      "start_timestamp": "00:46:53",
      "start_timestamp_seconds": 2813.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2813"
    }
  },
  {
    "text": "element of our operational plan. I love it. Yeah. It reminds me of Leonardo da Vinci. One of my favorite quotes of his is simplicity is the ultimate sophistication. And I actually really subscribed to that concept, even in my trading. People ask like what I do for trading and, you know, they expect I'm actually primarily a derivative straighter. And they, you know, they expect since I trade options or futures that I'm always deploying these really sophisticated elegant crazy strategies. And I explain I'm like, most of what I do is boring as fuck. It is super simple concepts that I've honed over 16 years. And that is exactly why they work. So I actually really like that you guys think about it that way. Another thing I wanted to ask you is there's two big things that we're seeing a lot of conversation around right now. There's kind of the US dollar potentially falling from grace as the global reserve currency, lots and news about that. And then also kind of these new conversations with OPEC plus oil production. I'm out of those two stories. What is like what's the bigger story in your view? Yeah, I think the de-dollarization risk is vastly exaggerated. I do think there's a possibility of partitioning the globe into, you know, regions where the dollar still dominates and where alternative currencies begin to get more market share in certain regions. And for the average listener that partitioning is going to be",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 59,
      "start_timestamp": "00:47:51",
      "start_timestamp_seconds": 2871.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2871"
    }
  },
  {
    "text": "think the de-dollarization risk is vastly exaggerated. I do think there's a possibility of partitioning the globe into, you know, regions where the dollar still dominates and where alternative currencies begin to get more market share in certain regions. And for the average listener that partitioning is going to be irrelevant to you because you live in the dollar world and, you know, our investment philosophies, we earn and fiat, we save in real assets and we invest privately. Well, that fiat that we earn in the US dollar. And I've said, even though we're gold bugs and we have many gold bugs amongst our subscribers, if the US government came out tomorrow and made private ownership of gold illegal, we would be turning in our gold because we are law-abiding citizens of the United States. We operate within the construct of the law. And we have families and reputations and good livelihoods that we'd like to protect. And we're not going to make a debt stand on the altar of gold. No asset is worth that for us. And so for the vast majority of your listeners, the de-dollarization stuff is interesting. We're watching it. Far more relevant is OPEC-Blos and their market share in the oil sector and their ability to affect prices, which is the subject of the peace this morning and how China is sort of taking the place of the United States and the Middle East. They're far more likely that a world would exist",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 59,
      "start_timestamp": "00:49:06",
      "start_timestamp_seconds": 2946.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=2946"
    }
  },
  {
    "text": "OPEC-Blos and their market share in the oil sector and their ability to affect prices, which is the subject of the peace this morning and how China is sort of taking the place of the United States and the Middle East. They're far more likely that a world would exist where because of the ESG movement in the Western world, oil production and capital investments are nowhere near. But they should be OPEC gets control over the market pricing power and they use it because historically they already have the era of 100 oil regardless of the economic recession, slash expansion macro analysis that you might want, where the floor price of oil might be 100. That's far more relevant to the average listener of this podcast than the de-dollarization phenomenon. And we could be wrong. There's no question that the US dollar is still very dominant. It's going to take a lot more than what we're seeing in the news flow now with the dollar to be meaningfully dethroned from its position, especially if your benchmark is an average US citizen listening to this podcast, who only has ever operated in US dollars. This is to me OPEC plus's potential control over the energy markets is far more impactful in the short to mean even term than the de-dollarization from our market. Fascinating to listen to you because you and I have never talked before, but a lot of the way you view things I find is kind of",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 59,
      "start_timestamp": "00:50:13",
      "start_timestamp_seconds": 3013.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=3013"
    }
  },
  {
    "text": "potential control over the energy markets is far more impactful in the short to mean even term than the de-dollarization from our market. Fascinating to listen to you because you and I have never talked before, but a lot of the way you view things I find is kind of it's very similar to a way that in my layman's world, much less sophisticated of an approach than you, but I come to similar conclusions. Another kind of dovetail question, specifically off of China, I'm still in the Marine Corps reserves, so I still follow kind of geo-politics pretty closely and whatnot. The Silk Road in general and China's expansion policy, essentially infrastructure expansion policy, has been really effective. Do you think that that continues? I don't know if you guys go that far into that side of things. It sounds like you might at least touch it, but I'm curious your thoughts on that. Yeah, I'd recommend this. There's the viewers by a book called Confessions of an Economic Hitman. I'll pull up the book and get the author's name, who's gave me right now while I'm talking to you, but the playbook that China is running right now is essentially the same playbook that the U.S. ran in the close war or two era. This is sort of what happens as sort of the new global superpower begins to ascend in the old one, in the case when we were sending the British John Perkins is the author",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 59,
      "start_timestamp": "00:51:25",
      "start_timestamp_seconds": 3085.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=3085"
    }
  },
  {
    "text": "is essentially the same playbook that the U.S. ran in the close war or two era. This is sort of what happens as sort of the new global superpower begins to ascend in the old one, in the case when we were sending the British John Perkins is the author of the book, and so that's a really fantastic book, and if you just take that book and then apply it to China today, it really is a great framework for understanding their motivations. I believe you probably meant to say the Belt and Road Initiative, which is the big Chinese macro policy of gaining favor with developing economies by providing capital and expertise to help them build out infrastructure, and this is what John Perkins would say is sort of being an economic hitman, and of course there's a price to be paid for doing that, which usually involves subordinating your economic policy and foreign policy to the whims of the Chinese in this case, but look, they're being very fruit about it, they're being very strategic about it. One of the big challenges that I see in the Western discourse is a constant underestimation of the enemy, so to speak, right? And in the Marine Corps, I'm sure they don't teach you to assume that the person on the other side of the battlefield is weak, dumb, and incapable of funding back at the highest level. You prepare for the ultimate aspect on the other side of you,",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 59,
      "start_timestamp": "00:52:43",
      "start_timestamp_seconds": 3163.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=3163"
    }
  },
  {
    "text": "to speak, right? And in the Marine Corps, I'm sure they don't teach you to assume that the person on the other side of the battlefield is weak, dumb, and incapable of funding back at the highest level. You prepare for the ultimate aspect on the other side of you, and your objective is to be that much better than the person that you're about to confront, and why it is that we I'll give you an example, like when we sanctioned Russia after Putin's foolish invasion of Ukraine, we came out with a piece called on the cusp of an economic singularity where we began to call days after these came out that this is probably not going to work, it's probably going to back by our honest. Here's a way to actually hurt the revenue of Putin, which is to not focus on choking up their supply, but to swamp him with supply, which is how you drive down price in a commodity market and thus kill profits. And yet by sanctioning his supply, we drove the economic cost of oil and gas to nosebleed heights, and there was no amount of supply we could choke up that couldn't be made up on price. And this was all very clear. We wrote it and we got crushed, like everyone, oh, you're basically we've got accused of being unpatriotic. One of the fact, we were trying to lay out an alternative blueprint to actually obtain the objectives that are",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 59,
      "start_timestamp": "00:53:55",
      "start_timestamp_seconds": 3235.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=3235"
    }
  },
  {
    "text": "couldn't be made up on price. And this was all very clear. We wrote it and we got crushed, like everyone, oh, you're basically we've got accused of being unpatriotic. One of the fact, we were trying to lay out an alternative blueprint to actually obtain the objectives that are stated, you know, and so, and so I don't know why it is that we have this, you know, the perfect example is, he was a hand, who's an analyst that we enjoy and we have obviously very different views, but he was saying that, you know, Russia has no technology to keep their oil and gas fields running. And look at, I managed global teams of technologists around the world, I lectured at Chinese and Indian universities. I know the state of Chinese and Indian technology sector, especially in the oil and gas space, which is critically important to them. And the combination of Russia, China and India is going to be more than capable of offsetting the quote-unquote Western technology and all of the arrogance that that phrase has embedded in it. And, you know, people were saying at the onset of the sanctions that this was going to cripple, you know, oil and gas production and, you know, it would go to zero and this would bankrupt Putin. And all of that was utter nonsense. And pointing that out was basically called, you know, unpatriotic. When in reality, I would call it realistic. Don't underestimate the enemy,",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 59,
      "start_timestamp": "00:54:52",
      "start_timestamp_seconds": 3292.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=3292"
    }
  },
  {
    "text": "to cripple, you know, oil and gas production and, you know, it would go to zero and this would bankrupt Putin. And all of that was utter nonsense. And pointing that out was basically called, you know, unpatriotic. When in reality, I would call it realistic. Don't underestimate the enemy, overestimate the enemy and be happy when you have done so. It was kind of a much, much, much better way to attack a battlefield. And so that's sort of, when I watch what China is doing, I don't describe evil intent to it. It's just they're solving for themselves. They're optimizing for themselves. You should assume that that's what your geopolitical adversaries will do, right? So think like them. You know, where is it in, you know, in the art of war? Where is it in that book, does it say, you know, hand all the leverage to your opponents and then bimbo the fact when they use it? This is not how war is won. And so it's fascinating to see, but you know, that's sort of my answer to that question. I know on the art of war, that's actually what's underneath the saber tooth cat skull, right there is the art of war. It's interesting. The I'm actually really fascinating that you guys had like blowback like that from that kind of piece. I find people sometimes can become a little too segmented in their thoughts because the other thing that I like to remind people",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 59,
      "start_timestamp": "00:55:58",
      "start_timestamp_seconds": 3358.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=3358"
    }
  },
  {
    "text": "right there is the art of war. It's interesting. The I'm actually really fascinating that you guys had like blowback like that from that kind of piece. I find people sometimes can become a little too segmented in their thoughts because the other thing that I like to remind people about with China is that they're very long term country, right? They're big and they're old, real old. But they're making it at least as far as my again, very drastically on an educated opinion goes, what I'm seeing it's long term initiatives that they're expecting to cash in on 50 years from now, maybe last, but they're setting kind of a much larger footprint. And sometimes I feel like that escapes the near term focus, at least the perceived near term focus that I have of the US. I question sometimes the way that we do things, but to your point, it's not because I don't love the US and it's not because I don't love my country. Obviously, it's the inverse. It's because I'm concerned. Yeah, so I would say that your strength is your weakness. And so the Chinese ability to think long term flows in part from the fact that they run a very disciplined and violent dictatorship. And so they can think in 10 or 20 or 30 years because they don't have to face the populace. And that has its strengths, you they can think long term and it has its weaknesses, which means",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 59,
      "start_timestamp": "00:57:01",
      "start_timestamp_seconds": 3421.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=3421"
    }
  },
  {
    "text": "from the fact that they run a very disciplined and violent dictatorship. And so they can think in 10 or 20 or 30 years because they don't have to face the populace. And that has its strengths, you they can think long term and it has its weaknesses, which means their internal economy has far less dynamic elements to it in the way that the US economy does. And more capitalistic economies do. And our strength being a relatively dynamic capital market system is also our weakness because our political leaders are forced to be held to shorter and shorter short term measures. And so it's not a this is not a an attribute that is derived to sort of race or to to being Chinese or being American. I think this is a consequence of the political and economic systems that these two countries have separately through their own unique history have arrived at. The American system and the Chinese system should be compared not the sort of Chinese people and the American people because we're all products of the system that we are born and raised in, of course. Yeah, yeah, I gotta be honest, I literally could I could talk to you ear off easily for another hour. Yeah, I find not just the economic wisdom and just the market wisdom that you have in the wealth of experience, but just the way that you think about the world to me is fascinating and it's it's really",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 59,
      "start_timestamp": "00:58:15",
      "start_timestamp_seconds": 3495.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=3495"
    }
  },
  {
    "text": "I could talk to you ear off easily for another hour. Yeah, I find not just the economic wisdom and just the market wisdom that you have in the wealth of experience, but just the way that you think about the world to me is fascinating and it's it's really fun to explore. So, you know, first, thank you so much for spending some time with us here. I definitely would love to have you back on. But before we sign off here, how can people get a hold of you? Yeah, so before doing that, I would say the best way for us to spend another hours to come back in a month or two months or three months and do it again. So happy to do it. I enjoy the conversation as well. So let's let's let's go ahead and put put it on the schedule to do it again. And the way people can find us is look to work of my life is at dumber.substack.com. All of our pieces can be found there. You can sign up for free and free subscribers get sort of the first third of all of our pieces, which we write in a way that we hope to induce you to subscribe and full disclosure. You know, we we're in the, you know, our subscribers are the life of our business. We run this as a business. You can also follow us on Twitter at dumber t, at t is in",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 59,
      "start_timestamp": "00:59:30",
      "start_timestamp_seconds": 3570.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=3570"
    }
  },
  {
    "text": "in a way that we hope to induce you to subscribe and full disclosure. You know, we we're in the, you know, our subscribers are the life of our business. We run this as a business. You can also follow us on Twitter at dumber t, at t is in Twitter. And more recently, Substack released a sort of Twitter alternative called notes. And we're spending more of our time on Substack notes because Substack is our business partner in this endeavor. And, you know, we couldn't have succeeded without their great platform. And so those are the three places at dumber t on Twitter on Substack notes as dumber and then dumber.substack.com is dumber.substack.com is the primary outlet for all of our work. That's where we would love people to go because ultimately you can skip all the sort of impression phase and get to the engagement and an email phase and join our subscriber army. Paying subscribers to dumber get all of our pieces and get access to the comment section, which is very vibrant. And we're very active in the comments to the extent that we can be given our small team. And so yeah, that's where we are. And look, Eric, this was really fantastic. And really appreciate the conversation as well and looking forward to coming back. Yeah, absolute pleasure. And then for everybody, I'll throw the links to all of that in the show notes below. But until next time, we'll catch you guys",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 59,
      "start_timestamp": "01:00:24",
      "start_timestamp_seconds": 3624.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=3624"
    }
  },
  {
    "text": "we are. And look, Eric, this was really fantastic. And really appreciate the conversation as well and looking forward to coming back. Yeah, absolute pleasure. And then for everybody, I'll throw the links to all of that in the show notes below. But until next time, we'll catch you guys later, be an outlier.",
    "metadata": {
      "video_id": "JQ8yly937tE",
      "title": "Credit Crunch & China with Doomberg",
      "url": "https://www.youtube.com/watch?v=JQ8yly937tE",
      "upload_date": "",
      "duration": 3705.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 59,
      "start_timestamp": "01:01:24",
      "start_timestamp_seconds": 3684.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=JQ8yly937tE&t=3684"
    }
  }
]