[
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "What's up, outliers? Welcome back to the Alar podcast. We have David Hunter back for our quarterly or so catch up to talk about the latest in the world. I think a couple things that have happened. We started seeing a bunch of rare earth fights, more terrifying fights. We've been seeing increased activity in South America off the coast there. We have a government shutdown. So we have gold going through the roof. I imagine there's got to be a lot of things on your radar right now. So I'm really interested to see first to start us off like a general overview of how you things have progressed from the last time we spoke until now, which is probably about three months ago. Yeah, I are great to you. Yeah, it's we're snowing what I considered the last leg of a 43 years secular bullmark and the leg really began back in that April soon when we had liberation day and it's been you know, the S&B's up I think 46% since then. So since we talked in July, it's you know, it's run further. It just keeps plugging away. My as a man asked me today because I've been saying we're in the parabolic or you know, probably are in the parabolic and I think people see it kind of trend sideways for trade sideways for a looping and it's like that can't be the parabolic and I go, you got to wait for this thing to",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 90.1,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "I've been saying we're in the parabolic or you know, probably are in the parabolic and I think people see it kind of trend sideways for trade sideways for a looping and it's like that can't be the parabolic and I go, you got to wait for this thing to finish when you go back and look, you'll see the slope is, you know, a steep and it's basically we're in the final steepest leg of this long bull market. I it's amazing. All the things you listed off are things that should trouble the market and you're at the market basically at all time eyes and shows no signs of slowing down. You know, of course you get a little back tracking. The semi has just got hit a little bit this week. And they seem to be a start to move up again. You know, industrial look, good, the finance area. You know, if I have some questions about credit, but I think that's more one off things. They don't look systemic to me and from what I've heard, it's more fraught in a couple of instances. I hit a couple regional banks. So I think financials look good, industrial look good. I think even some of the consumer area is going to start as it has rates come down here. I think you're going to see housing pick up a little bit. Not that's often races for a long cycle, but for the next two or three",
    "start_timestamp_seconds": 72.62,
    "end_timestamp_seconds": 166.18,
    "start_timestamp": "01:12",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=72",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "good, industrial look good. I think even some of the consumer area is going to start as it has rates come down here. I think you're going to see housing pick up a little bit. Not that's often races for a long cycle, but for the next two or three months, you could see pretty good trades and in consumer stocks, consumer discretionary areas. GM had a pretty good performance recently. So I think you are seeing across the board, some broadening out in the market. Small caps have done very well in the last several months. They've out before M.S. and P from last April. And I think they are, you know, hitting much higher. So market looks good. You know, you're going to have some backing and filling every once in a while as it gets ahead of itself. But frankly, my number in July, I think we talked right after that. My number in July was 8700 and then in my September actually October letter. My raise my target again to 9,500 on the S&P. So from 87 to 9,500 in just a few months, that's how bullish I am. I raised my NASDAQ target 32,000 raised my the Altarget 65,000 from 60 and raised my Russell target from I think it was 3400 to 3800. So I've gotten even more bullish and the biggest bull on street, I guess. But it just looks to me like we've got legs here. So, you know, I hear people",
    "start_timestamp_seconds": 146.34,
    "end_timestamp_seconds": 250.18,
    "start_timestamp": "02:26",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=146",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "my the Altarget 65,000 from 60 and raised my Russell target from I think it was 3400 to 3800. So I've gotten even more bullish and the biggest bull on street, I guess. But it just looks to me like we've got legs here. So, you know, I hear people worrying and concerned about our tariffs coming back on the, you know, the worry wagon or, you know, are we going to have problems in terms of Ukraine, etc. I just looks like steady as we go here and more than steady, probably pretty sharp rally from here into the Iran, the maybe beyond. When you think of the current work it positioned as you noted, there's a lot going on that might be interpreted as trouble as things slowing down. I'm generally interested in your take on how the market behaves at points like this is compared to prior highs. My brain typically looks at it as or definitely hovering around highs now. The market is hit new highs in previous periods and I'm always curious like what were the conditions when we hit those highs? What did things look like? Very often it does seem like conditions looked at least moderately better than they do now. There's a lot going for the market especially through deregulation technological advancements and stuff like AI so they're definitely or tailwinds for sure big tailwinds but then there's also some decent headwinds. How do you think the market is posting highs here?",
    "start_timestamp_seconds": 227.14,
    "end_timestamp_seconds": 335.78,
    "start_timestamp": "03:47",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=227",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "at least moderately better than they do now. There's a lot going for the market especially through deregulation technological advancements and stuff like AI so they're definitely or tailwinds for sure big tailwinds but then there's also some decent headwinds. How do you think the market is posting highs here? And do you think that it is like what do you think the primary driver is of it? We're in a very strange period because in some ways you can look at that this as almost the beginning of a cycle. Now we're at all five highs with huge runs. Certainly we're up big from 3500 and October of 2022 so we're approaching a double and yet I can look at the market in some ways saying because the Fed is beginning a new easing cycle, the street and because the institutional investor fought this thing all the way up. They are now starting to warm up to the market. They missed almost the double in the market, didn't miss it because they're in stocks but they were skeptical of this thing all the way up and they're getting more bullish here. That's the unusual situation. I mean that's not where we normally would be at all time highs but we are. Even though a little cell-off we've had in the last week particularly in the metals but in the market too some used to get stuck back etc. Even that caused the wall worry to climb again. The institutional",
    "start_timestamp_seconds": 319.22,
    "end_timestamp_seconds": 418.34,
    "start_timestamp": "05:19",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=319",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "where we normally would be at all time highs but we are. Even though a little cell-off we've had in the last week particularly in the metals but in the market too some used to get stuck back etc. Even that caused the wall worry to climb again. The institutional investor is just starting to jump on the formal wagon and say we miss this but it looks like it's going to run and that all of a sudden you get a little week. That's not very much but a couple of percent and they're right back to worrying again. The sentiment is unusual because at all time highs you usually see the sentiment as way too bullish and right now it's still very skeptical, still very cautious and we've got the Fed. My thing is pretty obvious the Fed is beginning. It wasn't a one-off break we're going to see several break cuts in the months ahead and in fact you know polls you can talk about the end of QT and the polling money out. Those things are typically things you see after a market sold off you're a bear market bottom or certainly a correction bottom and you're getting the beginnings of a market. We're at all time highs and far beyond what almost anybody saw coming except me and so it's a very unusual time but I think what you can see in the months ahead meaning the next two or three months certainly and maybe",
    "start_timestamp_seconds": 400.74,
    "end_timestamp_seconds": 495.62,
    "start_timestamp": "06:40",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=400",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "you're getting the beginnings of a market. We're at all time highs and far beyond what almost anybody saw coming except me and so it's a very unusual time but I think what you can see in the months ahead meaning the next two or three months certainly and maybe a little longer is a sentiment moved towards the Fed is beginning and a long easing cycle that could carry this market for a couple of years and so I think that's what's going to pull a lot of people back in from the sidelines or get them to move from a defensive position to a more aggressive stock position. Retails bend there since April they've been really driving this I think they'll continue to get on board so it doesn't mean you're without risk. They're certainly risk in there and certainly I think we are moving towards a global bus next year so it's a really funny period where things look like they can run 30 or 40% upside in the market from here and yet still have a situation where the other side of the mountain isn't very far away. What do you make of the moving goals? Yeah I'm not in the camp that says gold is signaling some big event because frankly I'm looking for a big event next year you know global bus the worst financial crisis in maybe history but certainly the worst downturn in 80 to 90 years it's great to pressure in",
    "start_timestamp_seconds": 475.22,
    "end_timestamp_seconds": 583.22,
    "start_timestamp": "07:55",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=475",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "Yeah I'm not in the camp that says gold is signaling some big event because frankly I'm looking for a big event next year you know global bus the worst financial crisis in maybe history but certainly the worst downturn in 80 to 90 years it's great to pressure in a lot of ways bigger than 2008 so I'm looking for something like that. I don't think that's what the gold sniffing out. I think gold is sniffing out that the dollar is even though it's been strong of late the dollar is basically headed lower. I think gold is sniffing out that there's you know there's certainly still turmoil geopolitically out there with Ukraine and Russia and we're not sure what's going to come out of Gaza. I think gold is more than anything probably technically strong and so it brings in a lot of buyers. I think that's everybody tries to make you know try to read so much into these moves but gold broke out and it's continued to be very strong and when you look at the charts it looks very strong and the institutions again have very little gold. I mean the central banks am buying it but institutional investors did not help okay to gold you know they said oh no it's you know it's not really where we want to be it's yeah and now you're starting to hear just in the last month some big investors saying you should have 10 or",
    "start_timestamp_seconds": 564.26,
    "end_timestamp_seconds": 657.06,
    "start_timestamp": "09:24",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=564",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "buying it but institutional investors did not help okay to gold you know they said oh no it's you know it's not really where we want to be it's yeah and now you're starting to hear just in the last month some big investors saying you should have 10 or 20% of your portfolio gold because of the momentum I mean they can come up with the rationale but why are they interested in it because it's up and that's I think the momentum's going to be get momentum and you can see a lot higher I raised my target on gold in my October letter from 45,000 and that's a pre bus target so the next three to six months I raised my target on silver from 75 to 100 I was already pretty high on the street at 75 and I raised it 200 and again in that same timeframe so they're particularly strong they have big run that obviously got hit very hard this week I see this is nothing more than when you're in a steep rally your corrections are also steep what I call short and sharp and I think we I think we probably have seen the full correction already it's possible you could get us a good shoe dropping but more than likely that that event on what was one day or two is day was was all you're going to get speaking of the event on well recent events but yeah speaking",
    "start_timestamp_seconds": 639.38,
    "end_timestamp_seconds": 732.5,
    "start_timestamp": "10:39",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=639",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "have seen the full correction already it's possible you could get us a good shoe dropping but more than likely that that event on what was one day or two is day was was all you're going to get speaking of the event on well recent events but yeah speaking of near-term volatility I found it really interesting I was running a study on shorter duration index realized volatility obviously I'm an option of straighter so I spent a lot of time looking at forward ball but I find it really interesting to see volatility on average is increased pretty massively over the last decade or so just on average and this isn't looking at necessarily vix outright which again is more forward but looking at realized ranges what do you make of that effect just this general change in the way that the market seems to react to information and it seems like it can really get pretty jittery off of just about anything and then it's kind of like trying to attach a talking point to it right like a Zion bank had a couple you know fraudulent credit lines that they're mitigating for so now financials crater it seems really really volatile comparatively to 10 15 years ago yeah well you're talking to somebody who back in in the early years of my point for the management times you know we didn't get news so quickly and I was you know I was just a social money",
    "start_timestamp_seconds": 717.46,
    "end_timestamp_seconds": 819.86,
    "start_timestamp": "11:57",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=717",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "it seems really really volatile comparatively to 10 15 years ago yeah well you're talking to somebody who back in in the early years of my point for the management times you know we didn't get news so quickly and I was you know I was just a social money manager but we didn't even have quote machines on our desk you know I had to go out and all the look at one and it was really a time when you poured through you got I think you and they came quarterly there was a technical analysis service out of Boston that said a bound book of charts and it came once a quarter and you poured through those because it was fun to look at the look for stocks you know all that stuff set your fingertips today so and it's at the retail investors fingertips and there's you know the the retail brokers have all kinds of trading tools that you can use etc there's trading services out there the news is is right there to the minute you know you can get it on Twitter you can get it on Bloomberg you can get it somewhere else so you know for somebody who kind of grew up in the time when we really weren't so attached to news it has this been happening all at once you know it's been getting faster and faster but it's also I think because of where we are in the",
    "start_timestamp_seconds": 797.14,
    "end_timestamp_seconds": 884.82,
    "start_timestamp": "13:17",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=797",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "else so you know for somebody who kind of grew up in the time when we really weren't so attached to news it has this been happening all at once you know it's been getting faster and faster but it's also I think because of where we are in the cycle you know you're you're so late in the cycle and it's been literally 43 years in a bull market the cycle of bull market cycle and certainly you know a long stretch from 2008-19 even though we did have a short bear market in 2022 I just think it's the nature of the beast and as you get steeper you're going to see more volatility you know in a lot of ways if you remember there was a lot of talk about how there was so little volatility just a year ago or whatever and it was just kind of almost every day it was up I think it's we're going to see volatility in a big way over the next year you know it was one thing I will say is the fix the way the fix acted here while the market was moving up the fix was moving up and that's unusual and I'm not sure exactly what that was about you probably have a better handle on that than I do but I you know I don't read too much into that I don't think it means danger sign I just think you know volatility has",
    "start_timestamp_seconds": 872.42,
    "end_timestamp_seconds": 953.06,
    "start_timestamp": "14:32",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=872",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "moving up and that's unusual and I'm not sure exactly what that was about you probably have a better handle on that than I do but I you know I don't read too much into that I don't think it means danger sign I just think you know volatility has gotten at least the fix index has gotten so low and when we got a little nervous in a scenario it translates pretty quickly into the fix. It's actually really funny because when I was looking at the analysis a big thing that I that I compare is variance was premiums so the relationship between implied vault over looking then realize all what what's happened and it is ironic because realized vault is trended high and VIX forward looking vault specifically for S&P is trended low so we find ourselves in this very weird scenarios I definitely actually spend a lot of my time trading vault because it is at least to me that can be a little bit more predictable than other stuff but I the other thing I find really interesting and what your thoughts are on our the correlation between specifically gold but I would say metals in general and the indices a lot of people build port folios on these really long term standard relationships that sometimes can get skewed but what do you think of the relationship right now between gold and S&P or you know pick it index of your choice? Yeah because we",
    "start_timestamp_seconds": 940.42,
    "end_timestamp_seconds": 1034.82,
    "start_timestamp": "15:40",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=940",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "in general and the indices a lot of people build port folios on these really long term standard relationships that sometimes can get skewed but what do you think of the relationship right now between gold and S&P or you know pick it index of your choice? Yeah because we have talked pretty much quarterly for the last year anyway and talk for last couple of two or three years but but quarterly really this year I think you know I've been pretty consistent saying everybody thinks stocks and the metals have to move opposite or stocks and gold have to move opposite or inverse relationships and I've consistently said what we're going to see in this last run to the top is that they're all going to play stocks are going to play the metals are going to play the bonds are going to play another thing everybody so the bond market move up when the stock market moves down they should know you're going to have rates coming down the metal propel stock market it also propel the metal's market and that's what I think you're seeing I think you can see it in the space here in a much bigger way in the next few months I mean I'm expecting that 10 year to fall to 3% or below in the next 3 or 6 months probably closer to 3 but I don't know and the metals you know I think my target could be hit as",
    "start_timestamp_seconds": 1013.78,
    "end_timestamp_seconds": 1102.9,
    "start_timestamp": "16:53",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=1013",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "a much bigger way in the next few months I mean I'm expecting that 10 year to fall to 3% or below in the next 3 or 6 months probably closer to 3 but I don't know and the metals you know I think my target could be hit as early as January you know $100 on silver 5,000 gold maybe even sooner you know if it really gets going here so so I think you're going to see what we've seen in recent months is only going to get more dramatic and obviously my stock market calls for the signal parabolic and basically vertical now another thing I'm interested in I don't know what kind of analysis you've done in a relationship you have with it but the concept of government shutdowns generally just interesting to me I experienced one when I was on active duty which was very entertaining because the beautiful part is like when you're marine it's just like shut up bitch go to work like no one here nobody cares but you know being on the other side of it you start to realize like there's interesting impacts that actually start to trickle through to a lot of different things do you think that the government shutdown has potential impact on your broader analysis or is that kind of secluded to its own little sphere expected to stay under the long-term average the long-term maximum which is 35 days the average is much shorter than",
    "start_timestamp_seconds": 1083.54,
    "end_timestamp_seconds": 1176.18,
    "start_timestamp": "18:03",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=1083",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "a lot of different things do you think that the government shutdown has potential impact on your broader analysis or is that kind of secluded to its own little sphere expected to stay under the long-term average the long-term maximum which is 35 days the average is much shorter than that or do you think that there could be more interplay yeah we're coming up a lot of months now I think so it's getting to you know long in the tooth type of based on history you know it surprises me because I don't think the Democrats gain anything out of this and you know you have a continue resolution so that they can continue talking it really tells me the Democrats don't have any leverage anywhere else so they're doing doing something I think is suicide but you know the Republicans push the bill today to pay those that are at work you know all the so-called unnecessary workers who are not essentials are are not going to get paid but they said we'll pay everybody else and I think it pretty much was by party lines and all the Democrats voted against it almost all of them I mean how does that look here what are you gaining because you know a continuing resolution is just to keep the government functioning while you continue to negotiate whatever your differences are and what what the Democrats are trying to do is undo the you know the big beautiful",
    "start_timestamp_seconds": 1155.38,
    "end_timestamp_seconds": 1250.98,
    "start_timestamp": "19:15",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=1155",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "I mean how does that look here what are you gaining because you know a continuing resolution is just to keep the government functioning while you continue to negotiate whatever your differences are and what what the Democrats are trying to do is undo the you know the big beautiful bill that you know yes you guys lost the election you don't have a you know the Republicans although it's slam have a majority in both houses and they have the presidency so of course your agenda is not the one that's that's playing right now we tell you win election and you can you can do your thing but but they as keeps being repeated I think by the Republican side you know this is this is Schumer basically cow-towing to the O.C. you know this is this is the far left taking holding the rest of the Democrats hostage and makes no sense but you know they can be irrational for a while just like markets can I guess so yeah I'm not sure I am not at least at this point thinking it's gonna alter the markets whatsoever it certainly hasn't yet and I think the Democrats run the risk that what I'm not sure where it's at right now but a rest of all the rest of all in the was one that basically was pushing the idea that we can we can because they're giving us this because they won't play ball we have the",
    "start_timestamp_seconds": 1238.02,
    "end_timestamp_seconds": 1332.1,
    "start_timestamp": "20:38",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=1238",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "run the risk that what I'm not sure where it's at right now but a rest of all the rest of all in the was one that basically was pushing the idea that we can we can because they're giving us this because they won't play ball we have the ability to actually have permanent layoffs you know we can we can cut government and Republicans would like nothing more you know we have huge deficits we have huge debt problems and so if the Democrats want to play that game I think they are gonna run the risk of losing a lot of their government workers that are basically Democrat yeah the political side of it is it really is always interesting to see especially I always find the starting point at least of both sides completely and directly blaming the other you look at that and you're like okay this is not gonna go smooth there's no smooth sailing when both is like not buck this other guy so it's like okay well we'll see how that circus goes the the interplay with markets is really really interesting to me because in the beginning when it first happened the market reacted we saw not a lot of change involved but a small a very small change and then that's just about been fully abated by now and I'm really really curious if there is a tipping point where at some point this this effect being the shutdown does",
    "start_timestamp_seconds": 1315.94,
    "end_timestamp_seconds": 1406.66,
    "start_timestamp": "21:55",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=1315",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "the market reacted we saw not a lot of change involved but a small a very small change and then that's just about been fully abated by now and I'm really really curious if there is a tipping point where at some point this this effect being the shutdown does have some sort of impact I have very little historical reference I didn't analysis of literally all prior shutdowns there's just not that many of them and there's a lot of stuff that was going on in most of them and most of them were like five days or less yep it's just very little like and extract from it from a data lens from a more global lens if the shutdown eventually whenever that is resolved one thing I did notice is that almost every single time it resulted in a up day in the market on the day of reopening almost always do you think that when the government does eventually reopen does that provide a tailwind for the pairbalk move up or again is that completely desperate it probably has more interest to you guys on the trading side you know to me anything it does day to day doesn't matter to me and it's just whatever it is I don't think it really matters a lot to the bigger picture obviously if if they can never reach an agreement and then things start really hitting the fan in terms of you know people not being able",
    "start_timestamp_seconds": 1391.54,
    "end_timestamp_seconds": 1488.82,
    "start_timestamp": "23:11",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=1391",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "to day doesn't matter to me and it's just whatever it is I don't think it really matters a lot to the bigger picture obviously if if they can never reach an agreement and then things start really hitting the fan in terms of you know people not being able to get food people not being able to get paid and their bills are being paid etc you know somewhere along the line if they are that they are if the Democrats are that irrational you know a bit rough but I don't think that's the story I think we'll see something probably not until November which isn't very far away now but you know what is different this time is it's usually the Republicans are shutting the government down or the Republicans who are trying to have some leverage and in this case Democrats have no leverage and yet they this is all they've got in their mind and maybe they don't care if they mess up the economy because they'll think they're hurting Trump that's what it feels like to me is this is all more of the Trump's arrangements in their own type stuff you know but in the end to me since I don't think it's really holding the market back now it's hard for me to argue that when they when they do open up it's going to have some big effect on the upside yeah I think that logically flows with the regional banks",
    "start_timestamp_seconds": 1473.7,
    "end_timestamp_seconds": 1561.94,
    "start_timestamp": "24:33",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=1473",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "in the end to me since I don't think it's really holding the market back now it's hard for me to argue that when they when they do open up it's going to have some big effect on the upside yeah I think that logically flows with the regional banks we what you alluded to it a little bit earlier but there were two different banks that had dealings with an entity that seemingly is committing fraud to some degree the regional banks obviously well the really exile f in general just the entire financial sector had a pretty big negative reaction to that in anticipation of more widespread it looks to be contained but did that reaction mean anything to you did the way that the market reacted there highlight anything about positioning risk tolerance that leads into your broader thesis longer term what I would say is that it had it did no technical damage to the charts when I look at a KLA when I look at the banking indexes everything looks fine and bullish the brokers look you know stock brokers look bullish I just don't see on the horizon the warning signs that were there and this is from the guy that believes next year is going to be all hill breaks loose but it's just not there yet you know there are there are warning signs you know you're seeing some primal downloads to winquincey rates or I think it all time eyes you",
    "start_timestamp_seconds": 1542.1,
    "end_timestamp_seconds": 1641.86,
    "start_timestamp": "25:42",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=1542",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "and this is from the guy that believes next year is going to be all hill breaks loose but it's just not there yet you know there are there are warning signs you know you're seeing some primal downloads to winquincey rates or I think it all time eyes you know you're seeing you know problems in private credit they're beginning to see strains but nothing other you like you say what we had this book the market really look like a one-off it was fraud it was you know a couple banks it is not systemic at this point I think we'll move towards the systemic but it's probably still several months away I think the point I was alluding to there and wondering if this factor is in the the fact that the market reacted that negatively to that small of a thing to me leads me to believe that when your your thesis if and when it plays out much bigger gravity I can only imagine the kind of reaction that that would spur if this small isolated thing caused what it did well I think you saw here is and I view this is a bullish ironically but what you saw here is how I'd let's say for a long time you know institutional investors in particular have one foot out the door you know they've been nervous all the way up they never thought this was a bull market coming out of 22 they thought",
    "start_timestamp_seconds": 1622.58,
    "end_timestamp_seconds": 1716.1,
    "start_timestamp": "27:02",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=1622",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "ironically but what you saw here is how I'd let's say for a long time you know institutional investors in particular have one foot out the door you know they've been nervous all the way up they never thought this was a bull market coming out of 22 they thought it was a bear market rally when I went to new highs it said yeah but the valuations are too high for it to have legs so they've been really behind the able on this all the way up and they've been nervous about you know maybe maybe he's because I've been talking to goalable bus for several years but there's there's enough nervousness out there that they viewed this as confirmation that we're in trouble you know there's there's still a huge wall of worry of people who you know institutions investors who think do at least I think institutional investors think more like my scenario for next year but certainly Trump administration isn't thinking that way Congress isn't seeing that the Fed isn't seeing that so the people the policymakers are have nothing like that on their radar but that doesn't mean the institutions don't I think yeah sell side wall street doesn't have that on their radar really but I think there are plenty of institutional portfolio managers who do worry that there's you know there's warning signs of something bigger that you know we're just so over leveraged et cetera so I think what they what",
    "start_timestamp_seconds": 1695.7,
    "end_timestamp_seconds": 1789.3,
    "start_timestamp": "28:15",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=1695",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "sell side wall street doesn't have that on their radar really but I think there are plenty of institutional portfolio managers who do worry that there's you know there's warning signs of something bigger that you know we're just so over leveraged et cetera so I think what they what they got from the Zion this thing was something that sparked a confirmation in their mind that oh yeah see we're not far away from this thing all coming undone but I view that as bullish because that just shows how skittish they still are you know how how sentiment is still very much on the bearer side they had to be in the market because they fought it for so long and in the momentum was killing their performance that they were out so they're they're not out but they're not in there with any kind of bullishness more and that's change yeah I mean they are getting more bullish but there's they're just nowhere near what I call the all-in sentiment that you're going to see at the top that's that's probably the biggest reason why I raise my targets there's just still a huge wall of worry out there I see yeah I follow you had mentioned before you know about the global bust and you definitely have been been talking about it for a while at least since you and I have connected as the timeline for it shifts is there a conditional environment that would",
    "start_timestamp_seconds": 1772.82,
    "end_timestamp_seconds": 1864.74,
    "start_timestamp": "29:32",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=1772",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "out there I see yeah I follow you had mentioned before you know about the global bust and you definitely have been been talking about it for a while at least since you and I have connected as the timeline for it shifts is there a conditional environment that would lead you to no longer believe that the bust is on the horizon yeah it's not really time driven I mean what I said long is when this cycle ends it will end in global bust a global bust is something we haven't seen in 90 years so the fact that it stretches and goes a few years beyond in the scheme of 90 years you know it's something that rare it's just not going to be a precise point in time it's not there's no deadline and there's no what I what it's could happen maybe is if the Trump administration policy has really proved so successful that all that money coming in from overseas you know investment in this country you know getting tariffs to kind of level the playing field and trade arena well if all those things offset what I think is a coming recession that morphs into a bust then that's what would change my mind or that's what would shift the the reality of what we get but I don't have any sense that that's the case yet I really believe that we are as I say it's the huge leverage far beyond 2008",
    "start_timestamp_seconds": 1842.58,
    "end_timestamp_seconds": 1948.18,
    "start_timestamp": "30:42",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=1842",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "morphs into a bust then that's what would change my mind or that's what would shift the the reality of what we get but I don't have any sense that that's the case yet I really believe that we are as I say it's the huge leverage far beyond 2008 and nine far beyond anything we've ever seen in the world before in terms of 330 trillion and debt you know quadrillions and no shall value of derivatives that that morning anything else is why I think you've got a recession that morphs into something far worse and then you still have under the surface a lot of fragility I mean there's just we can look at the fact that you know so so called GDP now estimates are at 3.8% for the fourth quarter you know I think we're we're going to go back and pretty date this period now and say we started the recession before this that's the engine saying if you're talking about the close to 4% GDP but under the surface they're just again that's a have and have not economy and they have not to at least 50% economy maybe more or the population and they are barely getting by so we're in a period I mean it's it is the roaring 20s in a lot of ways you know we're in a period where we're not far from you know in that case the great depression and yet it's party on folks everything",
    "start_timestamp_seconds": 1923.94,
    "end_timestamp_seconds": 2019.46,
    "start_timestamp": "32:03",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=1923",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "and they are barely getting by so we're in a period I mean it's it is the roaring 20s in a lot of ways you know we're in a period where we're not far from you know in that case the great depression and yet it's party on folks everything looks great that is the similarity I mean there are a lot of differences but that is the similarity and I think that's that's the way it goes is when you get these events we saw it in 2008 you know right up until um in fact they're early September of 2000 I can I can remember distinctly I was I was saying hard landing ahead and you know financial crisis and you had all of the street economists almost all of them saying no recession site was off landing and we were a month or less than a month from Lehman brothers and the ultimate crash so that is the reality is that when these things if it's safe and angel break when these things break they oftentimes come out of nowhere or at at least there's not a lot of pre-warning that everybody sees coming it's yeah those inner dependencies are also really interesting and it leads me to one more question for you something that I think is common among a lot of your critics with your with your idea is the timing element of it a lot of them say like always been saying this for",
    "start_timestamp_seconds": 2004.34,
    "end_timestamp_seconds": 2100.66,
    "start_timestamp": "33:24",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=2004",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "inner dependencies are also really interesting and it leads me to one more question for you something that I think is common among a lot of your critics with your with your idea is the timing element of it a lot of them say like always been saying this for a long time but can you dive a little deeper just to explore this this difference because I understand their lens their lens is always like somebody said this is gonna happen by this it didn't happen so it is not a thing your lens is I'm talking about literally almost a centrally long thing when we're talking about one or two years in that duration it's same same so can you talk a little bit about that paradigm and the window that you're playing with yeah it's two things it's a misunderstanding of what a cycle call is so you know I get myself into trouble because I am I'll say this could happen by a certain date and I just expect people to understand the difference between could and will so you know but they don't they hear could and they hear will you know this will happen by I have never in my life as a forecaster said this will happen it's good by mail with a time frame and so then if you if you explain that the the trader side of them says oh you're just playing games with us you know you're just using",
    "start_timestamp_seconds": 2084.74,
    "end_timestamp_seconds": 2180.1,
    "start_timestamp": "34:44",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=2084",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "by I have never in my life as a forecaster said this will happen it's good by mail with a time frame and so then if you if you explain that the the trader side of them says oh you're just playing games with us you know you're just using semantics you called this thing and it didn't happen when you said it's a lot of it is because for the retail public they've they've come in without really understanding investing versus trading or really understanding what they're doing you know they're they're kind of brought up in a whatever they're training some have gone to you know these trading shops or services or whatever so they are learning the trading and others just kind of don't know what investing is but so part of it is that and part of it is yes this is a I mean we're talking about something that's unprecedented in terms of what we've already seen and what we're going to see you know this market I had somebody the other day saying this has been a normal market I said you realize what the S&P has done from from 2020 you know it's tripled it's tripled in five years five and a half years and you consider that normal you have no idea what you're you know what you're talking about but that's their that's their experience level is that's all they've seen I guess so but the other side of it is",
    "start_timestamp_seconds": 2156.42,
    "end_timestamp_seconds": 2257.3,
    "start_timestamp": "35:56",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=2156",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "tripled it's tripled in five years five and a half years and you consider that normal you have no idea what you're you know what you're talking about but that's their that's their experience level is that's all they've seen I guess so but the other side of it is why why does it keep stretching or why can you not pinpoint it and why is this cycle stretching more than most part of that is again we tend to underestimate five trillion dollars was pumped into the system in 2020 and 2021 in Wall Street and in the markets we're used to money going into the system it gets pumped in and it might impact for the next year or maybe two when you pump in we had never you know we pump 3.7 trillion into the economy after 2008 nine over the course of seven or eight years we had never pumped five trillion in in less than two years and that money doesn't all and along with the pumping of the money from the Fed along with that came all these programs we had never seen before you know the stabilize the bond market to provides well business loans in to the tune of millions of dollars to people you know just things to try to stabilize the system that was totally shut down I mean we we shut the economy down the world wide economy down for a quarter because of the pandemic you know the",
    "start_timestamp_seconds": 2235.3,
    "end_timestamp_seconds": 2333.3,
    "start_timestamp": "37:15",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=2235",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "business loans in to the tune of millions of dollars to people you know just things to try to stabilize the system that was totally shut down I mean we we shut the economy down the world wide economy down for a quarter because of the pandemic you know the fears of what the pandemic was so so we were willing to do all kinds of things that were unprecedented that were never done before in magnitudes never done before what I think and I didn't you know this is hindsight because I didn't see it all and for sight but five trillion dollars and all the programs ago with it just don't go through the system in two years they've helped keep this thing going for a lot longer but it's drying up you can see it in the repo you know the repo the Fed's repo has moved down towards zero it's low as something's gone so you see it there you seeing that in terms of some of the credit numbers that are starting to show strain so it's getting there but yeah you know if you if you look back from say 22 to now you know it's three and a half years and you know I thought it would happen a lot faster but it's I think it's a lot of it's because of all that as I say we went from an eight and a hundred seventy five billion dollar Fed balance she in",
    "start_timestamp_seconds": 2320.34,
    "end_timestamp_seconds": 2411.94,
    "start_timestamp": "38:40",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=2320",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "know it's three and a half years and you know I thought it would happen a lot faster but it's I think it's a lot of it's because of all that as I say we went from an eight and a hundred seventy five billion dollar Fed balance she in October of 2022 that had that was a largest it had ever been from from 1913 on and we've gone from that to nine trillion in the 2021 now we backed it off to six and a half trillion but we're we're talking about trillions we're talking about numbers that are just beyond any of our ability to really get our heads around and we talk about it and we act like it's normalcy it's not normalcy and that's that that my opinion is probably a simplistic way what the bus will be all about is you know you've got the combination of policy makers like Paul saying we're never going to do that again we're not going to print money like that again we're not going to support the stock market like that again we're not going to zero-interfer policy again I think I think they are but they don't know they are and they're going to be reluctant to do that so that's going to be a delay this you know at a time when things are falling apart they're not going to be nearly in the mindset that we're going to save the system we've got to",
    "start_timestamp_seconds": 2389.14,
    "end_timestamp_seconds": 2476.66,
    "start_timestamp": "39:49",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=2389",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "don't know they are and they're going to be reluctant to do that so that's going to be a delay this you know at a time when things are falling apart they're not going to be nearly in the mindset that we're going to save the system we've got to do they won't know the magnitude that they need and they're going to be reluctant to do it because they don't want to repeat to mistakes of the last cycle that all those delays in a very leveraged situation is why things can fall apart because I'm sure you hear it I get a lot is oh Trump won't let that happen or Paul won't let that happen I go this isn't going to happen because they want it to this isn't going to happen because they aren't trying to stop it it's just the combination of all the things have come before lead to this kind of environment where they're going to be slow to react the leveraged is going to mean you have to be faster to act the size of the leveraged means the magnitude of the leveraged means the magnitude of the unwind is going to be huge and and they're doing baby steps I mean it just all that put together whether happen the first half an extra or later next year or right after the new year I have no idea but I think it's coming and I think it'll come fast when it",
    "start_timestamp_seconds": 2465.38,
    "end_timestamp_seconds": 2549.14,
    "start_timestamp": "41:05",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=2465",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "be huge and and they're doing baby steps I mean it just all that put together whether happen the first half an extra or later next year or right after the new year I have no idea but I think it's coming and I think it'll come fast when it does well as usual we will we will see we will find out one of the beautiful parts about being a trader is my world is pretty simple I don't have to do all the big brain stuff and try to inject all these different things and come up with an idea I just look it what's happening and do my best to fit to it but hearing the way that you're analyzing stuff is always interesting to me and it's fun because it really is a dichotomy to like most of my world which is much much shorter term in nature so as always love love chat and love pick your brain a little bit I know folks can find you on X and if they're interested in your newsletter which is by subscription they can DM you there is there anywhere else you would like to direct people yeah no I don't think so I would just say you know stay tuned here on you know I am on on X every day I think these next three months are going to be history in the making for sure I mean I think this is going to be",
    "start_timestamp_seconds": 2528.98,
    "end_timestamp_seconds": 2615.06,
    "start_timestamp": "42:08",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=2528",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 2628.0
  },
  {
    "video_id": "jRS3aYlZPyI",
    "title": "David Hunter on Why Gold is Skyrocketing Right Now | The Outlier Podcast",
    "text": "yeah no I don't think so I would just say you know stay tuned here on you know I am on on X every day I think these next three months are going to be history in the making for sure I mean I think this is going to be maybe the most exciting time we've ever seen in markets so just stay tuned I am looking forward to it David a pleasure is always thank you thanks Eric",
    "start_timestamp_seconds": 2600.5,
    "end_timestamp_seconds": 2622.98,
    "start_timestamp": "43:20",
    "video_url": "https://www.youtube.com/watch?v=jRS3aYlZPyI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=jRS3aYlZPyI&t=2600",
    "chunk_index": 34,
    "word_count": 79,
    "upload_date": null,
    "duration": 2628.0
  }
]