[
  {
    "video_id": "KJbt4Bi-59w",
    "title": "ORCL and GME Earnings, AAPL iPhone | Stock Market Update",
    "url": "https://www.youtube.com/watch?v=KJbt4Bi-59w",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 9,
    "text": "What's up, outliers? Happy Monday, quick market update. I got three things on the agenda for today. I want to talk a little bit about Oracle earnings because as you can tell, it looks really, really good. They close today at 139.89 and they're trading at 152. And we'll talk about why that's important. The next thing I want to talk about after that is the iPhone and Apple because, well, you know, it's always nice to see us get pitched the same thing over and over again, you're over here and then go buy it for sure. So I want to take a look at that. And then I want to take a look at GameStop because it has earnings coming up tomorrow. So I want to see how we're positioning leading into earnings. So what's going on with Oracle and why does this matter? Well, to me, I think this is really, really important because we can see that it's reporting really, really well. We'll go through some of those metrics in just a minute, but essentially for expectations, this is the funny part about markets. It was expected at 1.00 and a nickel and it came in at 1.39. So that's a really big EPS beat as we've seen with a lot of other tech companies, but the market is rewarding them. And a lot of what they're rewarding them for again, as per usual, are actually the way that we're forecasting out into the future. And",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KJbt4Bi-59w&t=0"
  },
  {
    "video_id": "KJbt4Bi-59w",
    "title": "ORCL and GME Earnings, AAPL iPhone | Stock Market Update",
    "url": "https://www.youtube.com/watch?v=KJbt4Bi-59w",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 9,
    "text": "at 1.39. So that's a really big EPS beat as we've seen with a lot of other tech companies, but the market is rewarding them. And a lot of what they're rewarding them for again, as per usual, are actually the way that we're forecasting out into the future. And the potential growth opportunities for Oracle, which look really, really robust. So I absolutely recommend taking a look. We can take a look through the earning release a little bit later during the YouTube live session if we want. But I took a cursory overview and I mean, they're overall performing really, really strong. So they are opening this here that I think is really interesting that there's going to be a new partnership that they're launching with Google. They really are seemingly being well received here. So what this all means in my opinion is, it's kind of a breath of fresh air, especially after the last week that we had in the markets. We saw tech get a little bit of a bump today, but not much. We saw the SP make a little bit better of a rally, but still not much. And same thing with small caps hanging near the lows here. All up on the day, but not massively, VIX came down closing at 1945. So the market is still in my opinion at a very tenuous phase. We can see this standard deviation channel as days drop off the back here and new days",
    "start_timestamp_seconds": 64.6,
    "start_timestamp": "00:01:04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KJbt4Bi-59w&t=64"
  },
  {
    "video_id": "KJbt4Bi-59w",
    "title": "ORCL and GME Earnings, AAPL iPhone | Stock Market Update",
    "url": "https://www.youtube.com/watch?v=KJbt4Bi-59w",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 3,
    "total_chunks": 9,
    "text": "caps hanging near the lows here. All up on the day, but not massively, VIX came down closing at 1945. So the market is still in my opinion at a very tenuous phase. We can see this standard deviation channel as days drop off the back here and new days are added. You can see that the slope of this is actually gone from this about flat almost on a three month. So what that tells us is that the near term price action has been not great. So if we don't start seeing spy rotating up and out from here, it starts to look more and more like consolidation sideways action until there's some sort of big catalyst. And tech just looks down from here, even on this little tiny update, it was really well bought. There was really strong by volume, but it's just not that significant just yet. So I feel like the market is at kind of an important inflection point, but seeing this come through from Oracle, I think is kind of a good sign because we're seeing a company that reported really well for earnings. And so far, the market likes it, which is solid. Next thing we have is Apple. So if we take a look, it looks kind of the same. How cool. Look at that. Got three little cameras. How many of those mine have I think I have the 15. Yeah, looks about the same. It does have a really",
    "start_timestamp_seconds": 132.36,
    "start_timestamp": "00:02:12",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KJbt4Bi-59w&t=132"
  },
  {
    "video_id": "KJbt4Bi-59w",
    "title": "ORCL and GME Earnings, AAPL iPhone | Stock Market Update",
    "url": "https://www.youtube.com/watch?v=KJbt4Bi-59w",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 4,
    "total_chunks": 9,
    "text": "solid. Next thing we have is Apple. So if we take a look, it looks kind of the same. How cool. Look at that. Got three little cameras. How many of those mine have I think I have the 15. Yeah, looks about the same. It does have a really cool function button apparently that's supposed to be a big deal. I'm not going to pretend to be some sort of expert on all the nuance differences between these. I really spend very little time. I actually have a buddy that's really interested in them. So this is not like a tech gadget review going through the differences and stuff. But yeah, here's some of the differences for you. The reason I bring that up is just because Apple is always at part of the conversation. And we can see that it didn't move a lot. And again, this isn't necessarily a big shock to me. Feels like the market is kind of used to this annual renewal of things. And unless it's a really, really big upgrade, it doesn't always lead to this big giant movement. That's kind of what I see here. Now let's run over to GameStop. And GameStop is starting to catch a bid here. So we can see that it hit this kind of term low. The low of this day was 1988 in here. Actually, I guess I can delete this old one. That's a little, a little aged as it were. We can",
    "start_timestamp_seconds": 199.08,
    "start_timestamp": "00:03:19",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KJbt4Bi-59w&t=199"
  },
  {
    "video_id": "KJbt4Bi-59w",
    "title": "ORCL and GME Earnings, AAPL iPhone | Stock Market Update",
    "url": "https://www.youtube.com/watch?v=KJbt4Bi-59w",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 5,
    "total_chunks": 9,
    "text": "And GameStop is starting to catch a bid here. So we can see that it hit this kind of term low. The low of this day was 1988 in here. Actually, I guess I can delete this old one. That's a little, a little aged as it were. We can update it. And it's been rowing up up since. And right now it's at 2425, which again, for GameStop, that move might not seem huge. But if you think about it, that's essentially like a five point move for a little less four point move. It's that's not insignificant for a product that's priced as GameStop is. So for the people that are out there trading movement, there's some movement here. It's just not what we're kind of hoping to see, which is obviously to the moon. Now, it does have earnings coming up, which I feel is important to talk about. So if we take a look at what we saw today in total net premium, it was 1.3 million. So what that tells me is obviously we have people that are coming into buy. Obviously. And if you look at the put volume call volume, it's kind of light. Right? So put volume was 52. Call volume was 168. There's not a lot in here that necessarily jumped out at me. So if we take a look now inside the trade tab, we can see current open interest. We have to update this. So you can see current",
    "start_timestamp_seconds": 267.64,
    "start_timestamp": "00:04:27",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KJbt4Bi-59w&t=267"
  },
  {
    "video_id": "KJbt4Bi-59w",
    "title": "ORCL and GME Earnings, AAPL iPhone | Stock Market Update",
    "url": "https://www.youtube.com/watch?v=KJbt4Bi-59w",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 6,
    "total_chunks": 9,
    "text": "light. Right? So put volume was 52. Call volume was 168. There's not a lot in here that necessarily jumped out at me. So if we take a look now inside the trade tab, we can see current open interest. We have to update this. So you can see current open interest is 596K versus 279. Little bit light. And if we take a look at open interest specifically for this series, it's also very light. It does have calls you heavy. So I'm seeing 105,000 calls versus 31,000 puts. That's a big ratio between those. And normally when you're going into earnings, a lot of people are actually hedging the downside because you're kind of holding the stock fearful of a gap down. So you buy some puts. That's super normal. And I just I don't see a massive concentration in here. Yet. But again, we can see that there were way more calls traded today, except it's a really even split between the bid, the offer, and then between the market, which we can't tell necessarily if those are bought or sold. So looking through here, there's nothing that's, I don't know, like really jumping out at me, the same things you'll always see beginning the day busier than end of day or beginning of the day and end of day busier than middle of the day. Typically, that's kind of common. But let's take a quick look at any large trades that came through. I didn't see",
    "start_timestamp_seconds": 335.72,
    "start_timestamp": "00:05:35",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KJbt4Bi-59w&t=335"
  },
  {
    "video_id": "KJbt4Bi-59w",
    "title": "ORCL and GME Earnings, AAPL iPhone | Stock Market Update",
    "url": "https://www.youtube.com/watch?v=KJbt4Bi-59w",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 7,
    "total_chunks": 9,
    "text": "the same things you'll always see beginning the day busier than end of day or beginning of the day and end of day busier than middle of the day. Typically, that's kind of common. But let's take a quick look at any large trades that came through. I didn't see a whole lot that stuck out to me. Yeah, it's typically for stuff like this. I have a bunch of scans that I typically run. And there was nothing that popped today like last week. I'll even look between no side, meaning things that are in the mid. So to see if there's any like big, big premium trades that roll through. And I just didn't see a lot of those. So far as I could tell right now, it looks like pretty quiet positioning leading into earnings. We can see some put transactions coming in at the ask. So people are buying some puts, but it's still not much right. 491. It's insignificant at best. So something to keep an eye ball on. I'm excited for earnings. I'm really, really, really curious to see one, if we're going to come across any interesting information that people tell me that is not coming. So I'm not really expecting it. But I am still hopeful that maybe GameStop will release a little bit of a outline or game plan on how we're thinking about the capital that's on hand because obviously I'm very interested in that. And then the other thing",
    "start_timestamp_seconds": 412.76,
    "start_timestamp": "00:06:52",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KJbt4Bi-59w&t=412"
  },
  {
    "video_id": "KJbt4Bi-59w",
    "title": "ORCL and GME Earnings, AAPL iPhone | Stock Market Update",
    "url": "https://www.youtube.com/watch?v=KJbt4Bi-59w",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 8,
    "total_chunks": 9,
    "text": "is not coming. So I'm not really expecting it. But I am still hopeful that maybe GameStop will release a little bit of a outline or game plan on how we're thinking about the capital that's on hand because obviously I'm very interested in that. And then the other thing I'm interested in is if we pop in here for earnings, we can see that it's had decent earnings. And what I mean by that is just in terms of Q2. If I look back over the past Q2s, it's obviously had some down ticks. But it's nothing like catastrophic and Q2 and 22 actually rallied up. So I don't think Q2 is necessarily like some sort of really bad quarter from what I can see here. But it does look like there's an expansion in volatility leading into this earnings release, which is kind of interesting. We won't really know what this will look like until the market gets closer to the close tomorrow. But it looks like an interesting earnings play. I'm definitely eyeballing it from an option trading perspective to look at it for earnings specifically. Just a little bit harder to structure than I typically like to and something like this, which we can spend some time talking about during the live stream. So exciting to see. As always, if there's any questions, anything you want to take a look at, let me know. The entire live stream schedule is now out. You can see it",
    "start_timestamp_seconds": 476.36,
    "start_timestamp": "00:07:56",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KJbt4Bi-59w&t=476"
  },
  {
    "video_id": "KJbt4Bi-59w",
    "title": "ORCL and GME Earnings, AAPL iPhone | Stock Market Update",
    "url": "https://www.youtube.com/watch?v=KJbt4Bi-59w",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 9,
    "total_chunks": 9,
    "text": "to and something like this, which we can spend some time talking about during the live stream. So exciting to see. As always, if there's any questions, anything you want to take a look at, let me know. The entire live stream schedule is now out. You can see it on the YouTube channel. We got stuff most days at five o'clock. So come hang out, be an outlier. So you guys later.",
    "start_timestamp_seconds": 540.76,
    "start_timestamp": "00:09:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KJbt4Bi-59w&t=540"
  }
]