[
  {
    "text": "What's up outliers? Today I want to talk to you about one of the most pivotal tools in my trading career. I started trading 2007 and I really wish I used this more early on but I had these ideas that I was going to trade and make a bunch of money. Super fast, super easy and joker. It didn't quite go that way. So what I want to talk to you about today is one of the best tools you have at your disposal yet. Nobody really uses it and it's not sexy. It's not cool but it's effective. It's paper trading. I want to walk you through a bunch of the misconceptions I hear about it. I want to walk you through how I think it might make sense for people to think about it. And then I want to walk you through how you can make it worth your while. Whether you are a brand new trader or you're an experienced trader, there's still a use case for it. And I want to make the argument on what that looks like. So let's get right in. What I hate hearing are these kinds of things. It's fake money. It's two time consuming. I don't think it's worth the time. We have this person that made a comment on my video that says, you know, I don't find it that useful because I take huge positions. Just see how they work out because I don't care if they",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "money. It's two time consuming. I don't think it's worth the time. We have this person that made a comment on my video that says, you know, I don't find it that useful because I take huge positions. Just see how they work out because I don't care if they lose. So can't take it seriously. So here's the way I would try to frame it for somebody. The first question I have is, do you think making money trading is easy? Like do you think it's an easy task to make money? And if you do, I would encourage you hop over to my website, go to resources, go down here to this thing called do traders make money and take a look at some of these studies that I have because I can quantifiably tell you it's not easy money because the overwhelming majority of traders that start trading do not continue beyond the five year mark. We can see all these issues that traders have trading. So I would argue then that it's it's not easy. So then if it's not easy, why do we take the approach that we all do and it's because this is a solo endeavor and nobody's forcing you to do the right things. So if you think about a skill or a sport that you have a big skill set in something that you've developed over years, you probably attained it through going through prolonged periods of working on an isolating",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "a solo endeavor and nobody's forcing you to do the right things. So if you think about a skill or a sport that you have a big skill set in something that you've developed over years, you probably attained it through going through prolonged periods of working on an isolating small pieces of it in lower risk environments. So if you play a sport that's through scrimmages that's through practice with your team. If you think it's something like playing guitar and you do it as a hobby, you just do it for fun. Well, you still take a lot of time to learn how to do it, but there's no risk involved. If you're terrible at it and you're just playing it in your house, nobody cares. So trading is a bit different. There's risk involved. Literally your livelihood because as we know, money cannot buy you happiness. But what I like to remind people is poverty can't buy you anything. And if you have money and you're already a happy person with money or even happier, you get to do all the things you like to do. You don't have to worry about doing everything your boss asks you to do because you have something else you can rely on. So you gain literally personal autonomy by being financially secure. So taking this all the way back to trading, there's risk involved. If you take a shitty approach, a lazy approach, a laxed, a daisicle approach to trading,",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "you to do because you have something else you can rely on. So you gain literally personal autonomy by being financially secure. So taking this all the way back to trading, there's risk involved. If you take a shitty approach, a lazy approach, a laxed, a daisicle approach to trading, you will probably end up in this bucket. The group of people who start lose money and then stop. That's probably what's going to happen more likely than not. So paper trading is a really effective tool that you have that allows you to do a few things. Now, for context, I kind of bucket backtesting paper trading, forward testing or paper trading is kind of synonymous with live testing in this case into one general bucket of testing. Now, back testing is really efficient because we can take a really big, broad bucket of information and see kind of what works, what doesn't work. What I remind people is that if you have a back test that looks good, it's not super indicative of what it will look like in the future necessarily. But if you have a back test that looks bad, you can't make it look good, then it's probably not a good idea because the probability of that magically turning into a good idea is not super high. Forward testing is just the process of simulating things, money, cargo simulations, whatever to project things out forward using surrogate or a synthetic data set. And then paper",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "then it's probably not a good idea because the probability of that magically turning into a good idea is not super high. Forward testing is just the process of simulating things, money, cargo simulations, whatever to project things out forward using surrogate or a synthetic data set. And then paper trading is kind of synonymous in my world for live testing. There's a lot of value in live testing because if I pull open this chart and I type in something like SPX and I want to test something over the last five years, well, I can see what happens. I know what happens. I've seen it. So even down to a subconscious level, I have a lot of small cues in my brain that really detract from the true legitimacy of a test. Live testing is just that. It's putting on trades, paper trades, and we'll talk about some ways to make it really effective. And I don't know what's going to happen tomorrow. I don't know. I have no historical reference. I have nothing that convolutes my subconscious processing. So it's the purest expression of an idea because I don't know what's going to happen. There's nothing in my brain that tells me what's going to happen tomorrow. So paper trading in my opinion is kind of like the last step of this process. I start with back testing. Then I may or may not forward test that often is part of what I do. And then paper",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "my brain that tells me what's going to happen tomorrow. So paper trading in my opinion is kind of like the last step of this process. I start with back testing. Then I may or may not forward test that often is part of what I do. And then paper trading is when I get really specific and I want to test specific ideas. And I want to do it in a pure environment that I have no context about what's going to happen because paper trading is time consuming as compared to the others. So there's two broad ways that I think about paper trading. We have kind of like the beginner level of paper trading, which is I'm brand new to the markets. I don't know what I'm doing. And I'm trying to figure things out for me. If you're in that bucket brand new, I would look to paper trade for at least three months before committing real capital. And probably six months would be like an ideal target. I tell people a year would be great. But I'll be honest with you. I know myself included. I wouldn't paper trade for a full year. I would feel like I'm wasting too much time. Even though you're not. That's what I would feel. So I think three months is a minimum fair target for new traders to paper trade in this learning phase down here. We're really just trying to weed out mistakes. We're trying to weed",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "feel like I'm wasting too much time. Even though you're not. That's what I would feel. So I think three months is a minimum fair target for new traders to paper trade in this learning phase down here. We're really just trying to weed out mistakes. We're trying to weed out the instances where if I'm trading something like what you just saw up and KLA and it's somewhere back here. And I'm like, oh wow, the ball is so high. I want to trade strangles. I am not experienced enough to check to see why it's so high. And as earnings coming up. And I don't know that. And I don't know that I don't know that the only way I'm going to know that is by experiencing it. And paper trading is a great way to go through that experience without losing a bunch of money on a really dumb mistake like that. Paper trading is also really effective for developing a trade checklist. If I were to paper trade that would be to learn that would be my primary desired output from paper trading is a solid trading checklist in a solid trading plan and log and play. Those would be my three objectives at the end of my paper trading time. I want to have those three items. And for the outlier pro members, you can download examples for those in the Patreon shop. And then for those that aren't on there, I have videos that",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "play. Those would be my three objectives at the end of my paper trading time. I want to have those three items. And for the outlier pro members, you can download examples for those in the Patreon shop. And then for those that aren't on there, I have videos that walk through them that you can create your own as well. But that would be my target for paper trading to learn. And then we have paper trading to sharpen the sword. So right now I've been trading 17 years. And I literally I was just counting. I have over 2000 paper trades on right now. It's like 2100 and change. So why do I do that? Well, it's because of this next bucket of things that we're going to talk about. But the high level of it is it lets me test a lot of things in a pure environment. It don't know what's going to happen. So it lets me collect a really big data set of information that I can then use later. And I'll show you how to do that. So let's start here with how to make it worth your while. To find your goals is about as simple as it gets. But the objective behind this is as your paper trading, whether it's to learn or to sharpen, we want to have clear objectives in mind. So if it's to learn, those are my objectives. Those three things I told you. If it's to",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "is about as simple as it gets. But the objective behind this is as your paper trading, whether it's to learn or to sharpen, we want to have clear objectives in mind. So if it's to learn, those are my objectives. Those three things I told you. If it's to sharpen, then I need to define what I'm sharpening. Am I trying to make sure that I have really good control over my portfolio? Am I trying to make sure that the trades behave the way I think they're going to behave? I would define it. It's super helpful. So after that, track your work. So going back to the example I was telling you about creating a data set. Well, this is kind of just a really quick example data set. But you can create your own version of a trade log. So here we have some high level portfolio information. Here I always include just some general calculators and stuff that I like to use. So I have a template, pulled pieces from my version in Excel. So none of these links or none of these formulas in here work. They're, you know, all broken. So I just dropped it in Google sheets for you. But this is kind of the general format that I use is I have a summary tab called C2C in the military that stands for command and control. And this is where I have all the high level summation of information. Then I",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "dropped it in Google sheets for you. But this is kind of the general format that I use is I have a summary tab called C2C in the military that stands for command and control. And this is where I have all the high level summation of information. Then I have specific tabs for specific strategies. In this case, I'm looking at this isn't a real trade. It's just an example of a ratio called Agnol and Crouch. So in here, I have the template for this specific strategy that I built out over time for a ratio called Agnol. Right here. So in the process of paper trading either to learn or to sharpen, you'll kind of walk through what details matter and these kind of sheets for you and what don't. Then if you own the data, meaning I'm paper trading a bunch of different versions because I'm tracking well, then I can create other tabs that let me analyze the performance of a specific strategy. So in this case, what I would do in the RCD analysis tab is I would essentially pull all of the details from every individual ratio called diagonal trade that I have into this tab and then learn, see how it performs. Now there's ways to automate all of this stuff. All of this tracking can be automated. But I personally think the process of manually inputting this data and manually manipulating it is super important. So that's just my preference. Other",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "into this tab and then learn, see how it performs. Now there's ways to automate all of this stuff. All of this tracking can be automated. But I personally think the process of manually inputting this data and manually manipulating it is super important. So that's just my preference. Other people prefer to automate it. And that's cool too. If that works better for you. I'm just explaining what tends to work well for me, which is this. So if you track your work, if you're learning, you'll have a chance to start building out a data set. And if you're experienced, you can amplify an entire data set. So for example, with the zero DTE, I recently put out a video where I'm looking at different time frames for entries. Well, I back test it. But then on a daily basis, as I'm trading zero DTE SPX options, I'm also putting on paper traits in all these other variations to see what time frames work well, what delta's work well. Again, in a data set that I don't know how it's going to perform because then I can always go back. And then analyze it myself with my own data because one of the problem is if you don't track your own work. And let's say you come in here into thinkorswim, you go into on demand. So like now this puts us back in time. The cool part about this is that you can really efficiently test ideas.",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "data because one of the problem is if you don't track your own work. And let's say you come in here into thinkorswim, you go into on demand. So like now this puts us back in time. The cool part about this is that you can really efficiently test ideas. So if I wanted to go back in time, let's go back to July of 2023. And I can fast forward or in this case reverse time back to there, which is really cool. But one of the downsides, if I'm testing a ratio called a Agnol or other option strategies. And then I let's say I go to the monitor tab, which is where your positions are. And let's say I run out of money or I have old options that I need to get rid of. And I hit reset. It's all gone. As soon as I hit reset, it's all gone. All of that information is gone. And it's completely dependent upon your memory, which nobody's memory is that good to be able to get all of the relevant details from something like this purely off of memory. So by tracking your work, you give yourself a data set. This also gives you a chance to work out all of those bad behaviors. So those kind of things I showed you in the beginning of the video where it's like, well, I can't take it seriously. Well, that's user error. That's operator error that tells me that",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "data set. This also gives you a chance to work out all of those bad behaviors. So those kind of things I showed you in the beginning of the video where it's like, well, I can't take it seriously. Well, that's user error. That's operator error that tells me that there's a problem with the way you think about trading because I personally think about this as the way for me to practice creating wealth and freedom for myself. I can take that pretty seriously at this point in my life. And because I started taking this more seriously a few years into my trading admittedly in the beginning, I didn't like most other people. I really thought I was going to make a bunch of money super easy super fast. Just a lot of this thing works. So as I started taking it more seriously, I realized that I could quantitatively analyze what I'm doing. And I can set up different portfolios that allow me to mirror my portfolio. So I always split what I was doing. I would have the portfolio paper trade where I'm literally trying to trade the portfolio is exactly as I think I should. And then I have the data paper trades where I'm just collecting information. So if I'm selling a 30 delta put maybe I sell 25 delta 20 delta 15 delta 10 delta. So I'm just using that other part to collect data. But if you're efficient about it, you can",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "And then I have the data paper trades where I'm just collecting information. So if I'm selling a 30 delta put maybe I sell 25 delta 20 delta 15 delta 10 delta. So I'm just using that other part to collect data. But if you're efficient about it, you can collect a lot of information pretty effectively. So what this means is let's say for example, I'm practicing my directional strategies. I want to practice if I can pick something going up. Right. So if I'm directly correct and whatever stock XYZ goes up, I make money. Well, you make money if you sell a putter by a call, but the way you make money is slightly different. So I can test them both. I can say, okay, the profit mechanism I'm looking to test right now is a directional thesis. These are the indicators I'm using. You can learn and track how efficacious they are. I do. And then because it's not just how good the indicators are in a vacuum. If you back test them, you also need to test your ability to interpret them, which again, a back test will never capture. So live testing is a great way to test your ability to synthesize profit mechanisms to make money as a trader, whether it's directional hypothesis, volatility hypothesis, so on and so forth. So in this case, if it goes up, whether I did either of those options strategies doesn't change, but the quality of the",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "great way to test your ability to synthesize profit mechanisms to make money as a trader, whether it's directional hypothesis, volatility hypothesis, so on and so forth. So in this case, if it goes up, whether I did either of those options strategies doesn't change, but the quality of the movement and the way it moves in the path in the way that the trades behaves very different. So I can just put them both on at once. So this is the multitasking concept by paper trading multiple variations. You get to learn much faster. Then there's big to small component goes back to what I was talking about in terms of back testing, forward testing, if you're so inclined and then paper trading, live testing so that you can have a comprehensive approach that you're not wasting a bunch of time trying to paper trade everything. It takes time, even in something like on demand, where I can fast forward time and I can change it, I can pick this calendar and go where I want, I still have to click the buttons and that's still time consuming. So I want to do that after I've gotten some repetitions in seeing an ironing out the broad ideas, then seeing how it would perform, then applying my ability to synthesize information and how I come up with my ideas live. That's the idea here. So paper trading is really slept on, it's dismissed and I want to be really clear,",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "in seeing an ironing out the broad ideas, then seeing how it would perform, then applying my ability to synthesize information and how I come up with my ideas live. That's the idea here. So paper trading is really slept on, it's dismissed and I want to be really clear, it will never ever replace live money. It will never do that. It will never fully simulate it. And that's why I think it's important to paper trade, but then it's important to get those kinks out of the way for a new trader and then pivot to safely starting to trade with live money, making sure that you have all these other stupid details ironed out so that you can learn with real money. Just because it's not real money doesn't mean it's not worth your time. I just gave you two great ways to use it, whether you're brand new or you're experienced. It's up to you. It's a tool that's available. If you have questions on how to use the tool or best practices, let me know. I'm here to help however I can, but this is something that is absolutely changed the way that I trade for the better, even though it's not really sexy, it's not super cool. It is what it is. The cool stuff is what you get to do with the money after you make it. Be an outlier. See you guys later.",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  },
  {
    "text": "for the better, even though it's not really sexy, it's not super cool. It is what it is. The cool stuff is what you get to do with the money after you make it. Be an outlier. See you guys later.",
    "metadata": {
      "video_id": "kKj42RQqR7o",
      "title": "Using Paper Trading to Make More Money",
      "url": "https://www.youtube.com/watch?v=kKj42RQqR7o",
      "upload_date": "",
      "duration": 940.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kKj42RQqR7o&t=0"
    }
  }
]