[
  {
    "video_id": "KlHlEa4t-fU",
    "title": "Measuring Risk Adjusted Returns for Short Puts",
    "text": "What's up out lives? Today we're going to talk about calculating risk adjusted returns for short puts. Why does this matter? Well, it's pretty simple. When we look at the habits of a lot of traders, they make a unilateral decision, maybe when they're comparing two different products that they're potentially going to sell some short puts in. So I want to talk about that habit and then the fix, I'm going to show you a couple different formulas that you can easily use to make better decisions between what kind of thing are you going to sell your short puts in. So what's the habit? Really simple. Most people that are selling short puts are really just focusing on which one gives them the highest credit, the largest number that fits in their account. That's pretty common. The better way to think about this is to calculate a risk adjusted return for your premium. There's different ways to do risk adjusted returns. I'm going to show you one of them today to keep things simple and succinct. So let's talk about some basic return metrics. We have return, uninvested capital in this context. Sometimes you'll hear it referred to as yield, which I honestly don't like simply because I think they can get confusing within underlying and a dividend yield, but technically it seems same. So to calculate that you take the premium that you're getting and you divide that by the margin requirement. Notice I say margin requirement.",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 96.52,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=KlHlEa4t-fU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KlHlEa4t-fU&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 602.0
  },
  {
    "video_id": "KlHlEa4t-fU",
    "title": "Measuring Risk Adjusted Returns for Short Puts",
    "text": "as yield, which I honestly don't like simply because I think they can get confusing within underlying and a dividend yield, but technically it seems same. So to calculate that you take the premium that you're getting and you divide that by the margin requirement. Notice I say margin requirement. The next one return on risk is your premium divided by your value at risk and you technically can define that for yourself. For example, you can use something like a margin requirement. You can use a cash secured put requirement in the event that you're cash securing a put or you could use whatever you intend to manage that trade at. So a few different ways to look at that. Then there's just a quick formula to show you how to annualize the return. Now let's take a quick look at the risk adjusted return metric, the one that I want to show you, which is literally just, vologesting. So what we can do is take the implied volatility and we can integrate that into our return on invested capital, your return on risk, your value at risk, really whatever metric you want to use for that to then have a better comparison tool. And I'll show you why. First, let's just work through these formulas super fast so that you feel comfortable with them left hand side is just giving some metrics for this is using spy. So those are just basic metrics so that you can see",
    "start_timestamp_seconds": 76.92,
    "end_timestamp_seconds": 173.92,
    "start_timestamp": "01:16",
    "video_url": "https://www.youtube.com/watch?v=KlHlEa4t-fU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KlHlEa4t-fU&t=76",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 602.0
  },
  {
    "video_id": "KlHlEa4t-fU",
    "title": "Measuring Risk Adjusted Returns for Short Puts",
    "text": "have a better comparison tool. And I'll show you why. First, let's just work through these formulas super fast so that you feel comfortable with them left hand side is just giving some metrics for this is using spy. So those are just basic metrics so that you can see what's being fed into the formulas. So let's start with the return on invested capital. In this case, we're going to have a $856 premium. And we're going to divide that by, in this case, the margin requirement is 6859. This is for a portfolio margin account that equals a 12.5% return over that duration, which is pretty solid. If you annualize that return, it literally takes you to 104.7%. Now, before anybody starts like jumping and thinking, oh man, I cracked the code here. It is the reality of these kinds of trades is the margin requirement here. Obviously, it's really favorable because of the portfolio margin. But you're not going to win all of these. Just make that super clear in case you see that number and you get stoked. It's good, but it's not what most people think that might turn into. Now let's take a look at another version of this, which is calculating the cash secured return on a VESA capital. So instead of using 6859, we're going to use in the denominator what we need to cash secured the position, which in this case is $64,900. That gives us a 1.3% return over the",
    "start_timestamp_seconds": 156.28,
    "end_timestamp_seconds": 248.48,
    "start_timestamp": "02:36",
    "video_url": "https://www.youtube.com/watch?v=KlHlEa4t-fU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KlHlEa4t-fU&t=156",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 602.0
  },
  {
    "video_id": "KlHlEa4t-fU",
    "title": "Measuring Risk Adjusted Returns for Short Puts",
    "text": "at another version of this, which is calculating the cash secured return on a VESA capital. So instead of using 6859, we're going to use in the denominator what we need to cash secured the position, which in this case is $64,900. That gives us a 1.3% return over the duration, which is 5.6% return annualized, which is very standard for something like this. This is using a 30 delta put that 60 days out. So these are just the base formulas again to get you comfortable with what they look like. The implied volatility adjusted version of this metric, we're taking the return on a VESA capital, so that 1.3% in this case, I didn't use return on a VESA capital. I'm using the cash secured put requirement. That's why in this instance, I'm using 1.3 instead of the 12.5. The main reason is I just want to blow out the metrics that can fuse people. So this is the VESA capital in this case is cash secured. So I take that 1.3% return and I divide that by the volatility. In this case, I'm using the volatility for the option itself. You can do that. You can use the term as well. You could use the underlying, but I honestly don't think that makes sense when you have access to the option volatility and term volatility, which is slightly more accurate. So we take the option, vol, times the duration divided by 252, which is the number of",
    "start_timestamp_seconds": 231.4,
    "end_timestamp_seconds": 319.04,
    "start_timestamp": "03:51",
    "video_url": "https://www.youtube.com/watch?v=KlHlEa4t-fU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KlHlEa4t-fU&t=231",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 602.0
  },
  {
    "video_id": "KlHlEa4t-fU",
    "title": "Measuring Risk Adjusted Returns for Short Puts",
    "text": "the term as well. You could use the underlying, but I honestly don't think that makes sense when you have access to the option volatility and term volatility, which is slightly more accurate. So we take the option, vol, times the duration divided by 252, which is the number of trading days. Sometimes people like to use 365 here. It's fine. Do whatever you want, but just make sure it's normalized across whatever else you're doing. So that gives us our 1.3% divided by 7.9%. Then we get this number 0.17. What is this number? This number literally just means those are the units of return that you're getting per unit of volatility, of implied volatility in the option. So this number itself doesn't really mean anything. It's not like some of these are good, some of them are bad. This is more used as a comparison metric. So let's make a simple calculator so that we can make this comparison in order to build something like this in Google Sheets as you can see is a series of inputs. It's not difficult. I literally just took what was on the last side, slide and through it into this. Now we have two columns. You're not limited to two. You can compare as many of these as you would like. But all I'm doing is to noting what are the required input cells. That's why they're shaded green. I know when I see that I have to input something in",
    "start_timestamp_seconds": 306.0,
    "end_timestamp_seconds": 394.64,
    "start_timestamp": "05:06",
    "video_url": "https://www.youtube.com/watch?v=KlHlEa4t-fU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KlHlEa4t-fU&t=306",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 602.0
  },
  {
    "video_id": "KlHlEa4t-fU",
    "title": "Measuring Risk Adjusted Returns for Short Puts",
    "text": "we have two columns. You're not limited to two. You can compare as many of these as you would like. But all I'm doing is to noting what are the required input cells. That's why they're shaded green. I know when I see that I have to input something in those. And then the formula is down at the bottom. You're not going to see they're not in green because those are calculated based on these. So in this scenario, I'm comparing spy against cues. And I'm saying to myself, they're about the same price. So which one of these is giving me a better vol adjusted return? And it's really easy to figure out in this case. It's about flat. They're literally about the same. So even though you see QQQ with a higher volatility of 20.78, you see it with a lower strike. And you see it with a higher premium when we normalize these against one another, including the volatility component. They're literally about the same. You have to go up to a third decimal to see a difference, which by the way, a lot of times I will take these out to a third decimal if I need to. So in this case, adding that third decimal, you can see that QQQQQ is actually providing a slightly better implied volatility return on invested capital. Now, let's take a look at another comparison. If I show you Upro and SSO, Upro is a three times levered S&P",
    "start_timestamp_seconds": 380.72,
    "end_timestamp_seconds": 477.36,
    "start_timestamp": "06:20",
    "video_url": "https://www.youtube.com/watch?v=KlHlEa4t-fU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KlHlEa4t-fU&t=380",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 602.0
  },
  {
    "video_id": "KlHlEa4t-fU",
    "title": "Measuring Risk Adjusted Returns for Short Puts",
    "text": "I need to. So in this case, adding that third decimal, you can see that QQQQQ is actually providing a slightly better implied volatility return on invested capital. Now, let's take a look at another comparison. If I show you Upro and SSO, Upro is a three times levered S&P index ETF, SSO is two times. So a lot of people would immediately assume, oh, the three times levered is going to be more volatile, good assumption. And then for that volatility, you typically are going to see them make a little bit more money. So also good assumption, especially if they're about the same price, which they are right now. When we take a look at the return on invested, the return on volatility adjusted return on invested capital, you can see literally Upro is skewing slightly in terms of what you're getting in between the wallet you're putting up in the premium that you're getting. So another way to visualize this is we can calculate the percent difference between Upro and SSO, both in terms of the IV and premium. So in this case, the IV and Upro is 26.7% higher than that of SSO. Yet the premium is 30.77% higher. So we can see that there's a little extra risk premium price densities. So then if a trader was making a decision between these two based on the Valle adjusted returns, they might lean towards Upro and maybe putting on a slightly smaller position, but capturing that",
    "start_timestamp_seconds": 454.32,
    "end_timestamp_seconds": 554.64,
    "start_timestamp": "07:34",
    "video_url": "https://www.youtube.com/watch?v=KlHlEa4t-fU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KlHlEa4t-fU&t=454",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 602.0
  },
  {
    "video_id": "KlHlEa4t-fU",
    "title": "Measuring Risk Adjusted Returns for Short Puts",
    "text": "is 30.77% higher. So we can see that there's a little extra risk premium price densities. So then if a trader was making a decision between these two based on the Valle adjusted returns, they might lean towards Upro and maybe putting on a slightly smaller position, but capturing that heightened Valle premium. So really, really simple tool to add to your tool kit so that you're not just making random decisions based on nominal premiums, you can include slightly better metrics like this. And you can get even more detailed than this. So one of the projects that I have for the Pro members is to show not just how to build this, which is easy. You can make this on your own. You can literally take a screenshot throw it into GPT and it'll do it for you. But to show how there are some other really cool follow on metrics that can add a lot of clarity versus just using premium. But this is a great starting point for everybody being out on our CL letter.",
    "start_timestamp_seconds": 527.52,
    "end_timestamp_seconds": 598.16,
    "start_timestamp": "08:47",
    "video_url": "https://www.youtube.com/watch?v=KlHlEa4t-fU",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=KlHlEa4t-fU&t=527",
    "chunk_index": 7,
    "word_count": 179,
    "upload_date": null,
    "duration": 602.0
  }
]