[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you a vertical nehme meanings시' overs specifically . fire , dislocated . system . We will let's term now, let's say if the every day I want to make a certain amount of money. It could be every week, it could be every month, it could be every quarter, it could be every six months. It could be over the course of two to three years. And the reason why I'm harping on this is because depending on what we craft here, what you will find is as you're defining your goals as a trader, there are trade-offs that you have to work through for all of them. So monthly returns, okay? So what are the monthly returns that we want? So we want monthly, positive returns. I'm trying to look at yearly, but then breaking it down to month. Yeah, you'll see why this honestly is a terrible idea, but it's a great starting point for the conversation. So I want you to just follow, follow the stop process. So you're talking about monthly returns, which is annual broken down into monthly timeframes, what you're highlighting there is good. What is income generation mean? What does that mean? Does that mean that we're withdrawing money from it's every month, every two weeks, every other month?",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 58,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=0"
    }
  },
  {
    "text": "follow the stop process. So you're talking about monthly returns, which is annual broken down into monthly timeframes, what you're highlighting there is good. What is income generation mean? What does that mean? Does that mean that we're withdrawing money from it's every month, every two weeks, every other month? What's the income generation part of this mean to us? And when we say two to four percent returns, what does that mean? Is that two to four percent returns on the monthly basis is what I'm gathering based on context, but I want to know again, like what the vibe is here. And based on what you tell me, we will be able to shape this. Trading says monthly positive, okay. So yeah, and I think that that's good for like consistent is breaking it down to that time frame monthly, one to two percent. Okay, got it. That's great, because if you said two to four percent on a monthly time frame, I was going to tell you that it's not impossible, but it's insanely improbable for those that don't know when you're looking at returns like this, especially if you're compounding it in any way, something like picking the midpoint a three percent return is like 42, 44, 40 something. What the hell is this number? 42.6, 42.6 annualized. You have to ask yourself, how realistic does that feel? So that's why using two to four percent, and I throw this, these two absolutely would not go",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 58,
      "start_timestamp": "00:01:38",
      "start_timestamp_seconds": 98.37241379310345,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=98"
    }
  },
  {
    "text": "picking the midpoint a three percent return is like 42, 44, 40 something. What the hell is this number? 42.6, 42.6 annualized. You have to ask yourself, how realistic does that feel? So that's why using two to four percent, and I throw this, these two absolutely would not go together at all. And it's because in order to get higher returns like this, you inevitably are going to have to accept higher portfolio volatility. So if instead we zoom this down and we pick something that like we're talking about now, with that new range of something like one to two percent, if we pick something that's the midpoint of that again on a monthly time frame, 1.5 that brings you to a 19.6 return, which is still like people might hear them be like, oh, that's it, like that's still a really fucking good return, especially if we're doing it consistently, that's difficult. So this is 1 per month, 19.6 annualized. I think this is overall generally reasonable if you're a more seasoned trader. If you're a beginner trader, this will probably ruin your account. But again, good conversation point. So we've now defined monthly positive returns, and we're looking for 1 per month. Now the next question is of this 1 per month, how much of it are we trying to withdraw? And the reason why the withdrawal matters is because if we think we are likely to hit again, 1 just with whatever risk we put",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 58,
      "start_timestamp": "00:03:16",
      "start_timestamp_seconds": 196.7448275862069,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=196"
    }
  },
  {
    "text": "we're looking for 1 per month. Now the next question is of this 1 per month, how much of it are we trying to withdraw? And the reason why the withdrawal matters is because if we think we are likely to hit again, 1 just with whatever risk we put out, it's very unlikely. What I mean is you're going to have to cycle on some of these traits because some of them will lose. That's just the numbers of this game. So the next question is how much of this are we trying to withdraw on a monthly basis? And then what is deep drawdowns? What percent max drawdown for the account equals deep drawdowns to you? So we need two inputs. We need income per month. And we need max drawdown metrics. What do you guys think? Miller. Miller time says, if you don't mind me asking, I don't mind you asking at all, it's the whole point of this. What is your monthly goal? My monthly goal has changed a lot. It used to be 15 per year. And then I would want to work on a cadence on average that would get me there. But that's actually changed quite a lot to be honest with you. And the reason for that is because as the portfolio grows, the percent return actually matters less and less and less. And ultimately what matters more is like the actual gross dollar amounts. So for me, it used to be",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 58,
      "start_timestamp": "00:04:55",
      "start_timestamp_seconds": 295.11724137931037,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=295"
    }
  },
  {
    "text": "actually changed quite a lot to be honest with you. And the reason for that is because as the portfolio grows, the percent return actually matters less and less and less. And ultimately what matters more is like the actual gross dollar amounts. So for me, it used to be 15 per year. That was how I thought about growing at the rate that I needed to. That comes out to be like one and a quarter a month again, not compounded. And then that's just from like base level trading activities. 15 per year was the planning factor. And I talked about creating those kind of goals a few times. But effectively what I would do is I would take a look at compound growth over different time frames 20 years, 15 years, 30 years at a certain rate with a certain savings rate on average. And then I was projecting how long that would take me to hit a million bucks. That was my original planning target. And that's why it was 15. Shahazad says, I'm trying to figure out the drawdown part, not sure how to come up with that. I don't want one month's losses to wipe out a few months gains. For example, in this past two weeks, I sold in the money calls. The reason it gives me decent protection if this stock goes down while capturing extrinsic as well. In the money cover calls really are not a good strategy. They're not bad,",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 58,
      "start_timestamp": "00:06:33",
      "start_timestamp_seconds": 393.4896551724138,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=393"
    }
  },
  {
    "text": "wipe out a few months gains. For example, in this past two weeks, I sold in the money calls. The reason it gives me decent protection if this stock goes down while capturing extrinsic as well. In the money cover calls really are not a good strategy. They're not bad, but it's like a short put almost always is going to be more effective. And that's because of puts you you're taking on overall very similar risk profile. But that part aside, that's completely okay. We can leave these open ended. The here are the the series of tradeoffs that I want to talk about and then we'll move on from the goal setting section. Now again, the reason why we spend so much time on goals, this is going to be probably a 90 minute session because it's just a lot we have to get through. But the goals is super important because again, everything we do now is going to be in service of the goals. So we're looking for 19.6 annualized again. We're saying that we're seasoned traders at this point three plus years at least preferably five plus meaning some decent experience. Now the income per month, I actually think that this is not even a factor. Don't even think about this. And it's because this is one of the worst possible ways you could structure yourself as a trader for this to actually work. Here's what I mean. The way that I think about it",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 58,
      "start_timestamp": "00:08:11",
      "start_timestamp_seconds": 491.8620689655173,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=491"
    }
  },
  {
    "text": "month, I actually think that this is not even a factor. Don't even think about this. And it's because this is one of the worst possible ways you could structure yourself as a trader for this to actually work. Here's what I mean. The way that I think about it is if I need 100 per month, the last possible thing I want is in order to get this 100 that I need for this month is for me to have to make it this month. It makes no sense. There's no contingency plan there. There's no room for error, literally zero room for error. So the way that I personally think about the income generation element of a portfolio is very different than what most people would likely would think. And here's how I think about it. Let's say I need this 100 per month. What I'm going to do is I'm going to estimate conservatively so padded cost per month per year. And I'm going to figure out what this number is. How much money do I think I need per month per year based on what I'm trying to get out of this portfolio? Then what I do is I wait until the portfolio is at least two years deep. What I mean by this is that I could consistently pull what I need on a monthly basis adding nothing back from trading activities for an entire two-year time frame. It might sound like a lot, but",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 58,
      "start_timestamp": "00:09:50",
      "start_timestamp_seconds": 590.2344827586207,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=590"
    }
  },
  {
    "text": "do is I wait until the portfolio is at least two years deep. What I mean by this is that I could consistently pull what I need on a monthly basis adding nothing back from trading activities for an entire two-year time frame. It might sound like a lot, but markets change. And again, if you want this to actually work, you have to think robustness. You need robustness. It's so much easier to say like yeah, just buy 100 shares of stock and then sell calls against it and then use that short premium as your income. It is complete bullshit. It's not going to work. So I'm really conservative in this sense. And this isn't even as conservative as I personally was before I made this choice. But I think this is an absolute minimum. So then what this means is my annual trading performance is essentially filling up the bucket that's at the end of this timeline. So if this is a two-year timeline, zero, one, two, and I'm withdrawing money out this month, the money that I'm making is essentially filling the back end of this bucket. That's how I think about it. So with that all being said, and now that we know, at least in the way that I set this up, is having a monthly like income target is dumb from a trading activity perspective of I'm going to make this much per month in order to withdraw this much per month. That",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 58,
      "start_timestamp": "00:11:28",
      "start_timestamp_seconds": 688.6068965517242,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=688"
    }
  },
  {
    "text": "all being said, and now that we know, at least in the way that I set this up, is having a monthly like income target is dumb from a trading activity perspective of I'm going to make this much per month in order to withdraw this much per month. That is overwhelmingly likely going to fail. So I think of it as over the course of a year, I need to hit this in order to plus up my bucket. That's two years out in time in order to stay on the correct trajectory, whether that's to be flat, but to draw enough income or whether that's to slightly grow my money while withdrawing on it, whatever your goal is, you literally just do the math and figure it out. So that's our goal. Max drawdown, the way to think about Max drawdown is the higher your return potential is. So think of it this way, if we have a little scale like this and then we have return and we have risk, here's what happens. If we want to increase our return, this turns into a hydraulic scale. We're both of them are going to go up not necessarily linearly, but there will still be a positive correlation between them in terms of the overall direction because here's what happens. In order to move, let's say from this 10 return to this 20 return, you functionally are going to not even not even accounting for the directional risk of",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 58,
      "start_timestamp": "00:13:06",
      "start_timestamp_seconds": 786.9793103448276,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=786"
    }
  },
  {
    "text": "linearly, but there will still be a positive correlation between them in terms of the overall direction because here's what happens. In order to move, let's say from this 10 return to this 20 return, you functionally are going to not even not even accounting for the directional risk of your portfolio, the volatility risk of the portfolio, not even accounting for those elements. You literally are going to simply have to start using more money, just more money. And then we can deduce if we have to use more money in order to hit this higher return, the potential for us to experience a move that hurts the portfolio is higher. It's not again purely linear, but there is a correlation. So what this says is, depending on how you trade, and depending on what your target is, you're going to have to define a max drawdown that makes sense. And if you have no idea what makes sense, this is exactly why you need to pay for trade because otherwise you will have no idea what works. And we're actually not even going to answer this just yet. We're going to answer it in a few minutes as we start building some of the rest of this stuff. So let's just start with a guess. So what's our best guess on max drawdown that we think would be allowable to hit a 20 return? What's a guess? And then I'm going to tell you a way that you",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 58,
      "start_timestamp": "00:14:45",
      "start_timestamp_seconds": 885.3517241379311,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=885"
    }
  },
  {
    "text": "we start building some of the rest of this stuff. So let's just start with a guess. So what's our best guess on max drawdown that we think would be allowable to hit a 20 return? What's a guess? And then I'm going to tell you a way that you can come up with a reasonable guess on your own, but I want to see what you think of first. And this is really for anybody. What do you guys think? Any time that you're looking at something in the trading world and you have absolutely no idea where to go, I would always start with, is there a reference I can use? So let me hide this so it's not blocking things. We know what the SP 500 returns. We know what the average return is. So if I'm looking at this 10 year monthly time frame, and I look at this over 12 month periods, I can see where the biggest drawdown was. I can see one of them is right here. What is this? A 36.2 drawdown. This was during the COVID bear market. Okay. I see another big drawdown here. What's this drawdown? 28.5 drawdown. I see another drawdown that's here. What's this one? 12.2. I see another drawdown here. What's this one? 21.8. So what am I doing? I'm getting a sense even if I were to hold just market beta. What these drawdowns might look like, because again, we're working under the scenario that",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 58,
      "start_timestamp": "00:16:23",
      "start_timestamp_seconds": 983.7241379310346,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=983"
    }
  },
  {
    "text": "see another drawdown that's here. What's this one? 12.2. I see another drawdown here. What's this one? 21.8. So what am I doing? I'm getting a sense even if I were to hold just market beta. What these drawdowns might look like, because again, we're working under the scenario that we have no idea. We're just guessing. But this is exactly how you come up with an educated guess is you can look at these different periods. You know, 0809 was a rough time frame. That's a 60 drawdown. So maybe we don't want to go down 60. We know that that's a recent pretty extreme level that we can factor off of. We know the most recent factor is 36.2. We also know that typically the worst drawdown is more likely ahead of us than not. So this looks like if you were to use the SP 500 for your benchmark here. And let's look. This is a 20, let's not use the 20-year time frame. Let's do a 10-year time frame because this will be more advantageous. So what is the average annual return for the SP 500 for the past 10 years? Let's see. As can chat you, PT, it won't be fully accurate because it'll use slightly skewed data, but it'll be close enough. I normally would tell people 8 to 15 depending on what window you use. So this says average annual return for the SP 500 from D's 2014 to D's 2020, 4 is",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 58,
      "start_timestamp": "00:18:02",
      "start_timestamp_seconds": 1082.096551724138,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=1082"
    }
  },
  {
    "text": "you, PT, it won't be fully accurate because it'll use slightly skewed data, but it'll be close enough. I normally would tell people 8 to 15 depending on what window you use. So this says average annual return for the SP 500 from D's 2014 to D's 2020, 4 is 11.3. Proximate 8 adjusted by inflation. So that's literally perfect, right? That gives us 11.3. We'll leave inflation out of it for now. 11.3. So based on our rudimentary research over this 10-year time frame, we saw that for the SP 500, the average return 11.3 and we saw that the biggest drawdown here was 36.2. So what does that tell us? We're literally looking to about 80 positively outperform. So the average returns, we're looking to add about 80 onto that. So then what do we think our max drawdown is going to be better or worse than this? It's probably going to be worse, like that's the reality of it. Now are there things we can do to control it? Sure. But this is a planning factor. So maybe it's not going to have to be 80 worse, but maybe we say max drawdown tolerance would be something like 40. And if that's too high and you say like, well, damn, I don't want a 40 drawdown, guess what? Lower your fucking annual target. These are your choices. Now what you'll find is as you become more refined as a trader, you can definitely achieve pretty solid annual",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 58,
      "start_timestamp": "00:19:40",
      "start_timestamp_seconds": 1180.4689655172415,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=1180"
    }
  },
  {
    "text": "like 40. And if that's too high and you say like, well, damn, I don't want a 40 drawdown, guess what? Lower your fucking annual target. These are your choices. Now what you'll find is as you become more refined as a trader, you can definitely achieve pretty solid annual returns with lower risk. That's been the case for me this year, last year, the year before, so far some of my best years trading have fallen into that exact thing. So what I'm trying to do is help you shape reasonable goals for that interim period. You're not a brand new person. You've been trading for a couple of years. So your past the greater than zero first two years. Now you're in like the three to five year window, three to six year window, trying to get the consistent performance of your account to align with what you want. And you don't have everything fully fleshed out yet, right? That's why we're in a foundation's live stream right now. So this I actually think is probably a reasonable planning factor to start with something close to this. Okay. So if we get rid of all this, we now have our goals 20 annual return 40 max drawdown. That's what all of that work amounts to. So now we can get rid of this. We have our goal. First thing's done, goal. 20 40 MDD. And by the way, 40 is really large. If you hit a 40 max",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 58,
      "start_timestamp": "00:21:18",
      "start_timestamp_seconds": 1278.841379310345,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=1278"
    }
  },
  {
    "text": "have our goals 20 annual return 40 max drawdown. That's what all of that work amounts to. So now we can get rid of this. We have our goal. First thing's done, goal. 20 40 MDD. And by the way, 40 is really large. If you hit a 40 max drawdown, it really does mean that you're probably fucking up pretty bad. This like I've never I've never personally hit that even when I had my worst drawdown on the portfolio is still sub 40. So just giving you context. Now we've already defined our risk, right? Based on the goals, we took care of both of these upfront. So we have our return target. We have our initial risk parameter. Next thing we need to do. This is step one and two. Next thing we need to do. Three is we need to build a toolbox of profit mechanisms. So help me. The way that I would personally attack this is I would start with some general concepts. The first one is markets drift up. Why does this matter? Because it's going to change what kind of strategies are more relevant to me. The next thing is we know tech is higher beta. But higher return. This is relevant because when I first started trading, it was still during the period where small caps growth stocks tended to outperform large cap stocks. This is a relatively new phenomenon over the last decade or so where you start to see",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 58,
      "start_timestamp": "00:22:57",
      "start_timestamp_seconds": 1377.2137931034483,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=1377"
    }
  },
  {
    "text": "tech is higher beta. But higher return. This is relevant because when I first started trading, it was still during the period where small caps growth stocks tended to outperform large cap stocks. This is a relatively new phenomenon over the last decade or so where you start to see the massive outperformance of large cap stocks over everything very concentrated in tech. But that's a important theme to be aware of. So with these in mind, and we know that we're trying to be consistent, right? We just said that we want to hit at least 20 per year. So what does that immediately tell us? It immediately tells us that we can not just build a portfolio based on market beta because the market goes down. So if the market is down and your portfolio is down, you're not hitting that consistent return target. Now, one of the things that I would remind newer traders is one of the simplest ways to outperform the SP 500 is not inherently to hit 20 every single year. But you can set a bifurcated target that something like hit 20 if the SP 500 is up and then be greater than zero if the SP 500 is down. This will still lead to really, really strong performance. So just giving you another way to think about that. Okay. So we know this effect that markets tend to go up. That tells me that when I'm building my profit mechanisms and I'm",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 58,
      "start_timestamp": "00:24:35",
      "start_timestamp_seconds": 1475.5862068965519,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=1475"
    }
  },
  {
    "text": "zero if the SP 500 is down. This will still lead to really, really strong performance. So just giving you another way to think about that. Okay. So we know this effect that markets tend to go up. That tells me that when I'm building my profit mechanisms and I'm thinking of different kinds of profit mechanisms, price direction up needs to get a little more attention. So maybe I think I need to build one to two strategies here to start. Then I need something for price direction down. Maybe one strategy here to start. And then maybe for volatility, we trade things like risk premiums. We could use one to two strategies for this. And then maybe for that's probably enough to start. Like I wouldn't start playing with like relative vol and pairs trading and stuff like that. Keeping this palatable for like a starter level. I think that this is a pretty diverse toolkit. This allows you to effectively trade every market condition. So we have a few profit mechanisms to start tinkering with. So now we know that we're going to trade price direction up in one to two ways price direction down and risk premium. So we now need to research different profit mechanisms. And again, we've already have them generally outlined. So let's start with price direction up in our two different profit mechanisms that we think we're going to trade. So this could be something like breakouts. And drift. Slash momentum. For",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 58,
      "start_timestamp": "00:26:13",
      "start_timestamp_seconds": 1573.9586206896552,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=1573"
    }
  },
  {
    "text": "premium. So we now need to research different profit mechanisms. And again, we've already have them generally outlined. So let's start with price direction up in our two different profit mechanisms that we think we're going to trade. So this could be something like breakouts. And drift. Slash momentum. For price direction down. This could be something like momentum. For risk premium. We could play something like skew. We could play something like vol contraction from earnings release. I think this one's probably better for a starter. So skew might be something we add on later. So Shahzad says vol crush, that's exactly right. So vol around the expected around earnings expectations is solid. Recess P drift, which is solid for price direction. So here we now have our homework. Our homework is to research these different profit mechanisms to figure out how these work. Trading or options says sideways. It's a good point. So sideways is covered through risk premium. So through the volatility trading. And if there is no volatility training, there's still going to be breakouts and breakdowns. The market is never flat. It's never flat. So there's always a few things you can tinker with. I'm going to the door for Thoroughquick. All right. So we have our first steps complete. We know what our profit mechanisms are now. We know what our goals are. We know what our risk tolerance is. Hello, what is skew? What is vol er? Thank you. Ernest. Of course, Ernest.",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 58,
      "start_timestamp": "00:27:52",
      "start_timestamp_seconds": 1672.3310344827587,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=1672"
    }
  },
  {
    "text": "going to the door for Thoroughquick. All right. So we have our first steps complete. We know what our profit mechanisms are now. We know what our goals are. We know what our risk tolerance is. Hello, what is skew? What is vol er? Thank you. Ernest. Of course, Ernest. Great questions. So volatility er simply means the behavior of volatility around earnings releases. So you can play the expansion into the release and then the contraction post release. Skew is the imbalance in volatility relative to calls and puts. And I'll show you so that it's more visual. Well, let me give it a listen so it's not confusing. So if we go into SP or whatever ticker you want, it doesn't matter. And if we take a look at the options chain and I'll show it to you in another way in a second, but I think that this will make it a little easier. We look at the first 30 delta put. The first 30 delta put that we see is priced at 21.68 vol. Let's go to the first 30 delta call. We literally have to go further. That's actually kind of funny. The first 30 delta call is priced at 16.07 vol. What do you notice? It's the same delta. It's the same expiration call. vol 16.07 same delta on the put side put vol 21.68. A big big difference in the amount of vol priced into each of these options. That's what SKU pertains",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 58,
      "start_timestamp": "00:29:30",
      "start_timestamp_seconds": 1770.7034482758622,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=1770"
    }
  },
  {
    "text": "delta call is priced at 16.07 vol. What do you notice? It's the same delta. It's the same expiration call. vol 16.07 same delta on the put side put vol 21.68. A big big difference in the amount of vol priced into each of these options. That's what SKU pertains to and SKU exists because the market tends to be here. It's not really fear, but they'll overpay to hedge to the downside because they don't want to deal with it. And I'll show you one other way to look at it just for a good exercise. If we look at that same expiration, what was that? The 20 June's. Let's grab the 20 June's here. Notice the different levels of vol relative to spot price. So spot price is 56.59. 56.59. So it's like in here somewhere. Notice the put side relative to the call side. Even if we move equidistant out equidistant out equidistant out as far as strikes or delta same same in this context, you'll notice that the puts are way more expensive than the calls. That is SKU shown to you in two different ways in the options chain and then also in the volatility surface. So that's what SKU is. Okidok. Back now to our plan. So we have our strategies here and let's pretend so that we don't spend too much time, but let's pretend that we already built our trading plan. We already built our trading log because we spent some time",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 58,
      "start_timestamp": "00:31:09",
      "start_timestamp_seconds": 1869.0758620689655,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=1869"
    }
  },
  {
    "text": "surface. So that's what SKU is. Okidok. Back now to our plan. So we have our strategies here and let's pretend so that we don't spend too much time, but let's pretend that we already built our trading plan. We already built our trading log because we spent some time researching these effects. Now to make sure that we at least have an idea of how to research these effects, all we need to think about first is what can we find with respect to existing research? And again, let's literally click through it together so that you can see this process live. So I would use Chatchy PT now to be completely honest because Chatchy PT is incredible. But let's just pretend that Chatchy PT wasn't as much of a thing. And let's take a look at stock markets momentum. I'm on SSRN, social science research network. And I'm looking and I'm first focusing on just understanding these different profit mechanisms. And I'm reading what research exists. You can learn a lot by literally just understanding what other research has already been done on the topic. You don't need to reinvent the wheel here. So I literally would skip through a bunch of these. So for example, I personally would still read these ones about other stock markets, but I wouldn't waste a lot of time on them. I would simply try to understand what the overall approach being applied is to understand how other smart people think about",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 58,
      "start_timestamp": "00:32:47",
      "start_timestamp_seconds": 1967.4482758620693,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=1967"
    }
  },
  {
    "text": "through a bunch of these. So for example, I personally would still read these ones about other stock markets, but I wouldn't waste a lot of time on them. I would simply try to understand what the overall approach being applied is to understand how other smart people think about the concept of momentum. But I wouldn't worry about the specific details, the outputs and stuff like that because the fact of the matter is the Vietnamese stock market is so fucking different than the US stock market. And a lot of that stems from liquidity, which is a big part of momentum. So that all aside, you can still learn from these. So this is what I would do for these different profit mechanisms. And if you're not even sure on what to start with based on these profit mechanisms, I literally have a few videos that talk about profit mechanisms. So I'll throw a link. I will throw a link to that in the notes. One sec. Here. So this video goes through a series of different profit mechanisms in case you have no idea where to start. Okay. Now back to our example, we just fast forwarded time. We spent a few dozen hours researching these profit mechanisms. We started building our trading plan and our trading log around them. And we know the kind of things that generally matter to them, at least as far as we guess. So now it's when we actually start placing",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 58,
      "start_timestamp": "00:34:25",
      "start_timestamp_seconds": 2065.8206896551724,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=2065"
    }
  },
  {
    "text": "time. We spent a few dozen hours researching these profit mechanisms. We started building our trading plan and our trading log around them. And we know the kind of things that generally matter to them, at least as far as we guess. So now it's when we actually start placing trades. And it's typically, in my opinion, best to start with paper trading. So literally, let's do this exact thing. So what I think would make a lot of sense is if we use on demand and we go back in time. And we can go to a random point in time if you want, or we can do like the recent markets or something, whatever you prefer. Let me know. But what we can do now is literally try and build an actual portfolio in the actual market, add an actual point in time and see what happens. This is the meat and potatoes of this session today. So do you guys want to go back to a random point in time that none of us know? Or do you want to go back and look at maybe a period that we do know, but to stress test the way that we would set up? What do you guys think? Entirely, you're pick. Looks like no preference. Shahzad says random time. Let's do that. I think it's fine. It literally doesn't matter that much. So let's go to 2021. Kind of a boring year overall. What did the market",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 58,
      "start_timestamp": "00:36:04",
      "start_timestamp_seconds": 2164.193103448276,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=2164"
    }
  },
  {
    "text": "way that we would set up? What do you guys think? Entirely, you're pick. Looks like no preference. Shahzad says random time. Let's do that. I think it's fine. It literally doesn't matter that much. So let's go to 2021. Kind of a boring year overall. What did the market do that? Oh, no, that was actually... Let's go to 18. This is better. I want to pick something that's actually completely different. All right. So the first part of this process, always when we're starting to build a portfolio, works off of this. And this is, again, available in another video about portfolio management. So I'm not going to spend a bunch of time on it. I am going to give you a link so that you can check it out at your leisure. It will go further in detail. But this process will always start with this coming up with the disposition about what's going on. Now we won't know that. I honestly don't remember this for 2018. I don't remember what like the big things were. So we're just going to go without that part. The reason why that part does matter, though, is because it helps us understand what ideas we might want to run. And a great example of this is what I gave you earlier about the performance of small caps relative to large caps and specifically large cap tech. That sort of thing. So in order to simulate that, I'm literally just going",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 58,
      "start_timestamp": "00:37:42",
      "start_timestamp_seconds": 2262.5655172413794,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=2262"
    }
  },
  {
    "text": "us understand what ideas we might want to run. And a great example of this is what I gave you earlier about the performance of small caps relative to large caps and specifically large cap tech. That sort of thing. So in order to simulate that, I'm literally just going to look at the broad market really quick and see how everything is doing across the board so that we can come up with some general themes. So the first thing that I'm noticing is everything is essentially at local highs. I see VIX is obscenely low. In the 10 handle, the recent pop that it had was to like 14. So we're talking about a super low super low volatility period here for sure. We see yields down slightly in bonds have been climbing up on the long end of the curve. I see materials is hitting highs energy at highs. Financial has been rotating sideways a little bit longer than everything else. Notice how this big gap up and still pressing highs. This has been about linear movement up to highs. But if you take a look at XLF, big difference XLF is literally rotating sideways. Why does all this stuff matter? It's because this is ultimately how we're going to build a portfolio is by employing these very ideas. Then we have industrials essentially rolling up to highs. Tech is rolling down and it's under performing slightly. Then we see staples sideways real estate is doing poorly.",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 58,
      "start_timestamp": "00:39:20",
      "start_timestamp_seconds": 2360.937931034483,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=2360"
    }
  },
  {
    "text": "all this stuff matter? It's because this is ultimately how we're going to build a portfolio is by employing these very ideas. Then we have industrials essentially rolling up to highs. Tech is rolling down and it's under performing slightly. Then we see staples sideways real estate is doing poorly. So again, if we're looking for some short ideas, we have two places to look now. We have inside financials looking for weakness there. And then we have inside of real estate looking for weakness there. We can also see utilities is getting smashed. Another place to look for weakness. Then we see healthcare is rallying, but still not closing in on prior local highs. And then we see discretionary is crushing it. So right now based on this rudimentary overview, skipping a lot of other analysis that we don't have access to because it's back in time, this is exactly how I would start building the portfolio. Now I want to pivot and I want to look at stuff as it sits literally today. I wanted to give you an example using a random point in time, how to build this market context to then start building trades. And that's exactly what would be done in this context. What we just did and then looking for trades in that exact way. But now I want to actually use like today and talk about putting on this portfolio today. So let's do that. So we know that the market has",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 58,
      "start_timestamp": "00:40:59",
      "start_timestamp_seconds": 2459.310344827586,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=2459"
    }
  },
  {
    "text": "that's exactly what would be done in this context. What we just did and then looking for trades in that exact way. But now I want to actually use like today and talk about putting on this portfolio today. So let's do that. So we know that the market has been rotating sideways. We know that volatility has been elevated massively. So and again, it's important to remember things in context. It's down big from its local highs. But again, compared to what you just saw, where VIX was hovering in the tens in 2018, this is double and some on top of that. So that gives you a good barometer for different volatility regimes and then potentially different ways to trade these different volatility regimes. So VAL is a much bigger component to what we're going to be looking at in building this portfolio. So then I'm going to skip over looking at these individual sectors. And we're literally just going to start. It's effectively using that same process that I showed you before. But I already have done all this. So I know where things sit today. Okay. So the next piece we need to define is what size portfolio are we trading? So let me know what size portfolio we want to simulate here. And then that will impact what we do. I'm erasing this stuff so that we can continue logging our notes while you guys let me know what size portfolio we're going to trade.",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 58,
      "start_timestamp": "00:42:37",
      "start_timestamp_seconds": 2557.68275862069,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=2557"
    }
  },
  {
    "text": "size portfolio are we trading? So let me know what size portfolio we want to simulate here. And then that will impact what we do. I'm erasing this stuff so that we can continue logging our notes while you guys let me know what size portfolio we're going to trade. So our profit mechanisms, we're going to pd up. And this is going to be done via breakouts and momentum. Then we're going to have pd down. This is going to be done via momentum. Then we're going to have VAL. This is going to be done via risk premium. This is going to be focused on earnings releases. So we have our general approach. Now we need to map strategies to these and all that kind of stuff, but that's going to depend on the size of our portfolio, which is the next input. 100K got it. So we have a 100,000 portfolio. So we know at the end of the year we're trying to make 20K. And we know that we can experience drawdowns of up to 40K. And this is all just the general starting phase. And if we take that 20K and we break it down into the 12 months, that gives us 1667. So we know we need to put on enough to at least clear this amount. So now let's actually take a look at putting on this portfolio. And again, what I'm showing you right now is step five. So I can scoot",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 58,
      "start_timestamp": "00:44:16",
      "start_timestamp_seconds": 2656.055172413793,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=2656"
    }
  },
  {
    "text": "into the 12 months, that gives us 1667. So we know we need to put on enough to at least clear this amount. So now let's actually take a look at putting on this portfolio. And again, what I'm showing you right now is step five. So I can scoot this out of the way because we're actually going to move now into a workbook. I'm going to grab a quick screenshot of this so that I don't have to click back and forth. We'll hide that now. Let's move into our workbook. We'll add a new one just for the sake of this. We'll add our notes off to the side until we don't need them. So we're going to have account value is 100,000. Our target percent return is 20 target dollar return. This times this. MDD 40 MDD dollar. This times this. So now to give you some just general things that I normally would tinker with, I would color code these normally I input some sort of color for the cells that I have to input. And it literally just makes it faster for me to move through stuff just to give you at least an idea. So now we're going to look at actually building the portfolio based on today. And I'm going to move us back in time like two weeks. And it's just so that we can fast forward time a little bit to actually see how the stuff moves. So when I",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 58,
      "start_timestamp": "00:45:54",
      "start_timestamp_seconds": 2754.4275862068966,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=2754"
    }
  },
  {
    "text": "idea. So now we're going to look at actually building the portfolio based on today. And I'm going to move us back in time like two weeks. And it's just so that we can fast forward time a little bit to actually see how the stuff moves. So when I say today I just mean like more temporal. The reason for this is again I want to like be able to fast forward so that we can see like how we're actually going to deal with these different positions and stuff. So let's go to like 28 April. Now the way that I do this I have a core and I have a speculative allocation with a 100,000 portfolio. I absolutely would maintain that. That's enough. So core and speculative allocations. And then as a dollar. The way that I think about core and speculative allocations is how I intend to make most of my money. So the way that this will work is I normally wait a coverage strangle. That's my overall preference. So that will probably be one of the strategies that we run from a base perspective. And then the speculative is more testing different things. Now for something like this based on the way that we trade we will need to see what splits make sense. So we'll get to that in a moment. We need to figure out what kind of strategies we're going to map to these. So let's think about that and what",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 58,
      "start_timestamp": "00:47:32",
      "start_timestamp_seconds": 2852.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=2852"
    }
  },
  {
    "text": "for something like this based on the way that we trade we will need to see what splits make sense. So we'll get to that in a moment. We need to figure out what kind of strategies we're going to map to these. So let's think about that and what might make sense from a mapping perspective. I want to edit this. Let me edit you. I thought I could double click and then whatever. We'll just move it over here. Cool. So we know that we're going to trade breakout momentum. We're going to trade things that are moving. So we can use a coverage strangle for that. And then we have stuff for downside and upside. This also in terms of what was going on in the market at this time is really the inside of earnings. So we have a lot of stuff that we can do here. So I'm going to start by just guessing at this number and then we'll refine this as we get a little closer. And I'm going to say that I'm going to put 50 of the portfolio into a core allocation. And then I'm going to put 50 into the speculative allocation. It gives me enough money to play with both effectively. And then again, as we put on our individual trades based on our trading style, then we'll figure out if this ultimately makes sense or not, or if we have to refine it slightly, I think we will",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 58,
      "start_timestamp": "00:49:11",
      "start_timestamp_seconds": 2951.1724137931037,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=2951"
    }
  },
  {
    "text": "speculative allocation. It gives me enough money to play with both effectively. And then again, as we put on our individual trades based on our trading style, then we'll figure out if this ultimately makes sense or not, or if we have to refine it slightly, I think we will be okay. Side note, if you don't notice, I just changed everything to Calibri. It's because again, like all of these things are small little efficiencies, but the text is still completely legible, but it's a little bit smaller. So I can fit more stuff, which is why you see it like that. All right, we need to put on risk. We know that we need to make 16, 17, 16, 67 per month. So this is target dollar monthly. And again, I'm just doing linear. It wouldn't exactly be this, but it's fine for the sake of the conversation. So we need to put on enough risk to get to here. All right, let's do this. So now what I'm going to do is grab a really, really simple singles style tracker. This we need to squish down more for now. And I'm going to compress all of these. I'm not going to waste a ton of time on the trade log. I'm going to skip over actually a bunch of this stuff, but I want you to see again, a simple way you can start with stuff that generally will always matter. So today's date is 28 April.",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 58,
      "start_timestamp": "00:50:49",
      "start_timestamp_seconds": 3049.544827586207,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=3049"
    }
  },
  {
    "text": "I'm not going to waste a ton of time on the trade log. I'm going to skip over actually a bunch of this stuff, but I want you to see again, a simple way you can start with stuff that generally will always matter. So today's date is 28 April. And we need to find some risk. So maybe for the core allocation, I'm comfortable with risk. So maybe we use something like T triple Qs. And we trade a coverage triangle in here. So this will start by selling puts. So if we go out to 20 June, and I'm waiting for the options chain to load, and we go to the 30 delta here, we need to cash secure these. So this part matters. So we'll add one of these. Let's do like here. This will be like a CSP amount. That's a slight difference for this compared to some of the other stuff in here. So this will be TQs stock price of TQs. And this example is 52 38. We don't know how many lots just yet because we need to size things, but we just need to get some risk on. So this we can kill. This will be 20 June. And then this is all fine. So we'll just do a short put. 30 delta is at the 47 handle. And this is again a 30 delta. I'm going to keep the delta is just because I don't want to give you a bad",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 58,
      "start_timestamp": "00:52:27",
      "start_timestamp_seconds": 3147.9172413793103,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=3147"
    }
  },
  {
    "text": "kill. This will be 20 June. And then this is all fine. So we'll just do a short put. 30 delta is at the 47 handle. And this is again a 30 delta. I'm going to keep the delta is just because I don't want to give you a bad example. The delta is really don't matter for the context of this strategy, but that's okay. The premium that we're going to collect is 387. And there are a couple really important caveats that come with this. I'm going to move this down here. And there's a couple really important caveats with this. So what we're saying for the core allocation, we're going to get 50,000. So now what I'm going to do is actually add a couple more. And I'm going to include a target utilization as a percentage. And then a target. Oops. And then a target utilization as a dollar. So what this means is of the money that I'm allocating to this T triple Q's coverage triangle in 28 May, I need to figure out how much money I want to give of this 50,000 dollars upfront. So here's how I would think about it. And again, the reason why I wanted to go back just a couple of weeks is because of how crazy things are right now. I don't want to use all this money, but I don't have a lot of money either. So one of my targets is going to be to",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 58,
      "start_timestamp": "00:54:06",
      "start_timestamp_seconds": 3246.2896551724143,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=3246"
    }
  },
  {
    "text": "again, the reason why I wanted to go back just a couple of weeks is because of how crazy things are right now. I don't want to use all this money, but I don't have a lot of money either. So one of my targets is going to be to put on as little money as I can in order to get as close as I can to this target return overall. So let's start and say that I don't want to be any more than 70 utilized. So what this is going to tell me is how much money I get to use 35 grand. I get to use 35,000 dollars on this T triple Q's coverage triangle. So now let's figure out how many we can put on. So for the cash secured put, we know we effectively just need to take our strike by the lot size and multiply that by 100. So if we start with a one lot, we know that we're going to need 4700 bucks. So we literally can just do back of the napkin math and we can say, all right, well, I want to use 35. It's going to cost this much per I can put on seven. So if I put on seven, it's going to use 32,900 bucks. Okay, sick. That's a perfectly reasonable starting point. So let's grab these. And then let's grab the. Okay. Why is control that's annoying? I'm struggling to select all which is making",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 58,
      "start_timestamp": "00:55:44",
      "start_timestamp_seconds": 3344.6620689655174,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=3344"
    }
  },
  {
    "text": "much per I can put on seven. So if I put on seven, it's going to use 32,900 bucks. Okay, sick. That's a perfectly reasonable starting point. So let's grab these. And then let's grab the. Okay. Why is control that's annoying? I'm struggling to select all which is making me mad. Yo, chill. What the fuck? All right. I'm doing is I'm mapping it to the spot in my existing log so I can just more easily copy this stuff. But for some reason, it's doing a terrible job like being able to copy everything. I have to unfuck my control all. All right. So anyways, what I do in here is I pretty much would just build based on what deltas are input and based on if the premiums positive or negative, I have it automatically classified as a strategy. So in this example, if I have a delta of three and then I have positive premium and I only have a delta on the put side, I know that that's a short put like that kind of thing. So now we can continue. We don't really need this one. This one we can get rid of. I'm just getting rid of the extra shit that we don't need. And cost that will be easy. Marginous lots. Yep, that's good. Okay. And then this is fine. So now let's see what our actual value is here. So this is going to equal cost will be our premium times",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 58,
      "start_timestamp": "00:57:23",
      "start_timestamp_seconds": 3443.034482758621,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=3443"
    }
  },
  {
    "text": "just getting rid of the extra shit that we don't need. And cost that will be easy. Marginous lots. Yep, that's good. Okay. And then this is fine. So now let's see what our actual value is here. So this is going to equal cost will be our premium times lots times 100. So this is going to get us to 2709. So what is the first thing that that tells me is literally with this one position, I can already get what I need for the month pretty easily actually. So that being said, that tells me I can actually safely size this down. I don't have to use as much like we talked about in the beginning, part of this game is using as little as we can in order to hit our monthly target. So maybe instead of running this at a seven lot, we run it at a four lot or a five lot, which gets us directly to the target, but it uses much, much, much less total money. So now, let's continue. We have our first position on and this first position gets us close. We also know the market is going haywire. So we don't want to just put short puts on and run a covered strangle. We need to find some other things. So one of the things that I would do is find some earnings plays. So I don't know if the calendar works. Actually, we just go back in time,",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 58,
      "start_timestamp": "00:59:01",
      "start_timestamp_seconds": 3541.4068965517245,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=3541"
    }
  },
  {
    "text": "we don't want to just put short puts on and run a covered strangle. We need to find some other things. So one of the things that I would do is find some earnings plays. So I don't know if the calendar works. Actually, we just go back in time, right? So let's go back to April. We're on April 28th. So let's see what earnings is there. After the market, there's BYON, RIG and NUE. So what I would do now is actually analyze the earnings move. And I have a whole other screening process that I follow for earnings that I'm not going to get bogged down on. But I'm going to give you like a quick overview so that we can see if these are even suitable. So let's start with NUE. And let's go to earnings. And this would be a direct pass for sure. So I'm going to move this off so I can go faster. But NUE is no chance. RIG is next. RIG is also not liking it. And then BYON is the next. And BYON is the better of choices. So let's take a quick look at BYON. And they would have reported after the close on the day here. So then what we'll do is we'll literally put a position on now. And we'll size it so that I mean, we think it's something that at least makes sense relative to the portfolio, which is I think a useful part of",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 58,
      "start_timestamp": "01:00:39",
      "start_timestamp_seconds": 3639.779310344828,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=3639"
    }
  },
  {
    "text": "reported after the close on the day here. So then what we'll do is we'll literally put a position on now. And we'll size it so that I mean, we think it's something that at least makes sense relative to the portfolio, which is I think a useful part of this exercise. So let's do that. So let's say that again, this is April 28th. And let's say we take a look at the options chain. And we want to play it for earnings. So we're going to go close in time. We're going to try to play the contraction here. We can either trade one side or two sides. And again, normally there would be more research. But I'm just going to play it to one side. And let's say we do this 21 delta on the short side or on the put side. And then on the call side, we can run the 28 delta. So this gives us 22 cents. And we're risking a dollar. So if we take a look at the total risk profile here, I forgot I have to go back in time here. So April 28th. Or is it this one? This one. April 28th. There you go. So we can see what the total risk is here. The total risk is 78. So now we can build out another part of our plan. So we can do speculative max percent risk per trade. Then we can do speculative adjustable percent risk. So",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 58,
      "start_timestamp": "01:02:18",
      "start_timestamp_seconds": 3738.151724137931,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=3738"
    }
  },
  {
    "text": "April 28th. There you go. So we can see what the total risk is here. The total risk is 78. So now we can build out another part of our plan. So we can do speculative max percent risk per trade. Then we can do speculative adjustable percent risk. So what we can do is we can say what based on our strategies based on the research we've done, what's like a reasonable max risk we can take per trade. And I think a good starting point for this kind of thing would be a percent of the total portfolio. So what I would do is I would take this either times the total portfolio value or towards the allocation itself, your choice between those really depends on your preference and your risk tolerance. I would maintain this off of the total portfolio. And then we can also have an input risk section. So then we can say like, well, if I wanted a risk a little bit more, what would the total dollars be? And then we can plot that just so that it's an easy calculator for us to use. So this will be dollar risk. And again, it's easy because it's 100,000. So numbers are all the same. Okay. So we know that we can risk about 1,000 on this earnings play. So let's go into again, 28 April, BYOM, stock prices 4.10, I just called 1.1. We don't know the lot size yet because we haven't",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 58,
      "start_timestamp": "01:03:56",
      "start_timestamp_seconds": 3836.5241379310346,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=3836"
    }
  },
  {
    "text": "it's easy because it's 100,000. So numbers are all the same. Okay. So we know that we can risk about 1,000 on this earnings play. So let's go into again, 28 April, BYOM, stock prices 4.10, I just called 1.1. We don't know the lot size yet because we haven't really dug into that component. We're going to be in the 2 May. Days to expiration is simply expiration less the entry date. I'm not going to worry about the way if it doesn't matter here. So let's take a look. We'll fill this in really quick. I'm going to move it off so I can move a little bit faster for you. So for these, the strike price I really don't care about. It's really just the delta's that matter to me. So on the call side, we're at the 5 and the 6. So the 5 is a 28 delta. And then the 6 is a 10 delta. And then on the put side, we're at the 2.5, which is a 4 delta. And then we're at a 21 delta. We're going to get 22 cents. The total capital requirement for this trade is going to be defined because it's a defined risk trade. So again, if we take a look at this, it's asking for 78 per contract. So now we can do a little bit of math. We can say if it's 78 of risk per contract and the total risk that's out, normally I would",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 58,
      "start_timestamp": "01:05:34",
      "start_timestamp_seconds": 3934.8965517241386,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=3934"
    }
  },
  {
    "text": "because it's a defined risk trade. So again, if we take a look at this, it's asking for 78 per contract. So now we can do a little bit of math. We can say if it's 78 of risk per contract and the total risk that's out, normally I would just manually input it here, by the way. So actually, we'll just do that. So we'll just do back of the napkin really quick. 78 risk, 22 cents total profit. That this is based on a one lot. So how many contracts do we want to run? And then this one we need to multiply by 100. So then if we run a 5 lot, for example, we're risking 390 to make 110. If we run a 6 lot, for example, so for earnings plays, I know based on my research that I actually prefer to size these down. So I'm rounding it to half a percent. So my max risk allowable is 500. So in this case, that would put me at about a 6 lot. 6 lot is what we can do. So this will be a 6 lot. So at this 6 lot, we're going to risk 468. And that will be the same as our margin, which is how much money that the trade needs. The margin for this cash secured put will be different than the cash secured put amount. Typically, if you have regulation T, it will be a little bit more. And then",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 58,
      "start_timestamp": "01:07:13",
      "start_timestamp_seconds": 4033.2689655172417,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=4033"
    }
  },
  {
    "text": "468. And that will be the same as our margin, which is how much money that the trade needs. The margin for this cash secured put will be different than the cash secured put amount. Typically, if you have regulation T, it will be a little bit more. And then if you have portfolio margin, it's a little bit less money. The reason why the difference between margin and cash secured put matters is because one of the things that you'll see that we're going to do is actually put on a box spread. And the reason for the box spread is because this trade here, it's otherwise using 23,500. However, I'm not really needing to use all of that in the trade right away because again, it's going to have just a standard margin requirement. So if we take a look at TQs and also notice in this entire exercise so far, I've not actually input anything into the platform you don't need to. So in TQs, we looked at being in the 20 June, this is a pass through IRA account. So oh no, this is on demands. So it should give me reg T. And we're looking at the 47s. Yeah. So what does this require as far as margin? So you can see the margin requirement here. The margin requirement is 2,900 per contract. If we run five, margin requirement is 15k. One of the things that I do when I'm inputting this and I'm tracking",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 58,
      "start_timestamp": "01:08:51",
      "start_timestamp_seconds": 4131.641379310345,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=4131"
    }
  },
  {
    "text": "at the 47s. Yeah. So what does this require as far as margin? So you can see the margin requirement here. The margin requirement is 2,900 per contract. If we run five, margin requirement is 15k. One of the things that I do when I'm inputting this and I'm tracking this especially in a smaller portfolio is I do not take the spot margin requirement. I actually take a stress-tested margin requirement. So this can be something and especially in a three times leverage ETF, you actually have to go out even further. So maybe I would add a slice here that as a I want to do this as a percentage. So let's say that this thing drops by 30 what's the margin requirement going to be? 16,897. So we'll call it 17,000. This inherently is going to allow me to account for the eventual move based on market conditions. So then what I do is I generally will sum the total risk that I have out the total cost and so on and so forth. So give me one second. I have to make sure that the store grabbed his food. I will be right back. I'll run this for you guys in the meantime. One second. All right. We got the dude. He's been fed. I actually grabbed another seltzer water. He squeak in his toy. Everybody's in a great spot. Let's continue. All right. So we know how much of the portfolio we're using right now.",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 58,
      "start_timestamp": "01:10:30",
      "start_timestamp_seconds": 4230.013793103449,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=4230"
    }
  },
  {
    "text": "this for you guys in the meantime. One second. All right. We got the dude. He's been fed. I actually grabbed another seltzer water. He squeak in his toy. Everybody's in a great spot. Let's continue. All right. So we know how much of the portfolio we're using right now. So what I would do is add a thing up here below this and I would add margin utilization, total utilization, the difference between margin utilization and total utilization will allow me to identify how much leverage I'm using. So margin utilization will come from this and then total utilization will come from this amount. So this cash secured element will either be I would code it so that it would use one or the other. So in this case, all I'm going to do is instead of tracking the margin total here, we can track it a little bit differently to make it easier to account for this. So then we're also going to need to add a box spread. So this one we know is a short iron condor and the width doesn't matter for the sake of this. We can just delete this column. We know how much this trade needs. 468 bucks but it's not a cash secured put kind of trade. So I'm not going to bother with it. The total cost of this trade is going to be based on the premium times lots times 100. This is how much we might be able",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 58,
      "start_timestamp": "01:12:08",
      "start_timestamp_seconds": 4328.386206896552,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=4328"
    }
  },
  {
    "text": "much this trade needs. 468 bucks but it's not a cash secured put kind of trade. So I'm not going to bother with it. The total cost of this trade is going to be based on the premium times lots times 100. This is how much we might be able to make from it and then percent captured all that stuff. This doesn't matter. No. Okay. So now let's add our next trade SPX. This is going to be on 28 April. This is going to be an SPX. And this is to use this money, the variance between these two because well, it's not even the variance between them. I can use this total amount of money and I'll show you exactly how what I'm going to do is pick SPX bunch of different reasons. I guess you could use XSP. I don't know how liquid that is. Let's take a quick look. Just an curiosity. XSP. We're going to build a box spread. So now the first thing is we already know to de-conflict. We have a little de-conflicting to do. All we have to do is say, okay, this expires in 20 June. When does early assignment risk likely start to grow depending on how far in the money I am? Maybe a week out. So I want my box spread to expire one week before this expires. So then if we see 20 June here, which is 53 days, I can set this position to expire",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 58,
      "start_timestamp": "01:13:46",
      "start_timestamp_seconds": 4426.758620689656,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=4426"
    }
  },
  {
    "text": "risk likely start to grow depending on how far in the money I am? Maybe a week out. So I want my box spread to expire one week before this expires. So then if we see 20 June here, which is 53 days, I can set this position to expire maybe on 2 June. A little bit earlier, but I'm trying to pick something that will be more liquid instead of going into the weekly. That's why I'm picking 2 June. So we already know that we're going to target something in 2 June. Regardless if it's excess peer SPX, I'm genuinely just curious how liquid this is. I mean, it's not awful and we don't have to use a bunch of money. So this could be fine. I'm still going to use SPX just because it's easier. So for SPX, we can get rid of this. We know that we need to use effectively 23,500. So maybe 20,000 is enough for 23,000 is enough. So for those that don't know, I have a video. I'm not going to go through all the concepts of a box spread, but it's a place to park money and earn a slightly better risk-free return than the risk-free return. So what we'll do is we'll say let's do 100 points wide, something like that. So let's start and let's see 500 to 600. That's pretty liquid. 13 Delta, that's not bad. So let's build one here. And let's just see how liquid it",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 58,
      "start_timestamp": "01:15:25",
      "start_timestamp_seconds": 4525.131034482759,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=4525"
    }
  },
  {
    "text": "risk-free return than the risk-free return. So what we'll do is we'll say let's do 100 points wide, something like that. So let's start and let's see 500 to 600. That's pretty liquid. 13 Delta, that's not bad. So let's build one here. And let's just see how liquid it would or wouldn't be. So this is 100 points wide. You'll notice that it has no loss and it's because what this does is it's simulating, putting up essentially 9,695. So we know we could put on at least two of these. So for the box spread right now, this is being priced at 96, 95 at the mid, which rarely you're hit at to be completely honest. So it's 100 points wide. So we know our max profit is this minus this. I'm 100. And then this will also be times whatever the lot size is that we ultimately pick. So we're going to start with the one lot. So what this is going to do is it's going to take this much money from the account up front. So again, this one will be this times lot size times 100. So it's going to take 96 hundred bucks. And at the end of it, it's going to return to me 305. So we can figure out what the annualized return and stuff is for it. I'm not going to bother. The only reason to do this trade is it's typically going to be slightly better than the risk-free",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 58,
      "start_timestamp": "01:17:03",
      "start_timestamp_seconds": 4623.503448275862,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=4623"
    }
  },
  {
    "text": "And at the end of it, it's going to return to me 305. So we can figure out what the annualized return and stuff is for it. I'm not going to bother. The only reason to do this trade is it's typically going to be slightly better than the risk-free rate. That's what you should know. So let's take a look at a two lot. A two lot's going to use 19, 390. That's pretty close. Now another thing we could do is not use 100 points wide. And we could do like 50 points wide. So if instead we look at a 50 point wide spread, let's take a quick look at the 50 point wide. Now the difference here, and you'll see in a second, is how many you have to put on. And that does matter. Let's actually do like the 25. I literally never do them this narrow. This is actually kind of cool because these will be way more liquid. Mother, of course not. We have to do the 30 because there's no 75. So let's do the 30 to the 80. And we'll be 50 points wide. So on the 50 points wide, you're going to make 4981. It's really a little too narrow. So I'm not going to bother with that one. So we're just going to do a two lot of this box spread. So it'll be a two lot. And this is using excess P just for fun. And the price",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 58,
      "start_timestamp": "01:18:41",
      "start_timestamp_seconds": 4721.875862068966,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=4721"
    }
  },
  {
    "text": "going to make 4981. It's really a little too narrow. So I'm not going to bother with that one. So we're just going to do a two lot of this box spread. So it'll be a two lot. And this is using excess P just for fun. And the price is 549.52. And we can input all this data. It really doesn't matter. I'm not going to bother the premium that we're getting is going to be a negative number because we're giving money away. Essentially we're putting money out. So the premium is this negative 96 95. And then the margin requirement is this number. And it's a when I say margin requirement, it doesn't mean that it's necessarily on margin. It literally just means how much money it needs. So in this case, you can see what the net cost is. So this is going to take money out of the account. So this one's taking 1900 bucks. So now you can see that our margin utilization is updated to our recent number here. And then here I would have cash secured amount just so I know for the things that are cash secured, how much money that's taking up. And then what I typically do is I also include one for box spreads. And the reason why I track box spreads separately is because it allows me to know how much money I can gain access to. So I would again just build it with a formula.",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 58,
      "start_timestamp": "01:20:20",
      "start_timestamp_seconds": 4820.248275862069,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=4820"
    }
  },
  {
    "text": "taking up. And then what I typically do is I also include one for box spreads. And the reason why I track box spreads separately is because it allows me to know how much money I can gain access to. So I would again just build it with a formula. I'm just not wasting the time on it right now. But I would have this essentially do a sum if this would do a sum if the strategy is a box spread based on the margin. Okay. So this is going to be a box spread. And I really only buy them. You can sell them to get the loan upfront. I just don't do that personally. All right. So what do we stand to make with the portfolio as it's used right now? Well, we know that we can make 1900 bucks here. We can make 132 bucks here. And then again, here we're planning to make about 610. So this puts us well over our target for this month. And in terms of total money being used, we're using about 37 of the total account. So we really don't have to stop here though because even though we hit our minimums, we know things like earnings plays tend to be kind of crap shoots. So I typically try to put a few of those on. And we also know things like playing the broader directional moves. If we think there's a good opportunity, it's typically worth our time.",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 58,
      "start_timestamp": "01:21:58",
      "start_timestamp_seconds": 4918.620689655172,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=4918"
    }
  },
  {
    "text": "hit our minimums, we know things like earnings plays tend to be kind of crap shoots. So I typically try to put a few of those on. And we also know things like playing the broader directional moves. If we think there's a good opportunity, it's typically worth our time. So we could take a look at a couple more of these earnings plays and build them out. And I'm not going to spend time doing that. But this is literally the process that I would follow. So zooming us back out to this concept of we set our goals and by setting those clear goals, we now know how much risk we might need to take in order to get there so that we can plan accordingly. Because what this means is I can then sum all of the risk that I have on from the individual positions. Let's say that I start this will have zero risk because it's a box spread. This you could put in whatever planning factor that you want for T triple cues. You can essentially say, well, what if two T triple cues goes down to well, let's use a reference. Let's show you how to build this reference T triple cues. What I would do is I would literally zoom the chart out in time. And I would say what kind of moves has it had? Well, it already had a big part of this move. So I'm not necessarily expecting it",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 58,
      "start_timestamp": "01:23:36",
      "start_timestamp_seconds": 5016.993103448276,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=5016"
    }
  },
  {
    "text": "you how to build this reference T triple cues. What I would do is I would literally zoom the chart out in time. And I would say what kind of moves has it had? Well, it already had a big part of this move. So I'm not necessarily expecting it to do another one of these, although it could. So this becomes a good planning factor. So that means T triple cues down another 62.25. So what I can do is I can say, well, what would this short put be worth if cues was down at that point, another 62 or I can say, what would the cash secured amount be at that point? Because in reality, I probably would be assigned or take assignment. So if we have this 47 strike and we're saying 62.5. So we're saying this is a percent. We can effectively see what the new price would be. So it's this minus this times this. Which would put us down at 1763. So then if T triple cues is down at 1763, and I know that I have a five lot. So my total trade size effectively would be this. So this would be my P and L at that point is stop working. So this minus this times lot size times 100. So this is the risk represented there. So 14,000. 687.5. Why does this matter? Because this allows me to measure against my risk tolerance. So I can go back up here",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 58,
      "start_timestamp": "01:25:15",
      "start_timestamp_seconds": 5115.36551724138,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=5115"
    }
  },
  {
    "text": "my P and L at that point is stop working. So this minus this times lot size times 100. So this is the risk represented there. So 14,000. 687.5. Why does this matter? Because this allows me to measure against my risk tolerance. So I can go back up here and then underneath utilization. This will be current risk. So current risk equals this number. And then current risk as a percentage of the total portfolio. So I know because again, I know what my max drawdown is allowable to be. So it equals this divided by this 15. So we know right out of the gate that with the risk that we have on right now were okay. If we experienced that broad down move, we would be within the total risk tolerance that we have. So I'll take a pause here and see what you guys think. Does the exercise that we just ran through does this make sense? And do you have any questions? Because this is like really the heart and soul of what I wanted to cover with you today because this is really where in my opinion, the money is made, right? It's by putting on and building a portfolio that's logical that is within risk parameters that you want. And that I think is a fair way to start thinking about the problem set. And again, I would remind you that I don't think that this is like a terminal way to look",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 58,
      "start_timestamp": "01:26:53",
      "start_timestamp_seconds": 5213.737931034483,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=5213"
    }
  },
  {
    "text": "putting on and building a portfolio that's logical that is within risk parameters that you want. And that I think is a fair way to start thinking about the problem set. And again, I would remind you that I don't think that this is like a terminal way to look at the problem set, meaning it will absolutely evolve from this what you're doing. But I think that being said, this is really a super solid starting point to work off of. So that's mostly what I wanted to go over with you. Now when it comes to risk management and things like that, it's really based on individual strategies, right? Each strategy has its defined risk management approach based on what we build out. So again, for something like this, the risk management really is based on size and then accepting drawdown potential and sizing us in the context of that drawdown potential. This is defined risk. This is saying if I lose this entire amount of money, this is sized appropriately. So that if I lose the entire trade here, that I'm okay. So by building it this way, I'm making sure that I'm taking the total amount of risk that I need, but I'm not over sizing things so that if the market has some sort of vicious move, that I'm not going to be completely off sides. Now the other thing is again, based on the broad market analysis, we might say to ourselves, man, I",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 58,
      "start_timestamp": "01:28:32",
      "start_timestamp_seconds": 5312.110344827586,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=5312"
    }
  },
  {
    "text": "of risk that I need, but I'm not over sizing things so that if the market has some sort of vicious move, that I'm not going to be completely off sides. Now the other thing is again, based on the broad market analysis, we might say to ourselves, man, I actually really want to have some short deltas, right? Because if we look at this portfolio and we bait await it, this will be about flat deltas. This will be long deltas. This will be flat deltas. So maybe we say I want to scrub some of those long deltas. Well, then we go into our bag for finding price direction down stuff and layering that on. But this literally is the entire process. So if you have any questions, now is the time. And then if not, in the meantime, I will talk to you a little bit about what's the next session is going to be about. And the next one is actually the finale for our little mini series here on outlier options trading foundations. And the next one is going to be the evolution of your holistic approach as a trader. So what that includes is building a comprehensive method to then take what we just went through, which is the positioning of the portfolio, right? Like the building of the portfolio. It's taking those concepts and then it's moving it one step further. And it's saying, okay, as I get information in from the performance",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 58,
      "start_timestamp": "01:30:10",
      "start_timestamp_seconds": 5410.48275862069,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=5410"
    }
  },
  {
    "text": "building a comprehensive method to then take what we just went through, which is the positioning of the portfolio, right? Like the building of the portfolio. It's taking those concepts and then it's moving it one step further. And it's saying, okay, as I get information in from the performance of this stuff, how do I make decisions? How do I optimize what I'm doing based on what's happening in the market? A good example for this could be during the earning season based on your back testing for the strategies and what you think they're supposed to do. You start to notice that you're losing just a higher percentage than you typically would expect to. Well, that doesn't necessarily mean don't trade them anymore. But it definitely would tell me I'm not going to size it at six. I might size this down another 50. So I might take it to 0.25 total risk of the portfolio. So that's the concept of like actually taking live information and updating our mental models on employment so that we're not just blindly stepping in front of bad risk. So that will be the next session. All right, gang. A little bit of a long one, a little bit heavy. I hope it's useful. As always, if you have any questions, you can let me know. Be in outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 58,
      "start_timestamp": "01:31:48",
      "start_timestamp_seconds": 5508.855172413793,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=5508"
    }
  },
  {
    "text": "of a long one, a little bit heavy. I hope it's useful. As always, if you have any questions, you can let me know. Be in outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "kVvzt6IkUAE",
      "title": "Executing a Trading Strategy - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=kVvzt6IkUAE",
      "upload_date": "",
      "duration": 6102.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 58,
      "start_timestamp": "01:33:27",
      "start_timestamp_seconds": 5607.227586206896,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=kVvzt6IkUAE&t=5607"
    }
  }
]