[
  {
    "text": "What's up everybody? We got Eric and Kirk. Welcome back to the outlier podcast and I'm stoked to have you on. Thank you for joining me. One of my audience members actually introduced me to you and what you were doing. So I had a chance to look through some of your background. I'm stoked to chat with you. Thanks for hanging out. Awesome. I appreciate it. Thanks for being here. Yeah, dude. So we were just talking a little bit about the coal building that you're in and kind of commenting the fact that here in California, we don't really have that kind of history. Is that part of the reason why you stay in the Northeast? Is that where your family's at? What keeps you there? Yeah, yeah, family took me here for sure. When we had our first kid, we moved back to Pennsylvania where my wife is from. So I love it there. I mean, like the seasons are great. Like it's just good place to live. You know, like my kids don't never really knew what traffic was until we went back to Virginia and visit family. So it was pretty fun. Yeah, it was pretty rad. Well, it's also probably better for like their emotional development as human beings not to deal with traffic. So I feel like as soon as you find that, you will lock a different part of your brain that you might not even know is there. So that's. I",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 63,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=0"
    }
  },
  {
    "text": "pretty rad. Well, it's also probably better for like their emotional development as human beings not to deal with traffic. So I feel like as soon as you find that, you will lock a different part of your brain that you might not even know is there. So that's. I mean, like we're Western B.I. So like we do have a lot of like, I mean, omniscience influence here is like pretty big. It's a lot outside of town. So so they know that. But like when we go back and visit, you know, family in Virginia, they're like that. Why where are all these cars parts in the middle of the road? I'm like, that's traffic. Son, like. He's like, that's crazy. They just stay there all day. I'm like most days. Yeah, most. Yeah. Yeah. And believe it or not, they don't want to be there either. Yeah, nobody wants to be there. So that's the best part. Well, it's also man. So I had a chance to do just a little bit of background research. I know that you did MA at Deutsche Bank. And then you got into like reanalysis, I guess. And talked to me a little bit about your entrance and so finance based on what I was catching when I was watching that. It just seemed like. You had an idea of what this thing was going to look like and what it was going to feel like. And then you did it.",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 63,
      "start_timestamp": "00:01:38",
      "start_timestamp_seconds": 98.92063492063491,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=98"
    }
  },
  {
    "text": "a little bit about your entrance and so finance based on what I was catching when I was watching that. It just seemed like. You had an idea of what this thing was going to look like and what it was going to feel like. And then you did it. And then you're like, this is looking and feeling different than I expected. But obviously, I'm just taking a guess. I'm curious from your perspective. Yeah, I mean, I think that, you know, like regard to option alpha, like specifically, like I've always been interested in finance, like just generally, I think it was. It was nothing that like necessarily came super easy. But I knew I didn't want to do anything else. I've always been just fascinated by. Like finance and like why people make money or don't make money or how people like generationally like build wealth or not wealth. So I would say like as a collective, like I'm just like that's what I do that's fun. Like I read finance books, like I don't I don't do anything else. If I watch documentaries, I try to watch finance documentaries or like market documentaries. Some of total junkie in that that regard. And I think where like my path eventually led to to options and then option alpha is just like just kind of more of like self learning and discovery of like there has to be a better way to do this, you know, like just",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 63,
      "start_timestamp": "00:03:17",
      "start_timestamp_seconds": 197.84126984126982,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=197"
    }
  },
  {
    "text": "junkie in that that regard. And I think where like my path eventually led to to options and then option alpha is just like just kind of more of like self learning and discovery of like there has to be a better way to do this, you know, like just watching. You know, like my parents, they were in the same industry, you know, like growing up. So like their income was very volatile in the sense that, you know, like when it was good, it was good and when it was bad, it was bad because they were just both in the same industry, right. And so I kind of like grew up trying to figure out like how how do you hedge that? Like how do you get to more of a steady state, you know, and and how do you do that. And so I guess that that's like the very. Like deep background of around like options is like how how can you try to do things in both directions and you know or even non directional and try to do something. And so When it came to option alpha was just purely a blog at first, like there's just a little Google blog spawn like a blogger thing and then eventually came and you know just kind of grew people ask questions. I try to put things together. I I feel like I like and enjoy teaching our like learning and trying to like pass",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 63,
      "start_timestamp": "00:04:56",
      "start_timestamp_seconds": 296.76190476190476,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=296"
    }
  },
  {
    "text": "first, like there's just a little Google blog spawn like a blogger thing and then eventually came and you know just kind of grew people ask questions. I try to put things together. I I feel like I like and enjoy teaching our like learning and trying to like pass on some of that, you know, or at least my perspective of it to some degree. And you know, over the last 10 plus years now it's completely morphed in many different directions. But you know, I think where we're going. To some degree, like we kind of know where we're going, but at the same time, it feels very new every day. I will tell you. Yeah, that seems like one of the really cool things about what you're doing. Because similar to you, I, well, I actually, when did you start like actually trading in your personal capacity. I mean, really like before the 2008 crash a start, right. I remember trading through the 2007 2008 crash. But I mean, even before then, I think I was like, I think my very first box certificate is up there. That's like a Nike stock. I mean, my dad by me as a custodian. Yeah, I still have it. I don't even know if they would accept it. Now they probably don't even accept that stuff anymore. But I've always kind of enjoyed that. But really kind of like right before the 2007 2008. That's when I, you know, really",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 63,
      "start_timestamp": "00:06:35",
      "start_timestamp_seconds": 395.68253968253964,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=395"
    }
  },
  {
    "text": "me as a custodian. Yeah, I still have it. I don't even know if they would accept it. Now they probably don't even accept that stuff anymore. But I've always kind of enjoyed that. But really kind of like right before the 2007 2008. That's when I, you know, really started to get more of an interest in doing it. So which is really interesting. So I started trading in 2007 myself when I was in high school. So it's yeah, it just kind of was the way you're talking about it. Maybe think a little bit about. It seems like some of the background and the progression that you found as you were talking about it really resonated with me. So what led you specifically to options as compared to the Nike stock that you started with. Obviously, you found your way into derivatives. And I remember back then, it's not like there was a ton of stuff out there on derivatives. I ended up like stumbling across it. Literally reading a book in a library. Pretty cool. But that's exactly how I found derivatives. How did you come across them? I think that I kind of stumbled into them like I did, you know, like we used to calculate black sholes in college, like by a long, long hand, like doing it. And I kind of got an interest in doing it that way. And And found out, you know, a little bit more about it as like",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 63,
      "start_timestamp": "00:08:14",
      "start_timestamp_seconds": 494.6031746031746,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=494"
    }
  },
  {
    "text": "them like I did, you know, like we used to calculate black sholes in college, like by a long, long hand, like doing it. And I kind of got an interest in doing it that way. And And found out, you know, a little bit more about it as like kind of like progressed in like grew and stuff like that. But I think for me, it really came down to like figuring out like that there was this completely other way to invest that was not just on the directional like one directional like you buy it and it goes up and it goes up. Right. And we many people have probably heard a short selling right when they get started. They're like, oh, well, you can sell it. And then it goes down. But just like the capital usage just seemed like a drag, you know, like I read all the books about Buffett and you know, Munger and all these guys. I'm like, I just don't even know if I had the wherewithal to like do that for a long term. Like could I really pick and choose, you know, different companies? I mean, when I was a read analyst, like one thing I always remember and I tell people this a lot of times like we had a company that announced earnings and I mean, Reitz are pretty boring. I mean, like it's a leverage corporate bond essentially the trades, right. So like Reitz are insanely",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 63,
      "start_timestamp": "00:09:53",
      "start_timestamp_seconds": 593.5238095238095,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=593"
    }
  },
  {
    "text": "a read analyst, like one thing I always remember and I tell people this a lot of times like we had a company that announced earnings and I mean, Reitz are pretty boring. I mean, like it's a leverage corporate bond essentially the trades, right. So like Reitz are insanely boring. Like you know exactly what it is. You have all the least schedules like all the debts lined up. Like it's it's almost so predictable. It's scary. Right. Then the company announced had great earnings, whatever and the stock went down. And it's like, what? Like come on. Like so now you know, like even if you get it all right. Even if you find something that you you absolutely know what the schedule of payments and cash flow is going to be and you know what the operating is, but you know the whole like it still doesn't matter like because the market has their own opinions and their perspectives and then you got all these other things that just get thrown into the mix. So at that, like I would say like around that time is when I started to figure out like, okay, like there has to be something better. And so for me, options not only just ridiculously more capital efficient, but just from the sense of like being able to very quickly change and move directionally into different strategies. I always found insanely fascinating. Like if something wasn't working, could I, you know, reengineer",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 63,
      "start_timestamp": "00:11:32",
      "start_timestamp_seconds": 692.4444444444445,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=692"
    }
  },
  {
    "text": "to be something better. And so for me, options not only just ridiculously more capital efficient, but just from the sense of like being able to very quickly change and move directionally into different strategies. I always found insanely fascinating. Like if something wasn't working, could I, you know, reengineer the strategy, could I roll it, could I hedge it, could I do something like that. No pun intended, but there's just a lot of choice and options in doing that. Like if you can figure out something where you can move that fast, then I feel like that's that's the place that I need to be like, if you even look at like real estate, like real estate, you can't move that fast. I mean, you really can't like closings take 30, 45, 60 days, right. Sometimes down 90 days, right. And you can update and renovate a property, but like that's time and capital. I mean, like so there's a little bit of that component to it, but in options like I can be out in an entire industry in five seconds, you know, I can be completely short and completely long two different industries in the morning and the afternoon, right. I can be neutral something else. And like that speed and like the ability to change direction and then also I like have the ability to to comprise a strategy based on the outcome that I think or maybe think is working. I think has always",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 63,
      "start_timestamp": "00:13:11",
      "start_timestamp_seconds": 791.3650793650793,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=791"
    }
  },
  {
    "text": "and the afternoon, right. I can be neutral something else. And like that speed and like the ability to change direction and then also I like have the ability to to comprise a strategy based on the outcome that I think or maybe think is working. I think has always fascinated. So I completely resonate with you. And one of my favorite books is actually right there. It's options as a strategic investment by Lawrence McMillan. You obviously must have heard of it. It's a voice giant textbook. Like really foundational concepts. I think it's nothing like super crazy. But one of the things when I was first reading it that really stuck out to me is the concept of like a strategic investment, which is kind of what you're highlighting is that you have the ability to trade something long. You have something that you're trading to the upside, but have credit you receive upfront limited profit potential, but higher potential for profit. Those kinds of variabilities. I think to your point are exactly what make options so fascinating and probably one of the most adjustable tools available for us to trade different as positions. However, I imagine and I went through this myself. When you're a newer trader. All of those choices also become your downfall. Yeah, you pick this one. Do you pick that one. And then if you pick this one and you use it for three months and it worked well, but then you find",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 63,
      "start_timestamp": "00:14:50",
      "start_timestamp_seconds": 890.2857142857142,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=890"
    }
  },
  {
    "text": "I went through this myself. When you're a newer trader. All of those choices also become your downfall. Yeah, you pick this one. Do you pick that one. And then if you pick this one and you use it for three months and it worked well, but then you find out what actually doesn't work that well. You should pick that one. You know, like that that world of choice can actually become difficult. So when you think about your journey through options, how did you navigate that world of choice because you can set them up to be literally whatever you want and infinite variables can be overwhelming. So what's your approach there? Yeah, totally. I mean, so I'm definitely fan of like, I don't know if you are to be like, I'm a super crazy fanatic now, but like all the F1 racing since like all the Formula One drive to survive has come up like I love it now. Like and I've always liked cars and racing. So that's not anything different, but like F1 specifically. But if you look at like an F1 steering wheel, right, which is like insanely fast and agile car and use that as a proxy for options, right. That steering wheel has so many buttons on it and so many modes that those drivers go through. Even in a single lap, I mean, they're changing brake balance and they're changing, you know, like gear and battery pack and energy efficiency while",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 63,
      "start_timestamp": "00:16:29",
      "start_timestamp_seconds": 989.2063492063492,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=989"
    }
  },
  {
    "text": "that as a proxy for options, right. That steering wheel has so many buttons on it and so many modes that those drivers go through. Even in a single lap, I mean, they're changing brake balance and they're changing, you know, like gear and battery pack and energy efficiency while driving 200 miles an hour, right. So if you take that to to pull up one of those. Yeah, it's like look at all those modes that they're on. And if you watch them, which I like in I watch like I do like the cockpit view sometimes like and I like watching them. I mean, they're changing dials all the time. They're shifting gears, whatever. So you think like options as a as a metaphor, I'm a psychophobic metaphor. So like you think options is a good metaphor for like this insanely fast agile machine that you have at your disposal. And you can take it anywhere and it can zig and zag and go fast and slow and whatever. But then there's all these dials that you have to press. And the reality is, is that it is insanely complicated to do. I think though that many people press everything. I think that there's a natural inclination to touch every dial to mess with everything to want to understand the intricacies of how everything works. And I get that. But the reality is that many times you just got to get into a car and hit the gas",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 63,
      "start_timestamp": "00:18:08",
      "start_timestamp_seconds": 1088.126984126984,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=1088"
    }
  },
  {
    "text": "press everything. I think that there's a natural inclination to touch every dial to mess with everything to want to understand the intricacies of how everything works. And I get that. But the reality is that many times you just got to get into a car and hit the gas and change the steer and real and break. And like there's a couple things that probably move the needle more than the combined essence of all the other things. And so I think like over time. I feel like I'm still developing this. So I don't think that I've figured it out totally yet. But I think that I've learned that there are a couple things that kind of save not save you, but just like there are the really important big rocks, like position sizing, staying neutral, diversifying tickers, like you get most of that right in like selling premium. You get those big rocks, right? Like you can make some mistakes along the way and be okay. Like you can come out unscathed. But if you go in there and you feel like, hey, you need to have, you know, a scenario for every half scenario that happens or modify something for every off that, you know, happens at the Fed, like, that then like that's going to be a complicated road because you're going to want to always adjust and like recalibrate for every little thing. Like recently, I, I wouldn't say not recently fairly recently got",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 63,
      "start_timestamp": "00:19:47",
      "start_timestamp_seconds": 1187.047619047619,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=1187"
    }
  },
  {
    "text": "or modify something for every off that, you know, happens at the Fed, like, that then like that's going to be a complicated road because you're going to want to always adjust and like recalibrate for every little thing. Like recently, I, I wouldn't say not recently fairly recently got into something with somebody who said, like, I was doing a workshop and I scheduled the workshop specifically at 230 when the Fed was speaking. And a bunch of people got super mad and they're like, why did you schedule this at 230? Don't you know the Fed is speaking? I was like, of course I got the Fed is speaking because I don't want you paying attention to the Fed. Like I would rather maybe come to a workshop, learn how like options work or how different strategies work, whatever. And I got into this little argument with the guy and I said, like, why don't you, like if your strategy is so dependent on what one person is saying, like, how can that be a sustainable thing? You know, like if you need to tweak your strategy, like that moment that the market, you know, that the Fed speaks or Powell speaks or whatever, like, you know, like how brittle is that strategy? And so I think in trading, it's finding the things that actually move the needle, like actually push the car down the road and then figuring out to ignore all the other stuff or make",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 63,
      "start_timestamp": "00:21:25",
      "start_timestamp_seconds": 1285.968253968254,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=1285"
    }
  },
  {
    "text": "speaks or Powell speaks or whatever, like, you know, like how brittle is that strategy? And so I think in trading, it's finding the things that actually move the needle, like actually push the car down the road and then figuring out to ignore all the other stuff or make it resilient enough to trade through that, like you can't figure out. You can't possibly account for everything, right? And so it's figuring out like what are the most important things that kind of mesh with my style, my profile as a trader and what, what can I completely ignore? Because I can't figure out it. So yeah, I love that it reminds me of saying I use all the time. It's from Leo notarou DaVinci, but it's simplicity is the ultimate form of sophistication. And I've, I've really found a similar path. It sounds like we probably have slightly different trading styles, just from what you were mentioning, but regardless, I think one of the main things that we probably deeply align on is a simpler, more robust thesis and way of executing against that thesis. And also the car metaphor was really fantastic. I run a car club out here. I love cars. Yeah, I've been building cars since I was a kid that that's actually a painting. My mother-in-law did of C seven that's sitting in the garage that I built. And yeah. So anyways, love love cars. So, yeah. Yeah. Yeah. We have our conversation I",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 63,
      "start_timestamp": "00:23:04",
      "start_timestamp_seconds": 1384.888888888889,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=1384"
    }
  },
  {
    "text": "out here. I love cars. Yeah, I've been building cars since I was a kid that that's actually a painting. My mother-in-law did of C seven that's sitting in the garage that I built. And yeah. So anyways, love love cars. So, yeah. Yeah. Yeah. We have our conversation I can have to. Yeah, dude, we have a bunch of really cool places out here. So we have thermal where there was a pretty well known track, BMW M school is there. Though I had a chance to go do that. That was super cool. But to your point on finding the specific levers that give you the Pareto principle, right? 80 of the solution on 20 of the focus that I definitely found that with driving and in trading as well. Yeah. When you think about the way you started trading and then the way that that's evolved over time, walk me through that. I think it even like that evolution has in my mind, it has been like a slow progression. And then in the last like, let's say a year, year and a half, it's been like a ridiculously. I would say like in my mind, in my mind, and this may not be for other people looking at it objectively from the outside, but it is completely changed in the last year and a half. And I would say because many people in many traders, like we don't know what we're doing. Like we come into",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 63,
      "start_timestamp": "00:24:43",
      "start_timestamp_seconds": 1483.8095238095236,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=1483"
    }
  },
  {
    "text": "my mind, and this may not be for other people looking at it objectively from the outside, but it is completely changed in the last year and a half. And I would say because many people in many traders, like we don't know what we're doing. Like we come into the market every day and the analogy I use, like you come in like a cowboy, like walking into a saloon and you're just shooting up the place. Like you really don't have a plan. You kind of like are gunslinging from the hip and you hope you hit something, you know, and that's 90 of people walking into the market every day. And like so if you sit down at the, you know, your trading desk or whatever you have, and you kind of fire up the markets, whatever routine you go through, you're looking for and hunting for a trade, right. There's probably very rare breed of people who knew exactly what they were going to do went there, made the trade and then like bounced right and got out. And so I'd say that for the most part, that was the initial evolution was just like hunting for trades, being a hunter and gather trying to figure out, you know, what we were doing and how was working. And trying to do some math and calculations and analysis, right. But at some point it gets repetitive and, you know, boring and you're just like, I forget, I",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 63,
      "start_timestamp": "00:26:22",
      "start_timestamp_seconds": 1582.7301587301586,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=1582"
    }
  },
  {
    "text": "for trades, being a hunter and gather trying to figure out, you know, what we were doing and how was working. And trying to do some math and calculations and analysis, right. But at some point it gets repetitive and, you know, boring and you're just like, I forget, I kind of know what a good trade looks like. And so that was probably my progression for a long time is kind of like the hunter gatherer type trader where I did have an idea of like I wanted to trade these symbols. I generally wanted to be pretty active. I generally wanted to stay pretty neutral. But there wasn't much mechanics behind that right other than like the routine and the habits that I had formed and I feel like I had formed OK habits, but of course like I would slip all the time like I forgot to make that trade or gosh I should have, you know, adjusted that or I should have taken profits or whatever the cases. And so now where I've gotten myself to is is too much more of, I mean, like obviously I use our own software to do this right and purely do this. But like now it's much more of a mechanical thing where I'm really having my thoughts look at and perform analysis for me and then like I'm setting the criteria to say like OK, all the things that are out there. These are the things that I'm",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 63,
      "start_timestamp": "00:28:01",
      "start_timestamp_seconds": 1681.6507936507935,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=1681"
    }
  },
  {
    "text": "purely do this. But like now it's much more of a mechanical thing where I'm really having my thoughts look at and perform analysis for me and then like I'm setting the criteria to say like OK, all the things that are out there. These are the things that I'm willing to accept. And if you find one of those then like let's try to go after right. So it's much more hands off in the sense that I'm not in there digging for trades every day. I'm not in there. You know, like looking through symbols and going through option chains like I've set my criteria. And then I have to have enough patience and you know, understand to let the box go through those and try to adjust for markets and areas and oh that's different. I didn't know that. You know, it was going to find that so let me adjust this and tweak this and it kind of runs a little bit different. I think that where I go to now a days is really doing a lot more of the. And now when I say I don't mean that I am physically doing this but relying on technology to do the math and the calculations and the analysis for me. And then I'm just the gatekeeper to say yes, that's something acceptable that I will take on as a trade. Yeah, that makes sense. Yeah, it makes a ton of sense. So talk to me",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 63,
      "start_timestamp": "00:29:40",
      "start_timestamp_seconds": 1780.5714285714284,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=1780"
    }
  },
  {
    "text": "relying on technology to do the math and the calculations and the analysis for me. And then I'm just the gatekeeper to say yes, that's something acceptable that I will take on as a trade. Yeah, that makes sense. Yeah, it makes a ton of sense. So talk to me about what your return profile looked like pre automation or it sounds like general automation but not like full execution. It sounds like there's still at least some like human intervention on your side like yes, take this no don't take that. You could I like I still love to trade so I'll go in and like find trade ideas and just like kind of see to Z pick trades but for the most part like the trades that that my account is making is purely through bots so like okay. Some of the some of the bots that I run like it will make all it'll it'll make all the trades like in and out there needs to be adjust whatever like it's totally hands off and so I look at that and I say okay you know like how does that work out you know like. It's just depends like on how many trades it could possibly find like for example like I run a bot that's trying to trade TLT TLT has been a bear to trade because like the numbers just don't add up there like that it just hasn't been able to find a trade",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 63,
      "start_timestamp": "00:31:19",
      "start_timestamp_seconds": 1879.4920634920634,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=1879"
    }
  },
  {
    "text": "depends like on how many trades it could possibly find like for example like I run a bot that's trying to trade TLT TLT has been a bear to trade because like the numbers just don't add up there like that it just hasn't been able to find a trade so that bot's been running for seven and a half months and has found two positions right now does maybe that means my criteria is too strict maybe it's not I don't know but like it's found positions it just hasn't found a lot of positions right. And so I look at that differently I guess if that makes sense yeah yeah so then when you look at your trading performance pre and post automation slash partial automation how does how does it compare how did you do before and then how do you do once you started switching over to this yeah I think it's about the same in the sense that like I think I generally stay in the same range where you know make a little bit I lose a little bit whatever the cases I think what I've found that is different because like the bots right now for me are about a year and a half. are about a year and a half two years into it and some of them have been running sooner some of them have been running longer you know some like one by the run that has 49 trades and",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 63,
      "start_timestamp": "00:32:58",
      "start_timestamp_seconds": 1978.4126984126983,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=1978"
    }
  },
  {
    "text": "right now for me are about a year and a half. are about a year and a half two years into it and some of them have been running sooner some of them have been running longer you know some like one by the run that has 49 trades and other one has you know 30 trades right so I don't know if there's enough math yet for the bots to say like okay these are you know going to be absolute home runs or not like there's still maybe sort of in like a testing mode of like you know sequence of returns. But I think that the difference for me is I know i'm getting better trades out of them and I know that I don't have to watch the markets and and you know like rely on myself to do that like I can trade through like one bot that I've had running since release the second version of it because I moved it from a different brokerage has been running for a year and a half and like i've traded through every it's trade through every fed every whatever every discussion like I don't have to worry about it if that makes sense. So I think mentality towards the markets has changed I feel like I don't I don't check in and like anxiously await every movement every pre market earnings every pre market you know thing like that mentality change has been huge because like",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 63,
      "start_timestamp": "00:34:37",
      "start_timestamp_seconds": 2077.333333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=2077"
    }
  },
  {
    "text": "worry about it if that makes sense. So I think mentality towards the markets has changed I feel like I don't I don't check in and like anxiously await every movement every pre market earnings every pre market you know thing like that mentality change has been huge because like it's super stressful to try and manage a bunch of positions and then like recalibrate everything when the markets change I think that that's insanely stressful so. Got it so it sounds like it performs around the same but it is way less high touch and something that you don't have to hover on that kind of thing yeah I mean it is what you want it to be ultimately I mean like a lot of people love to do high touch with it like some people run 250 bots like. I don't do that that seems like a nightmare you know like that's overkin but I think for me because i'm super conservative and running them like it's about what I expected it's just now I don't have to do it. Yeah yeah that makes a lot of sense so when you talk about the process of automation one of the questions I have about that is how do you maintain then your closeness to the markets if you're not necessarily combing through the options chains is it something that you still do. Periodically just to take a look at things the reason I ask is at least from",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 63,
      "start_timestamp": "00:36:16",
      "start_timestamp_seconds": 2176.253968253968,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=2176"
    }
  },
  {
    "text": "of the questions I have about that is how do you maintain then your closeness to the markets if you're not necessarily combing through the options chains is it something that you still do. Periodically just to take a look at things the reason I ask is at least from a discretionary trade perspective which is you know primarily what I do a lot of what I pick up when I'm conducting research doesn't always stem from something i'm directly looking for but it's a peripheral data point that I end up seeing. So is that something that you either automate and then kind of look at readouts that shows you those kinds of things are you still perusing through yourself to you know see what you find periodically. Yeah I mean I think there's like a level of keeping your head above water and like situational awareness like if you play football if you're like a quarterback like you're going to be looking at receivers right. But like you're not looking at the lineman that's about to tackle you right but like you kind of know he's there and you can kind of feel him off to the side like you know he's moved around the backside but your eyes aren't looking at that you know. So there's a little bit of like situational awareness that you should develop as an investor were. An investor trade where like if you're trading and you're actively trading. Then you should kind",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 63,
      "start_timestamp": "00:37:55",
      "start_timestamp_seconds": 2275.174603174603,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=2275"
    }
  },
  {
    "text": "like you know he's moved around the backside but your eyes aren't looking at that you know. So there's a little bit of like situational awareness that you should develop as an investor were. An investor trade where like if you're trading and you're actively trading. Then you should kind of know what's going on and I think it also has to do a little bit with like the duration of trades right so. A lot of people if they're trading like zero DTE like every fricking day counts you know like you should know exactly what the hell's going on every day because if you're zero DTE's today like. You should know if the fed speaking at the end of the day like that's going to change how you trade today right but if your duration is say 35 45 60 days out well then today shouldn't matter that much right like it shouldn't matter so you should have an awareness of it like did the fed like are we going to a new interest rate environment okay that's something important to know. But if it's it's something that's non existent you shouldn't really pay attention to it or just completely ignore it I think though that. I what I found even in doing that is like I find that you generally see just the quality of trades come through where it's like you see like oh I used to get this much premium I used to get this",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 63,
      "start_timestamp": "00:39:34",
      "start_timestamp_seconds": 2374.095238095238,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=2374"
    }
  },
  {
    "text": "just completely ignore it I think though that. I what I found even in doing that is like I find that you generally see just the quality of trades come through where it's like you see like oh I used to get this much premium I used to get this much premium. Now call spreads are you know pricing a lot better than put spreads like that's you know something that you start to see and maybe the bots are opening a couple more call spreads but. You know generally speaking i'm much more numbers based with trades like I tell my bots exactly what I want what I want to get out them how they want to make how they should make trades like what tickers they should trade. So I want to run a more mechanical process that's long term that tries to avoid all of the all of the noise but that's where like if I make a trade and you know try to push in a trade like if I see something i'll make a trade I'll be like okay I want to. Trade something in that ticker symbol so let me go find you know something they're trading that ticker symbol and just do it from a different angle I guess versus just like. randomly choosing like I think a lot of people what they do honestly is they pull up a option chain and they go i don't know what the hell like somebody",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 63,
      "start_timestamp": "00:41:13",
      "start_timestamp_seconds": 2473.015873015873,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=2473"
    }
  },
  {
    "text": "something they're trading that ticker symbol and just do it from a different angle I guess versus just like. randomly choosing like I think a lot of people what they do honestly is they pull up a option chain and they go i don't know what the hell like somebody said you know Tom said 45 days to expiration so i'm going to 45 days to expiration. So and so said 50 delta earth 15 delta so i'm going to do 15 delta like is that the best trade right now like there's no way to know unless you're analyzing all the possible positions like that's. Where we as humans and like we are flawed like we can't possibly do that like are better. More strategic use is at a higher level to say no these are the things that we will specifically avoid and these are the things that we will do. And if you find something then you can trade it but like digging down into that math and those calculations as fast as the markets moving like it's just not possible to find. I think the most optimal trades in many cases. Interesting. yeah yeah no i'm following you now I was looking at your profile on option alpha and you look fantastic by the way. But it obviously does beg the question when you see somebody holding a coffee cup looks like Starbucks is this a s box. Yeah, I think it could have been for",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 63,
      "start_timestamp": "00:42:51",
      "start_timestamp_seconds": 2571.936507936508,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=2571"
    }
  },
  {
    "text": "following you now I was looking at your profile on option alpha and you look fantastic by the way. But it obviously does beg the question when you see somebody holding a coffee cup looks like Starbucks is this a s box. Yeah, I think it could have been for that photo yeah and then what kind of coffee would we be consuming is it what what's your flavors just regular vanilla. Thank you. Nice. I dig that and then I also saw old cars so that's actually how I started in automotives I used to restore old cars with my uncle. So it was mostly 56 57 Chevrolet Belair no mad. Yeah 64 stingray was one of the first. It had so cool. Yeah. Actually why I have a C7 stingray that's white is because one of the first cars I worked on was a white 64 stingray with my uncle but. Talk to me about your flavor in old cars. My dad was a master mechanic for Nissan for a long time and then when he left Nissan he. Opened up his own shop and that was when I was in elementary school so I remember getting off the bus they would drop us off at his shop and he didn't have a too long. But he did have this like shop where he would help like you know people repair their cars and whatever but we would always fix cars like. So he's got an 86 grand",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 63,
      "start_timestamp": "00:44:30",
      "start_timestamp_seconds": 2670.8571428571427,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=2670"
    }
  },
  {
    "text": "the bus they would drop us off at his shop and he didn't have a too long. But he did have this like shop where he would help like you know people repair their cars and whatever but we would always fix cars like. So he's got an 86 grand national he's got a 68 RSS drag car that we you know fixed up and we used to race together like. So we would always do that we put together to 350 ZXs like one that had crashed in the front and one that had crashed in the back and. Put that together and that would have been my high school car until we lent it to a friend who wrapped it around a pole but. Yeah it's insane. It was ridiculous it was so ugly it was red with gold wheels but I had T tops it's like. At the time that's literally perfect it's all the cool one so but it was a 86 350 ZX but so like I really truly enjoy. All cars I would love to build a car I tell my kids all the time like at some point dad is going to build a car and I want to you know you guys to kind of like help with that process because that's what we did like we like swap engines like we. Like all the time like there were just cars kind of coming and going in my house with my dad",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 63,
      "start_timestamp": "00:46:09",
      "start_timestamp_seconds": 2769.777777777778,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=2769"
    }
  },
  {
    "text": "a car and I want to you know you guys to kind of like help with that process because that's what we did like we like swap engines like we. Like all the time like there were just cars kind of coming and going in my house with my dad just trying to like renovate them and you know he would keep some and sell some and whatever so. i'm partial to like the muscle car area but I like the odd stuff like the AMCs and the javelins and like some of those things that are just like not run of the mill stuff yeah. That's awesome yeah it's I actually installed a lift in my house so that I could work on that yeah that I can work on. I know I literally I was thinking man like how boozy have I become that I'm like you know instead of using jack stands and hoping that this thing doesn't crush me that I'm now using a lift but I'd say you well man one of the best investments you can. It's a next saber because if you get under order do anything like it's like dad you know that's so funny yeah and then it's also really cool that you like some of the odds and ends that's I ended up grabbing. And McLaren 570 s for that exact reason because I never had a mid engine car before they look weird and I've never all of my",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 63,
      "start_timestamp": "00:47:48",
      "start_timestamp_seconds": 2868.6984126984125,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=2868"
    }
  },
  {
    "text": "that's so funny yeah and then it's also really cool that you like some of the odds and ends that's I ended up grabbing. And McLaren 570 s for that exact reason because I never had a mid engine car before they look weird and I've never all of my build cars have been manuals and I've never really had a automatic or paddle shift and I wanted to mess with that and it's interesting because the technology obviously in the newer cars is just wild so when you're thinking about building a. That new Corvette that what the when they just did like engine car like I got a chance to drive one of those that you know that like traveling thing that does like the drive like they go around a racetracks and you can. Drive like five cars side my wife got that for me a couple years ago I drove five cars I drove one of those Corvettes and it was insane because it has that dual clutch where like it's it right you don't even feel it and it's bananas and yeah I love so like those are all equally it's cool. I just get scared of any of those things because i'm like I can't fix that at all but like I can do a carburetor and like. Dude like dude. I the first thing I did when I got the McLaren was take it all apart I took pictures too just because I",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 63,
      "start_timestamp": "00:49:27",
      "start_timestamp_seconds": 2967.6190476190473,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=2967"
    }
  },
  {
    "text": "scared of any of those things because i'm like I can't fix that at all but like I can do a carburetor and like. Dude like dude. I the first thing I did when I got the McLaren was take it all apart I took pictures too just because I think it's novel to buy a super car and then literally just dismantle the whole thing so I but to your point I actually have been blown away with how straight forward a lot of the McLaren is it actually is a much more accessible engine bay and transmission than my Corvette does which is fascinating yeah absolutely fascinating it's not what I was expecting and it's also not what I saw on the C8s the C8s is a different beast man like that they packed in everything so. You want to change the bell you got to rip off the rear end dude I off yes that that becomes a massive massive project honestly you're never driven a never driven a McLaren but I've heard that they're pretty fine. So yeah they're really really cool they have electronic steering which is weird at first when you're driving one of those it's obviously you know completely different feedback mechanism so it feels like every you're feeling everything the first couple times you drive on it seems like you almost need an alignment or something that the steering wheel is so active but it's literally just the car picking up everything",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 63,
      "start_timestamp": "00:51:06",
      "start_timestamp_seconds": 3066.5396825396824,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=3066"
    }
  },
  {
    "text": "those it's obviously you know completely different feedback mechanism so it feels like every you're feeling everything the first couple times you drive on it seems like you almost need an alignment or something that the steering wheel is so active but it's literally just the car picking up everything on the road and then when you take it to a track all of a sudden it. It's not picking up all this random road noise and it's my cat but yeah it's a blast so I got a couple questions from folks that I'm going to relate to you one of them is from a dude named Tyler from X or Twitter whatever the clock I'm supposed to call it I don't know sorry daddy Elon just just let me know and he I think I know your answer to this already based on our conversation so far but it's a good question so they're asking what are you. What's your perspective on a mechanical income trading style versus opportunistic discretionary trading obviously different things but I thought interesting question for you. Yeah I think that I think you should have both right like there's I think there's there's a there's a universe where both workout really well I think the opportunistic discretionary thing is super tough because I feel like that's the hunter gatherer like mentality. I mean like even just like it would happen like last week right like so Roy and Kitty or whatever came back",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 63,
      "start_timestamp": "00:52:45",
      "start_timestamp_seconds": 3165.460317460317,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=3165"
    }
  },
  {
    "text": "a there's a universe where both workout really well I think the opportunistic discretionary thing is super tough because I feel like that's the hunter gatherer like mentality. I mean like even just like it would happen like last week right like so Roy and Kitty or whatever came back a GME was pumping like everyone's like ah this is our opportunity and pile into it now it's crashed again I don't know you know maybe it'll come back up but like unless you're there waiting for that and you and you don't even know when it's going to happen or how far it's going to move or whatever. Then you're kind of left holding the bag all the time like there has to be some component that needs to be more strategic right and if you want to do the opportunistic like Opportunity fund like keep some cash on hand for things that come up certainly you should do that you know like even the greatest you know investors of all time like Buffett keeps a ridiculous amount of cash on hand mostly for insurance but like he keeps cash on hand for the fact that like something could come up that he would want to you know like Hurtis and acquire and so I think you should have both I think that most of it should be like strategic mechanical trading that like just takes advantage of things that you want to trade Otherwise it seems like a",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 63,
      "start_timestamp": "00:54:24",
      "start_timestamp_seconds": 3264.3809523809527,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=3264"
    }
  },
  {
    "text": "come up that he would want to you know like Hurtis and acquire and so I think you should have both I think that most of it should be like strategic mechanical trading that like just takes advantage of things that you want to trade Otherwise it seems like a lot of chasing your tail if that yeah Yeah, I follow I also agree with you the way that I think about trading stuff like that is I have kind of two buckets the way I split out my portfolio I have what I call a core allocation and a speculative allocation so it actually falls very similar in line to what you're saying I also heard warm Buffett's latest statement and There are there annual shareholders meeting which is fascinating because somebody commented on literally the billions of dollars of cash they have And at one point he was just like you're the best response. He's like I don't think anybody knows what to do with a billion dollars like to invest He's like you know, he's like because we don't We literally we're just finding opportunities as they come up. Yeah, yeah, of course And if they if you did like I mean he's keeping a lot of cash on the end for insurance anyway for flow but like I don't know like what what would you yeah like there has to be something to it so and a big part of that he he brings up is",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 63,
      "start_timestamp": "00:56:03",
      "start_timestamp_seconds": 3363.301587301587,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=3363"
    }
  },
  {
    "text": "you did like I mean he's keeping a lot of cash on the end for insurance anyway for flow but like I don't know like what what would you yeah like there has to be something to it so and a big part of that he he brings up is kind of what a lot of retail traders I think take for granted and to be clear retail traders We don't have many advantages But one of them is the fact that we are small and we can just enter and exit things essentially at will what you mentioned before Whereas one of his comments was like Where do you go buy several billion dollars of something to make it a position that's meaningful enough for them to even bother putting it on And you essentially have liquidity where you're not bidding yourself up the whole time Yeah, so I was just an issue for sure. I think you know like in the same vein though I think that people can fall into the trap of thinking they should trade all the garbage and junk And they get railed by these widespread and it's like why are you trading that like is that the core position? Like because you're doing 50 in some no-name ticker with a dollar wide spread like You're going to get taken to the shed, you know, like there's I don't know There's something to be said yes about like he been at small But at",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 63,
      "start_timestamp": "00:57:42",
      "start_timestamp_seconds": 3462.222222222222,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=3462"
    }
  },
  {
    "text": "like is that the core position? Like because you're doing 50 in some no-name ticker with a dollar wide spread like You're going to get taken to the shed, you know, like there's I don't know There's something to be said yes about like he been at small But at the same time like you should probably be playing in the pools that are pretty liquid anyway So I think exactly to your point there too playing specifically in the pools that are relative to your size and I think that's another thing that I find with retail traders and I'm curious what you're seeing from your side Because you interact with them from a different perspective than I do where when I talk to traders about cost it seems like the vast majority don't actually understand the friction involved With trading and a lot of people will be like oh well my broker has no commissions and it's like okay Well, that's what you see on the front end but you understand Right that on the back end there is where you're actually getting filled at and there's where your order is getting routed to Those kinds of things and I find traders don't really grasp the concept of the friction involved What's your experience with your audience which obviously I imagine using bots that's got to be a big part of Trading considerations is to make sure that still it makes sense after friction Yeah, I think that",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 63,
      "start_timestamp": "00:59:21",
      "start_timestamp_seconds": 3561.142857142857,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=3561"
    }
  },
  {
    "text": "and I find traders don't really grasp the concept of the friction involved What's your experience with your audience which obviously I imagine using bots that's got to be a big part of Trading considerations is to make sure that still it makes sense after friction Yeah, I think that you know like thank god commissions have come down from where they were you know like dollars Yeah, it's just it was ridiculous and you know the funny part is is like now And I did this in a presentation in florida recently It's like we're gonna get to a place where like and it's even happening now like one broker charges for phones Like if you call and make a trade like it actually costs you a lot of money, you know And it's like wait like what that's customer service bit like they charge you money for it. So like I think commissions are gonna continue to compress Of course, and I think you see a lot of brokers who are at zero or near zero Now they all still make money on payment for water flow on the back You know like every one of them right or let's say 99 of the orders are payment for water flow that are that are filtered through citadel or whoever right And so I know that people know that that happens but because they don't see it right You don't they don't think it happens, but it happens and",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 63,
      "start_timestamp": "01:01:00",
      "start_timestamp_seconds": 3660.063492063492,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=3660"
    }
  },
  {
    "text": "or let's say 99 of the orders are payment for water flow that are that are filtered through citadel or whoever right And so I know that people know that that happens but because they don't see it right You don't they don't think it happens, but it happens and so that's where I say like If you're trading and you're trading in a 50 cent wide market Like so what you get free commissions like Just too wide, you know like you might as well be giving that up anyway because that's what you're doing like in an hour and so I think that's good. Yeah, good. Sorry. Just a question on that specifically because I like you I actually really enjoy teaching people and I just find it really fulfilling But this is one of those topics that I struggle to get people to see Because I think even if we frame it like that It still doesn't hit home and I don't know if you have a way to Like to help people see the actual impact that that has on a system I haven't found a good one. That's why I'm asking because I've tried to have this conversation with people on reddit And different pace and obviously reddit's always a blast because that is the Wild West But a lot of people just struggle to see this idea of you know Even bit-ask spread They don't understand that that is essentially a cost of them",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 63,
      "start_timestamp": "01:02:38",
      "start_timestamp_seconds": 3758.9841269841268,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=3758"
    }
  },
  {
    "text": "have this conversation with people on reddit And different pace and obviously reddit's always a blast because that is the Wild West But a lot of people just struggle to see this idea of you know Even bit-ask spread They don't understand that that is essentially a cost of them doing business. I'm just curious Have you found a successful way to get this across to people? You know one way we're trying right now because I agree and like I This has always been a thing that like A is hard to quantify anyway because you can see the bit-ask spread You can filter by bit-ask from you know things are tight, but then like Quantifying that and so one way that we have tried to do recently this is actually like in the last Two and a half weeks we published this now Like as part of our options liquidity ranking We calculate like a scalp on each contract and it basically Taking like the bit-ask spread and slippage of the stock times a hundred you know shares whatever and it tries to quantify it to like a number of like how much A potential market maker is scalping on the spread, you know for like for each of those contracts So if you look at like QQQ the scalp might be like one dollar and 36 cents and then you look at something like Costco Let me just pull up Costco and Costco scalp on each contract",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 63,
      "start_timestamp": "01:04:17",
      "start_timestamp_seconds": 3857.904761904762,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=3857"
    }
  },
  {
    "text": "scalping on the spread, you know for like for each of those contracts So if you look at like QQQ the scalp might be like one dollar and 36 cents and then you look at something like Costco Let me just pull up Costco and Costco scalp on each contract is and then again. There's just the way we're calculating it so May not be exactly obviously, but like um the the scalp on Costco is five dollars and 45 cents So that's how much you're losing just trading a contract of cost of now if you can make that up on the back end I mean by all means like you know knock it out apart But like a lot of people have really enjoyed that because they kind of filter and rank by that now And I think that that we're trying to like bring that more to like a ground zero Like this is the dollar amount that it's costing you to trade this just to even like just even look at it It's five bucks to get in you know, and I think if people understood that Their decisions would be better now on the complete opposite end to to tell you the truth right like you do get these people that are hardliners They're like I'm only trading SPY and only SPY and only QQQ and whatever It's like well, it's not good either like that's like drinking water all day and calling yourself healthy",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 63,
      "start_timestamp": "01:05:56",
      "start_timestamp_seconds": 3956.8253968253966,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=3956"
    }
  },
  {
    "text": "opposite end to to tell you the truth right like you do get these people that are hardliners They're like I'm only trading SPY and only SPY and only QQQ and whatever It's like well, it's not good either like that's like drinking water all day and calling yourself healthy Like it's just not like it's not gonna work, you know, so yeah, yeah, what what I tried to At least one I love that tool in that concept because I also think and I'm you guys are super fucking smart So I'm sure you're thinking about this or from a consumer standpoint if you put it in the sense of like this is what the market maker is making one It creates kind of this common enemy thing I know that's not necessarily what you're trying to do But it personalizes where the money is going because a lot of people I just think they don't grasp the movement of that capital Which is really I think a great way to frame it but The way I try to encourage and I don't know if there's anything you guys could ever integrate into your tools But I try to integrate for at least my audience in the way that I look at this stuff is the spread as a percentage of the price It just puts it on a relative basis right? So if you have something that is a good spread spy fine. Spide Cool, what is the",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 63,
      "start_timestamp": "01:07:35",
      "start_timestamp_seconds": 4055.746031746032,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=4055"
    }
  },
  {
    "text": "integrate for at least my audience in the way that I look at this stuff is the spread as a percentage of the price It just puts it on a relative basis right? So if you have something that is a good spread spy fine. Spide Cool, what is the percent spread on that individual option that you're looking at relative to the price and carry that over to other things Because that's what I do in a personal capacity But anyways just another idea for you guys Yeah, and we do that and the other thing that we Do also as we tried to like a fill percentage like how far do you have to move through the spread to actually get a fill like is it Are you like filled at 50 50 like is it 50 of the spread so like it's mostly filled at midpoint or do you have to move 75 of the way through the spread so now It's like okay like double quantifying it like the spread super wide plus like the average fill and because we can track and see all the fills right like we can run these numbers and metrics on all these all these tickers And see like oh these tickers like they fill most often at mid price whereas these tickers they fill usually towards the further extremes right And then you can say ah okay like now I know like maybe I should be focused or at",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 63,
      "start_timestamp": "01:09:14",
      "start_timestamp_seconds": 4154.666666666666,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=4154"
    }
  },
  {
    "text": "on all these all these tickers And see like oh these tickers like they fill most often at mid price whereas these tickers they fill usually towards the further extremes right And then you can say ah okay like now I know like maybe I should be focused or at least just know like having awareness Yeah, yeah, that's absolutely awesome Well another thing and I'm actually curious what you think about this you're probably closer to these Poppicks than I am but I'm still trying to figure out why spx moves at a nickel because I trade Espix all the time and That is insanely frustrating because I understood the origin of it, but I feel like that would be nice to change And listen, we have a petition going to try and change it. I don't think Oh, yeah, seriously, we've had a petition going for quite some time now It's the only product that really does that like on a mass scale right there's other products, but We've literally had conversations with the guys over there at Cebo and like we know like that they're just like look It is what it is and we've done that and you know, they're kind of like we wish we could change it too and like go back and I'm sure you guys It's so integrated now at that point that Yeah, I just don't under I mean, I understand why they do it. It's just like a sizing but",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 63,
      "start_timestamp": "01:10:53",
      "start_timestamp_seconds": 4253.587301587302,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=4253"
    }
  },
  {
    "text": "and you know, they're kind of like we wish we could change it too and like go back and I'm sure you guys It's so integrated now at that point that Yeah, I just don't under I mean, I understand why they do it. It's just like a sizing but yeah, it's in the s honestly Yeah, that one's yeah, that really gets the old go really pisses me off. I don't like that one Yeah, yeah us too. I mean like we don't even support spx because of it like it's the only ticker that would Literally break all of our algorithms that are built on like penny wide increments and penny wide order so I see yeah, that's actually another question from I think this one was from reddit, but they were asking if you guys are going to do a mobile app Yes, we are trying to hire a mobile app developer developer We almost had an acquisition higher and then they backed out at the last moment moment But yeah, we are like All-so-the-wall trying to figure out how to do a mobile app I think that it will be it'll be interesting because a lot of people I think will still want to Build bots purely on desktop right? So I think it will be something that the mobile app is going to be more of like a management You know database right where you can manage turn off turn on course enter positions and",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 63,
      "start_timestamp": "01:12:32",
      "start_timestamp_seconds": 4352.507936507936,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=4352"
    }
  },
  {
    "text": "of people I think will still want to Build bots purely on desktop right? So I think it will be something that the mobile app is going to be more of like a management You know database right where you can manage turn off turn on course enter positions and new trade ideas But the actual mechanics of building out bots and doing the decision trees and you know the flow of like if this then that Etc. I like that will probably still be on desktop because I just don't think you could fit it Intelligently into mobile app. So but yeah, we're trying to go down that path Yeah, it's it's interesting to to think about like the migration of that technology. I am a just So ignorant with all of it But I have a buddy that works on this stuff and he explains a lot of the migration of things from desktop interfaces to mobile app So yes Yeah, which is really because I think a lot of people they look at it is oh well you already have it just move it over And it's kind of like no you literally have to like essentially build it again you get to leverage a lot of it But yeah, yeah, we like we tried to do a lot of mobile first things on like the website anyway But like it really needs a true mobile app that like is mobile native so yeah, yeah, well cool",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 63,
      "start_timestamp": "01:14:11",
      "start_timestamp_seconds": 4451.428571428572,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=4451"
    }
  },
  {
    "text": "build it again you get to leverage a lot of it But yeah, yeah, we like we tried to do a lot of mobile first things on like the website anyway But like it really needs a true mobile app that like is mobile native so yeah, yeah, well cool Thanks for at least a little bit of details on that You mentioned a couple times that I want to key into we agree on a lot of things So I want to dive into something. I think we don't agree on um It sounds like you mentioned like a neutral focus in trading. Why neutral for you? Yeah, so I think there's this Let's see if I could pull it up I don't even know but I don't want to like go through like the presentation and share but like let me try to describe Because I think it might help out but If you got into a position and let's say you were bullish on like let's say you were bullish on the stock right and you sold a short put spread and And we we go under the assumption that like this is not your only position Right like you maybe want to have a couple positions call it three four positions whatever it is I believe that you should try to keep a new like be working towards a neutral stance And that's not because I think all your position should be neutral because I don't",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 63,
      "start_timestamp": "01:15:50",
      "start_timestamp_seconds": 4550.349206349206,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=4550"
    }
  },
  {
    "text": "Right like you maybe want to have a couple positions call it three four positions whatever it is I believe that you should try to keep a new like be working towards a neutral stance And that's not because I think all your position should be neutral because I don't But I think what you should be working towards is like a neutral non-directional stance because if you purely make money and like your strategies are set up to only make money in one direction That makes it increasingly hard or to make money in various market conditions So like what I try to do personally is like I don't care where the market goes because I will let my bots Adjust for if the market goes up I will let them self correct themselves adjust to sell Different strategies than other strategies and if the market goes down those self correct and sell other strategies versus others Because I just want to be continuously working towards neutral So again, so go start going back around real quick So if you sell a put spread and you're bullish on a stock But as soon as you sell that put spread the stock tanks right the natural income which usually happens Happens to everybody Really good analysis get the position 15 minutes later it's down So So now your your position is challenged right and so if you say like if you don't agree with the idea of Trying to work",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 63,
      "start_timestamp": "01:17:29",
      "start_timestamp_seconds": 4649.269841269841,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=4649"
    }
  },
  {
    "text": "the stock tanks right the natural income which usually happens Happens to everybody Really good analysis get the position 15 minutes later it's down So So now your your position is challenged right and so if you say like if you don't agree with the idea of Trying to work towards neutral then what you might do is you might sell another put spread right you might think to yourself Well like if I liked it at 150 right I'll love it at 50 right All like and mentality and then the stock continues to go down right so now you're in a position where you're digging yourself Deeper and deeper deeper into a hole and the thing that really kills traders is Running out of capital. Obviously like if you can't if you run out of capital you can't keep the lights on Digging yourself into a hole that's so deep that it's almost impossible to get out right we've all seen the charts of like if you lose 10 you got to make a left 12 11 to get back to square one whatever So like your goal is not to dig yourself into a insanely deep hole right And so if you're a trader and you have a bad sequence of trades Which is going to happen everybody where the market's just going to be irrational right yes, that's a good one Do you have it on your blog? Yeah, yeah It's that exact reason yeah loss",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 63,
      "start_timestamp": "01:19:08",
      "start_timestamp_seconds": 4748.190476190476,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=4748"
    }
  },
  {
    "text": "right And so if you're a trader and you have a bad sequence of trades Which is going to happen everybody where the market's just going to be irrational right yes, that's a good one Do you have it on your blog? Yeah, yeah It's that exact reason yeah loss recovery right exactly Yeah, like a 30 drawdown is get like that's tough but like manageable You lose 60 70 like good luck you like you're gonna be climbing that road again for another couple years And I just think people give up at that point So if you do that trade and then you do another trade and let's say you even do a third trade and you're like There's no way the market's going down So like I can't even hand it and then you start praying and then you start like you know doing say ounces and you start like You get to say yeah, yeah Doing everything right and you start doing that and then of course the stock continues to go And now you have this massive losing streak and you have this massive drawdown So the alternative view is to do things that are opposing generally opposing to where the the normal portfolio is balanced So if your portfolio is from the initial position is bullish right like that's your initial position Then the market goes down will like why not add a call spread now It's not going to change the fact that",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 63,
      "start_timestamp": "01:20:47",
      "start_timestamp_seconds": 4847.111111111111,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=4847"
    }
  },
  {
    "text": "opposing generally opposing to where the the normal portfolio is balanced So if your portfolio is from the initial position is bullish right like that's your initial position Then the market goes down will like why not add a call spread now It's not going to change the fact that you'll probably lose on the put spread But like don't dig yourself deeper into a hole So like now if you had a call spread and say converted to an iron condor to use very like a simple idea Now you've given yourself an opportunity not necessarily to like recover everything though Though maybe you can but now you're just not going to dig yourself into a hole like you're going to kind of work with where the market goes So the market goes down again, right another leg down. Well your call spread made money your put spread lost the same amount of money You're going to lose anyway now you sell another call spread right and the market goes down that again, right And now you have two call spreads that made money and those might have overcome the loss from the put spread At least you're you're back to square one right so the idea is like don't get yourself into a bad sequence of trades by just trading one directional If you can get to a level where you're working towards neutral that doesn't mean you have to be perfectly like it's impossible to be Delta",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 63,
      "start_timestamp": "01:22:26",
      "start_timestamp_seconds": 4946.031746031746,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=4946"
    }
  },
  {
    "text": "back to square one right so the idea is like don't get yourself into a bad sequence of trades by just trading one directional If you can get to a level where you're working towards neutral that doesn't mean you have to be perfectly like it's impossible to be Delta zero like it's just it's impossible because the markets move too fast like if you're Delta zero Your Delta zero for fraction of a second than the market moves and so If you're working towards neutral that's just having an understanding of like I have a crap ton of bullish positions Like even though maybe I really really like the market like the smart thing is to maybe get some bearish positions or remove some of those bullish positions So Interesting. Yeah, so it sounds almost like you're using like a beta weighted Deltas to then assess overall portfolio Disposition and then trying to offset slightly Yeah, and so you can do that so like we can do that you can do that inside of a bar You can do that with positions and so like my bots are set up to look at the beta exposure of the collective of positions that the bot has And then based on that beta exposure like if I'm bearish or bullish it will then add a position And sometimes it'll add a neutral position like if it's not too far out of bounds Like if my beta exposure is not insanely bullish",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 63,
      "start_timestamp": "01:24:04",
      "start_timestamp_seconds": 5044.952380952381,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=5044"
    }
  },
  {
    "text": "of positions that the bot has And then based on that beta exposure like if I'm bearish or bullish it will then add a position And sometimes it'll add a neutral position like if it's not too far out of bounds Like if my beta exposure is not insanely bullish not insanely bearish. Okay great grab a neutral really wide You know sweet position, but I just don't think people really think about that and they find themselves dug into a hole where they have 678 losses in a row when the market turns and they got unlucky And that's hard to recover for And you know the best part about that story is that as soon as they liquidate all of their losers The market Yes, yep good. Yeah, sounds exact That's why I don't even eat their burritos anymore. It's scarred me a lot It's so funny to me how universal some of these experiences are I have to go like you have to go that's why I feel I feel do feel bad for people who are trading right now in the sense of like There's a there's an overwhelming sense of like non like this completely risk of verse universe You know like vix was back under 12 today, right? And people I just feel like are insanely Leopard to one direction and it looked the perfect opportunity like I can see like some stats of like what people are doing Because they share bots and",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 63,
      "start_timestamp": "01:25:43",
      "start_timestamp_seconds": 5143.873015873016,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=5143"
    }
  },
  {
    "text": "risk of verse universe You know like vix was back under 12 today, right? And people I just feel like are insanely Leopard to one direction and it looked the perfect opportunity like I can see like some stats of like what people are doing Because they share bots and templates and stuff, but like I just I don't know I get this feeling like people are saying like I had a buddy talks me about a penny sock and I'm like oh my god We've got to be here we go Yeah, like you know like and he's like now they say it's going to like six dollars I'm like, oh we're close like always always love it when the good old they say love it when they say Yeah, he literally texted me last week. He's you know good for like family friend of ours like and he I don't think he Understands options or markets or whatever and he's so if he's thinking about penny stocks like we got to be close So that's awesome. Yeah, well, I mean it's really interesting just to hear the way you think about like broader portfolio theory It sounds it sounds like I always consider myself risk averse But it actually sounds like you might be slightly more risk averse than I am is You're kind of longed because and to be clear I typically maintain a relatively light book But I have a moderate compound annual growth rate so",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 63,
      "start_timestamp": "01:27:22",
      "start_timestamp_seconds": 5242.793650793651,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=5242"
    }
  },
  {
    "text": "sounds like I always consider myself risk averse But it actually sounds like you might be slightly more risk averse than I am is You're kind of longed because and to be clear I typically maintain a relatively light book But I have a moderate compound annual growth rate so from 2007 to 2023 I just ticked over a 26 compound annual growth rate. So it's solid and consistent But it's not like US investing championship level where I'm returning 300 percent But my approach has been it sounds like a little more risk open though than your approach might be It because if from my experience if you have positions that offset too much Then we've taken away our profit potential. So do you tend to set like a threshold where you're like if I have x number of beta weighted Delta's are just overall delta's I want to maintain a short flow of a percentage of that kind of like a That kind of thing. That's a challenge And that to be honest like that was a challenge and still to some degrees a challenge to a little bit with like bots because bots Can't do that to that certain like that level of degree like we can calculate like a beta exposure But like we don't know unless you look at them and you're like monitoring them if like you just added a position that maybe offset exactly another position Right, I see how you're like stomping",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 63,
      "start_timestamp": "01:29:01",
      "start_timestamp_seconds": 5341.714285714285,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=5341"
    }
  },
  {
    "text": "that certain like that level of degree like we can calculate like a beta exposure But like we don't know unless you look at them and you're like monitoring them if like you just added a position that maybe offset exactly another position Right, I see how you're like stomping on toes. So like we have some technology that's like avoid like leg stomping and identical positions or inverse positions and stuff But but there's a certain degree of like yeah, you don't want to just you know like sell a dollar and buy a dollar in the same thing Like you just wasted a bunch of time and effort and money. So I think that for me like my range is like a 1 beta exposure on like a 30-day basis So if I get like 1 out of bounds But that's just for me like where the market goes up and I lose 1 in 30 days like that's too far one directional So if I'm inside that range see that's enough exposure for me like but other people are insanely they're like 5 10 15 Like people have huge swings and like I've never been able to stomach that ever like again like my childhood was like wild swings Involatile like from my parents and their finances. There's no way I want to have that now. So it's funny You say that because that's actually a big part of why I consider at least the way that",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 63,
      "start_timestamp": "01:30:40",
      "start_timestamp_seconds": 5440.6349206349205,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=5440"
    }
  },
  {
    "text": "stomach that ever like again like my childhood was like wild swings Involatile like from my parents and their finances. There's no way I want to have that now. So it's funny You say that because that's actually a big part of why I consider at least the way that I trade also to be pretty risk of Versus because I grew up poor and I had a single mom that I'm actually taking care of now Though I always feel like the growth of capital is is quite literally like a livelihood necessity So it's interesting that you mentioned that because slightly different Genesis, but a similar output where I'm not looking for a 40 portfolio swing at this I think that I definitely Have a little bit more of caution to the downside not in terms of downside movement I actually make some of my best years during their markets But yeah, but definitely portfolio variance. So Interesting we're coming up on time here. You have a game that you have to get over to but I have to ask when you look over the next Call it three to five years of options markets We've both seen a bit of an evolution so far, right? So we've gone from standard Explorations to weekly's to daily's to zero DTE's that's moved over now to iwm Like we're seeing this progression of options markets When you look out over the next again three to five years something like that",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 63,
      "start_timestamp": "01:32:19",
      "start_timestamp_seconds": 5539.555555555556,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=5539"
    }
  },
  {
    "text": "a bit of an evolution so far, right? So we've gone from standard Explorations to weekly's to daily's to zero DTE's that's moved over now to iwm Like we're seeing this progression of options markets When you look out over the next again three to five years something like that What are some of the things that you expect to happen within the industry? I think that what you're seeing is you're seeing latency collapse, right? So like that's been a trend that's like continued. We're like things are priced so fast, right? And now you have This like This trend with the AI where it's not that AI is trading necessarily, but it's like what AI is doing two things that get traded So what was it a couple months ago that lift came out and there was a typo in their thing And the stock was up crazy from a typo, right? And you got to think like something read that and then made a decision And so that trend I think will accelerate where you're going to get like latency is Almost zero like so there's no room for a human to decipher things to certain degree So like what does that world look like now? We're like as a trader there's zero latency between information and like market movement, right? That looks like a really volatile world where people are moving in and out of securities very fast Again, like I said like if you want",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 63,
      "start_timestamp": "01:33:58",
      "start_timestamp_seconds": 5638.476190476191,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=5638"
    }
  },
  {
    "text": "So like what does that world look like now? We're like as a trader there's zero latency between information and like market movement, right? That looks like a really volatile world where people are moving in and out of securities very fast Again, like I said like if you want if you wanted to 20 years ago like move capital like it probably took a little bit of time Even now it probably takes some time like if you want to move brokerage accounts like that takes time If you want to get out of positions you got T plus three settlement like whatever That's going to collapse and like so when you're going to see is you're going to see people moving in and out of things faster Which means things are going to be way more volatile Probably than they've ever been right like we're going to get to a period where things are really volatile And so in that world you have to be like either a sitting there waiting for it or have something that sits there and waits for it And watches it for you because there's no latency and capital is moving faster And I do think that we will get to a place where we get a 24 hour Options market and that is in should be insanely scary for a lot of traders because Imagine how quickly an entire market can get pushed in the middle of the night I mean like",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 63,
      "start_timestamp": "01:35:37",
      "start_timestamp_seconds": 5737.396825396825,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=5737"
    }
  },
  {
    "text": "I do think that we will get to a place where we get a 24 hour Options market and that is in should be insanely scary for a lot of traders because Imagine how quickly an entire market can get pushed in the middle of the night I mean like look at GME like GME Somebody came back on Twitter and GME was up right like imagine what a real conglomerate of funds or bad actors or whatever good actors are just people could do to a security overnight while you're sleeping as the market's trading and you get A margin call notice in the middle of the night and you have to fund it by 9 a.m And you don't even know because you slept in and now they liquidate at the worst possible price and you're gone Like that world I believe is coming like I think it's going to be 24 hours 24 7 24 5 markets for options trading and that that's it That's a world that if you're not prepared for that. I think it's going to be There's going to be some bad stories It's interesting. I definitely see parts of that I think some of the counterpoint I would offer is we already have futures that trade most of the time And we're not necessarily seeing that kind of volatility But they're also way larger way more liquid so smaller individual stocks that might be trading like that I can absolutely see that",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 63,
      "start_timestamp": "01:37:16",
      "start_timestamp_seconds": 5836.31746031746,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=5836"
    }
  },
  {
    "text": "some of the counterpoint I would offer is we already have futures that trade most of the time And we're not necessarily seeing that kind of volatility But they're also way larger way more liquid so smaller individual stocks that might be trading like that I can absolutely see that Happening to so we'll have to see if it comes to fruition at the same time like You know like that time when like crude oil went negative Right like a physical crude oil went negative and you were getting paid to take crude oil because it was so crazy Like no one ever thought that was going to happen And so like that kind of stuff if that happens it could wipe out an entire generation of traders And so that's what I guess I'm like it's very interesting to have 24 hour markets But I think as we go and as markets start to evolve and become faster and things get read by AI and then they get traded like That's a really different world, you know, and I don't know Yeah, and I mean I especially agree with the the trading I'm Frames and windows like that does add a certain level of risk and complexity But I actually think your other point highlighting the integration of AI Again, it's such a buzzword now. I almost hate saying it But it's it is a thing man and it like you're talking about It's stupid and it's not",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 63,
      "start_timestamp": "01:38:55",
      "start_timestamp_seconds": 5935.2380952380945,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=5935"
    }
  },
  {
    "text": "does add a certain level of risk and complexity But I actually think your other point highlighting the integration of AI Again, it's such a buzzword now. I almost hate saying it But it's it is a thing man and it like you're talking about It's stupid and it's not like I Agreed something and but like one of our guys on our team is like wicked smart Rob He's like the smartest human I know honestly, and he put it the best way to me He's like AI is stupid because all it's really doing right now Is it's trying to predict the next word in a series of strings of words? And that's in like it's not right You know, so you could trick it to do anything you want to certainly do by priming it and so but it will get better Right like it'll start to figure out these things But if it can misread a like you know, 10 q like You've got problems first Yeah, man Well, I gotta say dude absolutely awesome to meet you a blast chatting I'll obviously throw a link to your website in the description below But is there anywhere else that you want people to be aware of to go check out? Yeah, you just check me out at option alpha. No, it was super fun man I appreciate it left all kind of traders and guys that like cars. We I feel like we need our own",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 63,
      "start_timestamp": "01:40:34",
      "start_timestamp_seconds": 6034.158730158731,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=6034"
    }
  },
  {
    "text": "anywhere else that you want people to be aware of to go check out? Yeah, you just check me out at option alpha. No, it was super fun man I appreciate it left all kind of traders and guys that like cars. We I feel like we need our own special place You know, man Well brother absolute blast time for you to run, but thanks everybody for hanging out and then we'll see you guys on the next one",
    "metadata": {
      "video_id": "l5k56cSP-Bs",
      "title": "Options Alpha Founder - Kirk Du Plessis | The Outlier Podcast Ep65",
      "url": "https://www.youtube.com/watch?v=l5k56cSP-Bs",
      "upload_date": "",
      "duration": 3634.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 63,
      "start_timestamp": "01:42:13",
      "start_timestamp_seconds": 6133.079365079365,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=l5k56cSP-Bs&t=6133"
    }
  }
]