[
  {
    "text": "How do you turn 110,000 into 1.8 million? The answer is simple. You be Nancy Pelosi's husband because that's what they just did on a handful of text stocks. They're doing great. The problem is the system is broken. I had tighter compliance restrictions when I was a consultant for Deloitte, working on decks on a very small business segment for them than the speaker of the house who influences the movement of bills that directly interfaces with single holdings in her portfolio, case and point in video. Last month, they established a position in a video. And now this month, they're talking about the chips bill, which overall I like the chips bill increases domestic production of chips in the US, like that, but big problem with her being able to have an individual position and something like that. It shouldn't be the case. The conflict of interest erodes confidence and that's the issue I have with it.",
    "metadata": {
      "video_id": "L_zg0TfyKjg",
      "title": "Turn $110K to $1.8M JUST LIKE NANCY PELOSI! #shorts",
      "url": "https://www.youtube.com/watch?v=L_zg0TfyKjg",
      "upload_date": "2022-07-15T23:29:05Z",
      "duration": "PT59S",
      "channel_name": "",
      "description": "Follow on Twitter for News and Trades.  @esInvests \nJoin the Weekly Launch Newsletter.  https://www.esinvests.com/contact\nReach out with any Questions or Topic.  erik@esinvests.com\nJoin the esInvests Outlier Dojo on Discord.  https://discord.gg/hYGZUEJpve\nWebsite.  https://www.esinvests.com\n\n#Trading #options #nancypelosi \n\nThe stock market is a great tool in our approach to developing wealth. I started investing at 16 and have been actively trading for 15+ years. I don't come from money and am nothing special - yet I still made my first million before I was 30. \n\nI share my approach to trading and wealth development without the BS. I cover things like investing basics, options trading, portfolio management, trading psychology, real estate and angel investing, and my first hand experience in creating wealth. I regularly provide updates on the markets and my trades as well as host guests that share their respective perspectives and expertise. Welcome to the Outliers!\n\nI am not a financial advisor. All content is shared for educational and entertainment purposes only.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 1,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=L_zg0TfyKjg&t=0"
    }
  }
]