[
  {
    "text": "What's up everybody Eric here I am back with you in and we have a lot to talk about so first off welcome back to the channel it's good to hear some of the things you're looking at and it's also good to see that you're still drinking your seltzer waters like we were talking about I'm on grapefruit tonight and it looks like what you're on some sort of tangent rain is that orange. The fact that I have to look tells you how strong the flavor is there apricot apricot okay that's a yep that sounds like a lacroy style flavor. That's what we got the one. Well welcome back thanks for joining us again. No problem. So we were talking a little bit throughout the past couple weeks and you mentioned that things got a little bit busy and the cryptocurrency market especially with everything that we've been seeing going on so I would love to start the dialogue there with you know obviously we have the collapse of FTX and then we're starting to see some of these dominoes falling what are you seeing in the cryptocurrency space and how is it impacting you day today. It's not directly impacting me. It's pretty clear that people are just pulling back I mean people are basically hunkering down going into their shells you know curling up like armadillos whatever you want whatever animal reference you want to bring out right no one really knows what's going on",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 55,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=0"
    }
  },
  {
    "text": "It's not directly impacting me. It's pretty clear that people are just pulling back I mean people are basically hunkering down going into their shells you know curling up like armadillos whatever you want whatever animal reference you want to bring out right no one really knows what's going on and I think. I think people think they're overreacting on the other hand when FTX collapsed it went very quickly from there is no problem to it's a technical problem to they have it liquidity problem to. They're bankrupt to they're all complete criminals so the narrative has changed dramatically and I change so quickly that I think now people are. Just so I know people have pulled out of you know the safest exchanges like gone completely back and pulled all their money back to a US bank in US dollars completely out of the space so that's sort of where everyone is now volatility in the. In the major coins sort of dropped back a lot in the last couple of days I mean it's almost back to pre FTX levels now so I think probably people are assuming that certainly Bitcoin and Ethereum are now. Kind of can survive independent of this kind of thing. And are the only things with any options on them anyway. Yeah I'm actually looking at Bitcoin right now and as you point out it looks like what on the 9th is when ivy spiked and it's essentially been coming down since",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 55,
      "start_timestamp": "00:01:04",
      "start_timestamp_seconds": 64.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=64"
    }
  },
  {
    "text": "can survive independent of this kind of thing. And are the only things with any options on them anyway. Yeah I'm actually looking at Bitcoin right now and as you point out it looks like what on the 9th is when ivy spiked and it's essentially been coming down since and it actually looks like it's inverted below the 30 day trend for real. So I think that's actually kind of fascinating if I didn't look at that before you said that and that surprises me why is that so low I don't get that or were we just expecting this to draw out longer and well I mean. Realize I mean the reason I these low is just it's not really moving like crypto pre FTX had basically been sitting around you know between 18,000 and 19,000 forever. And so the fact that the volume was as low as I'd ever seen it like one day vol was you know trading in the 30s you know so the fact now I think 7 day vol last I looked at it was in the 60s or something so it's low but it's not ridiculously low. It's basically the FTX shocks gone away and we're just back to where we we've always been and no one's really projecting that that's going to cause a major problem in those coins I mean those coins exist independently of FTX to me the problem with FTX isn't in the cash crypto space it's in",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 55,
      "start_timestamp": "00:02:25",
      "start_timestamp_seconds": 145.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=145"
    }
  },
  {
    "text": "gone away and we're just back to where we we've always been and no one's really projecting that that's going to cause a major problem in those coins I mean those coins exist independently of FTX to me the problem with FTX isn't in the cash crypto space it's in all the derivatives. Like I think that it really diminishes the liquidity and all of the purpose and so forth because now you just really left with Binance. Yeah and I actually was talking with a buddy of mine who banks with Binance and he was saying that a while ago they instituted like a thousand a day with draw limit or something like that I don't bank with Binance so I have no idea I couldn't speak to it intelligently he just shared that with me and that actually surprised me a little bit. Have you heard of anything like that I'm just curious from like a I look you yeah, Clokey will side I have not. I have a lot of different tiers depending on your volume and got it so I'm pretty doubtful that if you're you know throwing millions of dollars through their day they're putting a thousand dollar limit on you. But I have no idea about that I don't really want to speculate sure yeah I think that makes sense so. Just talking real quick about the collapse of FTX you brought up a couple interesting points before we started recording one of which",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 55,
      "start_timestamp": "00:03:32",
      "start_timestamp_seconds": 212.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=212"
    }
  },
  {
    "text": "a thousand dollar limit on you. But I have no idea about that I don't really want to speculate sure yeah I think that makes sense so. Just talking real quick about the collapse of FTX you brought up a couple interesting points before we started recording one of which was just trying to like understand how this even happened and you were sharing some context around that. And I would like to hear your thoughts on again it's difficult to conceive but what's your best take on like what actually happened with FTX for them to implode over the course of a few days. Well the actual implosion was very heavily driven by a crush like the reverse squeeze on FTX because basically they'd collateralized all of their loans with FTX they were the major holders of it and then that was just pushed massively against them so that's sort of the mechanics of it it's sort of like there's a run on a stock. You know it's very similar to when something like Lehman or best earns broke in that case and I think people made the mistake of thinking that FTX was an exchange in the way that I don't know the CBO is. And people are like I can't believe they're doing this with customers money and the CBO we wouldn't but FTX wasn't an exchange in that sense they called themselves that but they were really so and everyone knew that they were intertwined with",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 55,
      "start_timestamp": "00:04:31",
      "start_timestamp_seconds": 271.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=271"
    }
  },
  {
    "text": "that I don't know the CBO is. And people are like I can't believe they're doing this with customers money and the CBO we wouldn't but FTX wasn't an exchange in that sense they called themselves that but they were really so and everyone knew that they were intertwined with our made it. So yeah FTX took customers money gave it to our made it and our made it traded with it. That's called a bank like banks do that all the time so the problem is that people thought it was more of a perception thing people were horrified to find out FTX was doing this. Whereas I think most people in the industry kind of we knew that anyway that wasn't the problem the problem was that our made it was somehow managing to lose time. And everyone thought our made it was making tons of money so that's the mystery how you manage to lose all that money trading. It's not really easier to lose money trading than it is to make it. Because if you know a way to lose money well you know what just take the other side and you're great. I kind of think that the only way you're guaranteed to lose money trading is crossing bit-asks spread, wrecking up costs. That's the only asymmetry between profitable strategy and the opposite losing strategy. And I kind of think that our made it were making prices that were too tight in FTX. So they",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 55,
      "start_timestamp": "00:05:41",
      "start_timestamp_seconds": 341.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=341"
    }
  },
  {
    "text": "think that the only way you're guaranteed to lose money trading is crossing bit-asks spread, wrecking up costs. That's the only asymmetry between profitable strategy and the opposite losing strategy. And I kind of think that our made it were making prices that were too tight in FTX. So they were artificially giving liquidity to FTX at the expense of not a big enough bit-asks spread. And I have no idea if that's true. But that essentially every time they traded they're losing money because their spreads were wrong. That would explain how they managed to lose a lot. It doesn't explain how much that they lost 8 billion or whatever. But that would be a guaranteed way to lose. It's also that's a little bit with... I know a lot of people who had very simple stand-up strategies that were working on FTX. Really simple ones. And like the sort of things that would work in the equity markets 15 years ago. And everyone was just explaining away their success by saying these markets are just inefficient. There's a lot of dumb retail money just pushing things out of line. But they weren't making money on Binance doing exactly the same thing. Which leads me to believe there was a structural inefficiency that Almeida was putting into FTX that was messing things up. And that's the only reason they were making money. They were essentially making money because Almeida was giving the money on every trade. Because these guys...",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 55,
      "start_timestamp": "00:07:01",
      "start_timestamp_seconds": 421.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=421"
    }
  },
  {
    "text": "the same thing. Which leads me to believe there was a structural inefficiency that Almeida was putting into FTX that was messing things up. And that's the only reason they were making money. They were essentially making money because Almeida was giving the money on every trade. Because these guys... I mean now they're running the same strategy on Binance. And it wasn't working before FTX blew up either. Kind of obvious now why that might be. Interesting. I actually hadn't thought about that myself. I'd drawn that parallel. The other thing from a structural standpoint I'd like your perspective on is... It seems like there would be some sort of... Well, I mean, understatement of the century. But it does seem like there would be some sort of risk management that essentially would serve as like a circuit breaker within FTX. That if they gained too much exposure to a certain thing that it would be hedged off in some way. Was that just not possible for them? I'm not too familiar with why that wouldn't have been the case and why that kind of catastrophic loss would have been possible without extreme leverage. Which that doesn't necessarily seem like the case here. If what I've said was true and I honestly I have no idea it is right. Everyone's just speculating at this point and I've got no inside information here. So I certainly don't know. If what I said is true, what you were saying is like",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 55,
      "start_timestamp": "00:08:25",
      "start_timestamp_seconds": 505.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=505"
    }
  },
  {
    "text": "like the case here. If what I've said was true and I honestly I have no idea it is right. Everyone's just speculating at this point and I've got no inside information here. So I certainly don't know. If what I said is true, what you were saying is like beside the point. Because they would deliver... They were doing this on purpose. It wasn't loss making. It was a business plan. So yeah, risk management manager could have come in and said don't quote these prices too tight because you're losing money. And they're like, we know we are. It's a loss leader. It's exactly the same, you know, that retouched stores advertise TVs for 50 bucks. So people come in the door. If that was the plan, it wasn't a failure of risk management. It was a failure of business plan. So I think that's where risk management wouldn't have helped. Got it. I guess the way that I was thinking about it is like if you're running that kind of promotion, let's say, right? Like the 50 to get somebody in the door that you would let it run for a period of time until you stop it and say like this isn't working anymore. But it seems like that's like you're saying that point is besides the point given the context of this scenario. Honestly, I've got no idea. I mean, you would think that there's a lot of weird stuff going on here, right? Personally,",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 55,
      "start_timestamp": "00:09:38",
      "start_timestamp_seconds": 578.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=578"
    }
  },
  {
    "text": "it and say like this isn't working anymore. But it seems like that's like you're saying that point is besides the point given the context of this scenario. Honestly, I've got no idea. I mean, you would think that there's a lot of weird stuff going on here, right? Personally, if I made a billion dollars, I wouldn't still be betting everything. You know, there's a lot of stuff he said beforehand that now makes people go, yeah, we should have seen this coming. Like he talked about having linear utility function and only being interested in the expected value of bets. Which is insane, right? Because if you've got a billion dollars, you're not prepared to bet everything on a 51 coin. But if you've got a dollar, you might because it's like whether you believe economics or not in any sense, the idea of diminishing marginal utility makes a lot of sense. You know, a billion dollars, the extra dollar to that person means nothing, whereas to a homeless person, it means everything. So I don't know, who knows? I mean, there was a lot of... When everything's done badly, it's difficult to pin the blame on one thing. You know, and if it was simply a matter of criminal behavior, then that's a... I mean, people for a long time tried to explain away burning made-offs issues in lots of ways about the structure of the market and how there was insider trading and blah, blah, blah.",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 55,
      "start_timestamp": "00:10:44",
      "start_timestamp_seconds": 644.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=644"
    }
  },
  {
    "text": "thing. You know, and if it was simply a matter of criminal behavior, then that's a... I mean, people for a long time tried to explain away burning made-offs issues in lots of ways about the structure of the market and how there was insider trading and blah, blah, blah. Turns out there was no trading at all. You know, so no one ever said that before they knew that. So we might find it if DX, I mean, who knows? Maybe he was funding a private army in the Soto or something. It could be almost anything. Yeah, it's... I was recently re-listening to the psychology of money. I'm not sure if you ever read that book. It's interesting in some parts, it's very simple, but one of the things I like about that book though is it talks about the concepts of luck and risk and how two people with a similar skill set can essentially see two different outcomes based on luck and risk. And one of the other things it talked about that seems like it applies to this scenario is the idea that there are some people where there is no enough, right? Like to your point, if you had a billion dollars, you might not risk it all all the time, you know, to make whatever you're trying to make. But the point of the book is saying for some people, it's just not enough, which is very similar to that made-off case, right?",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 55,
      "start_timestamp": "00:12:02",
      "start_timestamp_seconds": 722.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=722"
    }
  },
  {
    "text": "your point, if you had a billion dollars, you might not risk it all all the time, you know, to make whatever you're trying to make. But the point of the book is saying for some people, it's just not enough, which is very similar to that made-off case, right? Because he was actually very successful. Well, before he started swindling people, he had a really good return and he was very wealthy, but it just wasn't enough for him. Do you think when this kind of scenario happens in the crypto space, does it set cryptocurrency back in terms of its perceived legitimacy in the broader economy and the broader markets? I'm curious from a larger standpoint, this kind of failure, what can you glean from it in terms of the impact on the crypto space? Well, I would expect that it would have to. Here's the issue with crypto stepping back even further. It has no role in the broader economy. I mean, to say Bitcoin as a currency, really, go and spend Bitcoin. Go and actually try and use it anywhere. You can put money into offshore bookies with Bitcoin, but you know, you can't spend it anywhere. It's not a currency in any normally accepted term. The whole space is built on the idea of speculation. Basically, it's like, look, if every fantasy football company went bankrupt tomorrow, do you think people would stop playing fantasy football? Probably. No one's going to be playing daily fantasy",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 55,
      "start_timestamp": "00:13:10",
      "start_timestamp_seconds": 790.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=790"
    }
  },
  {
    "text": "anywhere. It's not a currency in any normally accepted term. The whole space is built on the idea of speculation. Basically, it's like, look, if every fantasy football company went bankrupt tomorrow, do you think people would stop playing fantasy football? Probably. No one's going to be playing daily fantasy if they find out the whole thing was a scam. I think that's where we are with crypto now as well. I think the idea of funding a company with a coin offering, I think that's gone out of fashion. And remember, in finance, fashions happen very quickly like that. When was the last time you saw anyone excited about a spack offer in, but two years ago, spacks were all the rage. So crypto definitely ballooned very quickly. I think it's, I'd be very surprised if it came back to these levels for decades. If it does at all. I've never really been a, I've never really been a believer in crypto. I mean, I believe it exists. It was like anything else that moves around. So, you know, I'll trade it. I'll buy it when it goes down sell it when it goes up. But I mean, the whole thing was as far as I'm concerned as fictional nonsense. Yeah, I echo that to some degree, I think that there's a potential use case for it. And actually the part that I find fascinating about cryptocurrency is not even the cryptocurrencies itself, but actually just blockchain technology and",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 55,
      "start_timestamp": "00:14:16",
      "start_timestamp_seconds": 856.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=856"
    }
  },
  {
    "text": "whole thing was as far as I'm concerned as fictional nonsense. Yeah, I echo that to some degree, I think that there's a potential use case for it. And actually the part that I find fascinating about cryptocurrency is not even the cryptocurrencies itself, but actually just blockchain technology and like what that can impact. I do think blockchain is very interesting to me. But to your point, and I really do agree with you cryptocurrency. It seems to have so far just really struggled. A lot of people are saying, well, it's going to replace gold hard to make that case. People are saying, you know, if there's counter party risk, then it's not a good currency. It's hard to make that case with cryptocurrency. So it seems like a lot of the, I don't know, main themes that people talk about with cryptocurrency don't necessarily seem to hold up. Longer term. So I think the idea of using coins as an offering instead of using equity gave a lot of startups a way of coming to market much quicker. But the reason they could do that is because there was no regulation. So see what this is. And there's a whole bunch of things to unpack here. There's a big problem with the whole crypto and defy space in particular where you've got the tech bros for better word. And it's very important to have a lot of people, and it's very important to have a lot of",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 55,
      "start_timestamp": "00:15:29",
      "start_timestamp_seconds": 929.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=929"
    }
  },
  {
    "text": "there's a whole bunch of things to unpack here. There's a big problem with the whole crypto and defy space in particular where you've got the tech bros for better word. And it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important So, go into a completely deregulated space What do you think was going to happen? What do you think was going to happen? What do you think was going to happen? What do you think",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 55,
      "start_timestamp": "00:16:47",
      "start_timestamp_seconds": 1007.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1007"
    }
  },
  {
    "text": "people, and it's very important to have a lot of people, and it's very important So, go into a completely deregulated space What do you think was going to happen? What do you think was going to happen? What do you think was going to happen? What do you think was going to happen? What do you think was going to happen? What do you think was going to happen? What do things would bring you back back again? What would you think was going to happen? And it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to have a lot of people, and it's very important to get that reason. Well I also can't help but get a kick! You know, one of the big things that people talk about with cryptocurrency is Although obviously the transactions are all tracked on the blockchain chain, you can find them all. But now they're saying for FTX as part of the chapter 11 that essentially everybody's information might essentially be released as part of that. You know, if you've made a deposit or a withdrawal, like that information is going to get bucketed in with it. So",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 55,
      "start_timestamp": "00:16:57",
      "start_timestamp_seconds": 1017.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1017"
    }
  },
  {
    "text": "can find them all. But now they're saying for FTX as part of the chapter 11 that essentially everybody's information might essentially be released as part of that. You know, if you've made a deposit or a withdrawal, like that information is going to get bucketed in with it. So to me, I just look at one of the other proposed use cases of cryptocurrency being anonymity a little bit of separation from transactions. And it seems like even that is starting to to fall away. It's not to the same degree. Obviously, he's using a credit card. But still the fact that, you know, you were supposedly able to make transactions that are very difficult to trace. Yeah. A day after this happened, people were looking at FTX addresses and saying this is happening on ethoscan and people were tracking it in real time. And I mean, one of the other big arguments is that people then were saying against the exchanges is, you know, everyone's, well, it's not your currency. If it's not your keys, you've got a self-custody. Yeah, we did that as well, you know, that was called money. That's if I had cash, I am literally self-custodying. We used to have stock certificates and bearer bonds. And people got rid of them for a very good reason. Because if I know you've got them, I can come to your house and hold you up and take them off you. That's the same as, oh, your",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 55,
      "start_timestamp": "00:17:57",
      "start_timestamp_seconds": 1077.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1077"
    }
  },
  {
    "text": "literally self-custodying. We used to have stock certificates and bearer bonds. And people got rid of them for a very good reason. Because if I know you've got them, I can come to your house and hold you up and take them off you. That's the same as, oh, your self-custodying. Great. I'll just come and hold a gun at your head until you give me the key. It's like, we did that and we decided that banks were a better idea. So again, it's kind of reinventing the wheel. Well, it's not even reinventing the wheel. It's forgetting that we had a thing called the wheel and then saying, wouldn't it be great if we had a wheel and then inventing a worse one? So there may be things the blockchain can do. But I mean, this is sort of like the early days of the internet when people were like, do we really need this to be on the web? Although, you know, my fridge is on the web now. So who knows? Do I do I need an app to interact with my fridge? I mean, the only way I need to interact with my fridge is when I open it. And I can't do that with an app like from up here. So anyway, I'm just going to sound old. But I think, yeah, there's a disconnect and there always is between tick evangelists and what's actually needed in the world. It's so funny. You say",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 55,
      "start_timestamp": "00:18:59",
      "start_timestamp_seconds": 1139.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1139"
    }
  },
  {
    "text": "when I open it. And I can't do that with an app like from up here. So anyway, I'm just going to sound old. But I think, yeah, there's a disconnect and there always is between tick evangelists and what's actually needed in the world. It's so funny. You say that. I made a tweet the other day because I forgot what I was looking for online. And I came across like a electronic dog collar. That was like a smart dog collar with like an app and all this stuff, which I get it for some people that might make sense. But for me, I chuckled at it because like, I don't even have a collar on my dog. I just watch my dog and train my dog not to run away. And then that's it. He doesn't know collar, let alone a smartphone attached to his neck. So it's interesting to see like you're kind of alluding to in a more your scenario makes a lot more sense where it's technology for just the sake of it, it seems. Right. It's like, yeah, we can do this like out. We I'll be great. Hopefully. Yeah, no, but we see it all the time. Right. It's like people, you know, you have electric door handles on your car. We had door handles that worked fine and they actually worked better because if your battery failed, you could so open the door. Right. You know, or it's that kind of",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 55,
      "start_timestamp": "00:20:05",
      "start_timestamp_seconds": 1205.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1205"
    }
  },
  {
    "text": "see it all the time. Right. It's like people, you know, you have electric door handles on your car. We had door handles that worked fine and they actually worked better because if your battery failed, you could so open the door. Right. You know, or it's that kind of thing. Or if you if you break a mirror now on your car, it's a thousand bucks to get it fixed because it's full of sensors. Whereas it used to be a mirror was like 20 bucks. And you broke it. Who cares? You just go to the record. You're out and get another one. So it's like you said, it's like, look, I'm not saying cars now are way better than they were 30 years ago. Way better. Right. On a cold day, you don't have to wonder if your car will start. Course it'll start. But a lot of these little things are literally, you know, there are solutions to problems that aren't there. Anyway, this has just been complaining now because it's been a long week. Well, it's interesting though to hear about the crypto space. So thank you for sharing some of your thoughts around that. Now, dovetailing us back to your heart and soul. And it's actually probably not even really your heart and soul. I'm just calling it that is options and derivatives in equity markets and other markets. We had a couple of conversation points that you sent over. And like I was",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 55,
      "start_timestamp": "00:21:05",
      "start_timestamp_seconds": 1265.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1265"
    }
  },
  {
    "text": "Now, dovetailing us back to your heart and soul. And it's actually probably not even really your heart and soul. I'm just calling it that is options and derivatives in equity markets and other markets. We had a couple of conversation points that you sent over. And like I was telling you before we started, there was a couple of these that I want to hit because I think they're really important. I've heard you talk about them before and then there's some of these that are new to me. And I want to talk about one of those because I think they're interesting. So the first one in here that stands out to me that I haven't heard yet is getting the trilogy backwards. And it's an interesting concept to me, but I'd like to get your thoughts on what that means. Not not being funny, but I don't know what that means. Because I'm not sure what do you have any other context for what that where that came from? It's on the bullet pointed list that you sent over and trilogies and air quotes. That's the context I got for you. Okay. Oh yeah, okay. I can kind of okay. So there are three things you need to do a trade successfully. Okay. And when I say trade, I don't I mean individual trade or a trading strategy. You need an edge. You need a statistically valid reason that you should make money from this trade. So",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 55,
      "start_timestamp": "00:22:06",
      "start_timestamp_seconds": 1326.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1326"
    }
  },
  {
    "text": "kind of okay. So there are three things you need to do a trade successfully. Okay. And when I say trade, I don't I mean individual trade or a trading strategy. You need an edge. You need a statistically valid reason that you should make money from this trade. So you need a loaded coin. That is the most important thing. That's the first thing. The second thing is based on that edge, you need risk control. And that means largely sizing that individual trade correctly, putting that trade in the context of a portfolio. Then you need to have the psychological tools in place to persist with that trade if things are going badly. What a lot of people decide though is that those three things should happen in the opposite order. And you'll see things like this where people like the most important thing is discipline. Okay. You get paid for doing difficult things. Finding an edge is difficult. Being disciplined isn't difficult. Being disciplined is something any adult should be able to do. You don't get paid because you turned up for work today. Like you're meant to turn up for work today. Something like I couldn't trade. I had traders block. It was like, I mean, how do you get rid of that? And I'm like, you don't. You just act like an adult. You don't get traders block in any more way than the mechanic gets mechanics block. I can't work on the car today.",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 55,
      "start_timestamp": "00:23:04",
      "start_timestamp_seconds": 1384.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1384"
    }
  },
  {
    "text": "trade. I had traders block. It was like, I mean, how do you get rid of that? And I'm like, you don't. You just act like an adult. You don't get traders block in any more way than the mechanic gets mechanics block. I can't work on the car today. I'm just not feeling it. Just, I mean, you do it because it's your job. So I'm not saying psychological problems aren't possibly an issue, but they're never the main issue. Furthermore, the people who say that don't act as though they believe it. See, if you really thought your psychological problems were the issue, you would just decide to give yourself a stern talking to in the morning like today. I'm really going to concentrate hard. No, if you really thought you had a real psychological problem holding you back, you'd get real help from a psychologist. And there are psychologists who specialise in trading or more specialised in sports, which is a similar sort of carryover. I mean, if that was the issue and you really worked on it like that, I'd have a little bit more tolerance for it, but it's still not the most important thing. Risk is a little bit similar. It's a little more technical, but again, risk management is actually kinder easy. Certainly for an individual trader, I'm not saying if you're the risk manager at Goldman Sachs or whatever it's easy, because then it's very, you've just got a very complicated organisation",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 55,
      "start_timestamp": "00:24:27",
      "start_timestamp_seconds": 1467.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1467"
    }
  },
  {
    "text": "Risk is a little bit similar. It's a little more technical, but again, risk management is actually kinder easy. Certainly for an individual trader, I'm not saying if you're the risk manager at Goldman Sachs or whatever it's easy, because then it's very, you've just got a very complicated organisation there. But for an individual trade, like an individual options trade, risk is really easy. Oh, you sold a Sprattle? Yeah, why don't you buy some two Delta puts? Done. That's your risk control. And it's like, there's no magic to it. It's like market risk is usually trivial to handle. So because it's trivial, you don't get paid for that either. There's no magic to not taking stupid bets. So you get paid for the hard stuff and finding the edge is the hard thing. So I think they're exactly the wrong order. And I think some people like to think of it the wrong way round because it kind of makes them think that what they're doing is work, whereas what they're really doing is avoiding work. But they're like, had a great day to day, concentrated hard. I was disciplined. It's like, I don't know, the person that McDonald's who has to deal with drunk people at night, he's disciplined. He didn't throw anything at a customer. But he doesn't expect to make million dollars a year. Right. And so I hate people, man. I really hate people. I don't blame you. And that just got me",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 55,
      "start_timestamp": "00:25:36",
      "start_timestamp_seconds": 1536.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1536"
    }
  },
  {
    "text": "that McDonald's who has to deal with drunk people at night, he's disciplined. He didn't throw anything at a customer. But he doesn't expect to make million dollars a year. Right. And so I hate people, man. I really hate people. I don't blame you. And that just got me to the point where people are so dumb. Well, I also feel like you're hitting on another really important aspect because and I noticed this transitioning from the military, especially as it pertains to discipline, where it's like people feel like if they're disciplined, they're then entitled to something. And the way I've always thought about it is you being disciplined gives you an avenue to successfully pursue something. But it doesn't entitle us to anything. Just like, you know, I think we've talked about it before. But I also feel like a lot of people that do eventually take the time to write out a trading plan, whether it's, you know, good, bad or indifferent, they feel like once they finish writing it out, that they should now be successful because they've put in the work to write a trading plan. And a lot of times what I'll say is you, you could write an awful trading plan. That just writing one down doesn't mean that it's now profitable, even though you're saying you put it actually get there. It's worse than that. Because if you're a very disciplined trader who does a stupid trade in a disciplined way,",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 55,
      "start_timestamp": "00:26:50",
      "start_timestamp_seconds": 1610.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1610"
    }
  },
  {
    "text": "is you, you could write an awful trading plan. That just writing one down doesn't mean that it's now profitable, even though you're saying you put it actually get there. It's worse than that. Because if you're a very disciplined trader who does a stupid trade in a disciplined way, you're going to lose a lot more money than the guy who's not disciplined, there only does it once a week. It's like, you have to be disciplined in carrying out, like you say, a good plan. And it's like, it's a lot of things people think are qualities on their own, are really only qualities in the context of something else. Like a tough boxer is just going to get beaten up for longer, unless they're good. If you're good, and you're tough, that's great. You can take a punch and you can still win the fight. But if all you are is tough, you're just going to stand there and get beaten up for 12 rounds. So again, it's like it's in the context of being good. Then it's a good thing. And it's like confidence, right? You want to be confident because you are good at something. You don't expect to be good at something because you're confident. That's delusional. It's not confidence. Yeah. Yeah. I think in speaking of that confidence, this actually leads to a nice dovetail that I wanted to touch on with you is I do think it's pretty common for new options",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 55,
      "start_timestamp": "00:27:59",
      "start_timestamp_seconds": 1679.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1679"
    }
  },
  {
    "text": "You don't expect to be good at something because you're confident. That's delusional. It's not confidence. Yeah. Yeah. I think in speaking of that confidence, this actually leads to a nice dovetail that I wanted to touch on with you is I do think it's pretty common for new options traders, you know, when they find options and they start trading options, I get the sense that a lot of them feel like because they're trading options, they've now found an edge because they're not trading equity. So to your point, a lot of them feel like I put in all this work to learn what options are, how they work, what the Greeks are, so I should have an edge. And I think you and I are both probably of a similar opinion. I might be speaking out of turn, but I typically will say that options are a vehicle to express something that has edge, but it doesn't inherently create it. But I'd like to get your thoughts on it. Yeah, options are just an instrument. I'm not an age. And I think I think when people find options, the first thing is they find all these structures you can put together. Right. You can do an iron condor or a Christmas tree or a ladder or whatever. And they think that by choosing the correct structure, they've got an edge. And part of it is because like to do options, you have to learn a lot of",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 55,
      "start_timestamp": "00:29:05",
      "start_timestamp_seconds": 1745.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1745"
    }
  },
  {
    "text": "you can put together. Right. You can do an iron condor or a Christmas tree or a ladder or whatever. And they think that by choosing the correct structure, they've got an edge. And part of it is because like to do options, you have to learn a lot of mechanics. Right. There's a lot going on with options, whereas with stocks, there really isn't. It's a number. Your buy it goes up, you make money, done. With options, there are all these choices you have to make. But they again, they're not edges. The Greeks are not edges. The Greeks are just numbers describing what's happening. And like people sometimes ask me, it's like, what do you think of this strategy called, I don't know, could be anything, right? Could be the monkey in a tree strategy. And I'm like, I don't know, it sounds dumb. What is it? Are the selling options or your buying options? If you're selling them your shortfall, if you're buying them your longfall, that's pretty much it. All that other stuff is just details. If it makes you feel good, fine. But people, you know, like, I should I do an iron condor or a butterfly? I'm like, they're exactly the same thing. It's just because ones at one strike and ones at two strikes doesn't make them intrinsically different. It's like, I don't know. If you're looking at a professional option traders book, I don't decide to do a butterfly. I just",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 55,
      "start_timestamp": "00:30:11",
      "start_timestamp_seconds": 1811.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1811"
    }
  },
  {
    "text": "or a butterfly? I'm like, they're exactly the same thing. It's just because ones at one strike and ones at two strikes doesn't make them intrinsically different. It's like, I don't know. If you're looking at a professional option traders book, I don't decide to do a butterfly. I just start selling stuff and then see what I've got and buy some other stuff to hedge the risk. I don't even know what strikes are doing because it doesn't matter. It's the idea is volatility is overpriced. So I want to sell volatility. And that's why options give you an edge is because that dependent on volatility. So you have to do all this work to get to the point where you understand that dependence. But once you know that, volatility is predictable. That's the great thing. Price isn't predictable. So trading stocks is really hard because they're simple as anything to understand, but you've got to make a difficult prediction. Whereas options you do all the work up front, they're hard to understand, but then the prediction you need is relatively easy. But you've got to make that prediction. You've got to actually go out and predict where volatility is going to be. And a lot of people don't do that. Like even the ones who know that volatility's, sorry, options are not an edge will be like, I sell Australia every Tuesday or whatever. It's like, well, what if you're selling it too cheap? You've still got to",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 55,
      "start_timestamp": "00:31:18",
      "start_timestamp_seconds": 1878.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1878"
    }
  },
  {
    "text": "is going to be. And a lot of people don't do that. Like even the ones who know that volatility's, sorry, options are not an edge will be like, I sell Australia every Tuesday or whatever. It's like, well, what if you're selling it too cheap? You've still got to make the, you've still got to do the forecasting because you know, there's a forecast every trade you do is implicitly a forecast. So it's better if you actually make a forecast rather than just do the trade and then implicitly have one buried in there. So for retail traders that want to be able to start making that forecast, you and I talked last time and I think I talked to you a little bit about it. I've done some implied volatility modeling myself and I do find it to be pretty arduous to keep up with. But for somebody that's like just starting out, what do you think in effective way to even begin down that path of forecasting volatility would look like for them? Okay, doing it through the time series methods of like measuring it, projecting it forward, using something like garch, something like that, it's probably not worth doing there. The reason is you're not going to be able to do it well enough to beat the people who do that all day. Like I'm very confident in saying that some average retail person is not going to have a better volatility model than the",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 55,
      "start_timestamp": "00:32:21",
      "start_timestamp_seconds": 1941.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1941"
    }
  },
  {
    "text": "probably not worth doing there. The reason is you're not going to be able to do it well enough to beat the people who do that all day. Like I'm very confident in saying that some average retail person is not going to have a better volatility model than the one I've got. I mean, I've got 25 years experience. I've done a lot of work on it. I've got a big knowledge base and it's a really complicated model. Mine has nice colors in it though. Mine's in a spreadsheet, so it doesn't have any colors in it. But my models no good compared to like, I don't know, Jane Streets or Susquehadas. So I wouldn't trade on the basis of my model. So that's not the way to do it. The way to do it is to look for idiosyncratic situations where volatility might be mispriced because you're looking at a risk premium. So look for situations where people are prepared to pay more for risk insurance than they should. It's like being a fireman. You want to run towards the fire. So whenever you have a situation where you think, I really want to buy options right now because I don't know, there's an election, there's an earnings event, there's a third meeting. That all situations where you should be selling options. If your first inclination is to buy them, you're not the only one with that inclination. So that's when you should be selling. So looking",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 55,
      "start_timestamp": "00:33:38",
      "start_timestamp_seconds": 2018.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2018"
    }
  },
  {
    "text": "now because I don't know, there's an election, there's an earnings event, there's a third meeting. That all situations where you should be selling options. If your first inclination is to buy them, you're not the only one with that inclination. So that's when you should be selling. So looking for those idiosyncratic risk drivers is much better than trying to come up with a sort of a technical pricing model. Yeah. So I honestly, I would look somewhere else. That's one of the problems I think a lot of retail have is that trying to play the same game as the professionals. And you will lose. That's one of the reasons retail lose is because they do the wrong thing. You don't have to play that game. There are other things you can do. You can wait. You can trade only when these other events happen. You could make pretty good money trading just Fed announcements 10 times a year. I can't do that because if I tell my boss, oh, I'm going to trade 10 times a year. And we're like, I'm not paying you to do that. We can do another 240 days a year. So retail can do stuff that I can't. But they also have to do stuff that I'm not doing. So I think one of the the common conversations I see and I think you've covered it somewhat, but I'd like to dive into this concept further where people who buy premium or",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 55,
      "start_timestamp": "00:34:54",
      "start_timestamp_seconds": 2094.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2094"
    }
  },
  {
    "text": "can do stuff that I can't. But they also have to do stuff that I'm not doing. So I think one of the the common conversations I see and I think you've covered it somewhat, but I'd like to dive into this concept further where people who buy premium or essentially saying, oh, well, I'm just I'm buying gamma and I'm okay with that. That's their hypothesis. Essentially that gamma will save them. What do you think about that? Let's say I'm an art dealer. I'm like, well, I'm an art dealer. I have to buy paintings. So I'm just going to buy paintings. I don't care what price I pay for it. Does that sound like a good business plan? Sounds right. Because that's what these people are doing. They're saying I'm going to buy gamma. It every business has to buy things below what they're worth and sell them more than what they're worth. So it's like, yeah, buying gamma is a great thing. But if you get it cheap, but selling gamma is a great thing as well if you sell it expensive. So I think a lot of people come in with this preconceived notion of the position they want rather than the edge they see. I mean, there's no buying gamma just because it's just like, oh, I found out what options do. I'm going to buy them. But you're paying the wrong price. There's no business in the world that succeeds paying the wrong",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 55,
      "start_timestamp": "00:36:10",
      "start_timestamp_seconds": 2170.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2170"
    }
  },
  {
    "text": "the position they want rather than the edge they see. I mean, there's no buying gamma just because it's just like, oh, I found out what options do. I'm going to buy them. But you're paying the wrong price. There's no business in the world that succeeds paying the wrong price for something. And on that same vein, and I assume your answer will simply be the inverse. But and I'm actually specifically talking about two separate communities on Reddit, which is always entertaining to me. And there are groups like that that are just vehemently, I buy gamma because gamma moves. And then there is, I'm sure you've heard of at least in passing, you know, the theta gang. And they only sell always because their thought process is, well, time always passes. So how could I lose if time passes? Obviously, we know it's more to it than that. But is your answer essentially the same for that just flipped? Yeah, I think in both cases, people have taken a valid observation and decided it worked all the time. And it doesn't like if you're selling options, the only way you make money is if you're selling a higher implied volatility than the subsequently realized. Now, there are lots of ways of convincing yourself that you're not doing that. Like if you sell one Delta strangles, you'll make money almost all the time, even if you're selling them too cheaply. But there's no edge doing that. All you're",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 55,
      "start_timestamp": "00:37:32",
      "start_timestamp_seconds": 2252.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2252"
    }
  },
  {
    "text": "higher implied volatility than the subsequently realized. Now, there are lots of ways of convincing yourself that you're not doing that. Like if you sell one Delta strangles, you'll make money almost all the time, even if you're selling them too cheaply. But there's no edge doing that. All you're doing is pushing the risk out into the future and one day you'll blow up spectacularly. But one of the problems people have with that is they shouldn't be selling options that always win or often win. You're much better off doing trades that lose a lot of the time. So you're much better off selling straddles than strangles because if you're wrong, you'll find out a lot quicker. Whereas if you just keep selling strandles, you might be wrong and there's no feedback coming to you. You can only learn if you're getting feedback. And if you're selling strandles, then the market's not giving you feedback. So the Theta Gang, they have a valid point that implied volatility is usually too high. But if they called themselves the short vague again, it would be much more what they're actually doing. But also, volatility just because it's usually too high isn't always too high. I mean, the way I say tell it to people is like, look, do you know any gang members who are still being gang members when they're 80? No, because they're dead or they're in prison. That's what's going to happen to the Theta Gang too",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 55,
      "start_timestamp": "00:38:49",
      "start_timestamp_seconds": 2329.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2329"
    }
  },
  {
    "text": "isn't always too high. I mean, the way I say tell it to people is like, look, do you know any gang members who are still being gang members when they're 80? No, because they're dead or they're in prison. That's what's going to happen to the Theta Gang too as well. They're not going to blow up. If you sell options indiscriminately, eventually, yeah, you'll blow up. Now, to start diving into this a little bit further, so I actually have found the same kind of the same kind of answer as you're highlighting with preferring short straddles versus strangles. I think I arrived at it probably because of a busted reason. I thought just, well, I guess indirectly it circles back to a point. I first started selling straddles. It was because I just started noticing that I was getting paid more than the moves in general, even though it seemed kind of scary when I was doing this. Over time, I started realizing that the straddles, I'd like your perspective on this point specifically, the straddles sometimes, it's hard for me to tell if I'm wrong because volatility is mispriced or if I'm wrong simply because the market got a move. Maybe that's the same, right? Same, realize volatility is larger. But I'm curious how if you separate those two concepts when you're selling straddles? Yeah, it's difficult because a couple of days ago, I can't remember when it was, it was like Monday or Tuesday this",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 55,
      "start_timestamp": "00:40:09",
      "start_timestamp_seconds": 2409.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2409"
    }
  },
  {
    "text": "market got a move. Maybe that's the same, right? Same, realize volatility is larger. But I'm curious how if you separate those two concepts when you're selling straddles? Yeah, it's difficult because a couple of days ago, I can't remember when it was, it was like Monday or Tuesday this week, seems like years ago now, right? There was a day when the SP moved basically, continuously the whole day in one direction. And I think it went down, but again, no idea. If you'd sold the straddle then, the realized volatility was much higher than what you'd sold it at. So if you'd just sold the straddle and gone away for the day, you would have lost money. But had you sold the straddle and then hedged it throughout the day, you actually ended up making money because the path that took was so easy to hedge because it just kept on going down smoothly and slowly so you could just keep selling futures all the way down. So that's a situation where I was short volatility. My volatility forecast was completely wrong, but I still made money because of just the path that took. Had it jagged down and then jagged back up again, I would have lost money. That's jumped around and controllably I would have lost money. So one of the problems with options is you can be completely wrong and make money. And when I'm wrong, I like to know I'm wrong. I knew I'm",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 55,
      "start_timestamp": "00:41:15",
      "start_timestamp_seconds": 2475.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2475"
    }
  },
  {
    "text": "and then jagged back up again, I would have lost money. That's jumped around and controllably I would have lost money. So one of the problems with options is you can be completely wrong and make money. And when I'm wrong, I like to know I'm wrong. I knew I'm wrong in that situation because I've seen that path dependency play out so many times. But I think you've got to make it as easy as possible to get valid feedback back from the market. So in terms of a forecast, leaving aside what I said about strangles and sorry, condors and butterflies being the same, that was a different in different contexts. And people again, there are so many nuances and contexts dependent answers here that there's no one rule here that applies to everything. But the point I'm trying to make here is if you're short volatility, there's not much difference selling a strangle and a strangle in terms of the edge you're getting. Right. The difference is you're trading off lots of you're trading off percentage of wins against the size of the wins. Right. And that's particularly if you're not a full-time person, that's a dangerous thing to do. So when you're trading things like straddles or strangles and you're hedging, I assume you're like you were saying you're hedging with futures or for retail traders if you're trading like straddles in you know, spy kind of the smaller index ETFs. Have you found different circumstances",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 55,
      "start_timestamp": "00:42:36",
      "start_timestamp_seconds": 2556.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2556"
    }
  },
  {
    "text": "thing to do. So when you're trading things like straddles or strangles and you're hedging, I assume you're like you were saying you're hedging with futures or for retail traders if you're trading like straddles in you know, spy kind of the smaller index ETFs. Have you found different circumstances where you will delta hedge and other circumstances where you choose to abstain from delta hedging because I can also say I have found myself in the scenario that if I try to very specifically and discipline execute delta hedging sometimes that actually hurts me more than it helps me. And I've started to become more selective with how I choose when I want to delta hedge but I'd like to hear your thoughts on that. Yeah, you'll always find situations where in retrospect you made the wrong decision. Of course. Have I done that on Tuesday? I would have lost a ton of money. And as it is, I made money. So it's different. It's looking back at individual cases is always dangerous but I think it's more dangerous when you say I'm more selective because you see the cases where you've made the wrong decision in the past. How are those selective decisions working out for you? Because in what are you basing that selection process on? A lot of people get tied up in this idea that because they're hedging and it involves trading stocks or futures that they're making a directional bet. But you're not. It's",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 55,
      "start_timestamp": "00:43:53",
      "start_timestamp_seconds": 2633.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2633"
    }
  },
  {
    "text": "How are those selective decisions working out for you? Because in what are you basing that selection process on? A lot of people get tied up in this idea that because they're hedging and it involves trading stocks or futures that they're making a directional bet. But you're not. It's like you're literally saying I don't want a directional bet because I don't understand it. So once you're then saying I'm going to be selective, it's completely you're putting two contradictory things together. And I'm also would think your ability to successfully predict direction is zero, particularly if you're crossing that ask spread. So I think that's more dangerous. I'm very I very rarely do that. Part of it's because I can't like I don't have a particularly big book on right now, but it's got 160 something different stocks in it. Like I can't be watching them and making it go some credit decisions about all of them. It's just impossible. So almost everything I do now is whether it's automated or not, it's pretty much all algorithmic. So speaking of that, then and to shed just some additional context on the way that I've started to choose to to delta head especially short straddles is I've actually started opening up the delta range. I will let it move within before I start delta hedging. That's really the main selection criteria. I've been trying to optimize over time. And I'm wondering if you have any opinion on an optimal",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 55,
      "start_timestamp": "00:45:12",
      "start_timestamp_seconds": 2712.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2712"
    }
  },
  {
    "text": "to delta head especially short straddles is I've actually started opening up the delta range. I will let it move within before I start delta hedging. That's really the main selection criteria. I've been trying to optimize over time. And I'm wondering if you have any opinion on an optimal range. I know you've studied this stuff obviously far more than I have. I have a smaller data set that I've been back testing and just running studies on to get some ideas, but curious your thoughts there. Yeah, backtesting stuff like that's really dangerous because you'll find the number that's worked really well in the past and it's probably going to be relatively meaningless. We don't really have a lot of options data. We think that we do, but we really only have liquid options data in a large number of products for like 15 years. And you can make a good argument that it's not 15 years of independent data. It's like regimes that last for years at a time. So I think backtesting options is that testing anything is fraught with difficulties. I think that options it's even worse particularly because then you're delta hedging. You've got all these other decisions you've got to make. I think the most important thing for hedging that people sort of forget is that it's a really expensive process. Right. And especially for retail where their costs are enormous. Even if you're working through a zero transaction cost broker, there are",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 55,
      "start_timestamp": "00:46:36",
      "start_timestamp_seconds": 2796.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2796"
    }
  },
  {
    "text": "all these other decisions you've got to make. I think the most important thing for hedging that people sort of forget is that it's a really expensive process. Right. And especially for retail where their costs are enormous. Even if you're working through a zero transaction cost broker, there are transaction costs in there. You're just not seeing them up front. You've got borrow costs. Every time you touch the keyboard, it costs you money. So whitening out things is definitely a good idea. You should almost think of it as you hedge when you're all like, oh my god, I'm totally wrong. So instead of trying to lock in volatility by trading like I don't know in the spy based on all the parameters and stuff today, I was trading about every 80 cents for a retail person. You probably want to go let it go a lot more than that. Like if the spread, if the straddles like 2, you shouldn't be trading every 80 cents. Maybe you want to re-hedge it when it goes 4 or something. You want to let your bet play out without touching it too much because it's just too expensive and costs are really insidious because you don't see them individually. But if you look at your statement at the end of the year, yeah, it's like, oh my god, I paid away 15 of my profits on costs. And that's not a 15 would not be an unusual number for an",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 55,
      "start_timestamp": "00:47:55",
      "start_timestamp_seconds": 2875.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2875"
    }
  },
  {
    "text": "are really insidious because you don't see them individually. But if you look at your statement at the end of the year, yeah, it's like, oh my god, I paid away 15 of my profits on costs. And that's not a 15 would not be an unusual number for an active trader. No, I totally agree with you. And I've actually, that's one of the reasons that went into that decision cycle. It was interesting to hear you quote the hedging parameters using the price of the strangle as compared to the delta of the position. Is there a reason for that? I just thought the example would be easier. Got it. Okay. Yeah, in practice, if you go through all the math and stuff, you'll end up with a delta range that you're prepared to take. So you're like, I start off flat delta when my delta range gets to within plus or minus 500 delta's or whatever, then I'll hedge. But that ranges dependent a lot of on a lot of other things as well. So what other things do you base that on? Well, having 500 delta's is very different if you've got a lot of gamma as opposed to if you don't. So if you've got more gamma, you have to widen things out because the definition of what it means to be flat is very different. If I'm long a ton of gamma, if the option, if the stock takes we bid an offer like",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 55,
      "start_timestamp": "00:49:15",
      "start_timestamp_seconds": 2955.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2955"
    }
  },
  {
    "text": "as opposed to if you don't. So if you've got more gamma, you have to widen things out because the definition of what it means to be flat is very different. If I'm long a ton of gamma, if the option, if the stock takes we bid an offer like delta changes. So it just changes whether your flat or not has to be done in context relative to your gamma. Yep. Yeah. Finally, gamma, you shouldn't, you've got no volatility risk. You should be flat completely. Right. Yeah, because most of at least what I've attempted to do is start with is neutral to gamma's I possibly can and then just hedge off delta's. But I've, I still struggle to find the right range as just let's say a per percentage of delta's or something like that, whatever to try to codify it is optimal. Do you have any recommendations on how to optimize that kind of delta hedging approach? Not in a simple way. There are mathematical approaches to it. Frankly, the most difficult map, it's the most difficult mathematics of any of the option price and stuff. It's far more difficult than blacksholes itself. But you can go through all the mathematics, but most people won't really understand that. At the other end of it, there is an approximate equation that you can use that will give you my delta is the white sholes delta plus or minus this correction effect. The problem with that is you",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 55,
      "start_timestamp": "00:50:25",
      "start_timestamp_seconds": 3025.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3025"
    }
  },
  {
    "text": "go through all the mathematics, but most people won't really understand that. At the other end of it, there is an approximate equation that you can use that will give you my delta is the white sholes delta plus or minus this correction effect. The problem with that is you need to have a risk tolerance input. And the way, the way you really get that risk tolerance is by saying when I'm trading options, I'm prepared to let my delta's grow to this size. So going through that process, because it's utility dependent, you need to calibrate it and the way you calibrate it is with your option trading as an input. So it's only really useful if you trading a multitude of products. So if you always trade SPY and trade SPY only, you don't really gain a lot by doing that. But if you trade SPY and IWM and DIA and Microsoft and Google and all these different price options and different volatilities, then it will give you something that's consistent across all of them. But that's really the best you can do because any hedging is intrinsically going to be dependent on your risk tolerance because hedging is literally how do I remove my risk? Right. What do you think of as risk and what I think of as risk is going to be different numbers? Right. And I know from reading, I think it's your latest book, there was, there was sections in there about",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 55,
      "start_timestamp": "00:51:42",
      "start_timestamp_seconds": 3102.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3102"
    }
  },
  {
    "text": "hedging is literally how do I remove my risk? Right. What do you think of as risk and what I think of as risk is going to be different numbers? Right. And I know from reading, I think it's your latest book, there was, there was sections in there about hedging with different products, right? Like the preference typically would be to hedge with whatever product is you have the trade in, but sometimes you might be you with 160 positions on. Do you still try to hedge? Well, you said a lot of its algorithmic at this point. So probably you just hedge within those individual tickers or do you use like beta weighted deltas and then hedge off of that for the portfolio writ large? When I do a hedge, the individual hedge is done in the stock concern. And for 99 of options traders, that's what you'd do because there aren't going to be liquid options on stocks that are more in liquid. So if there's enough liquidity for options to even trade and for you to trade them, you can definitely hedge with the stock. So the situation where you wouldn't would be if you're trading an OTC option on something like I don't know, weather. Right. And you can't go out and buy weather, you know, so you're going to have to find a hedging basket that is in some way correlated with that risk. I do aggregate all my stock positions to a beta",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 55,
      "start_timestamp": "00:53:05",
      "start_timestamp_seconds": 3185.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3185"
    }
  },
  {
    "text": "an OTC option on something like I don't know, weather. Right. And you can't go out and buy weather, you know, so you're going to have to find a hedging basket that is in some way correlated with that risk. I do aggregate all my stock positions to a beta weighted position. So I can see if the SP goes up this much, how much I lose. Right. Just sizing. But that's only as an import for when I would decide to hedge. Once I decide to hedge, it's all done on the single stocks. Got it. And I know we're coming up on time, but I have another question for you. It's slight change of pace, but I know your general disposition when it comes to just direction and like most traders ability to guess direction. And I'd like your thoughts on the traders that are effective at guessing direction. So let's say you were one of those traders. What would you change about your strategy if that were the case where you found that you might even have a lower hit rate, but the way that you're able to find things that have big legs that it's profitable for you, even trading equities. I wouldn't trade options at all. You would just trade the equities. It's like generally speaking, you should trade the simplest thing you can to express the view you've got. Even if you're a good directional trader and I'm not saying it's impossible, right? I'm",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 55,
      "start_timestamp": "00:54:18",
      "start_timestamp_seconds": 3258.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3258"
    }
  },
  {
    "text": "for you, even trading equities. I wouldn't trade options at all. You would just trade the equities. It's like generally speaking, you should trade the simplest thing you can to express the view you've got. Even if you're a good directional trader and I'm not saying it's impossible, right? I'm saying it's much less likely than most people think it is. Yes. But given that you are trading options is almost certainly the wrong thing because when you're trading options, you're trading volatility whether you want to or not. So the edge you've got is an involuntility. So stay away from volatility. Just trade the underlobe. What would you say if the response to that then was, well, I like the leverage of options. So I use leaps. I go really far out in time, super far in the money, not a lot of extrinsic values, so not a ton of volatility to be in there. Well, you're still probably paying the wrong price, unless you can convince me or not. And it's like leverage is like the nonlinearity aspect. You're like leverage, that's great. You've got to pay the right price for it. If it's only leverage you want, you can get leverage lots of other ways. You can just trade on margin. You don't have to go out and buy leaps where you're crossing a wider bit asked spread, probably paying too much. It's just you're not implementing your prediction in the simplest way possible. And that's almost",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 55,
      "start_timestamp": "00:55:23",
      "start_timestamp_seconds": 3323.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3323"
    }
  },
  {
    "text": "you can get leverage lots of other ways. You can just trade on margin. You don't have to go out and buy leaps where you're crossing a wider bit asked spread, probably paying too much. It's just you're not implementing your prediction in the simplest way possible. And that's almost always a mistake. Yeah, there's lots of things you can do with options. But unless you're getting an edge to do it, you probably shouldn't be doing those things with options. I think most people would benefit from not trading options at all. And I'm not saying that retail can't trade options. But you have to do the work involved beforehand. So I'm not in any way denigrating retail. I think a lot of people I've met on the retail side had a lot of great ideas. And I learned a lot from them because I'm coming in from different angles, different backgrounds. They didn't all do the same courses. They didn't all read the same books. But you still have to do the work. So unless you prepared to put the work in options, probably aren't the best vehicle. I actually agree with you because I mean, I've been trading I started trading options in 2007. So I've been trading them for a while now. And I do notice that a lot of retail traders have this. It's so strange. It's like this they have like I call it like a binary mindset. It's either like I trade options",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 55,
      "start_timestamp": "00:56:34",
      "start_timestamp_seconds": 3394.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3394"
    }
  },
  {
    "text": "trading I started trading options in 2007. So I've been trading them for a while now. And I do notice that a lot of retail traders have this. It's so strange. It's like this they have like I call it like a binary mindset. It's either like I trade options or that's it. Like I don't trade anything else. And to your point, I do think that there's kind of a gray area where sometimes it might make sense that a derivative might be the better place. Sometimes the equity might be the better place. And it's the same thing when it comes to like analysis. You know, I run into the just like we were talking about with premium camps, right? You're either long premium or short premium. There's the people that are technical analysts or fundamental analysts. And it's very strange to me to see like such a disadvantaged group of people such as retail traders be so selective over like what they'll use. It's very surprising to me. But I do all that as well. So I don't want it in any way sort of say, look, I'd be like me. I don't make any mistakes. A lot of the a lot of the ways I know that these are mistakes is because I've made them. And even then, once you know what some mistake doesn't mean you're going to always not do it. So I definitely fall into that trap where it's like, I'm an options",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 55,
      "start_timestamp": "00:57:52",
      "start_timestamp_seconds": 3472.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3472"
    }
  },
  {
    "text": "lot of the a lot of the ways I know that these are mistakes is because I've made them. And even then, once you know what some mistake doesn't mean you're going to always not do it. So I definitely fall into that trap where it's like, I'm an options trader. I've got an idea. I'm going to trade some options. And then you're like, options would not the natural vehicle for that. And furthermore, if I have that thought, if I do a trade and I say options aren't the way to do this trade, stocks the way to do it, I probably shouldn't be doing that trade because I don't have any edge in that. So I think one of the problems people have is they come up with a viable strategy and they think, right, now what I need is another strategy that helps diversify that. Okay, I mean, that is think how difficult that is. Right. If you have to, it's like if LeBron James said, right, I'm the best basketball player in the world. I've got to learn how to be the good tennis player now. I mean, it's hard enough to do one thing so that you shouldn't even try to come up with something else. You should make that one, you should get better at the thing you can do. And yeah, you know what, I want 10 uncorrelated strategies as well. That's not going to happen. It's like, it's hard enough being",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 55,
      "start_timestamp": "00:58:48",
      "start_timestamp_seconds": 3528.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3528"
    }
  },
  {
    "text": "so that you shouldn't even try to come up with something else. You should make that one, you should get better at the thing you can do. And yeah, you know what, I want 10 uncorrelated strategies as well. That's not going to happen. It's like, it's hard enough being good at one thing. Well, and then actually dovetails beautifully. And the last thing I wanted to ask you is one of the things I've heard you talk about is exactly that. Like when retail traders try to be good at everything. So if you were a retail trader that's first starting off, what is it that you would want to be good at? I think probably learning situations where selling volatility was a good bet. Got it. Because the edge is usually with selling volatility. And if you can find idiosyncratic events of timed uncertainty. So you don't know the result of the event, but you know when it comes out. So earnings, elections, federal reserve meetings, sometimes FDA announcements, that kind of thing. And then if you can become comfortable with selling options on those and managing that risk. So learning how to size it, learning how to not panic, all that kind of stuff, that's where I would start with trading options. And it's almost exactly the opposite of what people do. People look for situations where they predict the direction of the stock and then you buy options. Which is something you can't make a prediction",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 55,
      "start_timestamp": "00:59:52",
      "start_timestamp_seconds": 3592.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3592"
    }
  },
  {
    "text": "not panic, all that kind of stuff, that's where I would start with trading options. And it's almost exactly the opposite of what people do. People look for situations where they predict the direction of the stock and then you buy options. Which is something you can't make a prediction on very accurately. And then you're paying too much for that thing as well. So you've made two mistakes right off the bat. I love that. So I, there's literally a million other questions I'd love to go into. I'll have to rope you back on again at some point. I love talking about this stuff. And it's interesting hearing like a very sophisticated take on it. So as always, you know, thank you for spending some time with us. What, uh, what are you up to this weekend and any good plans? Tomorrow I'm watching the All Blacks play England. Which will either be good at the New Zealand wins and terrible if they don't. So I'm not sure how that would plant out. And then I've, I've got to actually do some work stuff as well. So just some meetings with people who are in from out of town. That's okay. I mean, I don't mind it. It's, I mean, I'd kind of do this for fun, even if I wasn't getting paid for it. Which I guess that's fair. And so no bike riding, nothing like that. A motorbike riding. Yeah. Not, I mean, it's freezing cold",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 55,
      "start_timestamp": "01:01:02",
      "start_timestamp_seconds": 3662.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3662"
    }
  },
  {
    "text": "town. That's okay. I mean, I don't mind it. It's, I mean, I'd kind of do this for fun, even if I wasn't getting paid for it. Which I guess that's fair. And so no bike riding, nothing like that. A motorbike riding. Yeah. Not, I mean, it's freezing cold here. It's actually snowing now already. I was going to ask about that. We were spoiled. We have 75 degree weather a couple of weeks ago. I actually missed putting my car away for the winter by a day. The first snow of the year was the day I did it. Oh no. Do you store them somewhere different than where you're at? Kind of. I was, it was getting fixed. And so I moved it out of the, they're into the garage, but I had to drive it 40 miles or something to do that. Yeah, that wasn't an ideal day to do it. It's a good day if you want to, you know, just test your relationship with death, you know, every once in a while. You got to know where you stand. It would be a lot of fun if I was on the roads all by myself. Yes. I mean, slithering around when you've got plenty of space and you're not going to hit anything, there's a lot of fun. Yeah, I remember when I used to drive home from college, I went to college in for my undergrad in Rochester and I had a Jeep",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 55,
      "start_timestamp": "01:02:08",
      "start_timestamp_seconds": 3728.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3728"
    }
  },
  {
    "text": "myself. Yes. I mean, slithering around when you've got plenty of space and you're not going to hit anything, there's a lot of fun. Yeah, I remember when I used to drive home from college, I went to college in for my undergrad in Rochester and I had a Jeep Wrangler. So it's just a box on wheels. So not good with wind. And I would drive home in the snow and there were literally periods of time where I would realize that I was no longer on the road for like four miles. I was like on the side of the road and had to get back on the highway. So yeah, I totally hear you there. But well, I hope you have an awesome weekend. And thank you again, you know, so much for hanging out for a little bit talking about trading with everybody. Thanks. Being fun. All right, take care.",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": "",
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 55,
      "start_timestamp": "01:03:10",
      "start_timestamp_seconds": 3790.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3790"
    }
  }
]