[
  {
    "text": "What's up everybody Eric here I am back with you in and we have a lot to talk about so first off welcome back to the channel it's good to hear some of the things you're looking at and it's also good to see that you're still drinking your seltzer waters like we were talking about I'm on grapefruit tonight and it looks like what you're on some sort of tangent rain is that orange. The fact that I have to look tells you how strong the flavor is there apricot apricot okay that's a yep that sounds like a lacroy style flavor. That's what we got the one. Well welcome back thanks for joining us again. No problem. So we were talking a little bit throughout the past couple weeks and you mentioned that things got a little bit busy and the cryptocurrency market especially with everything that we've been seeing going on so I would love to start the dialogue there with you know obviously we have the collapse of FTX and then we're starting to see some of these dominoes falling what are you seeing in the cryptocurrency space and how is it impacting you day today. It's not directly impacting me. It's pretty clear that people are just pulling back I mean people are basically hunkering down going into their shells you know curling up like armadillos whatever you want whatever animal reference you want to bring out right no one really knows what's going on",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 56,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=0"
    }
  },
  {
    "text": "It's not directly impacting me. It's pretty clear that people are just pulling back I mean people are basically hunkering down going into their shells you know curling up like armadillos whatever you want whatever animal reference you want to bring out right no one really knows what's going on and I think. I think people think they're overreacting on the other hand when FTX collapsed it went very quickly from there is no problem to it's a technical problem to they have it liquidity problem to. They're bankrupt to they're all complete criminals so the narrative has changed dramatically and I change so quickly that I think now people are. Just so I know people have pulled out of you know the safest exchanges like gone completely back and pulled all their money back to a US bank in US dollars completely out of the space so that's sort of where everyone is now volatility in the. In the major coins sort of dropped back a lot in the last couple of days I mean it's almost back to pre FTX levels now so I think probably people are assuming that certainly Bitcoin and Ethereum are now. Kind of can survive independent of this kind of thing. Another the only things with any options on them anyway. Yeah I'm actually looking at Bitcoin right now and as you point out it looks like what on the 9th is when IV spiked and it's essentially been coming down since and",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 56,
      "start_timestamp": "00:01:04",
      "start_timestamp_seconds": 64.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=64"
    }
  },
  {
    "text": "can survive independent of this kind of thing. Another the only things with any options on them anyway. Yeah I'm actually looking at Bitcoin right now and as you point out it looks like what on the 9th is when IV spiked and it's essentially been coming down since and it actually looks like it's inverted below the 30 day trend for real. Realize volatility that's actually kind of fascinating if I didn't look at that before you said that and that surprises me why is that so low I don't get that or were we just expecting this to draw out longer and well I mean. Realize I mean the reason I these low is just it's not really moving like crypto pre FTX had basically been sitting around you know between 18,000 and 19,000 forever. Volumes as low as I'd ever seen it like one day vol was you know trading in the 30s you know so the fact now I think 7 day vol last I looked at it was in the 60s or something so it's low but it's not ridiculously low. It's basically the FTX shocks gone away and we're just back to where we've always been and no one's really projecting that that's going to cause a major problem in those points. The coins exist independently of FTX to me the problem with FTX isn't in the cash crypto space it's in all the derivatives like I think that it really diminishes the liquidity",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 56,
      "start_timestamp": "00:02:25",
      "start_timestamp_seconds": 145.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=145"
    }
  },
  {
    "text": "always been and no one's really projecting that that's going to cause a major problem in those points. The coins exist independently of FTX to me the problem with FTX isn't in the cash crypto space it's in all the derivatives like I think that it really diminishes the liquidity and all of the purpose and so forth because now you just really left with finance. Yeah and I actually was talking with a buddy of mine who banks with finance and he was saying that a while ago they instituted like a thousand a day with draw limit or something like that I don't bank with finance so I have no idea I couldn't speak to it intelligently he just shared that with me and that actually surprised me a little bit. Have you heard of anything like that I'm just curious from like a. Yeah, I have not I have a lot of different tiers depending on your volume and so I'm pretty doubtful that if you're throwing millions of dollars through their day they're putting a thousand dollar limit on you but I have no idea about that I don't really want to speculate sure yeah I think that makes sense so. Just talking real quick about the collapse of FTX you brought up a couple interesting points before we started recording one of which was just trying to like understand how this even happened and you were sharing some context around that and I would like",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 56,
      "start_timestamp": "00:03:35",
      "start_timestamp_seconds": 215.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=215"
    }
  },
  {
    "text": "think that makes sense so. Just talking real quick about the collapse of FTX you brought up a couple interesting points before we started recording one of which was just trying to like understand how this even happened and you were sharing some context around that and I would like to hear your thoughts on again it's difficult to conceive but what's your best take on like what actually happened with FTX for them to implode over the course of a few days. Well the actual implosion was very heavily driven by a crush like the reverse squeeze on FTT because basically they'd collateralized all of their loans with FTT they were the major holders of it and then that was just pushed massively against them so that's sort of the mechanics of it it's sort of like there's a run on a stock you know it's very similar to when something like lemon or best turns broke in that case and I think people made the mistake of thinking that FTX was. And I think that FTX was in exchange in the way that I don't know the CBO is right and people are like I can't believe they're doing this with customers money and the CBO wouldn't but FTX wasn't in exchange in that sense they called themselves that but they were really so and everyone knew that they were intertwined with our made it so yeah FTX took customers money gave it to our made it and",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 56,
      "start_timestamp": "00:04:28",
      "start_timestamp_seconds": 268.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=268"
    }
  },
  {
    "text": "doing this with customers money and the CBO wouldn't but FTX wasn't in exchange in that sense they called themselves that but they were really so and everyone knew that they were intertwined with our made it so yeah FTX took customers money gave it to our made it and I made a trade with it that's called a bank right like banks do that all the time. So the problem is that people thought it was more of a perception thing people were horrified to find out FTX was doing this whereas I think most people in the industry kind of we knew that anyway that wasn't the problem the problem was that our made it was somehow managing to lose tons of money at the same time and everyone thought our made it was making tons of money so that's the mystery how you manage to lose all that money trading I mean it's not it's not really easier to lose money trading than it is to make it right because if you know a way to lose money well you know what just take the other side and you're great and I kind of think that they the only way you're guaranteed to lose money trading is crossing bit ask spread wrecking up costs that's the only asymmetry between profitable strategy and and the opposite losing strategy. And I kind of think that I'll made a. We're making prices that were too tight in FTX so they",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 56,
      "start_timestamp": "00:05:49",
      "start_timestamp_seconds": 349.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=349"
    }
  },
  {
    "text": "the only way you're guaranteed to lose money trading is crossing bit ask spread wrecking up costs that's the only asymmetry between profitable strategy and and the opposite losing strategy. And I kind of think that I'll made a. We're making prices that were too tight in FTX so they were artificially giving liquidity to FTX at the expense of not a big enough bit ask spread and I have no idea if that's true got it but that essentially every time they traded they're losing money because their spreads wrong that would explain how they manage to lose all the money. They're losing a lot doesn't explain how that they lost eight billion or whatever right but that would be a guaranteed way to lose it's also that's a little bit with I know a lot of people who had very simple stand-up strategies that were working on FTX really simple ones and like the sort of things that would work in the equity markets 15 years ago and everyone was just explaining away that they were going to get a lot of money trading. They were just explaining away their success by saying these markets are just inefficient you know there's a lot of dumb retail money just pushing things out of line. But they weren't making money on finance doing exactly the same thing which leads me to believe there was a structural inefficiency that Almeida was putting into FTX that was messing things up and that's",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 56,
      "start_timestamp": "00:06:49",
      "start_timestamp_seconds": 409.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=409"
    }
  },
  {
    "text": "you know there's a lot of dumb retail money just pushing things out of line. But they weren't making money on finance doing exactly the same thing which leads me to believe there was a structural inefficiency that Almeida was putting into FTX that was messing things up and that's the only reason they were making money they were essentially making money because Almeida was giving the money on every trade. Because these guys I mean now they're running the same strategy on if on finance it's just not working and it wasn't working before FTX blew up either kind of obvious now why that might be interesting I actually hadn't thought about that myself like I didn't draw that parallel the other thing from a structural standpoint I'd like your perspective on is it seems like there would be some sort of risk management that essentially would serve as like a circuit breaker within the within FTX that if they gained too much exposure to a certain thing that it would be hedged off in some way was that just not possible for them I'm not too familiar with like why that wouldn't have been the case and why that kind of catastrophic loss would have been possible without extreme leverage which that doesn't necessarily seem like the case here. If what I said was true and I honestly I have no idea it is right everyone's just speculating at this point and I've got no inside information here",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 56,
      "start_timestamp": "00:08:16",
      "start_timestamp_seconds": 496.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=496"
    }
  },
  {
    "text": "that kind of catastrophic loss would have been possible without extreme leverage which that doesn't necessarily seem like the case here. If what I said was true and I honestly I have no idea it is right everyone's just speculating at this point and I've got no inside information here so I certainly don't know if what I said is true what you were saying is like beside the point because they were deliberate they were doing this on purpose it wasn't lost making it was a business plan so yeah risk management manager could have come in and said don't quote these prices too tight because you're losing money. And they're like we know we are it's a loss leader it's exactly the same you know that retouch stores advertise TVs for 50 bucks so people come in the door that was if that was the plan it wasn't a failure of risk management it was a failure of business plan so I think that's where risk management wouldn't have helped. Got it I guess the way that I was thinking about it is like if you're running that kind of promotion let's say right like the fifty dollars to get somebody in the door that you would let it run for a period of time until you stop it and say like this isn't working anymore but it seems like that's like you're saying that point is besides the point given the context of this scenario. Honestly I've",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 56,
      "start_timestamp": "00:09:14",
      "start_timestamp_seconds": 554.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=554"
    }
  },
  {
    "text": "to get somebody in the door that you would let it run for a period of time until you stop it and say like this isn't working anymore but it seems like that's like you're saying that point is besides the point given the context of this scenario. Honestly I've got no idea fair I mean you would think that there's a lot of weird stuff going on here right personally if I made a billion dollars I wouldn't still be betting everything. You know I there's a lot of stuff he said beforehand that now makes people go yeah we should have seen this coming like he talked about having linear utility function and only being interested in the expected value of bets. Which is insane right because if you've got a billion dollars you you're not prepared to bet everything on a 51 coin but if you've got a dollar you might because you know it's like whether you believe economics or not in any sense the idea of diminishing marginal utility makes a lot of sense you know a billion dollars the extra dollar to that person means nothing whereas to a homeless person it means everything so. I don't know who knows I mean there was a lot of when everything's done badly it's difficult to pin the blame on one thing you know if it was simply matter criminal behavior then that's a I mean people for a long time tried to explain away burning",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 56,
      "start_timestamp": "00:10:38",
      "start_timestamp_seconds": 638.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=638"
    }
  },
  {
    "text": "so. I don't know who knows I mean there was a lot of when everything's done badly it's difficult to pin the blame on one thing you know if it was simply matter criminal behavior then that's a I mean people for a long time tried to explain away burning made offs issues in lots of ways about the structure of the market and how there was insider trading and blah blah blah. Turns out there was no trading at all you know so no one ever said that before they knew that so we might find it if tx we I mean who knows maybe he was funding a private army and the so to or something it could be almost anything. Yeah it's I was recently re-listening to the the psychology of money I'm not sure if you ever read that book it's interesting in some parts it's very simple but one of the things I like about that book though is it talks about the concepts of luck and risk in how two people with a similar skill skill. So I think that's the only thing that I can say is that you know that the concept can essentially see two different outcomes based on luck and risk and one of the other things it talked about that seems like it applies to this scenario is the idea that there are some people where there is no enough right like to your point if you had a",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 56,
      "start_timestamp": "00:11:26",
      "start_timestamp_seconds": 686.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=686"
    }
  },
  {
    "text": "can essentially see two different outcomes based on luck and risk and one of the other things it talked about that seems like it applies to this scenario is the idea that there are some people where there is no enough right like to your point if you had a billion dollars you might not risk at all all the time you know to to make whatever you're trying to make but the point of the book is saying for some people it's just not enough which is very similar to that made off case right because he was actually very successful. Before he started swindling people he had a really good return and he was very wealthy but it just wasn't enough for him do you think when this kind of scenario happens in the crypto space does it set cryptocurrency back in terms of its perceived legitimacy in the broader economy in the broader markets I'm curious from a larger standpoint this kind of failure what can you glean from it in terms of the impact on the crypto space. Well I would expect that it would have to. Here's the issue with crypto stepping back even further it has no role in the broader economy right I mean to say Bitcoin as a currency really go and spend Bitcoin go and actually try and use it anywhere you can put money into offshore bookies with Bitcoin but you know you can't spend it anywhere. It's not a",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 56,
      "start_timestamp": "00:12:56",
      "start_timestamp_seconds": 776.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=776"
    }
  },
  {
    "text": "it has no role in the broader economy right I mean to say Bitcoin as a currency really go and spend Bitcoin go and actually try and use it anywhere you can put money into offshore bookies with Bitcoin but you know you can't spend it anywhere. It's not a currency in any normally accepted term the whole space is built on the idea of speculation and. I mean basically it's like look if every fantasy football company went bankrupt tomorrow do you think people would stop playing fantasy football probably right no one's going to be playing daily fantasy if they find out the whole thing was a scam. And I think that's where we are with crypto now as well I think the idea of funding a company with a coin offering I think that's gone out of fashion that's. And remember in finance fashion happen very quickly like that you know when was the last time you saw anyone excited about a spec offering but two years ago specs were all the rage. So crypto definitely ballooned very quickly I think it's I'd be very surprised if it came back to these levels you know for decades if it if it does at all I've never really been a I've never really been a believer in crypto I mean I believe it exists it was like anything else it moves around so you know I'll trade it I'll buy it when it goes down sell it when",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 56,
      "start_timestamp": "00:13:57",
      "start_timestamp_seconds": 837.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=837"
    }
  },
  {
    "text": "if it if it does at all I've never really been a I've never really been a believer in crypto I mean I believe it exists it was like anything else it moves around so you know I'll trade it I'll buy it when it goes down sell it when it goes up but. I mean the whole thing was as far as I'm concerned is fictional nonsense yeah I echo that to some degree I think that there's a potential use case for it and actually the part that I find fascinating about cryptocurrency is not even the cryptocurrencies itself but actually just blockchain technology and like what that can impact I do think blockchain is very interesting to me but to your point and I really do agree with you cryptocurrency it seems to have so far. Just really struggled a lot of people are saying well it's going to replace gold hard to make that case people are saying you know if there's counter party risk then it's not a good currency it's hard to make that case with cryptocurrency so it seems like a lot of the I don't know main themes that people talk about with cryptocurrency don't necessarily seem to hold up longer term so I think the idea of using coins as an offering instead of using equity. It gave a lot of startups a way of coming to market much quicker but the reason they could do that is because there was",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 56,
      "start_timestamp": "00:15:11",
      "start_timestamp_seconds": 911.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=911"
    }
  },
  {
    "text": "with cryptocurrency don't necessarily seem to hold up longer term so I think the idea of using coins as an offering instead of using equity. It gave a lot of startups a way of coming to market much quicker but the reason they could do that is because there was no regulation right so. See what this is and there's a whole bunch of things to unpack here there's a big problem with the whole crypto and defy space in particular where you've got the the tech bros for better word. Confidently reinventing something that we've used in banking for a hundred years and it's like oh this is what we need and we're like do we already have that it's just we don't have that in the defy world and. People it's very fashionable to sort of say regulations are holding us back and so forth but you've got it we may have outdated regulations we may have too many but every single one of them was put in place for a valid reason at the time so going to a completely deregulated space yeah what do you think was going to happen right I mean this is sort of in a way inevitable right it's like kids throwing sand around a sand pit and then someone gets it in their arms. It's just a matter of time. Well I also can't help but get a kick you know one of the big things that people talk about with",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 56,
      "start_timestamp": "00:16:06",
      "start_timestamp_seconds": 966.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=966"
    }
  },
  {
    "text": "of in a way inevitable right it's like kids throwing sand around a sand pit and then someone gets it in their arms. It's just a matter of time. Well I also can't help but get a kick you know one of the big things that people talk about with cryptocurrency is you know the privacy even though obviously the transactions are all tracked on the blockchain you can find them all right now they're saying for FTX is part of the chapter 11 that essentially everybody's information might essentially be released as part of that you know if you've made a deposit or a withdrawal like that information is so. Like that information is going to get bucketed in with it so to me I just look at one of the other proposed use cases of cryptocurrency being an on emity a little bit of separation from transactions and it seems like even that is starting to to fall away it's not to the same degree obviously using a credit card but still the fact that you know you are supposedly able to make transactions that are very difficult to trace yeah. A day after this happened people were looking at FTX addresses and saying this is happening on ethoscan and people were tracking it in real time and I mean one of the other big arguments is that people then were saying against the exchanges is you know everyone's well it's not your currency if it's not your",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 56,
      "start_timestamp": "00:17:12",
      "start_timestamp_seconds": 1032.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1032"
    }
  },
  {
    "text": "looking at FTX addresses and saying this is happening on ethoscan and people were tracking it in real time and I mean one of the other big arguments is that people then were saying against the exchanges is you know everyone's well it's not your currency if it's not your keys you've got a self custody yet we did that as well you know that was called money that if I have cash I am literally self custodying we used to have stocks at a fair amount of money. We used to have stock certificates and bearer bonds and people got rid of them for a very good reason because if I know you've got them I can come to your house and hold you up and take them off you that's the same as oh your self custodying great I'll just come and hold a gun at your head until you give me the key it's like we did that and we decided that banks were a better idea so again it's kind of reinvent the wheel. Well it's not even reinventing the wheel it's forgetting that we had a thing called the wheel and then saying wouldn't it be great if we had a wheel and then inventing a worse one. So there may be things the blockchain can do but I mean this is sort of like the early days of the internet when people were like do we really need this to be on the web",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 56,
      "start_timestamp": "00:18:36",
      "start_timestamp_seconds": 1116.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1116"
    }
  },
  {
    "text": "be great if we had a wheel and then inventing a worse one. So there may be things the blockchain can do but I mean this is sort of like the early days of the internet when people were like do we really need this to be on the web although you know my fridge is on the web now so who knows do I do I need an app to interact with my fridge. I mean the only way I need to interact with my fridge is when I open it and I can't do that with an app like from up here so anyway I'm just going to sound old but I think yeah there's a disconnect and there always is between tech evangelists and what's actually needed in the world. It's so funny you say that I made a tweet the other day because I forgot what I was looking for online and I came across like a electronic dog collar that was like a smart dog collar with like an app and all this stuff which I get it for some people that might make sense but for me I chuckled at it because like my I don't even have a collar on my dog I just watch my dog and train my dog not to run away and then that's it he doesn't know collar let alone a smartphone attached to his neck so. It's interesting to see like you're kind of alluding to in",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 56,
      "start_timestamp": "00:19:32",
      "start_timestamp_seconds": 1172.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1172"
    }
  },
  {
    "text": "I don't even have a collar on my dog I just watch my dog and train my dog not to run away and then that's it he doesn't know collar let alone a smartphone attached to his neck so. It's interesting to see like you're kind of alluding to in a more your scenario makes a lot more sense where it's technology for just the sake of it it seems. Right it's like yeah we can do this like out we I'll be great. Yeah no but we see it all the time right it's like people you know you have electric door handles on your car. We had door handles that worked fine and they actually worked better because if your battery failed you'd have so open the door. Right you know it's that kind of thing or if you if you break a mirror now on your car it's a thousand bucks to get it fixed because it's full of sensors where is it used to be a mirror was like 20 bucks and you broke it who cares you just go to the record you're out and get another one. So it's like you said it's like look I'm not saying cars now are way better than they were 30 years ago way better right on a cold day you don't have to wonder if your car will start of course it will start. But a lot of these little things are literally you know there are",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 56,
      "start_timestamp": "00:20:22",
      "start_timestamp_seconds": 1222.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1222"
    }
  },
  {
    "text": "look I'm not saying cars now are way better than they were 30 years ago way better right on a cold day you don't have to wonder if your car will start of course it will start. But a lot of these little things are literally you know there are solutions to problems that aren't there. Anyway this is just me complaining now because it's been a long week. Well it's interesting though to hear you know about the crypto space so thank you for sharing some of your thoughts around that now. Dovetailing us back to your heart and soul and it's actually probably not even really your heart and soul I'm just calling it that is options and derivatives in equity's markets and other markets. We had a couple of conversation points that you sent over and like I was telling you before we started there is a couple of these that I want to hit because I think they're really important I've heard you talk about them before and then there's some of these that are new to me and I want to talk about one of those because I think they're interesting so. The first one in here that stands out to me that I haven't heard yet is getting the trilogy backwards and it's an interesting concept to me but I'd like to get your thoughts on what that means. Not not being funny but I don't know what that means because I'm not sure",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 56,
      "start_timestamp": "00:21:34",
      "start_timestamp_seconds": 1294.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1294"
    }
  },
  {
    "text": "in here that stands out to me that I haven't heard yet is getting the trilogy backwards and it's an interesting concept to me but I'd like to get your thoughts on what that means. Not not being funny but I don't know what that means because I'm not sure what do you have any other context for what that where that came from it's on the bullet pointed list that you sent over and trilogies and air quotes that's the context I got for you. Oh yeah okay I can kind of okay so there are three things you need to do a trade successfully and when I say trade I don't I mean individual trade or a trading strategy you need an edge you need a statistically valid reason that you should make money from this trade so you need a loaded point that is the most important thing that's the first thing the second thing is based on that edge you need risk control and that means largely. Sizing that individual trade correctly putting that trade in the context of a portfolio. Then you need to have the psychological tools in place to persist with that trade if things are going badly. What a lot of people decide though is that those three things should happen in the opposite order and you'll see things like this where people like the most important thing is discipline. Okay you get paid for doing difficult things finding an edge is",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 56,
      "start_timestamp": "00:22:36",
      "start_timestamp_seconds": 1356.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1356"
    }
  },
  {
    "text": "if things are going badly. What a lot of people decide though is that those three things should happen in the opposite order and you'll see things like this where people like the most important thing is discipline. Okay you get paid for doing difficult things finding an edge is difficult being disciplined isn't difficult being disciplined is something any adult should be able to do you don't get paid because you turned up for work today like you're meant to turn up for work today that's it's like you do something like I couldn't trade I had trade is block it was like you don't I mean it's not going to be a good deal. I mean they're like how do you get rid of that and I'm like you don't you just act like an adult you don't get traders block in any more way than the mechanic gets mechanics block I can't work on the card today I'm just not feeling it just I mean you do it because it's your job so I'm not saying psychological problems aren't possibly an issue but they're never the main issue further more the people who say that don't act as though they believe it. So if you really thought your psychological problems were the issue you would just decide to give yourself a stern talking to in the morning like today I'm really going to concentrate hard no if you really thought you had a real psychological problem holding",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 56,
      "start_timestamp": "00:23:41",
      "start_timestamp_seconds": 1421.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1421"
    }
  },
  {
    "text": "as though they believe it. So if you really thought your psychological problems were the issue you would just decide to give yourself a stern talking to in the morning like today I'm really going to concentrate hard no if you really thought you had a real psychological problem holding you back you'd get real help from a psychologist and there are psychologists you specialize in in trading or more specialized in sports which is a similar sort of carry over. I mean if that was the issue when you really worked on it like that I'd have a little bit more tolerance for it but it's still not the most important thing risk is a little bit similar it's a little more technical but again risk management is actually kinder easy certainly for an individual trader I'm not saying if you're the risk manager Goldman Sachs or whatever it's easy because then it's very you've just got a very complicated organization there but for an individual trade like it's not going to be a good deal. In individual options trade risks really easy oh you sold a sprig all yeah why don't you buy some two down to puts done that's your risk control and it's like it there's no magic to it it's like market risk is usually trivial to to handle so because it's trivial you don't get paid for that either like there's no magic to not taking stupid bits so you get paid for the",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 56,
      "start_timestamp": "00:24:31",
      "start_timestamp_seconds": 1471.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1471"
    }
  },
  {
    "text": "done that's your risk control and it's like it there's no magic to it it's like market risk is usually trivial to to handle so because it's trivial you don't get paid for that either like there's no magic to not taking stupid bits so you get paid for the hard stuff. And finding the edge is the hard thing so I think they're exactly the wrong order and I think some people like to think of it the wrong way round because it kind of makes them think that what they're doing is work whereas what they're really doing is avoiding work right you know but they're like had a great day to day concentrated hard I was disciplined it's like I don't know the person that McDonald's who has to deal with drunk people at night he's disciplined he didn't throw anything at a customer but he doesn't expect to make million dollars a year. Right and so I hate people man I really hate people I don't blame you and that just got me like to the point where yeah people are so dumb. Well I also feel like you're hitting on another really important aspect because I and I noticed this transitioning from the military especially as it pertains to discipline where it's like people feel like if they're disciplined they're then entitled to something and the way I've always thought about it is you being disciplined gives you an avenue to successfully pursue something but",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 56,
      "start_timestamp": "00:25:59",
      "start_timestamp_seconds": 1559.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1559"
    }
  },
  {
    "text": "I and I noticed this transitioning from the military especially as it pertains to discipline where it's like people feel like if they're disciplined they're then entitled to something and the way I've always thought about it is you being disciplined gives you an avenue to successfully pursue something but it doesn't entitle us to anything just like you know I think we've talked about it before but I also feel like a lot of people are trying to do something. I feel like a lot of people that do eventually take the time to write out a trading plan whether it's you know good better and different they feel like once they finish writing it out that they should now be successful because they've put in the work to write a trading plan and a lot of times what I'll say is you you can write an awful trading plan that just writing one down doesn't mean that it's now profitable even though you like you're saying you put it actually get there. I'm not a person who's the first of them there because if you're a very disciplined trader who does a stupid trade in a disciplined way you're going to lose a lot more money than the guy who's not disciplined there only does it once a week. It's like you have to be disciplined and carrying out like you say a good plan and it's like it's a lot of things people think qualities on their",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 56,
      "start_timestamp": "00:27:16",
      "start_timestamp_seconds": 1636.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1636"
    }
  },
  {
    "text": "you're going to lose a lot more money than the guy who's not disciplined there only does it once a week. It's like you have to be disciplined and carrying out like you say a good plan and it's like it's a lot of things people think qualities on their own are really only qualities in the context of something else. Like a tough boxer is just going to get beaten up for longer unless that good if you're good and you're tough that's great you can take a punch and you can still win the fight but if all you are is tough you're just going to stand there and get beaten up for 12 rounds so again it's like it's in the context of being good then it's a good thing and it's like confidence right you want to be confident because you are good at something you don't expect to be good at something because you're confident. That's delusional it's not confidence. Yeah, yeah, I think in speaking of that confidence this actually leads to a nice stovetail that I wanted to touch on with you is I do think it's pretty common for new options traders you know when they find options and they start trading options I get the sense that a lot of them feel like because they're trading options they've now found an edge because they're not going to be good at something else. So I think that's a good thing to do",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 56,
      "start_timestamp": "00:28:10",
      "start_timestamp_seconds": 1690.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1690"
    }
  },
  {
    "text": "you know when they find options and they start trading options I get the sense that a lot of them feel like because they're trading options they've now found an edge because they're not going to be good at something else. So I think that's a good thing to do is to get an edge because they're not trading equity so to your point a lot of them feel like I put in all this work to learn what options are how they work with the Greeks are so I should have an edge and I think you and I are both probably have a similar opinion I might be speaking out of turn but I typically will say that options are a vehicle to express something that has edge but it doesn't inherently create it but I'd like to get your thoughts on it. Yeah, options are just an instrument I'm not an age and I think I think when people find options the first thing is they find all these structures you can put together right you know I am condor or Christmas tree or a ladder or whatever and they think that by choosing the correct structure they've got an edge and part of it is because like to do options you have to learn a lot of mechanics right. There's a lot going on with options whereas with stocks there really isn't it's a number your buyer goes up you make money done with options there",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 56,
      "start_timestamp": "00:29:13",
      "start_timestamp_seconds": 1753.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1753"
    }
  },
  {
    "text": "they've got an edge and part of it is because like to do options you have to learn a lot of mechanics right. There's a lot going on with options whereas with stocks there really isn't it's a number your buyer goes up you make money done with options there are all these choices you have to make but they again are not edges the Greeks are not edges the Greeks are just numbers describing what's happening and like people sometimes ask me it's like what do you think of this strategy called I don't know could be anything right could be the monkey in a tree strategy and I'm like I don't know it sounds different. What is it by the selling options or your buying options if you sell them in your shortfall if you're buying them your long vol that's pretty much it all that other stuff is just details if it makes you feel good fine but people you know like I should I do an iron condor or a butterfly I'm like they're exactly the same thing it's just just because ones at one strike and ones at two strikes doesn't make them intrinsically different it's like I don't know if you look at a professional option trade this book I don't decide to do a butterfly. I just start selling stuff and then see what I've got and buy some other stuff to hedge the risk I don't know what strikes are doing because",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 56,
      "start_timestamp": "00:30:06",
      "start_timestamp_seconds": 1806.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1806"
    }
  },
  {
    "text": "it's like I don't know if you look at a professional option trade this book I don't decide to do a butterfly. I just start selling stuff and then see what I've got and buy some other stuff to hedge the risk I don't know what strikes are doing because it doesn't matter it's the idea is volatility is overpriced so I want to sell volatility and that's why options give you an edge is because that dependent on volatility so you have to do all this work to get to the point where you understand that dependence but once you know that volatility is predictable that's the great thing price is not a good thing. It isn't predictable so trading stocks is really hard because as simple as anything to understand but you've got to make a difficult prediction whereas options you do all the work up front the hard to understand but then the prediction you need is relatively easy but you've got to make that prediction you've got to actually go out and predict where volatility is going to be and a lot of people don't do that like even the ones who know that volatility's sorry options are not an edge I sell a straight on every Tuesday or whatever it's like well what if you're selling it too cheap you've still got to make the you still do the forecasting because you know there's a forecast every trade you do is implicitly a forecast right",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 56,
      "start_timestamp": "00:31:04",
      "start_timestamp_seconds": 1864.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1864"
    }
  },
  {
    "text": "options are not an edge I sell a straight on every Tuesday or whatever it's like well what if you're selling it too cheap you've still got to make the you still do the forecasting because you know there's a forecast every trade you do is implicitly a forecast right so it's better if you actually make a forecast rather than just do the trade and then implicitly have one buried in there. So for retail traders that want to be able to start making that forecast you and I talked last time and I think I talked to you a little bit about it I've I've done some implied volatility modeling myself and I do find it to be pretty arduous to keep up with but for somebody that's like just starting out what do you think an effective way to even begin down that path of forecasting volatility would look like for them. Okay, doing it through the time series methods of like measuring it projecting it forward using something like garch something like that it's probably not worth doing that. The reason is you're not going to be able to do it well enough to beat the people who do that all day like I'm very confident in saying that some average retail person is not going to have a better volatility model than the one I've got. I mean I've got 25 years experience I've done a lot of work on it I've got a big",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 56,
      "start_timestamp": "00:32:04",
      "start_timestamp_seconds": 1924.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=1924"
    }
  },
  {
    "text": "people who do that all day like I'm very confident in saying that some average retail person is not going to have a better volatility model than the one I've got. I mean I've got 25 years experience I've done a lot of work on it I've got a big knowledge base and it's a really complicated model. Mine has nice colors in it though. Mine's in a spreadsheet so doesn't have any colors in it but but my models no good compared to like I don't know Jane Streets or Susquehadas so I wouldn't I wouldn't trade on the basis of my model so that's not the way to do it. The way to do it is to look for idiosyncratic situations where volatility might be mispriced because you're looking at a risk premium right so look for situations where people are prepared to pay more for risk insurance than they should. It's like being a fireman you want to run towards the fire so whenever you have a situation where you think I really want to buy options right now you know because I don't know there's an election. There's an earnings event there's a third meeting. That all situations where you should be selling options if your first inclination is to buy them you're not the only one with that inclination so that's when you should be selling. So looking for those idiosyncratic risk drivers is much better than trying to come up with a sort of",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 56,
      "start_timestamp": "00:33:45",
      "start_timestamp_seconds": 2025.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2025"
    }
  },
  {
    "text": "all situations where you should be selling options if your first inclination is to buy them you're not the only one with that inclination so that's when you should be selling. So looking for those idiosyncratic risk drivers is much better than trying to come up with a sort of a technical pricing model. Yeah so I honestly I would look somewhere else that's one of the problems I think a lot of retail have is that trying to play the same game as the professionals right and you will lose that's one of the reasons people retail lose is because they do the wrong thing you don't have to play that game there are other things you can do you can wait. You can trade only when these other events happen like you could make pretty good money trading just Fed announcements 10 times a year. I can't do that because if I tell my boss oh I'm going to trade 10 times a year and be like I'm not paying you to do that. I'm going to do another 240 days a year. So retail can do stuff that I can't but they also have to do stuff that I'm not doing. I think one of the common conversations I see and I think you've covered it somewhat but I'd like to dive into this concept further where people who you know buy premium or essentially saying oh well I'm just I'm buying gamma and I'm okay with",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 56,
      "start_timestamp": "00:35:03",
      "start_timestamp_seconds": 2103.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2103"
    }
  },
  {
    "text": "that I'm not doing. I think one of the common conversations I see and I think you've covered it somewhat but I'd like to dive into this concept further where people who you know buy premium or essentially saying oh well I'm just I'm buying gamma and I'm okay with that like that's their hypothesis essentially that gamma will save them what do you think about that. Let's say I'm an art dealer and I'm like well I'm an art dealer I have to buy paintings so I'm just going to buy paintings I don't care what price I pay for it. Does that sound like a good business plan. Sounds right. Because that's what these people are doing they're saying I'm going to buy gamma. Every business has to buy things below what they're worth and sell them more than what they're worth. So it's like yeah buy and gamma is a great thing but if you get it cheap but selling gamma is a great thing as well if you sell it expensive. So I think a lot of people come in with this preconceived notion of the position they want rather than the edge they see. I mean there's no buying gamma just because it's just like I found out what options do I'm going to buy them but you're paying the wrong price. There's no business in the world that succeeds paying the wrong price for something. And on that same vein and I assume your",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 56,
      "start_timestamp": "00:36:16",
      "start_timestamp_seconds": 2176.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2176"
    }
  },
  {
    "text": "mean there's no buying gamma just because it's just like I found out what options do I'm going to buy them but you're paying the wrong price. There's no business in the world that succeeds paying the wrong price for something. And on that same vein and I assume your answer will simply be the inverse but and I'm actually specifically talking about two separate communities on Reddit which is always entertaining to me. And there are groups like that that are just vehemently I buy gamma because gamma moves and then there is I'm sure you've heard of at least in passing you know the theta gang. And they only sell always because their thought process is well time always passes so how could I lose if time passes. So I think it's not just that I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 56,
      "start_timestamp": "00:37:38",
      "start_timestamp_seconds": 2258.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2258"
    }
  },
  {
    "text": "I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to buy gamma but I'm not going to get anymore beta bonus alpha Australia get cetretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretretret straddles than strangles because if you're wrong you'll find out a lot quicker. Whereas if you just keep selling strandles you might be wrong and there's no feedback coming to you. You can only learn if you're getting feedback and if you're selling strangles then the market's not giving you feedback. So the Theta gang, they have a valid point that implied volatility is usually too high. But if they called themselves the short Vated gang it would be much more what they're actually doing. But also, volatility just because it's usually too high isn't always too high. I mean the way I say tell it to people is like look, do you know any gang members who are",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 56,
      "start_timestamp": "00:38:28",
      "start_timestamp_seconds": 2308.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2308"
    }
  },
  {
    "text": "they called themselves the short Vated gang it would be much more what they're actually doing. But also, volatility just because it's usually too high isn't always too high. I mean the way I say tell it to people is like look, do you know any gang members who are still being gang members when they're 80? No, because they're dead or they're in prison. That's what's going to happen to the Theta gang too as well. They're not going to blow up. If you sell options indiscriminately eventually yeah you'll blow up. Now the to start diving into this a little bit further. So I actually have found the same kind of the same kind of answer as you're highlighting with preferring short straddles versus strangles. I think I arrived at it probably because of a busted reason I thought just well I guess indirectly it circles back to a point I first started selling straddles it was because I just started noticing that I was getting paid more than the moves in general even though it seems you know kind of scary when I was doing this. And over time I started realizing that the straddles and I'd like your perspective on this point specifically. The straddles sometimes it's hard for me to tell if I'm wrong because volatility is mispriced or if I'm wrong simply because the market got to move maybe that's the same right same realize volatility is larger. But I'm curious how if you",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 56,
      "start_timestamp": "00:39:55",
      "start_timestamp_seconds": 2395.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2395"
    }
  },
  {
    "text": "like your perspective on this point specifically. The straddles sometimes it's hard for me to tell if I'm wrong because volatility is mispriced or if I'm wrong simply because the market got to move maybe that's the same right same realize volatility is larger. But I'm curious how if you separate those two concepts when you're selling straddles. Yeah it's it's difficult because a couple of days ago I can't remember when it was it was like Monday or Tuesday this week seems like years ago now right there was a day when the SP moved basically continuously the whole day in one direction and I think it went down but I again no idea. If you'd sold the straddle then the realized volatility was much higher than what you'd sold it at so if you'd just sold the straddle and gone away for the day you would have lost money. But had you sold the straddle and then hedged it throughout the day you actually ended up making money because the path it took was so easy to hedge because it just kept on going down smoothly and slowly so you could just keep selling futures all the way down. So that's a situation where I was short volatility my volatility forecast was completely wrong but I still made money because of just the path it took. Had it jagged down and then jagged back up again I would have lost money right that jumped around and controllably I",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 56,
      "start_timestamp": "00:41:02",
      "start_timestamp_seconds": 2462.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2462"
    }
  },
  {
    "text": "down. So that's a situation where I was short volatility my volatility forecast was completely wrong but I still made money because of just the path it took. Had it jagged down and then jagged back up again I would have lost money right that jumped around and controllably I would have lost money. So one of the problems with options is you can be completely wrong and make money and when I'm wrong I like to know I'm wrong I knew I'm wrong in that situation because I've seen that path dependency play out so many times. But I think you've got to make it as easy as possible to get valid feedback back from the market. See in terms of a forecast leaving aside what I said about strangle and sorry condors and butterflies being the same that was a different in different context and people again there are so many nuances and context dependent answers here that. There's no one rule here that applies to everything but the point I'm trying to make here is if you're short volatility there's not much different selling a strangle and a strangle in terms of the edge you're getting right. The difference is you're trading off lots of you're trading off percentage of wins against the size of the wins right and that's. Particularly if you're not a full time person that's a dangerous thing to do. So when you're trading things like straddles or strangles and you're hedging I",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 56,
      "start_timestamp": "00:42:08",
      "start_timestamp_seconds": 2528.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2528"
    }
  },
  {
    "text": "The difference is you're trading off lots of you're trading off percentage of wins against the size of the wins right and that's. Particularly if you're not a full time person that's a dangerous thing to do. So when you're trading things like straddles or strangles and you're hedging I assume you're you know like you were saying you're hedging with futures or for retail traders if you're trading like straddles in you know spy kind of the smaller index ETFs. Have you found different circumstances where you will delta hedge and other circumstances where you choose to abstain from delta hedging because I can also say I have found myself in the scenario that if I try to very specifically and discipline leave execute delta hedging sometimes at that actually hurts me more than it helps me. And I've started to become more selective with how I choose when I want to delta hedge but I'd like to hear your thoughts on that. Yeah you'll always find situations where in retrospect you made the wrong decision. Of course. Have I done that on Tuesday I would have lost a ton of money and as it is I made money. So it's different it's looking back at individual cases is always dangerous but I think it's more dangerous when you say I'm more selective because you see the cases where you've made the wrong decision in the past. How are those selective decisions working out for you because and what",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 56,
      "start_timestamp": "00:43:25",
      "start_timestamp_seconds": 2605.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2605"
    }
  },
  {
    "text": "So it's different it's looking back at individual cases is always dangerous but I think it's more dangerous when you say I'm more selective because you see the cases where you've made the wrong decision in the past. How are those selective decisions working out for you because and what are you basing that selection process on. A lot of people get tied up in this idea that because they're hedging and it involves trading stocks or futures that they're making a directional bet but you're not it's like you're literally saying I don't want a directional bet because I don't understand it. So once you're then saying I'm going to be selective it's completely you're putting two contradictory things together and I'm also would think your ability to successfully predict direction is zero particularly if you're crossing that asks for it. So I think that's more dangerous. I'm very I very rarely do that part of it's because I can't like I don't have a particularly big book on right now but it's got 160 something different stocks of it like I can't be watching them and making idiotic decisions about all of them. It's just impossible so almost everything I do now is whether it's automated or not it's pretty much all algorithmic. So speaking of that then and to shed just some additional context on the way that I've started to choose to to delta hedge especially short straddles is I've actually started opening up the delta",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 56,
      "start_timestamp": "00:44:53",
      "start_timestamp_seconds": 2693.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2693"
    }
  },
  {
    "text": "everything I do now is whether it's automated or not it's pretty much all algorithmic. So speaking of that then and to shed just some additional context on the way that I've started to choose to to delta hedge especially short straddles is I've actually started opening up the delta range I will let it move within before I start delta hedging that's really the main selection criteria I've been trying to optimize over time and I'm wondering if you have any opinion on an optimal range I know you've studied this stuff obviously far more than I have I have a smaller data set that I've been back testing and just running studies on to get some ideas but curious your thoughts there. Yeah backtesting stuff like that's really dangerous because you'll follow the number that's worked really well on the past and it's probably going to be relatively meaningless like we don't really have a lot of options data right like we think that we do but we really only have liquid options data and a large number of products for like 15 years and you can make a good argument that it's not 15 years of independent data it's like regimes that last for years at a time so I think backtesting options is that testing anything is fraught with difficulties I think with options it's even worse particularly because then your delta hedging you've got all these other decisions you've got to make I think the",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 56,
      "start_timestamp": "00:46:26",
      "start_timestamp_seconds": 2786.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2786"
    }
  },
  {
    "text": "data it's like regimes that last for years at a time so I think backtesting options is that testing anything is fraught with difficulties I think with options it's even worse particularly because then your delta hedging you've got all these other decisions you've got to make I think the most important thing for hedging that people sort of forget is that it's a really expensive process right and especially for retail where their costs are enormous even if you're working through a zero transaction cost broker right there are transaction costs in there you just not seeing them up front you've got borrow costs every every time you touch the keyboard it costs you money so widening out things is definitely a good idea you should almost think of it as you hedge when you're all like oh my god I'm totally wrong so instead of trying to lock in volatility by trading like I don't know in the spy based on all the parameters and stuff today I was trading about every 80 cents for a retail person you probably want to go let it go a lot more than that like if the spread if the straddles like 2 you shouldn't be trading every 80 cents maybe you want to re-hedge it when it goes 4 or something you want to be you want to let your bet play out without touching it too much because it's just too expensive and costs are really insidious because you",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 56,
      "start_timestamp": "00:47:35",
      "start_timestamp_seconds": 2855.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2855"
    }
  },
  {
    "text": "like 2 you shouldn't be trading every 80 cents maybe you want to re-hedge it when it goes 4 or something you want to be you want to let your bet play out without touching it too much because it's just too expensive and costs are really insidious because you don't see individually but if you look at your statement at the end of the year yeah it's like oh my god I paid away 15 of my profits on costs and that's not a 15 would not be an unusual number for an active trader no I totally agree with you and I've actually that's one of the reasons that went into that decision cycle it was interesting to hear you quote the hedging parameters using the price of the strangle as compared to the delta of the position is there a reason for that I just thought the example would be easier got it okay yeah in practice if you go through all the math and stuff you'll end up with a delta range that you're prepared to take so you're like I start off flat delta yep when my delta range gets to within plus or minus 500 delta's or whatever then I'll hedge but that ranges dependent a lot on a lot of other things as well so what other things do you base that on well having 500 delta's is very different if you've got a lot of gamma as opposed to if you don't",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 56,
      "start_timestamp": "00:49:03",
      "start_timestamp_seconds": 2943.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=2943"
    }
  },
  {
    "text": "500 delta's or whatever then I'll hedge but that ranges dependent a lot on a lot of other things as well so what other things do you base that on well having 500 delta's is very different if you've got a lot of gamma as opposed to if you don't so if you've got more gamma you have to widen things out because the definition of what it means to be flat is very different if I'm long a ton of gamma if the option if the stock we bid an offer like delta changes so it just changes whether your flat or not has to be done in context relative to your gamma yeah yeah follow and you got no gamma you shouldn't you've got no volatility risk you should be flat completely right yeah because most of at least what I've attempted to do is start with is neutral to gamma's I possibly can and then just hedge off delta's but I've I still struggle to find the right range as just let's say a perth sentence of delta's or something like that whatever to to try to codify it is optimal do you have any recommendations on how to optimize that kind of delta hedging approach not in a simple way there are mathematical approaches to it frankly now the most difficult map it's the most difficult mathematics of any of the option price and stuff it's far more difficult than black shells itself but you can",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 56,
      "start_timestamp": "00:50:08",
      "start_timestamp_seconds": 3008.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3008"
    }
  },
  {
    "text": "how to optimize that kind of delta hedging approach not in a simple way there are mathematical approaches to it frankly now the most difficult map it's the most difficult mathematics of any of the option price and stuff it's far more difficult than black shells itself but you can go through all the mathematics but most people won't really understand that at the other end of it there is an approximate equation that you can use it will give you my delta is the white shells delta plus or minus this correction effect problem with that is you need to have a risk tolerance input and the way the way you really get that risk tolerance is by saying when I'm trading options I'm prepared to let my delta's grow to this size so going through that process because it's utility dependent you need to calibrate it and the way you calibrate it is with your option trading as an input so it's only really useful if you trading a multitude of products so if you always trade SPY and trade SPY only you don't really gain a lot by doing that but if you trade SPY and IWM and DIA and Microsoft and Google and all these different price options and different volatilities then it will give you something that's consistent across all of them but that's really the best you can do because any hedging is intrinsically going to be dependent on your risk tolerance because hedging",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 56,
      "start_timestamp": "00:51:23",
      "start_timestamp_seconds": 3083.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3083"
    }
  },
  {
    "text": "and DIA and Microsoft and Google and all these different price options and different volatilities then it will give you something that's consistent across all of them but that's really the best you can do because any hedging is intrinsically going to be dependent on your risk tolerance because hedging is literally how do I remove my risk right what you think of as risk and what I think of as risk it's going to be different numbers right and I know from reading I think it's your latest book there was there was sections in there about hedging with different products right like the preference typically would be to hedge with whatever product is you have the trade in but sometimes you might be you with 160 positions on do you still try to hedge well you said a lot of it's algorithmic at this point so probably you just hedge within those individual tickers or do you use like beta weighted delta's and then hedge off of that for the portfolio writ large when I do when I do a hedge the individual hedge is done in the stock concert and for 99 of options traders that's what you'd do because they're going to be liquid options on stocks that are more in liquid so if there's enough liquidity for options to even trade and for you to trade them you can definitely hedge with the stock so the situation where you wouldn't would be if you're trading",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 56,
      "start_timestamp": "00:52:44",
      "start_timestamp_seconds": 3164.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3164"
    }
  },
  {
    "text": "you'd do because they're going to be liquid options on stocks that are more in liquid so if there's enough liquidity for options to even trade and for you to trade them you can definitely hedge with the stock so the situation where you wouldn't would be if you're trading an OTC option on something like I don't know weather right and you might go out and buy weather you know so you're going to have to find a hedging basket that is in some way correlated with that risk I do aggregate all my stock positions to a beta weighted position so I can see if there's some P goes up this much how much I lose just sizing but that's only as an import for when I would decide to hedge once I decide to hedge it's all done on the single stocks got it and I know we're coming up on time but I have another question for you it's slight change of pace but I know your general disposition when it comes to just direction and like most traders ability to guess direction and I'd like your thoughts on the traders that are effective at guessing direction so let's say you were one of those traders what would you change about your strategy if that were the case where you found that you might even have a lower hit rate but the way that you're able to find things that have big legs that it's profitable",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 56,
      "start_timestamp": "00:53:56",
      "start_timestamp_seconds": 3236.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3236"
    }
  },
  {
    "text": "direction so let's say you were one of those traders what would you change about your strategy if that were the case where you found that you might even have a lower hit rate but the way that you're able to find things that have big legs that it's profitable for you even trading equities I wouldn't trade options at all you would just trade the equities it's like generally speaking you should trade the simplest thing you can to express the view you've got like by trade even if you're the if you're a good directional trader and I'm not saying it's impossible right I'm saying it's much less likely than most people think it is yes but given that you are trading options is almost certainly the wrong thing because when you're trading options you're trading volatility whether you want to or not so the edge you've got is an involuntility so stay away from volatility trade just trade the underlobe what would you say if the response to that then was well I like the leverage of options so I use leaps I go really far out in time super far in the money not a lot of extrinsic value so not a ton of volatility to be in there well you're still probably paying the wrong price unless you can convince me or not and it's like leverage is like the non-linearity aspect oh you like leverage that's great you've got to pay the right price",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 56,
      "start_timestamp": "00:55:09",
      "start_timestamp_seconds": 3309.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3309"
    }
  },
  {
    "text": "of extrinsic value so not a ton of volatility to be in there well you're still probably paying the wrong price unless you can convince me or not and it's like leverage is like the non-linearity aspect oh you like leverage that's great you've got to pay the right price for it I mean if it's all it's only leverage you want you can get leverage lots of other ways you know you can just trade on margin you don't have to go out and buy leaps where you're crossing a wider bit ask spread probably paying too much it's just you're you're not implementing your prediction in the simplest way possible on and that's almost always a mistake yeah there's lots of things you can do with options but unless you're getting an edge to do it you probably shouldn't be doing those things with options I think most people would benefit from not trading options at all and I'm not saying that retail can't trade options but you have to do the work involved beforehand so I'm not in any way denigrating retail I think a lot of people I've met on the retail side had a lot of great ideas and I learned a lot from them because I'm coming in from different angles different backgrounds they didn't all do the same courses they didn't all read the same books but you still have to do the work so unless you're prepared to put the work in",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 56,
      "start_timestamp": "00:56:17",
      "start_timestamp_seconds": 3377.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3377"
    }
  },
  {
    "text": "of great ideas and I learned a lot from them because I'm coming in from different angles different backgrounds they didn't all do the same courses they didn't all read the same books but you still have to do the work so unless you're prepared to put the work in options probably aren't the best vehicle I actually agree with you because I mean I've been trading I started trading options in 2007 so I've been trading them for a while now and I do notice that a lot of retail traders have this it's so strange it's like this they have like I call it like a binary mindset it's either like I trade options or that's it like I don't trade anything else and to your point I do think that there's kind of a gray area where sometimes it might make sense that a derivative might be the better place sometimes the equity might be the better place and it's the same thing when it comes to like analysis you know I run into the just like we were talking about with premium camps right you're either long premium or short premium there's the people that are technical analysts or fundamental analysts and it's just very strange to me to see like such a disadvantaged group of people such as retail traders be so selective over like what they'll use it's very surprising to me but I do all that as well so I don't want in",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 56,
      "start_timestamp": "00:57:28",
      "start_timestamp_seconds": 3448.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3448"
    }
  },
  {
    "text": "technical analysts or fundamental analysts and it's just very strange to me to see like such a disadvantaged group of people such as retail traders be so selective over like what they'll use it's very surprising to me but I do all that as well so I don't want in any way sort of say look I'm be like me I don't make any mistakes but a lot of the a lot of the ways I know that these are mistakes is because I've made them right and then once you know what some mistake doesn't mean you're going to always not do it so I definitely fall into that where it's like I'm an options trader I've got an idea I'm going to trade some options and then you're like options were not the natural vehicle for that and furthermore if I have that thought if I do a trade and I say options aren't the way to do this trade stocks the way to do it I probably shouldn't be doing that trade because I don't have any edge in that so I think one of the problems people have is they come up with a viable strategy and they think right now what I need is another strategy that helps diversify that okay I mean that is think how difficult that is right it's like if you you have to it's like if LeBron James said right I'm the best basketball player in the world I've got",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 56,
      "start_timestamp": "00:58:30",
      "start_timestamp_seconds": 3510.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3510"
    }
  },
  {
    "text": "and they think right now what I need is another strategy that helps diversify that okay I mean that is think how difficult that is right it's like if you you have to it's like if LeBron James said right I'm the best basketball player in the world I've got to learn how to be the good tennis player now I mean it's hard enough to do one thing so that you shouldn't even try to come up with something else you should make that one you should get better at the thing you can do and yeah you know what I want Tim uncorrelated strategies as well that's not going to happen it's like it's hard enough being good at one thing well and then actually dovetails beautifully and the last thing I wanted to ask you is one of the things I've heard you talk about is exactly that like when retail traders try to be good at everything so if you were a retail trader that's first starting off what is it that you would want to be good at I think probably learning situations where selling volatility was a good bet got it because the edge is usually with selling volatility and if you can find idiosyncratic events of timed uncertainty so you don't know the result of the event but you know when it comes out so earnings elections federal reserve meeting sometimes FDA announcements that kind of thing and then if you can become",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 56,
      "start_timestamp": "00:59:27",
      "start_timestamp_seconds": 3567.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3567"
    }
  },
  {
    "text": "is usually with selling volatility and if you can find idiosyncratic events of timed uncertainty so you don't know the result of the event but you know when it comes out so earnings elections federal reserve meeting sometimes FDA announcements that kind of thing and then if you can become comfortable with selling options on those and managing that risk so learning how to size it learning how to not panic all that kind of stuff that's where I would start with trading options and it's almost exactly the opposite of what people do people look for situations where they predict the direction of the stock and then you make all my options which is something you can't make a prediction on very accurately and then you're paying too much for that thing as well so you've made two mistakes right off the bat I love that so I there's literally a million other questions I'd love to go into I'll have to rope you back on again at some point I I love talking about this stuff and it's interesting hearing like a very sophisticated take on it so as always you know thank you for spending some time with us would uh what are you up to this weekend any good plans? Tomorrow I'm watching the all blacks play in England which will either be good at the New Zealand wins and terrible if they don't so I'm not sure how that would plant out and then I've",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 56,
      "start_timestamp": "01:00:33",
      "start_timestamp_seconds": 3633.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3633"
    }
  },
  {
    "text": "with us would uh what are you up to this weekend any good plans? Tomorrow I'm watching the all blacks play in England which will either be good at the New Zealand wins and terrible if they don't so I'm not sure how that would plant out and then I've I've got to actually do some work stuff as well so just some meetings with people who are in from out of town that's okay I mean I don't mind it it's I mean I kind of do this for fun even if I wasn't getting paid for which I guess that's fair and so no bike riding nothing like that a motorbike riding yeah not I mean it's freezing cold here it's actually snowing now already I was gonna ask about that we were spoiled we had 75 degree weather a couple of weeks ago I actually missed putting my car away for the winter by a day I the first snow of the year was the day I did it oh no do you store them somewhere different than where you're at? kind of I was I it was getting fixed and so I moved it out of the there into the garage but I had to drive it 40 miles or something to do that yeah that wasn't an ideal day to do it but it's a it's a good day if you want to you know just test your relationship with death you know every once",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 56,
      "start_timestamp": "01:01:48",
      "start_timestamp_seconds": 3708.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3708"
    }
  },
  {
    "text": "the there into the garage but I had to drive it 40 miles or something to do that yeah that wasn't an ideal day to do it but it's a it's a good day if you want to you know just test your relationship with death you know every once in a while you got to know where you stand it would be a lot of fun if I was on the roads all by myself yes I mean snuttering around when you've got plenty of space and you're not going to hit anything there's a lot of fun yeah I remember when I used to drive home from college I went to college in for my undergrad in Rochester and I had a Jeep Wrangler so it's just a box on wheels so not good with wind and I would drive home in the snow and there were literally periods of time where I would realize that I was no longer on the road for like four miles I was like on the side of the road and had to get back on the highway so yeah I totally hear you there but well I hope you have an awesome weekend and thank you again you know so much for hanging out for a little bit talking about trading with everybody thanks being fun all right take care",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 56,
      "start_timestamp": "01:02:47",
      "start_timestamp_seconds": 3767.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3767"
    }
  },
  {
    "text": "awesome weekend and thank you again you know so much for hanging out for a little bit talking about trading with everybody thanks being fun all right take care",
    "metadata": {
      "video_id": "lbpGVAWR6d0",
      "title": "Don’t Make These Common Trading Mistakes w/ Euan Sinclair",
      "url": "https://www.youtube.com/watch?v=lbpGVAWR6d0",
      "upload_date": null,
      "duration": 3836.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 56,
      "start_timestamp": "01:03:46",
      "start_timestamp_seconds": 3826.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=lbpGVAWR6d0&t=3826"
    }
  }
]