[
  {
    "video_id": "ld6vn5GtAeI",
    "title": "Option Greeks Simplified: Vega Explained",
    "text": "What's up, Alias? Today we're going to talk about how this can destroy your options trades continuing with the option Greeks simplified series today we're looking at Vega. At the end of the video you will have an understanding, a reminder of what Vega is, but more importantly how to practically apply it to your trading. Let's start with a reminder, Vega essentially tells us the rate of change of premium per one point change in implied volatility. There are certain traits of Vega that are really, really important to keep in mind. And that's actually what this shows us. On the left hand side what I've done is look at four different expirations, five days, 30, 86, 450. And I plotted three different deltas. I plotted a 20 delta, a 50 delta, and an 80 delta. I picked these so that you can understand the relationship of Vega across time and across moniness. So if we focus first on day-to-day expiration notice how the further out in time you go, the higher this line is. This means longer dated options have more overall Vega period. And you can see that this actually goes down in descending order. So as we go from 450 to the 86 expiration to 30 to 5. This is not hypothetical market data. This is real market data. This is taken from an actual options chain. That's the first thing you have to be aware of. The second thing is the relationship to moniness. Notice",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 105.88,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=ld6vn5GtAeI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ld6vn5GtAeI&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 545.0
  },
  {
    "video_id": "ld6vn5GtAeI",
    "title": "Option Greeks Simplified: Vega Explained",
    "text": "we go from 450 to the 86 expiration to 30 to 5. This is not hypothetical market data. This is real market data. This is taken from an actual options chain. That's the first thing you have to be aware of. The second thing is the relationship to moniness. Notice how all of these have this little peak that happens at around 50 delta. Vega is going to be highest in any expiration around at the money. Why? Because that's where the most extrinsic value is. That's where there's more total value for Vega volatility to impact because it cannot impact intrinsic value. And if you're super far out of the money there isn't that much extrinsic value out there at all. This is why you normally see it peak around at the money. Why does all of this matter? Well when you decide to trade options, you're going through a bunch of different inputs. Some of which are how does selling premium become impacted by stuff like gamma. And if you're buying options, how does volatility help or hurt me? And I will show you. If we take a look at this plot, this is in RGTI today's 25 October just to give you a sense of what the data is. And I want to show you this peak. So this is looking at seven day IV. I want to show you a couple other things. Notice the relationship between the seven day vol, again something like the 30",
    "start_timestamp_seconds": 89.32,
    "end_timestamp_seconds": 179.96,
    "start_timestamp": "01:29",
    "video_url": "https://www.youtube.com/watch?v=ld6vn5GtAeI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ld6vn5GtAeI&t=89",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 545.0
  },
  {
    "video_id": "ld6vn5GtAeI",
    "title": "Option Greeks Simplified: Vega Explained",
    "text": "October just to give you a sense of what the data is. And I want to show you this peak. So this is looking at seven day IV. I want to show you a couple other things. Notice the relationship between the seven day vol, again something like the 30 day vol. Notice how they don't necessarily move the same. The reason why this matter so much is a lot of times people will make their trade decision based on what the underlying implied volatility is. That's 30 day vol. So if, for example, you choose to trade something in RGTI because you think 30 day vol is really cheap down here at 96%. We can look at what that is in terms of a percentile, but let's just pretend that this is relatively cheap. And you're like, I think it's going to go up in the near term. And so you buy cheaper seven day options. You've now made a massive mistake. You've made your vault decision based on 30 day vol yet you're trading seven day vol. This example, 30 day vol is absolutely crushed compared to seven day vol. So let's take a look at a practical scenario. Let's say that you choose to buy an at the money call that seven days out in RGTI. And I'm going to pretend that this was on the 12th of August. What happens if we fast forward one day from the 12th of August to the 13th? What is",
    "start_timestamp_seconds": 163.12,
    "end_timestamp_seconds": 262.52,
    "start_timestamp": "02:43",
    "video_url": "https://www.youtube.com/watch?v=ld6vn5GtAeI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ld6vn5GtAeI&t=163",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 545.0
  },
  {
    "video_id": "ld6vn5GtAeI",
    "title": "Option Greeks Simplified: Vega Explained",
    "text": "scenario. Let's say that you choose to buy an at the money call that seven days out in RGTI. And I'm going to pretend that this was on the 12th of August. What happens if we fast forward one day from the 12th of August to the 13th? What is what happens to implied volatility? It goes from 152% down to 91.6. Let's see what that does to an option. I plotted an option calculator here with a bunch of different stuff in it. This is actually something that the outlier pro members are building right now for themselves to help do this kind of analysis in a little more hands-on way. So it's useful. It's useful information to have. But you can build your own leveraging what you see here. Easy enough. But I want to show you a specific thing. I've input an option detail. The only thing to note is everything is the same. Except I fast forwarded one day and then I mirror that change involved that you saw in this example here. So going from 152 to mid 90s. Low 90s I should say. And I didn't change any of the Greeks. I purposely want to isolate as much as I can. What everything else looks like. So I have everything else the same. What happens to implied volatility? Imply volatility dumped by 60 points. It's a 39.7% contraction involved. How does this impact your P&L? So again, picture this with me. You bought a",
    "start_timestamp_seconds": 243.12,
    "end_timestamp_seconds": 337.12,
    "start_timestamp": "04:03",
    "video_url": "https://www.youtube.com/watch?v=ld6vn5GtAeI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ld6vn5GtAeI&t=243",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 545.0
  },
  {
    "video_id": "ld6vn5GtAeI",
    "title": "Option Greeks Simplified: Vega Explained",
    "text": "to isolate as much as I can. What everything else looks like. So I have everything else the same. What happens to implied volatility? Imply volatility dumped by 60 points. It's a 39.7% contraction involved. How does this impact your P&L? So again, picture this with me. You bought a call. You paid whatever you paid for it. And then one day passes. Nothing else changes. Price stayed the same. Delta stayed the same. I'm just pretending even theta stayed the same. Everything stayed the same. Vega didn't move. Everything stayed the same. Price didn't move. Just volatility fell. What happened to your option? It gets cut in half. Your option is now worth 52% less than it was one day before. Why does this matter? Well, let's say you bought that call and let's say that it actually went up a little bit. Let's say it goes up by a dollar. Let's say it went up to 39, 84. So we get a dollar change in our delta. What's our net? We still are losing money. We got a dollar change. Okay? Maybe we try getting a $2 change. Maybe now we got to two bucks in. We're still losing money. So the point that I'm making here is that you can have something that moves in your favor directionally. But if you were not paying attention to the vault component to it, then you can lose money. Now there's one other thing you have to be aware of.",
    "start_timestamp_seconds": 314.04,
    "end_timestamp_seconds": 406.76,
    "start_timestamp": "05:14",
    "video_url": "https://www.youtube.com/watch?v=ld6vn5GtAeI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ld6vn5GtAeI&t=314",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 545.0
  },
  {
    "video_id": "ld6vn5GtAeI",
    "title": "Option Greeks Simplified: Vega Explained",
    "text": "losing money. So the point that I'm making here is that you can have something that moves in your favor directionally. But if you were not paying attention to the vault component to it, then you can lose money. Now there's one other thing you have to be aware of. Impact to a volatility surface do not impact all of the terms the same. Typically speaking, when you have some sort of catalyst, something that's going on in the front, it will impact the front more. And then as you have stuff going on further out, that's not is common. The back doesn't change as much. Again, why does this matter? It's because when we look at a graph like this and we say like, oh shit, those 450 dates to expiration options have a lot of Vega. So if I buy an option and then volatility goes up, I should make a ton of money, which is a good initial thought. But as usual, an option to small nuance than that, you would again probably lose money. Why? It's because the overall volatility doesn't change as much 450 days out. That's a long time for a near term catalyst news to digest and bounce around. That's why you don't see it move as a gross value that much. And again, you can see that represented here. If I keep the seven day vol on and I bring this out to 365 days, just notice the difference in those lines.",
    "start_timestamp_seconds": 392.28,
    "end_timestamp_seconds": 485.64,
    "start_timestamp": "06:32",
    "video_url": "https://www.youtube.com/watch?v=ld6vn5GtAeI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ld6vn5GtAeI&t=392",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 545.0
  },
  {
    "video_id": "ld6vn5GtAeI",
    "title": "Option Greeks Simplified: Vega Explained",
    "text": "news to digest and bounce around. That's why you don't see it move as a gross value that much. And again, you can see that represented here. If I keep the seven day vol on and I bring this out to 365 days, just notice the difference in those lines. What do you see? The total deviation off of the 365 days, there's still deviation for sure. But it's nothing like what you see in this near term. Why does this matter? It's because you have to pay attention to two factors that are happening in unison. The first factor is the fact that further out in time has higher Vega, but raw vol doesn't change as much. And then that switches. Near term has lower Vega. But you tend to see much bigger changes in vol. You have to take that into account whether you're buying or selling so that you're not trading vol in the wrong term. Remember, match it to the term that you're trading. But then the second thing is to understand those two very important details on how it behaves so that you do not do stuff. Something happens and then you're like, why did I lose money? It happens a lot. There's no reason for it to happen. Who's now you know this? Be an outlier? See you later.",
    "start_timestamp_seconds": 467.32,
    "end_timestamp_seconds": 544.36,
    "start_timestamp": "07:47",
    "video_url": "https://www.youtube.com/watch?v=ld6vn5GtAeI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ld6vn5GtAeI&t=467",
    "chunk_index": 6,
    "word_count": 225,
    "upload_date": null,
    "duration": 545.0
  },
  {
    "video_id": "ld6vn5GtAeI",
    "title": "Option Greeks Simplified: Vega Explained",
    "text": "I lose money? It happens a lot. There's no reason for it to happen. Who's now you know this? Be an outlier? See you later.",
    "start_timestamp_seconds": 536.36,
    "end_timestamp_seconds": 544.36,
    "start_timestamp": "08:56",
    "video_url": "https://www.youtube.com/watch?v=ld6vn5GtAeI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ld6vn5GtAeI&t=536",
    "chunk_index": 7,
    "word_count": 25,
    "upload_date": null,
    "duration": 545.0
  }
]