[
  {
    "video_id": "lgennNB0WlI",
    "title": "Sizing speculative options trades",
    "url": "https://www.youtube.com/watch?v=lgennNB0WlI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 2,
    "text": "Let's see that you want to speculate in Tesla and you're trying to figure out how to appropriately size this speculative trade in your portfolio. Well, it's really simple. Options they do add leverage. However, you can still apply the very same methodology that you would with equity. So let's say that you wanted to play it to the upside. You think it's too extended to the downside. Well, in that case, maybe we take a look at setting a stop at something like two, six, something that's below the near term support that's been built or whatever your strategy calls for. And then what you do is based on the kind of trade you would put on, whether it's short puts, long calls, you would see what the loss size would be at this point. And then you would say based on a one lot is this risk. Okay. And typically speaking for speculative trades for my own portfolio, sometimes they can be pretty large. So I can size them up to even 10 which would be exceedingly large for how I trade the overwhelming majority of speculative sizes for me, or between half a percent and three percent of total portfolio value at risk. So you can take a look see if it makes sense based on the idea that you have the size that you have. But you simply apply a similar methodology. You can't just go into it and see how it goes. It's terrible way",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=lgennNB0WlI&t=0"
  },
  {
    "video_id": "lgennNB0WlI",
    "title": "Sizing speculative options trades",
    "url": "https://www.youtube.com/watch?v=lgennNB0WlI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 2,
    "text": "of total portfolio value at risk. So you can take a look see if it makes sense based on the idea that you have the size that you have. But you simply apply a similar methodology. You can't just go into it and see how it goes. It's terrible way to trade. You know, our sealer.",
    "start_timestamp_seconds": 55.0,
    "start_timestamp": "00:00:55",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=lgennNB0WlI&t=55"
  }
]