[
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 68,
    "text": "you you we go into the pink white ward Party s develop 23 33 I think there's a little more for us to poke through there. And then I want to continue rolling through the rest of the broader library. So that is the game plan for today. Now for those that don't know, I am starting a recurring video. It'll probably be either Thursday or Friday. I'm not exactly sure what I'm going to do it. But I'm starting to track a coverage strangle allocation of my portfolio in GameStop. And the purpose behind this is to try and show a few different ways that we can leverage options to trade things like GameStop because GameStop is very, very lucrative for a lot of different reasons from an options trading perspective. Now I know that there's a lot of people that their overall preference is to hold GameStop not trade it, which is totally cool. And that's the point of me using something like the covered strangle, specifically. And it's because the base position is long equity. It's a holding of your choosing. Obviously, in this case, we were talking about choosing GameStop. And then we can trade options around that position. So I'm going to start doing a regular update on that. However, what I still don't have nailed down, which is exactly what I hope to nail down today is what size allocation. We use the purpose of the question is I want to use an amount",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=0"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 68,
    "text": "around that position. So I'm going to start doing a regular update on that. However, what I still don't have nailed down, which is exactly what I hope to nail down today is what size allocation. We use the purpose of the question is I want to use an amount of money that is relatable to the average GameStop holder. And a while ago, I asked the same question. And there was a flurry of different responses of how much, you know, the person like the average person might hold in GameStop. I saw everything from, you know, 5,000, 50,000 or something like that. And to be honest, the way that I'm structuring this is I already have a series of GameStop shares that I bought that are set off to the side as part of this thing I've told you about a bunch of times now. So I'm not going to belabor that point. So what I'm doing is I'm taking a subset of those shares. And I'm going to use them for this portfolio. It's really not a portfolio. It's going to be in the primary portfolio. But for this allocation of the portfolio to run the strategy in. So I had originally selected 15,000 and to me, I think it was something between 10 and 20 K was like the average from the last time I asked this question. But it doesn't really matter. We can pick pretty much whatever number we want. I don't have like",
    "start_timestamp_seconds": 156.74,
    "start_timestamp": "00:02:36",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=156"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 3,
    "total_chunks": 68,
    "text": "in. So I had originally selected 15,000 and to me, I think it was something between 10 and 20 K was like the average from the last time I asked this question. But it doesn't really matter. We can pick pretty much whatever number we want. I don't have like several million in GameStop or anything like that. But I do have a portion of the portfolio. But it's, I don't know to say this without coming off wrong. It's just it's probably more my allocation is probably more than what most people would hold as my guess. So even though it's a smaller subset of the portfolio, I do it as a percentage. That's how I allocate stuff. So my guess is it can probably be whatever we want it to be. But the whole point. Again, is I want it to be something relatable so that as I'm talking about updating the position. It's like, oh, somebody else could like visualize that in their portfolio. Because that's the whole point. It's to try and teach not saying that this is the right way to do it. The only way to do it. It's just to try to teach people my skill set of options trading, but also to share a different approach. So. That's the goal. So in the comments are in the chat. I would literally love to hear what amount of money you would like me to use for the allocation of the portfolio. And the",
    "start_timestamp_seconds": 242.82,
    "start_timestamp": "00:04:02",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=242"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 4,
    "total_chunks": 68,
    "text": "people my skill set of options trading, but also to share a different approach. So. That's the goal. So in the comments are in the chat. I would literally love to hear what amount of money you would like me to use for the allocation of the portfolio. And the way it will work then going forward is pretty much whatever you pick, I'm going to update the allocation here. And because I already have the shares, what I'm doing is I'm picking an average basis for those shares based on the period that I had scaled in. And we will use that as the basis. And I will just track it like I typically would in well, typically Excel. But now I've moved a lot of this stuff over to Google sheets. So if there is a Lauren says do a poll on your community tab. The problem with poll is that I have to input specific numbers. And I would rather just eyeball it. Because I guess I could do that. That's a good wreck Lauren. It's just I maybe I do like a range or something. So let's do GME coverage triangle allocation size. So then we have like 5K. We have NK. We have maybe 20 K or 15 K. And then maybe we do like 25 K. And then I can't add more. So we can see what the breakdown is for this poll. And then if it's on the higher end, then I can",
    "start_timestamp_seconds": 309.32,
    "start_timestamp": "00:05:09",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=309"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 5,
    "total_chunks": 68,
    "text": "have like 5K. We have NK. We have maybe 20 K or 15 K. And then maybe we do like 25 K. And then I can't add more. So we can see what the breakdown is for this poll. And then if it's on the higher end, then I can run another poll and run numbers above 25. And then we have a poll. Fill. What up fill? It's actually really interesting that I do you go in and genuine question. Do you go in and Lauren says get your community tab going. You need you need to up your engagement to get your sub goal. Lauren, I'm not going to lie. You just went right over. I don't even know how the fuck that works to be honest. What the fuck is is the community tab where like I post. Where I make posts. Is that right? Hold on. Let me grab my channel. Lauren's about to fucking school me here. Okay. Community. Yeah. Okay. So this is where you do posts and stuff. I see. Got it. Yeah. Helpful. Oh, I see. So you mean to do the broader poll there versus the live stream. I understand that. Got it. Got it. Okay. Yeah. We'll see where this runs. And then we will. So I see even split between 10 and 15 on 18 votes. There's about 60 folks in here. So I'll give it a leave it up a few more minutes. And like I said, genuinely,",
    "start_timestamp_seconds": 374.32,
    "start_timestamp": "00:06:14",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=374"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 6,
    "total_chunks": 68,
    "text": "Got it. Got it. Okay. Yeah. We'll see where this runs. And then we will. So I see even split between 10 and 15 on 18 votes. There's about 60 folks in here. So I'll give it a leave it up a few more minutes. And like I said, genuinely, if we wanted to do a bigger allocation, I'm cool with it. I genuinely don't really care. I probably wouldn't go over like a few hundred thousand dollars for it. But I also just I have to imagine for the average person. Like even a hundred thousand dollars is probably just unrealistic. And I understand that. So the entire purpose for the allocation is not to go quite as far as small stacks. I hate small stacks. I did one of those a while ago. And it was a terrible. It's just super annoying. But what I want to do is I like I want to be able to talk to you about saying like yes, I have one short call against these 200 shares. And then I'm going to take the short call down at some point at a certain subset of profit. And then I'm going to sell another short call. And I want to explain and use this as a vector around like why it's being done the way it is. It definitely would definitely has to be more than 5K. Yeah, definitely has to be more than 5K. I would say the minimum viable that I",
    "start_timestamp_seconds": 475.32,
    "start_timestamp": "00:07:55",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=475"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 7,
    "total_chunks": 68,
    "text": "another short call. And I want to explain and use this as a vector around like why it's being done the way it is. It definitely would definitely has to be more than 5K. Yeah, definitely has to be more than 5K. I would say the minimum viable that I could do something like educational with would have to be 10K. Because right now I'm using 13 for this section. And if I get rid of this, that would still put me just over 10. So yeah, it would have to be at the very least 10K. I 5K unfortunately wouldn't really it would work, but I wouldn't be able to actually show the overall approach. It would be a very modified approach because of the sizing. So I see splits between 10 and 25. And on 23 votes, I'll leave the pull up for a little bit longer and just see if anybody else wants to vote if we get something around halfway because actually let me end this. And I want to ask one more question. So this one is going to be. And this might be more. More applicable. So for this question, pick the number that's closest. So the new question is what dollar amount of GameStop do you hold? And that's I think a better way to phrase this because what I want. Yeah, I want something that's as representative as possible. Gravitaris is what are the characteristics of the conformist stock when using the",
    "start_timestamp_seconds": 540.32,
    "start_timestamp": "00:09:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=540"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 8,
    "total_chunks": 68,
    "text": "closest. So the new question is what dollar amount of GameStop do you hold? And that's I think a better way to phrase this because what I want. Yeah, I want something that's as representative as possible. Gravitaris is what are the characteristics of the conformist stock when using the coverage and strategy great question. I have an entire playlist that goes through literally all of this ad nauseam. So I'm going to share the link to this playlist for you. And then I will give you the cliff notes version, which is something that I think is going to go up that has options with good liquidity. That's the that's the basis of it. And it's something that I would want to maintain a longer term position and meaning something that I would hold. Perspectively for greater than a year and stuff like that. Be william says, are you want to vote in that muddy river doing a podcast. So fun fact, it's actually not a muddy river at all. This is from this is from Iceland. This is a shot that I took with my drone. And this is actually glacial melt. So this is more like a pond than anything. It's definitely muddy, but it's not a river whatsoever. This is actually a massive glacier that's trickling down this whole thing and then slowly melting. I actually stood on this glacier. We walked on it with my wife and I the fun thing that's really difficult to",
    "start_timestamp_seconds": 634.32,
    "start_timestamp": "00:10:34",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=634"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 9,
    "total_chunks": 68,
    "text": "pond than anything. It's definitely muddy, but it's not a river whatsoever. This is actually a massive glacier that's trickling down this whole thing and then slowly melting. I actually stood on this glacier. We walked on it with my wife and I the fun thing that's really difficult to gather by scale. Actually, I'll see if I can find one of the photos really quick from it just because it's I think it's really, really interesting. And I hope that you'll find it somewhat interesting as well. Sometimes there's things where it's like you can't fully get the context. And this good help. We're am I I'm already in the correct folder. We have a here we go. Yeah, perfect. So let's start with this one. So this is this glacier. So this behind here is this. So what you're looking at now. Obviously, that's her and I I am 72 inches tall 72 and slight chunk of change. And I want to show you the the height of us on here. So then if I get rid of this. If I were to walk you on to target with where we're standing, we're kind of like over down in this corner, like a little further over this way. So you can this glacier is like budding up against the land and then you can walk on of the glacier from land. But the context of this I always find to be insane because when I look at this,",
    "start_timestamp_seconds": 724.32,
    "start_timestamp": "00:12:04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=724"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 10,
    "total_chunks": 68,
    "text": "in this corner, like a little further over this way. So you can this glacier is like budding up against the land and then you can walk on of the glacier from land. But the context of this I always find to be insane because when I look at this, obviously, it's a background for me, because I think it's cool. When I look at this, this just looks like you can't tell, but like these crevices here are like 30 60 feet deep here. And then as you get up further, they're literally over 100 foot deep, just these massive crevices, which is I think absolutely fascinating. But yeah, so fun fact, not a muddy river. It's actually a glacial melt pond from this thing, which is like the Joe Carlson. I don't know how to say it glacier, but pretty neat. I think. Cool. So while that poll is up and running, I am going to grab the DD library for us to continue working our way through. So we need to go in here. We need to grab this and this. And this beautiful. So I have exactly where we left off up so that we can work through this together. I'm going to move you guys over to the main screen now. Make sure everything's good. And here we go. So now welcome to the main screen. I'll move this over a little bit more so that I can zoom in some ideally make this easier",
    "start_timestamp_seconds": 806.32,
    "start_timestamp": "00:13:26",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=806"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 11,
    "total_chunks": 68,
    "text": "work through this together. I'm going to move you guys over to the main screen now. Make sure everything's good. And here we go. So now welcome to the main screen. I'll move this over a little bit more so that I can zoom in some ideally make this easier for you guys to see. That should be I think pretty good. All right, let's take a look. So I see 28 30 is at 10. 10 is at 15 10 is at 20 and then 50 is at 25. So maybe we up the allocation. To be honest. I personally would prefer that anyways because it's a lot easier for me to run the overall strategy. Power. Traditional says poll only goes up to 25 K. Yep. So just pick the number that's closest to you. It's not really a dick measuring contest of who is the most number of dollars. I know I'm always hesitant to put stuff like this up because I know that that's the impulse for people is more often than not from a psychological standpoint. You'll get the two ends of the spectrum will report here. It will be the people that have small holdings know they have small holdings and they think it's funny and kind of joke about it. And then you have the people who think they have big holdings they want to talk about the big holdings and then they will want to share their size. It's actually always entertaining",
    "start_timestamp_seconds": 888.32,
    "start_timestamp": "00:14:48",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=888"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 12,
    "total_chunks": 68,
    "text": "holdings know they have small holdings and they think it's funny and kind of joke about it. And then you have the people who think they have big holdings they want to talk about the big holdings and then they will want to share their size. It's actually always entertaining to me to see because I've ran this in not just this stock but like other stuff. And Zachariah is my spirit animal because just like that goddamn lockness monster Zachariah has about tree Fitty that. Giant crustacean from the pedidoric era. For those that don't know it's absolutely magical clip. I am 100 willing for this live stream to potentially be taken down to watch this. And let me grab this should be like a compilation. All right. At the time we saw the lockness monster. No that's okay. Must have been about seven eight years ago. Me and the little lady was out on this boat you see all alone at night. When all was sudden it huge creature is giant crustacean from the pedidolithic era comes out of the water. We was so scared Lord I know that jumped up in the boat and I was at the time with what I know is it that creature. It's true the bovard looking down with these big red eyes. I was so scared man. And now you're the said what do you want from our monster and the monster bent down and said I need about tree Fitty.",
    "start_timestamp_seconds": 974.32,
    "start_timestamp": "00:16:14",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=974"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 13,
    "total_chunks": 68,
    "text": "the time with what I know is it that creature. It's true the bovard looking down with these big red eyes. I was so scared man. And now you're the said what do you want from our monster and the monster bent down and said I need about tree Fitty. What's tree Fitty 3.50? Tree Fitty. He wanted money. Tree Fitty. Now the fun fact is if you listen to this more and more. One of the greatest artifacts of it is the time frame that they say the lockness monster is from evolves. So it starts with the paleolithic era then later it goes to the pedidolic era and they keep changing like as he's telling the story keeps changing the time frame. Like what era it's just a masterclass in insanely awesome humor. Giant giant fan. Lauren says I knew it always willing to go down for South Park. Yes exactly. I I think. Yes. I would happily blow up the live stream for us to be able to enjoy that I mean it's like that's like culture right there to be able to enjoy that culture together. Easy easy decision every single time. The time that it's difficult is when we're watching some bullshit nerd from CNBC talking about something like this and they think that because they're fun is so well positioned and small caps and growth stocks. That I want to unalive myself potentially so that I'm less willing to blow up the live stream",
    "start_timestamp_seconds": 1067.32,
    "start_timestamp": "00:17:47",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=1067"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 14,
    "total_chunks": 68,
    "text": "difficult is when we're watching some bullshit nerd from CNBC talking about something like this and they think that because they're fun is so well positioned and small caps and growth stocks. That I want to unalive myself potentially so that I'm less willing to blow up the live stream for but South Park always good always willing. Alright so let's see. We already know what the move is here so I need to hold on a second. I forgot so I have this uploaded in my primary folder that I have access to Gemini so let's see let's go to Gemini. And let's use the correct account this one and let me see. Find the diamond and book part to file and locate page where we are. We are at sell order limitations on page 130 page 130 sell order limitation and let's see if it can take. I don't know I went through a thing not too long ago where I uploaded probably 600 books that I have into my Google workspace account because Gemini can query against all of your files, which is really fucking cool took forever but that's where having a touch of the Tism is nice because I can do those simple repetitive tasks and just just a little bit of time. I'm not going to be that way. I'm not going to be that way. I'm not going to be that way. I'm not going to be that way. I'm not going to",
    "start_timestamp_seconds": 1146.32,
    "start_timestamp": "00:19:06",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=1146"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 15,
    "total_chunks": 68,
    "text": "is nice because I can do those simple repetitive tasks and just just a little bit of time. I'm not going to be that way. I'm not going to be that way. I'm not going to be that way. I'm not going to be that way. I'm not going to be that way. I'm not going to be that way. I'm not going to be that way. I'm not going to be that way. I'm not going to be that way. I'm not going to be that way. I'm not going to be that way. This seems to blow my mind. I don't understand why this is the case. Cannot cannot scroll with the mouse. I have to do this. Whatever this is. But we've learned at least to zoom out all the way and it goes pretty quick. So we are at page 131. I don't think that's it. Because I don't want everything from here. I want the specific section that we're looking at. This is a long. This one's significant. I'm actually excited to go through this one. I like when they look like they're well built. Okay, so to here. So we copy. And let's find our way into chat. Like this. And let's dump this in. Summarize the findings from this. And let's see what you can see. Okay, here we go. Says the compilation provides an overview of selling restrictions. So I'm going to zoom us back in and get back up. Where we",
    "start_timestamp_seconds": 1245.32,
    "start_timestamp": "00:20:45",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=1245"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 16,
    "total_chunks": 68,
    "text": "our way into chat. Like this. And let's dump this in. Summarize the findings from this. And let's see what you can see. Okay, here we go. Says the compilation provides an overview of selling restrictions. So I'm going to zoom us back in and get back up. Where we need to be. Here. And it says many brokers have transaction caps based on share value. But others permit unlimited sell orders as long as market conditions are met. Limitations often depend on trading platform. Certain brokers impose constraints on setting high value limit orders. But allow market orders without caps. Okay. So it looks like they went through individual brokers. So it says that revenue has an initial 10,000 sell limit per share. Exceptions available of selling the entire share holding via the max button. Ally 1 million transaction fidelity. No sell limits tied to share price but may cap sell orders at 500 of the current price. Each trade no limits. Okay, so I'm just trying to understand they went through essentially every single broker. So I'm just trying to understand what they're going to do. So I just want to see how it looks. Like. Well, like the vast majority of brokers. All right. So let's. Give them through this because the main thing it just looks like from what. GPT told me it's just like a summary. Yeah. Let's see. He takes away his planning is essential and sure familiarity with brokerage specific policies to avoid",
    "start_timestamp_seconds": 1356.32,
    "start_timestamp": "00:22:36",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=1356"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 17,
    "total_chunks": 68,
    "text": "the vast majority of brokers. All right. So let's. Give them through this because the main thing it just looks like from what. GPT told me it's just like a summary. Yeah. Let's see. He takes away his planning is essential and sure familiarity with brokerage specific policies to avoid execution delays. Okay. I see. So if they're just talk yet. So they're just going through each and each that's first of all hats off to them. We're going through each and every one of these. That's kind of nuts. But the thing I would offer to them it looks like they're they're talking about. In order like this, let's see what. One of our primary brokers. Let's look at TD. The highest sell price is allowing me to set 10,000. So 9999 max sell price any sell price greater. Throws an error. I was just curious if they had an actual conversation with TD. Here's the thing during crazy market volatility. I mean, you're talking about trying to sell into a squeeze. You don't want to rest in order. And if you're trading something like game stop specifically. If you're resting any sort of limit order, there's a super solid chance you're not going to get filled. So. I think that. Yeah. I think. I don't know. I guess it's cool that they went through and they showed like the limits for the sell orders and stuff. But the other thing is that they're talking about sell orders with",
    "start_timestamp_seconds": 1466.32,
    "start_timestamp": "00:24:26",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=1466"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 18,
    "total_chunks": 68,
    "text": "solid chance you're not going to get filled. So. I think that. Yeah. I think. I don't know. I guess it's cool that they went through and they showed like the limits for the sell orders and stuff. But the other thing is that they're talking about sell orders with the stock price resting at what it currently is. And we've not actually seen game stop. Go parabolic like overnight. It still takes a couple days. So those sell orders would update meaning the limits on those sell orders would update to be sensitive to whatever the current prices. So. Yeah. My takeaway from that. Even though they went through each one is that if you're going to look to sell during a squeeze. You have to be positioned to like sit at your platform and sell. If you're just going to try to rest in order, you're going to get ripped off whether you try to do a limit order a market order. Both of those won't work very well. So. All right, let's take a look through this one. Moas preparation guide. This one. I'm actually really interesting. Hey. Don't sell your shares. If you can open up an account on a reputable broker. Yeah, okay. What they're saying is by doing this. You would limit. Your exposure. If you still have something that could appreciate. This doesn't really make a lot of sense to me to be honest because the broker is exceedingly unlikely during something like",
    "start_timestamp_seconds": 1550.32,
    "start_timestamp": "00:25:50",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=1550"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 19,
    "total_chunks": 68,
    "text": "an account on a reputable broker. Yeah, okay. What they're saying is by doing this. You would limit. Your exposure. If you still have something that could appreciate. This doesn't really make a lot of sense to me to be honest because the broker is exceedingly unlikely during something like a squeeze to restrict the offload. The broker. In general, and we've already seen this is going to be more likely to restrict the purchase because that's what continues to drive share price up, which is the dangerous part. The dangerous part is not the unwind in terms of retail traders trying to take profit and sell. So I would be surprised. Do you guys have any historic reference for this where the broker wouldn't let somebody sell? Is that to me would be really interesting. The limitation on buying although frustrating is a thing and I can understand it. But for selling, I've not heard that. I don't know if that's something that you all have experienced. H says they have more GME. And then Wiggly Worm says I voted 25 see I told you all it's every time. That is the standard standard response. Told you. But have you come across any instances where. They wouldn't let you sell. I've not heard that. Decorize the screenshots from Reddit were they were they weren't permitted to sell do we have those screenshots some works I'd love to look at them. And he says no sell restrictions. From their experience.",
    "start_timestamp_seconds": 1650.32,
    "start_timestamp": "00:27:30",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=1650"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 20,
    "total_chunks": 68,
    "text": "you come across any instances where. They wouldn't let you sell. I've not heard that. Decorize the screenshots from Reddit were they were they weren't permitted to sell do we have those screenshots some works I'd love to look at them. And he says no sell restrictions. From their experience. Yeah, I've not really heard that myself. So I'm curious. The efficacy behind it. Anyways. diversify brokers. Here we go. Here's a list of brokers who place restrictions. There's a lot of them. Dan says there's a Robinhood screenshot of the partial share purchase that are rated over 5K. Yeah, I've seen that. But I don't think that that means. I think that's the main point here to drive home is this process of trying to gain access to multiple brokers grabbing a share and another broker so that you can still sell. Like this is. I understand what they're talking about, but I think it's really extreme. And I think it's extreme for the side of the position that really is unlikely to be hampered. So that's the. Yeah, that's just the main thing here's at least so far. But. And that's why I'm asking if there's actually anybody who has personally or has come across somebody else who has personally been disallowed from selling like closing a position I should specify because that that would be. Pretty insane to me. Absolutely insane. Taxes. Yes. This also is kind of insensitive just because taxes obviously are way more complex",
    "start_timestamp_seconds": 1754.32,
    "start_timestamp": "00:29:14",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=1754"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 21,
    "total_chunks": 68,
    "text": "who has personally or has come across somebody else who has personally been disallowed from selling like closing a position I should specify because that that would be. Pretty insane to me. Absolutely insane. Taxes. Yes. This also is kind of insensitive just because taxes obviously are way more complex than this. And the main thing to think about is that if you make a bunch of money, it's probably worth us reaching out to a good tax preparer CPA tax attorney somebody. And the. I mean, that's one of the biggest things that most of us make is we start generating a little bit more money and it's entirely worth it to. Absolutely worth the expense. I think it's entirely worth the expense. So if you're selling what some of the people would say at Moas at like stuff like phone numbers, then you probably would just want to get a good tax attorney. So this is fine. This is like tax stuff. Jesus, I'm out health. Don't care about health. I'm not sure. Sure. Sure. Hold. Hold. This. This to me personally is disillusionment. I mean, I think it's like this idea that this stock is going to run to 100,000 per share and that don't feel pressure to sell at that point. I mean, a couple things. The first thing is. I go back to the idea of what we think the price target could be during something like Moas and from a from a functional standpoint,",
    "start_timestamp_seconds": 1860.32,
    "start_timestamp": "00:31:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=1860"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 22,
    "total_chunks": 68,
    "text": "run to 100,000 per share and that don't feel pressure to sell at that point. I mean, a couple things. The first thing is. I go back to the idea of what we think the price target could be during something like Moas and from a from a functional standpoint, a functional standpoint. And the reason why I say that is because from a functional standpoint, if you. Recall the prior squeezes the stock. It didn't get anywhere near a hundred thousand right like not even close. And the stock was stopped before it hit that. So my fear by somebody saying something like this don't feel pressure to sell as soon as it gets to 100k is the likelihood of game stop hitting 100k. I'm not saying is zero. I don't know what the probability is, but I know it's very low because I know that the market stepped in the first time to stop it from happening. So my expectation would be that the market wouldn't just magically let it go unhinged the next time. The reason why I say this is because what would be really sucky is if somebody reads this and they're like, okay, don't feel pressure to sell as soon as it gets to 100k. That makes it sound like 100k is like baseline level of the squeeze. And then if the stock got to 10k or something like that and they're like, oh, we're not even close to the 100k, I'm not going",
    "start_timestamp_seconds": 1973.32,
    "start_timestamp": "00:32:53",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=1973"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 23,
    "total_chunks": 68,
    "text": "feel pressure to sell as soon as it gets to 100k. That makes it sound like 100k is like baseline level of the squeeze. And then if the stock got to 10k or something like that and they're like, oh, we're not even close to the 100k, I'm not going to do anything. Like that there's probably going to be a bunch of people like going to miss out on a ton of money. So what I would offer for this is rather than picking price levels on something like this, I would consider creating a protocol based on your portfolio and scaling out at certain levels because we do not know when the dance stops. Because again, like the probability of game stop even getting pushed up to 1000 is really unlikely. It can happen and we saw it transact partials at way above 1000 by like 5k. So it's definitely possible like that's a possible range, but it's still an unlikely range for us to hit and then remain there for any significant duration of time. One of the things I see people reference a lot is the Volkswagen squeeze. The problem with making that comparison is markets are completely different now. They're completely different now. The regulations, the exchange rules, the way we process things, the amount of leverage that's out there. It's completely completely different now. So it's good to use Volkswagen as a reference point for a contextual understanding, but we have got to identify",
    "start_timestamp_seconds": 2061.32,
    "start_timestamp": "00:34:21",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=2061"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 24,
    "total_chunks": 68,
    "text": "are completely different now. They're completely different now. The regulations, the exchange rules, the way we process things, the amount of leverage that's out there. It's completely completely different now. So it's good to use Volkswagen as a reference point for a contextual understanding, but we have got to identify that it is not a direct parallel. It is not a direct parallel. We cannot say Volkswagen did this so game stop should at least be able to do that. We cannot make that statement because things are different now. This is in no way to belittle or to try to dismiss the idea of a squeeze. I know sometimes when people talk like I am right now, we will get labeled as like a shell. This is not to put down any of this. This is to try to have a pragmatic conversation about what is possible, what is likely and what to do across that array. Because even if you're waiting for 10k before you start selling, it comes a big problem because what if it gets to 6k and you don't do anything. That sucks. We've lost on a ton of money. So the point I would like to reiterate is just look at your portfolio, look at your number of shares, and then pick the price levels that you're comfortable with. And if it doubles in price, maybe you sell 10, 15, whatever you want, 25, pick the numbers. You can literally build an Excel sheet",
    "start_timestamp_seconds": 2147.32,
    "start_timestamp": "00:35:47",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=2147"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 25,
    "total_chunks": 68,
    "text": "like to reiterate is just look at your portfolio, look at your number of shares, and then pick the price levels that you're comfortable with. And if it doubles in price, maybe you sell 10, 15, whatever you want, 25, pick the numbers. You can literally build an Excel sheet that helps you track the numbers that you're comfortable with. And I'll show you. So if we grab a scratch part of this and let's say that we have 10,000. Let's just say we have 10,000. What do we think maybe like a thousand shares. Let's say we have a thousand shares at 20. So we're 20k in. Now, what we can do is eyeball different levels of the stock in what you're comfortable selling as a percentage of your holdings. Because what's important to remember is that as game stop goes up, your holdings become worth more. So then you have to decipher how much you're comfortable unwinding at different levels and at what percentages. So let's say game stop first goes to 40. I would call that insanely probable like exceedingly probable. It would be like base case scenario very likely to happen. And then let's say that we have game stop at 80 still very probable. This is less probable than 40 for sure. Obviously, but it's entirely probable. Then we'll do like 120, maybe 150. I'm just picking different price levels that we might think game stop could get to right. So we're going to call",
    "start_timestamp_seconds": 2228.32,
    "start_timestamp": "00:37:08",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=2228"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 26,
    "total_chunks": 68,
    "text": "we have game stop at 80 still very probable. This is less probable than 40 for sure. Obviously, but it's entirely probable. Then we'll do like 120, maybe 150. I'm just picking different price levels that we might think game stop could get to right. So we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a",
    "start_timestamp_seconds": 2330.32,
    "start_timestamp": "00:38:50",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=2330"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 27,
    "total_chunks": 68,
    "text": "going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. And then we're going to call it a 20. Modest move, nothing crazy. At 80, we might take off another 20 that leaves us 70 remaining. And what is how many steps is this along the way? And we have five steps left to go. So then maybe if it hits to 120, we ramp this up again and we take off up higher amounts. So the way I would look at this is you have 100 total here. This would be your total remaining. So this will be a sum of this, of this. This becomes your residual. And you can tinker with these numbers to figure out again. Based on the likelihood of hitting these different numbers, how much you might want to unwind. Now what I can tell you is for me personally, I would absolutely lean into way more heavily. This beginning stage of the move. Forty is still a little light in my opinion. We can literally hit 40 on just standard price movement. Like that's not squeeze at all at this point. Forty is just normal stock going up because the company is doing pretty well. So 40, I personally would not be",
    "start_timestamp_seconds": 2392.32,
    "start_timestamp": "00:39:52",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=2392"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 28,
    "total_chunks": 68,
    "text": "move. Forty is still a little light in my opinion. We can literally hit 40 on just standard price movement. Like that's not squeeze at all at this point. Forty is just normal stock going up because the company is doing pretty well. So 40, I personally would not be heavily incentivized to unwind very heavily. Again, personally, I'm giving you my opinion in my perspective so that then you can paint and create your own. Now if this were me personally, I would add in probably another step here though. And I would have stock at 60. Because starting with stock at 60, I would start unwinding more heavily. So stock at 60, I probably would take another 20 down, something like that. So this would leave about half the trade on at this point. Once we get up to something like 80, I would probably take off a pretty meaningful amount of the position at this point, maybe 30 or 40 total. So this would leave me 30 left to go across these residual phases. So then I essentially would just split 10 out across these, something like this. And again, you could figure out what numbers make sense for you. What you're happy with. What you think makes sense. But the main point here is based on these numbers, you can then figure out how much of your portfolio is left. And how much you would make in both the bracket itself. And then in aggregate to",
    "start_timestamp_seconds": 2471.32,
    "start_timestamp": "00:41:11",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=2471"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 29,
    "total_chunks": 68,
    "text": "sense for you. What you're happy with. What you think makes sense. But the main point here is based on these numbers, you can then figure out how much of your portfolio is left. And how much you would make in both the bracket itself. And then in aggregate to then make a decision and say, yeah, okay, I am okay with this scenario. Because in this scenario, you would make a ton of money. Let me open the door real quick for Thor. So to finish out the spreadsheet idea here, all I would do is I would take the total amount remaining. So in this case, I know there's a way to set this up cleaner. But I just want you to see the ideas as I'm walking through it. So what you can do is you can say this one, this specific bucket. Would have 90 of the portfolio remaining. This specific bucket. Would have this amount of the portfolio remaining. And so on and so forth. And you can then look at what amount is remaining. So then you can make an educated decision because here's the thing. Saving 10 for these last few numbers might seem like not much. Not a whole lot. But at those values, 5 of your money with a basis of 20 when the stock is at 300 is a significant sum of money. Even though it's a small allocation of the portfolio. So I would personally build this out if",
    "start_timestamp_seconds": 2558.32,
    "start_timestamp": "00:42:38",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=2558"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 30,
    "total_chunks": 68,
    "text": "seem like not much. Not a whole lot. But at those values, 5 of your money with a basis of 20 when the stock is at 300 is a significant sum of money. Even though it's a small allocation of the portfolio. So I would personally build this out if I were playing this broader thesis of a squeeze and trying to figure out when I would want to get out. But I can tell you unequivocally is personally there's a zero percent chance I would wait until 100K. There is an overwhelming probability that you are just going to be sitting there holding your original basis waiting for that number to come back up again, which it might I don't know. But what I do know is that I can realize profit along the way and build a bigger position. I do know that because to use this as an example. We don't have to go back that far forgot. We have to go back further than that this one. So let's say that you got in here, even higher than this, let's say you got in at 11, 11, 50 will call it and literally let's look at another example. So we have the stock at 11, 50 and we're saying that we have a 20 or 15,000 count whatever leaves 15,000 count. And so this means you have mail, not just kidding. 1300 shares, 1304 technically we have to round this down. You can't have I don't",
    "start_timestamp_seconds": 2666.32,
    "start_timestamp": "00:44:26",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=2666"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 31,
    "total_chunks": 68,
    "text": "another example. So we have the stock at 11, 50 and we're saying that we have a 20 or 15,000 count whatever leaves 15,000 count. And so this means you have mail, not just kidding. 1300 shares, 1304 technically we have to round this down. You can't have I don't partial shares are fake, so I don't I don't fuck with partial shares. So you have 1304 shares. So now let's say that the stock doubled in price. And did it double before it didn't so let's say on this first jump up, you want to start looking at selling towards the mid at 28 and a half. 28.5. And you decide that you want to unwind some of your shares. This is not phone numbers. This is not even that significant of a move. This isn't even a big run up yet. But I want to show you something. I have to show my way into formatting this. Otherwise my OCD won't let me show you shit. So here you have this minus this times this. So this is your profit at this point on top of this. So this is what I'm showing you here is the difference between 1150 and 20 and a half on your 1304 shares. So solid like super solid amount of money that you've made. Let's say when this doubled, you're like I'm going to take 50 of this profit down, take 50 down. So you would sell half of this overall cost.",
    "start_timestamp_seconds": 2734.32,
    "start_timestamp": "00:45:34",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=2734"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 32,
    "total_chunks": 68,
    "text": "between 1150 and 20 and a half on your 1304 shares. So solid like super solid amount of money that you've made. Let's say when this doubled, you're like I'm going to take 50 of this profit down, take 50 down. So you would sell half of this overall cost. So let's do that. And then let's look at how many shares we have now. We need to add a calm for total cost. Oops, wrong one. I'm done. We need 30 here. So that's our total cost at the time. Total value at this point would be this times this. Profit would equal this minus this. So this is how much you're actually up in making. So then we can say all right, I have 37,000. I have 22K in profit. I want to take half of this profit down. Easy choice. So there's a few different ways you can either just decide in amount of shares. I would personally just use the dollar amount at a cost level. And I would say I just want to take half this down. So equals this divided by two. So we're going to take 50 of it down. So then I'm going to figure out how many shares I need to take off. So it's going to be this divided by the current price. So I need to drop 388 shares. So then what I do is take this minus the 388. So this is my new shares total total position",
    "start_timestamp_seconds": 2848.32,
    "start_timestamp": "00:47:28",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=2848"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 33,
    "total_chunks": 68,
    "text": "going to figure out how many shares I need to take off. So it's going to be this divided by the current price. So I need to drop 388 shares. So then what I do is take this minus the 388. So this is my new shares total total position size. I have 915 shares. The current price of those is still 2850. So then my new cost basis based on the remaining shares at the original position of 1150 is 10K. So I've trimmed a bit down from here, mostly coming from the profit side of this. So now I still have 950 shares at a basis of 1150 with the stock at 2850. Here's what I want to show you by doing this when the stock eventually comes back down. Let's say that we don't play any of this. Let's just say we're unlucky. We fuck up the playing of all this, which there's no reason to be by the way. Like you can absolutely like I played all of these days. It was very, very simple to do. And let's say the stock comes back down to 1855. So now we're at post move stock is at 1855. Here's what's happened. Your original position was worth 15,000. That's the total amount of money that you had in the beginning. Now with the stock at 1855, the cost of your residual position of 915 shares, you have 16,000 that are in the position by itself. But remember, we",
    "start_timestamp_seconds": 2956.32,
    "start_timestamp": "00:49:16",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=2956"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 34,
    "total_chunks": 68,
    "text": "1855. Here's what's happened. Your original position was worth 15,000. That's the total amount of money that you had in the beginning. Now with the stock at 1855, the cost of your residual position of 915 shares, you have 16,000 that are in the position by itself. But remember, we literally took half of it out over here. So this is our booked realized profit right here, 11K. So now when this comes back down to 1855, guess what we can do. We can now buy more shares. So let's take this divide by the current price of 1855, which is 597. So now let's take a look at our new position. This plus this. You can now have 15 12 shares. So this might as I'm looking at these numbers and the way I'm talking about it, this might sound crazy, right? Like the way I'm rattling off. But the ultimate thing I want you to take away from is that if you bought here at we called it 1150 or whatever, if you bought here at 1150 and you just held from 1150 up here down here. And the stock is now at 1850 in scenario one where we bought 1150 held because we didn't see phone numbers stock is back down to 1850. You still have your 15,000 worth, but all of your money is in an unrealized game. So you just you're just holding there for the time being in scenario two, which is what we",
    "start_timestamp_seconds": 3027.32,
    "start_timestamp": "00:50:27",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=3027"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 35,
    "total_chunks": 68,
    "text": "we bought 1150 held because we didn't see phone numbers stock is back down to 1850. You still have your 15,000 worth, but all of your money is in an unrealized game. So you just you're just holding there for the time being in scenario two, which is what we just worked through by offloading some not all some of the shares at in this scenario a sub optimal point on the way up. I didn't even play playing the rest of the squeeze. I literally just said price doubled a little bit, doubled and then some not much though and offload half of it. I didn't play the rest of the squeeze in this example, but now take a look at what we've been able to do. Instead of having 13 and 104 shares, we now have 15 12. So this might not sound crazy because it's really not a crazy improvement, but it's still not an insignificant improvement. If increased your overall exposure by 16 just by opportunistic selling during the moves. This is exactly what the coverage strangle example is going to be as we go through that portfolio for the year. You're going to see me doing shit like this all the time and I know that bothers some people because it includes selling some of the position, but I will always remind you all I do have part of the shares that are not part of this because I said I would maintain those. I'm",
    "start_timestamp_seconds": 3112.32,
    "start_timestamp": "00:51:52",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=3112"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 36,
    "total_chunks": 68,
    "text": "doing shit like this all the time and I know that bothers some people because it includes selling some of the position, but I will always remind you all I do have part of the shares that are not part of this because I said I would maintain those. I'm a trader and what I'm doing is I'm using the movement of the stock to opportunistically monetize the movement. So that then when it has residual moves, I can have a 16 larger position after adding zero dollars. I've added no money in this scenario. I've not put anything into this, but I can now have a 16 larger position than I did previously by adding no money. This is why management is so important. So a little bit of a rabbit hole and dovetail off of this one single line as you could tell the way that my brain works, but I want that point to be really, really clear because for people that read this and they're like, well, I'm just going to wait until this level. That's okay. Right? Like you can do whatever's right for you. And that's exactly what you should do whatever's right for you. But what I can tell you is that in the process of waiting for this scenario, the trader will have given up so much profit along the way that going into this move waiting for 100 K. Maybe they have 100 shares, but they could have had a hundred",
    "start_timestamp_seconds": 3190.32,
    "start_timestamp": "00:53:10",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=3190"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 37,
    "total_chunks": 68,
    "text": "you. But what I can tell you is that in the process of waiting for this scenario, the trader will have given up so much profit along the way that going into this move waiting for 100 K. Maybe they have 100 shares, but they could have had a hundred and 16 shares based on the example that I just gave you on a suboptimal example of a move. And you have a much bigger position to go into this. So yeah, those are my thoughts. I love their idea about planning an exit and finding things that you're comfortable with what levels you want to be on stuff like that. I think that's good. I think that's really good. But I think that a little more nuance is required in the approach because you can end up at a far, far, far better off position than what this person would be at. All right, let me get caught up on the chat and it looks like I see 39, 9 and 6 and 46 okay. So that's super helpful. Wigglyworm says this spreadsheet is on the Patreon, right? I know you did the videos to walk through building it. No, I don't think there's any. This is just like a random workbook that I use. This is like a scratch book. So you'll already see that this one's called scratch. This is this is all sorts of random shit from our live streams and stuff. So yeah, this is",
    "start_timestamp_seconds": 3260.32,
    "start_timestamp": "00:54:20",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=3260"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 38,
    "total_chunks": 68,
    "text": "No, I don't think there's any. This is just like a random workbook that I use. This is like a scratch book. So you'll already see that this one's called scratch. This is this is all sorts of random shit from our live streams and stuff. So yeah, this is just personal. A bunch of random nonsense in here. I don't remember what this one was. What is this one? This looks like GameStop though. This must have been rolling short calls. Yeah, this is rolling short calls. Yeah, it's just a bunch of random nonsense in there. Dave says, do you think it's possible arcade overestimated the squeeze and sitting on far too many options and shares and doing his best to build some hype volume so you can unwind his position. I don't think so. I don't think that at all. The thing to remember is that the cat has already made he's made more money than several generations of his family could go through. I don't think he needs exit liquidity. I don't think he cares. Like I really don't think he cares and I also don't think that he would try to create some hype for him to be able to make a few bucks off of like I just don't see that. The good part with shares is that they don't expire. The shares are going to be there for the options position. The last we saw he didn't have any options. Now he's probably",
    "start_timestamp_seconds": 3333.32,
    "start_timestamp": "00:55:33",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=3333"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 39,
    "total_chunks": 68,
    "text": "him to be able to make a few bucks off of like I just don't see that. The good part with shares is that they don't expire. The shares are going to be there for the options position. The last we saw he didn't have any options. Now he's probably trading options for leverage and stuff but last we saw he didn't have any. So yeah, I personally don't see that as even remotely likely scenario. I always be clear it's possible right I don't know but I feel pretty pretty confident in saying I think it's pretty damn unlikely because if we take a look at this, this is just his yo low portfolio update at the end. 210 million dog. Like I'm just fucking money to you need. So and this is just in is one bullshit account. You know that this is not all his money. So no, I I would be absolutely. I would decide myself if that were the case like I feel I feel pretty confident in that being not so much the case hold on. My wife and I were going to grab dinner tonight. There's a cool restaurant pies that we both really like. That's not for a little bit though we still have like another half hour 40 minutes. Okay, so yeah, that's that good question. But yeah, I don't think so personally. Um. Okay, cool. It looks like I'm caught up on most of the stuff that I can eyeball.",
    "start_timestamp_seconds": 3408.32,
    "start_timestamp": "00:56:48",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=3408"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 40,
    "total_chunks": 68,
    "text": "really like. That's not for a little bit though we still have like another half hour 40 minutes. Okay, so yeah, that's that good question. But yeah, I don't think so personally. Um. Okay, cool. It looks like I'm caught up on most of the stuff that I can eyeball. If there's any question that you asked and I miss just let me just let me know just throw it back in there and I'm happy to take a look. But I just wanted this to be super clear because through opportunistic selling you can drastically enhance your position without adding any money so that when and if you do eventually get the move that you're wanting to see, you will make way more money than somebody like this that might not be willing to sell until it hits 100K. Alright. I love this don't sell everything at once. This is good. Sell on the way down is dangerous. I don't dislike it, but it's dangerous. The scaling process. I think especially in something like GameStop has to be done very cautiously because if you sell on the way down, let's just use it as an example. Let's say that you sold on the way up when it was surging here on the sixth and let's say that once it broke above 45, you decided to start selling even though it was on the way up. If you waited to sell on the way down, the stock opened here at",
    "start_timestamp_seconds": 3496.32,
    "start_timestamp": "00:58:16",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=3496"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 41,
    "total_chunks": 68,
    "text": "you sold on the way up when it was surging here on the sixth and let's say that once it broke above 45, you decided to start selling even though it was on the way up. If you waited to sell on the way down, the stock opened here at 37. So that's the way down. So then if you start unwinding on the way down as expected or as we discussed, that's almost a 10 point loss. I'm not saying that's a bad idea. I'm just saying you should be aware of the risk in doing so. And this is actually why I think setting different price levels for scaling makes a lot more sense than just trying to catch it on the drop. This is another great example of this. If you sell on the way down here, you get out at 49. If you wait to get out a day here, it opens up at 40. That's a nine point drop that you consume there. So again, I'm not saying in I rarely would talk about exiting all at once, right, doesn't make sense. But through the process of scaling, you prevent the scenario where if you sell 10 of this as it breaks above 45 and it goes higher, you're still in it. You're not out of it. So it doesn't like selling on the way down in this case doesn't, it doesn't really save you. The other thing to keep in mind is based on",
    "start_timestamp_seconds": 3576.32,
    "start_timestamp": "00:59:36",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=3576"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 42,
    "total_chunks": 68,
    "text": "sell 10 of this as it breaks above 45 and it goes higher, you're still in it. You're not out of it. So it doesn't like selling on the way down in this case doesn't, it doesn't really save you. The other thing to keep in mind is based on the logic here, if we sell on the way down and we scale and we scale slowly, the overwhelming potential is you're going to miss most of the move. Because again, remember, let's use this as an example. This is one day. This is two days. This is three days by day four. It's back down to standard levels by day four. So depending on how slow and how little we scale out on the way down, this can set you up for unwinding 30 of the position by the time it gets back down to levels here. So I think what makes more sense is like we were just talking about picking different price levels that makes sense for your holdings of the portfolio. And as you start to approximate to those levels, because by doing this, you are inherently leaving runners out. You already have position remaining to take advantage if the move continues. So there are literally built in protocols by the scaling approach that prevent you from unwinding on the way up. The stock just starting to blast off and then you sit in there being like, fuck, you know, I could have made way more",
    "start_timestamp_seconds": 3656.32,
    "start_timestamp": "01:00:56",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=3656"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 43,
    "total_chunks": 68,
    "text": "take advantage if the move continues. So there are literally built in protocols by the scaling approach that prevent you from unwinding on the way up. The stock just starting to blast off and then you sit in there being like, fuck, you know, I could have made way more money. You don't want to do that. That's a bad move as well. So yeah, thoughts on that as well. Let's get back in here. Types of orders, when the dust settles. A single share for seven figure price. Again, the problem with this and I understand and I appreciate the vision that they have and what they're trying to do. So the probability of you selling a game stop share for a seven figure price is, I mean, again, it's just objectively insanely low because it was already stopped from doing so before. So there's nothing wrong with thinking about that trying to consider visualized hoping that it happens. That's all fine. If you're planning on that and that's part of when you're deciding to take gains, you're going to miss out on a lot of money that I can probably volume. Flash gains online. This is another thing I, I never understand this because people always just like, well, if you make money, don't tell your friends, don't tell your family. The way I think about that is it like, what kind of friends and family do you have? And family is whatever the family is, but your",
    "start_timestamp_seconds": 3730.32,
    "start_timestamp": "01:02:10",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=3730"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 44,
    "total_chunks": 68,
    "text": "I, I never understand this because people always just like, well, if you make money, don't tell your friends, don't tell your family. The way I think about that is it like, what kind of friends and family do you have? And family is whatever the family is, but your friends, you get to pick. So if you're so nervous about telling your friends that you have money because they might come ask you for it. And then if you told them, no, that they wouldn't like you anymore, what's not a fucking friend anyways? That's somebody that shouldn't be around you fucking regardless. So it's like that's just something that people have said before and they just kind of keep saying it and it's just so superficial just doesn't make any fucking sense. So the, and it's the same thing realistically for family like if somebody in my family and it happens pretty regularly where my family members will reach out asking for money. And I make a judgment call either yes or no, but if I tell them no, I'm not afraid of the repercussions of telling them no because I'm operating off of my principles and my values. And if I tell them no regarding a resource that I have and I built on my own and that bothers them, I do not literally care at fucking all at all. And if it pisses them off and they don't want to talk to me or anything like",
    "start_timestamp_seconds": 3813.32,
    "start_timestamp": "01:03:33",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=3813"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 45,
    "total_chunks": 68,
    "text": "values. And if I tell them no regarding a resource that I have and I built on my own and that bothers them, I do not literally care at fucking all at all. And if it pisses them off and they don't want to talk to me or anything like that, that literally tells you that that's somebody that you shouldn't have around you anyways. And I tell you guys this specifically because a lot of my friends are military friends and a lot of them know they've been to my house they've been around me like they they know that I've done well. And even in that case like when I when I take them out to dinner stuff, I always will pay for dinner because I want to and I can and I'm in a different spot and I'm fortunate for that. But most of them will still then, momy after dinner, I don't ask I literally don't want them to. But they will then, momy, typically more than what they're fucking dinner costs. So I have to refund them on like a legit level. And like that's just a difference in good people versus people that might take advantage of you. So all I'm saying is publicly short, right? The general public doesn't need to know that's fine. But like if you're nervous of sharing like success with friends and family or like letting them know that you have money. And there's a difference like you should",
    "start_timestamp_seconds": 3885.32,
    "start_timestamp": "01:04:45",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=3885"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 46,
    "total_chunks": 68,
    "text": "take advantage of you. So all I'm saying is publicly short, right? The general public doesn't need to know that's fine. But like if you're nervous of sharing like success with friends and family or like letting them know that you have money. And there's a difference like you should never go around to your friends and be like, yo, I made a bunch of money. Look at me because then you were literally just a fucking dickhead like nobody cares. Literally nobody cares. So if you're flashing it like that, then you are literally super lame. But I've seen people go as far as like trying to rent a car to go see their friends so that they don't see their car. That's nice. So that they don't know that you don't even mean and like that's crazy. That's a crazy level of paranoia around people that are nowhere near friends. So if you cannot roll up to your dinner plans in your McLaren with your friends and still have a great night, then again, I think it's somebody that doesn't have a decent enough moral background and standing of themselves to like work off of their own principles. So that's all I'm saying. Inform your bank about large deposits. You don't have to do this. Yeah, you don't have to do this. Let's see what this says. This isn't like special banking, by the way, like they're they're making it sound like you you have like a specific",
    "start_timestamp_seconds": 3955.32,
    "start_timestamp": "01:05:55",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=3955"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 47,
    "total_chunks": 68,
    "text": "So that's all I'm saying. Inform your bank about large deposits. You don't have to do this. Yeah, you don't have to do this. Let's see what this says. This isn't like special banking, by the way, like they're they're making it sound like you you have like a specific bank or something. It's just economies of scale. So it's like a CD account. Have you ever looked at CD rates and their CD rates for like a 5,000 account or 25 or 50, 100 and plus. There's there's economies of scale. So when you park a lot of money in a bank that absolutely benefits the bank. So they're incentivized to make it nicer for you. So yeah, like there will be perks involved for sure, but you don't have to like go to a specific bank or something like that. A lawyer up that's fine financial advisor sure if you think if you think you need it. An emphasize enough to work with an advisor that is a fiduciary. This is good advice. I honestly don't think most people need a financial advisor. I think you can educate yourself generally. But yeah, I don't think there's anything wrong with this. This I agree with completely agree with this like there should be no remorse like if you if the financial system crashed in some way. I try to make it sound like the the apes did it like it's not the fucking apes. That's institutions and hedge funds",
    "start_timestamp_seconds": 4013.32,
    "start_timestamp": "01:06:53",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4013"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 48,
    "total_chunks": 68,
    "text": "with this. This I agree with completely agree with this like there should be no remorse like if you if the financial system crashed in some way. I try to make it sound like the the apes did it like it's not the fucking apes. That's institutions and hedge funds being so over lever that they can't handle the volatility. That's their own fucking bag right that's their fault. So yeah, fuck that. Do nothing with the money. I disagree with this. I do agree with this. Don't just go out and go crazy. This is typically what happens to people that don't have a lot of money is they spend it all. This is the thing you've heard about people who win the lottery because you think about the kind of person that tends to play the lottery. The overwhelming majority of them are not super financially savvy, which is why they're playing the lottery trying to be lucky and change the lives and most of them will burn it super fast. So super super common. So yeah, I think this is good. Lambo's are great, but they won't bring you happiness forever. Again, this is all relative. I can tell you McLaren's do bring a lot of happiness. But the what I try to tell people is that and to follow along with this point is material things are just material. So yeah, if you think that a material item is going to make you happy, it's not",
    "start_timestamp_seconds": 4113.32,
    "start_timestamp": "01:08:33",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4113"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 49,
    "total_chunks": 68,
    "text": "can tell you McLaren's do bring a lot of happiness. But the what I try to tell people is that and to follow along with this point is material things are just material. So yeah, if you think that a material item is going to make you happy, it's not it's literally not going to make you happy. You're going to get over it super fast. But and this is why I talk about a this is from the the Patreon and I've talked about this more broadly with everybody before though, which is. Let me find the file I'll show it to you here so that because we looked at this before, but I think it's pertinent and I obviously don't care about giving stuff away. Give me a second. I got to find it. This. So this here is an exercise that I built for for myself literally and this is available on the Patreon for a download again like you can make your own. This isn't anything like I'm trying to gatekeep this is just some I literally built this document originally for myself. So the context behind it is the I call it a money mindset marginal utility exercise the whole point is to figure out the things in life that genuinely add marginal utility and for those kinds of things you. You're mark them so that you're ready to pay for them a great example when Mel and I when we were just traveling and",
    "start_timestamp_seconds": 4185.32,
    "start_timestamp": "01:09:45",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4185"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 50,
    "total_chunks": 68,
    "text": "marginal utility exercise the whole point is to figure out the things in life that genuinely add marginal utility and for those kinds of things you. You're mark them so that you're ready to pay for them a great example when Mel and I when we were just traveling and we were going through Calgary and stuff like that. There was a couple places that we stayed like definitely like more than half were over a thousand dollars a night for sure and a couple of more multiples of that. Looking back at poor Eric there's a zero percent chance ever in my entire life what I ever possibly conceive of spending that kind of money to check into a place at like 3 p.m. And to check out of a place at 12 or 1 p.m. Right like that's an insane use of money. It's an insane use of money. However, the marginal utility specifically for the group is very high. We both really really enjoy having a cool place to hang out and more specifically the view. That's what we really that's why we have the house we have now is we both really love a beautiful view. What I'm sharing with you is that something that we both are willing to pay for something that neither of us have designer clothes. I couldn't possibly care less if my fucking t-shirts as Columbia which there's a Columbia employee story here that I can go to and get a",
    "start_timestamp_seconds": 4254.32,
    "start_timestamp": "01:10:54",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4254"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 51,
    "total_chunks": 68,
    "text": "What I'm sharing with you is that something that we both are willing to pay for something that neither of us have designer clothes. I couldn't possibly care less if my fucking t-shirts as Columbia which there's a Columbia employee story here that I can go to and get a t-shirt for 10 bucks or if it says Balenciaga so say it literally is the same shirt I don't care at all. That's not to say that for people that like designer clothes that that's a poor marginal utility the marginal utilities up to the person it's up to the individuals up to what you value is a human being. And that's what this exercise was built for to help me identify those things because one of the things I noticed was when I was poor. I would look at anything related to money and I would always think like oh that's superficial or oh that's lame or oh this or oh that and it's it's me managing expectations right I'm sure enough at this point that I can definitely tell you that younger Eric would look at designer clothes and think that's so stupid like such a colossal waste of money unbelievable just like pure superficial nonsense bullshit. And the people that would buy that kind of stuff for that and that's just me coping with something that I didn't have access to and didn't understand as I started to realize this understanding marginal utility the process of building",
    "start_timestamp_seconds": 4336.32,
    "start_timestamp": "01:12:16",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4336"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 52,
    "total_chunks": 68,
    "text": "of money unbelievable just like pure superficial nonsense bullshit. And the people that would buy that kind of stuff for that and that's just me coping with something that I didn't have access to and didn't understand as I started to realize this understanding marginal utility the process of building wealth and identifying things that value to you again I can tell you from the bottom of my heart I do not understand. I do not understand I don't get it but just because I don't get it doesn't mean that somebody else doesn't derive true marginal utility from the important thing is to find what you as an individual derive marginal utility from that's what you value that's the stuff that's worth spending your money on. This person's exact point a lot of times when people don't have money find their way into money they think that if they go out and they buy a bunch of expensive stuff that they see influencers use or they've seen in movies or movie stars or whatever Instagram and they think that they're supposed to go buy a bunch of this really expensive stuff and then they do it and then they realize like oh fuck this really didn't move the needle for me. And it inherently won't do that so try to think about what you derive true marginal utility from and I really agree with their point here is even if like even if you think a lambo is really",
    "start_timestamp_seconds": 4388.32,
    "start_timestamp": "01:13:08",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4388"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 53,
    "total_chunks": 68,
    "text": "realize like oh fuck this really didn't move the needle for me. And it inherently won't do that so try to think about what you derive true marginal utility from and I really agree with their point here is even if like even if you think a lambo is really cool if you're not really a car person it's it's a terrible investment I love cars I grew up building cars so for me cars is a completely different thing right like. I don't buy cars and work on cars because I think somebody else is going to think something about me I couldn't possibly care less but I really enjoy them I have a lift that I put in my house so that I could work on them I love working on cars so it's a significant marginal utility what I can tell you is that if that's not you and you don't really care about them that much and you are acquiring something because you think somebody else might look at you or perceive you a certain way. That's true superficial does it means nothing that means we're literally purchasing something in the hopes that somebody else might recognize us in some type of way makes no sense so just think about what you personally derive marginal utility from that's absolutely the case and then the other thing I think I saw somebody where was it. Dan says the people with most money are actually the most Google",
    "start_timestamp_seconds": 4461.32,
    "start_timestamp": "01:14:21",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4461"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 54,
    "total_chunks": 68,
    "text": "recognize us in some type of way makes no sense so just think about what you personally derive marginal utility from that's absolutely the case and then the other thing I think I saw somebody where was it. Dan says the people with most money are actually the most Google it's really not true at all to be honest that's another thing I find that I because I used to think the same thing as well you'll hear the thing of like oh you know super rich people they drive a Honda accord and it's like war on Buffett drives around in his Cadillac but he bought a fucking jet right the point I'm making. Is that he has no problem spending on the things that he derives marginal utility from so just remember being frugal is essential you have to be frugal there's nothing nothing wrong and it's really smart to be frugal but people with money are willing to spend the money on things that they derive marginal utility from the funny thing about it though is people look at how much war and buffett is worth and they're like oh he should be in a sports car or something that society trying to impress upon somebody what their marginal utility should be and it's fucking not for him he couldn't possibly care less about that but he's happy to hop on his jet so the note there is the concept of rich people being like the most",
    "start_timestamp_seconds": 4544.72,
    "start_timestamp": "01:15:44",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4544"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 55,
    "total_chunks": 68,
    "text": "or something that society trying to impress upon somebody what their marginal utility should be and it's fucking not for him he couldn't possibly care less about that but he's happy to hop on his jet so the note there is the concept of rich people being like the most frugal it's really not that true because you don't get rich by not being frugal you have to be frugal and you're just really fortunate and you're born into it. However what I've learned is that most people with money are more than happy to spend it on the things that they value another thing that I've seen some of my more wealthy friends spend money on is like these really extravagant dinners and they're like buying booze out and stuff like my wife and I really don't drink but the idea of paying like 60 for a cocktail is fucking crazy to me even it's not like I'm against drinking I would it's just I'm just getting the money away from me and I'm not giving it back to you. like I'm against drinking, I would. It's just I typically don't feel inclined to, but I'm too cheap for that. And I do not derive the marginal utility from that. But what I will tell you is that a good Tomahawk steak, 140 steak, that's solid. I'm cool with that. Good marginal utility. So people I've learned that people that have capital, they have no problem spending it, but",
    "start_timestamp_seconds": 4598.4,
    "start_timestamp": "01:16:38",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4598"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 56,
    "total_chunks": 68,
    "text": "that. And I do not derive the marginal utility from that. But what I will tell you is that a good Tomahawk steak, 140 steak, that's solid. I'm cool with that. Good marginal utility. So people I've learned that people that have capital, they have no problem spending it, but they tend to spend it on the things that they really care about. And to me, this is smartest way to do it. Or none, the smartest way. BW says the value of having money should only be applied to towards travel, experiencing different cultures and helping the less fortunate. Yeah, I mean, I just don't agree with that. I don't agree with that at all. Too many people always use it for their own desires, which is stupid. Most rich people are selfish. Yeah, which I also don't, yeah, I don't agree with that at all. And I want to be clear, I'm a massive advocate of travel. And I genuinely believe everybody would be better off if they traveled, even if they're not really passionate about it, because you can learn a lot. But I also don't think it's up to me to dictate what somebody else should apply their money to. Not up to me. It's not up to you. And it's not up to us to judge what they decide to do. That's just the fact, man. That's actually one of the things I always find so interesting is when online people will see when people",
    "start_timestamp_seconds": 4686.24,
    "start_timestamp": "01:18:06",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4686"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 57,
    "total_chunks": 68,
    "text": "apply their money to. Not up to me. It's not up to you. And it's not up to us to judge what they decide to do. That's just the fact, man. That's actually one of the things I always find so interesting is when online people will see when people have money or doing stuff. And they're like, oh, you could have had 100 kids from Africa with that money. Instead, you went and bought a designer bag. And while I personally can't resonate with the designer bag thing, I also think it's up to that person to spend the money they earned, however they want. It's always crazy to me like how open people feel about telling other people how they should spend their money that they don't have. Like if that's what you think, good, make the money, do what you think you should do with the money. But for people without to judge so heavily the people with in terms of like what they choose to spend on, I just think it's misguided angst. I can understand not agreeing with stuff for sure. And that's okay. But yeah, I think taking it all the way back to this, you should spend on things that you personally derive maximum marginally utility from. That's what I think. Whatever that is. And again, for me, it's weird. If it's like designer clothes and stuff, I don't understand it. But if you're the kind of person that goes into your closet",
    "start_timestamp_seconds": 4763.44,
    "start_timestamp": "01:19:23",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4763"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 58,
    "total_chunks": 68,
    "text": "this, you should spend on things that you personally derive maximum marginally utility from. That's what I think. Whatever that is. And again, for me, it's weird. If it's like designer clothes and stuff, I don't understand it. But if you're the kind of person that goes into your closet and just the process of walking through your closet and you're like, man, this is fucking awesome. I just love seeing all my clothes and it makes me happy and feel fulfilled. Cool. That's awesome to get that feeling. If that's the thing that gives you that feeling, great. I just think in general, if people become materialistic, that comes across in other ways. And you can always see a materialistic person. And unfortunately, to BW's broader point, a lot of people who are into very material things tend to be hyper materialistic. And that does suck. But I don't think it's fair to say most rich people are selfish either because I think that's that's I don't know if you know most rich people. I don't know most rich people. I know a ton of not rich people that suck. I know rich people that also do suck. We stayed at a place that was much higher end. And I just remember like I didn't like the people around there. I could just tell the way that they were talking and are acting like I didn't like the culture. I didn't like the vibe. And that's my predisposition. That",
    "start_timestamp_seconds": 4829.68,
    "start_timestamp": "01:20:29",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4829"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 59,
    "total_chunks": 68,
    "text": "stayed at a place that was much higher end. And I just remember like I didn't like the people around there. I could just tell the way that they were talking and are acting like I didn't like the culture. I didn't like the vibe. And that's my predisposition. That doesn't mean that they all suck. It means that I just didn't like it. So I don't think it's wise to cast large statements like that about broad groups because like you don't know them. So I think preconceived judgments like that tend to indicate more ignorance than anything because again, you'll find rich people that suck. You'll find poor people that suck. You'll find rich people that are awesome and would give you the shirt off the back if they knew you. And you'll find poor people that will do the same. So I would just avoid disliking somebody based on some trait like that preemptively. Oh, right. Terminal and economy. I could totally see this. If things start getting like super crazy, I agree with this. Had you against hyperinflation. So this were already kind of past. Oh, what time we got. We got time for a little more. Let's take a look at this. Is this the same person that did this other one? No, okay. That one's from our boy's Socrates. Okay. All right. Um, this just looks like price expectations. I don't really care about this to be honest. Oh, here we go. Um, this",
    "start_timestamp_seconds": 4896.08,
    "start_timestamp": "01:21:36",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4896"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 60,
    "total_chunks": 68,
    "text": "more. Let's take a look at this. Is this the same person that did this other one? No, okay. That one's from our boy's Socrates. Okay. All right. Um, this just looks like price expectations. I don't really care about this to be honest. Oh, here we go. Um, this just looks like their expectations of price moving and stuff, which is okay. Um, I mean, I don't love that as an exit. Yeah, I mean, I can tell you from the general approach. I don't really identify with where we're choosing the exits. But that's up to literally up to the individual. Uh, as some says, everything is superficial. The only not superficial thing we do is die. Uh, I mean, you could think that I definitely don't agree with that. But I think depending on how serious we take the term superficial and what we think that represents, I could definitely see the position for sure. But yeah, I don't, I don't share it. Um, yeah. So this I don't really. Oh, okay. So that's it. So the, to not just criticize and not offer anything, the way that I would look at this is. Uh, fall, at least the way that I trade breakouts and stuff like this is I typically start to exit on a failure of the breakout and then follow on consolidation. So like breakout still breakout continuation, breakout continuation, breakout continuation, breakout rejection this second day, I would start to scale out. And",
    "start_timestamp_seconds": 4968.96,
    "start_timestamp": "01:22:48",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=4968"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 61,
    "total_chunks": 68,
    "text": "least the way that I trade breakouts and stuff like this is I typically start to exit on a failure of the breakout and then follow on consolidation. So like breakout still breakout continuation, breakout continuation, breakout continuation, breakout rejection this second day, I would start to scale out. And probably fully exit by somewhere in here. And then during this kind of breakout, I would buy back in breakout up breakout up breakout up, slowing, slowing, rotating this here would be beginning of exit for me the way that I trade. And then I would probably take a full exit somewhere in here. And then I would wait for another breakout of something above this, which doesn't come. So I would have already been out of this for. For a bit personally. Well, let's see this one. I need every ape to drill in their math Tesla is a short of 20 bunch of paper handed folks went to foreign a half combine five to one, 40 smaller flow. Okay, so yeah, so we're seeing that same thing again. Any number five or 10 K makes no sense. I did not even factor in the fin reshort. This is how ridiculously generous 31 and a half. Yeah, I mean, I just think that stuff is tricky to, oh, that's hilarious. I think that's a tough angle to take. I'm roaring titty. What up, roaring titty. Raintiddy says isn't the whole reason to have and accumulate wealth of the ability",
    "start_timestamp_seconds": 5137.84,
    "start_timestamp": "01:25:37",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=5137"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 62,
    "total_chunks": 68,
    "text": "how ridiculously generous 31 and a half. Yeah, I mean, I just think that stuff is tricky to, oh, that's hilarious. I think that's a tough angle to take. I'm roaring titty. What up, roaring titty. Raintiddy says isn't the whole reason to have and accumulate wealth of the ability and freedom to have a better quality of life that will depend on your morals and interest how that meant best with that money. Yeah, I literally agree. I completely agree. I think that that's a completely, a completely fair point. Um, been away for the past few months. This one I've seen around a bunch. I'm so I'm so I grew with this. I hate Robinhood. Any time to talk shit about Robinhood. I hate Robinhood. We already know that I'm down to talk shit about Robinhood. I hate Robin. I hate Robinhood. That is a very little chair for a very large. I hate Robinhood. We went to a really, really cool place this last weekend where I think I posted it in the discord. I'll actually show you guys here too, because it's awesome. There's a sanctuary and we did like a behind the scenes tour thing. And we got to look at this. We got to look at this. We got to look at this. So we got to hang out with these two girls. And these are two tigers that were from the Tiger King, which I think is. There was a grizzly bear there.",
    "start_timestamp_seconds": 5226.84,
    "start_timestamp": "01:27:06",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=5226"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 63,
    "total_chunks": 68,
    "text": "And we got to look at this. We got to look at this. We got to look at this. So we got to hang out with these two girls. And these are two tigers that were from the Tiger King, which I think is. There was a grizzly bear there. This is what jog my thought. There was a grizzly bear there named Rocco. That was like sitting in a big thing of water. And he was as massive as you would expect a grizzly bear to be. And my wife and I we literally talked about were planning a trip to go to Alaska to go check out like the grizzly bears during the salmon runs. And I'm super stoked to go see them. The thing that sounds so cool. All right. That's a cool picture. This part is tricky, right? Because there is a timing element of things. And if you're too early, there is a point where too early does become wrong. This is so funny. When DD writers don't add a TLDR. All right. Then keep your secrets. Oh, that's so awesome. Graveteris says, wait, did I miss something? Did I didn't see if grab. I don't know. I'm lost on the chat. As Sam says, Zachariah, you're right about our death being monetized. I guess I can't even dive with the clear conscience. Yes, you can. You just got to go do it somewhere that they won't find you. And then you're good. Just do",
    "start_timestamp_seconds": 5368.84,
    "start_timestamp": "01:29:28",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=5368"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 64,
    "total_chunks": 68,
    "text": "don't know. I'm lost on the chat. As Sam says, Zachariah, you're right about our death being monetized. I guess I can't even dive with the clear conscience. Yes, you can. You just got to go do it somewhere that they won't find you. And then you're good. Just do the just do the thing where people go for a sale around the world. And I mean, there's the people that try to make it. But a lot of them don't make it. GC says graveteris asks about selling options during a major squeeze like Moas or a major squeeze. What about it? Okay. But in a Moas will contracts event event actually be able to be sold for their true intrinsic value. You really have to exercise and quickly sell to get the most value. Well, you're going to run out of liquidity super fast. So there is a significant chance that during a big squeeze, depending on what you have, whether it's long call short calls, puts whatever like the volatility is going to go through the roof. So if you're trying to play the squeeze via options, which I wouldn't do personally, trying to get an exit via options during the squeezes can be really difficult. The other problem is is that if you go the route of exercise, depending on how the broker handles it, you might not be able to exercise mid day. You might only be able to exercise the end of day. So",
    "start_timestamp_seconds": 5481.84,
    "start_timestamp": "01:31:21",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=5481"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 65,
    "total_chunks": 68,
    "text": "via options during the squeezes can be really difficult. The other problem is is that if you go the route of exercise, depending on how the broker handles it, you might not be able to exercise mid day. You might only be able to exercise the end of day. So you have to be careful about that as well so that you don't get stuck holding something that otherwise you would want to exit from. But the other thing to keep in mind is that even though liquidity would go out the window, you still would make a ton of money. So even if you don't get an optimal fill, it would be. It would still likely be way more than what you would make on the share equivalent due to the leverage alone. It just wouldn't be the full amount that you theoretically should make because of liquidity. So that's why when GameStop is going through the cycles and stuff, I do use options, but it's for the smaller cycle moves and yeah, it's a little bit different. This is a good, this is a good beard. I think we've. I think we've read these before. Okay, here we go. Yep. Don't more shares than they have to be market demand. Direct buyers don't know that they're buying short. These is a violations of brokers. Yeah. Yeah. These are all we've read these ones before. Get to the bottom of this. And. Now is a great time. By the",
    "start_timestamp_seconds": 5559.84,
    "start_timestamp": "01:32:39",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=5559"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 66,
    "total_chunks": 68,
    "text": "go. Yep. Don't more shares than they have to be market demand. Direct buyers don't know that they're buying short. These is a violations of brokers. Yeah. Yeah. These are all we've read these ones before. Get to the bottom of this. And. Now is a great time. By the way, if there's anything else that you want to hit before we wrap up, that's the perfect time to start dropping them in. Big daddy Dave Lauer, I'm actually doing another podcast, or I think we're doing a live stream on the Irvin channel. Next week, I for those that don't know, I am affiliated with Irvin. I was one of the first round investors in the company, and then I added more capital through a couple of the additional rounds and I create content with them and stuff. I just really like Dave and I like what they work on. So I just like that stuff to be known if I do have an affiliation with something or somebody I do with him. All right, let me drop a comment here so that I have where we are. This will be leave off. For 4, Jan 25. Look at us go for Jan 25. All right. Let me close this down. Or not. That's another choice. Let me look to go like the chat. Let's save this. We can close all this stuff. Dylan says, what do you think about shorting some of these quantum stocks through back ratios?",
    "start_timestamp_seconds": 5634.84,
    "start_timestamp": "01:33:54",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=5634"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 67,
    "total_chunks": 68,
    "text": "us go for Jan 25. All right. Let me close this down. Or not. That's another choice. Let me look to go like the chat. Let's save this. We can close all this stuff. Dylan says, what do you think about shorting some of these quantum stocks through back ratios? I was looking at some an RGTI 30 days out. I'd like to try to short without having as much upside exposure. Yeah, I mean, you could do something like that. You're going to have a little bit more of a vault perspective. You can always do spreads if that's your flavor. But yeah, I think either of those are fine. Back ratios definitely isn't my personal go to for a few different reasons. One of them just being the velocity of the move. It dampens too much of it to the exact thing. When I'm being directional, I prefer to be directional. And that's on purpose. I'm going to be explicitly want to have a directional bias. So I'm trying to gain it. But yeah, there's nothing wrong with doing something like that. Good question though. All right. And anything else. Raptor says thoughts on a share recall based off what I tied you on X. I didn't see the thing on X. I posted it during this I didn't catch it. I'm happy to take a look though and we can stroll through it together during the next live stream. But it is time for me to get",
    "start_timestamp_seconds": 5754.84,
    "start_timestamp": "01:35:54",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=5754"
  },
  {
    "video_id": "llpfG64TOCY",
    "title": "GME Top Theories Analysis Pt9 | GameStop Analysis Ep27",
    "url": "https://www.youtube.com/watch?v=llpfG64TOCY",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 68,
    "total_chunks": 68,
    "text": "off what I tied you on X. I didn't see the thing on X. I posted it during this I didn't catch it. I'm happy to take a look though and we can stroll through it together during the next live stream. But it is time for me to get ready to go head to dinner. If you guys need anything as always, let me know. You guys can hit me up in the discord. Be an outlier. See you all later.",
    "start_timestamp_seconds": 5849.84,
    "start_timestamp": "01:37:29",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=llpfG64TOCY&t=5849"
  }
]