[
  {
    "text": "What's up, Outliers? Welcome back to another episode of the Outlier podcast. We have Richard back to talk to us about really just all the things that are psychologically wrong with me. It's always fun because I walk away understanding that I have a lot of problems, but it's great to see you again. It's so good to be here and be back. Our conversations are always so interesting because you are so upfront, you're available, and we're dealing with issues that all us human beings face rather than just superficial crap. Yeah, exactly. That's the way I look at it. I mean, what better test subject than somebody like me because there's nothing not to look at. Right before we launch the podcast, we talked actually really quick about the main things I wanted to cover today. So just to recap those quickly, you have a better version than I do. Maybe you give us the agenda for today because you're sounding way better than mine did. Well, you said let's do something easy that'll change lives. Let's do some find something hidden that'll improve traders lives. And then let's create a framework for analysis that will improve traders lives. So that was the three things I got. And I thought, geez, you're sure making it easy. I mean, you make it easier than chat GPT because all of those topics that I said were way less impactful than your versions. But yeah, that's kind of it. So after",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 46,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=0"
    }
  },
  {
    "text": "lives. So that was the three things I got. And I thought, geez, you're sure making it easy. I mean, you make it easier than chat GPT because all of those topics that I said were way less impactful than your versions. But yeah, that's kind of it. So after a few of our conversations, a lot of things come into my mind about the world of psychology with respect to trading. And one of the things that I try to remind traders of frequently is trading is that it's part of the gift in the curse is that it's it's just you. You are the researcher. You are the trader. You are the risk manager. You have a lot of hats that you have to wear. And I think a lot of us jump straight into the technical aspects of trading that we kind of forget some of these underpinning concepts. So I thought it would be really useful to start with some of those broader topics, kind of specifically those first two that you outlined so well. And then later, I would love to talk a little bit more about this process of like self assessment because I find it something I spent a lot of time actually trying to do is understand myself better my decision making. And one of the things I noticed from where I started trading back in 2007, I was a I was a teenager at that point. I was a young dude.",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 46,
      "start_timestamp": "00:01:09",
      "start_timestamp_seconds": 69.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=69"
    }
  },
  {
    "text": "find it something I spent a lot of time actually trying to do is understand myself better my decision making. And one of the things I noticed from where I started trading back in 2007, I was a I was a teenager at that point. I was a young dude. And now I'm 33. So it's like just a lot of my perception of the world has changed even in that time frame. And hopefully it will continue to change as I gain more knowledge. So I find that the way that I analyze myself has changed a lot. And I find that a lot of what I used to do was very superficial. And I'm curious if there's ways that we can dive more into that. So take us back to the beginning though. I thought it would be really useful for us to identify some of the more common pitfalls that exist so that ideally we don't spend a bunch of time in there if possible. Well, this is really interesting because my assistant is accumulating over 2000 assessments that we've done. And the text of people saying what are their issues. And we're going to come up with a real list. Now intuitively I kind of have a sense of it. But one of the first categories is is there an easy exercise something that we can do that's a little more superficial. And you already started the topic. You mentioned traders have to wear a lot",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 46,
      "start_timestamp": "00:02:13",
      "start_timestamp_seconds": 133.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=133"
    }
  },
  {
    "text": "with a real list. Now intuitively I kind of have a sense of it. But one of the first categories is is there an easy exercise something that we can do that's a little more superficial. And you already started the topic. You mentioned traders have to wear a lot of hats. So there's the risk assessment hat. There's the strategy development hat and there's the strat and there's the execution hat. When I work for a trading firm, those were clearly divided. The analysts, the researchers, the risk people and the executors. So what I would get is a trader on the floor would be prices to buy and sell above and below. So I had one function execute, just execute. Well, what a wait a minute. What this is the no, don't worry about risk. We've got that managed. We've got a whole umbrella of things we're balancing just executed. But, but no, no, just execute, Rhett. But for the independent trader, you have a dream. You work on a strategy. Sometimes in a lot of times you don't even deal with the risk because somehow that is not comfortable. But even if you do, that's a separate hat. And then you have the execution. So what I work with my traders is literally, oh, she's having is to have three baseball caps, you know, like green, blue, red, red is the risk management. The blue is the execution. The green is the strategy development, for example. So",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 46,
      "start_timestamp": "00:03:27",
      "start_timestamp_seconds": 207.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=207"
    }
  },
  {
    "text": "hat. And then you have the execution. So what I work with my traders is literally, oh, she's having is to have three baseball caps, you know, like green, blue, red, red is the risk management. The blue is the execution. The green is the strategy development, for example. So you only do one function at a time. Once you've got your strategy development done, you've done your risk management. Now it's time just execute execute. And that is so hard to step into just that because you bring your strategy development, your risk management. And as a result, your execution is just tied up and oh, maybe I should wait a little bit. You know, this doesn't seem quite right. So the easy part, the first exercise is where different hats know which hat you're wearing. And when you come to execution, just execute. The interesting part there, and I noticed this about your process a little more regularly than I don't know, I would have intuitively thought. But I've noticed several times now that you use kind of almost visceral annotations of something, right? So like to your point, like a physical hat, like something something to cause a perceived change of environment. Can you talk a little bit more about that as like a tool that you use? Sure. When a judge steps into the chamber, he puts on his robe. And that says, I am stepping out of my personal biases. When you go into the",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 46,
      "start_timestamp": "00:04:46",
      "start_timestamp_seconds": 286.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=286"
    }
  },
  {
    "text": "a perceived change of environment. Can you talk a little bit more about that as like a tool that you use? Sure. When a judge steps into the chamber, he puts on his robe. And that says, I am stepping out of my personal biases. When you go into the military, you put on a uniform that says, I am here to serve my buddies and my countries. When a policeman puts on a uniform, a priest puts on their their robes. All this is a physical embodiment of me stepping in a role that is higher than myself. So if we can recreate that for traders, I think that is really helpful because in the heat of the moment, to stay in that one embodiment is really challenging because of our emotional nature. It leads me to another really curious question. Slight rabbit trail, but completely correlated, is I've always done a really purposeful thing where I create space like I have an office at my house. Right? So like when I'm in my office, there's certain things that happen in the office that don't happen in other spaces in the house. One of the things I find interesting with trading though, is that so much of it is done here. Yes. That's with me when I leave the office. That's with me when I go to the gym. So when you think about other ways for traders, at least to be not necessarily make a bunch of changes",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 46,
      "start_timestamp": "00:06:10",
      "start_timestamp_seconds": 370.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=370"
    }
  },
  {
    "text": "with trading though, is that so much of it is done here. Yes. That's with me when I leave the office. That's with me when I go to the gym. So when you think about other ways for traders, at least to be not necessarily make a bunch of changes unnecessarily, but at least to be aware of because to me, that's as you mentioned that, I think about that. And I think like, that's actually kind of interesting because sometimes I'll be sitting in the hot tub and I'll hear an alert go off. And then I'll start doing my thing there. And that's probably not the same mindset that I would be if I'm in my office with my setup in structure. So when you look at it from a retail trading perspective, are there other things that you think they should be keeping in mind with respect to things like environment, when they choose to do things, whether it's like bounding it by time, anything like that. Yeah, I'm fact I have and we may have discussed this my mind metrics program. Yes. And what this is is a structure that sets us up to have a good strategy to analyze the strategy to be able to manage risk management to execute and then to see very explicitly which of our processes, including our mind body states, we have a place for that, our set scores of sensations, emotions and thoughts so that we can really see",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 46,
      "start_timestamp": "00:07:31",
      "start_timestamp_seconds": 451.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=451"
    }
  },
  {
    "text": "good strategy to analyze the strategy to be able to manage risk management to execute and then to see very explicitly which of our processes, including our mind body states, we have a place for that, our set scores of sensations, emotions and thoughts so that we can really see which of those inputs is making the biggest impact on our success. That's awesome. That makes a lot of sense too because yeah, when I think about the how easily what we do translates into wherever we are and the way that I think about things is different in different places and different settings. So that's it's kind of something I think is worth at least noting for people and I love that idea of the way that you come up with like your set score and making sure that we're tying things together that may otherwise be imperceptible because my guess is if people that are listening to this right now, if they took the time to take a look at their last 100 trades and even tie it to a location if it's not in one spot, there might be some sort of correlation. Yeah, so our sets scores are sensations, our physical sensations, our emotions and the quality of our thoughts and it's amazing that it's not a one-to-one correlation but as you enter those that they get color coded so you can see the colors and then you can see your PL and broadly speaking you",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 46,
      "start_timestamp": "00:08:40",
      "start_timestamp_seconds": 520.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=520"
    }
  },
  {
    "text": "scores are sensations, our physical sensations, our emotions and the quality of our thoughts and it's amazing that it's not a one-to-one correlation but as you enter those that they get color coded so you can see the colors and then you can see your PL and broadly speaking you can see the waves of how our mindset, our emotions, our quality of our thoughts are correlated with our PL and once you do that then you can start making choices as an agent that is sitting above those as rather just rather than being reactive inside of them. Yeah, yeah and it's another really interesting thing that I definitely notice that you've introduced me to more so than I generally would do with myself where you talk a lot about kind of almost like a third party analysis of you like outside looking at it and can you talk a little bit more about why you think that that's so important in the process of analyzing oneself? Sure, it comes down to a concept of agency. So let's say I'm driving down and in fact I just had an interview this morning we talked about I'm driving down the road, somebody just yeah, I see him come up behind me really fast he whoops around whoops right in front of me in between two cars and I'm going to sun up a big ride, I have no agency. That aggressive driver is determining my emotional state which goes into",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 46,
      "start_timestamp": "00:09:55",
      "start_timestamp_seconds": 595.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=595"
    }
  },
  {
    "text": "road, somebody just yeah, I see him come up behind me really fast he whoops around whoops right in front of me in between two cars and I'm going to sun up a big ride, I have no agency. That aggressive driver is determining my emotional state which goes into my physiology, my stomach, my acid, my heart rate. He is I am allowing him, it's always a him, it's women don't do that. I'm allowing him to actually shorten my life. So if on the other hand I say okay what is my job here and in this case my job is like a computer game to get my passengers to the destination safely and comfortably. Are there going to be assholes on the road? Absolutely, are there people? Yes, with self, you know texting, oh yes, are there going to people who are just tired or maybe inebriated? Oh yes. So now my job and this is where it's really cool, is I see that guy coming up behind me really fast and changing lanes quickly? Okay I'm going to move over, I'm going to move back, I'm going to do this, I'm going to give him the opportunity to do that and my passengers are not even going to notice. I'll do that a dozen times on a long trip where I am playing a computer game and at the end of the game when we were safe, I go yes, I played that game really well.",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 46,
      "start_timestamp": "00:11:19",
      "start_timestamp_seconds": 679.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=679"
    }
  },
  {
    "text": "opportunity to do that and my passengers are not even going to notice. I'll do that a dozen times on a long trip where I am playing a computer game and at the end of the game when we were safe, I go yes, I played that game really well. I made one mistake here, I could have done that better but I'll remember that for next time. So did that person determine my emotions? No, I reframed it. So in training, you know you put in a bi, it automatically it puts in a stop, bang, it's hit immediately, son of a bitch, those guys came in and they just ran the stops, you know they were just waiting for us son of a bitch and now watch, it's going to go up, it's going to turn around, oh shit, what a, what if again this was the game and I enjoyed playing it and I have agency, in other words, I continually framed the world in a way that I am in charge of my own responses. I think one of the most powerful things about that too is it highlights how important self-understanding and control is. You highlight this, let's bracket the word control for a minute but keep going. Because when I think about, and it's funny because especially from a military background, we're a lot of the things that you talk about really resonate because it's a lot of the ways that we're taught especially",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 46,
      "start_timestamp": "00:12:47",
      "start_timestamp_seconds": 767.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=767"
    }
  },
  {
    "text": "highlight this, let's bracket the word control for a minute but keep going. Because when I think about, and it's funny because especially from a military background, we're a lot of the things that you talk about really resonate because it's a lot of the ways that we're taught especially as marine officers where you're going to be the dude that people are looking at. So as soon as we have a plan that we're trying to execute and just like in trading as soon as you try to execute it, some shit always happens literally, oh, we're not a doubt. And you're just, you get so primed in something happening that when it happens, you're not even like, I can't believe this happened. You're literally just like, I expected something. But your job is to handle those things as they happen. Okay, here's a new thing, it's going to test me and I'm going to feel so good when I rise to the equation. I feel so good that I can handle some chaos. I feel so good that I am so as such confidence in myself in the world that when things fall apart, I can be the man standing that everyone looks, looks to for guidance. Wow, does that feel good? So rather than having the chaos or the internet expected, go, oh, shit. Okay, this is a chance for Eric to shine. Now a follow on question, one of the things we do in the military",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 46,
      "start_timestamp": "00:14:09",
      "start_timestamp_seconds": 849.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=849"
    }
  },
  {
    "text": "man standing that everyone looks, looks to for guidance. Wow, does that feel good? So rather than having the chaos or the internet expected, go, oh, shit. Okay, this is a chance for Eric to shine. Now a follow on question, one of the things we do in the military a lot that I see in some other places where it's like typically more kinetic environments. So think like police officers, paramedics is you kind of, you use humor a lot. And it's is a coping mechanism. It's not necessarily because you think X, Y or Z is actually like that funny. But you notice that it becomes like a coping mechanism. So like in the military, a big thing, you know, you'll hear anybody in the military, you'll hear the saying like, if it ain't raining, we ain't training, right? It's just the fact that like you know that you're going to be out there for three, three weeks. And the first day you go out there, you're going to get dumped on with rain. And you just know it and it's you're going to be wet for the next few days. And you're just, you just you make a joke about it. You're like, man, well, at least we're getting some water training in it. You know, I mean, like you come up with something. Yes, humor is a way to develop agency because if you're in the middle of this and you're just a reaction to it,",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 46,
      "start_timestamp": "00:15:22",
      "start_timestamp_seconds": 922.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=922"
    }
  },
  {
    "text": "a joke about it. You're like, man, well, at least we're getting some water training in it. You know, I mean, like you come up with something. Yes, humor is a way to develop agency because if you're in the middle of this and you're just a reaction to it, God is reading it. You know, when I'm going to, you are just reacting. And the event is determined in your experience. But humor means you need to have some agency and being able to look for a edit from a higher level. Fascinating. Do you think that there's a point where if you develop almost, is there a point where you can develop too much agency? I don't know if that makes sense in this context. I think of it as sometimes I will have Marines that they get so used to everything going wrong and making jokes about things that they almost don't know how to flip back the other mode though. Word. Now it's time to execute. It's time to get serious. Like cut the fucking joking. We need to go work now. The joking is good. It gets us to a certain spot. Then we have to flip a switch and get back at it. I don't know if that translates into the concept of agency at all our in trading, right? Because like I can think in trading where it's like we make the same joke all the time. Oh, I placed a buy order",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 46,
      "start_timestamp": "00:16:25",
      "start_timestamp_seconds": 985.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=985"
    }
  },
  {
    "text": "to flip a switch and get back at it. I don't know if that translates into the concept of agency at all our in trading, right? Because like I can think in trading where it's like we make the same joke all the time. Oh, I placed a buy order and as soon as I place it, I get a stopped out or whenever I place a trade, the market's going to make me wrong. But part of me is curious if there comes a point where you start planting that seed in your mind subconsciously and then that actually takes root in a negative way. Curious your thoughts on that. Yeah. Well, what you're pointing out is another way to avoid agency. In other words, if I just say, just happening again, oh geez, stopped out of here. Oh, it's raining again. It's like who cares that another words, the event is so overwhelming or I lose my motivation as versus agency is, okay, here's this event. I am capable, competent of handling and staying focused. So agency is a real powerful state as versus when humor can sink into I don't give a you know what right, right? Okay, so it sounds like for my understanding, it sounds like agency is like that balance. It's like being able to strike the difference between, you know, whatever your the mechanism is to maintain awareness, but not becoming like so desensitized like, oh, I'm stopped out again. Who cares? None",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 46,
      "start_timestamp": "00:17:29",
      "start_timestamp_seconds": 1049.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=1049"
    }
  },
  {
    "text": "Okay, so it sounds like for my understanding, it sounds like agency is like that balance. It's like being able to strike the difference between, you know, whatever your the mechanism is to maintain awareness, but not becoming like so desensitized like, oh, I'm stopped out again. Who cares? None of this matters. It sounds like a real balance. Yeah, it's I'm not fond of the word balance. Okay, but it is a self awareness. Now, okay, we're human beings. So we're going to have a waves of highs and lows and emotions and focus and unfocused times where aware we're agents and we're fully agent there's times when we just want to kick back with their times and are overwhelmed. But again, what I do is the golden keys is first and so awareness acceptance and agency and so if we're aware of what state we're in, then we have the ability to make the changes we want. I see. So then dovetailing then off of kind of the broader question here when you're thinking about a trader's path like a typical trader's path. I don't know how you would split the life span of a trader. I don't know if you think of it in different stages in terms of if they're a beginner experienced. But the main question I'm thinking of what this concept of agency is like, what does agency look like throughout the life span of a trader? Like, what does agency look like for",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 46,
      "start_timestamp": "00:18:39",
      "start_timestamp_seconds": 1119.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=1119"
    }
  },
  {
    "text": "know if you think of it in different stages in terms of if they're a beginner experienced. But the main question I'm thinking of what this concept of agency is like, what does agency look like throughout the life span of a trader? Like, what does agency look like for a beginner, intermediate, advanced or however you would bucket it? Yeah, I have a PowerPoint slide. That's just perfect. It starts out with all my gosh trading. I'm told I can make a lot of money. I look at all those ads that incident well fast easy money. And this is going to fill my dreams. My father will respect me. I'll get laid more often. I'm able to, you know, have a mansion in a car and I'll be a pillar of the community and people will like me. So you have this huge dream. And what this means is this dream is so central to what our hearts desire is that every tip in the market our way goes, yes, cars, women, men, whatever fancy it's every tick against you is, oh my god, my life is falling apart because my dream won't be there. Huge pressure on it. So we move from every trade being profitable or unprofitable, which moves us emotionally in one direction or the other to say, okay, we need to focus on strategy. So then we refine strategies, we create them, we make them, we mess with them. And finally we have a",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 46,
      "start_timestamp": "00:20:00",
      "start_timestamp_seconds": 1200.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=1200"
    }
  },
  {
    "text": "it. So we move from every trade being profitable or unprofitable, which moves us emotionally in one direction or the other to say, okay, we need to focus on strategy. So then we refine strategies, we create them, we make them, we mess with them. And finally we have a strategy that has been back tested and we're ready to go. We take it to market. And then we have our doubts and then we're not sure if the indicators are all there or we think, oh, this doesn't, oh, we can violate the strategy. And so then what we do is we lose confidence in our strategy. Very few of the clients who come to me are able to execute a strategy consistently. Never mind that they have confidence in it. Never mind that they've tested it. Never mind that they've done the mass so that they actually executed. It would be very profitable. So then we come to the point. Next step is, okay, we've learned to just execute this strategy. It doesn't matter if it's going to make money or not. Our job is like my job on the floor of the exchange with my firm was rich, just execute. Don't question, just execute. And they get to that point. Oh my God. And then something happens. The strategy executing it very well. We're losing money over a day, a week, even longer. So the next stage is the loss of confidence in the strategy. And I",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 46,
      "start_timestamp": "00:21:11",
      "start_timestamp_seconds": 1271.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=1271"
    }
  },
  {
    "text": "rich, just execute. Don't question, just execute. And they get to that point. Oh my God. And then something happens. The strategy executing it very well. We're losing money over a day, a week, even longer. So the next stage is the loss of confidence in the strategy. And I have traders who argue with me on this. So this is a contentious point. But that's the only way. That is all strategies fail. And they have to in this age of artificial intelligence, affirms who have PhD, quants, any strategy that's profitable for any length of time. Every, you know, all the algorithms and all the other traders are going to catch onto it. And when they all pile on, of course, it dissolves because the strategy doesn't have enough liquidity for everybody. So if you are then in the place, say, okay, this strategy works in this kind of market, this strategy works in this kind of market. In fact, in the mind metrics application, we test strategies in different kinds of markets. And then we move to market moods. My job is determine what mood the market is. And then once I get now that that's not trivial, by the way, that's really hard. But I determine what the market mood is. I know what strategy tests well in it. And that's what I do. And I know it's going to fall apart at some point. The most money that I've ever made as a trader on",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 46,
      "start_timestamp": "00:22:31",
      "start_timestamp_seconds": 1351.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=1351"
    }
  },
  {
    "text": "trivial, by the way, that's really hard. But I determine what the market mood is. I know what strategy tests well in it. And that's what I do. And I know it's going to fall apart at some point. The most money that I've ever made as a trader on the floors was when there was a shift in the market, what I call the market mood. And I remember very distinctly, where you were in the options floor putting on the spread was really profitable because the implied volatility between the two legs of the spread were quite wide. So we were putting it on and we'd been doing this for a week or 10 days and kept coming back and put it on and it was just like this money pump. And then all of a sudden, I noticed the firms were coming in the other way. And I said, you know, something's different. Every all the other market makers kept putting on the spread. I got out of my spread and I went the other way. I reversed it. And all of a sudden the spread got wider and wider. And all the market makers were getting squeezed and hurting. And finally they had to get out. But by that time, I had a huge inventory being long that spread. I lit them all out and made the very happy to help them out. Yeah, you just. I'm such a sweetheart. Sure, I'll take you. I believe",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 46,
      "start_timestamp": "00:24:08",
      "start_timestamp_seconds": 1448.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=1448"
    }
  },
  {
    "text": "squeezed and hurting. And finally they had to get out. But by that time, I had a huge inventory being long that spread. I lit them all out and made the very happy to help them out. Yeah, you just. I'm such a sweetheart. Sure, I'll take you. I believe what a nice guy I am. But the point is that they did not shift. They did not have a sense of the shift in the markets. So the primary skill of an independent trader is to determine when that market type format, whatever you want to call it, market mood starts to shift. But if you are locked into a system and applying that system across a large sample size, eventually it's going to come to a point where it's not going to work as well. And then you start to redo the system. You start to, you know, just mess with the different algorithms and and you're chasing the market and then it shifts again. So if you say, okay, my sister works really. In fact, what I do is I have my clients described market heaven. Oh, market heaven. Oh my God. If I have a trending system, it always when it breaks out into a trend, it never goes back. It just trends for a long time. Reverse this a little bit stops me out. I get to trend the other way. Oh, it's just so sweet. That's market heaven for my trending system. Market hell",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 46,
      "start_timestamp": "00:25:22",
      "start_timestamp_seconds": 1522.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=1522"
    }
  },
  {
    "text": "system, it always when it breaks out into a trend, it never goes back. It just trends for a long time. Reverse this a little bit stops me out. I get to trend the other way. Oh, it's just so sweet. That's market heaven for my trending system. Market hell for my trending system is the market center range. It breaks out. And then it comes back and then it breaks out the other way and goes a little farther. But then it comes back so that it's increasing the range. So I just get stopped out time and time and time again. So once we understand what market heaven is and what market hell is, then we can start to define it in terms of volume, implied volatility and options in terms of the length of each bar or the volume, all sorts of criteria we can look at. And we're always looking for market heaven and market hell. I love that. So then if you were to summarize then kind of the easy thing a trader can do to change their trading life, is that what it would summarize up to? Well, the easy thing was just knowing if you're in strategy mode, in risk management mode or in execution mode. This is the most challenging ask of an independent trader. And this is the most difficult. You asked about a framework for analysis. We all avoid that because we focus on our strategies and we focus on",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 46,
      "start_timestamp": "00:26:36",
      "start_timestamp_seconds": 1596.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=1596"
    }
  },
  {
    "text": "if you're in strategy mode, in risk management mode or in execution mode. This is the most challenging ask of an independent trader. And this is the most difficult. You asked about a framework for analysis. We all avoid that because we focus on our strategies and we focus on our dream. And we're looking for this perfect strategy when the really hard part is determined what's the quality of the market and is it shifting. Our brains are set up so that if we get rewarded like pigeons, you can teach them to walk and figure eight, you know, just by rewarding them. My wife can get me to do about anything she wants by putting incremental rewards there for me. She's very good at that. Yeah. So we get used to it. And like the traders on the floor in that example is once we get used to something like during the dot com boom, a whole bunch of traders went to trading floors that have never traded before. And they were given capital. And my god, they just made money, made money, made money, but I have not talked to one trader who made money during the dot com boom that kept it or any big part of it because they just got rewarded for doing the behavior and when it ended, they couldn't believe it. And they just kept doing it until it was gone. That makes a lot of sense. And I think one of",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 46,
      "start_timestamp": "00:28:04",
      "start_timestamp_seconds": 1684.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=1684"
    }
  },
  {
    "text": "dot com boom that kept it or any big part of it because they just got rewarded for doing the behavior and when it ended, they couldn't believe it. And they just kept doing it until it was gone. That makes a lot of sense. And I think one of the things I use for an example, well, there's a couple of traders that I use for an example on this. But the idea that the process of making money is obviously heart and parcel to being a trader, but then there's the process of keeping money, which even some of the best traders we've ever seen struggle to do that. Jesse Livermore is a prime time example. Yep. Yes, the equity curve. And what I work on, no trader has ever come to me and said, Rich, my biggest concern is being able to develop wealth and keep wealth and know that I deserve it and not sabotage myself. Not one, no trader has ever come to me with the problem. And I say, well, let's work on your, your being wealthy and the issues that will create. Oh, no, that's not a problem at all. Oh, no. But what happens is, you know, there's the imposter syndrome. There's the sense of what if you were consistently profitable trading, you increase your size slowly, all of a sudden, you are in very, rarefied atmosphere. Your friends who are maybe a middle class life, you're stepping way beyond that, your",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 46,
      "start_timestamp": "00:29:23",
      "start_timestamp_seconds": 1763.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=1763"
    }
  },
  {
    "text": "what happens is, you know, there's the imposter syndrome. There's the sense of what if you were consistently profitable trading, you increase your size slowly, all of a sudden, you are in very, rarefied atmosphere. Your friends who are maybe a middle class life, you're stepping way beyond that, your community, all the messages about wealth and success, maybe negative ones from your upbringing, income taxes, bookkeeping, friends coming to you for money, you are stepping into a whole new world of power. And many of my traders, they come to me, they get to that point. And the sabotage usually is in a short period of time. Sometimes in a day, they'll lose six months with the work or two to three days. Once they start down, the whole, their survival mechanism kicks in, they forget everything they've learned, they double up, they try to recoup it, and they end up giving it away. But the good news is now we're comfortable in, I am used to struggle as a trader. The thought of not struggling as a trader is, I don't know what that's like. I'm fascinated by this because I've been really fortunate in my trading career so far. And I've never felt the concept of like self sabotage, but I assume it's probably there in some former fashion based on the way that you're describing it. Well, it could be that you don't have the identity issues. Usually it comes down to, I'm not worthy. And",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 46,
      "start_timestamp": "00:30:38",
      "start_timestamp_seconds": 1838.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=1838"
    }
  },
  {
    "text": "so far. And I've never felt the concept of like self sabotage, but I assume it's probably there in some former fashion based on the way that you're describing it. Well, it could be that you don't have the identity issues. Usually it comes down to, I'm not worthy. And I could give you my own example, in my life where, and I don't know, I probably told the story about how I was traded three years, I traded on my own and made 200,000 every year. And the voice woke me up in the middle of the night and said, Rich, you're not worth 200,000 a year. I got stuck at that level. And it's a 10 minute story and I won't go into it. But I realized I was done with that internal limitation. And it had to do with my beliefs about my own capabilities. And I had negative beliefs. And so I didn't allow myself to make more money. And that day I went into the exchange early. The doors were still locked. I got to the pit. The first trader there, I stood in the best pit. And I had to fight for that spot because the guy that was always in the best spot, he was a tough SOB, right? So I stood my ground. There was a thread of a fine from the exchange if we got into a fight. The bell went off and I just went crazy. Rich, the pit thought,",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 46,
      "start_timestamp": "00:32:04",
      "start_timestamp_seconds": 1924.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=1924"
    }
  },
  {
    "text": "because the guy that was always in the best spot, he was a tough SOB, right? So I stood my ground. There was a thread of a fine from the exchange if we got into a fight. The bell went off and I just went crazy. Rich, the pit thought, Rich, freezing a gun, that's by him, so I'm, I'm scream right now, but I don't want to blow your ears off. But you know, I went on to make many times my 200,000 dollar limit. But it was just a mind game around my own identity and my worth. And traders do not often get to the point where they're saying, am I worthy of this? Can I live in this rarefied world? I mean, some of us are so used to struggle that we don't know what life is like stepping out of struggle. In fact, we have survival mechanisms that say, I know how, Rich, Rich, reason knows how to survive this struggle. He struggled with this, and with this, and he was a kid. He knows how to survive it. So I'm going to keep this struggle going because we can survive it. But can we survive something wonderful? Oh, no, no, we don't know that. So we're going to stay in this struggle. That's absolutely fascinating. It really is because one of the things I love talking to you is gaining exposure to like these other things that honestly, like don't really cross my mind.",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 46,
      "start_timestamp": "00:33:20",
      "start_timestamp_seconds": 2000.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=2000"
    }
  },
  {
    "text": "survive something wonderful? Oh, no, no, we don't know that. So we're going to stay in this struggle. That's absolutely fascinating. It really is because one of the things I love talking to you is gaining exposure to like these other things that honestly, like don't really cross my mind. I've never really thought about like my own worthiness in that context. And it goes back to something I, I've always postulated about myself where it's like, I'm smart enough to know how to do things. But I'm dumb enough to not spend enough time thinking about how I'm not that smart. It's this little circle where I'm like the thought of assessing whether or not I'm worthy. Literally, it never even comes up. Well, that's wonderful. Well, maybe it's not. Maybe it's because I'm too dumb to think about it. But I think it's a really interesting point, though, because at least I think for people like me that grow up poor, the ability to like work really hard and then see an outcome, I guess for me, that in and at least makes it feel somewhat like it's like worthy, right? Like put an effort, have outcome. But I can see for other people different reasons why they might not feel worthy. But I'm really curious from your research and from your work, what are the most common reasons why somebody might not feel worthy themselves? Yeah. So what I do is I do a guided visualization. Deep",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 46,
      "start_timestamp": "00:34:39",
      "start_timestamp_seconds": 2079.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=2079"
    }
  },
  {
    "text": "I can see for other people different reasons why they might not feel worthy. But I'm really curious from your research and from your work, what are the most common reasons why somebody might not feel worthy themselves? Yeah. So what I do is I do a guided visualization. Deep breathing, relax. In fact, we could do a really, this is usually an hour or two hours, but we could do an abbreviated version. So if you understand this is like on five times speed, create a the perfect trader's house. Successful trader's house is it by the ocean and the mountains by his stream. Is it a log cabin? Is it modern design? So I have them design the house, the glottic glass. Okay, you're standing on the road, on the driveway, looking at the house. This is where a successful trader lives. So then I have them start to approach the house. How is your breathing? How is your muscle tension? As you walk toward this perfect house for a trader, what do you notice? What thoughts are you having? So then we go all the way up to the porch, put our hand on the door handle. What kind of handle is it? What do you feel right now? Okay, so I want you to look back and in the driveway is start is everyone who's ever impacted your life. You are about to step into a successful trader's house. Who is objecting? My dad is objecting.",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 46,
      "start_timestamp": "00:35:51",
      "start_timestamp_seconds": 2151.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=2151"
    }
  },
  {
    "text": "What kind of handle is it? What do you feel right now? Okay, so I want you to look back and in the driveway is start is everyone who's ever impacted your life. You are about to step into a successful trader's house. Who is objecting? My dad is objecting. Let's go back. Let's talk to your dad. I grew up in the depression. We had to work hard and to make money easily is just wrong. Do you know I work three jobs to put your dad and your, I'm your grandpa, you know, to put your dads and your kids through, we had eight kids. And here you are just thinking that you can just step into this easy life. Whoa, now here's a message that is embedded in the past. And I'm exaggerating this a bit, of course. So okay, so let's then we have conversations with dad, with grandpa or dad or mom or uncles or brothers or whoever it is that has concern. And it almost always comes down to they want the best for you. And they are sad that they had to work so hard, work their fingers to the bone in order to provide just the essentials. And eventually we can come to the place where they can accept you step into the house. And when we go up to the house again, we look back again, we open the door, what are the physiology your experience in as you open the",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 46,
      "start_timestamp": "00:37:03",
      "start_timestamp_seconds": 2223.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=2223"
    }
  },
  {
    "text": "to provide just the essentials. And eventually we can come to the place where they can accept you step into the house. And when we go up to the house again, we look back again, we open the door, what are the physiology your experience in as you open the door, what's your breathing, your muscle tension. We go to the trader's room, describe the trader's room, sit down. Do you deserve to be here? Sometimes the answer is no, this isn't me. I don't deserve this. Then we go back and work on that. So we we keep doing that until the person says, if they're identity, their beliefs and their behaviors are all in rapport and they deserve to be there. Now when they go to trading, what we do is we anchor that house, we visualize it, create a picture of it so that now that feeling of rapport and the unification of their physiology, their emotions, their thoughts, all the history so that they can now step into that state intentionally as an agent in their own life as versus having all these old conflicts and voices fighting them all the way so that they end up sabotaging themselves so they can go back and end that stress. Interesting. So then when you work with people that tend to have this feeling of like a variance and worthiness compared to where they are, do you think that it often comes from self-imposed perceptions that don't actually",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 46,
      "start_timestamp": "00:38:22",
      "start_timestamp_seconds": 2302.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=2302"
    }
  },
  {
    "text": "up sabotaging themselves so they can go back and end that stress. Interesting. So then when you work with people that tend to have this feeling of like a variance and worthiness compared to where they are, do you think that it often comes from self-imposed perceptions that don't actually reflect reality necessarily. So to your point, if we have the conversation with Grandpa in our mind and it goes like that, but then in reality, Grandpa actually doesn't necessarily feel that way. Like really wants you to be just gave away the secret. Yes. When we have those conversations that turns out that he loved you and he wants you to do well, but that we just picked up his anger around working so hard, trying to provide for the family, the taxes come, the rent was raised, just anger around all those things and are what we're not infantile. But our youngest self absorbs all these and reinterpret that message in a way that doesn't serve us. Oh my gosh, there were times that I misunderstood some things my dad said, you know, total, I just misheard the words and it created an image in my mind that I carried forward for a long time. So that's a great observation. Thank you, Eric. Yeah, interesting. So to pivot then to kind of like this idea of a less apparent thing for somebody to think about, to transform their trading lives, what's something that you come across fairly regularly,",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 46,
      "start_timestamp": "00:39:46",
      "start_timestamp_seconds": 2386.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=2386"
    }
  },
  {
    "text": "I carried forward for a long time. So that's a great observation. Thank you, Eric. Yeah, interesting. So to pivot then to kind of like this idea of a less apparent thing for somebody to think about, to transform their trading lives, what's something that you come across fairly regularly, but a trader might not consider for themselves that they would want to know about change be aware of as it pertains to their ability to be a successful trader. Yeah, I think that we already looked at the most deepest thing and that is our identity, our beliefs and our behaviors and the foundation of who we are and are we deserving. And that's the hidden framework that most traders, it doesn't even occur to them to go that there, but without that positive foundation, without that rapport with all parts of ourselves, we end up sabotaging the typical equity curve of a trader who comes to me. Let's, is boom, boom, boom, boom, boom, boom, boom, boom, boom, boom, and that at that top of that peak there, you know, what's going on? And sometimes it's the imposter syndrome. I mean, sometimes it's just so powerful to realize how your life will change if you can do that consistently and just keep increasing size. Oh my gosh. And we do a lot of visualizations like, okay, you have a 10 million in the bank now. What, what house do you live in? What, what friends do you have?",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 46,
      "start_timestamp": "00:41:19",
      "start_timestamp_seconds": 2479.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=2479"
    }
  },
  {
    "text": "how your life will change if you can do that consistently and just keep increasing size. Oh my gosh. And we do a lot of visualizations like, okay, you have a 10 million in the bank now. What, what house do you live in? What, what friends do you have? Oh, my friends are just trying to suck off of me or my friends don't, you know, they just not comfortable or I don't tell anybody and I just keep it private. So we, we look at stepping into that successful place and imagining it and visualize it and getting a visceral feeling for it because until you can viscerally step into success, parts of ourselves will not let us go there because we don't know the risk. So my job is to give them a visceral experience of success. Check, just like we look back in the driveway, check all the things that are resistant to that so that they can have rapport with that experience. When you think about this process of creating like these visceral responses or perceptions of something or the self-analysis, what are your thoughts on inviting the world of excess analysis and creating a cycle where everything becomes so analyzed that it kind of locks somebody up? Yeah, for me, the model that works for me recently is life is a wave. In other words, there's all sorts of parts when I'm building a strategy, it's excess analysis all the way. I'm aware I'm",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 46,
      "start_timestamp": "00:42:47",
      "start_timestamp_seconds": 2567.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=2567"
    }
  },
  {
    "text": "cycle where everything becomes so analyzed that it kind of locks somebody up? Yeah, for me, the model that works for me recently is life is a wave. In other words, there's all sorts of parts when I'm building a strategy, it's excess analysis all the way. I'm aware I'm in analysis. I'm aware that I am thinking details, whatever. Okay, I go out of that and I go into a different part of the wave. So the important part is, I think what you're implying is if we get locked into that excessive analysis, that top part of the wave, well, that means that we're cutting out our intuitive creative abilities, we're cutting out the ability to execute faithfully, maybe. So for me, like having the three hats, if I think of life as a wave, okay, and I can intentionally, I'm going into analysis right now. And I'm going to spend the next two days or three days just in analysis. When I was had a floor trading firm, the part of it was CFTC, SEC, the Pacific Stock Exchange, the tax authorities, tremendous amount of paperwork, you know, piles like this. And as a trader, no way I could even look at them. So I had to end up going in on a Sunday and I'd pace back and forth and look at that paperwork and pace back and forth. Finally, I'd say, okay, I am going into operational details and I'd pick up one piece of",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 46,
      "start_timestamp": "00:44:16",
      "start_timestamp_seconds": 2656.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=2656"
    }
  },
  {
    "text": "I could even look at them. So I had to end up going in on a Sunday and I'd pace back and forth and look at that paperwork and pace back and forth. Finally, I'd say, okay, I am going into operational details and I'd pick up one piece of paper, handle it, give it to the right person to follow through or whatever it needed. And then I could do that. So I can step into that operational phase. I can step into analysis phase. I can step into creativity states. And the important part is as an agent in my life, what part do I want to be in? And how do I trigger that? So if I can do that, be aware of what part I'm in and eventually create the agency to determine what part I want to be in, that is heaven. I see. So we have around 10 minutes. And I want to continue that thread specifically on this idea of like self analysis. Because one of the things I find that's so different, and again, maybe this is just because I'm generally a lay person that just kind of starts doing things, is that I go through a layer of analysis typically on something. And then if I feel like it's good, good enough, I'm cool executing it and then moving on. And I think a lot of that also just stems from the military, because we want an 80 solution now executed",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 46,
      "start_timestamp": "00:45:54",
      "start_timestamp_seconds": 2754.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=2754"
    }
  },
  {
    "text": "that I go through a layer of analysis typically on something. And then if I feel like it's good, good enough, I'm cool executing it and then moving on. And I think a lot of that also just stems from the military, because we want an 80 solution now executed violently over 100 solution later. When I think about the world of traders now and the wealth of information, I could just see the propensity even from a self analysis perspective. Like when we're thinking about ourselves our worthiness, if there's misalignment between our values, I could just see that also becoming gridlock and kind of circuitous. So when you think about somebody that's going through this self analysis process to like better understand themselves, their psychology decision making, are there any methods that they can employ so that as they're analyzing something, they're coming to an output that then they're satisfied with that output perceivably, and then can move to the next output versus cycling on the same thing. Well, I certainly understand what you're saying. Something executed right now, 80 immediately violently learn, adjust, execute. And that is so important because it extended analysis means you're not learning Ditch-Shot. So execute, execute, execute, learn, adjust, learn, execute, adjust. Again, it's a wave. So if you say I'm going to get 80 analysis, I'm going to execute, I'm in execution mode, I'm in review mode, and I'm going to look at what happened, I'm going to improve analysis, 80,",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 46,
      "start_timestamp": "00:47:03",
      "start_timestamp_seconds": 2823.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=2823"
    }
  },
  {
    "text": "Ditch-Shot. So execute, execute, execute, learn, adjust, learn, execute, adjust. Again, it's a wave. So if you say I'm going to get 80 analysis, I'm going to execute, I'm in execution mode, I'm in review mode, and I'm going to look at what happened, I'm going to improve analysis, 80, 70 execute. And so you have that wave where you and you know where you're at. I do have clients that come to me that just in agony over their strategy and they'll send me 20 pages of details of their strategy and where they and should I adjust this by point 0.01. And when we get down to it, many of them are afraid of being wrong, of executing, of learning in a chaos that they're looking for a structure to give them comfort. So the more I analyze the structure, the more comfortable I feel, and yet there's something non-at-me, I'm not moving forward and I'm not getting done. So what I do is say, well, okay, let's just play. And I, let's set up a demo account, and your job is just to execute at 70. That's it. We're not, there's no money involved, but consistently execute the strategy just consistently. And we're going to measure you not on the PNL, but did you execute the strategy? And they'll execute maybe at 40 at the time. Okay, we're going to, we've now measured the 10 trades, you're executing 40. Let's move it up to 60. 70, 80.",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 46,
      "start_timestamp": "00:48:37",
      "start_timestamp_seconds": 2917.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=2917"
    }
  },
  {
    "text": "the strategy just consistently. And we're going to measure you not on the PNL, but did you execute the strategy? And they'll execute maybe at 40 at the time. Okay, we're going to, we've now measured the 10 trades, you're executing 40. Let's move it up to 60. 70, 80. Until we're executing consistently, now we're learning. So we're also learning that every trade, every trade has a reason not to make it in that moment, because if there wasn't, I mean, if there wasn't a reason it, then it's probably not a good trend. There's always reasons not to execute. So again, it's a wave, nowhere you are in the wave, and analysis paralysis executing that 70 if you're consistent with it, you'll learn more. One of the most impactful things that took me a long time to get over, especially when I was a younger dude, I always felt like I had to perform exceedingly well. And it never really felt imposed externally. It always felt like it was just an expectation I had of myself or whatever reason. I don't know the background behind it. But when I think about one of the big pivots I made in my trading career, it was becoming okay with losing trades. Now, I find, and I know you don't like to term, there might be a better term, but I find that there's a balance or maybe, you know, not sure the term I would want to use here, but",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 46,
      "start_timestamp": "00:50:06",
      "start_timestamp_seconds": 3006.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=3006"
    }
  },
  {
    "text": "in my trading career, it was becoming okay with losing trades. Now, I find, and I know you don't like to term, there might be a better term, but I find that there's a balance or maybe, you know, not sure the term I would want to use here, but that there's a balance between desensitizing and not tying the outcome of an individual trade to me as a human being, but also treating losing trades with respect because they deserve respect. No, understand what happened. What would you surmise the role and the optimal relationship with losing would be for a trader? Yeah, what I do is we measure the percent of trades that are executed well. And so we have trades that are executed well and trades that aren't. That's the only measurement that we lose that we use. And so our job is to execute all the trades well and that's it. And if the strategy doesn't hold up, we're going to learn that. So there is no loss. So you know from neuroscience that our brains deliver twice the amount of pain for a X loss as it does for an X game. So what we do is we only measure the execution. So if I can get my execution up to 80, 90 of my strategy, that's a big win and we no longer lose. So we don't look to somehow not feel the losses, but we reframe it so that our win is execution",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 46,
      "start_timestamp": "00:51:30",
      "start_timestamp_seconds": 3090.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=3090"
    }
  },
  {
    "text": "do is we only measure the execution. So if I can get my execution up to 80, 90 of my strategy, that's a big win and we no longer lose. So we don't look to somehow not feel the losses, but we reframe it so that our win is execution when we're in execution mode. And we'll say, oh, well, it looks like that strategy didn't work very well in this market. Nothing to do with us. No failure is just the strategy in the market. And our job was just to execute the strategy. Okay, can I, is there indications that I could look for a different market mood to put this strategy in? So then all of a sudden, we're not in the situation where we're having to feel the loss at all because our only job is to execute the strategy and execute it well. That's a really different perspective. And it's interesting to hear because to me, hearing that it sounds like I would say that that person's hiding from reality that they're unable to accept loss and that we can't even use the term loss. What do you think, what do you think about that? Do you think that that's misguided or like my perspective? Or do you think that it's relative to a person? Of course, everyone's different. But I find that moving from handling loss to just executing the trades is something that's totally under your control. Totally. So I have a category",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 46,
      "start_timestamp": "00:53:06",
      "start_timestamp_seconds": 3186.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=3186"
    }
  },
  {
    "text": "Do you think that that's misguided or like my perspective? Or do you think that it's relative to a person? Of course, everyone's different. But I find that moving from handling loss to just executing the trades is something that's totally under your control. Totally. So I have a category of trade executions that if you're rested, you did your research analysis, you determined what strategy you were using and you executed it absolutely. That is a lucrative trade. Doesn't matter if it's profitable or not. So it's a lucrative or it's not lucrative. And our goal is just to make lucrative trades. Now, everything in a lucrative trade is under your control. So you can have 100 lucrative trades. Now you can sit back after we're said and say, okay, in fact, I have a spreadsheet, especially for this, that we look at each strategy and we can determine and we look at the market mood and we can determine, well, how's this strategy working in this market mood? But what that does is it removes our ego, our need from the equation because when I was on the floor trading, my job was just to execute the trades. The firm gave me the values. I bought under and sold over. That's all I did. So again, the three hats, you know, are you in research and strategy building, are you in risk management or are you in execution mode? And once you're in execution mode, the loss is",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 46,
      "start_timestamp": "00:54:29",
      "start_timestamp_seconds": 3269.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=3269"
    }
  },
  {
    "text": "The firm gave me the values. I bought under and sold over. That's all I did. So again, the three hats, you know, are you in research and strategy building, are you in risk management or are you in execution mode? And once you're in execution mode, the loss is not something you even consider because there is no loss. You're making a series of lucrative trades. Now, when you look at it and review it, then you can determine accurately whether that strategy and that market mood is working, but it's not you and it's not your failure. Fascinating. Yeah, it's so interesting. I love and I love the way that you kind of share like a very different perspective in the way that it's still I can see how that would work for somebody. And when I look at the path of traders, it obviously seems highly individualized. People have a lot of different motivating factors in the way that they perceive things. When you look across your overall experience doing what you do, what are some of the most common themes that you find among traders? Discipline, willpower. I need more discipline. I need more willpower. That is the one that keeps coming up. I don't execute my strategy. I just need more discipline and willpower. And so again, just like going from lousy to lucrative trading and reframing that, I say there is no such thing as willpower. There's no such thing as discipline. What there",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 46,
      "start_timestamp": "00:55:55",
      "start_timestamp_seconds": 3355.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=3355"
    }
  },
  {
    "text": "is the one that keeps coming up. I don't execute my strategy. I just need more discipline and willpower. And so again, just like going from lousy to lucrative trading and reframing that, I say there is no such thing as willpower. There's no such thing as discipline. What there is is your experience of stepping into a state and an execution that feels better in the moment. So let's set it up so that following your strategy feels better. So that is, oh, I want to be there. I want to be there. I want to be there. As just a side note, what's interesting, I'll often trade with my active traders. I'll be there on Zoom. I'll just be in a window and I'll have them just kind of think out loud. Not one trader has ever violated their strategy. Well, maybe once, but it just almost never violated their strategy, or I was there present. Why is that? They didn't need willpower. They didn't need discipline. But I keep inviting into their higher level agency and they know I'm there. And so what our training goes is to have them incorporate that internally so they have that higher level agency. I love that. That's fascinating too. I think the idea of becoming more familiar, like self-aware with agency is probably something we have to spend more time on in the future because it seems one of those topics that as you talk about it, it's kind of",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 46,
      "start_timestamp": "00:57:24",
      "start_timestamp_seconds": 3444.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=3444"
    }
  },
  {
    "text": "higher level agency. I love that. That's fascinating too. I think the idea of becoming more familiar, like self-aware with agency is probably something we have to spend more time on in the future because it seems one of those topics that as you talk about it, it's kind of straight forward, generally transparent. You kind of know what's there, but obviously it's incredibly nuanced. So I love that you bring that to everybody's attention and something for them to focus on. But as always, every time I talk to you, the time flies. And it's incredible. I really enjoy just learning the perspectives. And I think that you offer a lot of really interesting ideas and approaches that can work for all different kinds of people. So first, you know, quick thank you for coming to hang out for a bit. But before we fully wrap up, is there anywhere that you want to send people over to you? Obviously, throw your website in the description below so that everybody can come find you there. But anything else? Yeah, mind mussels or traders.com. That's FOR. Mind mussels for traders.com. There are maybe 60, 70 different blogs on there addressing almost all the issues traders have. There's ways that you can order my book, a private conversation with money. You can schedule time if you want. There's a way to schedule time with me to do a discovery session. And we can look to see how I can best support",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 46,
      "start_timestamp": "00:58:50",
      "start_timestamp_seconds": 3530.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=3530"
    }
  },
  {
    "text": "almost all the issues traders have. There's ways that you can order my book, a private conversation with money. You can schedule time if you want. There's a way to schedule time with me to do a discovery session. And we can look to see how I can best support you. So it's all there. Mind mussels for traders. And I'd be happy to help or talk to any of your listeners and to see how we can support them in their goals to become a consistently profitable trader. Awesome. Thank you so much, Rich. Absolutely. Pleasure for hanging out. And I look forward to keeping in touch. We'll have you back on soon. Well, let's do it again. In fact, let's make it a regular. You don't scare me. Oh, okay. Next time I'll I'll be a little scary, right? Promise. All right. We'll live up to it. Okay. Okay.",
    "metadata": {
      "video_id": "llug0_5XK9Q",
      "title": "2 Powerful Trading Psychology Techniques - Rich Friesen | TOP Ep77",
      "url": "https://www.youtube.com/watch?v=llug0_5XK9Q",
      "upload_date": "",
      "duration": 3668.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 46,
      "start_timestamp": "01:00:03",
      "start_timestamp_seconds": 3603.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=llug0_5XK9Q&t=3603"
    }
  }
]