[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you did you you that or not? you should do that. and you should do that in the back of your mind So what we need to do is actually gain some context. So I'm gonna go further out. I'm gonna go over the last few weeks. What I want to do is see a sense of, man, look at the... These are big fucking trades, man. Hey, I'm... I mean, like, this is 250 returns of million plus trades. That's pretty incredible. Super active. Tons of these are short calls. This I expect to be the case as part of covered call campaigns. Because I know there are a lot of people right now that are sitting on heavy gains in volunteer that have gotten in when it was sub-20 that are just holding the stock and continuing to sell calls against it. Generating pretty decent money off of that. So that's what a lot of this will be. Yeah. Cool. All right, let's go through a couple other things super fast. I don't think this is the correct one. No, I think that was the correct one. Maybe is this one. One of these tells me something different. I don't know which one. No, that I know. This",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 52,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=0"
    }
  },
  {
    "text": "Yeah. Cool. All right, let's go through a couple other things super fast. I don't think this is the correct one. No, I think that was the correct one. Maybe is this one. One of these tells me something different. I don't know which one. No, that I know. This is just for the day. I don't care about this one. Right now. Okay. We go in here. Jesus Christ. Look at this. That is. This is profound. Like that's not being dramatic. That is profound. That is a ton of money and call premium that came through on Friday. The next closest was what? Here. At 53 mil. That's crazy. Net premium here was. 53. 20. 23 is the net here at 65 is the net. That's an insane. It's just an insane amount of activity. Let's see what people are positioning as. Huge build out in 19 Ds. That's actually really good to see, to be honest, because this kind of massive skew this further out in time, this represents positioning based on longer term expectations. But I mean, there's a lot of put activity as well. Now again, we have to take a look at if the puts are actually bought or sold. We don't know that just yet. I mean, the put side of half to imagine is broadly being attached to long stock. And we can figure that out in a couple different ways. We'll take a look at a sec. Let's take a look",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 52,
      "start_timestamp": "00:14:35",
      "start_timestamp_seconds": 875.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=875"
    }
  },
  {
    "text": "puts are actually bought or sold. We don't know that just yet. I mean, the put side of half to imagine is broadly being attached to long stock. And we can figure that out in a couple different ways. We'll take a look at a sec. Let's take a look at premium. Yeah, so way more call premiums in general, like as I flip through this, we can see it, this flips here in 19 Ds with big put premium. That's really the only cycle. It's very much dominated by bullish. Bullish call premiums. And the build out. I mean, the build out is mostly overhead price. Like these are kind of right at spa, but then you can see the 138s are heavy. Even the 139s, which contracted, they're still heavy. These aren't moving much. The 150s. Yeah, I mean, it looks like, like as I poke through this, it absolutely seems in general, like the market favors it to the upside. Now, it doesn't look like necessarily a super short term, a super short term thing, though. Meaning a lot of these positions are out pretty far in time. So total, oh, I, I see two mill calls, two mill puts. This was on the 30th. Let's take a look at a couple other things. I want to see. Ah, interesting. Very interesting. So this seems like institutions have been offloading into the strength. And let's see what insiders are doing. I imagine they would be offloading. Yeah.",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 52,
      "start_timestamp": "00:16:51",
      "start_timestamp_seconds": 1011.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=1011"
    }
  },
  {
    "text": "two mill puts. This was on the 30th. Let's take a look at a couple other things. I want to see. Ah, interesting. Very interesting. So this seems like institutions have been offloading into the strength. And let's see what insiders are doing. I imagine they would be offloading. Yeah. In these kind of instances, you just have to expect this because if you see the stock rallying like this, if you're an insider with a decent amount of your capital and your net worth tied into a stock like this, like this is just strategic profit taking, I think, because you have to remember a lot of these people, I don't know, the backgrounds, but a lot of people, they'll look at insider transactions and say like, oh, the insiders are selling the stocks going down. And for a lot of people, especially in smaller companies that are starting to really hit their stride, a lot of them might have been toiling on this thing for some time before starting to see like meaningful price appreciation on the shares that they've been granted over the years. And it just gives them a chance to take some risk off the table. Right? Like actually put some money in your pocket because like this person, Shane, car, shy, I don't know anything about them. They're the CTO, but I mean, they just got like a two mill, a two mill payday, but I don't know what their comp is over the",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 52,
      "start_timestamp": "00:18:37",
      "start_timestamp_seconds": 1117.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=1117"
    }
  },
  {
    "text": "table. Right? Like actually put some money in your pocket because like this person, Shane, car, shy, I don't know anything about them. They're the CTO, but I mean, they just got like a two mill, a two mill payday, but I don't know what their comp is over the duration that they've been there. And I don't know how much they've made over the duration that they've been there. But this makes sense to me. I would be absolutely expecting people to start taking some profit off the table. People like Steve McCullough is a little bit different because we know we know that they're sitting on cash. But yeah, super interesting. Let's take a look at a couple other things. No, this isn't what I want. This is what I want. So all I'm doing is getting a sense of what the near term price pressures might look like. Which is fairly balanced actually. Definitely net long. But with spot right now kind of in this zone. Overhead is super light. It's all below spot right now. Pistol shrimp. That's a fun name. What up? Pistol shrimp says, hair, I can usually catch your videos after what caught your life for once. That's awesome. I'm glad you're able to make it. We always enjoy poking through the markets a little bit and seeing what's what's cracking. Chris says just got here to talk about GameStop yet. Nope, not yet. That'll actually probably be next. So we're wrapping up",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 52,
      "start_timestamp": "00:20:20",
      "start_timestamp_seconds": 1220.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=1220"
    }
  },
  {
    "text": "your life for once. That's awesome. I'm glad you're able to make it. We always enjoy poking through the markets a little bit and seeing what's what's cracking. Chris says just got here to talk about GameStop yet. Nope, not yet. That'll actually probably be next. So we're wrapping up the first stock, which is a volunteer. Actually, and then we'll take a peek over at GameStop after this. Here we go. This is stuff that I know probably doesn't mean that much for people. For me, I like I like looking at the wall plots. Nothing jumping out at me. Let's take a look at one more thing. I just want to see any other recent news flow. Here. Let's go to the platform itself. This just helps me poke through really fast and see if there's any big news that looks interesting. Volunteer stock gains as Trump expands companies rolling US government agencies. This will continue to probably be the case for them as we were just talking about. I mean, they got a good foot in the door. The one thing to keep in mind, though, specifically about volunteer is that as price starts to skyrocket as much as it is, you do have to start questioning valuations because valuations do matter longer term. And you need to see adequate supportive growth. So like right now, the forward price to sales is 75.6 and it's at 265 times adjusted earnings. That's kind of a lot. And it's",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 52,
      "start_timestamp": "00:22:10",
      "start_timestamp_seconds": 1330.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=1330"
    }
  },
  {
    "text": "much as it is, you do have to start questioning valuations because valuations do matter longer term. And you need to see adequate supportive growth. So like right now, the forward price to sales is 75.6 and it's at 265 times adjusted earnings. That's kind of a lot. And it's 222 times forward earnings, which to me is more important. So those kind of valuations are they really become highly prone for disappointment when things are poised at those levels. So yeah, I think I think the main stuff that we're seeing here is the company seems to be continuing to grow a big difference, though, is I would consider a lot of its growth actually like solid fundamental revenue growth, which is good. That's good for the company. Cool. Let us move on to the crowd favor. The heavy hitter, the golden child, GameStop. And I also do want to crack open the DD library because last time we didn't, I wanted to see if we can get through maybe one more from there and just kind of poke through those as we go. So a couple of things we know that earnings has been solidified, right? So 10th of June, done. And we also know that GameStop was on a hell of a tear. And again, the same thing I always tell you guys and you were reiterating because it is always the case. Before we started seeing levels up here at 35 down here from like the",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 52,
      "start_timestamp": "00:24:19",
      "start_timestamp_seconds": 1459.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=1459"
    }
  },
  {
    "text": "of June, done. And we also know that GameStop was on a hell of a tear. And again, the same thing I always tell you guys and you were reiterating because it is always the case. Before we started seeing levels up here at 35 down here from like the high 20s, what do you notice happens with volume? Volume grows. And this isn't like some sort of again, this is not like, oh, Eric knows the secret. That nobody like everybody fucking knows this. But the thing that's important is that as we spend so much time talking about, you know, again, like the different cycle analysis, the different ideas on FTDs and all of these other things. All of that stuff is completely fine to take a look at, to tinker with, to explore, all that is completely fine. But from a trading lens, it is always the same thing. Volume proceeds the move. It's never not done that. So I think it's super important to keep that in mind when we analyze GameStop because from the trader lens, that's ultimately what matters. So my position via the coverage triangle in here, I don't think has changed that much. The only difference was is I was speculatively trading this move with just options, long option separate from that. So those essentially are completely phased out now. But it was in response to this day here, actually. So the total gain wasn't anything spectacular. But it was still a",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 52,
      "start_timestamp": "00:25:46",
      "start_timestamp_seconds": 1546.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=1546"
    }
  },
  {
    "text": "much. The only difference was is I was speculatively trading this move with just options, long option separate from that. So those essentially are completely phased out now. But it was in response to this day here, actually. So the total gain wasn't anything spectacular. But it was still a moderate gain in a relatively short period of time. So we can talk about that stuff later at another time. If you guys are interested, let's focus on the stock though. So let's take a look. These days are almost rolled off. So you're going to see pretty soon a big change in a bunch of the metrics because you can see we have implied volatility percentile is showing us that 56 implied volatility rank is going to normalize soon. Implied volatility rank got so messed up because of this. And it will stay skewed because of this literally for an entire year. Whereas you can already tell implied volatility percentile does a much better job compensating for outlier moves, just literally in the method that they're calculated. This down move, we can say it's due to a bunch of stuff. But some of the main things that I do think are worth highlighting were the moves based on the Bitcoin position. So this came out 28 May. And if you take a look at this day, 28 May. So a big piece of what happened here is GameStop made the announcement that it grabbed 47, 10 Bitcoin, which again,",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 52,
      "start_timestamp": "00:27:11",
      "start_timestamp_seconds": 1631.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=1631"
    }
  },
  {
    "text": "think are worth highlighting were the moves based on the Bitcoin position. So this came out 28 May. And if you take a look at this day, 28 May. So a big piece of what happened here is GameStop made the announcement that it grabbed 47, 10 Bitcoin, which again, we don't actually know at what price we can speculate what the current values worth based on spot price against that number. But we don't know what their actual basis is. And that's why this says worth more than half a billion dollars. Now the move here is really interesting. And I think there's a couple things that this tells us about the positioning in the company based on the various parties. Random skate says by the rumor, sell the news, it could be that kind of scenario. A big thing that this hints at though is that there's a significant regime change underway right now for GameStop. And that regime change is heavily dependent on what the company chooses to do going forward. Because now it has two different flavors associated with it in a pretty big way. It has the brick and mortar game stop, physical store thing with card grading and collectibles. And now it's starting to spread a little further into the cryptocurrency holding side of things via Bitcoin. Now during we watch the video from Cohen and Cohen was talking about how Bitcoin serves as a currency hedge, which is interesting. I think that he's",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 52,
      "start_timestamp": "00:28:31",
      "start_timestamp_seconds": 1711.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=1711"
    }
  },
  {
    "text": "with card grading and collectibles. And now it's starting to spread a little further into the cryptocurrency holding side of things via Bitcoin. Now during we watch the video from Cohen and Cohen was talking about how Bitcoin serves as a currency hedge, which is interesting. I think that he's saying that more so because that's like a good talk track. But I don't think anybody actually views the movement as that. I think the move is way more associated with the thing that he slid on the end, which was the speculative nature and trying to trade the appreciation of Bitcoin. Now the biggest question remains here, which is what is the future and specifically for GameStop because the brick and mortar store is still struggling. And it's starting to show that it's making some changes, which is great. But we still don't really know what the ultimate direction is going to be. They didn't really use a ton of cash on this Bitcoin position, which I'm actually very happy about. I wouldn't want to see a massive Bitcoin position come on because we still don't have a sense of what the cash is doing. And we also know that Bitcoin is super volatile. And if you go too heavy on Bitcoin and that's a big part of your balance sheet that is compromising and people will say stuff like, oh, well, maybe Bitcoin will be the next micro strategy. I absolutely hope not because micro strategy is effectively",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 52,
      "start_timestamp": "00:30:21",
      "start_timestamp_seconds": 1821.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=1821"
    }
  },
  {
    "text": "that Bitcoin is super volatile. And if you go too heavy on Bitcoin and that's a big part of your balance sheet that is compromising and people will say stuff like, oh, well, maybe Bitcoin will be the next micro strategy. I absolutely hope not because micro strategy is effectively a Ponzi scheme. And as soon as you stop getting new money to come in and Bitcoin goes down if it does go down far enough, the music stops and the game becomes ugly over there. So that's like a very specific strategy. I'm not saying it's stupid. I'm just saying that that's like a very specific strategy that is very risk open. Whereas right now GameStop is in a different position. And the way I think that it's trying to play cryptocurrency is likely in a completely different context than what you see from micro strategy. Now I haven't gone through Superstonk to see what the vibe is. So we'll take a quick look at that. If you guys know of any recent news or headlines that have come out any good posts, let me know. I'd love to take a look at those with you. But let's see, let's see what the deal is here. I just want to see from this last week. To the Bitcoin holders out there that are curious as to why for the first time ever a company stock dip. Let me see Bitcoin holders are getting their eyes open to the reality",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 52,
      "start_timestamp": "00:31:48",
      "start_timestamp_seconds": 1908.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=1908"
    }
  },
  {
    "text": "let's see what the deal is here. I just want to see from this last week. To the Bitcoin holders out there that are curious as to why for the first time ever a company stock dip. Let me see Bitcoin holders are getting their eyes open to the reality that when GameStop has good news that abusive short sellers use it as an opportunity to push price down. I just don't agree with this. I don't agree with this. You're unaware of how it's possible because ownership the entire stop market is decoupled from buying and selling pressure enabled by was known as an indirect holding system. That's fine. Investors don't buy ownership of public companies. They purchase what's known as security entitlement. Many public companies are legally owned by a single entity. Wall Street picks. The winners and losers. I don't agree with that. GameStop is holding the cash. They are holding to set a floor for our share price. Welcome and enjoy the show. That's parts good. A couple of things here that I just don't love about this post. The first thing is that this doesn't make sense when a company has good news that short sellers would use that as an opportunity to push price down. It doesn't make sense. It's kind of like Sun Zoo and the art of war. The same thing we talk about in the Marine Corps when we're talking about tactics. We talk about things like centers of gravity and",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 52,
      "start_timestamp": "00:33:08",
      "start_timestamp_seconds": 1988.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=1988"
    }
  },
  {
    "text": "sellers would use that as an opportunity to push price down. It doesn't make sense. It's kind of like Sun Zoo and the art of war. The same thing we talk about in the Marine Corps when we're talking about tactics. We talk about things like centers of gravity and critical vulnerabilities. Center of gravity is where somebody's super strong and this could be a force. It could be a stock whatever. Things have centers of gravity. That's where they're super strong. Critical vulnerabilities is exactly what it sounds like. That's the weakness. So if you have something that's reported the purchase of Bitcoin and that's perceived as good news, that's not a good time to try to use what they're supposing as a strong positive catalyst as a time to short. It literally doesn't make sense. It's attempting to attack a center of gravity, which would be the most disadvantaged time to try to do that. It literally doesn't make sense. Now, one of the things that I would also layer on top of this is that I actually don't know if this is correct. That for the first time ever, a stock company dipped after announcing a Bitcoin investment, I would have to look at that. And I mean, we could take a quick minute and look at it because I don't know. And I question stuff like that because it does change the context. If this actually is the case, I would feel a little curious about",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 52,
      "start_timestamp": "00:34:23",
      "start_timestamp_seconds": 2063.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=2063"
    }
  },
  {
    "text": "investment, I would have to look at that. And I mean, we could take a quick minute and look at it because I don't know. And I question stuff like that because it does change the context. If this actually is the case, I would feel a little curious about it. Although still the number of times that this happens against this individual instance, the other fact of the matter is the stock coming into this had made a rally of 25 in three days. Things that have those kind of parabolic moves often show reprieve. They often will come down. And that's as the process of natural profit taking occurs because there are people in stuff like this playing a lot of different time frames. So let's take a quick look at that. I want to, I'm actually just genuinely curious about this assertion that for the first time ever, a company stock dipped after announcing a Bitcoin purchase. So what we're going to do is ask Groc create a list of stocks that have announced purchasing of Bitcoin. Include the date they announced the purchase. Let's see how many this comes up with. And then I'm actually going to ask this also to something else. Maybe we'll do like Gemini. I just like comparing the different answers. Let's see. So Groc has GameStop, MicroStrategy, Trump Media, MetaPlanet, Cooler technology. They don't know the date. We need to do like publicly traded companies. Pick publicly traded companies from the",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 52,
      "start_timestamp": "00:35:45",
      "start_timestamp_seconds": 2145.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=2145"
    }
  },
  {
    "text": "to ask this also to something else. Maybe we'll do like Gemini. I just like comparing the different answers. Let's see. So Groc has GameStop, MicroStrategy, Trump Media, MetaPlanet, Cooler technology. They don't know the date. We need to do like publicly traded companies. Pick publicly traded companies from the US exchange. We want to be a look at price performance. GameStop, MicroStrategy, Trump Media, Cooler, Tesla. We can take a look at those real quick. GameStop. I'm looking now at Gemini to compare Tesla block. Okay, so that's another one for us to take a look at. Let's just eyeball this super fast. This is super small sample, so we don't have a lot to look at. Let's take a look at Tesla. We don't hate Feb. It's 2021. Yeah, we got to go back a ways, gang. Oh, let's do 10 years. And let's go in here. This is 8 Feb. So Tesla is another instance where in 2021 they announced the purchase of 1.5 billion of Bitcoin and it went down. Let's take a look at Square. This is in 7 oct 2020. Let's do what the fuck is the name of that charting website everybody uses. It's not popping up in here. Creating view. And we need to look at SQ. We need to look at an old chart. So S log. This is is it XYZ? I want to see if that's. Can we go back far enough? 2020 it looks like we can. So",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 52,
      "start_timestamp": "00:37:11",
      "start_timestamp_seconds": 2231.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=2231"
    }
  },
  {
    "text": "It's not popping up in here. Creating view. And we need to look at SQ. We need to look at an old chart. So S log. This is is it XYZ? I want to see if that's. Can we go back far enough? 2020 it looks like we can. So this says in October 7th of 2020. I'm assuming more. October 7th. The down day. It went up for a couple days after and then it rolled over super hard. So I would also call that down. Down on the day and then if we use like a follow on five days. Also down. Let's take a look at one more. So so far based on again and admittedly a very small sample size. Like this assertion is just wrong where it says for the first time ever companies stock dipped after announcing Bitcoin investment. And I'm not saying this to like shit on this person or poo poo on the like I don't care. Like I'm they're doing their best. But the problem with stuff like this is I find a lot of GameStop holders they've just created and not through their own faults. But through looking at the broader context of things they've created this like everybody's against us mindset. And I again feel however you want that's fine. But I think it is so important to do our absolute best to remain objective with the information. Does it look like there's abusive short sellers? Absu fucking lootly.",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 52,
      "start_timestamp": "00:39:27",
      "start_timestamp_seconds": 2367.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=2367"
    }
  },
  {
    "text": "broader context of things they've created this like everybody's against us mindset. And I again feel however you want that's fine. But I think it is so important to do our absolute best to remain objective with the information. Does it look like there's abusive short sellers? Absu fucking lootly. I we've spent a lot of time looking at this stock. I think that is apps of fucking lootly the case. But just because there are abusive short sellers. I do not think that it means that Wall Street picks the winners and that now everything is anti or against GameStop. I think that those two things can exist in parallel. So let's just take a look at one more though. I again I'm like I'm genuinely curious because I've not looked at this before like when companies announce Bitcoin. So right now we have three. So GameStop, Tesla, Block, all three three for three have gone down after announcing not just on the day but for the week following they've gone down. So like if you looked at price difference week over week. Okay, there's an only KULR. This says May 25 but it doesn't give an exact date. What's kind of useless? One did KULR announce its Bitcoin purchased. It just says May of 25 but how can it not be announced? Oh, when did KULR announce its Bitcoin purchase? I mean like there's gotta be a date on an article. It announced its Bitcoin treasury which included",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 52,
      "start_timestamp": "00:41:45",
      "start_timestamp_seconds": 2505.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=2505"
    }
  },
  {
    "text": "What's kind of useless? One did KULR announce its Bitcoin purchased. It just says May of 25 but how can it not be announced? Oh, when did KULR announce its Bitcoin purchase? I mean like there's gotta be a date on an article. It announced its Bitcoin treasury which included plans to purchase Bitcoin on four December and then it looks like the first completion went on December 26. I guess that's actually really interesting. I had to use not GROC through X but I had to use GROC specifically like browser GROC which is kind of interesting. Okay. So let's take a look. 24 D's. Huge up day. 24 D's. So this is when it announced that it was going to do it. So that's great. So we have a good data point. When did it lost my thing? When did KULR announce it bought Bitcoin? So I think it said 20... Yeah, oh, it's on four D's my bad. And then it bought it on 20-60s. So big up day on when it bought it on the day so that's one out of four instances were on the day it announced it went up big but then again that's still four out of four instances where the week after it's down. So that's kind of like a mixed bag I would say. Okay. Pistolshram says I do feel like Superstong tends to buoy up random hype posts with no basis or what you're saying everything is because it's",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 52,
      "start_timestamp": "00:43:05",
      "start_timestamp_seconds": 2585.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=2585"
    }
  },
  {
    "text": "that's still four out of four instances where the week after it's down. So that's kind of like a mixed bag I would say. Okay. Pistolshram says I do feel like Superstong tends to buoy up random hype posts with no basis or what you're saying everything is because it's game stop. The thing to be clear though is I agree with you but I understand it. I do understand it. It's easy to fall into that. It's kind of like if you've seen the rug pulled enough times you just assume it's going to be pulled. So I do get it. I really do get it. It's not though I do my best to guard against those kinds of things because it's so easy to fall into them but I understand how you arrive at them. The problem with it is that it causes people to then not be able to objectively analyze stuff which just hurts them. Your ability to objectively analyze stuff is always a good thing and that doesn't mean you throw away what you know you can still maintain the background of your experience because that's useful that's really useful information to include in a decision cycle but it's really important to be able to to cordon pieces of this off where you say to yourself like yeah I know that I have this bias. It exists for a reason. Bias isn't inherently bad. A contrary to what people today say about like judging people",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 52,
      "start_timestamp": "00:45:48",
      "start_timestamp_seconds": 2748.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=2748"
    }
  },
  {
    "text": "decision cycle but it's really important to be able to to cordon pieces of this off where you say to yourself like yeah I know that I have this bias. It exists for a reason. Bias isn't inherently bad. A contrary to what people today say about like judging people have made judging out to be like this terrible. It's not fucking bad. It's a good thing to do. Now it's not good to judge something and then not be able to decouple your judgment from an objective evaluation. That's the dangerous part but I understand how people get there. For sure. So this is one out of four instances that we see Bitcoin actually this stock go up on the Bitcoin purchase announcement and then we see it seems like four out of four instances were following that up then it doesn't sustain the up move for the following week. That's what it looks like to me. All right let's put let me get caught up on the chat real quick. Jesse says you give good info. I appreciate it. Thank you so much. random says DD is what GMU is based off of some have lost their way for sure. Well that's why we've spent so much time going through the DD library is because the DD library has taught me a lot not just about the way that people think about GameStop but the style of analysis that's completed and it's a really good attempt at general",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 52,
      "start_timestamp": "00:47:06",
      "start_timestamp_seconds": 2826.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=2826"
    }
  },
  {
    "text": "for sure. Well that's why we've spent so much time going through the DD library is because the DD library has taught me a lot not just about the way that people think about GameStop but the style of analysis that's completed and it's a really good attempt at general analysis. The problem I find and I even talked to Newton about this when he and I when he was like getting me crash course caught up on the story of Bitcoin or I'm sorry on the story of GameStop where I absolutely notice that a lot of people that are conducting the analysis on GameStop what they're doing is they're unfortunately not applying good analysis techniques. What this looks like is if I'm trying to analyze something I might have a hypothesis but when I'm going through the analysis my goal is not to try and justify my hypothesis. My goal is to conduct an analysis around the hypothesis to assess whether or not I reject it and unfortunately I find a lot of the DD that's done here is it's starting from the point of I am trying to prove this thing that I think about this thing and that's almost always going to leave to skewed results. It's a great example of this is like if I tell you wherever you're sitting right now look around you and look for every instance of black that you can see and count it count the number of times you",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 52,
      "start_timestamp": "00:48:46",
      "start_timestamp_seconds": 2926.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=2926"
    }
  },
  {
    "text": "and that's almost always going to leave to skewed results. It's a great example of this is like if I tell you wherever you're sitting right now look around you and look for every instance of black that you can see and count it count the number of times you see black as I get this hair out of my mouth there it is. And then if I ask you well how many instances of red did you see probably have no idea because you were looking for black red didn't even enter the equation whereas if I had prompted you instead of look for black and instead I say look at the different colors how many different colors do you see around you then all of a sudden you have a different answer so that's the problem with that kind of like analysis is that if you go into something looking to justify what you're trying to justify you're probably going to find stuff that supports it or skew things that you see to support it which again it's just a broken it's a broken way to apply good analysis because there's a lot of good analysis that I've come across in the community so far which like I said I want to pop up in the dd library again so that we can check out another piece. Iceman says also how does the logic in that post explain why it would only apply to GameStop? I don't think",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 52,
      "start_timestamp": "00:50:06",
      "start_timestamp_seconds": 3006.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=3006"
    }
  },
  {
    "text": "come across in the community so far which like I said I want to pop up in the dd library again so that we can check out another piece. Iceman says also how does the logic in that post explain why it would only apply to GameStop? I don't think it does and I think that's actually kind of the point I think what the post oh the logic in the post I see that well we talked about this before the logic in the post like in this it's really not great logic because they wouldn't use it as an opportunity to push price down but the idea the theory that their post well I guess the hypothesis that they're posing is that when there's a good piece of news then the short sellers use that as an opportunity to try and suppress price or to even push it lower that's the hypothesis again the the problem with that is that if you want to try to draw it. We really know what context I want to use here water is what my brain is going to so we'll find a way to use water so let's say that there are two pipes you have a pipe here and you have a pipe here these look like j's but they're not their pipes and let's say that your job is to do like a horizontal Mario meaning you know how like in the video games Mario goes down well",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 52,
      "start_timestamp": "00:51:20",
      "start_timestamp_seconds": 3080.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=3080"
    }
  },
  {
    "text": "there are two pipes you have a pipe here and you have a pipe here these look like j's but they're not their pipes and let's say that your job is to do like a horizontal Mario meaning you know how like in the video games Mario goes down well and these ones you have to go in you just have to go this way in the pipes like this if there's a pipe where the inside of this pipe has a bunch of water going this way coming out versus this pipe which has a little bit of water that's going out which one of these pipes is easier for you to walk through the answer is super obvious you don't go in the I'm just kidding the answer is super obvious it's this pipe well this theory on using good news as an opportunity to push price down is akin to trying to go through this pipe because in order for short sellers in the market if you have a stock price in order for short sellers to push price down they need to overwhelm the buying pressure if they do not overwhelm the buying pressure then they're going to get ran over and this is what leads to short squeezes when shorts attempt to push price down but then buyers step in big time because they see an opportunity and then you also have the added catalyst of knowing that there shorts on the other side of",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 52,
      "start_timestamp": "00:52:35",
      "start_timestamp_seconds": 3155.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=3155"
    }
  },
  {
    "text": "going to get ran over and this is what leads to short squeezes when shorts attempt to push price down but then buyers step in big time because they see an opportunity and then you also have the added catalyst of knowing that there shorts on the other side of this that are going to have to close if they get ran over too big to the upside so then they end up having a buy to close which fuels the move this is when you get into short squeezes gamma squeezes stuff like that so that's why the theory in this is not really sound because it's essentially pitting your movement against a center of gravity versus a critical vulnerability if you wanted to conduct this maneuver you would be so much better off trying to push price down when things are quiet there's not a lot of buyers you're you're asserting against a critical vulnerability versus a center of gravity so that it's I understand what they're trying to get at I just don't think it's correct so anyways that that was their attempt at explaining it again like props to them they're seeing something and they're trying to explain it so I give I always give credit for stuff like that the the dangerous thing here is that I think when people see this kind of stuff that aren't necessarily doing the analysis themselves and they'll say like oh yeah wow this is crazy it's only game",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 52,
      "start_timestamp": "00:54:03",
      "start_timestamp_seconds": 3243.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=3243"
    }
  },
  {
    "text": "to explain it so I give I always give credit for stuff like that the the dangerous thing here is that I think when people see this kind of stuff that aren't necessarily doing the analysis themselves and they'll say like oh yeah wow this is crazy it's only game stop that has this done and then this starts to paint this broader picture in their brain of this like backdrop that doesn't necessarily reflect reality and again that just leads to a very skewed analysis which is always just gonna hurt you the more objective you can be in your analysis the better off you're going to be it's just a useful skill to have anyways let's continue marks Cuban mark Cubans AMA age like fine wine their goal was is never to never cover their short but that would be to take the company going out of business or being the less is completely correct that won't happen here is correct best thing you can do is hold on to the stock and do business with game stop if everyone goes through website and buys for them that is going to help the company which will help the stock and help everyone here is correct if you have if you still believe the reason you bought the stock and that hasn't changed by cell it's literally that's completely correct across the board and it's because everybody knows the benefit well there's a million benefits for the short seller",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 52,
      "start_timestamp": "00:55:17",
      "start_timestamp_seconds": 3317.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=3317"
    }
  },
  {
    "text": "stock and help everyone here is correct if you have if you still believe the reason you bought the stock and that hasn't changed by cell it's literally that's completely correct across the board and it's because everybody knows the benefit well there's a million benefits for the short seller side of the equation if the company goes out of business there's a ton of benefits so that's absolutely what they would want I can open my window they reap all of those different tax benefits so this is correct and by holding on to the stock that effectively will stifle the total amount of downside pressure that can be exerted so yeah that's that's absolutely correct this we looked at already which was the fact that people were seeing that the cat was active on Reddit all this momentum good news about game stop is going to piss off the hedges they will execute an immediate ladder attack to try to get the paper hints the fold see and again like this is one of the problems right because somebody saying this other people will look at and be like oh wow that's exactly what happened and then we have a pretty a pretty broken analysis cycle so yeah let's see anything else big share trading we know cool all right so let's take a quick look at a couple other things and then we'll jump into the dd library we'll start with just like an overview of game",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 52,
      "start_timestamp": "00:56:23",
      "start_timestamp_seconds": 3383.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=3383"
    }
  },
  {
    "text": "have a pretty a pretty broken analysis cycle so yeah let's see anything else big share trading we know cool all right so let's take a quick look at a couple other things and then we'll jump into the dd library we'll start with just like an overview of game stop and see what's cracking this is good by the way the fact that game stop started seeing the put premium plummet this hard that typically means that like the move the move had been made and people that were trying to play via the long put side of the equation which you can see coming in here are coming out of their trades which is actually good because again that means that the the anticipated move had occurred which would lead me to believe that the overall downside pressure might be abating that's what I see there let's take a look at the chain first here so it looks like net build yeah it looks like net build and I mean the oh I is still super long call heavy right like look across all the strikes now the chart below which is not super shocking is a lot of this is pretty near term so 30 may obviously which is past six June this number will go up as people move from here to here and then from here to here 20 June the next primary expiration is super dense in terms of oh I more so actually",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 52,
      "start_timestamp": "00:57:56",
      "start_timestamp_seconds": 3476.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=3476"
    }
  },
  {
    "text": "of this is pretty near term so 30 may obviously which is past six June this number will go up as people move from here to here and then from here to here 20 June the next primary expiration is super dense in terms of oh I more so actually than typical and 369,000 calls against 64 put so it's actually very heavy on the call side and the other slightly anomalous thing here is the fact that typically it's the front expiration that's super hot and then the primary expiration normally has something going on but not as heavy as the front expiration so this is actually distinct and let's take a look at premiums heavy call side until here wow that's a that's that big block though that we've seen a lot of those are those in the monies which are still likely synthetic longs I think let's take a look at what kind of flow we've seen over the last couple weeks clear those out then I'm gonna get rid of the mids as well so that we can just see decisive pretty light premiums though but it looks like 21 this is kind of interesting because these happen first I can't tell if some of these were sold like some of these were sold or if this is oh not it's a different expiration that's just a complete different position pretty light from a premium perspective oh GM duh I was like what the fuck thank",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 52,
      "start_timestamp": "00:59:44",
      "start_timestamp_seconds": 3584.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=3584"
    }
  },
  {
    "text": "these happen first I can't tell if some of these were sold like some of these were sold or if this is oh not it's a different expiration that's just a complete different position pretty light from a premium perspective oh GM duh I was like what the fuck thank you shout out the pistol shrimp there we go this makes way more sense I was like what the fuck like this is like insanely light yeah this is this is better so most of the large build ah take a look at these I like these the reason why I like these is because this shows a much longer term view and this is interesting because it looks like some of this take a look this is some of the unwind this is cool so what you see here is a pretty big build out on the 20th of May right so this is 1.9 mill in premium total but then you can take a look at the cell side here and the cell side actually has a decent amount of premium it's we would have to actually take a look at the the flow itself to see what happened but this actually had a decent amount of cell side so that's people that are clearing out some of the gains from the purchase like three days prior which is actually super cool you can kind of clearly cleanly attach those so a lot of these bigger trades are",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 52,
      "start_timestamp": "01:01:48",
      "start_timestamp_seconds": 3708.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=3708"
    }
  },
  {
    "text": "happened but this actually had a decent amount of cell side so that's people that are clearing out some of the gains from the purchase like three days prior which is actually super cool you can kind of clearly cleanly attach those so a lot of these bigger trades are further out in time right so you see 26 here you see 27 here these are the primary explorations out in 20 June here so they're they're not necessarily playing the front super hard most of this is a little further out which again I always argue that's healthier for the stock in general all right let's take a quick look at the dd library here I have no idea where we left off but that's a lie I have an idea I just don't feel like we've looked at this I think I remember the Oberos I actually have that this is what's tattooed on my arm is a different version of the Oberos yeah we definitely did this one I thought I remember doing this one but I don't remember doing these let's take a look what do I remember paper inflation look at the Venetian banks that's cool shit this just looks kind of interesting this is look at this one feel like I remember it but I'm down to I'm done to look again so this is just talking about different monetary policy what's the oh I forgot this is talking about the idea of hyperinflation",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 52,
      "start_timestamp": "01:03:22",
      "start_timestamp_seconds": 3802.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=3802"
    }
  },
  {
    "text": "cool shit this just looks kind of interesting this is look at this one feel like I remember it but I'm down to I'm done to look again so this is just talking about different monetary policy what's the oh I forgot this is talking about the idea of hyperinflation which is kind of funny because it's almost the opposite of what's happening right now I just want to see like what their broad idea was the debt crisis will return but this time financial system government the entire economy needs a bailout central banks are going to do it the idea that anyone can borrow forever that's a tough one possible objects cannot exist forever history shows deadly consequences for the nations that venture down either path the United States this is no exception I agree with this so like excessive and this is actually why right now with the current administration again regardless of what you think of the administration writ large but it's why you see debt as such a high high ticket discussion item so I I agree with the concepts here but I think what goes into what goes into hyperinflation is a little more specific than a lot from there because there's a lot of tools that can be employed to manage stuff so oh I remember this one this one is for oh are these from PB is this one from PB as well oh okay this makes more sense look I haven't",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 52,
      "start_timestamp": "01:05:09",
      "start_timestamp_seconds": 3909.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=3909"
    }
  },
  {
    "text": "specific than a lot from there because there's a lot of tools that can be employed to manage stuff so oh I remember this one this one is for oh are these from PB is this one from PB as well oh okay this makes more sense look I haven't talked to him in a while how is he he and I we were doing podcasts to a little for a little while I have to hit him up hey yo what up dog I haven't hit him up in a while let's see what he says here when were these done 2021 so the thing with I mean we haven't seen it right okay okay we know this we know this so just the former attachment of the dollar to the gold standard okay okay for those that don't know by the way you can go to Fred and you can create your own dashboards for stuff like this is actually very very cool um I use it semi regularly because it's a great way to get a general pulse of how the economy and how the market is doing I'll show you here so it's completely free Fred is free but you can literally build your own dashboards to take a look at different things you can overlay different metrics on top of one another that you're interested in so money supply debt like all this kind of stuff which is kind of cool like I said I",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 52,
      "start_timestamp": "01:06:57",
      "start_timestamp_seconds": 4017.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=4017"
    }
  },
  {
    "text": "is free but you can literally build your own dashboards to take a look at different things you can overlay different metrics on top of one another that you're interested in so money supply debt like all this kind of stuff which is kind of cool like I said I I think it's super useful especially like the personal finance stuff I used to be able to keep these all five together but you'll actually notice how these have become like almost not readable which is hilarious the reason for that is because of the skew caused by these so I literally actually have to break these out at some point I'll actually keep it up so I did after the stream but yeah pretty pretty nuts so anyways back to this okay I'm getting so a lot of this is talking about the relationship of a central baking entity and the motivations for different currency changes and then the subsequent impacts to other market components based on those supply and demand changes all right let's see if the US loses world reserve currency status two things happen foreign central banks start dumping their huge treasury dollar debt positions I think that that's correct I definitely think that's correct the I think the premise that would go into that happening those very very specific and also difficult difficult to get at in my opinion swift number of banks who hold dollar for cross-boughter payments decide to dump yep then rambling",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 52,
      "start_timestamp": "01:09:08",
      "start_timestamp_seconds": 4148.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=4148"
    }
  },
  {
    "text": "think that that's correct I definitely think that's correct the I think the premise that would go into that happening those very very specific and also difficult difficult to get at in my opinion swift number of banks who hold dollar for cross-boughter payments decide to dump yep then rambling massive the problem is is like there's no other viable alternative right now still for the world reserve reserve currency status and it's why so much of this is still done in dollars so I think one of the gaps in this is the assumption that like there's a really suitable alternative and I think it also underestimates how central the US is to the global business cycle still both from a consumption and supplying perspective but interesting piece cool let's do one more this one why sideways oh shit this is a large one okay why are we trading sideways borrow rates so low moon theory of everything see these are the kind of fun parts of the dd library to be honest when people start like attaching a lot of these other theories right like in pb's piece he's showing he's teaching history about other reserve banks currency uses money supply this dude here is talking about the range points which is really fascinating by the way so it's like I love that you get to learn and talk about a bunch of other things in addition to the underlying itself but let's see price stabilization why is",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 52,
      "start_timestamp": "01:10:52",
      "start_timestamp_seconds": 4252.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=4252"
    }
  },
  {
    "text": "uses money supply this dude here is talking about the range points which is really fascinating by the way so it's like I love that you get to learn and talk about a bunch of other things in addition to the underlying itself but let's see price stabilization why is the bar rate so low why is the SEC sitting by why is there no volume why have an institution spot like mad well why why would they especially at the point of this in 2021 the company was in a really dangerous spot man so I actually don't I don't see what the theory is on why institutions would be like super interested to gain long exposure at this point like really really speculative and I'm sure you know some did but that's a tough argument to make I think one okay when moon here we go put into effect so this is talking about ah back to cycle theories won't sit at Dell and Jimmy shorts keep kicking the can they won't be able to because they're not stabilized in the price they're talking about I don't understand this price stabilization thing once the DCOCC members are protected volume explodes bar rates go up margin calls will trigger the squeezes on okay everyone knows the game stop shorts are going to default it's what's really interesting is looking at how this has progressed from 2021 to 2025 on a lot of these this is super interesting so buy",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 52,
      "start_timestamp": "01:12:46",
      "start_timestamp_seconds": 4366.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=4366"
    }
  },
  {
    "text": "volume explodes bar rates go up margin calls will trigger the squeezes on okay everyone knows the game stop shorts are going to default it's what's really interesting is looking at how this has progressed from 2021 to 2025 on a lot of these this is super interesting so buy and hold okay do you believe in 10,000 1,000 a share not of the realm of possibility but we move that medical outlier I agree with this yep I think this is this is a really great way to phrase it by the way there's a non-zero chance which I think is correct but it's very very small yeah it's completely fair you I just want to see the conclusion hold okay getting close to another really big price move may not be the squeeze so this is kind of like the same just kind of projecting future price performance built on system common law every party positioning so interesting one of the interesting things is the broader assumption on the the short behavior I actually think from a game theory lens I think the apes unfortunately I think the apes unfortunately vastly underestimate the other side and I think that's one of the reasons why a lot of this stuff doesn't play out as expected because the other side of this from like the short lens whether we think they're still there whether they closed up shop and left like whatever that is I think they're smart they're really",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 52,
      "start_timestamp": "01:14:31",
      "start_timestamp_seconds": 4471.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=4471"
    }
  },
  {
    "text": "that's one of the reasons why a lot of this stuff doesn't play out as expected because the other side of this from like the short lens whether we think they're still there whether they closed up shop and left like whatever that is I think they're smart they're really smart so we in these dds often I think too to conservatively discount the other side and like what their motivations are and what they might be doing hot nitrogen says have you tried copying pacing these asking Gbt to summarize the longer ones definitely the other thing that we used to do is piece them out and the other thing that I do is I've actually I have most of the like the the big dd for example that one I put into google drive where I have jemeni and I've used that to summarize it so definitely I just kind of flip through them because at this point most of the stuff in here is kind of like different versions of stuff we've tend to have seen at some point not you know perfectly but in some context typically and then from the conclusion I can see if there's something that like jumps out at me but I'm normally just kind of skimming through them because I like to look at them and see if anything catches my eyes so interesting okay so that leaves us off then at the sideways piece the other stock that I promised",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 52,
      "start_timestamp": "01:16:38",
      "start_timestamp_seconds": 4598.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=4598"
    }
  },
  {
    "text": "there's something that like jumps out at me but I'm normally just kind of skimming through them because I like to look at them and see if anything catches my eyes so interesting okay so that leaves us off then at the sideways piece the other stock that I promised to look at today was unity so I'm gonna do that now quickly let's take a look at you let's think look at you that's kind of funny so what's crack in here really big see this is interesting this kind of massive call premium buying and then you can see oh that's so interesting because it's kind of like layered but this is really really short term turnaround and then still really really big call premium on the 30th so these days have gotten very wide compared to prior days so whenever you see these kinds of big changes whether it's up down in terms of premium it doesn't matter the fact that there's this big of a dispersion is interesting always because something's going on that's the only time that you see premium start to get that far out of whack so we can take a look at the chain quickly and see so it's mostly long calls well not necessarily long calls I can't say that it's mostly calls assumption to be long calls but mostly calls and mostly calls that are what is unity trading at right now or not we don't get to take a",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 52,
      "start_timestamp": "01:18:01",
      "start_timestamp_seconds": 4681.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=4681"
    }
  },
  {
    "text": "the chain quickly and see so it's mostly long calls well not necessarily long calls I can't say that it's mostly calls assumption to be long calls but mostly calls and mostly calls that are what is unity trading at right now or not we don't get to take a look at that I suppose I said being so annoying 26 so these are out of the money so I would have to believe most of these are long calls we'll be able to tell them a little bit and a lot of it is this is a pretty big pocket for this upcoming expiration which tends to mean that somebody is expecting something especially if we can see when those were built up which we'll find out in a moment overwhelming call premium relative in general and it really did spike in here and you can see this is the largest spike I think that we've seen which does look somewhat telling because a lot of that happened to be in that near term expiration um I want to see none of this not this either I think it might be this oh finally this is what you know literally just want to see oh this is the total this is it the total flow from Friday I mean that's a profound build out 23 mil but that's much longer term and then the 20th still has a significant build out so what this tells me is that it",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 52,
      "start_timestamp": "01:19:21",
      "start_timestamp_seconds": 4761.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=4761"
    }
  },
  {
    "text": "literally just want to see oh this is the total this is it the total flow from Friday I mean that's a profound build out 23 mil but that's much longer term and then the 20th still has a significant build out so what this tells me is that it does look like somebody's expecting something here we can take a look at the options flow itself to see how that came in specifically for the for the 20th expiration get rid of this and we got to get rid of what else is is it keep dealing that and let's get rid of them mad I need to like this and then let's take a look at this over the last two weeks what I want to know is if those calls were being built out consecutively and this is for the call side 30th so this is like super heavy on the 30th here we go yeah so like this is the stuff that I want to see take a look at this so the 30s out in 2026 got pinged three times for several million dollars on the 28th and then they got pinged again on the 30th that's an informed position going on that's being scaled into without a doubt without a doubt so that kind of stuff is super super informative and what I just did is I actually added the puts back into the equation just for me to eyeball what kind of put",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 52,
      "start_timestamp": "01:21:45",
      "start_timestamp_seconds": 4905.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=4905"
    }
  },
  {
    "text": "30th that's an informed position going on that's being scaled into without a doubt without a doubt so that kind of stuff is super super informative and what I just did is I actually added the puts back into the equation just for me to eyeball what kind of put premium was ran and it's just not much I mean it doesn't even register on this scale let me get rid of the calls for a second yeah all the put stuff is super small 80k is the biggest so that's like a really significant skew I would say to the call side but a lot of it's further out in time so that can be really interesting for like a ratio called diagonal or something like that I don't know why the platform is not working it's actually kind of annoying but if we take a look at the actual options chain and for those that are still hanging out if there's anything that you want to take a look at or if there's any questions that you have now is the perfect time because I'm going to wrap up in a little bit but before that I do want to take a look at this expiration cycle I just want to see what these guys are trading and there's my delta one delta so one of the things to pay attention to here is notice how the 31 strike is at a 51 delta whereas typically 50 delta",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 52,
      "start_timestamp": "01:23:56",
      "start_timestamp_seconds": 5036.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=5036"
    }
  },
  {
    "text": "want to take a look at this expiration cycle I just want to see what these guys are trading and there's my delta one delta so one of the things to pay attention to here is notice how the 31 strike is at a 51 delta whereas typically 50 delta is the at the money and what you're seeing here is a pretty strong bullish skew in volatility that's why the 50 delta which is typically at the money is so far up here so that tends to be again upside expectation and it's already being priced in I mean these are still like super cheap so this could be easily something like a ratio called diagonal let's take a quick look at the actual chart we need to default this good day I think this is funny I'm trying to get it to stop default into all these other fucking time frame I mean the chart doesn't look great I don't like I don't really like like it pretty much needs to get above this near term this near term overhead and it's like super sideways but the options market is pretty fucking smart man so the fact that it's seeing that kind of volume the way I would play stuff like this would be really really conservatively super light but I would speculate in it because when you see that kind of large volume and premium sizing in the options chain a lot of times that it's informed",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 52,
      "start_timestamp": "01:25:24",
      "start_timestamp_seconds": 5124.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=5124"
    }
  },
  {
    "text": "it's seeing that kind of volume the way I would play stuff like this would be really really conservatively super light but I would speculate in it because when you see that kind of large volume and premium sizing in the options chain a lot of times that it's informed trading I had a couple trades like that the last week that I was talking about in the in the discord and it's one of those things were like I can put my biases aside and say well like typically I don't like this chart for this that the other reason I mean it's starting to look healthier but I still absolutely would not call this healthy so seeing it move this way is part of the equation but the fact that there's that significant of options premium flowing in I think is important at least give it some credit I mean it looks super weak right like super super sideways Scott says how to time covered call sales into gme volume I wouldn't actually try to time covered call sales in game stop based on the volume like I actually wouldn't really do that the way that I would think about it is in it I do this with the covered strangle that I'm trading right now I don't have shares of game stop I'm all in the short puts because of the ball but the first threshold is I would want to target something above my short strike",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 52,
      "start_timestamp": "01:27:54",
      "start_timestamp_seconds": 5274.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=5274"
    }
  },
  {
    "text": "think about it is in it I do this with the covered strangle that I'm trading right now I don't have shares of game stop I'm all in the short puts because of the ball but the first threshold is I would want to target something above my short strike or I'm sorry my basis so that the short strike is above my basis and with how range bound and choppy game stop has been literally I mean we could take a look at the the time frame we're looking at here is what going back to January right so essentially a six month chart and it's just been oscillating sideways like this so anytime that I would get stuck with the short calls would be stuff that I would adjust by rolling and keeping the the equity exposure if I wanted whereas right now I don't want to hold the equity outright I'm preferring to trade the option side of it because the volatility in it continues to remain so high do they have like IV because that would be cool to show you guys doesn't look like it do they have realized ball if historical ball yeah there we go these need to be scooshed though so because of that like you can actually see we're even going through a transitory phase with respect to ball like ball had been clustering pretty low in here but then you can see it starting to jack up all the way",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 52,
      "start_timestamp": "01:29:20",
      "start_timestamp_seconds": 5360.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=5360"
    }
  },
  {
    "text": "we go these need to be scooshed though so because of that like you can actually see we're even going through a transitory phase with respect to ball like ball had been clustering pretty low in here but then you can see it starting to jack up all the way back here again you can start to see these moves before like the massive moves start to to happen so during these kinds of periods where it looks like ball is starting to build is when I wouldn't look to sell necessarily I would be more interested in trying to sell as this starts to normalize which can be easier said than done but I wouldn't necessarily want to get you know the short short ball out when it's going through a transitory phase where it looks like ball is climbing that that's typically a bad time to do it next says would you mind giving your analysis on AMC I feel like it's about to make a pretty solid move next few weeks just like game stop yeah let's take a quick look at AMC so kind of the same story training sideways definitely saw pop on the 27th this is like a sympathetic move with game stop let's take a look at the options so mostly call side huge expectation here on 20 June huge expectation on 20 June we'll size that out in terms of actual money and let's take a look at the build out still",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 52,
      "start_timestamp": "01:30:50",
      "start_timestamp_seconds": 5450.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=5450"
    }
  },
  {
    "text": "this is like a sympathetic move with game stop let's take a look at the options so mostly call side huge expectation here on 20 June huge expectation on 20 June we'll size that out in terms of actual money and let's take a look at the build out still generally positive build out although some of it's smaller which is going to be expected in terms of total li let's take a look at li first yeah okay and now let's take a look at premium let's go to the 20th 374 and 76 so heavy but not like crazy now let's take a look at any of that build out in that cycle itself though and this will look over the last two weeks I'm going to focus on the call side first and let's focus on that actual cycle I want to see if there's anything that's getting hit a few times these this is kind of like the best bet the threes but still not really that big that big of a position so it looks like the options market is pricing upside but again it's like I wish I could see the volatility surface in here I don't know why this thing is so but I can't look at anything in there I want to look at the vault surface we can kill 60 day vault for now and let's do 20 June so slightly elevated on the put side yeah slightly elevated on the",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 52,
      "start_timestamp": "01:31:57",
      "start_timestamp_seconds": 5517.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=5517"
    }
  },
  {
    "text": "here I don't know why this thing is so but I can't look at anything in there I want to look at the vault surface we can kill 60 day vault for now and let's do 20 June so slightly elevated on the put side yeah slightly elevated on the put side which no I'm sorry on the call side not on the put side I was going to say that that would be the inverse of what I would expect those threes are slightly edge call side and then we see moderate call side out to like the 15s and then it widens out a little bit and definitely higher severity to the upside so I mean it looks like AMC also has a bit of bullish till going on from the options market across the board I would offer but the sizing isn't as stark right the fact that this is across so many different explorations at these levels versus being concentrated in a single expiration with these premiums it leaves me to believe it's just a general bias it's not necessarily like the 20th op-ax clearly will have the most but the fact that it's so evenly distributed is interesting because it's just like a persistent an expectation that's why I would look at it a shrinkage is I have 20 bull putt spreads that expires six six the 3028s I don't think there's anything wrong with it I don't I don't really like those specifically like",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 52,
      "start_timestamp": "01:34:13",
      "start_timestamp_seconds": 5653.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=5653"
    }
  },
  {
    "text": "distributed is interesting because it's just like a persistent an expectation that's why I would look at it a shrinkage is I have 20 bull putt spreads that expires six six the 3028s I don't think there's anything wrong with it I don't I don't really like those specifically like verticals if I can avoid it but and in what because that's obviously not in I assume you mean GameStop maybe so assume you don't mean AMC same sees way cheaper than that maybe GameStop for shrinkage that would be my guess yeah GameStop okay and you're out in six six I think it's fine I think the 30s like really aggressive on the putt deltas and the good part is this is one of those rare instances where vol on the putt side is actually relatively cheap until you get super far out more often than not when you would sell the 30s you would get a slightly lower vol and then when you would buy the 28s you would be buying higher vol on that which you wouldn't want but in this case it's the inverse so like you're getting good vol I don't know what the prices were that you got filled at for two dollars wide let me take a look so if you let me know what you got filled at I'll be able to give you a couple other data points I'm just running this through one of my calculators really fast what's the",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 52,
      "start_timestamp": "01:36:40",
      "start_timestamp_seconds": 5800.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=5800"
    }
  },
  {
    "text": "were that you got filled at for two dollars wide let me take a look so if you let me know what you got filled at I'll be able to give you a couple other data points I'm just running this through one of my calculators really fast what's the underlying IV let's just do it for the cycle fix I just want to check out for the actual expiration cycle so for the six this here 63.7 63 points so days to expiration those are super soon six days and you're at the 30 and 28s let me see what did you put in your premium you didn't that's okay I can tell you what the neutral premium needed to be what's the probability on those go back to the chain this is faster for me to do one thicker swim but you can do it you're okay on the 30s does this calculate probability not that's kind of it yeah it's frustrating I can use deltas and approximation I just prefer not to I prefer to use ND2 51 it's like 49 so you needed to collect yeah you wanted we need to get rid of this the two points 12 over yeah so especially with the volume you needed to get a little bit over midpoint on those so in I doubt you would have gotten that what's the last 119 but yeah definitely not you'd be slightly under a midpoint so you have to be directionally",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 52,
      "start_timestamp": "01:38:34",
      "start_timestamp_seconds": 5914.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=5914"
    }
  },
  {
    "text": "two points 12 over yeah so especially with the volume you needed to get a little bit over midpoint on those so in I doubt you would have gotten that what's the last 119 but yeah definitely not you'd be slightly under a midpoint so you have to be directionally correct that's essentially like you didn't get any sort of favor done with the spread but if it goes up obviously you'd be okay but this overall wouldn't be my wouldn't be my way to go about it good for bringing it up though hopefully it works out for you you got my vote all right gang wraps me up be an outlier jell-ed",
    "metadata": {
      "video_id": "LnDi4DMTx-s",
      "title": "GameStop, Unity, & PLTR Stock Analysis | Meme Stock Watch Ep42",
      "url": "https://www.youtube.com/watch?v=LnDi4DMTx-s",
      "upload_date": "",
      "duration": 6155.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 52,
      "start_timestamp": "01:41:19",
      "start_timestamp_seconds": 6079.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LnDi4DMTx-s&t=6079"
    }
  }
]