[
  {
    "text": "What's up Matt welcome back. Thanks for thanks for having me Eric. Yeah beautiful. So I had to do a quick intro because we're just talking about Freddie Krueger because you're wearing the blue version of his sweatshirt. But you were saying you don't really watch horror movies. I need at least the audience members to vouch for me here and make sure that they at least can validate my perception. But we were just talking about we don't actually know how he. What is thing is because I always thought it's like he kills people in their sleep. I don't really know how that works though. I didn't see the movies, but all I know is I'm happy to keep you on your toes. You know, I have to make sure that you're not, you know, as a former marine, I got to be able to also guard my six. I tell you what man, like I've never done the little zin nicotine pouches, but I'm thinking about it so that there's zero percent chance that I even like blink too long to creep my dreams and murder me. But you know, it's always good to see you, man. Welcome back on. Thanks. Thanks for having me. It's always always fun to chat. That's for sure. Yeah. Yeah. I bet that is the case because I feel like you are a really great example of kind of like the professional. And I am the example of a fucking degenerate.",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=0"
    }
  },
  {
    "text": "Welcome back on. Thanks. Thanks for having me. It's always always fun to chat. That's for sure. Yeah. Yeah. I bet that is the case because I feel like you are a really great example of kind of like the professional. And I am the example of a fucking degenerate. So it is always good to get those two at least in the same proximity as one another. But talk to me a little bit about your 2023. We haven't talked for a minute and I founds last year, last year was fascinating for me in a lot of different ways, but this ain't about me. I'm curious what it looked like for you. So for me, it was an interesting year. So I'm an active guy, but I try and build up positions. So I'm looking for those trends 2023. If you look outside of QQQ, there weren't a lot of trends, but I was fairly, I was fairly active. And I think my timing was pretty good. I mean, I was very aggressive coming into 23 year end. There was, there was, it's funny. Like there's every part of your system. There's any kind of weak point the market will, you know, bring it out. And for me, one thing is I would have had a very good year, but there was two earnings reports I was heavily invested in was Shopify and going into February of last year, which like, gap down and fell 25 30 in",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 77,
      "start_timestamp": "00:01:39",
      "start_timestamp_seconds": 99.74025974025975,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=99"
    }
  },
  {
    "text": "market will, you know, bring it out. And for me, one thing is I would have had a very good year, but there was two earnings reports I was heavily invested in was Shopify and going into February of last year, which like, gap down and fell 25 30 in SMCI, which frustratingly is now the hottest stock in the market, which I had a monster position going into earnings last August, which like really tagged me out of that. And so as, I mean, the good thing is if you can kind of learn from it, then I put together different hedging strategies to help me survive those these massive earnings reports. So that kind of like, instead of it being a phenomenal 2023 was like a mediocre 2023, but that is so frustrating on SMCI. I was just looking at it today and I had a ratio called diagonal in it. And this is one of the few instances where I trade a larger account. So I'm not like typically super concerned about utilization. But I was like, well, it's like a 600 stock. Like I'm actually kind of happy to be using options for leverage here, because if you want to scoop up a few like a few hundred shares, you're like starting to get into decent sizing for just just equity out right. But what, what was the thesis in SMCI? And then was it just the earnings that got you taken out? Because that actually",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 77,
      "start_timestamp": "00:03:19",
      "start_timestamp_seconds": 199.4805194805195,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=199"
    }
  },
  {
    "text": "if you want to scoop up a few like a few hundred shares, you're like starting to get into decent sizing for just just equity out right. But what, what was the thesis in SMCI? And then was it just the earnings that got you taken out? Because that actually is the frustrating. This is a frustrating thing, right? So like the whole thesis I built out is what's playing out. And it's like, now you see this talk more than double than you hear the same stuff being echoed back to you. Like, yeah, but so really, I mean, basically the issue is earnings reports. The reactions have become pretty insane. I mean, even medited, I mean, meta's a massive one of the world's largest companies up 20 on earnings. Like the moves have become so surreal. I mean, I like, when I started off trading, I mean, earnings were always something, but they weren't a big deal single digit moves percentage wise. Now these 20, 30. So I mean, I had a good cost basis going to last earnings. I think my cost was like 240 something earnings. The stock was maybe 340 pre earnings and they like knocked that thing down back to 230. And I had size in there. Like I was like a big part of my portfolio. So you know, you had on out risk management, trying to, you know, take a few dollars out of it at the least. It's such a sizable",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 77,
      "start_timestamp": "00:04:59",
      "start_timestamp_seconds": 299.2207792207792,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=299"
    }
  },
  {
    "text": "knocked that thing down back to 230. And I had size in there. Like I was like a big part of my portfolio. So you know, you had on out risk management, trying to, you know, take a few dollars out of it at the least. It's such a sizable reversal. And now a few months later, it's just rocking and rolling. But it's, I mean, that's the game, right? You're always constantly learning. So what was the exit decision? Was it like right after earnings and you were like, okay, yeah. So when that broke badly, so that broke down. So like two, so like same day, it was massive drop getting almost like a cost basis. So I mean, like I have like a, I think every trader has a rule where if you're making really good money on a stock, the last thing you want to do is end up with a loss on it. So as a kind of approached, like a break, even I was out of it. I mean, and look, I mean, by, what was that October? This was even lowered out to 226. So I mean, a certain point you have to call it a day. And now from here, we just kind of went vertical. So I mean, that's the market, right? It's always going to keep you on your toes. Isn't that something where like the move from where my mouse is now to here is from to 60 to",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 77,
      "start_timestamp": "00:06:38",
      "start_timestamp_seconds": 398.961038961039,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=398"
    }
  },
  {
    "text": "call it a day. And now from here, we just kind of went vertical. So I mean, that's the market, right? It's always going to keep you on your toes. Isn't that something where like the move from where my mouse is now to here is from to 60 to 220, but it looks like nothing because of the movement. It's not a log chart. So just that move there, it's 40 points or whatever, it looks like nothing. But to your point, that is a meaningful move, especially with where your basis was. And you know, like you're talking about at the size that you were, were you looking at a reentry in this or not? I was. And I, you know, touched it a couple of times, but I mean, this has had a lot of volatility to it. I mean, the sides of the range of the bars were sizable. There were a lot of kind of fake type moves that never really went anywhere. And really, I mean, it started, it was lagging the market too. I mean, coming out of October, a lot of stocks were moving a lot hotter than SMCI. So I mean, that's the market, right? It'll pivot sometimes. But you know, I always try and like, I think to be a trader professionally, you have to be an optimist. Even if you, you know, how those most guys will become cynical when they trade long enough, I think though, if you",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 77,
      "start_timestamp": "00:08:18",
      "start_timestamp_seconds": 498.70129870129864,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=498"
    }
  },
  {
    "text": "that's the market, right? It'll pivot sometimes. But you know, I always try and like, I think to be a trader professionally, you have to be an optimist. Even if you, you know, how those most guys will become cynical when they trade long enough, I think though, if you want to keep it going, you have to always have that spin of like, okay, like, let me at least take away some kind of lesson from this. So since then, I've been putting in different types of hedging strategies around earnings to kind of not go through that same experience again. I mean, even, even though the novice will say, well, at least, hey, you didn't lose money on the deal. But that doesn't factor in the emotional drain of having, you know, a big position. I think it was like a 40, 50 account position being up nicely from, you know, 240 to 350, then suddenly five minutes later, be back at cost. It's like, oh, that's it's frustrating. So, you know, that's, well, and you also bring up a funny point about the novice traders. Because one of the, I was, I just did a video not too long ago. It's not out yet, but it talks about some of these different, like, I call the outlier mindset, right? We're on the outlier podcast. Well, one of the big things I try to talk to people about is like changing your perspective. Because like you said, a",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 77,
      "start_timestamp": "00:09:58",
      "start_timestamp_seconds": 598.4415584415584,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=598"
    }
  },
  {
    "text": "too long ago. It's not out yet, but it talks about some of these different, like, I call the outlier mindset, right? We're on the outlier podcast. Well, one of the big things I try to talk to people about is like changing your perspective. Because like you said, a lot of beginners, they would look at it as, oh, you didn't lose money. Well, that's not what pays the bills. Not losing money is not what makes money. Like you need to make money trading. So I totally, totally understand the way you were looking at that. Because it's, yeah, that's a no, you still made some money, but just an annoying move to go through. No. Another like question I had and wanted to get your perspective on specifically with this. I mean, this seems for like a 300 stock to double over the course of what is this actually? It's like, we can have two weeks. Yeah. Yeah. Like what benchmarks do you have for that? So I know that you look at big moves and that's a big part of your system, but like, how, how anomalous is this kind of move? At least based on your broader perspective. Well, you know, that's the thing, you know, the amazing thing about stocks is the stock that's probably already showed you some kind of extreme strength that's likely to show it to you again in the future. So again, that's another kind of, you know, that fallacy.",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 77,
      "start_timestamp": "00:11:38",
      "start_timestamp_seconds": 698.1818181818182,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=698"
    }
  },
  {
    "text": "your broader perspective. Well, you know, that's the thing, you know, the amazing thing about stocks is the stock that's probably already showed you some kind of extreme strength that's likely to show it to you again in the future. So again, that's another kind of, you know, that fallacy. People look for the stocks that are really beat down to, you know, to, and obviously, you look at retro spec, you can look at stocks that took big losses and then we'll come back and say, oh, big percentage gain, but it's a probability thing. If you really want to find a stock that's going to have a big move, it's probably already had a big leg somewhere before. So it's not surprising to see that kind of a move because, you know, to cause that first move, especially if it's a stock of a decent market cap, they have to be on to some kind of new trend, some kind of major improvement and that usually it comes from a technology stock, unless it's something that has some kind of a supply shock like in the commodity market. So I'm not surprised to see it kind of catch up because really what happened here was this was somewhat of a sleepy business, which was, you know, servers and racks where, you know, it's being transformed. There's massive new cat-backs coming in and management, different management, different styles. They're the kind of management where they really kind of under-promise",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 77,
      "start_timestamp": "00:13:17",
      "start_timestamp_seconds": 797.922077922078,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=797"
    }
  },
  {
    "text": "up because really what happened here was this was somewhat of a sleepy business, which was, you know, servers and racks where, you know, it's being transformed. There's massive new cat-backs coming in and management, different management, different styles. They're the kind of management where they really kind of under-promise and over-deliver. Sometimes they over-do that under-promise and over-deliver and they scare markets like what they did on that call last summer. And then when they find the deliverer like they did now, you get this massive move. So, you know, it's a matter of, I think a lot of times, management trying to manage expectations and I think algos play a big part. Moves are far more extreme than they used to be, even in the short term. Like I always call like algos gone wild, you know, there's some really dramatic moves sometimes and that's where you see these things. So, I'm not surprised to see the move happen. Wish I would have caught it the second time around, but that's what it is, yeah. That's interesting. Yeah, because I mean to your point and I know a lot of the stuff that you look at will show big moves like this, the part that really just blew me away is something that goes from 300 bucks, the 600 bucks in two weeks. That just seems wild to me on such a big company because I know a big part of the canceling methodology typically is looking for",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 77,
      "start_timestamp": "00:14:57",
      "start_timestamp_seconds": 897.6623376623377,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=897"
    }
  },
  {
    "text": "big moves like this, the part that really just blew me away is something that goes from 300 bucks, the 600 bucks in two weeks. That just seems wild to me on such a big company because I know a big part of the canceling methodology typically is looking for smaller companies that more prone to have big legs. But what do you think of something like this that's now up, you know, just near nosebleed levels, right? Like typically you want to look for strength, you're seeing strength, but now it presumably, this would be a higher risk entry by a long shot. Yeah. So, how do you view stuff like this? Yeah, you know, it's like you need to manage so many things at once. I think that's where people have a hard time because like what we do, like even yourself, Eric, like you know, some people say like you benchmark against the NASDAQ or the Russell or ARC or you know what, when you're actively managing like that, you're not always fully invested. There's you're really kind of running a business. It's not really something you're benchmarking. You're not just having this constant portfolio. So, you know, it really comes out the probability. It's not easy to find stocks that are going to have this kind of move. So, I mean, you're going to have a lot of failure in your attempts to try and find this kind of move or not just failure or like,",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 77,
      "start_timestamp": "00:16:37",
      "start_timestamp_seconds": 997.4025974025973,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=997"
    }
  },
  {
    "text": "know, it really comes out the probability. It's not easy to find stocks that are going to have this kind of move. So, I mean, you're going to have a lot of failure in your attempts to try and find this kind of move or not just failure or like, you know, smaller returns. Stocks that have a good return but are not the outstanding ones. And so, you know, if you're taking these different shots, like you always have to have that risk management in mind because I mean, you don't have unlimited capital. And if you want a meaningful impact on your portfolio, if you want size, you need to control that risk. I mean, so, you know, if you think a stock has a chance of doubling, but there's, you know, a 10 chance at that happening, that's your expected return. So, you know, you have to factor in what kind of risk am I going to take on and appear the risk reward is not great anymore. So, a lot of times, it's kind of you have to walk that fine line between which stocks have all the upside potential. But then that restraint for, I need to at least find a place where I'm going to be adequately rewarded for the risk I'm taking on. So, you have to have those two balancing forces all the time kind of going within your mind. It's, and the reason I ask you that specifically, because it's something",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 77,
      "start_timestamp": "00:18:17",
      "start_timestamp_seconds": 1097.142857142857,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=1097"
    }
  },
  {
    "text": "need to at least find a place where I'm going to be adequately rewarded for the risk I'm taking on. So, you have to have those two balancing forces all the time kind of going within your mind. It's, and the reason I ask you that specifically, because it's something that I see all the time where at least a lot of people in my community, they commit what I consider to be, it's not like a big sin, but they miss out on a lot of stuff because they're waiting for too much confirmation. They're waiting for like the clearest trending move. And then what I try to explain if we're trading directionally, even with options in those kinds of instances, you're just increasing the risk you're taking because you need to give something a little bit of room to move. If you've had a really strong consolidation period, you now have a pretty clear snapshot on how you can manage your risk around that kind of spot. And then if you start to see this breakout and you're late to trading it like too late, now all of a sudden the base is still down here. So, you have to either have a really low expectation that the trade will work out, but if it does, might be a great win. What do you think about putting on positions like that? Because like you were talking about in this instance, it was a big part of your portfolio.",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 77,
      "start_timestamp": "00:19:56",
      "start_timestamp_seconds": 1196.8831168831168,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=1196"
    }
  },
  {
    "text": "have to either have a really low expectation that the trade will work out, but if it does, might be a great win. What do you think about putting on positions like that? Because like you were talking about in this instance, it was a big part of your portfolio. So then is your approach in that instance, the remainder of your portfolio, do you also have that super concentrated, or is it that you have this one really speculative concentrated position, and then you have the rest of it into other things cash, whatever to try to balance some of it off? Did you ever read the book, Remin instances of stock operator? Yeah, I'm assuming you did. Yeah. So my approach really, it's funny because at one point I thought I had a stroke of genius that I had invented a way of building into positions. And then after I was rereading that book, I'm like, oh, I just kind of ripped off Jesse Livermore in this chapter when he was talking about. So there's one chapter where he talks about he's looking at wheat and corn or something like that. He puts a position on both, and wheat keeps going up and he keeps adding to it progressively and getting a big position. Corn never moves. He never adds to it and he ends up selling it for a small loss and the wheat's major winner. So for me, like, so some people, I think will misunderstand",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 77,
      "start_timestamp": "00:21:36",
      "start_timestamp_seconds": 1296.6233766233765,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=1296"
    }
  },
  {
    "text": "wheat keeps going up and he keeps adding to it progressively and getting a big position. Corn never moves. He never adds to it and he ends up selling it for a small loss and the wheat's major winner. So for me, like, so some people, I think will misunderstand saying, oh, yeah, this big position, you must be gambling. Like, I'm incredibly risk-averse. Like, I hate risk. And the reason is is, like, I was a market maker for years and I used to trade a lot of these miners and stuff where they love to raise money. And so so many times you see this big update, and if you say, like, oh, it's a breakout and you bought it, like that night, like 405, oh, financing, and it's 10 lower. And so you're getting slammed. So I got so used to having to work around like possible, like overnight gaps and event risk. Like, if I'm going to get a concentrated position and it take me time, and I have to build it with with profit. So I have that profit cushion building to protect my original capital. And so it takes time to get concentrated positions. If it's a great market, can I have three or four concentrated positions going at once? Sure. But it's kind of like what the market gives to me. So like last year, for example, when I had SMCI last summer, it was a bit of a thinner market. There weren't",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 77,
      "start_timestamp": "00:23:16",
      "start_timestamp_seconds": 1396.3636363636365,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=1396"
    }
  },
  {
    "text": "If it's a great market, can I have three or four concentrated positions going at once? Sure. But it's kind of like what the market gives to me. So like last year, for example, when I had SMCI last summer, it was a bit of a thinner market. There weren't as many great movers. So that was like my concentrated positions of that moment. Other times I have a few more going on, but it's like, I don't start off saying I'm buying four stocks and putting massive size and let's see what happens. It's really like what the market gives me. Got it. So then in the example of SMCI, the way that I typically break out trades, at least mentally, is I have what I call an allocation. So upfront, I typically determine how much of my portfolio does that trade get. And then I have two other metrics. I have the initial outlay. So of that total allocation, how much am I giving it upfront? And then I have scaling. So based on whether it's certain dollar moves, whatever the case is, how much am I adding in different frequencies? What's your approach in an instance like this with SMCI? Yeah. So like I usually start around 10 of the portfolio. My aim is to scale things to the 30 to 50 range. That's where I feel comfortable. Like I've gone above that. But then like I'm personally getting out of my, you know, like when you're",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 77,
      "start_timestamp": "00:24:56",
      "start_timestamp_seconds": 1496.1038961038962,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=1496"
    }
  },
  {
    "text": "this with SMCI? Yeah. So like I usually start around 10 of the portfolio. My aim is to scale things to the 30 to 50 range. That's where I feel comfortable. Like I've gone above that. But then like I'm personally getting out of my, you know, like when you're pushing your own personal comfort zone, you know, it's like, like I get above sometimes it's rare, but I'm, I know I'm kind of pushing it and it better be working if it doesn't I'll scale it back quickly. But that's kind of the range that works. I mean, some people like their heads explode, explode thing of that kind of concentration. But if you do it carefully, like by the time you're getting to a 30, 40 concentration, you're already up like 10 on the average cost basis. So I mean, you're protected against a random overnight gap down or bad news or downgrade or some kind of situation like that. So there's ways to kind of still work around it. But you know, those really outsized returns come when you get a good trend, you get an early, you get that concentration. It takes that effort to really bring it all together. But when it works, it's like it's fireworks, you know, but it takes that effort, that diligence to get to that point. Yeah. And I think for a lot of traders, they're always fed the, you know, individual positions should never be more than a percent",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 77,
      "start_timestamp": "00:26:35",
      "start_timestamp_seconds": 1595.844155844156,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=1595"
    }
  },
  {
    "text": "bring it all together. But when it works, it's like it's fireworks, you know, but it takes that effort, that diligence to get to that point. Yeah. And I think for a lot of traders, they're always fed the, you know, individual positions should never be more than a percent of your account or whatever the case is, right? They just throw out a random number. When you look at building these positions, though, you've found that if you want to get big moves, you have to add the size. So how do you think people can make that mental leap from where they're given this really, in my opinion, really risk averse. And then trying to get to a point where you can actually make like meaningful money on moves provided that you're still controlling your risk on the bigger positions, how do people make that jump? You know, so I think there's like, you have to make different ground rules. I think for everyone, it's going to be different numbers. Some people can be even more aggressive than me. Some people are incredibly averse. So you have to sort of, you have to kind of come to terms with what works for you. Like there's like really what's your maximum? For some people, it'll be 50 percent. Some people will see people will be 10 percent of a portfolio. That's the max they can accept. But so there's two tricks that kind of work for me. One was,",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 77,
      "start_timestamp": "00:28:15",
      "start_timestamp_seconds": 1695.5844155844154,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=1695"
    }
  },
  {
    "text": "with what works for you. Like there's like really what's your maximum? For some people, it'll be 50 percent. Some people will see people will be 10 percent of a portfolio. That's the max they can accept. But so there's two tricks that kind of work for me. One was, it was years ago, I was in a slump. I think it was 2011. I had a grade 2010, and that's another kind of pattern I noticed after my really big years, the next year tends to kind of not be so good because you get sloppy and stuff like that. But I remember 2011, I'll keep you humble. Yeah, yeah, Mark will keep you humble, my friend. But I was in a slump, and I remember I was sitting next to a guy. So I was the youngest guy on the desk. Next to me was kind of the oldest guy on the desk. And it's almost like, you know, you're at that point where every time you touch the mouse, you lose money. Like you're almost like, you know, you're just scared to put a trade on. And he's like, Matt, I don't care. He's like, you figure out what's an amount of money that's not going to bother you to lose and you just keep trading with that amount until you get back your groove. And so that's kind of where I started the dollar stop concept. So for every trade, you know, as my account moves,",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 77,
      "start_timestamp": "00:29:55",
      "start_timestamp_seconds": 1795.3246753246754,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=1795"
    }
  },
  {
    "text": "out what's an amount of money that's not going to bother you to lose and you just keep trading with that amount until you get back your groove. And so that's kind of where I started the dollar stop concept. So for every trade, you know, as my account moves, I'll adjust it every few months. But there's a maximum dollar amount that I'll lose on a trade. Now, like, although it's kind of based on percentages, but our returns work in percentages, but our gut works with dollars. You know, we live in dollars. You know, how much it takes to buy a car, how much it, you know, it takes to go out for supper. So at the end of the day, the dollar loss is going to hurt you probably more than the percentages. That's more like the industry things we watch. So when I set that dollar stop, it kind of created this level of comfort. We're like, okay, I can put on my trade. I know what I'm going to lose. I can live with that. And it created this like openness of this, you know, this feeling of being able to kind of go out there and not worry about, am I going to screw this up? That's my max loss. If I get there, I'll get out and I'll reassess. It took off a lot of pressure. And a second kind of tool that helped me was, I would then after kind of",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 77,
      "start_timestamp": "00:31:35",
      "start_timestamp_seconds": 1895.064935064935,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=1895"
    }
  },
  {
    "text": "out there and not worry about, am I going to screw this up? That's my max loss. If I get there, I'll get out and I'll reassess. It took off a lot of pressure. And a second kind of tool that helped me was, I would then after kind of we tend to circumvent our own kind of safety features would be like, okay, that's that's my my back some dollar risk. So I'll put on a bunch of trades really quickly, you know, one after another. So you end up building all this size and then you still have this risk if there's a gap down because you you put on all these trades, but they're all right next to each other. So basically, I have so much I'll lose on a trade. And then I want my stocks to go up at least by four or five percent before I add to them just to prevent myself from kind of constantly adding in the same range it without any kind of real profit cushion. So if I have a maximum loss and I need at least some kind of a gain before I add, everything's going to be going my way before I'm getting concentrated. So that's my way of being safe and getting concentrated. Yeah, I love that. And then how do you view adding? Is there a certain amount of you start with maybe 10 of the portfolio like you're saying, how do you view when",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 77,
      "start_timestamp": "00:33:14",
      "start_timestamp_seconds": 1994.8051948051946,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=1994"
    }
  },
  {
    "text": "going my way before I'm getting concentrated. So that's my way of being safe and getting concentrated. Yeah, I love that. And then how do you view adding? Is there a certain amount of you start with maybe 10 of the portfolio like you're saying, how do you view when you get that four to five percent move? What's your thoughts on adding there? I try and do it other I try and do similar size. I try and be consistent. I mean, like I won't explain, you know, if the stock gets too extended from a base, I'll just let it go at that point, but I try and start near basing structure. So I have a good kind of foundation where if it does ultimately break away, I'm already nicely concentrated like I hate sometimes like I have a position in Palo Alto like I wish I had more sometimes they just kind of get going and you don't get your position and it sucks to see a nice winner and you're like, oh, I have like a third of what I really wanted in there. So it never gets the same kind of meaningful impact, but I try and be consistent with my position sizing. Yeah, well, I think the idea of consistency of position sizing, it gives you a known good because I think if you don't do that, especially with options when you're dealing with kind of two different sets of values, you have the",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 77,
      "start_timestamp": "00:34:54",
      "start_timestamp_seconds": 2094.5454545454545,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=2094"
    }
  },
  {
    "text": "try and be consistent with my position sizing. Yeah, well, I think the idea of consistency of position sizing, it gives you a known good because I think if you don't do that, especially with options when you're dealing with kind of two different sets of values, you have the premium of an option and then you have the noional value of whatever it is you're controlling. But if it's yeah, kind of a crapshoot, I've always found that to be impossible then to project a system forward, even have any confidence in the perspective return for it. So 2023 was obviously then a lackluster kind of boring year for you coming into 2024. What were your original expectations and how have they panned out so far? So things have kind of gone similar to what I expected. For me, the biggest frustration I think is I think a lot of probably active professionals will feel it is just the QQQ is so strong because there's a small group that so it makes it kind of makes everyone who's an active manager who's not keeping up with like the top five names look like a loser say, oh, look what the it's an abnormal market in a sense like I've never seen the QQQ do that, but the Russell 2000 be stuck in a bear market. Not that you should be in the Russell 2000, but most stocks probably fall in between. So it's a bit of a frustration in",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 77,
      "start_timestamp": "00:36:34",
      "start_timestamp_seconds": 2194.285714285714,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=2194"
    }
  },
  {
    "text": "the it's an abnormal market in a sense like I've never seen the QQQ do that, but the Russell 2000 be stuck in a bear market. Not that you should be in the Russell 2000, but most stocks probably fall in between. So it's a bit of a frustration in that sense, but it's played out as I expect that I had a good end of year, like a good push into the end of the year coming into the into the start of the year. I the markets were frothy. There's some other tools I look at to get a sense if the markets are frothy or not. So I bought a lot of protective puts. I was going away on vacation. I said, look, number one, the markets frothy. I'm going to be on the beach. I don't want to have to be attached to my phone. So I bought a lot of protective puts. I even bought some out of the money put so I could be aggressive if things did fall. So that all worked out very well. Obviously, you know, there's the cost of those puts. There's a bit of like a draw on performance for that respect, but it allowed me to keep a lot of my positions, which I'm still not positioned in. We're going to earning season with protection. So at least the profits finance that protection. We'll see how that ultimately plays out. So if I wouldn't have been protected, some",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 77,
      "start_timestamp": "00:38:14",
      "start_timestamp_seconds": 2294.025974025974,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=2294"
    }
  },
  {
    "text": "for that respect, but it allowed me to keep a lot of my positions, which I'm still not positioned in. We're going to earning season with protection. So at least the profits finance that protection. We'll see how that ultimately plays out. So if I wouldn't have been protected, some stocks took some sizable drops, which I was kind of without protection would have been a painful start to the year. So I was able to work that. Each year, I pick a new focus of what I want to really specialize on and improve. This year was equity curve management. And so that's kind of I'm running some new like hedging ideas. And so so far, so far, so good. Because you know, if you're looking outside of QQ, a lot of stocks took some, I mean, archonivation is down like what 13, 14 in the first month, you know, I think rustles down 8. Depending where you were standing, it was a very different January. And so for a guy where my preference is not usually, you know, 2 trillion companies, you're looking for innovative growth. It could have been very damaging. So I was happy with the hedges. Yeah. And it's good that you bring up the cost of those hedges because the way that you're thinking about hedging obviously is as a professional where a lot of people that I find think about hedging, they want to hedge because they just don't like seeing red. It's",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 77,
      "start_timestamp": "00:39:53",
      "start_timestamp_seconds": 2393.7662337662337,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=2393"
    }
  },
  {
    "text": "hedges. Yeah. And it's good that you bring up the cost of those hedges because the way that you're thinking about hedging obviously is as a professional where a lot of people that I find think about hedging, they want to hedge because they just don't like seeing red. It's a visceral response, right? They don't like feeling like it's all those kinds of things, which to me, those are all the wrong reasons to hedge. You have a very clear business case that you're implementing with with your hedging. When you're using something like long puts, obviously, I got to ask, how do you think about those? Like do you go further on time, deeper in the money? You said out of the money on some of them, what's your general approach there? Yeah. So it's something I've been, it's like a strategy I've been working on for a little while. I started to kind of implement it. You know, I always like to study something without any money involved that I do it with a little bit of money before I roll it out intensely. But so the aim was, like you said, if you just try and buy puts all the time to protect yourself, I mean, you'll never make any money. You're just going to give all your money to the other side. So really what I try and do is really those moments in time where you're looking at the market sometimes just from a,",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 77,
      "start_timestamp": "00:41:33",
      "start_timestamp_seconds": 2493.5064935064934,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=2493"
    }
  },
  {
    "text": "buy puts all the time to protect yourself, I mean, you'll never make any money. You're just going to give all your money to the other side. So really what I try and do is really those moments in time where you're looking at the market sometimes just from a, almost like a game theory perspective, you know, like I have these sizable gains, you know, all these indications are showing me that we have, you know, the possibility for a larger correction may not happen. But if there is a larger correction, I have a lot to lose. And if it keeps going, you know, I'm positioned. So it makes sense to pay the insurance at that point in time. So I'm sorry, what was the question again, Eric? I went a bit off. You were going right down the right path, fortunately, it was just how do you think about implementing the puts? Yeah, sorry. That's right. Yeah. So so so so you have to step back and say, okay, it's not about always protecting your account because this is a gate of business of risk. It's about a business of managing risk, not taking no risk. If you want no risk, you won't make any reward. So it's about finding those points in time. And that's what I've noticed with my own personal situation, like with SMCI, where, okay, just from a game theory perspective, I have these huge gains, I have this concentrated position. Even if",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 77,
      "start_timestamp": "00:43:13",
      "start_timestamp_seconds": 2593.246753246753,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=2593"
    }
  },
  {
    "text": "you want no risk, you won't make any reward. So it's about finding those points in time. And that's what I've noticed with my own personal situation, like with SMCI, where, okay, just from a game theory perspective, I have these huge gains, I have this concentrated position. Even if you say, look, at this point, there's a 50, 50 chance that we have a hard break or we just keep going, while at hard break would be really expensive, relative to the cost of insurance. And so it just makes sense at that point to hedge it on when you're already at these very elevated levels. So that's when I'm looking to kind of put on the hedges at specific times. I'm very careful, even like with some of my members, it's like they get that same kind of sense, like, well, why don't we hedge more often? It's just too expensive. You're just always going to be paying hedges, hedges, and and it's really about those times where there's that asymmetric place where if there's a break, it's going to get ugly. And if you've been trading long enough, you kind of know where you're getting on that knife's edge of where we can keep going, but it's going to be painful if everyone has to de-exit at the same time. Yeah. So then when you're looking at hedging, do you just try to hedge a certain percentage of your positions value? Do you hedge 100 of the",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 77,
      "start_timestamp": "00:44:52",
      "start_timestamp_seconds": 2692.9870129870133,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=2692"
    }
  },
  {
    "text": "knife's edge of where we can keep going, but it's going to be painful if everyone has to de-exit at the same time. Yeah. So then when you're looking at hedging, do you just try to hedge a certain percentage of your positions value? Do you hedge 100 of the value? How do you think about that? Yeah. So again, you know, so if you were asking, do I do a full delta hedge or whatever, it's like, you know, again, it gets more expensive. So I just said, like, look, I have, let's say I'm on a stock, I'm up 35. And it's been a good move, and I'm concentrated position. If I can hedge, and usually most pullbacks, again, you know, I try and use an actual perspective, most pullbacks are three to four weeks down to, let's say, a 50 day moving average. That's what I'm trying to protect. Because some of these stocks, you'll see historically, they'll get 25 or 30 away from their average, they'll then come back down. So to smooth out those drops, which are likely. So basically, I said, I have the 35 gain. It's in a cost of 4 to hedge this position for the next three to four weeks. For me, that's a good business decision. Not is it going to absolutely drop now? I don't know. I can't predict. I want to stay long the stock, because I think they're on key trends. It's a leader in the market",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 77,
      "start_timestamp": "00:46:32",
      "start_timestamp_seconds": 2792.727272727273,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=2792"
    }
  },
  {
    "text": "this position for the next three to four weeks. For me, that's a good business decision. Not is it going to absolutely drop now? I don't know. I can't predict. I want to stay long the stock, because I think they're on key trends. It's a leader in the market relative strength. The market has good strength, all the rest, but I don't want that huge downside to the 50 day moving average. So I hedge at the money. Instead of doing a full delta hedge, I just consider the at the money puts for the position I have as my cost of insurance. I know it's going to waste the way a bit at a time, but it's like you buy fire insurance for your home, you're not upset if the house doesn't catch fire. Another kind of idea I've had, I've been toying around with a little bit, was then at the same time looking at the really far out of the money puts, like, okay, if we do have a break now and we get down to that 50 day moving average, you know, not likely to get there, but you can get puts for super cheap. And then after just about the time everyone's freaking out because the stock's down 25 in like two weeks, which is, you know, it's always stares up elevator down. Well, I can step in with confidence on that same average and I can buy some stock. And I know from",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 77,
      "start_timestamp": "00:48:12",
      "start_timestamp_seconds": 2892.4675324675327,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=2892"
    }
  },
  {
    "text": "And then after just about the time everyone's freaking out because the stock's down 25 in like two weeks, which is, you know, it's always stares up elevator down. Well, I can step in with confidence on that same average and I can buy some stock. And I know from experience, because I have many times of sold on that average when I should have been buying just because that fear the size of the drop. So just trying to kind of circumvent those natural tendencies we have to panic when we should be buying. Yeah, that's really interesting. Have you also looked at potentially going deep in the money? Yeah, but I didn't want to give, like the game is to not give up too much upside as well, but I'm not as, you know, experience as you are with options. So I'd love to hear what your perspective is on it. Yeah, do you have just a general stock you're even remotely interested in now? Sure, but do you want something that has earnings coming up or that's already past earnings or earnings away? Whatever makes it happen. Well, let's take a look at let's say Shopify. So let's say in this instance, you have long long, I'm so used to selling that's so funny. If you have long shares and for our long shares, how many like what size would we be looking at? Well, I mean, whatever you could just put a thousand shares just for",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 77,
      "start_timestamp": "00:49:52",
      "start_timestamp_seconds": 2992.2077922077924,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=2992"
    }
  },
  {
    "text": "let's say in this instance, you have long long, I'm so used to selling that's so funny. If you have long shares and for our long shares, how many like what size would we be looking at? Well, I mean, whatever you could just put a thousand shares just for simplicity's sake. Perfect. And then do we want to pretend that we have a bit of a profit already? If so, I can adjust. Yeah, so let's say my cost is around I think 64, let's say. It would have been better if it was 69, but 64, acceptable. Okay, so there are a bunch of different ways I look at hedging this kind of thing. The first thing is if I'm buying options, I actually typically prefer to go further out in time. And the reason for that, which is you know, baited a K for everything that's within 60 days is going to be grossly accelerated. So if we look at just the at the money puts here, you're losing 17 cents every single day. This is all X transit value. So that will all bleed out over time. Whereas if we go further out in time to like 168 days, something that's still at the money, your theta is now down to three pennies. Now a couple small notes, the first one is you will notice that the strike changed here. So your premium quote unquote, right, the amount that you would lose before your protection kicks",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 77,
      "start_timestamp": "00:51:31",
      "start_timestamp_seconds": 3091.948051948052,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=3091"
    }
  },
  {
    "text": "like 168 days, something that's still at the money, your theta is now down to three pennies. Now a couple small notes, the first one is you will notice that the strike changed here. So your premium quote unquote, right, the amount that you would lose before your protection kicks in will change slightly. But one of the things I really like to do for stuff like this is actually to go in the money. Now there's a couple things to know. The first one is if we go deeper in the money, you're going to get a better delta for delta move. So if Shopify drops a dollar here, you're going to get 86 cents of that dollar movement as compared to 37 cents, whatever it is. You're also going to immediately decrease your theta massively in two instances. The first instance, because we're very far out in time that decreases theta decay. The second is when you're far in or out of the money. So in this case, you're paying more upfront, right? There's a bigger upfront cost. This would be 3700 bucks, which we could look at a couple examples in a second. But of this 3700 bucks, only 210 is actually extrinsic value. So if you don't get in a accommodating move, which would help you, if you don't get in a accommodating move and time continues to run here, your option will lose less overall. So you're putting up 3700 bucks. But if everything remains",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 77,
      "start_timestamp": "00:53:11",
      "start_timestamp_seconds": 3191.688311688312,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=3191"
    }
  },
  {
    "text": "bucks, only 210 is actually extrinsic value. So if you don't get in a accommodating move, which would help you, if you don't get in a accommodating move and time continues to run here, your option will lose less overall. So you're putting up 3700 bucks. But if everything remains the same roundabout, you're only going to lose 200 of that. And that's the rest of this is entranceic value. So this starts to hurt if you get a big accommodating move. So we can look at an example here. Let's do something like this, 115 just for an example. So in this example, I'm going to zoom this out a lot so that we could see where it would start to hurt. What would you typically hedge? So right now, we're hedging a tenth of the position. Do you like to hedge 100? Yeah, let's see. You bought 10 puts. Yep. Okay. So in the example here, you'll notice a couple things. The first one is if we buy too many puts, we need obviously a big move in our favor before we break out of whatever we're capping. But the cool part is if you look to the downside, your risk of you're completely capped here. So we're taking, let me take a look, your PL, let's say right here, would be 188. Your PL here is 18658. So you're not actually losing a bunch of money because the protection on a percentage basis is actually very low.",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 77,
      "start_timestamp": "00:54:51",
      "start_timestamp_seconds": 3291.428571428571,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=3291"
    }
  },
  {
    "text": "downside, your risk of you're completely capped here. So we're taking, let me take a look, your PL, let's say right here, would be 188. Your PL here is 18658. So you're not actually losing a bunch of money because the protection on a percentage basis is actually very low. If you stay about where the same, whereas because you have so many long deltas, you'll notice we need a pretty big, accommodating move until we start to break out of it at expiration. That's what the blue line is. The purple line would be today. So if we compare that real quick, let's say the 110. At the 110, you'd be making 46 grand. At the 110 in this instance, you're making 28 grand. That's obviously the drag from the long puts. So that's one of the benefits, though, of going deeper in the money, is that you actually can get decent protection without having to put on one to one. Because if you're at the money, let's say you're using this near term at the money, you're saying four weeks. So we'll just do the 42. It's kind of close. This is giving you 38 deltas. So let's say we buy 10 of those. So this is the original example we're looking at of the deep and the money far out in time. If we use the near term, you'll notice a couple things. You're upfront profit. If you start to get non-accommodating move, we're going against. You",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 77,
      "start_timestamp": "00:56:31",
      "start_timestamp_seconds": 3391.168831168831,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=3391"
    }
  },
  {
    "text": "say we buy 10 of those. So this is the original example we're looking at of the deep and the money far out in time. If we use the near term, you'll notice a couple things. You're upfront profit. If you start to get non-accommodating move, we're going against. You make a little bit less money. 18 grand is, I think it was 18 eight compared to 11 three. Expiration. So a little bit less if we don't get our move, but to your point and to the broader movement here, you have much better upfront return profile. If you get a big move near term, the issue is to maintain the protection for this. Obviously, you would have to continue doing it. You were pretty selective. So you might have found a pretty efficient way to manage that. So if you don't like carrying protection for too long, the other thing that I think could make sense is by having a shorter term protection profile like 60 or 90 days. And then I actually like to do two things where I use both in the money for the dollar, delta to delta move, but then also if further out of the money in case it's a big accommodating move for the hedge itself, it's cheap to hold that, not a lot of theta decay. But if you get a big move, they're going to have a giant percentage return. Interesting. Yeah, I think the first example for me is",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 77,
      "start_timestamp": "00:58:10",
      "start_timestamp_seconds": 3490.909090909091,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=3490"
    }
  },
  {
    "text": "of the money in case it's a big accommodating move for the hedge itself, it's cheap to hold that, not a lot of theta decay. But if you get a big move, they're going to have a giant percentage return. Interesting. Yeah, I think the first example for me is difficult to kind of put on because the whole point of being in this talk is I have a bullish outlook for it anyway. And in the first place, the whole point is just to avoid those worst case scenarios like SFCI last August where you drop like 30 in a week. It's to basically hedge out against those massive kind of downside moves. But the aim is to not give up the upside. The whole point is you think you're in a pull market, you have this stock that's doing great. You want to maximize that upside. So that's why it's trying to kind of walk that fine line. I'm interesting. If you can maybe show something like you were talking about how if you also bought something out of the money, how that would profile that would bring you. Yeah, definitely. And a couple of notes on that, the first thing is I think it also depends on how you feel about the downside risk. Like if the goal is to purely cap and not have any downside risk whatsoever, completely agree with you. That going super deep in the money is a more expensive expression of that.",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 77,
      "start_timestamp": "00:59:50",
      "start_timestamp_seconds": 3590.6493506493507,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=3590"
    }
  },
  {
    "text": "the first thing is I think it also depends on how you feel about the downside risk. Like if the goal is to purely cap and not have any downside risk whatsoever, completely agree with you. That going super deep in the money is a more expensive expression of that. The main benefit to that is you're going to preserve more of your upfront profit today as it is. So if we don't get a giant accommodating move, in your case, I agree with you. I don't think it makes a ton of sense specifically because like that's the entire premise of you being in that trade. Yeah, exactly. For that big accommodating move. So the way that I think about that then is if you want the cheaper style hedge, then I actually would probably just go a little further out in time because in this example, even if you go right at the money, you're losing about set that's worth theta to case the highest because X trends value is the highest at the money. So you're losing, you know, seven cents of your four sixty five every day. Pretty manageable, but that's not insignificant, especially as a percentage basis of the premium. So if you do something similar to that, maybe just go out to like 60. I would go out to like 90 days if I could not expecting it to hold it for the whole 90 to be clear. It's almost like you're putting a",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 77,
      "start_timestamp": "01:01:30",
      "start_timestamp_seconds": 3690.3896103896104,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=3690"
    }
  },
  {
    "text": "percentage basis of the premium. So if you do something similar to that, maybe just go out to like 60. I would go out to like 90 days if I could not expecting it to hold it for the whole 90 to be clear. It's almost like you're putting a deposit down, but you're expecting to take some of it back. I wouldn't hold this all the way into expiration. By going further out in time beyond that 60 day window, we just really decrease the amount of theta we're paying on a daily basis. So in this case for that same, let's look at the same strike. Let's just use the 80. The 80 in this instance, you're paying four sixty five losing seven cents a day. If we use that same 80, you're paying five seventy five, but you're losing four cents a day. But in an extreme downside move, you lose more extrinsic value with the further out option, right? In an extreme down move, you would lose more theta you're saying or on the, well, like I mean, like at the 80s, let's say so ultimately, let's say the stock drops to 50 doesn't come back by expiration. In this case here, you're losing that five seventy versus let's say the four dollars with the shorter term option. If I see what you're saying, so a couple things, if the stock does drop there, these are going to go up in value. No, no, I understand.",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 77,
      "start_timestamp": "01:03:10",
      "start_timestamp_seconds": 3790.12987012987,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=3790"
    }
  },
  {
    "text": "by expiration. In this case here, you're losing that five seventy versus let's say the four dollars with the shorter term option. If I see what you're saying, so a couple things, if the stock does drop there, these are going to go up in value. No, no, I understand. Yeah, no, I understand that, of course, but I mean, like, like your delta is going to be lower on this one, right? So like as it's kind of dropping down, that extrinsic value is being lost along the way, there's more to be lost like overall. So that's, I mean, like let's say you buy both options and the stock drops significantly, the one that you bought further out is going to be the more expensive way in that case of protection. Yeah, we can take a look at it because in both of these instances, if the stock drops, both of those positions are going to look healthy. Yeah, I know, but I'm thinking of it in terms of like holistically with the stock. I see, I see, I see, I see, I see. So this top one here is the 15 March and what scenario do you want to look at it? Let's say this goes to 60 by expiry or whatever. Yeah. So in this case, you would have a net position positive 11,300. Okay. Let's see with the other option. 10,200. Yeah. So that's what I meant there. Like there's that extra cost in more",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 77,
      "start_timestamp": "01:04:49",
      "start_timestamp_seconds": 3889.8701298701294,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=3889"
    }
  },
  {
    "text": "want to look at it? Let's say this goes to 60 by expiry or whatever. Yeah. So in this case, you would have a net position positive 11,300. Okay. Let's see with the other option. 10,200. Yeah. So that's what I meant there. Like there's that extra cost in more of a worst case scenario. Definitely, definitely, especially if your intention is to hold it to expiration. Because the, and that's also another great caveat, right, is to think about the way that you manage the option hedge itself. Because for me, again, depending on the way you think about the hedge, it's double edge sword. You want the hedge on and when the hedge is working, you want the hedge on because the hedge is working. That's not necessarily a great time to unwind the hedge. However, if the intent is to take it to expiration, you have to remember, in this case, you will have to cycle this, this 15 March several times in order to get the same overall protection as the 19 April. So this 15 March actually comes out to be more expensive in that scenario. But that's if you're maintaining a continual, at least a hedge for that 90 days or whatever. So a lot of it also comes down to the timeline of the hedge. So yeah, it gets tricky because I'm using these in conjunction with a view of the stock and the direction of that stock. So like, for example, I",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 77,
      "start_timestamp": "01:06:29",
      "start_timestamp_seconds": 3989.610389610389,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=3989"
    }
  },
  {
    "text": "a hedge for that 90 days or whatever. So a lot of it also comes down to the timeline of the hedge. So yeah, it gets tricky because I'm using these in conjunction with a view of the stock and the direction of that stock. So like, for example, I had hedges on sq block going into the beginning of the year. And so like I had to manage that that option for these exact same reasons. So I had bought the stock, I think it's 75. I don't know if you want to bring a chart up on sq. So I bought that like at 75 in December, that area, no, it was a 75 or yeah, I was like, I knew I was leading the move, but I just, I wasn't sure how this market was going to end the year. So I bought at 75, then it was like an 80 or so. I said, you know, this market's probably going to come off or it's going to explode vertical right now. I'm not sure which way. So what I did was I bought some puts and I said, if this does break, we're probably going to break back down to that 50 day movie average area of 65 or 66. So when I actually did get down to there, I pulled off my hedges. And so I kind of, I kind of used that gain on the put to kind of lower the effective cost of",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 77,
      "start_timestamp": "01:08:09",
      "start_timestamp_seconds": 4089.350649350649,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=4089"
    }
  },
  {
    "text": "break back down to that 50 day movie average area of 65 or 66. So when I actually did get down to there, I pulled off my hedges. And so I kind of, I kind of used that gain on the put to kind of lower the effective cost of my stock. That's the only reason why I'm still in the stock. I actually had bought the out of the money puts, which I used to even add down at those levels, which I'm still still fighting with overall. It hasn't really rebounded aggressively, but at least despite the drop, but definitely you're right, because if you don't manage the puts after a move happens, then yeah, there's that big kind of, you know, that big value there that that will ultimately, you know, waste away, whatever time value is left in there will go away if you don't kind of manage it. Yeah. And I think the way that I typically look at out of the money versus in the money, it really just comes down to the deductible, right? It comes onto the strike because if if you're buying it at 73, 75, whatever. And we get up to 80, you're like, okay, time to put on a hedge. Depending on what strike you pick, that's your upfront deductible for whatever your loss is going to be. So if you go further out of the money, all that means is you have a bigger upfront deductible before the",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 77,
      "start_timestamp": "01:09:49",
      "start_timestamp_seconds": 4189.090909090909,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=4189"
    }
  },
  {
    "text": "to 80, you're like, okay, time to put on a hedge. Depending on what strike you pick, that's your upfront deductible for whatever your loss is going to be. So if you go further out of the money, all that means is you have a bigger upfront deductible before the protection starts to kick in. Now that is good in a big move like this. If you have a big move, those far out of the money will compound quickly gain gamma gain delta. And then obviously they start to offset meaningfully where they don't help you too much is in a smaller move. Yeah. And that's where the higher delta starts to come in. But the good part about you going further out of the money is it's also just cheaper. It's a more efficient purchase. The main issue with at the money stuff, especially less than 60 days is you're just losing a lot of theta decay. If I liked at the money, I would try to gain that same delta going a little further out in time to your point though. If you're not going to cycle that edge, you do have a larger hedge exposure that will eventually have to be dealt with. But if you typically have a four week hedge that you take in and then put back out to me, I would just be out in that second expiration of front, which will help offset some cost. That's really interesting. You know, the",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 77,
      "start_timestamp": "01:11:28",
      "start_timestamp_seconds": 4288.831168831169,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=4288"
    }
  },
  {
    "text": "will eventually have to be dealt with. But if you typically have a four week hedge that you take in and then put back out to me, I would just be out in that second expiration of front, which will help offset some cost. That's really interesting. You know, the thing is, I find it's in a way, it's almost unfortunate. So many option guys are just option traders and stock guys are stock traders. That was one of the beauty of working on a trading desk. You had a little more of sharing of ideas. See if you buy a book on options. It's always like so option centric. It's like when you kind of trying to combine the two, it starts to require like a good understanding of both to kind of build a strategy that works for you. But I think the beautiful thing is that you can get to different scenarios where I think I found it's interesting. There's one quote by I think Paul Tudor Jones has the best offense. It's a good defense, which I'm sure he's taking from someone else. But I've found since I've been kind of working with this approach, it's allowed me to be much more aggressive because once I have some good protection in the past where I'd rather usually be like sitting around saying, okay, well, I'm already pretty exposed. I mean, let's say, okay, I was able to finance that protection with gains. And now let's look",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 77,
      "start_timestamp": "01:13:08",
      "start_timestamp_seconds": 4388.571428571428,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=4388"
    }
  },
  {
    "text": "allowed me to be much more aggressive because once I have some good protection in the past where I'd rather usually be like sitting around saying, okay, well, I'm already pretty exposed. I mean, let's say, okay, I was able to finance that protection with gains. And now let's look around for other opportunities. So yeah, if it's a bad market reversal, you know, there's the cost of your puts, whatever, and the cost. But if the market continues, you're actually getting the opportunity to put on a lot more leverage. But in a safe way, because you have protection on some parts. So it's kind of freed up a different kind of mindset to be a little more aggressive while being defensive. So I've been enjoying it to something I'm, I always love to try new things. I think I've tried every strategy. I could just because it always learns something new and it's been it's been fun to play with. Well, one that I that I still am just so curious. I'd love to do a study some time like to to see how you would think about this stuff is like rather than using the equity, using options to gain your long exposure. Because in that kind of scenario, let's say we're trading square again, back in and we're getting in at 75 like the price strategy that I would run if I was a cancelsam style traders, what I call a ratio called diagonal where I'm",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 77,
      "start_timestamp": "01:14:48",
      "start_timestamp_seconds": 4488.311688311688,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=4488"
    }
  },
  {
    "text": "options to gain your long exposure. Because in that kind of scenario, let's say we're trading square again, back in and we're getting in at 75 like the price strategy that I would run if I was a cancelsam style traders, what I call a ratio called diagonal where I'm just using a far out in time. So again, typically like 90 to 180 days or something like this far out in time, deep in the money call, so something like this 90 delta. So you gain the leverage of the option. If I buy one, I'm controlling 100 shares and I'm paying 2500 bucks. In this scenario, if we compare these, we can get rid of this. And then we can just look at buying. So if we compare the two different strategies, if we're long equity and we get a plus one standard deviation move to 74 50 for more we're at right now, you make 675. In that same scenario with the options, you make 589. The difference is instead of putting up 67 bucks times 100, you're only putting up 2500 bucks. So technically, I can gain the same size by effectively doing two of these and I still would be smaller actually in terms of overall cost, but now I'm making 1200 bucks. So yeah, and by going far out in time, you give yourself a ton of room to move in. It's kind of those same benefits that we were talking about before where",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 77,
      "start_timestamp": "01:16:28",
      "start_timestamp_seconds": 4588.051948051948,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=4588"
    }
  },
  {
    "text": "and I still would be smaller actually in terms of overall cost, but now I'm making 1200 bucks. So yeah, and by going far out in time, you give yourself a ton of room to move in. It's kind of those same benefits that we were talking about before where there's not a lot of theta decay. It's mostly intrinsic value. So it's just a pure leverage play. It's a direction of leverage play. Yeah. Yeah. But if I'm typically trading like a leverage directional strategy, that's normally what I would I go to. And then to your point, I actually really think there's a lot of efficacy behind like mixing options and equities. Like I trade a covered strangle and the basis of that position is long shares and something. And then I will amplify that by selling short calls at a ratio. So I'm not capping my upside short puts to gain more exposure also to capitalize on puts you. I also like to integrate ratio diagonals with longs actually as a hedge the offset cost, but options, man. Yeah, there's it's interesting. You know, like I can I can I'm aware too, you know, like long stock, long put, it's, you know, you're synthetically long call. I get it, you know, but for me, it's kind of it's not so, you know, part of it is, like I said, lever once you have hedge things out, then you do have that lever. Just like it's like you",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 77,
      "start_timestamp": "01:18:07",
      "start_timestamp_seconds": 4687.792207792208,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=4687"
    }
  },
  {
    "text": "long put, it's, you know, you're synthetically long call. I get it, you know, but for me, it's kind of it's not so, you know, part of it is, like I said, lever once you have hedge things out, then you do have that lever. Just like it's like you switch from being long stock to long calls. So obviously you can go out and do other things, but it's like my mind that's still kind of, you know, stock trader first building up this position for an extended move. And you know, avoiding, if you're always just long calls, because then you can, you know, you can take it to the logical extreme saying, well, why ever buy stock just always be long calls and your risk is always limited, but then there's all the, the K and all the rest you have to deal with. So it's always like that, you know, it's that interesting always that managing, it always comes down to that same kind of thing. So it's almost like I, in theory, I'm, I'm a long stock, but I'm switching to a long call when I feel it's a high risk situation, then I'm going back to long stock, you know, so, so I'm only, you know, doing that at certain points in time to minimize the drag of option decay, you know, so it's definitely, it's definitely something that I'm looking more and more into for sure. Yeah. And in your scenario, like, if",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 77,
      "start_timestamp": "01:19:47",
      "start_timestamp_seconds": 4787.532467532467,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=4787"
    }
  },
  {
    "text": "back to long stock, you know, so, so I'm only, you know, doing that at certain points in time to minimize the drag of option decay, you know, so it's definitely, it's definitely something that I'm looking more and more into for sure. Yeah. And in your scenario, like, if I were trading up a year plus thesis, I would use the equity myself. I would just forego the leverage. If there's something that I feel there's a propensity for a shorter term move, that's exactly when I would use options, because most of my directional plays, they're not to the same magnitude of what you're looking at. So a lot of the stuff I'm playing, it's typically expressed within three months, something like that. So I'll use six month options to gain the requisite exposure to it. But yeah, when I look at really good stock traders that can pick directions so well, I'm always just thinking, man, like your fucking pockets would just overfill with money. If we just use options, just sometimes, just, I like the sound of pockets over filling with money. It's a good, it sounds good. That's the sales pitch. That's the sales pitch to continue trying to convince people to move more into options is I'm going to bait everybody with the, you know, Scrooge McDuck gold coin bathtub. The truth is, you want me buying because you're selling, that's the truth. I know the way it works. Unfortunately, for those, for the",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 77,
      "start_timestamp": "01:21:27",
      "start_timestamp_seconds": 4887.272727272727,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=4887"
    }
  },
  {
    "text": "to continue trying to convince people to move more into options is I'm going to bait everybody with the, you know, Scrooge McDuck gold coin bathtub. The truth is, you want me buying because you're selling, that's the truth. I know the way it works. Unfortunately, for those, for the hedges that you're buying now, I probably am selling those. I know. I'm not selling this the 60 day plus because the thing in case it's just too slow. I want that faded a cave curve maximize, bro. I want that steep peak crashing. That's what I'm looking for. It's amazing, you know, because every strategy like has like such common themes, you know, so it's like, now I'm more trend focused now, but like I was a market maker for years. And it's like, I wasn't really focused on big trends in and out. And so, you know, you're trying to take that data to the K as a market maker, you're trying to take that spread over and over. And your mindset's so different. Whereas you're just like, you know, turn and burn, like as much as you can. It's all about like, you know, turn over and turn over and turn over. And so it's like, it takes dramatic changes of mindset. But at the end of the day, it's like, so the way you talk, it's like, I know exactly what you're thinking and what you feel like is I've done the same mindset just through",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 77,
      "start_timestamp": "01:23:07",
      "start_timestamp_seconds": 4987.012987012987,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=4987"
    }
  },
  {
    "text": "turn over and turn over. And so it's like, it takes dramatic changes of mindset. But at the end of the day, it's like, so the way you talk, it's like, I know exactly what you're thinking and what you feel like is I've done the same mindset just through express through a different vehicle, which was market making in a different way. But I totally get it. Well, and the cool part is is, you know, like, I always talk about finding something that aligns with you like, just the way you think about the world, right? Because I've told you this a million times, like, I've never seen a 300 year. I've never had that. But I've had two down years, my whole trading career from 2007, too. So the, like, just our games are different. And it's obviously the way that you think about markets and risk, like even to be able to build a 40 position and like individual stock man, like, I would struggle with that. If it wasn't some sort of like index ETF, Secretary ETF, like a really just something I would just was really, really convicted and but typically I can't find stuff that scratches that itch from me more often than not be like, ah, like you, I consider myself risk adverse. So I'd be like, fuck, how can I offset some of this risk? And well, if I'm in a Secretary TF or an index ETF, that gives me a",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 77,
      "start_timestamp": "01:24:46",
      "start_timestamp_seconds": 5086.7532467532465,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=5086"
    }
  },
  {
    "text": "stuff that scratches that itch from me more often than not be like, ah, like you, I consider myself risk adverse. So I'd be like, fuck, how can I offset some of this risk? And well, if I'm in a Secretary TF or an index ETF, that gives me a little diversification. So sure, that scenario. So I find these kinds of conversations. It's literally one of the reasons why I love talking to you so much because it puts a completely different approach in front of me. It's like completely different. And I think that that's one of the most beautiful things about trading, to be honest. I agree. I think trading, when you get deep into it, it's amazing on so many different levels, you know, and everyone has their profiles. I think a part of getting to consistent profitability is after trying many things and not wanting to listen to yourself, finally saying, okay, this is the way I'm built and this is how I can trade. Because if you try and do it with someone, like for example, like Bill O'Neill, what you know, again, like I love his stuff and I model my work around his, but you know, I've done my own history and a different things as well. But you know, like this guy, he was built different. Like I know from stories and even his son is spoken about it like in the 90s. He had he had 200 of his wealth,",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 77,
      "start_timestamp": "01:26:26",
      "start_timestamp_seconds": 5186.493506493506,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=5186"
    }
  },
  {
    "text": "his, but you know, I've done my own history and a different things as well. But you know, like this guy, he was built different. Like I know from stories and even his son is spoken about it like in the 90s. He had he had 200 of his wealth, which was already sizable in Amgen and it went on a 400 advance. And he made, I don't know how much money. I mean, you won't become a billionaire without you having that kind of size. But like for me, it's like, so I mean, you find I'm concentrated. And I sit back and I look at him and you know, they call him the ice man. They say he had ice in his veins because he was cool about it. Like he wasn't stressed about it. Like I'm probably more stressed with a 50 position than he was with a 200. But that's his care. I don't think I can sleep at night if I had 200 of my account in one stock. But that's where I'll build different. They're all built different. You know, so that's why that's why, you know, I always aim to be a legend. But that's why there's some people are legends and others are very good traders, good traders, you know, trying to be good traders and you know, they're the rest, you know, so it's you got to try and level up over and over. It's like a constant never ending battle",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 77,
      "start_timestamp": "01:28:06",
      "start_timestamp_seconds": 5286.233766233766,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=5286"
    }
  },
  {
    "text": "But that's why there's some people are legends and others are very good traders, good traders, you know, trying to be good traders and you know, they're the rest, you know, so it's you got to try and level up over and over. It's like a constant never ending battle to improve yourself. Yeah. And then there's the fucking degenerates like me that are just out here just doing whatever. We're just flopping around. Yeah. You talk yourself down too much, man. You talk yourself down too much. Yeah. It's I think the there, I really do think that there's fascinating cross section between like, can slim general style and options. I just haven't seen it done. Do you know anybody that does that? Not really. I think now, you know, options markets have become more liquid. Also, a lot of the stocks that like tend to be canceling are more liquid these days. But you know, originally, the S in Can slim, if you look at the early editions of the book, stood for small capitalization, which then eventually you changed the sales and all the rest there. But so small cap stocks don't work too well if you want liquidity and if you want options. It's hard enough to trade that already a lot of stocks have won't trade just because the liquidity is not there. And if you're taking on size and stuff that you don't want those gap moments where you can't get out of the",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 77,
      "start_timestamp": "01:29:45",
      "start_timestamp_seconds": 5385.9740259740265,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=5385"
    }
  },
  {
    "text": "want liquidity and if you want options. It's hard enough to trade that already a lot of stocks have won't trade just because the liquidity is not there. And if you're taking on size and stuff that you don't want those gap moments where you can't get out of the stock kind of thing. So I think that's why it hasn't really been done. But you know, it's the first time for everything, right? Markets keep evolving. It's like it's always the same game that just slightly evolves to creating new opportunities. Well, and I mean, like you're saying, we also see SMCI 300 stock doubling in two weeks. So maybe, you know, fuck the small cap stuff, you know, just fine. Apparently just fine 300 stocks. Yeah, I know. You know, and there are, you know, I would I find more impressive than that because you know, now it's becoming a little bit bigger market cap. But to see meta, which is already a monster stock, move up 20 on earnings, that is insane. Like what's the market cap that it picked up just to like never mind like SMCI. Yeah, there's there could be like, you know, I think you go from a 15 billion to 30 billion. You know, it's a surprise girl story. But to like put on 200 billion a market cap like overnight, like you know how incredible like I mean, that's got to be like the GDP of some countries like it's just",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 77,
      "start_timestamp": "01:31:25",
      "start_timestamp_seconds": 5485.714285714286,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=5485"
    }
  },
  {
    "text": "think you go from a 15 billion to 30 billion. You know, it's a surprise girl story. But to like put on 200 billion a market cap like overnight, like you know how incredible like I mean, that's got to be like the GDP of some countries like it's just incredible. Yeah, that's when I started. Yeah, because I was when I was looking at SMCI, I was just like, how many shares does this thing even have, right? What is it? Like 55, 55.8 million or something. It's like number of shares is like pretty damn small. And when I first was looking at it, I was like, wow, that's kind of novel because if you start looking at the other text, like how many shares does meta have just had a curiosity? Yeah, man, 2.5, 6, 2.6 billion. Yeah, a lot of shares. And obviously, yeah, massive. One other thing I did want to touch on quickly, I don't know if you still have a few minutes, but I would love to see if you'd be willing to walk us through maybe in a bridge version. I have plenty of time. I just don't want to keep you too long, but I'd love to see if you could give us like a Clifth Notes version or whatever of your process for evaluating these kinds of stocks. Sure, you know, maybe we can go over as we also spoke about kind of market direction, which I think would be",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 77,
      "start_timestamp": "01:33:05",
      "start_timestamp_seconds": 5585.454545454546,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=5585"
    }
  },
  {
    "text": "too long, but I'd love to see if you could give us like a Clifth Notes version or whatever of your process for evaluating these kinds of stocks. Sure, you know, maybe we can go over as we also spoke about kind of market direction, which I think would be helpful because one thing I've noticed about these kind of stocks, just, you know, growth in general, whatever, it's highly dependent on environment. You know, so like I always tell people and stuff, you know, like, yeah, the stock story is important, like SMCI is an important story, whatever. But these moves, no matter as good as a story is, these moves always happen in a conducive market environment. It's like it could be the best story in the world, but if the market's no good, the stock won't react till next quarter. So, like step one is you have to identify that healthy environment. So if you want to, I can share my screen real quick. Yeah, man, please. Where is it here? Okay. Can you see, there we go. There's meta up, right? So at the bottom, this is something I've been tracking now for a few years. This is basically these green and red bars shows the net highs or lows for the NAS. So basically, the number of 52 week highs today, minus number of 52 week lows, there's more highs. You got a green bar. If you have more lows, you got a red bar.",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 77,
      "start_timestamp": "01:34:45",
      "start_timestamp_seconds": 5685.194805194806,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=5685"
    }
  },
  {
    "text": "This is basically these green and red bars shows the net highs or lows for the NAS. So basically, the number of 52 week highs today, minus number of 52 week lows, there's more highs. You got a green bar. If you have more lows, you got a red bar. And it's such a simple tool, but this has become really, so obviously meta last year was like a vertical type of move. But if you take up, let's say, I don't know what kind of what stock can I bring up here. Let's say Shopify, okay. A stock that was a little less in its own kind of world of Nvidia or meta. I mean, you can really see all the weakness comes in the stock when we kind of move from this period of net highs back to net lows. You get all these bad breaks. And then as soon as the market becomes conducive and more stocks are breaking out, you see these very nice powerful trends. So for me, like the first step, and this I think goes to show, regardless of what the QQQ is doing, because again, it's been kind of in its own world. Let me just move this up a second. If you take a look at just internally, what most things are going on, this has been a very difficult time for someone looking for trends, because you have these short cycles of, you know, a good environment, more stocks making",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 77,
      "start_timestamp": "01:36:24",
      "start_timestamp_seconds": 5784.935064935065,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=5784"
    }
  },
  {
    "text": "world. Let me just move this up a second. If you take a look at just internally, what most things are going on, this has been a very difficult time for someone looking for trends, because you have these short cycles of, you know, a good environment, more stocks making new highs. And all of a sudden, most stocks are making new lows. And this is rare. So most people will look at this and be like, that just must be how the market is. Generally, if you take a look, you go back, like this is the COVID bull market, solid bank of green. If you go back further, you can see this is like that 2016 to 2018 period, you know, you can call it the Trump rally. And then after that, like this was a solid bank of green. So more stocks doing better than not. Let me bring up the QQQ to go back further. One second. Which one fact that I've been trading QLD a bit. And it's because when I normally run the coverage triangle, it's in something like IWM, which has been lagging hard. And I was like, I need exposure to something that's working. So yeah. Yeah. No, so I just say that so in healthy markets, you will see these sizeable trends in their highs. It's just the way markets function. So this has been a tricky market because it's been led by the few. Yeah. I mean, most stocks obviously",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 77,
      "start_timestamp": "01:38:04",
      "start_timestamp_seconds": 5884.675324675325,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=5884"
    }
  },
  {
    "text": "that's working. So yeah. Yeah. No, so I just say that so in healthy markets, you will see these sizeable trends in their highs. It's just the way markets function. So this has been a tricky market because it's been led by the few. Yeah. I mean, most stocks obviously are off the lows of where they were in 2022. But the powerful moves, like the sustained moves have been in the few. But getting this right, like learning went to operate in these environments of net progress. That's where all the fireworks come up. So what I did was if you go even a step further and this is what really was kind of eye opening for me, we can overlay the same kind of color coding right onto the charts. Let me just kind of, and these are free tools I publish for anyone who wants them. They're called US markets net highs lows. And this is the overlay if you want to overlay it on the charts. So if anyone who wants to kind of add this and trading view, you can just add it on. So if you bring up, for example, like Amazon, this is something that I found really interesting. If you go back in time, and here, let me just kind of take off the rest of this noise, all the averages and all the rest and minimize this. So the interesting thing is if you put a log chart and you look",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 77,
      "start_timestamp": "01:39:44",
      "start_timestamp_seconds": 5984.415584415585,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=5984"
    }
  },
  {
    "text": "something that I found really interesting. If you go back in time, and here, let me just kind of take off the rest of this noise, all the averages and all the rest and minimize this. So the interesting thing is if you put a log chart and you look at, okay, Amazon's been one of the great kind of girl stories the past 20 years obviously. Where did all of the good happen? Where did all the bad happen? So all of the like the lengthy advances always took place with net highs, all of the pain, the sharp drops. And this is a log scale. So these are, recently sharp drops all take place when the market environment's not conducive or all the sideways volatility happens when the market's not conducive. And you can see here all of the big drops. So getting the environment right is so key. And even if you look at Monster Beverage, which is again, one of the great market winners, if you take a look at its massive early advance, this is such a cool chart to look at. So this stock goes from when they invented the monster drink from this is split adjusted, but from like four cents to like four dollars, I mean, unbelievable move, right? So you're almost going vertical. Where are the few times this thing actually stops the catch its breath? It's when the market turns sour. So you have the stock that's going up like",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 77,
      "start_timestamp": "01:41:24",
      "start_timestamp_seconds": 6084.1558441558445,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=6084"
    }
  },
  {
    "text": "is split adjusted, but from like four cents to like four dollars, I mean, unbelievable move, right? So you're almost going vertical. Where are the few times this thing actually stops the catch its breath? It's when the market turns sour. So you have the stock that's going up like a hundred fold. But when the market goes sour, it still puts it into sleep. So for me, that became just a really kind of like a light bulb moment. And I've looked at so many different tools. This is something like I know like Willem O'Neill will have his fall through day and distribution days and people use averages and all the rest. But you're relying a lot on the index and the index is now are far more skewed than they've ever been. I mean, like that's just a statistical fact. And there's never been a time with the SP 500 at all time highs and the Russell still in a bear market minus 20s never happened before. So this is it is unique times in that respect. But if you're not just trading that if you're not playing just the game of being in the markets and you're trying to find, you know, those big growth names, those big movers, adapting to those healthy environments is when all the fireworks happen. And you can see it. If you any kind of stocks you bring up, let me think of even just like for example, Square, we were",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 77,
      "start_timestamp": "01:43:03",
      "start_timestamp_seconds": 6183.896103896104,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=6183"
    }
  },
  {
    "text": "you're trying to find, you know, those big growth names, those big movers, adapting to those healthy environments is when all the fireworks happen. And you can see it. If you any kind of stocks you bring up, let me think of even just like for example, Square, we were talking about Square before. I mean, when did this stock get back into gear? It's when the market turned healthy and you have this big powerful move up. When did it get smoked every time when the market wasn't working? And it's only amplified by whether or not it's a quality stock or not. So if you bring up let's say SMCI, which is under heavy, heavy accumulation now, where do the monster moves happen? Well, they happen when the market was also conducive. So like really first step before you're making any other kind of decision for me at least is I'm going to be wanting to kind of get very aggressive when the markets are already healthy. And for me, just logically, if more stocks are making 52 week highs and 52 week lows, there's more accumulation. It's the most like kind of basic test of whether or not you have a healthy market or not. It's not market cap weighted. It's not even you know, advanced decline where you could say like, you know, it was a stock only up 10 cents today. Like no, did the stock make higher prices in any other time in the",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 77,
      "start_timestamp": "01:44:43",
      "start_timestamp_seconds": 6283.636363636364,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=6283"
    }
  },
  {
    "text": "not you have a healthy market or not. It's not market cap weighted. It's not even you know, advanced decline where you could say like, you know, it was a stock only up 10 cents today. Like no, did the stock make higher prices in any other time in the past year? Someone's buying that stock. Is this stock breaking to new lows with the past year? Someone wants out of that stock is I find it's the most kind of basic and pure measure. And it's one that's been very helpful for me to navigate, which was a really kind of back and forth year last year for someone trying to do trend following. It was tough. Yeah, it's a really, really cool tool, especially the overlay question for you. Do you have a perspective on the duration that starts to become more meaningful if we're in net highs or net lows? Right. So obviously, these are like highlighting if there's like three days in a row, but some of them are very brief and some of them obviously are quite wide. Is there a duration where you're like, okay, we're starting to see like a clear net high trend being set here? So it's hard to know ahead of time. Usually if you're overlaid this with interest rates, especially high yields, you'll see a really strong correlation. So really, I mean, that link yields in the markets always been always will be. But kind of beyond looking for",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 77,
      "start_timestamp": "01:46:23",
      "start_timestamp_seconds": 6383.376623376624,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=6383"
    }
  },
  {
    "text": "trend being set here? So it's hard to know ahead of time. Usually if you're overlaid this with interest rates, especially high yields, you'll see a really strong correlation. So really, I mean, that link yields in the markets always been always will be. But kind of beyond looking for that, what I found to be more meaningful is if you actually kind of break this, if you double click on this, you can instead of seeing the net number, you can see both the highs and the lows. So if you kind of plot it like this, you won't see the net, you'll see the number of highs and lows. I found that rather than looking for like how many days or duration or whatever, if you kind of, let me just get the right number there. One second, let me put a horizontal line. I found when you have about 50 or more net new highs, you're probably in a healthier environment. So you'll, let me kind of take off the polka dot stripes for a second. But if you take a look, if you kind of ignore the background and you look at just like the environments when you have, you know, you're have 50 or more stocks making new highs, that's a good secondary test. So there are sometimes where the market is just kind of generally quiet and like, yeah, maybe there's, you know, 17 new highs and only six new lows on that day.",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 77,
      "start_timestamp": "01:48:03",
      "start_timestamp_seconds": 6483.1168831168825,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=6483"
    }
  },
  {
    "text": "when you have, you know, you're have 50 or more stocks making new highs, that's a good secondary test. So there are sometimes where the market is just kind of generally quiet and like, yeah, maybe there's, you know, 17 new highs and only six new lows on that day. But there's no meaningful direction in either way. So I noticed that the really good bull markets, not only do they have more highs and lows, but you can see here, for example, in 2020, 2021, like you're meaningfully above 50 stocks, making you 50 to week highs each day. So I kind of use those two to bounce to kind of gauge whether the signals is a little more valid or not. And for me, it's not like again, an all or nothing, like, oh, net highs, I've got to buy 100. It's like, okay, let's look now to start building those positions. And the market feedback will guide you further. Do you have a preferred exchange to focus on? It's funny that you have this because I have a similar version of net highs and lows. I don't have the cool color coding, mines and thinkerswim, but I actually use two moving averages with mine. I use like a 50 period and then a 21 period. Oh, no, a 150 period and a 21 period moving average. Have you ever first tinkered with any moving averages with this? Or do you use that fixed level of 50? I",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 77,
      "start_timestamp": "01:49:42",
      "start_timestamp_seconds": 6582.857142857142,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=6582"
    }
  },
  {
    "text": "actually use two moving averages with mine. I use like a 50 period and then a 21 period. Oh, no, a 150 period and a 21 period moving average. Have you ever first tinkered with any moving averages with this? Or do you use that fixed level of 50? I have, but then I found like the lookback period makes a difference for fast moving like, you know, it's interesting. If you look at let's say market breakdowns, let me just bring up, let's a cute, cute again. And right, you know, if you have a lot of positions on market breakdowns, happen fast and you want to be cognizant of those. So this kind of like saved me in 2020 because if you take a look at when that top came in and the whole COVID thing was starting, by looking at just the net number, if there's like a dramatic shift in the markets, it will show up right away. And that's why I like to often also break the numbers apart. Is it, are we getting a net number because just, you know, there's no new highs today, the markets taking a pause or the market breaking down. You can really see when that bridge move started, you can just see how even on the first day or two, you had a surge of stocks making 52-week lows. I mean, like you were three or four days from the bull market high, but you almost had the",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 77,
      "start_timestamp": "01:51:22",
      "start_timestamp_seconds": 6682.597402597402,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=6682"
    }
  },
  {
    "text": "down. You can really see when that bridge move started, you can just see how even on the first day or two, you had a surge of stocks making 52-week lows. I mean, like you were three or four days from the bull market high, but you almost had the same number of lows as you had during the depth of the correction of the summer before before when I mean, these were extreme figures obviously. So rather than use the moving averages, I'll just kind of look at those levels and I'll dial in to see like, okay, is this a normal pause because stocks are taking a break? It's been a hot run or are we seeing an increase as well under the hood and new lows breaking down? To me, that's kind of how I like to implement it. Yeah, yeah, that's actually really, really cool. And then do you have a preferred exchange that you focus on? I see this as the NASDAQ. Yeah, this is NASDAQ. I found NASDAQ because again, that probably comes down to style for my style where I'm looking for high-grow NASDAQs more representative. Some people like to put them all in there, which you have that option if you want them to mix or if some people say like, look, if I was someone focusing more on slower moving stocks for a com or portfolio, I would use NYSE. So I think it just depends the flavor you're looking for.",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 77,
      "start_timestamp": "01:53:02",
      "start_timestamp_seconds": 6782.337662337662,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=6782"
    }
  },
  {
    "text": "in there, which you have that option if you want them to mix or if some people say like, look, if I was someone focusing more on slower moving stocks for a com or portfolio, I would use NYSE. So I think it just depends the flavor you're looking for. But I found the NASDAQ maybe because the more sensitive stock gives the earlier signal, I find it's helpful to look at the NASDAQ, but that's my personal preference. That's a good way to frame it as well. That would actually be the statistical side of my mind would be so fascinated to do like run a study between the two of them in terms of their predictive capabilities, like the different exchanges. But that's one of the cleanest ways I can think of the measure broad market sense mix. You know, people spend, I find a lot of time chasing their tails, right? They're like, what what what what is this economic? What's m2 doing? What's the yield inversion? Like there's a lot of stuff you could look at. And the cool part is at least from a trading perspective, most of that is going to be baked into what you're seeing here. I agree. And you know, like I'll always talk well of Bill O'Neill because I, you know, I was so fortunate to meet him in 2010 and I think he's done amazing things and all the rest. But you know, to be, I don't want to",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 77,
      "start_timestamp": "01:54:42",
      "start_timestamp_seconds": 6882.077922077922,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=6882"
    }
  },
  {
    "text": "what you're seeing here. I agree. And you know, like I'll always talk well of Bill O'Neill because I, you know, I was so fortunate to meet him in 2010 and I think he's done amazing things and all the rest. But you know, to be, I don't want to say critical, but I think just markets change. You have to be aware of tools like one of the tools he taught and used for many years was the distribution day concept where, you know, if the market kind of came down more than 0.2 on increased volume and he had all these kind of rules. First of all, if you had four days in a 20 day window, then five, then six, because markets change, it just kind of stopped working. Like I found as an effective tool. So I mean, so sometimes, you know, I find like you said, this is just such a simple to the point tool that doesn't require complex analysis. And at the end of the day, yeah, even if it's lower quality stocks breaking down and you know, you could say, I'm in a higher quality stock, those are kind of like the canaries in the coal mine. Like, yeah, you know, maybe a stock doesn't have to go up, but it doesn't have to break down. If stocks are actively being sold down to 52 week lows, there's some kind of problem if it's happening on a wide, wide basis. So I",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 77,
      "start_timestamp": "01:56:21",
      "start_timestamp_seconds": 6981.818181818182,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=6981"
    }
  },
  {
    "text": "canaries in the coal mine. Like, yeah, you know, maybe a stock doesn't have to go up, but it doesn't have to break down. If stocks are actively being sold down to 52 week lows, there's some kind of problem if it's happening on a wide, wide basis. So I find this has just been the most helpful tool for me to navigate, which, you know, the markets, which have been some pretty abnormal times with between inflation, the spread between large caps, small caps and all the rest is it's been it's been a weird couple of years, man. You massively so at least from an option trading perspective, though, it's kind of nice. I know for you guys, it's not so much sorry about that, but last year was fantastic. Yeah, I can imagine. I can imagine. And you know, that's a frustrating thing because you look at the QQQ and you say, wow, last year was the best year ever for certain names, but if you kind of like look around, I don't want to say our confesses the best gauge, but there I feel like there's no great gauge for just growth in general. I mean, look at the just up, down up. I mean, if you weren't quick to take a profit somewhere, you were smoked so many times, even if you look at the say the QQQJ, the next 100 largest stocks outside of the Nasdaq 100, I mean, just take a look at",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 77,
      "start_timestamp": "01:58:01",
      "start_timestamp_seconds": 7081.558441558442,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=7081"
    }
  },
  {
    "text": "look at the just up, down up. I mean, if you weren't quick to take a profit somewhere, you were smoked so many times, even if you look at the say the QQQJ, the next 100 largest stocks outside of the Nasdaq 100, I mean, just take a look at the back and forward. And that's fine. But if you're someone who's trying to play trend, that's a difficult market to work with because by the time you put your positions on, the trends over two weeks later, and it's like a V top. And if you aren't if you aren't quick on your feet, and if the individual stocks you hold are the wrong stocks, and you don't cut your losses, I mean, there can be some dramatic moves against you, things like, I mean, we always look at what worked out well, but you have to understand the risk you're taking, like for example, digital ocean, you can see my by original kind of like, oh, is this something going on in the bad earnings and from 46, you're 18 or 19, and it's another cloud stock, but it's smoked, right? So you have to know what you're dealing with, how to work with it. There's big upside, but there's also downside. You got to manage it to with them for sure, for sure. It looked like it could have been a cup with handle, and then the handle just fell off. Yeah, well, there's some, you know,",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 77,
      "start_timestamp": "01:59:41",
      "start_timestamp_seconds": 7181.298701298701,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=7181"
    }
  },
  {
    "text": "dealing with, how to work with it. There's big upside, but there's also downside. You got to manage it to with them for sure, for sure. It looked like it could have been a cup with handle, and then the handle just fell off. Yeah, well, there's some, you know, there's some things that were just too deep of a move. And it was something like this, you're just watching and nothing to do, and then all of a sudden you just kind of die. So we'll see what happens. I, but again, look, you know, when did the mark, when did it, when did it fall apart, when the market went sour, and when did it start to come back when the market turned healthy again? So that's just the, the power of, of knowing your market environment is really, really important. Yeah, and what, one of the things that your net high's lows have that mine doesn't that I really, really like, and I think it adds a lot of clarity, um, is both sides of it together, because the way that mine's coded right now, I'm, I'm literally, after we get off, I'm literally going to see how to change mine to see if I can add like that lower part, because that's, that's such a, a really great perspective. I feel like it adds a lot to it. Um, yeah, because mine right now, obviously, is just tracking the net highs and how many are net",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 77,
      "start_timestamp": "02:01:21",
      "start_timestamp_seconds": 7281.038961038961,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=7281"
    }
  },
  {
    "text": "how to change mine to see if I can add like that lower part, because that's, that's such a, a really great perspective. I feel like it adds a lot to it. Um, yeah, because mine right now, obviously, is just tracking the net highs and how many are net lows and how many? Well, I think a good example, just like more recent, is he at the beginning of the year? I mean, we had a really hot market coming off of October when pretty vertical, even let's say, we'll bring up, uh, I WM just to give like, uh, a less concentrated perspective. We had this really hot move. And then we had this pullback, but the pullback was really just because the number of stocks making new highs took a break. Yeah, he had a little bit of a pickup and, and, and new lows, but nothing dramatic. So this, you know, that's why for me, I was still, you know, state bullishly position was looking to add to things and all the rest, you know, and it's, you haven't seen a massive breakdown and look, look at other points in time where things got a lot messier, a lot, a lot quicker. So I think it's important to look under the hood too. It provides that added value. Yeah, yeah, that's absolutely awesome. Well, dude, thank you so much for walking through that. I absolutely love that. I think on, on our next session, it would",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 77,
      "start_timestamp": "02:03:00",
      "start_timestamp_seconds": 7380.779220779221,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=7380"
    }
  },
  {
    "text": "messier, a lot, a lot quicker. So I think it's important to look under the hood too. It provides that added value. Yeah, yeah, that's absolutely awesome. Well, dude, thank you so much for walking through that. I absolutely love that. I think on, on our next session, it would be cool to work through like a couple, maybe like a stock or two and to see how you piece this whole thing together into the, you know, the MacRusso special. And yeah, I think I would, I would really just love to, to run through that process with you because the one of the things I find really interesting about the way that you and I both trade is that there are, with all traders, there's so many similarities, but then there are key departures that send us into me using derivatives and you sticking primarily equities, but the way that you're looking at broad market trend analyzing sub trends and whatnot, those are all like very native to me, but I think a big difference in something I would love to really dive into with you is like your capability to find these things that are like spring coil to, whereas I'm using leverage to create decent returns on much smaller moves. Maybe it's just because I'm a lazy to generate. So I just use fake online money to make money, but you're looking for actual moves. As long as you fill those pockets up, that's a matter,",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 77,
      "start_timestamp": "02:04:40",
      "start_timestamp_seconds": 7480.519480519481,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=7480"
    }
  },
  {
    "text": "coil to, whereas I'm using leverage to create decent returns on much smaller moves. Maybe it's just because I'm a lazy to generate. So I just use fake online money to make money, but you're looking for actual moves. As long as you fill those pockets up, that's a matter, Eric. I tell you what, that is what I tell myself because I love trading, but as long as it, you know, keeps making dollars, it makes sense to me. That's it, that's it, that's the way. Well, dude, thanks for hanging out. I will obviously throw all of your socials in the notes below, but if there is any specific thing that you want to drive people to, I'd love to hear it. I know you're on YouTube, I started YouTube channel as well, the Crucial Insights, or Twitter, a trader underscore M-Cruise, so those are the two, that along with my website, CrucialInsights.com. So, I don't even want to learn a little more, those are the places you can find me at. You're absolutely pleasure as per always. Thank you for hanging out, man. Thanks so much, man. Appreciate it. Thanks for having me on. Yep. Take care.",
    "metadata": {
      "video_id": "LspC6Wx0QA8",
      "title": "CANSLIM Technical Analysis & Options with Matt Caruso | The Outlier Podcast Ep58",
      "url": "https://www.youtube.com/watch?v=LspC6Wx0QA8",
      "upload_date": "",
      "duration": 4458.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 77,
      "start_timestamp": "02:06:20",
      "start_timestamp_seconds": 7580.25974025974,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=LspC6Wx0QA8&t=7580"
    }
  }
]