[
  {
    "text": "Everyone, Eric here with part three of the small stack segment. And this one I want to outline my strategies, kind of what I'm looking to employ here. So nothing new. It's going to be cash secured puts to covered calls to cash secured strangles, diagonals, and maybe some verticals. So let's walk through what I'm looking at. The cash secured put covered call covered strangle I bucket those all together because they're very fine. This is going to be essentially my staple strategy for the put side. I'm going to be looking at point two to point three deltas. And it's because I want to balance probability of being assigned. I want to avoid assignment, but I also don't want to roll that much. So to work around that, that's why I'm looking at point two point three deltas. I would like to add to this, make sure that I'm getting at least one percent return on invested capital. And once I am assigned for the covered calls, I'm going to make sure that the short strike is above my basis period. So if there's a point where I can't sell calls above my basis, I'm just going to hold. Unless it hits my downside management, which is going to be anything greater than a 10 drop would be a candidate to sell. I will take a look at it. If I still have strong convictions, then I will likely hold on to the product longer term. But once",
    "metadata": {
      "video_id": "luhrNt11h0o",
      "title": "Strategy Outlines - Small Stacks Pt3",
      "url": "https://www.youtube.com/watch?v=luhrNt11h0o",
      "upload_date": "",
      "duration": 413.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=luhrNt11h0o&t=0"
    }
  },
  {
    "text": "hold. Unless it hits my downside management, which is going to be anything greater than a 10 drop would be a candidate to sell. I will take a look at it. If I still have strong convictions, then I will likely hold on to the product longer term. But once I hit 10 draw down, I'm going to take a look if I am long stock. Or either the puts or calls, I'm going to look at managing 55 max profit. Or once I get within that 20 days to expiration, probably closer to 17 18 days. So I want to try to squeeze a little bit more out of these. Now, the other thing for managing, unlike my regular account in this scenario, I'm going to make sure that I can find a suitable replacement that is going to provide me a larger dollar amount. Then what is left in the current trade. So for example, if I sell a little put for 50 cents. And there's, you know, 22 cents left on the table. If I can find a trade that's going to give me more than 22 cents and I like it, then I can manage this and enter another trade. But I need to have a replacement in mind. Otherwise, whether I hit that 55 or greater, I'm going to leave the trade on. The reason I have minimized rolling here is I, smaller accounts don't have a lot of capital. So if I continue to",
    "metadata": {
      "video_id": "luhrNt11h0o",
      "title": "Strategy Outlines - Small Stacks Pt3",
      "url": "https://www.youtube.com/watch?v=luhrNt11h0o",
      "upload_date": "",
      "duration": 413.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=luhrNt11h0o&t=0"
    }
  },
  {
    "text": "and enter another trade. But I need to have a replacement in mind. Otherwise, whether I hit that 55 or greater, I'm going to leave the trade on. The reason I have minimized rolling here is I, smaller accounts don't have a lot of capital. So if I continue to roll puts too much, you have to remember each time you roll put, you're going to book a loss. And on smaller accounts, that loss can add up. And a lot of folks get confused where money goes. But in short, you have your net liquidating value, which is your account. And then you have your cash and sweep. And when you roll your net liquidating value goes down because you're booking a loss. Although your cash and sweep will go up as long as you're pulling in a credit. So sooner or later you can find yourself in a scenario where your net liquidating value is zero, even though your cash and sweep can have a bunch of money in it because you've been rolling for a long time. That sort of thing we want to avoid that. I want to avoid that. So that's why I'm going to roll cautiously. That doesn't mean I'm not going to roll it all. The reason why I say minimize it is because in my current portfolio, all roll trades forever. So I'm not going to apply that thought process. So this is general rundown of those strategies. I obviously have them",
    "metadata": {
      "video_id": "luhrNt11h0o",
      "title": "Strategy Outlines - Small Stacks Pt3",
      "url": "https://www.youtube.com/watch?v=luhrNt11h0o",
      "upload_date": "",
      "duration": 413.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=luhrNt11h0o&t=0"
    }
  },
  {
    "text": "roll cautiously. That doesn't mean I'm not going to roll it all. The reason why I say minimize it is because in my current portfolio, all roll trades forever. So I'm not going to apply that thought process. So this is general rundown of those strategies. I obviously have them in my options. I'm going to run segment. So you already can, you know, see a thorough rundown of these. This is just some general outlines. Next for the diagonals. Mostly going to trade them like a cover call. I'm going to be looking for the long to be at least 90 days to expiration. This is a good return on the extrinsic value. And it's going to make sure that the trade has a little bit of time to work out. I likely will be targeting six months at a true minimum or a leap. The long is going to need to be at least a 80 delta. I'm going to look closer to 85 or 90 depending on price and. Overall, I'm not expiration. The reason why I like such a long well, such a high delta for my long is because I want to minimize slash eliminate upside risk. I want to be able to sell calls aggressively. So I can collect more money in order to eliminate that upside risk. I got to make sure I have a high delta on the long otherwise sooner or later. Short call delta will overwhelm the long delta if",
    "metadata": {
      "video_id": "luhrNt11h0o",
      "title": "Strategy Outlines - Small Stacks Pt3",
      "url": "https://www.youtube.com/watch?v=luhrNt11h0o",
      "upload_date": "",
      "duration": 413.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=luhrNt11h0o&t=0"
    }
  },
  {
    "text": "upside risk. I want to be able to sell calls aggressively. So I can collect more money in order to eliminate that upside risk. I got to make sure I have a high delta on the long otherwise sooner or later. Short call delta will overwhelm the long delta if it's a short if it's. If the long delta isn't high enough and then that's where you find upside risk. The other thing is I want to pad myself in case the underlying move a little bit against me. I don't want to find myself in a scenario where I then cannot sell short calls close to the money because of this. I also am going to look to short at a ratio. So the short strikes. I want to uncap my upside, essentially. And the other thing that's not on here is scaling in. I want to pick products that I can sell. I'm sorry that I can buy at least two leaps. And well, not necessarily leaps too longs. And I will look to establish with half up front and then add that other. Long option, you know, sometime in the future, depending on what the market throws in. And then the last piece is I'm going to be looking at things that on a three month or six month chart are trading around or a little bit lower than their mean yet are still strong. So fundamental analysis is going to be important for this strategy. And",
    "metadata": {
      "video_id": "luhrNt11h0o",
      "title": "Strategy Outlines - Small Stacks Pt3",
      "url": "https://www.youtube.com/watch?v=luhrNt11h0o",
      "upload_date": "",
      "duration": 413.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=luhrNt11h0o&t=0"
    }
  },
  {
    "text": "in. And then the last piece is I'm going to be looking at things that on a three month or six month chart are trading around or a little bit lower than their mean yet are still strong. So fundamental analysis is going to be important for this strategy. And lastly, verticals, probably not going to trade many if any. And essentially the only time I'm going to look to put these on is if I have a strong short assumption that I want to play out. And for these, I am going to make sure I have good expectancy probably wouldn't trade larger than a dollar wide and on those I'm going to collect at least 30 cents. I'm going to be looking at trading of 40, 40 delta and down. But again, I'm not expecting to see a lot of these, however, not writing them off completely. So that wraps up a general overview of the strategies I'm looking to use. If you have strategies that you like to use in your smaller count that I didn't cover, let me know. Again, that's the point of all this so that we can learn from another. All right, catch you all later.",
    "metadata": {
      "video_id": "luhrNt11h0o",
      "title": "Strategy Outlines - Small Stacks Pt3",
      "url": "https://www.youtube.com/watch?v=luhrNt11h0o",
      "upload_date": "",
      "duration": 413.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=luhrNt11h0o&t=0"
    }
  },
  {
    "text": "you all later.",
    "metadata": {
      "video_id": "luhrNt11h0o",
      "title": "Strategy Outlines - Small Stacks Pt3",
      "url": "https://www.youtube.com/watch?v=luhrNt11h0o",
      "upload_date": "",
      "duration": 413.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=luhrNt11h0o&t=0"
    }
  }
]