[
  {
    "text": "What's up outliers? Bit of a mixed bag out there today and the market is giving you a heads up. That's what I see. So I want to talk about two main topics today. The first one is going to be the tech sector again. So I specifically want to talk about SMCI and Nvidia. And then we will take a look at some broader market scans to help people look for some opportunities out here. So and then at the end of the video, I will poke through GameStop and see if anything's going on in there. But let's dive right in. So we're at a really interesting point in the market. We can clearly see a downtrend starting in Q's. Whether this again, stabilizes at some point is TBD. But as I was recently talking about in the video yesterday, this needs to be a higher low. And right now, it's not right now. It's still trending down even though today was an update. It opened a gap lower and then closed higher, but it's still a down day. So I think here we really, really need this to stabilize if I'm to believe that this is the continuation of an uptrend versus the assumption of a downtrend. Now when I look at it from a qualitative perspective, I'm seeing broad changes going on right now. So I'm seeing things like SMCI get downgraded. I'm seeing things like Nvidia, which is a disproportionate, an alarmingly disproportionate proponent of",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=0"
    }
  },
  {
    "text": "continuation of an uptrend versus the assumption of a downtrend. Now when I look at it from a qualitative perspective, I'm seeing broad changes going on right now. So I'm seeing things like SMCI get downgraded. I'm seeing things like Nvidia, which is a disproportionate, an alarmingly disproportionate proponent of the entire stock market at this point. It's kind of wild. If you look at the SP 500, I was just looking at this on a live stream recently and it surprised me a little bit. So if you take a look at the SP 500, so we'll just look at Spy and we look at this. Back is 30 now. It used to be in the 20s and I thought that was heavy. Now it's over 30. And if we take a look in video in and of itself is 5.7. Then we have Microsoft and Apple, which all of those are fairly well correlated. What I'm trying to highlight is the overwhelming majority of the SP 500 falls clearly within the top 20 holdings within the top 10 specifically, but the top three are in outsized input to this entire index, like over 20. Just for these three stocks. So make sense, they're massive stocks, but it's almost like Spy is starting to kind of become like another tech stock. And that's just because of how successful tech has been. Okay. And that's all of this matter. It matters because when I look at the broad market now",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 18,
      "start_timestamp": "00:01:37",
      "start_timestamp_seconds": 97.97777777777777,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=97"
    }
  },
  {
    "text": "stocks. So make sense, they're massive stocks, but it's almost like Spy is starting to kind of become like another tech stock. And that's just because of how successful tech has been. Okay. And that's all of this matter. It matters because when I look at the broad market now and I see tech starting to roll over a little bit that gives me flashing warning signs, not that we're crashing again as much as it would be better for the YouTube channel for me to tell you that the sky is falling and to go stock up on canned foods because it's all coming to an end. I don't think that way. I'm actually pretty optimistic in general. I just look at this as a little bit of an inflection point and it's going to dictate where I want to put my money. So when I look at something like this, I'm not actually scaling in to a bunch of positions, although I did add to the my SP 500, my futures positions there a little bit. I'm just trying to maintain some sort of broad core exposure here because other than that, I don't have exposure in cues. And I don't have exposure in Russell, which I kind of want exposure in both, but I can't rationalize it. So if we take a look at NASDAQ futures or again, cues, whatever you want, it doesn't look great. It doesn't look terrible, but this also isn't the place that",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 18,
      "start_timestamp": "00:03:15",
      "start_timestamp_seconds": 195.95555555555555,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=195"
    }
  },
  {
    "text": "And I don't have exposure in Russell, which I kind of want exposure in both, but I can't rationalize it. So if we take a look at NASDAQ futures or again, cues, whatever you want, it doesn't look great. It doesn't look terrible, but this also isn't the place that I want to start scaling into things. As I've talked about before, I see a lower high. I see the climbing low that again, we need to see if this gains a footing and starts to consolidate a little bit before like this kind of scenario. But even if it starts consolidating, we have to be ready for it to reverse and start finding its way back down again. This is just clearly a point where things are not in a defined trend. And this is where it's really easy to get stuck. You know, you can get stuck in a few different ways. The first ways you can get stuck by analysis paralysis, looking at this saying, I don't know which way it's going to go. Who does? And then not putting anything on. That's one way you get stuck. The other way you get stuck is if you're trying to use some sort of momentum following strategy, you're using moving average crossovers. And this is one of the most frustrating periods for those kinds of strategies because it's above, it's above, it's above, it's below. And as you're entering an exiting, you're realizing PL on those entrances and",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 18,
      "start_timestamp": "00:04:53",
      "start_timestamp_seconds": 293.93333333333334,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=293"
    }
  },
  {
    "text": "trying to use some sort of momentum following strategy, you're using moving average crossovers. And this is one of the most frustrating periods for those kinds of strategies because it's above, it's above, it's above, it's below. And as you're entering an exiting, you're realizing PL on those entrances and exits that impact your account. So then the question becomes, well, what looks good here? Well, as I've already talked to you about before, there's still a lot of stuff that looks good that's still continuing to hold up. So XLF is definitely holding on here. XLI is starting to fall off. XLP hitting new highs. I just put on another position within this sector specifically for this reason. XLRE just hit another new high. XLU just hit another new high. XLV just hit another new high. So I'm highlighting these same sectors. This is like a week in a row now that I'm talking about these same sectors giving where at least I'm finding strength because even though the broad market and the golden goose that we typically would migrate towards being XLK is not looking healthy. There's other stuff that's doing well. So that's what I think from a broad perspective. We need to figure out what tech wants to do here. And I don't know if tech knows what tech wants to do here. And until it starts to sort itself out, that's not where I'm looking to start piling money. From a broader trend perspective, we",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 18,
      "start_timestamp": "00:06:31",
      "start_timestamp_seconds": 391.9111111111111,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=391"
    }
  },
  {
    "text": "a broad perspective. We need to figure out what tech wants to do here. And I don't know if tech knows what tech wants to do here. And until it starts to sort itself out, that's not where I'm looking to start piling money. From a broader trend perspective, we just had SMCI get downgraded after lackluster earnings. Again, it actually missed on EPS estimates, which is really not good. It came in at 625. It was expected at 7.3 was that. Let's see. 7.63, my bad. And it then just got downgraded recently by Barclays, which again, these analysts upgrades downgrades. I don't put too much stock in it. I guess to throw bad pun out there. But it does matter because other people use it. That's kind of the funny thing about markets. Even if I don't really think much about the analysts upgrades downgrades, if the market believes it, then it doesn't matter if I believe it or not, it has the ability to move the market. And that's for a bunch of different reasons. It's not always because, oh, we think the analysts are right. It's because people that hold things like SMCI in their funds have to justify on a quarterly basis why they hold what they hold. And then they start to look not great if they're holding a bunch of things that aren't being upgraded by analysts. They look like they're death tone. And I think it's more conservative for a lot of",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 18,
      "start_timestamp": "00:08:09",
      "start_timestamp_seconds": 489.88888888888897,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=489"
    }
  },
  {
    "text": "have to justify on a quarterly basis why they hold what they hold. And then they start to look not great if they're holding a bunch of things that aren't being upgraded by analysts. They look like they're death tone. And I think it's more conservative for a lot of those kinds of entities to not hold something that's not being recommended generally. And we can see that because, I mean, take a look at the follow through. It's just been some sale volume. Now again, sooner or later, I think this will hit a level that people get interested in. But we've had a precipitous decline, a massive decline over six months from 1229 down to 400, massive, massive decline. So that doesn't look great. And this impacts the broader tech picture because people are looking at stocks like SMCI, thinking this is part of the future. This is part of how we're going to see AI servers coming out rolling out in the future, which is supposed to be a giant, giant profit driver. I still think AI is a massive value driver. But it takes time for these things to materialize. And right now it's not there. So SMCI is getting punished. And then if we take a look at something like Nvidia, which we already talked about this a few times. So I'm not going to go over their earnings and stuff, but this still doesn't look good either. It doesn't look bad. Again, I want",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 18,
      "start_timestamp": "00:09:47",
      "start_timestamp_seconds": 587.8666666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=587"
    }
  },
  {
    "text": "So SMCI is getting punished. And then if we take a look at something like Nvidia, which we already talked about this a few times. So I'm not going to go over their earnings and stuff, but this still doesn't look good either. It doesn't look bad. Again, I want to be very clear when I say doesn't look good. A lot of people take that to mean the null. And it's not binary. I can have something that doesn't look good and doesn't look bad. It just doesn't look like anything that I'm interested in, which is kind of in video right now. Again, from an investor standpoint, further down this goes my opinion, the more attractive it gets because I still embellish an Nvidia long term. But that's I'm not an investor. I'm a trader. And I cycle on shorter term timeframes. And I think and I need things to move in a time frame that makes sense for my thesis for what I'm trying to accomplish, especially as an options trader because options expire. You can be right but wrong happens to all of us all the time. So with this, I'm also very, very interested to see if it gains a bite here and starts to consolidate because if it does, then I love that because then it looks like yes, we have a slightly lower high, but then we have a higher low, which would then nullify this downtrend section here as compared to a",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 18,
      "start_timestamp": "00:11:25",
      "start_timestamp_seconds": 685.8444444444445,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=685"
    }
  },
  {
    "text": "see if it gains a bite here and starts to consolidate because if it does, then I love that because then it looks like yes, we have a slightly lower high, but then we have a higher low, which would then nullify this downtrend section here as compared to a lower low coming down here, showing a continuation of this broad downtrend. So we have to wait and see what it does. So for me, from an investing standpoint, long term doesn't look bad, but from a near term trading perspective and from an information integration in the markets and pricing, it looks like it's still sorting things out. And this is not where I would be massively bullish in it. Take a look at these recent five candles. Four of them have outsized sale volume. This one close is 53 sale volume, but still majority sale volume. And the last two days have been just dumping it, just unwinding. So yeah, I am really interested to see how Nvidia behaves here, but right now it looks like tech, even from a general momentum perspective using two different oscillators here. I spoke with, I think the pro Patreon members about the inclusion of MTSI, this is just from a study that I read that I'm interested in tinkering with it. So really you can kind of ignore this blue one for now. I'm just putting it through some repetitions and observing it myself so I can come up with an",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 18,
      "start_timestamp": "00:13:03",
      "start_timestamp_seconds": 783.8222222222222,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=783"
    }
  },
  {
    "text": "the inclusion of MTSI, this is just from a study that I read that I'm interested in tinkering with it. So really you can kind of ignore this blue one for now. I'm just putting it through some repetitions and observing it myself so I can come up with an idea to complement the studies I'm running on it. But mostly what I want to direct your attention to here is the RSI that I see. And again, there's two lines here. You'll see the RSI itself. And then you'll see a moving average for the RSI. I like to smooth RSI's. So the EMA is downward sloping. This is a short term four day EMA. And then the RSI itself is downward sloping below the EMA. Moving averages, turning over on the short term. So we can see that the, right now the short term MA that I'm using is a nine day. Sometimes this will be a 10 day either or, and that's downward sloping. And so yeah, I mean, I just, I don't love the way this looks. And the longer term moving averages are starting to rotate down over some of the shorter terms. So the 50 day already is starting to show a, let's take a little, yeah, it's negative sloping already negative 0.4. So that's negative sloping 20 days negative sloping now, a bunch of negative sloping moving averages. All of this is to say right now it's going down. I know what a",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 18,
      "start_timestamp": "00:14:41",
      "start_timestamp_seconds": 881.8000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=881"
    }
  },
  {
    "text": "50 day already is starting to show a, let's take a little, yeah, it's negative sloping already negative 0.4. So that's negative sloping 20 days negative sloping now, a bunch of negative sloping moving averages. All of this is to say right now it's going down. I know what a revelation, what a revelation. Joking aside, I do use these is an indication to help me understand like how much movement is behind a pullback. You can get some ideas on like these sharp pullbacks that rapidly start ascending back. The mid term long term moving averages won't even notice them. They don't care. So it takes a little bit more of a pro long downtrend or resume downtrend, right? So downtrend started up trend and then resuming to the downside here so far for these moving averages to roll over. So between that, the breath indicators, the volume from a really simple perspective, this is a keep an eyeball on it, but nothing that I am overly eager to jump in front of right now, although I am bullish in Nvidia long, long term. And the other thing I have to be honest with you is even with NASDAQ futures, I was real, real, real close, real close to pull the trigger on starting to enter just little tiny position today because the broader part of me just instinctually feels that this is going to start resuming to the upside. The main reason why I feel that is because",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 18,
      "start_timestamp": "00:16:19",
      "start_timestamp_seconds": 979.7777777777779,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=979"
    }
  },
  {
    "text": "futures, I was real, real, real close, real close to pull the trigger on starting to enter just little tiny position today because the broader part of me just instinctually feels that this is going to start resuming to the upside. The main reason why I feel that is because I haven't seen any sort of big material change in information that would lead me to believe that the underpinning reason for the ascent of tech here is now reversed. I just haven't seen that yet. So I mean, we'll see, DVD, a little bit too early to come up with any significant conclusions from it yet, but that's just the way that I'm initially looking at this. All right, so now let's rotate over and I want to take a look at GameStop. And GameStop in my opinion here is generally following more of the broad market. Now the cool part is if we move into the three months, we're starting to drop off these really big candles. So a lot of this will start to normalize and we are closing in on earnings. What I don't love is the sale volume on the last two days because the overall volume is also pretty high. So on the third, we saw 11.35 million shares with 83 sale volume and then the fourth rate 6.8 million shares with 99 sale volume. So people just kind of unwinding today pretty meaningfully. So this is a little bit of a resumption in",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 18,
      "start_timestamp": "00:17:57",
      "start_timestamp_seconds": 1077.7555555555557,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=1077"
    }
  },
  {
    "text": "overall volume is also pretty high. So on the third, we saw 11.35 million shares with 83 sale volume and then the fourth rate 6.8 million shares with 99 sale volume. So people just kind of unwinding today pretty meaningfully. So this is a little bit of a resumption in my opinion of a sideways trend, nothing that I really care about near term, right? Like it's continuing to oscillate sideways nicely between this kind of 18 and three quarters and this 25 handle ish, something like that. And it's just staying within that range. That's okay. And I think it's really just depending on what catalyst we get from earnings if any. Most people have kind of let me know that earnings typically is a bit slower, not really that big of an event. So I don't have that context as well as a lot of you do. I don't really trade GameStop for earnings too much, but I am going to obviously pay closer attention to it for earnings here, just out of curiosity. One of the things I am really curious about is if we're going to start getting some information on this cash pile. Most people have said that they don't typically release a statement with earnings, which I can't help but find slightly interesting because it's like, well, what's the point of earnings then other than reporting the financial performance of a company guidance is a big part of it. So I'm hopeful that maybe",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 18,
      "start_timestamp": "00:19:35",
      "start_timestamp_seconds": 1175.7333333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=1175"
    }
  },
  {
    "text": "have said that they don't typically release a statement with earnings, which I can't help but find slightly interesting because it's like, well, what's the point of earnings then other than reporting the financial performance of a company guidance is a big part of it. So I'm hopeful that maybe we'll see something, but I'm uncertain if we will find out in just a few days here. So let's pivot over and take a look at the options chain because I noticed this, which made me kind of happy. So we are now definitively at a two to one ratio calls to puts, which is actually very, very cool because it's been around that, but not quite. 106,000 of those calls is in this front expiration. 55,000 is in the next. I'm expecting this next expiration to build out more because it includes earnings and I'm expecting people to want to play earnings. But GameStop is continuing to really have a loaded front expiration, which is kind of standard business at this point. But you can see that the 18 ox are what I found is the densest expiration cycle so far. So we can see that 17,000, 130,000 calls 18 oct is 151. The six steps is only 106. The 20 steps is 93. So I keep an eye on where I'm seeing this kind of centralization and exposure because the longer term explorations tend to build over time as more people are establishing these longer term positions, very,",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 18,
      "start_timestamp": "00:21:13",
      "start_timestamp_seconds": 1273.7111111111112,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=1273"
    }
  },
  {
    "text": "18 oct is 151. The six steps is only 106. The 20 steps is 93. So I keep an eye on where I'm seeing this kind of centralization and exposure because the longer term explorations tend to build over time as more people are establishing these longer term positions, very, very normal. But I can detect quick changes and that's again, useful information for me. And then the other thing I took a look at from our friends over at unusual whales is we are seeing a little bit of activity in these 20 calls, but these are all the way out in 2025. And they're bigger trades, but still not anything near the size that we had been seeing for a while. We got a little bit spoiled seeing just massive, massive trades week day of day after day week over week for a little while. So now we're back down to just essentially four line items above 100,000. So for me, I would call this quiet. That's the over overwhelming sensation. I feel if we add the puts back in, again, this doesn't really change most of the larger transactions are on the call side right now. So that's about it. We have a YouTube live session later today for those interested at five PM Pacific time. And then the GME live stream will be Saturday at five PM Pacific time. The intent for this one is I started going through old, roaring kiddie stuff going all the",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 18,
      "start_timestamp": "00:22:51",
      "start_timestamp_seconds": 1371.688888888889,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=1371"
    }
  },
  {
    "text": "that's about it. We have a YouTube live session later today for those interested at five PM Pacific time. And then the GME live stream will be Saturday at five PM Pacific time. The intent for this one is I started going through old, roaring kiddie stuff going all the way through his Reddit profile posts. And I found some really interesting things that just peak my curiosity, much of them being really early trades that were very options heavy, surprising to me. So what I want to do is actually take a much closer look at what the trades looked like as he was putting them on so that I can then continue developing this fingerprinting mechanism. Now one thing I want to highlight is the reason why I'm trying to ID and fingerprint his behaviors is not actually because I have any intention whatsoever of attempting to copy him. I'm not going to. I am I've always traded my own book. But for me, I'm like studying a fascinating character that does so many things that are so irregular that I cannot help but be super curious about the way that he's using the products that I use on a daily basis and to learn more about that. I just want to be clear because I think sometimes people might spend a little too much time trying to decode what he's doing so that essentially they can copy his every move. And that's okay if that's your approach",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 18,
      "start_timestamp": "00:24:29",
      "start_timestamp_seconds": 1469.6666666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=1469"
    }
  },
  {
    "text": "on a daily basis and to learn more about that. I just want to be clear because I think sometimes people might spend a little too much time trying to decode what he's doing so that essentially they can copy his every move. And that's okay if that's your approach like whatever works for you works for you, but that's super dangerous because one of the things that he does that you have to acknowledge is the way that he sizes his positions. And unless you're able to like fully employ what somebody is doing, you're always going to get a partial result because I've seen after going through his old post, I've seen his portfolio go up hundreds of percents but also go down by the same. So the main thing I try to highlight with that point is while I'm fascinated by studying the character, the background, the methodology, it's just from a curiosity standpoint. And I throw that out as a cautionary tale because I don't want people looking at what I'm doing as if like, oh yeah, Eric's been doing this for a while and he's trying to figure this out so we can copy him. So that seems like a good idea that's not it at all. I'm just interested in it. And for you, the best thing I could ever tell to anybody is do what makes sense for you. You're the only person that can manage your own finances in a way that",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 18,
      "start_timestamp": "00:26:07",
      "start_timestamp_seconds": 1567.6444444444444,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=1567"
    }
  },
  {
    "text": "So that seems like a good idea that's not it at all. I'm just interested in it. And for you, the best thing I could ever tell to anybody is do what makes sense for you. You're the only person that can manage your own finances in a way that makes sense for you. So whatever that is, do that. If it's yellowing GME to the moon because you think that's right for you, go for it. If it's saving your money, dollar cost averaging into an index ETF and then having some speculative plays out there, right? Whatever works for you works for you. The important part is understanding and always remembering that you are the ultimate controller of your destiny. Take control of your actions, what you choose to do, own them and do whatever you think is best for you. I will see you on the live streams later. Be an outlier. Catch you guys later.",
    "metadata": {
      "video_id": "m1cO50COTFs",
      "title": "SMCI Downgrade, NVDA Drop, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=m1cO50COTFs",
      "upload_date": "",
      "duration": 1190.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 18,
      "start_timestamp": "00:27:45",
      "start_timestamp_seconds": 1665.6222222222223,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m1cO50COTFs&t=1665"
    }
  }
]