[
  {
    "text": "you you you you you you you you you you you you you The agenda is fairly straightforward. We are going to start by recapping the market really, really fast and then I want to get directly into the skill development session for tonight, which is going to be overviewing the outlier strategy process. And I want to really just frame that not as this is the way to do it. I don't want to constrain your mind like that. This is simply the way that I have learned how to build strategies. So I'm showing you my approach so that then hopefully you can take pieces of it and move it forward. So make it your own. That's the that's really what that all summarizes to is that I'm going to show you a process. So at the end of the video tonight, you should have a pretty good idea of how to create a framework for you to be able to build your own strategies, which I think is one of the the larger elements of quite literally every trader's career. You got to get that part figured out and it takes a little time in the beginning, but once you have it down, it really isn't that bad. So that's the agenda for today. So we will get kicked off. I do have a relatively hard stop. We can bleed over a couple minutes at 1800. I have a call with a couple partners I might be",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 43,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=0"
    }
  },
  {
    "text": "but once you have it down, it really isn't that bad. So that's the agenda for today. So we will get kicked off. I do have a relatively hard stop. We can bleed over a couple minutes at 1800. I have a call with a couple partners I might be working with. So we are going to move at a decent clip. Let's get over to the main screen. I want to start with just recapping the market. There's a few things as per usual. I want to draw your attention to and then I want to talk a little bit about the market as it sits as a whole because I do think that there's a couple things that we should keep in mind as we move through the current markets. So let's get into that. First things first, Reddit. Reddit actually looks great. I have a long trade in Reddit on the breakout. We talked about this a little bit and as earnings coming up and it does look like people are hedging to the downside on earnings. So I don't know if I'm going to hold it through earnings yet. I'm prepared to, but we'll see how it behaves running into earnings. In this case, it might be a function of put trade on, see if this drift continues and then if the trade starts to roll back down, pull it down. So that's why this is up. Let's get to the flexible grid. Let's talk about",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 43,
      "start_timestamp": "00:06:43",
      "start_timestamp_seconds": 403.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=403"
    }
  },
  {
    "text": "it behaves running into earnings. In this case, it might be a function of put trade on, see if this drift continues and then if the trade starts to roll back down, pull it down. So that's why this is up. Let's get to the flexible grid. Let's talk about the market as a whole and then we will get into some new specific things. We got to say hello to everybody. Looks like we got Tommy, Lauren, Travel and Travel for those that don't know. Travel is the winner of last month's raffle from the discord participation leaderboard. And essentially this is a free chance for everybody to win one of two things at the end of the month. You either have the choice of a 15 gift card to go grab like Starbucks coffee or something like that on me or you have a chance to hop on like a 20 minute call with me if you prefer that. So every single month, that's something I take a look at in the discord at the end of the month. I share it and it's kind of a random drawing the way that it works right now. So I'll show you right now who we have. Let's see. So right now, this is the current leaderboard as it sits and the way it works is literally whoever is in the top 10 will top two through 10, I should say, because I don't count myself top two through 10.",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 43,
      "start_timestamp": "00:07:46",
      "start_timestamp_seconds": 466.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=466"
    }
  },
  {
    "text": "show you right now who we have. Let's see. So right now, this is the current leaderboard as it sits and the way it works is literally whoever is in the top 10 will top two through 10, I should say, because I don't count myself top two through 10. They're entered into it's literally just as chat you be to pick a random number and then it picks one of these people. So that's what that is. It's literally just to incentivize people to actively participate in the discord to share information. And it's because that really is where the benefit of the community comes from, especially for the free side of the discord is connecting traders with one another and sharing ideas laterally. So we want to incentivize that. I think it's an important thing. It's something I wish I had access to, but I know most people's propensity is to lurk. A lot of people feel weird about not sure if they have something to offer value to add that I will always remind people the easiest thing you can do about that is post news articles, post charts, right? Like that stuff that's accessible to everybody. So anyways, this is the leaderboard as it sits right now for this month, which is February. So I'm looking forward to connecting with travel. I actually think we're set up for this Saturday if I'm not mistaken. Then we got Hader, Shamgard, dark mark. Why not to john? Lauren",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 43,
      "start_timestamp": "00:09:01",
      "start_timestamp_seconds": 541.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=541"
    }
  },
  {
    "text": "So anyways, this is the leaderboard as it sits right now for this month, which is February. So I'm looking forward to connecting with travel. I actually think we're set up for this Saturday if I'm not mistaken. Then we got Hader, Shamgard, dark mark. Why not to john? Lauren says my baby calls finally made more than a little. I have a profit target and everything that's good. That's awesome. I love to hear that. Now, Lauren, as the calls are making more obviously make sure, oh, no. I knew it was going to happen. I told you guys, I like this rubber band and it's already starting to break. Damn, damn, like that rubber band. Lauren, make sure that you have a system to slide your stops up as the stock is moving up. That's a really useful thing to try to capture your profit. What else we got? We got Will it? Will it is a hell of a name from Sweden? We got Dejon and Fasi T. He says I was actually day dreaming about the collapse of Reddit today. Interesting. Reddit I think is a really great place for a lot of people, for a lot of things. I like Reddit a lot. I think it's not a great place to learn about trading in terms of like good information, but I think it's a good place to learn about the the plight of traders and to really get a sense of what this looks",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 43,
      "start_timestamp": "00:10:08",
      "start_timestamp_seconds": 608.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=608"
    }
  },
  {
    "text": "lot of things. I like Reddit a lot. I think it's not a great place to learn about trading in terms of like good information, but I think it's a good place to learn about the the plight of traders and to really get a sense of what this looks like for most people because there's a lot of stuff like that that you'll find on there. Yeah, but not the place I would go for really well designed information, although there is a lot of that on there. So let's take a peek now at the market and let's see what sticks out to us. The large cap SP 500 is closing in on highs, but not quite there yet. We are about a percent off of three month highs and all turn highs in SP 500. The fuse is still rallying, but lagging. These lines are now completely moot. These do not matter anymore. Small caps struggling, VIX is rolling over. Bonds popped a little bit. Now one of the thing to note about bonds is bonds has a really strange plight ahead of it because Trump is now starting to talk about wanting to lower rates, especially for the the 10 year. That places the market in a really dangerous position, I think with respect to controlling inflation and things of that nature, we have to see how that pans out, which I think it's still a little too early to tell what that ultimately is going",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 43,
      "start_timestamp": "00:11:17",
      "start_timestamp_seconds": 677.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=677"
    }
  },
  {
    "text": "for the the 10 year. That places the market in a really dangerous position, I think with respect to controlling inflation and things of that nature, we have to see how that pans out, which I think it's still a little too early to tell what that ultimately is going to look like. But the fact that that's part of the conversation is something you should be aware of because that is absolutely a market moving piece of news if and how that continues to progress. Bitcoin trending sideways 97 and a half look into recapture that 100,000, but not quite there yet. You can take a look at materials just straight sideways, straight consolidation here on that point of control. Some services down tick a little bit, but still hovering near highs, energy in this downtrend. It looks like it tried to continue the rally today, but couldn't fully keep it. So this is starting to look like the potential for an acceleration to the downside. We have to wait and see how this little reversal, short term trend reversal plays out if it either can get some strength and rally up or if it rolls back over. Those look pretty good covering in on closing in on highs, industrials rolling over still re assuming this broader downtrend tech. This is one of the ugliest charts I've seen for a sector, honestly, in a long time. This is a really ugly chart. So it's been on a bit of",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 43,
      "start_timestamp": "00:12:29",
      "start_timestamp_seconds": 749.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=749"
    }
  },
  {
    "text": "look pretty good covering in on closing in on highs, industrials rolling over still re assuming this broader downtrend tech. This is one of the ugliest charts I've seen for a sector, honestly, in a long time. This is a really ugly chart. So it's been on a bit of a run. This is partly because of Nvidia Nvidia. This is something I've talked about a few times, but Nvidia I still think. Look so good here, but it's so early. It's so early still. And again, if you remember on this first drop, the first thing I said that I like to do with stuff like this is see how it behaves. The reason why I say that is because from a trader's perspective, there's no real huge benefit here to being able to bottom ticket or top ticket because the probability of you reliably doing that over any extended duration is about zero. So from a trader's perspective, we want to try to follow a trend. That's the idea. So one of the things from a investor's perspective, which is completely different from an investor standpoint chip, man, like this is a great spot, I think, to own Nvidia for the long run. Like I was telling you guys before, it literally has less than one price to earnings growth, which is fucking crazy. Really insanely great valuation for like a longer term holding. And as I've mentioned, I already have exposure to Nvidia because I'm trading the",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 43,
      "start_timestamp": "00:13:48",
      "start_timestamp_seconds": 828.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=828"
    }
  },
  {
    "text": "Nvidia for the long run. Like I was telling you guys before, it literally has less than one price to earnings growth, which is fucking crazy. Really insanely great valuation for like a longer term holding. And as I've mentioned, I already have exposure to Nvidia because I'm trading the coverage strangle and T triple queues. So that's a surrogate Nvidia position. Obviously, there's a little more to it than that, but if we take a look at the queues, Nvidia has a significant part of it. So and then I also still have it in the SSO position. So I'm already really pretty well exposed to Nvidia and it's not even from the context of saying like, oh, it's in the index, right? Because yeah, it's in the index obviously, but the point I'm making more broadly than that is this. Like if you look at spy and you look at Nvidia, it's 6, essentially of the index 5.7. So it's when you're trading something like SSO, you're essentially trading Apple, Microsoft and Nvidia, Amazon meta. Like that's the dominant portion of what you're trading. And then if we look at QQQ, I don't think this does it for QQQ. It doesn't, which is kind of annoying, but we can see that in here, if you take a look at the NASDAQ, you can see Nvidia is a significant portion of the queues. So all that being said, this still looks really good to me from an investing standpoint,",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 43,
      "start_timestamp": "00:14:56",
      "start_timestamp_seconds": 896.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=896"
    }
  },
  {
    "text": "QQQ. It doesn't, which is kind of annoying, but we can see that in here, if you take a look at the NASDAQ, you can see Nvidia is a significant portion of the queues. So all that being said, this still looks really good to me from an investing standpoint, but from a trading standpoint, it is struggling. Now there are two points that make sense for entries. I think a break above this is viable. So I actually had an alert. It's off now because it broke above it. I'll just draw it with a trend line really quick so that you can see. So the first level was above this, and that's because of this volume node once it broke out above that. And then now it close above the 200 day MA. I think that this is all viable entries, even from a trading perspective. Now from a trading perspective, if there's an entry gained here, it's a really high probability it's going to be wrong. So I would size it appropriately. And what I mean by that is you can size it either conservatively so that you get out if it drops below this low, which means that you're going to be playing the game way, way, way more of getting in, getting out, getting in, getting out. But that's kind of just part of trying to trade these at this point if you're trying to get in really early, or you can give it more",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 43,
      "start_timestamp": "00:16:14",
      "start_timestamp_seconds": 974.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=974"
    }
  },
  {
    "text": "means that you're going to be playing the game way, way, way more of getting in, getting out, getting in, getting out. But that's kind of just part of trying to trade these at this point if you're trying to get in really early, or you can give it more room and accept that you're going to have to size the trade down. Because if you give the trade essentially below this entire volume node down to like this 114 handle, well now it's at 124, you're giving it a 10 point move. So now you have to size this trade logically to accept that kind of move, which is obviously entirely based upon your strategy, the way you trade these kinds of things. So for me, this is still too early. This is an interesting to me yet. I would feel pretty confident placing a trade on any of these days, especially in just placing a stop down here. That's just because it's viable, doesn't mean it's the right thing for me. I would much rather wait and see how it behaves if it starts to cruise above here. And then if so, that starts to look interesting to me. And the reason why above this is because there's another volume node here and it looks like overall, Nvidia is probably going to get bought up. Like let's just be realistic about it. If we look at the institutional arm of Nvidia, it has pretty strong sponsorship. So let's",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 43,
      "start_timestamp": "00:17:23",
      "start_timestamp_seconds": 1043.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=1043"
    }
  },
  {
    "text": "me. And the reason why above this is because there's another volume node here and it looks like overall, Nvidia is probably going to get bought up. Like let's just be realistic about it. If we look at the institutional arm of Nvidia, it has pretty strong sponsorship. So let's see this. So from an internal standpoint, it has pretty strong internal support for it. But that doesn't mean that near term can't look painful. It certainly can. From an overall growth perspective, it's crazy. It's absolutely crazy where it sits. So. That's Nvidia back over to this really quick. Anything else stick out to us. Not really. Yeah, not really. Staples is still rolling over. Staples continues to be the spot that I'm going to look for shorts. And even on days like this, I'm looking for divergence between what this is doing and then what the internals are doing, which there continues to be divergence. There's a lot of weakness right now within staples. So if we look at this really quick again from a breath perspective, we can see queues is seeing a pretty significant expansion actually of gross highs and a contraction of gross lows leading to moderate net highs lows, not much, but like 25 so light, but still there. And then the New York stock exchange same, same. So all of this synthesized out and maybe a couple sentences is the market continues to show in my opinion, really resilient behavior. But if we",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 43,
      "start_timestamp": "00:18:27",
      "start_timestamp_seconds": 1107.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=1107"
    }
  },
  {
    "text": "to moderate net highs lows, not much, but like 25 so light, but still there. And then the New York stock exchange same, same. So all of this synthesized out and maybe a couple sentences is the market continues to show in my opinion, really resilient behavior. But if we look at this performance of spy, meaning our proximity to all time highs. And if you look at what's actually contributing to that, you can see what clearly is calm services is financials is as well. And then that's almost it. You could argue healthcare is starting to provide a little bit, same thing with discretionary. But the dominant drivers right now of the SP 500 performance are coming from these broad sectors. Now, obviously, that doesn't mean that it's only these sectors providing the strength. There will be individual names within that we can get a sense of and see how those are driving performance. But if we eyeball really fast advancing declining issues, you can see that's expanding across the board. And then you can also see new highs lows is expanding. So this is short term breath showing you a bit of a pause and a turnaround. These have been negative for some time now. And this is the first day that I've seen kind of green across the board on most of these. So as always, this does not mean market goes up. It does mean that the market is taking in information and deciding how",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 43,
      "start_timestamp": "00:20:12",
      "start_timestamp_seconds": 1212.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=1212"
    }
  },
  {
    "text": "These have been negative for some time now. And this is the first day that I've seen kind of green across the board on most of these. So as always, this does not mean market goes up. It does mean that the market is taking in information and deciding how it wants to behave obviously as it always does. But this isn't a defined trend yet. And this is why I structure trades really carefully right now. So we'll go over more of like the portfolio metrics and stuff like that tomorrow during the pro stream. But for general consumption right now, the portfolio is 106 utilized. So really, really light on a relative basis for me. And that's also a lot of capital obviously being placed in box spreads, less box spreads. It's quite a bit lower than that. It's 52 utilized. So the portfolio is essentially fully, fully allocated, but we're not fully utilized anywhere near it. In terms of allocation, we're well over 100 utilization with box spreads and stuff is just over 100 so pretty light. Now a couple of the things to be aware of, we were underway with earnings. And if you're not keeping pace with earnings, there's actually a lot to take away from what we're hearing so far. So for this week, this is one of the busier weeks you're going to see you can see this essentially this these two blocks here, I guess three blocks, three, these three weeks encompass",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 43,
      "start_timestamp": "00:21:26",
      "start_timestamp_seconds": 1286.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=1286"
    }
  },
  {
    "text": "pace with earnings, there's actually a lot to take away from what we're hearing so far. So for this week, this is one of the busier weeks you're going to see you can see this essentially this these two blocks here, I guess three blocks, three, these three weeks encompass a ton of really important companies. Now this isn't filtering by anything normally. I will filter by the SP 500 or something like that. That's just to try to get rid of some of the names in here because a lot of these are not things that are super, super liquid. Let me see. No, what does this actually do to us? It kills everything. I don't know what this does for full session options. There's always kind of interesting. But I normally intersect it with weeklies because if I'm going to trade earnings most of the stuff that I want to trade earnings is going to have something with weeklies. But so we know Palantir reported yesterday, Palantir had a cracked earnings. It did so well. And I actually have a couple alert set as you can tell to eyeball Palantir. Now I like Palantir. I like it as a company. I continue to trade it. I'm in and out of Palantir constantly. The reason though for not entering yesterday is because you got to wait and see how this kind of moved digest. And now today it's the same thing, right? It didn't continue. If it was continuing",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 43,
      "start_timestamp": "00:23:01",
      "start_timestamp_seconds": 1381.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=1381"
    }
  },
  {
    "text": "a company. I continue to trade it. I'm in and out of Palantir constantly. The reason though for not entering yesterday is because you got to wait and see how this kind of moved digest. And now today it's the same thing, right? It didn't continue. If it was continuing with significant strength, then that would have been a different kind of trade idea. That's it didn't continue on strength. That's a different trade idea. This is again to reiterate this concept of a tactical pause. We use this in the military all the time. It's kind of like that saying you have to know the difference when it's time to move and when it's time to be still. And there are very distinct times for both. So this is a spot where a tactical pause in my opinion is completely warranted. And it's to look, see how it behaves. And then based on how it behaves, then enter a position that fits with how it's behaving. A lot of people when they see these big kind of giant gaps gap up, they'll really look to run into them super fast. And that generally is a mistake. The reason why it's generally a mistake is there will be instances where the stock will continue after the gap up. There are also a lot of instances where the stock will start to reverse back a bit if not this entire gap. It doesn't always happen, but it happens quite a lot.",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 43,
      "start_timestamp": "00:24:18",
      "start_timestamp_seconds": 1458.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=1458"
    }
  },
  {
    "text": "it's generally a mistake is there will be instances where the stock will continue after the gap up. There are also a lot of instances where the stock will start to reverse back a bit if not this entire gap. It doesn't always happen, but it happens quite a lot. And this creates a pretty high risk entry because if you look at the last spot before it launched, it was at like 84. So now you have like a 15 point move that you're looking at. If you're trading something like options, which have leverage, you're now exacerbating that move, not insignificant amount. So for trader perspective, I have to pay attention here. Now this is a really, really great candidate though for post earnings announcement drift. And it's because it meets literally all the criteria. It's not super frequent that you'll find things that meet literally all the criteria, but this one does. So it came in at zero point, it was expected at 0.054. And it came in at 0.14, so almost three times expected EPS. So massive beat followed by a massive gap followed by significant expansion of volume and then a couple other criteria within the earnings release itself that lead it to qualify. But just because it has those criteria, it doesn't mean it's going to experience post earnings announcement drift. I would feel pretty confident that it does to be honest with you, but it needs to start moving correctly. So again, that's",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 43,
      "start_timestamp": "00:25:23",
      "start_timestamp_seconds": 1523.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=1523"
    }
  },
  {
    "text": "the earnings release itself that lead it to qualify. But just because it has those criteria, it doesn't mean it's going to experience post earnings announcement drift. I would feel pretty confident that it does to be honest with you, but it needs to start moving correctly. So again, that's why these alerts are set. What I want to see is does it start to rally up into the day? Well, it will be two days prior or is this going to be a lot more price digestion by people who are taking trades down, trying to book their profits and then moving on to other things? It is too early to tell. So that's a pass. All right, back over to the broad markets. We need to take a look at a couple just economic outputs because there are a few things that stick out to me. I need to get rid of these. I don't care about the auction. And let's crush this down a little bit. And let's take a look at the fifth. So today non-farm employment change, you can see it's up actually quite a lot. 183,000 versus 150 imports, exports are, imports are expanding. They're sort of contracting, not ideal. And then global services, PMI, global services, PMI and overall like the ISM services, PMI, these have been coming in a little bit strange. And they're expecting contraction, but the contraction isn't as bad. I don't think. Now, I'm really interested in specifically tomorrow",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 43,
      "start_timestamp": "00:26:32",
      "start_timestamp_seconds": 1592.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=1592"
    }
  },
  {
    "text": "They're sort of contracting, not ideal. And then global services, PMI, global services, PMI and overall like the ISM services, PMI, these have been coming in a little bit strange. And they're expecting contraction, but the contraction isn't as bad. I don't think. Now, I'm really interested in specifically tomorrow when we get jobless claims to come in and then obviously also unit labor costs because these are just economic health benchmarks for us to see in general how do things currently look. And that is absolutely the canary in the coal mine for the stock market is how the economy is doing. So we have to pay attention to it. And this week is not packed with stuff, but it does have quite a few things going on that I believe we should be paying pretty close attention to. Okay. So now the other thing I want to take a quick look at is a couple upcoming earnings. This is more for myself because I've been trading earnings and I have a bunch of these that I need to take a quick look at. I'm already all set for my place tomorrow. So then let me double check. On the lease, that's what I have to look at. Grab in O rats really quick. So that we can look at Mondalees. Okay. So Mondalees is an interesting one. It's one that I trade earnings a lot like over my entire trading career, but it really comes in and out",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 43,
      "start_timestamp": "00:27:50",
      "start_timestamp_seconds": 1670.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=1670"
    }
  },
  {
    "text": "the lease, that's what I have to look at. Grab in O rats really quick. So that we can look at Mondalees. Okay. So Mondalees is an interesting one. It's one that I trade earnings a lot like over my entire trading career, but it really comes in and out of favor hard. See, this one talked about it goes through these phases. But in general, this is a pretty easy trade for me. The implied, yeah, and you can see exactly why the average implied move is 3.2 the average actual is 1.8. And this is fairly consistently the case. This is one I look at very regularly. So this one is definitely on the table from an earnings play perspective. You can take a quick peek and see how it's doing. And it came out 663 against 65. So it actually came in a little bit light. That's actually really, really interesting. But really sizable move on the day 2.3. I think that's still within the expected move. So Mondalees is one of those names that I really typically try to keep an eye on it. But this doesn't look good, to be honest, even from the post release. This is a heavily defined downtrend. heavily defined downtrend. That sucks. That sucks for Mondalees. This is interesting. It makes me curious, like really curious, to be honest with you. Wonder if there's a short in here. I'm going to keep an eye on this actually for a short.",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 43,
      "start_timestamp": "00:29:17",
      "start_timestamp_seconds": 1757.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=1757"
    }
  },
  {
    "text": "release. This is a heavily defined downtrend. heavily defined downtrend. That sucks. That sucks for Mondalees. This is interesting. It makes me curious, like really curious, to be honest with you. Wonder if there's a short in here. I'm going to keep an eye on this actually for a short. It's a little bit strange to short on something like this, but really want to see how this candle behaves and how people step into the market tomorrow. The really strange behavior because this is a heavy amount of buying. This is a really heavy amount of buying. But the earnings, like it wasn't that great from an EPS perspective. It fell short. Obviously, the guidance was decent, but still, like that's a massive buy. So unless that guidance was like really, really strong for whatever reason, hard to see it here. So this might be one to keep an eyeball for a return back to Earth kind of trade. Let's take a look at tomorrow after the close arm Qualcomm, S-Y-M, M-S-T-R. That's going to be a huge one. What is the vol in M-S-T-R? That's going to be interesting. Lauren says, if it turns around, it's going to be decent uptrend. I'm going to watch it. That's the thing, though, is like I'm really, really curious if it would be a decent uptrend. Because I don't see why it would. Right? Because it's fallen from 76. Now at 57. I'm not sure why it would be like a",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 43,
      "start_timestamp": "00:30:42",
      "start_timestamp_seconds": 1842.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=1842"
    }
  },
  {
    "text": "be decent uptrend. I'm going to watch it. That's the thing, though, is like I'm really, really curious if it would be a decent uptrend. Because I don't see why it would. Right? Because it's fallen from 76. Now at 57. I'm not sure why it would be like a decent uptrend. Because even on the buying, let's also realize what happened today on the earnings. It gapped down. Right? Like that's what this is. That's the only reason why it had that big of a day. So even though it had a big day, it gapped down and it closed essentially where it was. So I would agree with you if it opened here and then this candle shot up like that, that I would agree with. But with it like this, I'm just not sure. That's why this is so interesting to me because this is a hell of a gap down. My guess is from an institutional perspective that hit some sort of value price level that some institutions were like, I just dig it here. Yeah. That's exactly what this is. Because you can see the volume right after the open jacked and then tailored off. This looks like a bunch of follow through with light resistance because I don't think that there's a bunch of people trying to sell it here. This is a really interesting one. This is a really, really interesting one. Yeah, it already broke above that one. Yeah. This will be",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 43,
      "start_timestamp": "00:32:28",
      "start_timestamp_seconds": 1948.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=1948"
    }
  },
  {
    "text": "This looks like a bunch of follow through with light resistance because I don't think that there's a bunch of people trying to sell it here. This is a really interesting one. This is a really, really interesting one. Yeah, it already broke above that one. Yeah. This will be a fun one to watch. It's not super common that you'll find moves like this where something will gap down that hard, but then still have such a powerful day. The thing I will always remind people, especially somebody like Lauren, is don't forget that the question always is not, is this a place I could put my money? The question always is, is this the right place for my money? And this is also an underperforming sector. So if we take a look, Paul says what's their PE? You said PE, right? Yeah, let's say look. Because they're in staples, which is not doing well. PE is 26.13. Let's take a look at here. I mean, they seem to be doing okay. So forward PE right now is 17.4 where the industry average is 23.5. This is actually one of the things I really like about the Benzingo platform is they have a lot of these style financials and like one really convenient spot, especially for these. And I like that they include the industry averages. That's for those that don't know when you're comparing stuff like PE ratios, peg ratios and stuff like that, the industry average is",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 43,
      "start_timestamp": "00:33:50",
      "start_timestamp_seconds": 2030.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=2030"
    }
  },
  {
    "text": "is they have a lot of these style financials and like one really convenient spot, especially for these. And I like that they include the industry averages. That's for those that don't know when you're comparing stuff like PE ratios, peg ratios and stuff like that, the industry average is really, really important. So it's cheap on a relative basis. That's for sure, but just because it's cheap doesn't make me stoked for it. So what I'm doing is I'm just looking at revenue. 9.69.2, 8.34, 9.29.2, 9.31. So revenue is growing. Not not exceedingly well. But overall, okay. And I mean, it's been doing okay on EPS. Yeah, really, really interesting. I always like keeping an eye on this stuff. I think the company itself is not not super impressive right now. We'll keep a we'll keep an eye by sweet. Any market stuff that we want to take a quick peek at actually let me check the pro. Let me check the pro questions. Alright, so we got one from our boy. Reese. Zero. To a mill. So here's the trade. Let's see what we got. Long balance your calls average cost 175 per call. So 1.75 took down 1014 long calls today for a 3 and 50 gain. Okay. So this is actually funny. We were kind of talking about this before. So for Reese. We are at what 39.30. We'll take a specific stroll. We're going to take a look at the last one. We're going",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 43,
      "start_timestamp": "00:36:21",
      "start_timestamp_seconds": 2181.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=2181"
    }
  },
  {
    "text": "down 1014 long calls today for a 3 and 50 gain. Okay. So this is actually funny. We were kind of talking about this before. So for Reese. We are at what 39.30. We'll take a specific stroll. We're going to take a look at the last one. We're going to take a look at the last one. We're going to take a look at the last one. We're going to take a look at the last one. Thank you. 930. 1.75 per, we closed 10. I guess there was 14. Okay. So then let's do some math here really quick. I'm gonna take this over to our Scratch tab so that we can do a little bit of math. So we're saying that we had 10 of these, we got them for 1.75, we closed them for seven and a half. Yep. And then we're saying that we have four that we also got for 1.75 and then these remain open current state. Okay. This was stuff from the fire things that we were looking at. We can kill all those. Things that we were looking at, we can kill all those. So then here we can figure out our profit. So it's this minus this times this times 100. When these we made 5,700, our current cost on this one is 700. So realistically we have a completely risk free trade-on right now, which is great. Love that. One sec. Okay. We're starting to figure out what dinner",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 43,
      "start_timestamp": "00:38:54",
      "start_timestamp_seconds": 2334.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=2334"
    }
  },
  {
    "text": "our profit. So it's this minus this times this times 100. When these we made 5,700, our current cost on this one is 700. So realistically we have a completely risk free trade-on right now, which is great. Love that. One sec. Okay. We're starting to figure out what dinner is gonna be. So now let's take a look at the trade that's left. 17 April. Okay. So these are pretty near term. 17 April. Oh, no, that's alive. Why did I think that was near term? That's plenty good. The 120. So we're pretty far out of the money. I don't see how we close those to be honest for 750. I might be missing something. But anyways, to continue the thought exercise, the way I would manage this for the remaining four, really would be I would pick a level below this that you would consider the trend broke into the downside. Otherwise, I mean, I would just give them as much room as I possibly can. It's if you got them for 1.75 and you already made 5,700. If those other numbers are correct, which honestly they look a little off to me. But if they are correct, then you have a completely risk free trade on right now. And after an earnings play like that, I would be way more inclined to leave the remaining trade on and just give it as much room to run because we already made, we would have made 5,000. And",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 43,
      "start_timestamp": "00:40:51",
      "start_timestamp_seconds": 2451.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=2451"
    }
  },
  {
    "text": "correct, then you have a completely risk free trade on right now. And after an earnings play like that, I would be way more inclined to leave the remaining trade on and just give it as much room to run because we already made, we would have made 5,000. And then we have 700 remaining on risk. And because again, if we look at that overall PNL, the overall PNL is actually 5750. So this is essentially just taken 700 from that saying, I'm going to account for it here, say that the total profit on the trade is just 5,700 and then just let it go. That's exactly what I would do. But if the numbers aren't quite that, which I think they might not be, because I don't think these traded for 750 today. Oh, no, that might be 750 profit, like 750 total, not what they actually were sold at. Let's do that really quick instead. So seven, oh, no, I still don't see how they were sold for 750 profit. Yeah, the numbers don't line up. The reason why they don't line up is selling them for 750, the 17 April 120's. I don't think they traded for 750. And then this one says the 14 oct. Oh, I'm fucked up. 14 oct. Okay, so it might be the 14 oct long calls to instructions unclear. It's too difficult for me to understand the position because we're talking about long calls with this position here. And",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 43,
      "start_timestamp": "00:42:54",
      "start_timestamp_seconds": 2574.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=2574"
    }
  },
  {
    "text": "traded for 750. And then this one says the 14 oct. Oh, I'm fucked up. 14 oct. Okay, so it might be the 14 oct long calls to instructions unclear. It's too difficult for me to understand the position because we're talking about long calls with this position here. And then we're talking another position over here, 1014, which I don't know anything about those. So having a little more detail on this would be super useful. But to just recapture what we talked about from this section, the management of the remaining, if the numbers are as we say they are here, it's a risk retrain. So for me, I would essentially just let them go because even if they fall down, now you could pick a point where you're like, yeah, okay, if it meaningfully falls below this, then I'm going to consider the trend dead. And the way that I would do that is I would just use a prior sample move. So an example of that is something like from here to here. And this was a 23 move. So you can take the clothes here. I got to squish this down. So you can take the clothes here, run this down 23 and again, it essentially puts you back into this. So you could consider a drop below this, but at that point, that option is going to be really cheap. Anyways, might as well just leave it on for the convexity if it does",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 43,
      "start_timestamp": "00:44:06",
      "start_timestamp_seconds": 2646.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=2646"
    }
  },
  {
    "text": "the clothes here, run this down 23 and again, it essentially puts you back into this. So you could consider a drop below this, but at that point, that option is going to be really cheap. Anyways, might as well just leave it on for the convexity if it does start to move. So yeah. Overall, good question. I need a little more detail on the position itself. I can't fully decipher from that, but yeah, that's what I got for your Reese. And then I'll tag you in the discord really quick to let you know that I hit your answer. Okay. Now, let us pivot time to talk about the skill development segment. So this skill development segment for tonight is a overview. So skill development. And this is going to be an overview of the outlier strategy process. Now, a couple of things I want you to keep in mind as I go through this is this is designed to be a framework for thinking. This is not designed to be the way for you to think. And I want that to be really clear. Tommy says, how do you want us to scribe our trades? So we can get good feedback. Yeah. So great question on this in order for I just need to know the trades. I don't really care the format. I can decipher it, but this one doesn't really help me, right? Because there's long pounds, your calls, and then I'm given this",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 43,
      "start_timestamp": "00:45:30",
      "start_timestamp_seconds": 2730.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=2730"
    }
  },
  {
    "text": "we can get good feedback. Yeah. So great question on this in order for I just need to know the trades. I don't really care the format. I can decipher it, but this one doesn't really help me, right? Because there's long pounds, your calls, and then I'm given this position. The 17 April expiration 120's. And then I'm given this position took down 10 14 long calls for a 350 gain. Like that, this doesn't literally mean anything to me. I don't know the strike. I don't know what we actually got in at. And then we lay this over. So the way that I would typically recommend inputting trade information is like this. I'll insert a comment. So standardized trade format is something like this. It's XX of the one Jan 25 calls at whatever price we got in at 1. So the XX is the size. So then this would be sold to open, bought to open. Like this. So it's just standard trade formatting. But the main thing here that's confusing is just that it's missing information. So I just can't give like a fully customized answer with like the specific, the specific metrics. That's what I would want to give them. But I still think we can get close enough. So. All right. Back over to skill development. For tonight. And again, we're going to talk about the outlaw strategy process. And again, this is not the way to think. This is a way to",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 43,
      "start_timestamp": "00:46:59",
      "start_timestamp_seconds": 2819.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=2819"
    }
  },
  {
    "text": "I would want to give them. But I still think we can get close enough. So. All right. Back over to skill development. For tonight. And again, we're going to talk about the outlaw strategy process. And again, this is not the way to think. This is a way to think. And I'm going to draw your attention to a view. Very specific things as we work through this. One of those specific things is I want to make sure that you are. Figuring out different ways that you can lift. What we're talking about. And ideally apply it in your own scenario. So this is not designed to be something that. You know, you're just going to follow along exactly and then do what I do. I want you to think a little more broadly than that. So the TLO for today, which is the terminal learning objective. Is I want you to understand the found the foundational concepts to creating your own process. To building strategies. This should not be a random effect. This should not be a random process. It should be clearly defined. Now, give me one sec. I'm going to email these dudes that I'm meeting with and let them know I'm going to be like 10 minutes late. Okay. Let's dig in. So for those that don't know, I already have a video out there. It's a little bit dated on the outlier strategy process. I will give you the overview of that here.",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 43,
      "start_timestamp": "00:48:26",
      "start_timestamp_seconds": 2906.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=2906"
    }
  },
  {
    "text": "meeting with and let them know I'm going to be like 10 minutes late. Okay. Let's dig in. So for those that don't know, I already have a video out there. It's a little bit dated on the outlier strategy process. I will give you the overview of that here. So that link is in the chat for you. But the outlier strategy process essentially includes a couple key steps. The whole purpose of this outlier strategy process again is literally just to help us create a process and a framework for exploring ideas. The reason why this is super important is because if you do not have a framework to developing a strategy every time you try to develop a strategy, there's going to be slight variations in what you do, why you do it, how you do it, and therefore the strategies themselves are going to have massive deviations. The whole point of building processes is for efficiency. It's to spend less time doing like tasks and to do like tasks better because there's a defined process, a defined step that we're doing at each phase. So for example, these are the four steps in my mind that I think about when I'm building a strategy. I think about first profit mechanisms. I think about second profit mechanism type and signals. I think in the first version type might have been over here. It's the same thing. The reason why I moved type over here from here is",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 43,
      "start_timestamp": "00:49:48",
      "start_timestamp_seconds": 2988.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=2988"
    }
  },
  {
    "text": "I think about when I'm building a strategy. I think about first profit mechanisms. I think about second profit mechanism type and signals. I think in the first version type might have been over here. It's the same thing. The reason why I moved type over here from here is I'm trying to help teach people to truly isolate this one in my mind. That's a given. But for a lot of other people, I don't think it is. So what does this even mean? I actually have a video that I just made last night that talks about profit mechanisms way more in detail. So you'll be able to check that out on Sunday. But the key note here is most traders. I don't think have a true understanding of what they're trading or how they're making money. It sounds kind of crazy, but that's exactly what I believe. And I'll give you an example. If I sell a call option. How does that trade make money? So give me some different scenarios that a call option can make money. Let's just say I sell a call. How can a short call make money? This is options 101. So I assume most of you will know the answer to this. We'll see if there's a brave soul that is willing to step in front. Data decay. See. Lauren says premium. Tommy says. See, none of you have hit the primary way that this trade makes money. Tommy says sold",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 43,
      "start_timestamp": "00:51:10",
      "start_timestamp_seconds": 3070.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=3070"
    }
  },
  {
    "text": "I assume most of you will know the answer to this. We'll see if there's a brave soul that is willing to step in front. Data decay. See. Lauren says premium. Tommy says. See, none of you have hit the primary way that this trade makes money. Tommy says sold to open call time passes. Data decay volatility collapses. Shamgar says premium. If covered capital gains. None of these are the primary ways that that trade. There you go. Tommy has it. That's the primary way of short call makes money. Joseph's time. That's not it either. See, this is this is exactly why this is important to talk about this exact thing. Sean also has the right answer to be honest is just to put on the other trade. As soon as you put on the other trade, then your prior trade obviously will let. Yeah, I identify with that. But you guys see my point, right? Black Mama says Ivy and gamma. That's not it. Definitely not gamma. Gamma hurts short calls. Dejan says they make money from option being out of the money. Yeah, that's sort of correct. I get you. Joe says I was going to say price drop, but it seems obvious. Ah, does seem obvious. Doesn't it? But notice how nobody answers it that way because everybody is taught in the standard format that if you're talking about short options, you're taught that they did decay or volatility are your primary focuses, but they're",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 43,
      "start_timestamp": "00:52:29",
      "start_timestamp_seconds": 3149.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=3149"
    }
  },
  {
    "text": "say price drop, but it seems obvious. Ah, does seem obvious. Doesn't it? But notice how nobody answers it that way because everybody is taught in the standard format that if you're talking about short options, you're taught that they did decay or volatility are your primary focuses, but they're not. They're literally not. They are an important focus. I want to be clear. I'm not saying don't pay attention to those absolutely pay attention to those. You have to, but it's not the primary way they make money. And I'll look at an example together right now. So let's say that we're looking at Palantir. This is fine. We'll just look at Palantir. And let's build a sample trade in Palantir. Let's say that we sell 44 DTE call. We sell the 30s. Let's analyze this trade. First off, how does this trade make money? To your point, it can make money in multiple ways, but not all ways are created equal. How can we tell this? The Greeks. The Greeks tell us exactly how it makes money and to what effect. So let's grab our handy dandy notebook. And let's take a look here are your Greeks. So the first thing that you told me was Thaited a K. This is the passage of time. The Thaited a K on this option for in state. 8.53. That's what you make per day holding it. Okay. So you do make money from Thaited a K. So then why am",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 43,
      "start_timestamp": "00:53:52",
      "start_timestamp_seconds": 3232.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=3232"
    }
  },
  {
    "text": "the first thing that you told me was Thaited a K. This is the passage of time. The Thaited a K on this option for in state. 8.53. That's what you make per day holding it. Okay. So you do make money from Thaited a K. So then why am I saying that's not the thing I'm asking for. Well, let's take a look. Somebody else then said volatility. Okay. So volatility is Vega. Vega is 12. In 22 cents. So this means if volatility contracts, you make by one point, you make 12.22. I also said that's not the main thing I'm talking about. Why would that be? Oh, let's answer that question. I told you the dominant ways price direction. This is the thing that is so misunderstood. Is that this is still a directional trade. That is your primary profit mechanism here. That's measured through delta. The delta on this option is 30. So let's just take a look at the profit factors here. Delta accounts for 30. Vega gives us 12. Veda gives us 8.53. So I again ask, how does this option make money? It makes money from all these factors. But one of them is way more important than all the others. Here's an example. Let's say you get your change in volatility. Let's say volatility drops by 1. That means you get your 12 here. You get this. So we're going to add that. Let's say one day passed. You get your 8.53.",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 43,
      "start_timestamp": "00:55:22",
      "start_timestamp_seconds": 3322.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=3322"
    }
  },
  {
    "text": "is way more important than all the others. Here's an example. Let's say you get your change in volatility. Let's say volatility drops by 1. That means you get your 12 here. You get this. So we're going to add that. Let's say one day passed. You get your 8.53. We add that. So now between these two, you're up 20 bucks. Guess what happens if the stock moves 1 against you. You lose 30. So you were right on your Vega. You were right on theta. And direction says, fuck you. I don't care. You're now negative 10. You got two out of three factors correct and you still fucking lose. That's because people misunderstand how to use things like the Greeks to inform the way we set positions up and the way that we then build strategies. Because again, if you are thinking of this from the perspective of the way I make money is through Vega and theta, then you're going to optimize for the wrong fucking things. You have to be directionally correct. This is a directional trade. Your profit mechanism is direction. Your profit mechanism is not volatility. Your profit mechanism is not theta. Those are two contributing profit mechanisms. But there's secondary to the primary, which is direction. And I just gave you an explicit example why it is the case using the Greeks from the very option that we're looking at. Okay, hopefully that point is clear. So let's go back to our",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 43,
      "start_timestamp": "00:57:44",
      "start_timestamp_seconds": 3464.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=3464"
    }
  },
  {
    "text": "are two contributing profit mechanisms. But there's secondary to the primary, which is direction. And I just gave you an explicit example why it is the case using the Greeks from the very option that we're looking at. Okay, hopefully that point is clear. So let's go back to our overview. Next up. Let's fly through these. Wake. So the profit mechanism, this is where we isolate the actual way our trades make money. This is actually identifying the effects. And when you're trading options, there are almost multiple effects. It's never just one, but there is always one that is dominant. Just gave you an example of that. Then the second step is to take a look at the specific type of profit mechanism that we're looking at. So an example of this is something like this. Profit mechanism here using that short call example, that's price direction down. This is the profit mechanism, the overarching effect that leads to profit in this example. Then the type can be many different things. You can have price that goes down in different ways. So how do we figure out these different ways? Well, when you don't know, you start by just looking at stuff. So let's take a look. Let's go back to a staple. I think. So what's the difference between this kind of move versus this kind of move or this kind of move? Severity. How big the move was is different. There are different things about this",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 43,
      "start_timestamp": "00:59:27",
      "start_timestamp_seconds": 3567.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=3567"
    }
  },
  {
    "text": "just looking at stuff. So let's take a look. Let's go back to a staple. I think. So what's the difference between this kind of move versus this kind of move or this kind of move? Severity. How big the move was is different. There are different things about this move than this move. So the way that we label it, you can call it whatever you want. It doesn't matter. I use different terms to represent different kinds of moves. I use terms like break out so you can break up or break down. In this case, we'd be a breakdown. I have things like drift momentum because this is a breakdown within a longer term uptrend that has positive drift. But I can also see that there's some very clear things from a technical perspective that are starting to set up and create different conditions. So the whole point of defining the type is to differentiate between different things. Another great example is price direction up. What's the difference? If I look at the chart starting here and then I go to here. And then if I look at the difference between this and then this. What's the difference? This is drift. Well, this is technically momentum, shorter term than drift. This is momentum. Momentum and drift, they kind of go back and forth. I sometimes sloppily interchange them like I did there. This is momentum. And what, how do we understand the difference between these? We just",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 43,
      "start_timestamp": "01:01:06",
      "start_timestamp_seconds": 3666.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=3666"
    }
  },
  {
    "text": "difference? This is drift. Well, this is technically momentum, shorter term than drift. This is momentum. Momentum and drift, they kind of go back and forth. I sometimes sloppily interchange them like I did there. This is momentum. And what, how do we understand the difference between these? We just start by looking. So if I measure this move from there to there. I might have to open this chart up a little bit more. Yeah, there you go. That represents a 7.7 move over 191 days. Okay. So now I have a 7 move over 190 days. What do I have here going from here to here? I have a 6 move in 33 days. Pretty damn different, huh? So the way that I think about trading these two different things is different. They behave differently. This one made way more ground in way less time on relative basis. So the idea behind profit mechanism and then profit mechanism type is to differentiate. First we have the broad profit mechanism price in this case direction up down. The type helps us understand the difference between those two examples I showed you. And then signals. The purpose of signals is to help us find the profit mechanism. So as you're looking at the profit mechanism and the type, then you're using these different tools to analyze your understanding of it. To see what you can learn about it. So I'm going to come to the signals that you want to",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 43,
      "start_timestamp": "01:02:36",
      "start_timestamp_seconds": 3756.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=3756"
    }
  },
  {
    "text": "to help us find the profit mechanism. So as you're looking at the profit mechanism and the type, then you're using these different tools to analyze your understanding of it. To see what you can learn about it. So I'm going to come to the signals that you want to track. You have questions about. So if we take a look at this again, we have things like moving averages. We have things like standard deviation channels, volume profile, RSI, with the moving average, average volume, someone and so forth. It's whatever tools you use to help you see the thing that you're trying to identify in the market to then therefore build, getting structures to then turn into strategies. So I'm really going to go over all of these and we'll go further in depth on each one. But I wanted to start you with this overview so that you have some ideas of how to build your own process. And this is exactly how I go about it. But the most important one on here, unequivocally is this one. You have to get the profit mechanism right. If you do not get the profit mechanism right, literally the rest of your work is wrong. So that's something to keep in mind and it's something to spend more time thinking about. Because again, based on the example that we reviewed earlier together, a lot of people got that answer wrong and that's okay. That's why we're here. We're here",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 43,
      "start_timestamp": "01:04:07",
      "start_timestamp_seconds": 3847.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=3847"
    }
  },
  {
    "text": "rest of your work is wrong. So that's something to keep in mind and it's something to spend more time thinking about. Because again, based on the example that we reviewed earlier together, a lot of people got that answer wrong and that's okay. That's why we're here. We're here to learn. But that's clearly identifying that we have some ground to cover with what we're trying to learn. Because for a short call, delta, delta matters. And then is that option moves. Other things can overcome it. So let's take a quick look at an example of that. Let's say in here you started off by shorting this at the money call. And then it goes further and further down into the money. And notice how your delta climbs. So delta becomes more and more dominant over everything. But if you go too far out of the money, you can have delta that's relatively low compared to something like theta or Vega. But very rarely, even for super far out of the money options, will you have theta and Vega that overwhelms your delta? Keep it in mind. All right, gang. I'm going to pop off. If you have any questions, let me know for the outlier pros, we're literally going to go into a case study on this exact thing tomorrow. And I'm going to show you how to build your own version of this. So you use mine as a framework to give you ideas on where",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 43,
      "start_timestamp": "01:05:20",
      "start_timestamp_seconds": 3920.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=3920"
    }
  },
  {
    "text": "any questions, let me know for the outlier pros, we're literally going to go into a case study on this exact thing tomorrow. And I'm going to show you how to build your own version of this. So you use mine as a framework to give you ideas on where to start. If you like mine, lift it and shift it. Use it. But if there are elements about mine, they're like, I don't really know what to do. That's okay. That's what we're going to go through tomorrow. So tomorrow, you're going to have a sense literally a defined checklist of what to do in each of these steps. So that you have a starting point. As always, let me know if you have any questions, be an outlier. See you all later.",
    "metadata": {
      "video_id": "m3pg3pyD4e4",
      "title": "Create Your Own Strategy - Outlier Strategy Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=m3pg3pyD4e4",
      "upload_date": null,
      "duration": 4046.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 43,
      "start_timestamp": "01:06:39",
      "start_timestamp_seconds": 3999.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=m3pg3pyD4e4&t=3999"
    }
  }
]