[
  {
    "text": "think or swim. It's a huge platform for a lot of people. It's overwhelming. I know it was from me when I first started, but I want to walk you through the platform. I started trading on it back in 2007 when I first started trading, so I have had over 16 years on it. I've gone to a bunch of different webinars on it. I even participate in some of the alphas for new features that they're releasing because I like it overall. It's pretty robust. So I want to walk you through two things. The first thing, some general ins and outs, how I like to set it up, stuff like that. And then at the end of the video, I want to go through how I use the chart side of the program because it's really powerful. And there's a lot you could do with it. So what's up everybody? Eric here. We'll come back to all the outliers in a shout out to the Patreon family. You guys make videos like this possible. So thank you so much for the support. Let's get right to it. So here we go. We're going to start from the trade tab. And you'll notice that we have these different sub tabs. I'm not going to go through everything. Think or swim actually is a really comprehensive library. So if you are completely new to the software, I'm not the right to guide a start with. Definitely check their stuff",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 23,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=0"
    }
  },
  {
    "text": "trade tab. And you'll notice that we have these different sub tabs. I'm not going to go through everything. Think or swim actually is a really comprehensive library. So if you are completely new to the software, I'm not the right to guide a start with. Definitely check their stuff out first. I'm going to be going through some of the preferred things that I like to include. Okay. That aside in the trade grid. A lot of people don't even know this exists. It's underneath the underlying drop down. So if I close all these down, you can kind of see what choices are available. The underlying is just typical details about the underlying itself. You can customize some of this actually. And then the trade grid. I like this because you can actually drop level to data. You can also drop the order book depending on the product, stuff like that, which I actually think is really cool. Then for the options chains, let's talk about this. I like to set up all these different columns. You'll notice that there's actually too many that they don't even you can't see the whole name. That's okay because I know what they are. We have bid ask last those were all your just general pricing tools. Then we have kind of the stereotypical options tools. So Delta gamma theta Vega row. I like to see all of them realistically and a lot of people actually don't realize how big of",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 23,
      "start_timestamp": "00:00:46",
      "start_timestamp_seconds": 46.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=46"
    }
  },
  {
    "text": "what they are. We have bid ask last those were all your just general pricing tools. Then we have kind of the stereotypical options tools. So Delta gamma theta Vega row. I like to see all of them realistically and a lot of people actually don't realize how big of an impact some of these have. And it's also really good to be able to see these different Greeks at different delta's different strikes. Even when we're comparing across put calls at the same delta taking a look at theta between the two overall, it's really interesting stuff and it integrates into a lot of my strategies in different ways. From there, we have open interest and then volume for those that don't know the difference between these two. Very simple volume is how many transacted today open interest is how many remain open at the end of the day. So volume can be in an out open interest is what's remaining day over day. Then we also have the implied volatility probability of in the money and probability of a touch. One quick admin note here fun fact is if you take a look at a Delta and this is a 30 delta if we take a look at the probability of in the money for the 13 days to expiration. I'm just using a short put here. It's the 4 2 35 and this has a 30.4 probability of in the money very, very close to this delta.",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 23,
      "start_timestamp": "00:01:41",
      "start_timestamp_seconds": 101.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=101"
    }
  },
  {
    "text": "is a 30 delta if we take a look at the probability of in the money for the 13 days to expiration. I'm just using a short put here. It's the 4 2 35 and this has a 30.4 probability of in the money very, very close to this delta. The problem with using delta is an approximation is that that relationship doesn't hold true over all periods of time and it actually breaks down the further out you go. For example, looking at a same 30 delta bit now we're 104 days out. If I look at probability of in the money, it's 33.3 it's a 3.3 variance, which doesn't sound like much, but that's 10 difference between these two numbers. The point being is it's a really common thing to use delta as approximation for in the money. I don't think that's going to break anything necessarily, but there is a difference and it's also going to change based on volatility. Valtility is very low right now. So these are actually the closest I've ever seen them in terms of the true probabilities to one another. It also changes the further out of the money and the money you go stuff like that. This is not a video about probabilities, but I do think it's a fun fact and it's why I like to have the same thing. It's not a good thing to do with the money. I think it's not a good thing to have a",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 23,
      "start_timestamp": "00:02:45",
      "start_timestamp_seconds": 165.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=165"
    }
  },
  {
    "text": "you go stuff like that. This is not a video about probabilities, but I do think it's a fun fact and it's why I like to have the same thing. It's not a good thing to do with the money. I think it's not a good thing to have a good thing to do with the money. The probability of delta and the probability of in the money and the probability of a touch because also common way to use probability of a touch is 2x the delta so that would give us 60 chance probability of a touch. It's actually 63.4 probability of a touch and this is for the 13 days to expiration. The point being is depending on your edge and what that looks like. Okay, so that kind of goes through when I like to see in the options change. The other thing is that I typically like to have at least 50 strikes and it's because if you trade more expensive products like spx, if you only use whatever the default is I think it's like 10. You like this is a 38 delta and a 44 delta on the call input side. You miss way too much. So I just leave 15 and that's typically pretty good. If I'm trading really wide box spreads or something sometimes I have to open it up more, but in general is pretty good. So I think it's a really good way to use options statistics. This is",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 23,
      "start_timestamp": "00:03:45",
      "start_timestamp_seconds": 225.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=225"
    }
  },
  {
    "text": "way too much. So I just leave 15 and that's typically pretty good. If I'm trading really wide box spreads or something sometimes I have to open it up more, but in general is pretty good. So I think it's a really good way to use options statistics. This is super useful. The current IV percentile. It is really important to note that this is actually incorrect. The IV percentile is not what they're reporting here. Oh, they actually changed it. I think. They sure haven't so this is actually IV rank. They I've wrote into them a bunch of times. But this says current IV percentile. This is actually IV rank. You can tell I'm not going to use IV percentile on rank right now. I have other videos on that. But there is a difference between the two and the time. It's going to be the most exposed is when there's a big move in the underlying. But that's what's going on here. But I do like to use that not this part specifically, but I do like to use IV high low. And I also like to use HV percentile IV like all of those are pretty decent tools. I also have them on the charts. So I don't need them, but it depends on war. I'm looking at things sometimes this is an easy way for me to check it out. Then over here. This is kind of a unsung hero side of this, but there's",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 23,
      "start_timestamp": "00:04:38",
      "start_timestamp_seconds": 278.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=278"
    }
  },
  {
    "text": "decent tools. I also have them on the charts. So I don't need them, but it depends on war. I'm looking at things sometimes this is an easy way for me to check it out. Then over here. This is kind of a unsung hero side of this, but there's actually some pretty cool stuff in here. So you can take a look at the volume of calls versus puts. You can look at it for different time frames. You can take a look at also the delta transaction bands. It's kind of useful stuff to look for anomalies. You have to get used to looking at these numbers to understand what's weird. But once you follow this for a little while, you can kind of eyeball that stuff pretty quick. Like today, for example, it's no big surprise to me to see a lot more puts, not a lot, but notably more puts than calls transacting. That's pretty common, but there's periods where you'll see that invert same thing with the breakdown of delta's. You can get a feel for how they typically transact essentially. Then there's the Valtility sizzle indexes. That's essentially like a TD Ameritrade version of like unusual volume. I don't use this as an index much, but the put call ratio. I do. That's actually useful tool. Then going down a little bit further, we have time and sales. I typically put this up in that other chart that I showed you, but you can",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 23,
      "start_timestamp": "00:05:39",
      "start_timestamp_seconds": 339.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=339"
    }
  },
  {
    "text": "like unusual volume. I don't use this as an index much, but the put call ratio. I do. That's actually useful tool. Then going down a little bit further, we have time and sales. I typically put this up in that other chart that I showed you, but you can also see it in here, which is kind of useful. You can see if something was a spread itself. You can also kind of tell even if orders are submitted separately what they are. It also tells you where there's some big orders if you want to check that out. So I'm actually a pretty big fan and a lot of people also don't know that you can filter here. So you can take a look if you want to look at a specific exchange. If you want to just look at calls puts a specific time series. So if you just wanted to see what transacted today, so on and so forth. Again, it's a pretty robust tool that a lot of people don't don't fully take advantage of and it's because they don't know it's there. Then down here product depth. This is one of my favorite tools. I use this a lot and a lot of people don't, which is also a bummer. This shows us a lot. So right now I have it split out by call and put volume, but you can combine them into an average. You can look at just one, just the",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 23,
      "start_timestamp": "00:06:41",
      "start_timestamp_seconds": 401.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=401"
    }
  },
  {
    "text": "I use this a lot and a lot of people don't, which is also a bummer. This shows us a lot. So right now I have it split out by call and put volume, but you can combine them into an average. You can look at just one, just the other or just out of the money versions. But here's what's cool. You can look at volume, which is super common for me to take a look at. This is where you can see where things are centralizing. I actually talk about this also in the zero DTE videos because you can see how much zero DTE volume there is. Take a look. It shows you the expiration right here and that's still the majority of the volume that we're seeing on a daily basis. But here's some of the other cool stuff. You can look at open interest so you can see where things are remaining open and take a look at how big the put open interest is compared to the call open interest. It's literally two X like almost precisely, which is pretty crazy. Significant puts you there. But here's some other cool stuff. Applied volatility. So if you're a volatility trader, you can actually start to see the volatility time series. You can also see the surface. It's not 3D because it's not necessarily giving you the extra view. But nonetheless, you're able to do it by isolating off of the actual dates, right? You can",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 23,
      "start_timestamp": "00:07:37",
      "start_timestamp_seconds": 457.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=457"
    }
  },
  {
    "text": "if you're a volatility trader, you can actually start to see the volatility time series. You can also see the surface. It's not 3D because it's not necessarily giving you the extra view. But nonetheless, you're able to do it by isolating off of the actual dates, right? You can clean some of the series up so you don't have too many. The point being is you can get the implied volatility, you can get the strike and the moneyness and then you can also figure out the DTE off of here. It's just not as neat as the 3D version. But it's still here, which is kind of cool. So yeah, this is a really, really cool spot to take a look and tinker with. And then yeah, let's move on now. I'm not going to go through 4X. I'm not going to go through futures. Active trader. This is another useful tool specifically. If you intraday trade, so I like to set it up with an Ichimoku cloud for intraday stuff sometimes macd sometimes not. At all of the specific indicators and tools I use really depend on what I'm doing. But the main thing is I like to have a chart over here and then I like to have the order book open over here because when the market's open, you can actually see where orders are resting, how big they are, all that kind of stuff. And then pairstrader. This is a really great place to",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 23,
      "start_timestamp": "00:08:37",
      "start_timestamp_seconds": 517.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=517"
    }
  },
  {
    "text": "to have a chart over here and then I like to have the order book open over here because when the market's open, you can actually see where orders are resting, how big they are, all that kind of stuff. And then pairstrader. This is a really great place to set up a way to compare different products to one another. So in this example, you can see that I have a comparison on the left hand side for Walmart and Target. The way I have this split up is into three sections. The left hand side is combining them into a ratio. And then the right to I typically would mimic whatever is over here to look at them individually. So for example, if we're looking at Walmart and Target, I would drop Walmart over here, Target over here. And then you can see how they move in relation to one another across the same time frame. It's a useful tool for me, but I keep the T.A. over here super simple. I just use some moving averages and linear regression channels. But what I really like to do is look at all the different correlation time frames. So I have correlations built out for three days, five days, 10 days, 30 days, 60 days, 90 days, so on and so forth. It allows me to very quickly assess correlation across different time frames if I'm looking for some sort of pairstrader. Now down to the analyze tab for",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 23,
      "start_timestamp": "00:09:34",
      "start_timestamp_seconds": 574.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=574"
    }
  },
  {
    "text": "I have correlations built out for three days, five days, 10 days, 30 days, 60 days, 90 days, so on and so forth. It allows me to very quickly assess correlation across different time frames if I'm looking for some sort of pairstrader. Now down to the analyze tab for the risk profile. This lets you see open positions. This not a whole lot to adjust in here, modify, but this is one of my favorite things to use anyways. You can include commissions or not. I typically include exclude depending on the strategy, but I typically exclude and then just track it on my own. And then for the different lines, you can actually view day by day steps. It doesn't have to be just off of one expiration cycle. There's a lot of really cool tools in here. The probability analysis. This gives you a probability of cone. You can look at either in the money or a touch. And then you can also change the probability range. So this is a one standard deviation move. So this is telling you this is a one standard deviation probability of SPX falling within these time bands by these specific dates. And that's what this vertical axis is. Well, really it's the X axis, but I'm sorry, these vertical lines, it's showing you the different expiration cycles. So the Y axis is actually the price. Now, economic data. This is another spot. A lot of people don't know about, but",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 23,
      "start_timestamp": "00:10:31",
      "start_timestamp_seconds": 631.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=631"
    }
  },
  {
    "text": "dates. And that's what this vertical axis is. Well, really it's the X axis, but I'm sorry, these vertical lines, it's showing you the different expiration cycles. So the Y axis is actually the price. Now, economic data. This is another spot. A lot of people don't know about, but you can come in here and look at a lot of really interesting things. So we go take a look at commercial banking. And we could maybe look at federal fund sold and securities purchased for all commercial banks. The point being is some of these were like really extreme specific stuff. But some of them are actually really, really useful. So you can look at house price indexes, which this is super useful. If you don't use this, you can look at it for different time frames, different aggregation periods. You can change it from linear to log rhythmic scale. You can do all sorts of cool things in here. Really cool spot. Think back. I don't typically use within here. I typically go to on demand, which is in the top right corner. You can't totally see it because my stuff's in the way, but it's right below the X button, essentially to close the platform. You'll see a button that says on demand. That's really cool to this is where you get to use the historic data, but trade it as if it were live, which is also very, very cool. Fundamentals, this is like a must.",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 23,
      "start_timestamp": "00:11:30",
      "start_timestamp_seconds": 690.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=690"
    }
  },
  {
    "text": "the X button, essentially to close the platform. You'll see a button that says on demand. That's really cool to this is where you get to use the historic data, but trade it as if it were live, which is also very, very cool. Fundamentals, this is like a must. So if we wanted to look at Nvidia, which is just, you know, the talk of the town flying through the roof. I set this up to take a look at a bunch of different things, but I like to include it automatically populates all this different data for you. You can look at it on an annual basis, a quarterly basis. And then even down here, it goes through the different details on how it did in the past earnings, what, why it did, what it did, what are some of the key trends within the individual product and industry and then down at the bottom. It actually breaks down the percentage of market cap, what individual segments, how they institute that market cap. So for example, computing and networking is 56.9 of the stocks market cap. And then it can even break it down into sub sectors and it can even give you essentially historic trends, but then forward price projections huge, really, really useful stuff. And then earnings for those that don't know, I track earnings very closely. And you can take a look at either all of these different earnings, you can see how it did",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 23,
      "start_timestamp": "00:12:36",
      "start_timestamp_seconds": 756.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=756"
    }
  },
  {
    "text": "it can even give you essentially historic trends, but then forward price projections huge, really, really useful stuff. And then earnings for those that don't know, I track earnings very closely. And you can take a look at either all of these different earnings, you can see how it did before earnings, how it did at earnings, it tells you essentially what the date was down at the bottom, which you can't totally seeks it's cut off. But then you can see what the actual earnings was, what Wall Street was projecting. This is also super common, by the way, where the actual trend above Wall Street, it's because of the way that the earnings system is structured. I have a video on that. I'll actually link for you because it's such a fucked up system that you can't trust, but nonetheless, I digress, you can still track a lot of stuff. You can see how the at the money straddle did what IV HV did. If you track earnings the way that I do, this is probably one of the most useful tools that you have at your disposal to quickly synthesize. Then there's all the different scans, essentially, I'm not going to go through all those, but you can either use like some of your personal scan queries, you can use public scan queries. And you can just tinker with a lot of different stuff. I typically stay in stock hacker, which allows me to look through stocks.",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 23,
      "start_timestamp": "00:13:38",
      "start_timestamp_seconds": 818.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=818"
    }
  },
  {
    "text": "I'm not going to go through all those, but you can either use like some of your personal scan queries, you can use public scan queries. And you can just tinker with a lot of different stuff. I typically stay in stock hacker, which allows me to look through stocks. And then what I like to do, as you'll notice is I have a bunch of columns set up. This allows me to see a ton of information super quickly. So I have all these different fundamental indicators. I also have columns for technical analysis indicators that are custom think scripts like is it above a 50 day, am a is it above the 150 day is the 50 day slow positive. All of those kinds of things. And then we have the market watch tab. This allows us to look at the different indices, the different sectors, all different kinds of breakdowns of the publicly available products for us to trade. I like to see what's in different sectors. This is a really convenient way to do that. So if you're curious what's in the SP 500, here you go. This is where you see it. And then if you want to know it's in communication services specifically great click there. Now you know. And you can continue to dive in further and further based on the sectors sub sectors sub sectors so on and so forth. Now, if we go over to tools. I don't really use this",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 23,
      "start_timestamp": "00:14:34",
      "start_timestamp_seconds": 874.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=874"
    }
  },
  {
    "text": "you want to know it's in communication services specifically great click there. Now you know. And you can continue to dive in further and further based on the sectors sub sectors sub sectors so on and so forth. Now, if we go over to tools. I don't really use this for much of anything, but you can upload your think scripts. You can look at different ones. You could check out their different videos like all that kind of stuff. So there is value over here. Same thing with the education center. I don't use this that much. But I know that they bake everything into this, which is really cool. Let's talk about charts real quick. In general, I like to use different time frames to take a look at different hypothesis. So I have all of these different time frames quickly baked in so that I can quickly bounce between different ones based on what I'm trying to trade. So for example. So some other things you'll notice I almost always have linear regression channels. These are one of my favorite tools. I have an entire video that walks through linear regression channels. So I'll link to that in the notes below. A couple of other things I do like to include earnings in the chart and dividends. It kind of gives me just some general context, which I find useful. Then down below for the sub graphs. I have volume volume average. Then I have a MAC",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 23,
      "start_timestamp": "00:15:30",
      "start_timestamp_seconds": 930.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=930"
    }
  },
  {
    "text": "in the notes below. A couple of other things I do like to include earnings in the chart and dividends. It kind of gives me just some general context, which I find useful. Then down below for the sub graphs. I have volume volume average. Then I have a MAC D histogram and then the MAC D two lines. It kind of gives me a little better fidelity when I'm using MAC D. It's not always this, but sometimes so. And then I always have IV HV plots for different time frames. I have specific calculators that let me look at in Shreday IV more effectively because this essentially IV is going to update end of day here. Whereas HV would update throughout the day. That's just a movement of the underlying. And then this last sub graph that you see is actually all broad market data. This actually isn't tied to this individual stock at all. So down here, I have things like tick train average weighted train. I have different VIX future months. So I can see if we're in contango back rotation how steep it is. And then I also have net highs lows and then advanced decline cumulative average. So those are just breath indicators for the broad market. Now back up here in the main chart section. There's a few other things that you'll see. So I already told you about the linear regression channels. I have a volume profile, which I really, really like.",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 23,
      "start_timestamp": "00:16:36",
      "start_timestamp_seconds": 996.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=996"
    }
  },
  {
    "text": "decline cumulative average. So those are just breath indicators for the broad market. Now back up here in the main chart section. There's a few other things that you'll see. So I already told you about the linear regression channels. I have a volume profile, which I really, really like. And I always put it kind of in the background. I overlay it on the chart so that it's not in my way. And if you're curious how to do that, you go to at its study. And then these are the settings essentially that you want to set up. So I don't have it on the expansion. If you do that, that's when you're going to have like that split chart, which I don't like. And then some of the other things is just changing the opacity so that it's not like super in your face. And I also like to change the color of the profile itself so that it's not quite as loud. But then I get rid of essentially all this other stuff. I don't have the value areas. I don't have the low profile, the high profile. Just kind of showing you the overall parameters of it. I don't use any of that stuff because it's just extra noise. I just want to see the profile itself, which is right here. And then I always have moving averages. So I tinker with different time frames a lot, but typically it's going to be a short",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 23,
      "start_timestamp": "00:17:39",
      "start_timestamp_seconds": 1059.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=1059"
    }
  },
  {
    "text": "of it. I don't use any of that stuff because it's just extra noise. I just want to see the profile itself, which is right here. And then I always have moving averages. So I tinker with different time frames a lot, but typically it's going to be a short term either a nine day 10 day 11 day right now my short term is a nine day. And this is an SMA. And then here we have a 22 day EMA exponential moving average. And then this third one that you see, let me try to isolate it so that you can clearly here we go. This is a 50 day EMA. And then this one's almost always a 150 or 200 right now. It's a 200 EMA. I like to use these different moving averages because also it's very educational for a lot of different things. But it's most of what I have on my chart is pretty simple in nature. Like if you think about it. And I purposely keep it that way because there's a lot of stuff out there. And I find this stuff to work pretty well. Sometimes I'll add things like anchor VWOPs, Bollinger bands, but more often than not. This is going to be the setup. And then at the top, I have different labels. These are all think scripts. And I have things for implied volatility percentile in rank, which I already told you before. But then I also plot out",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 23,
      "start_timestamp": "00:18:44",
      "start_timestamp_seconds": 1124.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=1124"
    }
  },
  {
    "text": "Bollinger bands, but more often than not. This is going to be the setup. And then at the top, I have different labels. These are all think scripts. And I have things for implied volatility percentile in rank, which I already told you before. But then I also plot out the expected moves in a dollar and percentage amount. And I also have like the average daily range and average true range. So I have the percent we move today, the five day average daily range. I think are with different time frames on the ADR and the ATR. And then we have the high low for the weekend for the month. Again, this is just kind of giving us general context around things. At the money, put call ratio. So what strike, what expiration we're using and what is the put call ratio. And then this is actually a pretty cool can slim tool that I found and modified a little bit, but it pulls in the earnings per share you over a year, the quarter over quarter, the return on equity. How far we are off of highs, are we above the 200 day EMA with an additional 2 and then the relative strength ratios. So this is kind of just like a cool little canceling tool for specific stocks that you would run that in. And then I also have how correlated is it to the spy. This uses different time frames. It's completely customizable to what",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 23,
      "start_timestamp": "00:19:49",
      "start_timestamp_seconds": 1189.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=1189"
    }
  },
  {
    "text": "2 and then the relative strength ratios. So this is kind of just like a cool little canceling tool for specific stocks that you would run that in. And then I also have how correlated is it to the spy. This uses different time frames. It's completely customizable to what you want. And then the relative strength. I also have this slaved against the spy. So that's most of what I have on my chart. If you have any specific questions in there, let your boy now happy to take a look. But otherwise, this is a really cool platform. I'm happy to dive way more into detail. There's a lot of other stuff. This just scratches the surface. We didn't get into watch list. We didn't get into watch list columns. We didn't get into pretty much any of these side panel tools, which there's actually a lot of really cool things that I like to use in here. So happy to do that if you guys are interested in the future. But otherwise, let me know what you thought. Don't forget like subscribe share with some friends. We're trying to grow out here. We're coming up on 12k. I'd love to hit 15k by the end of the year. That's my goal. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 23,
      "start_timestamp": "00:20:50",
      "start_timestamp_seconds": 1250.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=1250"
    }
  },
  {
    "text": "I'd love to hit 15k by the end of the year. That's my goal. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "mdhbae8WXgI",
      "title": "thinkorswim Guide for Options Trading - Tips & Tricks",
      "url": "https://www.youtube.com/watch?v=mdhbae8WXgI",
      "upload_date": "",
      "duration": 1318.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 23,
      "start_timestamp": "00:21:40",
      "start_timestamp_seconds": 1300.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mdhbae8WXgI&t=1300"
    }
  }
]