[
  {
    "text": "Risk management for traders, it's not what you think. The vast majority of people really don't understand what this means or what it looks like. So we're going to do two things. The first thing is I'm going to show you real examples of what retail traders think about when it comes to risk management. And then the second thing is I'm going to walk you through exactly how I manage risk in an active trading portfolio. I've been doing this since 2007. So let's take a quick look and baseline on what the Godfather himself says about risk. The first rule of an investment is don't lose. And the second rule of an investment is don't forget the first rule. And that's all the rules there are. Well, there it is. Couldn't say it better myself. And if you couldn't hear it because it's kind of an old video, essentially he's ingest saying the first rule is don't lose. And the second rule is don't forget rule of number one, which is don't lose. Why is that the case? Why does that matter so much? Well, let's take a look. This is a projection for compound growth. And I'll get my head out of the way in a second. But I want to show you something. We have this first portfolio on the left hand side. We're looking at 100,000 in total. And it has all positive years. Although one year it went 10 10 2 10 5. So",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=0"
    }
  },
  {
    "text": "get my head out of the way in a second. But I want to show you something. We have this first portfolio on the left hand side. We're looking at 100,000 in total. And it has all positive years. Although one year it went 10 10 2 10 5. So overall, we had a pretty slow year. Let's compare that to portfolio three, which is right underneath my head here. We have 30. So this return is three times the highest return that portfolio one saw. Then we had a 25 drawdown than 12, 14, 12. All of the returns here except for that one single negative return is higher than what we saw in portfolio one yet portfolio one walked away with more money 142,000 550 compared to 139. You might be saying, oh, that's pretty close. It is. But if you take a look at the impact of this drawdown and what this has on our compounding returns long term, this is catastrophic. You have a portfolio that absolutely has crushed the first portfolio yet it walks out ahead. Look at the average return 8.6 compared to 7.4. 1.2 higher in portfolio three is the average return, including this giant negative year. However, the compound annual growth rate lacks quite a bit. This is why you should care about risk and this is why you need to completely change the way you think about risk because it's not something that we just figure out while we're in the",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 18,
      "start_timestamp": "00:00:54",
      "start_timestamp_seconds": 54.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=54"
    }
  },
  {
    "text": "this giant negative year. However, the compound annual growth rate lacks quite a bit. This is why you should care about risk and this is why you need to completely change the way you think about risk because it's not something that we just figure out while we're in the trade and hope it works out because let's take a look at how that goes. This is from Wall Street Betts and it's using that joke. I'm never going to financially recover from this, right? But this portfolio is down 91.6 or for this specific trade. Okay, you might be saying, yeah, Wall Street Betts, we expect that from the degenerates. You're not wrong. Well, let's take a look at day trading. This is another scenario, really bad trade. Long story short, this person took a stop and then it ran up away from them and you could tell this was a whole emotional cycle because the last part I highlight here, how do you guys deal with such things? Do you recommend I take a break for a few days? Again, that's all fueled by emotion and you might be saying, okay, well, that's day trading. Obviously, day trading is a perilous sport. Still degenerates. You're not wrong. Maybe we look at investing. Should I jump or not? When I first saw this, I thought it was a suicide thing, but it's not actually what it says. Let me slide this down just a little bit so you could",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 18,
      "start_timestamp": "00:02:07",
      "start_timestamp_seconds": 127.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=127"
    }
  },
  {
    "text": "is a perilous sport. Still degenerates. You're not wrong. Maybe we look at investing. Should I jump or not? When I first saw this, I thought it was a suicide thing, but it's not actually what it says. Let me slide this down just a little bit so you could see easier. What this actually says is I'm 64 and freaking out over having 60 of my funds in a money market right now in the market is rising. I won't need 30 that it is a the point being completely emotionally fueled process here. And this is pretty reasonable. Let's take it another step further. Here we have dividend investing. What most traders would consider to be the pretty mellow group, the ones that are looking for a little bit of money. And this guy's saying solid value and dividend play for Verizon. This is what the fucking chart looks like for Verizon. Where's the value? This person is contorted because of the yield that they see in Verizon and they see dollar signs. So what I'm hoping you're picking up in these different examples is it's not really as much as we like to joke about it. It's not just the degenerates that have a problem here. It's most people. Let's talk about what this looks like. The very first concept I want to cover here is why risk? Why do we care about this? And it's exactly what Warren Buffett said. If you don't have any principle",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 18,
      "start_timestamp": "00:03:07",
      "start_timestamp_seconds": 187.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=187"
    }
  },
  {
    "text": "not just the degenerates that have a problem here. It's most people. Let's talk about what this looks like. The very first concept I want to cover here is why risk? Why do we care about this? And it's exactly what Warren Buffett said. If you don't have any principle to invest, there's nothing to do. You don't belong in this conversation. So risk managing risk is what makes sure you have investable income so that you could do something so that you can invest. I can't invest zero dollars. The way you stop from going to zero dollars is through managing risk. But what I just showed you there are some of the psychological effects that people have when we talk about things like risk for traders, stuff like the disposition effect, which is when we have a propensity to look at winning potential and losing potential differently. And what I mean by that is we have the tendency to sell winners way too fast. And we hold losers way too long because we like ealing like we're winning. It strokes our egos. But we don't like feeling like we lost or that we're wrong. It hurts our egos. So we don't want to have these losing positions. And then you couple this with loss aversion. And this essentially means that we are more sensitive to losing things than gaining by a factor of about two. I encourage you to read both of these studies. But the whole idea",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 18,
      "start_timestamp": "00:04:08",
      "start_timestamp_seconds": 248.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=248"
    }
  },
  {
    "text": "So we don't want to have these losing positions. And then you couple this with loss aversion. And this essentially means that we are more sensitive to losing things than gaining by a factor of about two. I encourage you to read both of these studies. But the whole idea of loss aversion, and this is a biological in context, loss aversion exists because biologically, if you have enough to survive, if you lose something off of that, that could mean you die. Whereas if you have enough to survive and you could gain a little bit, maybe live slightly more comfortably, but if you lose it, you die. You don't really care about gaining whatever it is as much. So both of these run rampant. And this doesn't go into everything else like ego and stuff like that. But those are important notes nonetheless. However, I want to talk to you about how I think about risk and then how I actually deploy risk management efficiently. So in this case, we have a question that we have to solve for by ourselves. Our goals versus the risk we want to take. If your goal is to make 100 on your account by the end of the year, double your goal or double your account to pretty fucking aggressive goal. Does that mean that you can't have that as a goal? Now you can have it. But what does that mean in terms of the risk you are going to",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 18,
      "start_timestamp": "00:05:16",
      "start_timestamp_seconds": 316.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=316"
    }
  },
  {
    "text": "your account by the end of the year, double your goal or double your account to pretty fucking aggressive goal. Does that mean that you can't have that as a goal? Now you can have it. But what does that mean in terms of the risk you are going to have to take in order to even stand a shot at that goal? Massive. So based on the way you think about your goals, your risk is going to have to correspond to it one way or the other. So for me personally, when I was aggressively growing my account, I looked at 15 per year as my goal. I broke that down to monthly targets to give me a little bit of context on how much risk I should be taking on a monthly basis in order to hit those targets. So the idea is 15 per year. For me, it was doable and it didn't force me to take so much risk that I wouldn't be able to significantly scale this. And my compound annual growth rate has maintained pretty far above that at least by 5, but nonetheless, that was my goal. And the reason why I picked that goal is to really control the rest of all these psychological functions that we have. So now let's get into what my approach actually looks like. First, we need to understand the idea of expected return. And then we need to overlay that with the idea of tails,",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 18,
      "start_timestamp": "00:06:15",
      "start_timestamp_seconds": 375.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=375"
    }
  },
  {
    "text": "picked that goal is to really control the rest of all these psychological functions that we have. So now let's get into what my approach actually looks like. First, we need to understand the idea of expected return. And then we need to overlay that with the idea of tails, because here's the deal. Every single time you're in a trade and you start messing with your win rates or your loss rates, the average wins and losses are going to change. Same thing if you mess with the average loss size. And I'll get into an example in a second. And if you need kind of more details on what this all looks like, I have a video, I'll link to it in the notes below. But if we decide that we want to have lower average loss sizes, we want to reduce the size of our average loss, it means we're going to have more losses because you are managing that risk. You obviously are going to pass that same threshold on your way to whatever your max losses. However, my entire approach to managing risk is to maximize this relationship. And what that means is the following. We can take a look at a data set, something like this, whatever you want. This is just data from Yahoo Finance. And I get an idea of how something moves. What you're going to look at is going to vary drastically by your strategy. But I'm giving you an",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 18,
      "start_timestamp": "00:07:19",
      "start_timestamp_seconds": 439.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=439"
    }
  },
  {
    "text": "We can take a look at a data set, something like this, whatever you want. This is just data from Yahoo Finance. And I get an idea of how something moves. What you're going to look at is going to vary drastically by your strategy. But I'm giving you an example of how we could use data to make choices that make sense. So we could say, what are the number of occurrences where over the course of a weekend, we move x percentage. And what does that mean for whatever the strategy is that we're running? What I'm trying to do is look for the outliers. I want to find the instances where we have either big moves or little moves. And I want to use that to inform how I treat stops. So stops can be problematic. If you integrate stop losses in any sort of trading strategy, you are going to increase your loss frequency. Your average loss may go down because our stop is decreasing how big our loss can get to. But we're going to have more of them. So we don't want to do that because if you modulate your loss rate and your loss size too much such that it starts to overwhelm your winning side of the equation, now you are managing risk fine, but you're running a negatively expected strategy. We don't want that. So to find what works is pretty simple. What you need to do is take a look",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 18,
      "start_timestamp": "00:08:18",
      "start_timestamp_seconds": 498.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=498"
    }
  },
  {
    "text": "loss size too much such that it starts to overwhelm your winning side of the equation, now you are managing risk fine, but you're running a negatively expected strategy. We don't want that. So to find what works is pretty simple. What you need to do is take a look at your strategy. A great example is my earnings strategies. I like to look at at least the past eight quarters, if not 10 to 12, depending on the time frame of the product that I'm looking at. And I want to see how it moves in general. Then I find trading a short straddle for this earnings plate to capture that variance risk premium, which if you're not sure what that is, there's a link in the notes below. As I do that, I know that I have break even points. My short straddle gives me room to the upside and the downside. But if it moves too much, I lose money. I don't want to have a stop where if it moves enough to hit my stop, but then it comes back in profitable, well, now that's just hurting the profit side of my equation, I don't want that. So what I need to do is I need to look at the strategy and say, okay, if it moves 10 up looking at a specific product, what is the frequency that it moves 10 up, but then would fall back into my profit zone? And if it's a",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 18,
      "start_timestamp": "00:09:25",
      "start_timestamp_seconds": 565.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=565"
    }
  },
  {
    "text": "that. So what I need to do is I need to look at the strategy and say, okay, if it moves 10 up looking at a specific product, what is the frequency that it moves 10 up, but then would fall back into my profit zone? And if it's a really low percentage, like 2 of the time, I now just found the tail. So if I set up a stop for that strategy in that specific product that cuts off the tail, it will help improve my average loss, meaning decrease it without impacting my loss rate too much. It will still impact it slightly, but not too much. This is exactly the way we need to think about managing risk. It's not just a path hazard approach. We need to be thoughtful about what we're picking and how it impacts our expected return. So what I like to do is this down here. I like to use two different bands for most positions. And then I break down risk into portfolio and individual positions. So first, let's take a quick look at this band concept. I have a position on an apple, and you can see what this band concept actually looks like. Up here is my first band, and then down here is my second band. I'm bullish. So what this means is I actually have to move this first band up to 177.61. So this is a prime time example. I'm going to remove this one,",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 18,
      "start_timestamp": "00:10:23",
      "start_timestamp_seconds": 623.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=623"
    }
  },
  {
    "text": "band concept actually looks like. Up here is my first band, and then down here is my second band. I'm bullish. So what this means is I actually have to move this first band up to 177.61. So this is a prime time example. I'm going to remove this one, and I'm going to slide this alert up to 166. And this or 176, this is just to manage profits. And this is, well, 166.50. Sorry, we got to screw it up even more because it's making good money. Making good money. So I'll actually move it up to 177. And then this is exactly how it works. So this first band is when I take a hard look at the position. And I say, is this still working the way that I want it to work in this case? It's yes. And let's say Apple hit this first band. I would make a choice. I would say, do I want to get out here? Yes or no? And if it's no, I need a really good reason to stay in. Then I have my second band, which I also need to move up now to here. And this second band is essentially if it hits this, I'm done. I'm out no matter what. What this does is protects the verity. It makes sure that I am mentally overriding this entire concept of the disposition effect in loss of version. I'm not allowing these losing trades to expand because I",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 18,
      "start_timestamp": "00:11:38",
      "start_timestamp_seconds": 698.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=698"
    }
  },
  {
    "text": "band is essentially if it hits this, I'm done. I'm out no matter what. What this does is protects the verity. It makes sure that I am mentally overriding this entire concept of the disposition effect in loss of version. I'm not allowing these losing trades to expand because I don't like to look at them. I'm not allowing winning trades to get cut too short because I know where my loss is going to be managed. So in this case, specifically with Apple, I don't have to take the trade down to say, Oh, I want to lock in this profit. I'm scared that it's going to lose. I don't care. I'll let the profits run because I have a loss plan for the downside to make sure that I don't allow this winning trade to turn into a losing trade. This allows me to let winners run, but make sure that I'm managing the losses at a point where it makes sense based on the individual strategy and the expectancy for that strategy. So to kind of round this idea out, I'm going to give you some of the things that I like to look at for both the portfolio and then individual trades. So for the portfolio, I like to look at these kinds of metrics. I'm going to look at beta weighted delta. This essentially takes all of the different delta's of your portfolio and it puts them into a single language, so to speak, into",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 18,
      "start_timestamp": "00:12:32",
      "start_timestamp_seconds": 752.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=752"
    }
  },
  {
    "text": "the portfolio and then individual trades. So for the portfolio, I like to look at these kinds of metrics. I'm going to look at beta weighted delta. This essentially takes all of the different delta's of your portfolio and it puts them into a single language, so to speak, into a single ticker so that you know what your exposure is in terms of size across all your different positions. And then you also know how it's going to behave. I typically like to beta weight either against the spy or the SPX. And it lets me know like if I have 1000 positive beta weighted delta's into the SPX, then I know all of my positions are essentially behaving like long 1000 shares of SPX. So by doing this, it gives me a lot of fidelity over the risk profile and how I feel about it. And then I'm also going to look at the gamma theta Vega for the entire portfolio. All of this kind of gives me an idea of sizing and correlation. That's why I like beta weighted delta so much, but it's not just the correlation of the individual directional risk of each strategy, but also theta also Vega, how fast is my portfolio set to move? These will give me some of those details. Then for the portfolio, we already talked about this kind of this goal. That's the return target for my entire portfolio. So I keep that in mind on an annual",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 18,
      "start_timestamp": "00:13:35",
      "start_timestamp_seconds": 815.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=815"
    }
  },
  {
    "text": "also theta also Vega, how fast is my portfolio set to move? These will give me some of those details. Then for the portfolio, we already talked about this kind of this goal. That's the return target for my entire portfolio. So I keep that in mind on an annual and a monthly basis. And I make sure that the risk that I have out at any given point in time serves that broader purpose. Then I'm always going to make sure that there are if there are any events coming up, I'm aware of it, depending on how much risk I have out in the portfolio, but things like FOMC rate statements. That's kind of a big deal right now. So in those instances, I want to make sure I know it's coming up for the week so that I can adjust the portfolio as needed. And then PNL bands. I set PNL bands for the portfolio. Now a really important note, let's say if I want to make 100 in a month in my portfolio and I make that 100. That does not mean I stop. That does not mean I stop. It just means I get more selective. There are no real time frames when it comes to the market. The market doesn't really know if it's Tuesday or Wednesday. The point being is if you're making money and things are working, why would you stop just because you hit a number this month? What happens next",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 18,
      "start_timestamp": "00:14:25",
      "start_timestamp_seconds": 865.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=865"
    }
  },
  {
    "text": "selective. There are no real time frames when it comes to the market. The market doesn't really know if it's Tuesday or Wednesday. The point being is if you're making money and things are working, why would you stop just because you hit a number this month? What happens next month when it's a slow month? This is how in aggregate, I'm able to come out ahead is I set these PNL bands to guide me, but they absolutely do not specifically the profit bands. It doesn't mean I stop. And then the loss bands, this is just in case I'm asleep at the wheel and then I'm not doing a good job managing the risk in individual positions so that I don't allow my entire portfolio to start losing way too much because again, if you'll recall, the impact of these compounding returns is massive if we have a big drawdown to big impact. We don't want to see that. So that's kind of how I set up for the portfolio and you have to figure out what's right for you. If your goal is to make 100 over the course of a year, you better believe that you better be ready for some big portfolio movements to get there, but it doesn't necessarily mean that it makes sense and you have to figure out what suits your goals and what risk you're comfortable with. Now for individual positions, I care about the expectancy of the individual strategies, as",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 18,
      "start_timestamp": "00:15:17",
      "start_timestamp_seconds": 917.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=917"
    }
  },
  {
    "text": "better be ready for some big portfolio movements to get there, but it doesn't necessarily mean that it makes sense and you have to figure out what suits your goals and what risk you're comfortable with. Now for individual positions, I care about the expectancy of the individual strategies, as I mentioned, this helps inform how I'm going to allocate to the position. This stops me from automatically adding to losing trades, which is really common for people. So I'm going to allocate things out via an initial allocation and then I have subsequent scaling targets. So for something like this, I have a video that talks about portfolio management. I'll also link to that in the notes below so you can see more about it. Every single position is going to have those PNL targets, profit and loss for the loss size or loss side. I'm going to use those bands. I'm going to have two bands. Sometimes it's based on support and resistance. Sometimes it's based on the value of an option. It really comes down to the individual strategies. So you have to see what makes sense for your strategy. And then again, I'm always, always, always going to pay attention to events. What events are coming up for that individual position because those can have a really big impact on the overall profitability. So if you made it to the end, like, subscribe, be an outlier and comment down below what you learned if anything new.",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 18,
      "start_timestamp": "00:16:20",
      "start_timestamp_seconds": 980.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=980"
    }
  },
  {
    "text": "going to pay attention to events. What events are coming up for that individual position because those can have a really big impact on the overall profitability. So if you made it to the end, like, subscribe, be an outlier and comment down below what you learned if anything new. I'll catch you guys later.",
    "metadata": {
      "video_id": "mDPYNyp23y4",
      "title": "Why Most Traders SUCK at Risk Management",
      "url": "https://www.youtube.com/watch?v=mDPYNyp23y4",
      "upload_date": "",
      "duration": 1055.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 18,
      "start_timestamp": "00:17:17",
      "start_timestamp_seconds": 1037.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mDPYNyp23y4&t=1037"
    }
  }
]