[
  {
    "text": "What's up everyone? Somebody shot me a DM asking what I thought of the volatility movement in GameStop today. And as you know, I'm here for a happy to take a look. So overall, to me, it looks like volatility is cratering. That's what I'm seeing. I'm, it's essentially across the chain at this point. And we're seeing broad approximation to the longer term expectations. This front expiration cycle used to look really, really hot. And now it does not. Let me show you what I'm talking about. So the 16th of June, this was over the weekend on Sunday, right before the shareholders meeting. And Vol was expanding pretty meaningfully up to 280. That's a lot. One over a weekend, two for a shareholders meeting. A shareholders meeting typically isn't that big of an event. You'll see that for really big news releases, biotech phase trial stuff like that. So the fact that it was getting that high was very interesting to me. We had the shareholders meeting, which a lot of you informed me that the perception was it was a nothing burger, not much was talked about. And as I looked through the transcript, I could see what you mean. There was very little said, it was all kind of broad brush stroke muscle movements, not a lot of specifics. So I now better understood that perspective. And that led to volatility contracting massively. But I actually thought this was going to contract more. The fact that",
    "metadata": {
      "video_id": "MdxKwCONOxk",
      "title": "GME Options: Analyzing the Recent Volatility Drop",
      "url": "https://www.youtube.com/watch?v=MdxKwCONOxk",
      "upload_date": "",
      "duration": 669.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MdxKwCONOxk&t=0"
    }
  },
  {
    "text": "what you mean. There was very little said, it was all kind of broad brush stroke muscle movements, not a lot of specifics. So I now better understood that perspective. And that led to volatility contracting massively. But I actually thought this was going to contract more. The fact that I dropped 76 points is big. But for something that elevated that much for that event and that little seemingly came out of that event, I really thought this was going to fall more than it did, but it didn't. It still created it a lot, but not that much comparative to what I was expecting. Then fast forward to today, after the close, we have now fall down at 160. This is the jump I would have expected after that shareholders meeting going from 280 to 160. That was kind of maybe not all the down 160, but pretty close to that. So the fact that we have now gone from two of four down to 160, it just tells me that the market is not expecting anywhere near the same volume of movement that we were expecting before. And that also permeates to some of these surrounding expiration cycles that used to also be above 200. Now there are 150 140 much, much, much lower. So if we take a look at the options chain, I want to highlight a few things for you all. The very first one is when I look at the closer strikes to",
    "metadata": {
      "video_id": "MdxKwCONOxk",
      "title": "GME Options: Analyzing the Recent Volatility Drop",
      "url": "https://www.youtube.com/watch?v=MdxKwCONOxk",
      "upload_date": "",
      "duration": 669.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MdxKwCONOxk&t=0"
    }
  },
  {
    "text": "cycles that used to also be above 200. Now there are 150 140 much, much, much lower. So if we take a look at the options chain, I want to highlight a few things for you all. The very first one is when I look at the closer strikes to at the money. So like 100 strikes, I'm seeing right now, open interest is still approximating towards the put side. And if we include all of the strikes, it still is, but not as much. So it tells me lots of people are playing with really far out of the money options. If we're talking looking at strikes that are 100 points away from the at the money. So there's still very heavy call skew here, surprisingly so to me, to be honest with you. Now the other thing that I want to highlight is if we centralize this to the near term explorations, you'll notice that of that 1.2 million that we saw across all chains, all strikes, about 818,000 of that call, oh, I is within this week and next week. Massive. Same thing for the put skew. This is still essentially two to one called a put, which is not normal. Normally it would maybe not be inverse. You don't necessarily see that big of a disparity, but you typically would see more puts than calls. The markets tend to hedge the downside. So this is still topical to me. The fact that I see this much",
    "metadata": {
      "video_id": "MdxKwCONOxk",
      "title": "GME Options: Analyzing the Recent Volatility Drop",
      "url": "https://www.youtube.com/watch?v=MdxKwCONOxk",
      "upload_date": "",
      "duration": 669.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MdxKwCONOxk&t=0"
    }
  },
  {
    "text": "which is not normal. Normally it would maybe not be inverse. You don't necessarily see that big of a disparity, but you typically would see more puts than calls. The markets tend to hedge the downside. So this is still topical to me. The fact that I see this much skew over this short of a time period, because as soon as we start going further out, let's say that we go out instead to like this 19 July 16 August and October, take a look at the call OI and the put a lie like it's much closer to parity. And as you go further and further out that parity then eventually inverts like I would expect it to in normal markets. So again, that tells me that the market is kind of pricing in the action from within October, essentially, that's what I see here so far. The other thing that we got to take a look at is the transaction volume for today calls and puts and it's very similar to what we saw yesterday. Much more call volume, but again, quick recap, we got to get rid of between the market, we can't tell if those are buying to open or selling to open, but we can make some inferences based on if it transacts at the bid or the offer. And in this case, the fact that 39 of the calls transacted today were at the bid or below, that tells me that those are",
    "metadata": {
      "video_id": "MdxKwCONOxk",
      "title": "GME Options: Analyzing the Recent Volatility Drop",
      "url": "https://www.youtube.com/watch?v=MdxKwCONOxk",
      "upload_date": "",
      "duration": 669.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MdxKwCONOxk&t=0"
    }
  },
  {
    "text": "are buying to open or selling to open, but we can make some inferences based on if it transacts at the bid or the offer. And in this case, the fact that 39 of the calls transacted today were at the bid or below, that tells me that those are again, mostly sales, more likely than not. So that's again, short calls, whether they're part of a covered call, which the disposition for the holder of that would still want it to go up. I suspect a lot of those are probably covered calls, but this is still people looking to capitalize on some of the volatility that we're seeing and they are trading at least the options to the downside. That's why we would be selling calls at the bid or below. Now for the puts, it's kind of an even split between potentially selling and buying today. So not much to take away from there necessarily. Again, more volatility focused if they're selling puts in my opinion, because if you think GameStop or something like that is going to fly to the upside, you wouldn't sell a put. You would rather just either buy the stock by calls, something that would give you that uncapped upside potential. Because if you sell a put, you don't get that. So in this case of people selling puts, I don't necessarily perceive that as massively bullish. To me, it seems more like we're just trying to squeeze this cratering volatility out,",
    "metadata": {
      "video_id": "MdxKwCONOxk",
      "title": "GME Options: Analyzing the Recent Volatility Drop",
      "url": "https://www.youtube.com/watch?v=MdxKwCONOxk",
      "upload_date": "",
      "duration": 669.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MdxKwCONOxk&t=0"
    }
  },
  {
    "text": "something that would give you that uncapped upside potential. Because if you sell a put, you don't get that. So in this case of people selling puts, I don't necessarily perceive that as massively bullish. To me, it seems more like we're just trying to squeeze this cratering volatility out, which is actually a pretty smart play now from a technical perspective. You have to be really, really careful doing stuff like that in products like GameStop because it can go crazy at any point and you don't want to get stuck off sides with naked options trying to trade a little bit of all, but I can see why it's happening. The other things we got to take a look at super quick are the volume. And if we see the volume transactions across the chains across the strikes, again, reflects what we see here, but I want to hone us in on these near term. And that actually surprises me. 319,000 call volume compared to 149,000 put volume. Now, a lot of this can be potentially closing transactions. Actually, yesterday, when I was taking a look at this at this near term expiration, I was really surprised to see this. The 30s actually bid up. I think there's right like 66,000 or something like that. Yesterday, if I'm not misremembering. So there definitely was a lot of sale volume that came in, but there is even more buy volume that came in, which I find interesting people are",
    "metadata": {
      "video_id": "MdxKwCONOxk",
      "title": "GME Options: Analyzing the Recent Volatility Drop",
      "url": "https://www.youtube.com/watch?v=MdxKwCONOxk",
      "upload_date": "",
      "duration": 669.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MdxKwCONOxk&t=0"
    }
  },
  {
    "text": "see this. The 30s actually bid up. I think there's right like 66,000 or something like that. Yesterday, if I'm not misremembering. So there definitely was a lot of sale volume that came in, but there is even more buy volume that came in, which I find interesting people are doing the cheap out of the money options thing. And if I take a look at the volume again today, now 42,000 contracts, these expire in three days and the market's not trading tomorrow. So this is kind of crazy to me. This is, and I don't see the catalyst right now that these people could be attempting to swing for the fences on, but that's not a trivial amount of volume. And again, the volatility is now starting to abate quite a lot. So I don't see that the market even sees whatever catalyst these people might be attempting to play. Now, again, the other thing to keep in mind is a lot of this can be sale volume, which so far looks to be the case. And that could just be people trying to capture these exceedingly exceedingly high premiums, especially if they're covered with shares. Last thing we'll take a look at is the implied volatility. Let's take a look at the smile. We'll look at the out of the monies for this. And I'm going to clear out a bunch of the different series to kind of decrease the noise. And what do you notice, even",
    "metadata": {
      "video_id": "MdxKwCONOxk",
      "title": "GME Options: Analyzing the Recent Volatility Drop",
      "url": "https://www.youtube.com/watch?v=MdxKwCONOxk",
      "upload_date": "",
      "duration": 669.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MdxKwCONOxk&t=0"
    }
  },
  {
    "text": "we'll take a look at is the implied volatility. Let's take a look at the smile. We'll look at the out of the monies for this. And I'm going to clear out a bunch of the different series to kind of decrease the noise. And what do you notice, even compared to yesterday, really, let me dump this one for now. Even compared to yesterday, I see a couple of massive changes. So if spot price right now is about right there, kind of where the vertical axis is of my cursor, the first thing I notice is that we are seeing way more pale side, vol put side, which again, makes a ton of sense for a quick recap on how to read this. This is only looking at out of the money options. So all of the puts that are below the current price are out of the money and all the calls above are out of the money. So when we're looking to this side of that cursor, these are all out of the money. And if you'll notice, even compared to yesterday, we started seeing a normal smile. Now it's actually puts you where we're seeing way more of all on the put side, which again, that starts pricing and downside expectation. The call side is flattened out quite a lot. And that's a really steep smile at this point. Whereas if we look out to the 28 June's slightly different story, they are a little",
    "metadata": {
      "video_id": "MdxKwCONOxk",
      "title": "GME Options: Analyzing the Recent Volatility Drop",
      "url": "https://www.youtube.com/watch?v=MdxKwCONOxk",
      "upload_date": "",
      "duration": 669.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MdxKwCONOxk&t=0"
    }
  },
  {
    "text": "way more of all on the put side, which again, that starts pricing and downside expectation. The call side is flattened out quite a lot. And that's a really steep smile at this point. Whereas if we look out to the 28 June's slightly different story, they are a little bit more normal. I see kind of the way that this tailor is up and out, you have to be careful with the way that you read this. And the reason why you have to be careful is because since the stock is trading at 24 bucks, it caps out to the downside. So this might look like it's just really seemingly long tail. Part of that is because it's crazy that people are transacting all the way out here. But it's also because this just has a natural floor of zero. So there's just not much below. You can go here. So it might kind of skew your perception of what you're looking at a little bit. So I want to call that out. So what's the takeaway from here? Expiration for 21 June is pricing in put volatility premiums, more normal skew, more normal smile approximation. 28 June is still more flat than I would expect to see. And there absolutely is still some call skew. So for example, if I take back to current price and I go to the top of the the put volume, I'm sorry, volatility on the downside. I want you to look",
    "metadata": {
      "video_id": "MdxKwCONOxk",
      "title": "GME Options: Analyzing the Recent Volatility Drop",
      "url": "https://www.youtube.com/watch?v=MdxKwCONOxk",
      "upload_date": "",
      "duration": 669.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MdxKwCONOxk&t=0"
    }
  },
  {
    "text": "is still more flat than I would expect to see. And there absolutely is still some call skew. So for example, if I take back to current price and I go to the top of the the put volume, I'm sorry, volatility on the downside. I want you to look over to the right and see how much of the blue line peaks up above. It's actually kind of behind my head. Let me light out of the way. Take a look at the line to the right hand side. So notice how if we go to the right, there's still call premium all the way, all the way super high. So essentially, this is what we would be calling severity. The market's pricing in slightly. If there is a catastrophic massive upside move, they're demanding a premium for these really far out of the money options because that's still not fully off the table. Otherwise, you would not see this here. And again, I'm not here to spread hype or fide. I am here to do my absolute best to look at the data and just share what I'm seeing so that you can make whatever inferences from it you choose. But that's why that's there like that. If we look at other products, you don't see that kind of upside skew like this. Now again, look at the put side. There's nothing even close. The market is not scared quite literally at all about a massive up move",
    "metadata": {
      "video_id": "MdxKwCONOxk",
      "title": "GME Options: Analyzing the Recent Volatility Drop",
      "url": "https://www.youtube.com/watch?v=MdxKwCONOxk",
      "upload_date": "",
      "duration": 669.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MdxKwCONOxk&t=0"
    }
  },
  {
    "text": "you choose. But that's why that's there like that. If we look at other products, you don't see that kind of upside skew like this. Now again, look at the put side. There's nothing even close. The market is not scared quite literally at all about a massive up move this week in terms of what it's pricing into the malls. As always, if you have any questions, just let me know. I'm happy to take a look at this stuff. Anytime I enjoy looking at options, I do it literally all day every day. So I'm here for it. And also, thank you guys for helping me understand some of the memes. Rurinkiti is dropping. It's kind of fun learning more about the lower. I'll see you guys on the next one.",
    "metadata": {
      "video_id": "MdxKwCONOxk",
      "title": "GME Options: Analyzing the Recent Volatility Drop",
      "url": "https://www.youtube.com/watch?v=MdxKwCONOxk",
      "upload_date": "",
      "duration": 669.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MdxKwCONOxk&t=0"
    }
  }
]