[
  {
    "text": "Trading Bitcoin using options is about time. So for a long time, you can only really gain exposure through the underlying itself, which is fine. I still have an outright Bitcoin holding in and of itself. But as you all know, I'm an options trader and there's really, really awesome opportunity in something like Bitcoin. So I want to talk about a covered strangle strategy that I'm going to be running in Bitcoin for the rest of this year. And I'm going to provide to you periodic updates. But first, I want to introduce you to the position, why it is what it is, how I'm setting it up, what I've done so far, and why I'm using the ticker that I'm using, which is I bit. So first things first, quick overview of the covered strangle. I will throw a couple links in the description so you could check out the actual coverage strangle option strategy. I have a whole playlist on it. So you can get into detail. This is not going to get into that. I'm just going to provide you a quick overview. So you know what we're talking about. And there's three components in its mature form, but it's not always all three components. It can be one, two, three, like that, different components, two, it can be on at a given point in time. So the base position, the primary profit mechanism, is going to be being long as security, and we're trying to",
    "metadata": {
      "video_id": "mFhrX7bFrxM",
      "title": "Trading Bitcoin with Options",
      "url": "https://www.youtube.com/watch?v=mFhrX7bFrxM",
      "upload_date": null,
      "duration": 625.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mFhrX7bFrxM&t=0"
    }
  },
  {
    "text": "mature form, but it's not always all three components. It can be one, two, three, like that, different components, two, it can be on at a given point in time. So the base position, the primary profit mechanism, is going to be being long as security, and we're trying to play direction. That's the base position that is the primary profit mechanism for the straight. Then there are two additional components where we include options. We have a ratio covered call, and then we have cash secured puts. This option component allows us to include a volatility and a theta aspect to our position. And it also allows us to dollar cost average into the underlying using a variable entry point. So what that means is we might go out into the broad market and buy the shares outright. That's a lot of times how it will start. Then we can use things like cash secured puts. I've referred to them as satellite positions. What that means is the base position, long equity, and we will have cash secured puts, but the cool part about cash secured puts is you can move them. So if something starts rolling over and you're like, well, I still want to add into it, but it seems like we're in a bit of a decline. So I might roll the short puts so that I can get a better basis as I continue to scale into the underlying. Now, the entire premise of this",
    "metadata": {
      "video_id": "mFhrX7bFrxM",
      "title": "Trading Bitcoin with Options",
      "url": "https://www.youtube.com/watch?v=mFhrX7bFrxM",
      "upload_date": null,
      "duration": 625.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:00:59",
      "start_timestamp_seconds": 59.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mFhrX7bFrxM&t=59"
    }
  },
  {
    "text": "you're like, well, I still want to add into it, but it seems like we're in a bit of a decline. So I might roll the short puts so that I can get a better basis as I continue to scale into the underlying. Now, the entire premise of this thing is that you are trading something that you want to hold. The way to think about it is that if I was setting up a buy and hold portfolio, this is something I would want in it, meaning whatever the ultimate sizing that the trade gets, the entire purpose behind the rest of this is just to optimize that holding. So the way that this works is I'll show you my little tracker. You've probably seen different versions of this. And what I'm sampling is a 125,000 allocation to Ibit. What this ultimately means is I essentially would be prepared to buy 125,000 of Ibit in a portfolio as shares and just hold it. That's what the allocation is. Then there's utilization, which is how much of that total allocation I'm using at a given point in time, which is right now 80,000. The reason why I'm using this amount of money is I actually have a bigger position that's not part of this. I'm breaking out part of the bigger position just like I'm doing in the leveraged ETFs to use this as an example for us to learn together about the strategy, how I operate it over",
    "metadata": {
      "video_id": "mFhrX7bFrxM",
      "title": "Trading Bitcoin with Options",
      "url": "https://www.youtube.com/watch?v=mFhrX7bFrxM",
      "upload_date": null,
      "duration": 625.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:02:17",
      "start_timestamp_seconds": 137.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mFhrX7bFrxM&t=137"
    }
  },
  {
    "text": "amount of money is I actually have a bigger position that's not part of this. I'm breaking out part of the bigger position just like I'm doing in the leveraged ETFs to use this as an example for us to learn together about the strategy, how I operate it over a longer period of time. So I'm purposely picking amounts of money that is probably more relatable to people for the strategy so that you can understand the sizing of things relative to this amount of money. So that's a quick overview of the position itself. Now I want to spend a few minutes talking about why there's a specific opportunity in something like Ibit. And the reason why I like Ibit is because it allows me to play an overall bullish disposition on Bitcoin. I am bullish on Bitcoin longer term. It also adds an interesting correlation relationship with equities. So if we pop over to the platform and we take a look at the relationship here between something like Bitcoin futures and the E minis futures, the SP 500 futures contracts, which I want you to take a look at is the different correlation values for different periods of time. And the first thing that you'll notice is that the correlations are kind of all over the place, right? We can see 90 day correlations. They tend to be pretty strong. 60 day correlations tend to be strong. Well, we can also see in shorter term time frames",
    "metadata": {
      "video_id": "mFhrX7bFrxM",
      "title": "Trading Bitcoin with Options",
      "url": "https://www.youtube.com/watch?v=mFhrX7bFrxM",
      "upload_date": null,
      "duration": 625.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:03:30",
      "start_timestamp_seconds": 210.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mFhrX7bFrxM&t=210"
    }
  },
  {
    "text": "of time. And the first thing that you'll notice is that the correlations are kind of all over the place, right? We can see 90 day correlations. They tend to be pretty strong. 60 day correlations tend to be strong. Well, we can also see in shorter term time frames that the correlations can invert and actually offset one another. And to help, you know, see this point a little more clearly, if we grab two charts of this, just so that you can see over a longer term time frame, you can see that there's general alignment in terms of positive drift, but the composition of the moves is very different. So the reason why this fits the portfolio well is because it doesn't inherently add in a hedge, but it does add a slightly different correlation to the portfolio. And then this also allows me to capture the volatility of something like Bitcoin, because again, if we take a look first at Ibit itself, you can see that it's a really volatile ticker. The current implied volatility in it is 63. As a raw number, that's high. Now we don't have enough data on it yet, because it's so new, to give it an implied volatility percentile and an implied volatility rank. So it'll be a little time before we actually have those metrics for Ibit, but on a gross dollar amount, that's not an insignificant amount of volatility, which is great to be able to trade that",
    "metadata": {
      "video_id": "mFhrX7bFrxM",
      "title": "Trading Bitcoin with Options",
      "url": "https://www.youtube.com/watch?v=mFhrX7bFrxM",
      "upload_date": null,
      "duration": 625.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:04:49",
      "start_timestamp_seconds": 289.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mFhrX7bFrxM&t=289"
    }
  },
  {
    "text": "so new, to give it an implied volatility percentile and an implied volatility rank. So it'll be a little time before we actually have those metrics for Ibit, but on a gross dollar amount, that's not an insignificant amount of volatility, which is great to be able to trade that and options provide me access to that. If I'm trying to trade the volatility and not through the directional price movement, you can't do that with futures outright, which is one of the benefits. So what is Ibit? Well, I like Ibit for a few different reasons, one, because it's liquid, meaning it's being accepted by the market. Two, if we take a look at the overall holdings for it, it's pretty straight forward. And I'll show you that here, if we go into the holdings, you can see that it's essentially holding Bitcoin, a little bit of cash, and then some Bitcoin US dollars currencies. The reason why this is so useful is because you're getting direct exposure to Bitcoin. Now, again, this isn't the same as actually holding the coin out right. Obviously, but for a tradable vehicle, this is not gaining exposure to individual minors, Bitcoin production facilities and whatnot, because now your position takes on a different shape, rather than simply behaving like Bitcoin, the Bitcoin itself outright, you're gaining exposure to the operations of Bitcoin mining, which includes operational expenses for producing the Bitcoin. They have to have places in order to put all of",
    "metadata": {
      "video_id": "mFhrX7bFrxM",
      "title": "Trading Bitcoin with Options",
      "url": "https://www.youtube.com/watch?v=mFhrX7bFrxM",
      "upload_date": null,
      "duration": 625.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:05:59",
      "start_timestamp_seconds": 359.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mFhrX7bFrxM&t=359"
    }
  },
  {
    "text": "facilities and whatnot, because now your position takes on a different shape, rather than simply behaving like Bitcoin, the Bitcoin itself outright, you're gaining exposure to the operations of Bitcoin mining, which includes operational expenses for producing the Bitcoin. They have to have places in order to put all of their machinery in order to mine Bitcoin and stuff like that. It adds other flavors to it, which I'm indifferent to, but for this position itself, I just want to access the Bitcoin and this provides it. So let me give you a quick update on what the position sits at right now so that going forward, you'll kind of have an idea of what I'm talking about. So the position as it sits is 1000 shares of Ibit at a basis of 5455. And then I have two tranches of puts out one expiring this week, actually on 17, Jan, and then the other in 21 Feb. I have a two lot at the 52 strike and then I have a three lot at the 49 strike respectively. So both of those trades are on and sitting and then you can see that I have a ratio series of short calls against it. I'm short six calls against the 1000 shares and the basis for the strike price for the calls which are out in 21 Feb is the 60. So this here is essentially the tracker that I will be using to show you how I'm scaling into",
    "metadata": {
      "video_id": "mFhrX7bFrxM",
      "title": "Trading Bitcoin with Options",
      "url": "https://www.youtube.com/watch?v=mFhrX7bFrxM",
      "upload_date": null,
      "duration": 625.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:07:21",
      "start_timestamp_seconds": 441.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mFhrX7bFrxM&t=441"
    }
  },
  {
    "text": "short calls against it. I'm short six calls against the 1000 shares and the basis for the strike price for the calls which are out in 21 Feb is the 60. So this here is essentially the tracker that I will be using to show you how I'm scaling into the trade. I originally had a much smaller allocation in mind and then after talking to some people, we arrived at this being a better allocation use 125K. So I needed to add a bunch more, which is why a lot of this went on. You can see that there's some existing options trades that have already come on, come off not really worth highlighting that. But as the position sits right now, we can see that I have a total of 1,000 in credit in sitting from the put side. I have 1,100 in credit from the call side of things. These are both open trades. Now the cool part about this is if you take a look at the underlying asset from when I started this, it was 5725. It's currently at 54 83. So the percent change on that is about 4.2 to downside. Yet my position is realized with profit to the upside. We have a realized PNL of 365. But then we also have a total PNL of up 2,800. Again, that's nothing to write home about. But this happens through scaling into the trade and then also having a little bit of realized PNL",
    "metadata": {
      "video_id": "mFhrX7bFrxM",
      "title": "Trading Bitcoin with Options",
      "url": "https://www.youtube.com/watch?v=mFhrX7bFrxM",
      "upload_date": null,
      "duration": 625.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:08:37",
      "start_timestamp_seconds": 517.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mFhrX7bFrxM&t=517"
    }
  },
  {
    "text": "is realized with profit to the upside. We have a realized PNL of 365. But then we also have a total PNL of up 2,800. Again, that's nothing to write home about. But this happens through scaling into the trade and then also having a little bit of realized PNL coming from the option side. And then right now there's way more potential PNL coming from the option side, which will help to position a lot. So this is the game plan to trade I bit with the coverage triangle. And again, you guys will be able to follow along. And if you have any questions, let me know. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "mFhrX7bFrxM",
      "title": "Trading Bitcoin with Options",
      "url": "https://www.youtube.com/watch?v=mFhrX7bFrxM",
      "upload_date": null,
      "duration": 625.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:09:46",
      "start_timestamp_seconds": 586.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mFhrX7bFrxM&t=586"
    }
  }
]